{
  "companyName": "UiPath",
  "companyTicker": "PATH",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/02/uipath-path-q3-2023-earnings-call-transcript/",
  "content": "UiPath (PATH 0.16%)\nQ3 2023 Earnings Call\nDec 01, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings, and welcome to the UiPath third quarter fiscal 2023 earnings conference call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation. [Operator instructions] Please note that this conference is being recorded.\n\nI will now turn the conference over to our host, Kelsey Turcotte of investor relations. Thank you. You may begin.\n\nKelsey Turcotte -- Investor Relations\n\nGood afternoon, and thank you for joining us today to review UiPath's third quarter fiscal 2023 financial results, which we announced in our earnings press release issued after the close of the market today. On the call with me are Daniel Dines, UiPath's co-founder and co-chief executive officer; Rob Enslin, co-chief executive officer; and Ashim Gupta, chief financial officer. Rob will start the discussion and then turn the call over to Daniel. After that, Ashim will review our results and provide guidance.\n\nThen we will open the call for questions. Our earnings press release and financial supplemental materials are posted on the UiPath investor relations website, ir.uipath.com. These materials include GAAP to non-GAAP reconciliations. We will be discussing non-GAAP metrics on today's call.\n\nThis afternoon's call includes forward-looking statements about our ability to drive growth and operational efficiency and our financial guidance for the fiscal fourth quarter 2023. Actual results may differ materially from those expressed in the forward-looking statements due to many factors, and therefore, investors should not place undue reliance on these statements. For a discussion of the material risks and uncertainties that could affect our actual results, please refer to our annual report on Form 10-K for the year ended January 31, 2022, and our other reports filed with the SEC, including our quarterly report on Form 10-Q for the period ended October 31, 2022, to be filed with the SEC. Forward-looking statements made on this call reflect our views as of today.\n\nWe undertake no obligation to update them. I would like to highlight that this webcast is being accompanied by slides. We will post the slides and a copy of our prepared comments to our investor relations website immediately following the conclusion of this call. As a reminder, we priced in local currencies and have experienced a significant foreign exchange headwind as we progressed through this fiscal year.\n\nNow, I would like to hand the call over to Rob.\n\nRob Enslin -- Co-Chief Executive Officer\n\nThank you, Kelsey, and good afternoon, everyone. Thank you for joining us. We are pleased with third quarter results, which delivered both top-line growth and margin expansion. ARR was $1.110 billion, driven by net new ARR of $67 million.\n\nExcluding the FX headwind of $22 million, total ARR grew 38% year over year. Revenue was $263 million. Excluding the FX headwind of $22 million, revenue grew 29% year over year. Non-GAAP operating income was $18 million, a third quarter record, reflecting our focus on disciplined capital allocation and cost management.\n\nDuring the quarter we added new logos like Petco, Nautilus, and Wisconsin Energy, and saw particular strength in our healthcare and telecommunications verticals. A great new logo in the quarter was Orica, one of the world's leading mining and infrastructure solution providers. In a competitive win over two stand-alone vendors, one in enterprise automation and one in test automation, and working with Accenture as an advisor, Orica selected UiPath, because of our ability to deliver both enterprise and test automation in one platform. With C-suite sponsorship, Orica is planning to migrate and scale their existing enterprise automation program with UiPath and utilize test suite to enable successful upgrades of their SAP S/4HANA.\n\nThird quarter is also the federal year-end, and under new leadership, we are very pleased to report that we delivered a strong quarter in that vertical, including expansions with the U.S. Air Force and the U.S. Department of Homeland Security. Customers appreciate both the quantifiable and intangible business outcomes that our automation platform can deliver, including business risk reduction, improved customer and employee experience, profitable growth, and the ability to more effectively allocate resources.\n\nThese are outcomes that resonate across lines of business and up to the C-suite. For example, one of North America's largest third-party logistics firms, Total Quality Logistics, is using document understanding, software robots and task mining across their organization. In just two years automation has delivered both strong ROI and helped them grow, including driving revenue in a new line of business without adding headcount. Going forward, Total Quality Logistics also plans to implement process mining to identify macro processes that can benefit from automation.\n\nIt has been a busy few months for the team and we are executing well across all of the key strategic initiatives that we laid out at our Investor Day. These include extending our market leadership with our largest platform release, 22.10, which Daniel will talk about in more detail; driving platform adoption with our market-leading capabilities in every stage of the automation lifecycle; making significant progress upleveling our go-to-market model, which I will talk about in more detail next; announcing some great technical and go-to-market partnerships, and lastly, to build out our world-class team, with the addition of Lee Hawksley, who will lead our APAC go-to-market team. Now, I would like to take a few minutes to update you on the progress we've made on our go-to-market initiatives. All of this work is designed to enable our teams to sell higher into organizations, define business outcomes that resonate with C-level executives and accelerate customer time to value.\n\nTo make sure we are on the right track we tested many of these new approaches in our North American market and we're very pleased to see they played an important role in several notable third quarter wins. Next step is a formal roll-out across the geos, much of which we started at the beginning of the fourth quarter when we launched new packaging and pricing designed to simplify our go-to-market motion. This approach brings together the solutions necessary to more quickly realize the advantages of broader platform adoption in a one-line-item SKU. We also expect this pricing model to reduce friction in the purchasing process.\n\nWe formally introduced NorthStar, our new value-based selling tool. This prescriptive and predictive model helps our sales reps position the value of automation to customers through an engagement framework that defines economic value, the execution roadmap and best practices. It is a great tool to clearly position the differentiated, long-term benefits of automation delivered through our full platform of capabilities. We are also leveraging our extensive industry insights to align sales teams around verticals like financial services, healthcare, and TMT, where we have had good success to date and identified considerable white space to continue to grow in both new and existing customers.\n\nThe focus helped us close a third quarter expansion deal in the financial services vertical with Bank of New York Mellon Pershing, a UiPath customer since 2020. Through their implementation of UiPath, their automation program scaled quickly, improving both efficiency and risk mitigation across the firm, as well as their client experience by leveraging UiPath's software robots to process transactions more consistently. As a result of these positive outcomes, Bank of New York Mellon is now rapidly expanding to the full platform across their organization. And to give customers in these verticals even more tools for success, we are pilot -- piloting our first solution accelerator to provide them a starting point for their automation journey.\n\nWe are excited about solution accelerators and believe they will provide our customers with the technical know-how to help them complete their implementations significantly faster. With customer success always in mind, we continue to deepen our relationships with global GSIs and automation experts. At FORWARD 5 we announced our expanded partnership with EY, also one of the largest UiPath customers, that puts the partnership on par and at scale with their largest ecosystem partners. The strengthening of this global alliance is a testament to the trust that we have developed and their belief in the massive growth potential that the UiPath automation platform presents for global organizations.\n\nWe also continue to expand our technical ecosystem. During the quarter, we announced several strategic partnerships with major technology providers, including Microsoft, which named UiPath as their preferred enterprise automation partner, while we announced Microsoft Azure is a preferred cloud platform for UiPath. We plan to continue to collaborate and innovate together to bring automation solutions powered by Microsoft Azure to market. And Outsystems, to combine the power of the UiPath business automation platform with OutSystems' high-performance, low code.\n\nTogether, we expect to enable customers to securely and intelligently automate core processes and applications. One of the best proof points of our execution is the growth of our larger customer cohorts and this quarter we were very pleased that our cohort of customers over $100,000 in ARR increased to 1,711, including customers over $1 million of 201. For these customers, automation isn't just a tool they can use to reduce or eliminate tedious work, it's part of their strategy, growth plans, and operating model. I feel good about where we are in our journey to take this company beyond $1 billion.\n\nWe have the market-leading automation technology and platform, the right leaders putting the right go-to-market structure in place, and we are making the disciplined decisions that allow us to drive growth, increase productivity and expand operating margin. We are already seeing the positive impact of our work as we head into the fourth quarter and the team is focused on a strong close. I will turn the call over to Daniel to talk about our 22.10 platform release and newest innovation. Daniel?\n\nDaniel Dines -- Co-Founder and Co-Chief Executive Officer\n\nThank you, Rob. Good afternoon, everyone. Before I get started, I'd like to thank the UiPath team for their hard work and commitment to our customers and partners who recognize and appreciate your dedication to their success. In fact, one of the things I enjoy most about my role at UiPath is spending time with customers to understand where they are in their digital transformation journey and talk to them about the role automation can play in that evolution.\n\nGiven today's unpredictable operating environment and tightening budgets, automation is a powerful engine that directly addresses these challenges and changes the way organizations of all sizes operate and innovate. We had great platform expansions in the quarter, such as ManpowerGroup, a UiPath customer for four years. After successfully deploying automations in their finance department, they expanded to use our full platform in the quarter as they look to scale their automation program internally and deliver workforce solutions to their clients. Ultimately, platforms win, because integrated technology is easier to manage and drives faster time to value.\n\nWith market-leading capabilities in every stage of the automation lifecycle, our platform outcomes resonate with the C-suite and are a huge competitive advantage for us. A great example of platform adoption is a deal we closed with HCA Healthcare, one of the nation's leading healthcare providers. HCA has been a UiPath customer for two years with numerous software automations in production. In the quarter they expanded our partnership by adopting the entire UiPath platform in a multiyear agreement.\n\nComing out of our FORWARD 5 user conference and our most important platform release this fall, 22.10, momentum is building across the business. This release allows customers to automate more, faster, and with less friction, expand user and builder bases, and operate it all more efficiently and effectively. This recent platform release includes a preview of Studio Web, the latest member of our Studio family, which completes our cloud offering, further reduces the friction in ramping citizen developers, and provides a cross-platform developer experience. 22.10 also delivers the ability to build public-facing applications with UiPath apps, enhanced capabilities in process and task mining, and platform intelligence to help our software robots understand both structured data with document understanding, and unstructured data with the acquisition of Re:infer.\n\nThere's a massive amount of value to be captured by automating processes involving unstructured data. During the quarter, several customers added Re:infer, which we recently acquired and have renamed Communications Mining to their automation program. This includes a leading U.K. fund administrator and UiPath customer since 2019, that is planning to leverage Re:infer to drive efficiencies and improve customer experiences by automating tickets in their case management system for their HR, payroll, accounting and tax departments.\n\n22.10 also delivered enhanced capabilities for both automation suite and automation cloud, both of which helped drive triple-digit year-over-year growth in cloud ARR. One of our core tenets is flexibility of deployment to meet the customer wherever they are on their automation journey. This constant focus on innovation has won us recognition by thought leaders and industry analysts and we are proud of the recent reports from Everest Group and ISG. According to Everest Group's Robotic Process Automation Products PEAK Matrix Assessment 2022, we were named an RPA Leader for the sixth consecutive year and Star Performer in the Technology Provider Landscape.\n\nISG named UiPath a leader in their latest application development research focused on low-code/no-code software companies. This recognition reflects our commitment to category leadership and innovation across the platform. I am proud of what we accomplished in the third quarter and excited about the massive opportunity ahead. The need for automation is greater than ever before and I believe UiPath will continue to play a leading role in helping organizations not only thrive, but increase their competitive advantage.\n\nWith that, I will turn it over to Ashim.\n\nAshim Gupta -- Chief Financial Officer\n\nThank you, Daniel, and good afternoon, everyone. Unless otherwise indicated I will be discussing results on a non-GAAP basis and all growth rates are year over year. I also want to note that FX was a significant headwind to our results again this quarter. I will start by running through our third quarter and then provide fourth quarter guidance.\n\nThird quarter ARR totaled $1.110 billion, driven by net new ARR of $67 million. Because we sell in local currency, foreign currency fluctuations do not impact demand for our product, but do impact the translation of our results. On a year-over-year basis, FX was an approximately $10 million headwind to net new ARR, and for total ARR, FX was an approximately $22 million headwind. Excluding FX, total ARR grew 38%.\n\nWe now serve approximately 10,650 customers. As we shared at Investor Day, we are positioning the company to land and grow customers with a high propensity to invest in automation, while distributors will serve the lower end of the market. Moving on, our dollar-based net retention rate was 126%. Normalizing for FX and excluding the impact of Russian sanctions, our dollar-based net retention rate was 130%.\n\nAmericas continues to show strength as our dollar-based net retention rate outperformed relative to the rest of the world. Dollar-based gross retention of 98% continues to be best in class, underscoring the transformational business outcomes that customers achieve with our platform. Revenue grew to $263 million. Normalizing for the year-over-year FX headwind of approximately $22 million, revenue grew 29% year over year.\n\nRemaining performance obligations increased to $759 million. Normalizing for the year-over-year FX headwind of approximately $50 million, RPO grew 40% year over year. Current RPO increased to $441 million. Total gross margin was 86%, reflecting ongoing investments in support and cloud infrastructure as we scale that business.\n\nSoftware gross margin was 92%. Third quarter operating expenses were $209 million. We continue to focus on operational efficiency including our restructuring actions, hiring freeze, and tighter control of discretionary spend. GAAP operating loss of $67 million included $81 million of stock-based compensation expense.\n\nNon-GAAP operating income was $18 million, our strongest third quarter non-GAAP operating margin to date. Third quarter non-GAAP adjusted free cash flow was negative $24 million, reflecting timing of collections and prepaid vendor contracts that allow us to lock in favorable terms for UiPath in an inflationary environment. We have a very strong balance sheet, which is an important asset in the current operating environment, with $1.7 billion in cash, cash equivalents, and marketable securities, and no debt. Now, let me turn to guidance.\n\nWe guide what we see in the pipeline and assume that the current choppy macro environment and pressure from foreign exchange continue. Turning to the numbers. First, for fiscal fourth quarter 2023, we expect ARR in the range of $1.174 billion to $1.176 billion. This is an increase from prior guidance of $1.153 billion to $1.158 billion.\n\nWe expect revenue in the range of $277 million to $279 million. We expect non-GAAP operating income to be approximately $35 million, and we expect fourth quarter basic share count to be approximately 554 million shares outstanding. Finally, we will guide to first quarter and full year fiscal 2024 when we announce our fourth quarter results, but I want to highlight that we expect typical enterprise seasonality from the fourth quarter to first quarter in both net new ARR and revenue results. We delivered a solid third quarter as our durable financial model and strong balance sheet give us the resources to invest in long-term growth and drive sustained profitability, both of which are core to our go-forward strategy.\n\nThe team is focused on delivering meaningful outcomes for our customers, and we look forward to a strong close to fiscal year 2023. Finally, I would like to wish our employees and all of you a healthy and happy holiday season, and we look forward to speaking with many of you in the coming weeks. With that, I will turn the call over to the operator. Operator, please poll for questions.\n\nOperator\n\nThank you. And at this time, we will conduct a question-and-answer session. Please limit yourself to one question and one follow-up question. [Operator instructions] Our first question comes from Phil Winslow with Credit Suisse.\n\nPlease go ahead.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nHi. Thanks for taking my question I appreciate all the color, particularly on the go-to-market changes, which is really where I want to focus my question. Rob, obviously, you made some changes when you joined, and I wonder if you could walk us through just sort of your thoughts on call productivity versus just capacity in the sales force? How do you kind of think with these changes you are making sort of productivity should start to inflect? And then, similarly, how do you feel about sort of the capacity of the go-to-market push right now? And then just have one follow-up.\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah. Thanks, Phil. We feel good about the capacity we have got and aligns with the strategy we outlined at Investor Day, and we are starting to see real proof points around our strategy and how we are delivering that and the team is actually focused on really good delivery. So, if you look at, like, what I would say is, one of the best proof points of our execution is the growth of our customer cohorts.\n\nWhen you look at $100,000 in ARR. We have increased that to 1,711. And when you look at customers over $1 million now, it's up to 201. So, we feel good about the go-to-market, the segmentation and our execution and how far we have come in a relatively short period of time.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nGreat. And then, Daniel, you highlighted just efficiency that need to drive productivity as a catalyst for automation for companies, obviously, the dollar-based net retention continues to remain strong and it feels like that's resonating with the customer -- existing customers that already have proof points of success. But when you go to new customers that have maybe just starting their automation journey, what makes sort of the light bulb go off of sort of, why automation, why RPA in just your full hyper-automation suite is something they should lean into from a productivity standpoint?\n\nDaniel Dines -- Co-Founder and Co-Chief Executive Officer\n\nI think this is kind of the same motivation. As for existing customers, they drive -- close down -- they improve employees' productivity, they improve also customer satisfaction, and we are seeing meaningful new customers that are getting into automation by buying the entire platform. And I can -- for instance, in the case of Orica that I think Rob mentioned, the Orica -- our -- the power of our testing was instrumental into driving the adoption of the entire platform and it was the competitive takeout of two of our competitors. So, I would say that the benefit of automation is even more relevant in this environment for the new customers.\n\nOperator\n\nThank you. Our next question comes from Brad Sills with Bank of America Securities. Please go ahead.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nOh, great. Thanks so much, and it's great to see some of the early success with the changes in go-to-market. Maybe on that topic, please, Rob, if you could expand a little bit on where you have seen some success? I know it's early, but with some of these verticals you called out some of these solution accelerators. Are there any ones, in particular, you would call out, and are there any learnings from your success in those areas that you might be able to apply more broadly?\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah. Brad, some of its antidotal, because we are very early into actually the numbers. But I think -- first of all, I think the proof points around ATA, Bank of New York Mellon, and Orica are proof points of the NorthStar approach that we -- the value selling around NorthStar and then driving significant value and this speed to value is showing progress. We also have seen our solution packages.\n\nWe started to launch them significant interest. We don't have actually clear KPIs, but we are seeing significant interest. And I think our sales organization has more tools in the bag to deal with the environment we are operating in and they are doing really well around that. We see significant progress -- obviously, continue to see significant progress in the United States around that and we are starting to see with the team in Europe that's having benefit as well.\n\nAnd look, I mean, Orica is a world-class leading energy company based out of Singapore operating globally and shows that we are starting to see progress with our strategy globally as well.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nWonderful. Thanks. And then one for you, Ashim, if I may, please, on just the outlook that you provided at the Analyst Day for next year, ARR growth exiting the year at 20%. It's down quite a bit, I mean, this quarter, you are at 38% constant currency, you are guiding to 20, it looks like 27%, maybe 29% constant currency for Q4, so a pretty big deceleration.\n\nAre you assuming a worsening macro in that outlook or if you could just remind us what are you assuming in that number? Thank you.\n\nAshim Gupta -- Chief Financial Officer\n\nYeah. Brad, like, we discussed at Investor Day, the anchor points that we provided for next year assumes the current macro environment that we have all -- that we have been talking about and as well as the FX or the foreign exchange environment that we have also been seeing. We really see this as consistent from forward and our Investor Day until now. We will provide more of an update as we get into next year and report fourth quarter earnings.\n\nOperator\n\nOur next question comes from Mark Murphy with J.P. Morgan. Please go ahead.\n\nMark Murphy -- J.P. Morgan -- Analyst\n\nYeah. Thank you and congrats on the great margin progress. So, Ashim, I don't think you actually spent quite as much time on talking about macro issues tonight. And so, I am wondering if it would be logical to think that this period of Q3 and Q4 could represent the trough for the net new ARR.\n\nWhat I mean is, if it's declining here in this 25% to 40% range and then maybe there would be an opportunity to kind of improve on that as you get further into the repositioning and the repackaging and the go-to-market changes in the first half of next year. Is that -- as a general framework, is that a fair way to be thinking about the trending of the business? And then I have a quick follow-up.\n\nAshim Gupta -- Chief Financial Officer\n\nYeah, Mark, it's very consistent with what we have talked at Investor Day and Analyst Day. We look at the environment as consistent. So, we probably have talked less about it just in terms of the environment between Europe, APAC and Americas, we feel relatively the same environment as we talked about just a few months ago. In terms of our commitment to executing on the strategy that we laid out at Investor Day, we are all committed and actually excited about the progress that we are making around segmentation, solutioning, focus, identifying high-propensity customers.\n\nAll of those factors in our mind, we feel are going to yield positive results and that's what we are executing to. I would remind everybody just we are going to see typical seasonality as we get into next year between first quarter we mentioned in the script, but also first half, second half. But overall, we are pleased with the execution of the strategy and we do -- we are executing that strategy because we believe it will yield positive results.\n\nMark Murphy -- J.P. Morgan -- Analyst\n\nOK. Understood. And maybe as a quick follow-up for Rob and Daniel. Could you touch a little on the expanded Microsoft Azure relationship? I believe Microsoft said that UiPath is going to be one of their largest partners that's built on Microsoft technology, I think, they referred to it that way.\n\nWhat type of opportunity do you see with Microsoft and is that something that's helping you win business out there incrementally at this point?\n\nDaniel Dines -- Co-Founder and Co-Chief Executive Officer\n\nThanks for the question. Let me start and then Rob might add more color to it. I feel that we made a good bet on basing on having our technology built on the top of Microsoft Azure cloud that helps us drive create cloud offering that resonates with most of our customers. It really helps us to reduce the sales cycle when it comes to the cloud, it reduced the sales cost and it increased time to value to our customers.\n\nMicrosoft has been really a good partner for us, both on the technology innovation and partnering on the go-to-market side. So, we are really looking at a positive development on this front. Rob?\n\nRob Enslin -- Co-Chief Executive Officer\n\nI think that's good. Thanks, Mark.\n\nOperator\n\nThank you. And our next question comes from Raimo Lenschow with Barclays. Please state your question.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nThank you. Two quick questions. One on staying on partners, competitors, etc., and Rob, you spent, obviously, a lot of years at SAP. Like how do we have to think about the SAP relationship, a lot of your businesses is at SAP installed base, helping on process optimization, etc.\n\nSAP is making more noise about doing it themselves. Like how is that relationship evolving? That's my first question and then I have one follow-up for Ashim.\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah. Look, I mean, we -- first of all, I would say, you have got to look at our portfolio. Our portfolio, we are very strong in financials in healthcare. So, we have a broad portfolio that we go after.\n\nSo, it's not only our partnership with SAP that we are working on and we have got a partnership. We -- they utilize some of our technology. We obviously work closely with them and we continue to work closely with them because we believe we have a mutual benefit in helping customers add value and together with the customer base and the customer fit they have. We think there's an incredible value for our customers.\n\nBut that also includes other companies in that space as well. So we continue to progress. Key partnerships are clearly part of the strategy we laid out at Investor Day, and we continue to evolve that every quarter.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nOK. Perfect. Thank you. And then, Ashim, obviously, a lot of investors look at net new ARR added, and you had a really strong $67 million this quarter.\n\nIf I look at the implied number for Q4, it does seem different than what we saw in Q4 last year. Could you just kind of speak a little bit if there are specific factors that might drive that, I remember like a couple of years ago, we had the change in the year-end, etc., like just anything that we should know about or remember about Q4? Thank you.\n\nAshim Gupta -- Chief Financial Officer\n\nYeah. So, in Q4 we have a more pronounced impact from foreign exchange. I think that's the first notable point, Raimo. The reason for that is a lot of our renewable base, which obviously will renew at a potentially lower FX rate -- at the current FX rate, I should say.\n\nThat has a $20 million impact year over year. So, when you look at what we have implicitly guided at around $66 million and you add $20 million back for that, that takes you to $86 million. And then you take into account the macro -- the impact from the macro environment and we have been consistent in our guidance philosophies in terms of guiding what we see in front of us. That's kind of how you think about the components of the guide and the factor for why it is $66 million right now.\n\nOperator\n\nThank you. Our next question comes from Matthew Hedberg with RBC Capital Markets. Please go ahead.\n\nUnknown speaker -- RBC Capital Markets -- Analyst\n\nHey. This is Simran on for Matt Hedberg. Thanks for taking our questions. So, with the uncertainty you noted earlier about the current environment, has the tone of your customer conversations changed at all, and do you see more hesitancy with customers that are experiencing longer sales cycles?\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah. What we have been very clear about is we see a consistency between the quarters that we saw in Q2 into Q3, and we believe that we are actually managing it really well right now.\n\nUnknown speaker -- RBC Capital Markets -- Analyst\n\nGot it. And then also earlier, you announced an additional reduction in your workforce. How are you thinking about the reallocation of those budgets toward greater efficiency and execution and customer strategies?\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah. Good question. So, the restructuring was that we announced two weeks ago, I think. Part of the strategic discussions we had at Investor Day and the rollout.\n\nThat is a cross-functional restructuring that we have. It has very little impact, the minimum impact on our quota carriers and our go-to-market, and we continue to execute the go-to-market as we design this around the strategic initiatives.\n\nOperator\n\nThank you. And our next question comes from Keith Weiss with Morgan Stanley. Please go ahead.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nExcellent. Thank you, guys, for taking the question. Ashim, on the operating margins, you guys really outperformed kind of what the original guide was there. Is that all coming from the headcount reductions or is there more efficiency kind of improvements that are coming from other parts of the business? And how should we think about that kind of the potential for further progression there into FY '24 perhaps?\n\nAshim Gupta -- Chief Financial Officer\n\nYeah. So, not -- the headcount reduction, just to answer directly and then I will walk you through the operating margin, Keith. The headcount reduction was announced on November 15. So, what we announced had very little impact -- no impact on our third quarter results.\n\nWhen you break down and you look at how the operating margin came together, the first is the top line. The team did a great job on executing in the environment and so we outperformed the top line, and of course, that flows through and falls through to the bottom line. The second is, while we know we were in a period of reorganization, we had a hiring freeze that we put in place and we installed a lot of operating -- in this environment, our entire employee base, I think, understands the environment and we are operating with a lot of discipline. So, you just take those two factors in there.\n\nThat really explains the beat. In terms of the go-forward, I'd point you back to kind of our discussions at Investor Day and the anchor points that we provided, we are committed to margin expansion. We see a path to be able to grow durably and profitably, and we are going to operate with discipline, but still execute a strategy for growth that we have laid out together.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nGot it. And then one follow-up and I think this is probably for Rob. In terms of net new customer growth, it looks pretty weak in the quarter, like, just overall, net new customer growth at like 150. That's the lowest that we have seen since you guys have gone public and even the customer is over 100,000.\n\nThis is -- it was a relatively small increase versus what we have seen historically. Is this part and parcel of the distribution changes or more of a macro impact and how should we think about kind of the pace of the ability to sort of recover and accelerate that pace of net new customers on a go-forward basis?\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah. So, when you look at it, Keith, I mean, the majority of the churn is in the smaller customers. If you remember the chart that we showed at Investor Day shows that we have to move those customers from the left to the right. We feel really confident that we actually -- that's actually happening and that we are getting more success with more positive signs in the Global 2000 and that's going to continue to be our focus and that's how the segmentation is actually set up.\n\nWe'll move more over time into the distribution side with the smaller customers and you should expect to see churn in smaller -- in the smaller customer market.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nGot it. So, like the [Audio gap] retention rate remains really strong, but the smaller customers that probably the customer retention rate is kind of we are seeing the impact of that on the net new customer adds?\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nGot it. Excellent. OK.\n\nRob Enslin -- Co-Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Kirk Materne with Evercore. Please state your question.\n\nUnknown speaker -- RBC Capital Markets -- Analyst\n\nHi. This is Chirag on for Kirk. Thanks for taking the question and congratulations on the strong quarter. Just one question for me around the reception of the automation platform.\n\nSo how deep would you say you all are in terms of customer adoption of the overall end-to-end automation platform today within your existing customer base and largest customers when we are talking beyond core RPA use cases and how are you continuing to pursue the opportunity to go deeper? And maybe if you could call out any specific areas that are carrying more weight or seeing more demand. Thank you.\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah. So, obviously, we feel very positive about the business platform and what we can achieve with the business platform, and we see significant future positive signs in terms of the customer opportunity that we have in front of the team with existing customers to expand. If you just look at the expansion, you can see with Bank of New York Mellon, ATA customers expanding to the full platform and we see many, many more opportunities in that space. It's clear that solution sets like test has -- will have a big impact and it can be a significant driver.\n\nSo, it's clear that document understanding is a significant driver of the platform. And we believe with our process mining and task mining, as we described with Total Quality Logistics that the broader platform is now starting to have an impact and it's pretty clear in our customer conversations that the platform is the way to go for automation. So, we feel really strong about where we are headed. How it's tied to our NorthStar strategy, our selection of packages, or doing packages in our platform pricing? Early days, but really confident about how we have laid it out and how we are starting to execute it.\n\nDaniel Dines -- Co-Founder and Co-Chief Executive Officer\n\nYeah. This is Daniel. I would like to add that if you look from an airplane perspective, our platform strategy, it allowed us to move from our traditional market of automating existing manual processes, and to growing more to end-to-end process automation. So, we are the only company that has a platform that covers the entire spectrum of automation from large business processes to manual repetitive processes to even micro test that people are doing as part of their daily job.\n\nOperator\n\nThank you. And our next question comes from Bryan Bergin with Cowen. Please go ahead.\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nHi. Good afternoon. Thank you. It's good to hear some of the early go-to-market initiatives here having some success and I am curious on that, how the land size on some of the new deals are comparing to before, I know it's early, but I think the company had talked about an average land size of 15,000 to 25,000 in the past.\n\nCan you just give us any sense on how we should be thinking about the average land size under this new approach, just as you cite some of these notable new third quarter deals?\n\nAshim Gupta -- Chief Financial Officer\n\nYeah. So, we see progress on the land size, Bryan, we see it slightly up as we look at the numbers right now. Our focus, as we move forward, though, is just overall expansion. So, what we are really excited about is that we feel good we have a healthy pipeline.\n\nCustomers are expanding. They are expanding into multiple elements of our platform in terms of the number of ELAs, etc. So, both the land size we see slightly up, but we see progress in terms of customers wanting more of the platform that is very tied to our strategy in terms of driving further expansion and getting into the C-levels as we outlined at Investor Day.\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nOK. And then a follow-up on free cash flow, I heard some of the opportunistic actions you took here in the third quarter. How should we be thinking about the 4Q levels on free cash flow and just anything to be mindful there as you work through some of the restructuring actions?\n\nAshim Gupta -- Chief Financial Officer\n\nYeah. We don't guide to free cash flow just to make that clear to start. At the same time, we have talked about being roughly cash flow neutral. So, when you look at the numbers, we expect to be able to -- you should expect to see that free cash flow be positive and move us closer to that neutrality in terms of that, we are on track for those areas.\n\nAnd then our free cash flow expansion will be the same as we move forward in terms of our commitment on profitability that we talked about earlier.\n\nOperator\n\nThank you. And our next question comes from Terry Tillman with Truist Securities. Please go ahead.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nYeah. Thanks for taking my questions. Maybe the first question is a multi-partner and then I had a follow-up. Rob, for you in terms of like earlier in the year, when you were putting forth some of these initiatives to optimize the business and improve execution.\n\nOn the go-to-market side, I think, there was the idea that there could be some disruption to go-to-market activities, because of the things you are doing. Ultimately, have you seen about what you had planned for in terms of disruption to ARR or the business, or has it been less? And are you done with kind of like the right leadership team and the bench strength now? And then I have a follow-up.\n\nRob Enslin -- Co-Chief Executive Officer\n\nIt's difficult to disaggregate and what I feel really good about is, how we looked at testing a lot of the initiatives in the U.S. and how they came through getting the right leadership really quickly in place in the U.S. and we have seen them execute. And that's allowed us to actually move that to other parts of the world.\n\nIt's pretty clear our European business is in very good shape now. Mark has done a good job with the leadership team where they are actually stable. We -- they have made all the changes necessary. And then bringing Lee on in Asia Pacific, we feel like that's going to pay dividends as well.\n\nAnd we feel like we have got the framework and the formula now to actually enable the sales force to execute to the market that they face.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nThat's great to hear. And I guess for us -- you had, I think, called out automation suite and Automation Cloud being up triple digits on an ARR perspective. Do you think -- I mean, I know it's still early days with those solutions. So maybe it's just small numbers.\n\nBut can you continue to grow triple digits and what would be that portion of ARR next year, just trying to understand the size and scale. Thank you.\n\nAshim Gupta -- Chief Financial Officer\n\nYeah. In terms of go-forward guidance in the cloud, etc., remember, we really drive customer choice for that with -- in terms of allowing them to decide what is their deployment method. That being said, the team's executed well and we see a lot -- we see continued progress and excitement in the field and our customers around our cloud-first philosophy and the product releases that are coming out. In terms of just modeling, I would say, we are consistent with what we discussed at Investor Day, and previously, in terms of modeling our go-forward cloud mix.\n\nWe feel like we are in line with what we have discussed previously.\n\nOperator\n\nThank you. And our next question comes from Scott Berg with Needham. Please go ahead.\n\nScott Berg -- Needham and Company -- Analyst\n\nHi, everyone. Thanks for taking the question. I guess I got a couple. To start with on the sales side.\n\nAshim, you talked about deal sizes improving a little bit with the change in sales execution. One of the things we see often from companies, from vendors in this environment is actually trying to sell a little bit smaller, especially when the ROI and value proposition is high and has really good expansion rates. Is that an angle that you have looked at to help maybe try to address a smaller pain point initially during this challenging macro? Just to get your foot in the door and then use your natural strength to expand from there.\n\nAshim Gupta -- Chief Financial Officer\n\nYeah. Scott that is the natural sales process that invested at UiPath and UiPath is really good at that, right, of acquiring smaller deals. So, that continues to show positive signs for us and it's one of the levers that we said early on, we would continue to invest in, and we continue to invest in. So, we completely agree with you that's something that we will continue to drive.\n\nWe also mentioned that we -- as we change the segmentation, we will start to use propensity and graduation and we started to see that take impact. That allows us to take a quick acquisition and start to focus on how do we expand it and so that strategy is what that we are executing and that will drive the deal sizes up. So, it's a combination of one, it's both, and we believe that the way that automation can play in this market with the NorthStar approach, we are well set to actually help customers also get some of the value returns for them at speed as well.\n\nScott Berg -- Needham and Company -- Analyst\n\nGot it. Very helpful. And then kind of a follow-up along the sales side there is, what are you hearing from customers in terms of automation and RPA on the priority list today? We continue to hear positive things about the technology, and obviously, it's great for reducing costs in macro such as this. But are you seeing any changes in terms of how customers kind of look at this priority today?\n\nAshim Gupta -- Chief Financial Officer\n\nI think two ways to look at it. I definitely feel like customers understand now or getting to understand how automation can help them achieve their objectives in terms of efficiencies and actually expanding it into more customer experiences, I mean, that -- what Daniel -- as Daniel described, we are really good at dealing with mundane tasks, standardizing tasks, seeing regulation. But we are also getting really good at implementing new business models that are really complex across the board, which is the broader aspect of automation. So, we are confident that there's a market.\n\nWe are confident that the market is in front of us, and we really feel good that our strategy that we launched at Investor Day is aligned to where the market is headed.\n\nScott Berg -- Needham and Company -- Analyst\n\nWonderful.\n\nAshim Gupta -- Chief Financial Officer\n\nThanks.\n\nScott Berg -- Needham and Company -- Analyst\n\nThanks for taking my questions.\n\nAshim Gupta -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Alex Zukin with Wolfe Research. Please state your question.\n\nUnknown speaker -- RBC Capital Markets -- Analyst\n\nHey, guys. This is Ryan on for Alex. Thanks for taking the question. So, I just wanted to go back to the vertical question from earlier.\n\nYou talked about a good win in finserv. I think you talked positively about healthcare. I know those are two areas where you are prioritizing efforts, but any verticals that you would maybe call out that underperformed your expectations or surprised you from a land or expansion perspective?\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah. So, I would say we obviously saw financial services, healthcare, technology, media, and telecom. I would not say I didn't mention and maybe I should have, I think, it was in -- the government we have done -- we feel like we have really done well with the government in different departments there expanding. So, I would say, for the most part, I can't say there's a laggard that stands out, but there's definitely industries where we have actually seen, obviously, stronger progress in this quarter.\n\nI don't know, Ashim, do you -- can you think of any, I honestly can't think of an industry that's a laggard right now.\n\nAshim Gupta -- Chief Financial Officer\n\nNo. I think what, I mean, we have talked about this, it's very ubiquitous and I would even tag on to the previous question in terms of priorities. I mean we meet with CFOs. It aligns -- our platform aligns perfectly with their priorities.\n\nRob and I actually went to a joint customer, one of the leading construction companies in the U.S., and we -- as five minutes, six minutes going into the platform were sold, we just want to now work on how do we implement this.\n\nRob Enslin -- Co-Chief Executive Officer\n\nHow fast can we do it?\n\nAshim Gupta -- Chief Financial Officer\n\nHow fast can we --\n\nRob Enslin -- Co-Chief Executive Officer\n\nHow fast can we implement it? Can we show --\n\nAshim Gupta -- Chief Financial Officer\n\nAnd so I think that speaks to the priority and it also speaks to how ubiquitous construction as we were going through it. They themselves started rattling off use cases.\n\nUnknown speaker -- RBC Capital Markets -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nOur next question comes from Fred Havemeyer with Macquarie. Please state your question.\n\nFred Havemeyer -- Macquarie Group -- Analyst\n\nHi. Thank you. I wanted to ask about the solutions-based selling motion that was discussed back at FORWARD 5. I know it's relatively early days here, but any thoughts or updates about this strategy, any sort of solution sets that are coming together based on perhaps some of your prior experience with professional services that's particularly compelling or do you have any early feedback on how customers are responding to this?\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah. I would say, it's too early to go to give you a broad customer feedback on that. We launched one that's on the marketplace. One of our customers is utilizing Bank of New York Mellon is basically going to utilize the solution package to accelerate their journey.\n\nAnd then -- and I don't have -- and then we have another four packages, which actually are either launched or will be launched this month, so it's -- but it's certainly helping our sales organization position and it's certainly helping the customers understand that the solution accelerators can help their speed in terms of implementation, getting started quickly and moving faster for them. So, we feel really good about it and -- but just too early to tell you the full feedback yet. I mean, we are excited to be quite honest. We are super excited internally about it and if I could get 100 out tomorrow, I would.\n\nFred Havemeyer -- Macquarie Group -- Analyst\n\nOK. Thank you. I mean I am excited and looking forward to seeing what's going to happen there. I also wanted to ask about the partnership with OutSystems as well, because there seems like a very natural alignment between what you are driving as an automation platform and what low- or no-code companies are doing for their own like enterprise application development acceleration cycles.\n\nBut can you perhaps expand upon a bit of that partnership there and what it is that you can perhaps accomplish with an enterprise application platform as a partner?\n\nDaniel Dines -- Co-Founder and Co-Chief Executive Officer\n\nI think there are natural synergies between a low-code/no-code application platform and low-code/no-code automation platform like we have. We have built our platform with a very open mindset. So, we have our own apps platform that are automation centric and I wanted to offer our customers the ability to build even more complex, like, what we call Tier 1 type of applications. With OutSystems, you can even build custom CRMs or healthcare, medical record-type of application and they are tied very well into our automation platform.\n\nSo, we offer, I think, really end-to-end way of imagining new businesses, as Rob said very well.\n\nOperator\n\nThank you. And our next question comes from Michael Turits with KeyBanc. Please state your question.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nHey, guys. Just one question for Rob. Rob, where are we in terms of the focus on selling more to the end user versus selling to IT? And to the extent that maybe in the past, it was more selling to the end user, has that created any issue with shelfware or licenses that are being in the hands of end users that now there's perhaps more of a focus on the IT department.\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah. Michael, this is what I would say, if you look at our focus in bringing our solution packages, platform pricing, and as Ashim just mentioned, when we talk to a CFO, we are talking about the full end-to-end spectrum of how we help them in their business. So, when I look at the concept of shelfware, for me, that's something that we have -- we focus on, and you will see changes to compensation plans coming in next year that will actually help move that needle and ensure that we actually customers get time to revenue really quickly and that's the focus. I mean, that's the focus on the Global 2000 to ensure that the time to revenue is moving at a much faster rate and the whole organization is behind that.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nOK. That's it for me. And congrats on a very stable and solid quarter.\n\nRob Enslin -- Co-Chief Executive Officer\n\nGreat. Well, everyone, thank you for joining us today. I would like to wish everyone a happy and healthy holiday season here in New York, where it feels like a holiday season in the streets. The lights are out bright, and we feel really good about it and we look forward to seeing many of you in the coming weeks.\n\nSo happy and healthy holiday season to you and your family.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKelsey Turcotte -- Investor Relations\n\nRob Enslin -- Co-Chief Executive Officer\n\nDaniel Dines -- Co-Founder and Co-Chief Executive Officer\n\nAshim Gupta -- Chief Financial Officer\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nMark Murphy -- J.P. Morgan -- Analyst\n\nRaimo Lenschow -- Barclays -- Analyst\n\nUnknown speaker -- RBC Capital Markets -- Analyst\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nTerry Tillman -- Truist Securities -- Analyst\n\nScott Berg -- Needham and Company -- Analyst\n\nFred Havemeyer -- Macquarie Group -- Analyst\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nMore PATH analysis\n\nAll earnings call transcripts"
}