{
  "companyName": "Inovio Pharmaceuticals",
  "companyTicker": "INO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/inovio-pharmaceuticals-ino-q2-2022-earnings-call-t/",
  "content": "Inovio Pharmaceuticals (INO 1.96%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Inovio Pharmaceuticals conference call. [Operator instructions] Please note, this event is being recorded. I would now like to turn the conference over to Thomas Hong, manager of investor relations. Please go ahead.\n\nThomas Hong -- Manager, Investor Relations\n\nGood afternoon, and thank you for joining the Inovio second quarter 2022 financial results conference call. Joining me today on today's call are Dr. Jacque Shea, president and CEO; Mr. Peter Kies, chief financial officer; Dr.\n\nMichael Sumner, chief medical officer; Dr. Laurent Humeau, chief scientific officer; Dr. David Liebowitz, senior vice president of clinical development for infectious diseases; and Dr. Jeffrey Skolnik, senior vice president of clinical development for immuno-oncology and HPV Therapeutics.\n\nToday's call will review our corporate and financial information for the quarter ended June 30, 2022, and as well as provide an update on our efforts to develop our DNA medicines platform. Following prepared remarks, we will conduct a question-and-answer segment. During the call, we will be making forward-looking statements regarding future events and the future performance of the company. These events relate to our business plans to develop Inovio's DNA medicines platform, which include clinical and regulatory developments and timing of clinical data readouts, along with capital resources and strategic matters.\n\nAll of these statements are based on the beliefs and expectations of management as of today. Actual events or results could differ materially. We refer you to the documents we file from time to time with the SEC, which under the heading risk factors identify important factors that could cause actual results to differ materially from those expressed by the company verbally as well as statements made within this afternoon's press release. This call is being webcast live, and a link can be found on our website, ir.inovio.com, and a replay will be made available shortly after this call has concluded.\n\nI will now turn the call over to Inovio's president and CEO, Dr. Jacque Shea.\n\nJacqueline Shea -- President and Chief Executive Officer\n\nThank you, Thomas. Good afternoon, and thank you everyone for joining today's call. At Inovio, our goal is to bring DNA medicines to market to help address unmet medical conditions and improve the health of people around the globe. We are dedicated to achieving this goal by building a leading biotechnology company with an innovative pipeline of DNA medicine candidates from early research through late-stage clinical development to commercialization.\n\nDuring the second quarter, we focused on reshaping our organizational structure to align with our product development goals. We announced cost-cutting measures including a corporate reorganization that resulted in an 18% reduction in our full-time workforce and an 86% reduction in contractors. These initiatives are expected to reduce our operating expenses by approximately 30% over the next 18 months and extend our cash runway into the third quarter of 2024. In addition, we also strengthened our executive leadership team and R&D organization with the addition of Dr.\n\nMichael Sumner, Inovio's new chief medical officer. Mike has been a strong addition to Inovio, bringing proven experience, strategy and leadership to bear as we develop cutting-edge product candidates across multiple therapeutic areas. I'm pleased that Mike is already delivering great value through his insights and experiences, having taken several clinical products through to commercialization. I'd like to turn the call over to Mike now to briefly introduce himself.\n\nMike?\n\nMichael Sumner -- Chief Medical Officer\n\nThank you very much, Jacque, and greetings, everyone. I joined Inovio due to the immense potential of our DNA medicines platform and my desire to be part of the team that delivers on that promise. Inovio's DNA medicines are capable of generating immune responses that have the potential for meaningful clinical impact across multiple therapeutic areas. The data the organization has generated to date provides a solid foundation and compelling argument that reinforces our excitement about our existing pipeline as well as the potential of our platform.\n\nI look forward to working with Jacque and team to continue sharpening our focus across our pipeline and advancing those product candidates that have the highest commercial potential. I would like to provide an update on our clinical programs for HPV-associated diseases. On our prior earnings call, we announced our intention to amend the trial design for REVEAL 2. Our Phase 3 trial evaluating VGX-3100 as our treatment for HPV-associated cervical high-grade squamous intraepithelial lesions or HSIL.\n\nI want to share that the amendments to revise the primary analysis population from the all-comers population to the biomarker-positive population have been submitted and that the last patient visit is slated for September. Therefore, we are still on track to report efficacy safety follow-up data through week 40 by later this year or early next year. I'd also like to remind you of what we said last quarter regarding the FDA's recommendation about what they see as the most likely path supporting an approval of a marketing application. As you might recall, the FDA recommended that we use REVEAL 2 as an exploratory study to evaluate a biomarker selective population and then conduct one or two additional well-controlled trials in the biomarker positive population.\n\nAs we said last time, we will assess the path forward for the VGX-3100 program following the analysis of the REVEAL 2 results. Even with this disappointing adjustment for our VGX-3100 program, we continue to believe in the potential of our DNA medicines technology to positively impact HPV-associated diseases. During the second quarter, we continued to advance our Phase 1/2 study with INO-3107 in patients with recurrent respiratory papillomatosis, or RRP. We still expect to be able to share preliminary efficacy, safety and immunogenicity data from a portion of that trial participants in the second half of this year.\n\nData from for prior clinical studies suggest that INO-3107 may provide a clinical benefit and an alternative to surgery for patients that suffer from this often lifelong debilitating disease. I will now turn over the call to Dr. David Liebowitz, our SVP of Clinical Development of Infectious Diseases and our COVID-19 clinical lead, to provide an update on our COVID-19 program. Dave?\n\nDavid Liebowitz -- Senior Vice President of Clinical Development of Infectious Diseases and COVID-19 Clinical Lead\n\nThank you very much, Mike, and greetings, everyone. As shared on our last quarterly update, one of our key strategic programs we have been working on over the last several months is our heterologous booster strategy for INO-4800. Public health officials around the world continue to state that additional COVID-19 vaccines that are well tolerated, temperature-stable and elicit strong and broad immune responses are still needed. The immunogenicity and safety profile that INO-4800 has shown to date demonstrates its potential as a meaningful tool in the fight against current and future strains of SARS-CoV-2.\n\nThere are several factors that support our COVID-19 strategy. One, the continuing emergence of new variants of concern and the subsequent waves of infection. Two, the shrinking market for primary series vaccinations; and three, increasing evidence that points to the superiority of heterologous boosters over homologous ones in generating protective immune responses. As part of these efforts, we await the final data analysis from the heterologous BOOST trial with INO-4800 being conducted by our partner, Advaccine in China.\n\nThis noninferiority trial evaluates INO-4800 as a booster by measuring immune responses in participants who have received an inactivated COVID-19 vaccine and comparing them with the immune responses generated by a homologous boost with that inactivated vaccine. We had originally expected this data by end of summer, but recent lockdowns in China from the resurgence of COVID-19 have affected laboratories and slowed the analysis of the data. We now expect to be able to share the unblinded humoral response data from the trial in the late third quarter of 2022. Turning now to our dMAb technology, in the second quarter, our partner, the Wistar Institute, announced a Phase 1 study involving dMAb technology.\n\nThis Wistar-led study is a collaboration of AstraZeneca, University of Pennsylvania, Indiana University and Inovio to develop anti-SARS-CoV-2 specific dMAb. Funded by a $37.6 million grant from DARPA and JPE, the Phase 1 open-label single-center 24-patient dose escalation study is evaluating the safety, tolerability and pharmacokinetic profile of anti-SARS-CoV-2 specific dMAbs based on AstraZeneca's COVID-19-specific monoclonal antibodies. With regards to our other infectious disease vaccine candidates, we are still on track to announce data for our Phase 2a trial for Middle East Respiratory Syndrome, and our Ebola booster study in the second half of this year. The data for our Phase 1 trial of INO-4500 for loss of fever which we had previously guided to read out in the first half of 2022 is currently being analyzed by Inovio and our partner, CEPI.\n\nWe expect to complete our analysis and share data on INO-4500 later this year. I'll now turn the call over to Inovio's SVP of clinical development, Dr. Jeffrey Skolnik, for an update on our GBM program. Jeffrey?\n\nJeffrey Skolnik -- Senior Vice President of Clinical Development\n\nThank you, Dave. During the quarter, Inovio announced additional results from our novel Phase 1/2 trial of INO-5401 and INO-9012 in combination with Regeneron's PD-1 inhibitor, Libtayo, in 52 patients with newly diagnosed glioblastoma or GBM. Median overall survival for unmethylated MGMT patients, or cohort A, was 17.9 months while median overall survival in MGMT methylated patients, or cohort B, was 32.5 months. The survival data for cohort B compares favorably to historical controls about 23.2 to 25 months.\n\nThe results from cohort B were presented for the first time at the 2022 American Society of Clinical Oncology Annual Meeting held this past June. Overall, INO-5401 and INO-9012 were seen in the trial to be tolerable and immunogenic when administered with Libtayo and radiation and temozolomide to newly diagnosed GBM patients. And as we concluded in the abstract, INO-5401 and INO-9012 elicit robust immune responses that may correlate with a potentially enhanced survival when administered with Libtayo and radiation temozolomide to newly diagnosed GBM patients. Inovio remains encouraged with progress to date from this novel combination therapy study, and our goal is to build upon INO-5401's ability to elicit antigen-specific T cells that can infiltrate tumors and improve patient survival within a combination regimen.\n\nAnd now, I'll turn the call over to our CFO, Peter Kies, for our second quarter financial summary. Peter?\n\nPeter Kies -- Chief Financial Officer\n\nThanks, Jeffrey, and good afternoon, everyone. We finished the second quarter with $348.1 million in cash, cash equivalents and short-term investments compared to $360.4 million as of March 31, 2022. As of June 30, 2022, Inovio had 247.5 million shares of common stock outstanding and 267.8 million shares of common stock outstanding on a fully diluted basis. Our total revenue was $784,000 for the three months ended June 30, 2022, compared to $273,000 for the same period in 2021.\n\nThe increase in revenue resulted from the delivery of Inovio's proprietary smart devices related to our contract with the U.S. Department of Defense. Total operating expenses were $104.9 million for the three months ended June 30, 2022, compared to $83.5 million for the same period in 2021. Our net loss for the three months ended June 30, 2022, was $108.5 million or $0.46 per share basic and dilutive compared to a net loss of $82.1 million or $0.39 per share basic and dilutive for the quarter ended June 30, 2021.\n\nInovio's research and development expenses for the three months ended June 30, 2022, were $56.5 million compared to $70.8 million for the same period in 2021. The decrease in R&D expenses was primarily due to $21.9 million in lower expenses related to the acquisition and installation of manufacturing equipment for INO-4800 during 2021 that were nonrecurring in 2022 and $7 million in lower engineering services and expensed equipment related to our CELLECTRA 3P device. These decreases were partially offset by an increase in drug manufacturing related to our COVID-19 variant studies and our DARPA COVID-19 dMAb grant and lower contra revenue and development expenses recorded from our grant agreement, among other variances. G&A expenses were $48.5 million for the three months ended June 30, 2022, versus $12.7 million for the same period in 2021.\n\nThe increase in G&A expenses was primarily related to a $26 million increase in legal expenses, which includes a $14 million noncash expense related to anticipated issuance of our common stock as part of the proposed settlement of our previously disclosed security class action litigation and other related litigation costs as well as a $6.9 million onetime severance expense related to the separation of our former chief executive officer in the quarter. To put in perspective, the proposed settlement in content, we anticipate paying $30 million in cash and issuing $14 million of common stock to settle all outstanding claims with the cash payment committed by our insurance carriers. While this settlement of the class action lawsuit remains subject to final agreement between the parties as well as court approval, accounting treatment of loss contingencies requires the accrual of the expense when it is probable and reasonably estimated, the company has recorded what represents our best estimate regarding the outcome of the class action lawsuit and proposed settlement. The proposed settlement is without any admission, concession or finding of any fault, liability or wrongdoing by the company or any defendant.\n\nLooking forward, our projections for the cash runway into the third quarter of 2024 includes a cash burn estimate of approximately $73 million for the quarter -- third quarter in 2022. Our expected cash burn will decrease incrementally from there into the third quarter of 2024. As a reminder, you can find the financials and the full financials in our press release and full financials in our 10-Q filed with the SEC. Now with that, I'll turn it back to Jacque.\n\nJacqueline Shea -- President and Chief Executive Officer\n\nThank you, Peter. This past quarter, we have laid the foundations for a leaner, nimbler organization with a sharpened focus on advancing our key programs toward commercialization. The decisions we have made and will continue to make, reflect our commitment to realizing the potential of our DNA medicines platform to enable us to contribute to improving people's health globally. With that, let's now open the call for questions.\n\nOperator?\n\nOperator\n\nThank you. [Operator instructions] Your first question comes from Jeff Meacham with Bank of America. Please go ahead.\n\nAlex Hammond -- Bank of America Merrill Lynch -- Analyst\n\nHi. This is Alex Hammond on for Jeff Meacham. Thank you for taking my question. Can you talk about how your COVID strategy has evolved following the push for omicron-specific boosters.\n\nAnd what are your expectations for INO-4000 commercial opportunity.\n\nJacqueline Shea -- President and Chief Executive Officer\n\nThank you for the question. So I'll start off and talk about the general strategy and then I'll hand over to Dave for further specifics. So with regards to the change to omicron vaccine that is being undertaken by some of the other companies. We continue to monitor all of these market factors, but we also need to keep in mind the increasing new evidence that heterologous boosters appear to have advanced ever homologous boosters in delivering broader protection against both current and newly developing strains of SARS-CoV-2.\n\nOur vaccine, INO-4800, based on our DNA medicines technology has potentially several advantageous characteristics that we feel could still allow us to play an important role in protecting health. Dave, would you like to add any other comments?\n\nDavid Liebowitz -- Senior Vice President of Clinical Development of Infectious Diseases and COVID-19 Clinical Lead\n\nThanks, Jacque. I think the only thing I would add is to expand on what you said and mention the properties that we think are important that make this vaccine an excellent candidate to be a booster. These include its ability to elicit cellular responses against multiple variants of concern, which may be involved not only in protecting against severe disease and death, but may also be critical for durability of protection. We lack an anti-vector response and the tolerability for readministration and the safety profile that we've observed to date are all features that I think are important.\n\nJacqueline Shea -- President and Chief Executive Officer\n\nThank you, Dave.\n\nOperator\n\nThank you. Your next question comes from Gregory Renza with RBC. Please go ahead.\n\nGregory Renza -- RBC Capital Markets --- Analyst\n\nHey. Good morning or good afternoon, Jacque and team. Maybe Jacque, just starting with more of a high-level question. You've been on board for a few months now and in the CEO Steve for that time.\n\nI'm just curious, what are you learning? What are some of the surprises and maybe challenges that you're seeing. And maybe just a weave and if you don't mind, how you expect or tend to employ the concept of setting expectations for disclosures, data, program progress, something that we're all monitoring as we should. And then last question, and I'll just sneak in and then hop back into the queue. With respect to 3107 and the update coming, how important is RRP and 3107 to bear out the thesis with the pipeline? Thank you so much.\n\nJacqueline Shea -- President and Chief Executive Officer\n\nThank you, Greg. I think I'll start actually with the last part of your question, which is around the importance of RRP and 3107 and there, it really plays into our strategy generally. We are very focused in advancing those product candidates that are closer to market. So those are our COVID vaccine candidate INO-4800.\n\nAnd also our HPV-related product candidates of which INO-3107 is you -- just mentioned is very important. So at Inovio, I would say, over the past couple of months, really, what we've been trying to do is realign our resources to really focus those resources on driving those product candidates forward. And as we believe those candidates have the most potential for reaching the market in the near term. And I would say our strategy hasn't changed.\n\nWe continue to be focused on driving those HPV-related candidates forward. We continue to be focused on the COVID vaccine concert. I mean, obviously, we are paying attention to the market environment and what's going on with COVID. We continue to pay attention as to how that may impact our development strategies.\n\nBut we remain very optimistic that INO-4800 can make a real contribution to the heterologous boost environment and that there continues to be a need for new safe and effective vaccines, particularly in the heterologous boost space.\n\nGregory Renza -- RBC Capital Markets --- Analyst\n\nThanks, Jacque. I appreciate the color. \n\nOperator\n\nThank you. [Operator instructions] Your next question comes from Roger Song with Jefferies. Please go ahead.\n\nRoger Song -- Jefferies -- Analyst\n\nGreat. Thanks for taking the question. A couple from us. So for the 3100, kind of understanding you're waiting for the review two data to decide the next step, but can you just comment what kind of data you're looking for in order for you to move forward into the pivotal focusing on biomarker enhanced patient population?\n\nJacqueline Shea -- President and Chief Executive Officer\n\nThanks, Roger. That's a great question. I'm going to ask Mike to address that question. Mike?\n\nMichael Sumner -- Chief Medical Officer\n\nYeah. Thank you. Obviously, the data we hope is obviously that we hit our efficacy and safety endpoints that we've predetermined in the protocol. We still believe it's obviously important to have a nonsurgical option to enable women to have a choice in their treatment as we move forward.\n\nAnd we think with the predictive pre-treatment biomarker, that will enable the detection of women who are expected to respond more positively to VGX-3100.\n\nJacqueline Shea -- President and Chief Executive Officer\n\nThanks, Mike.\n\nRoger Song -- Jefferies -- Analyst\n\nGot it. Maybe just a quick follow-up. You say you're hitting the efficacy endpoint and the safety for sure. Any other kind of benchmark you try to hit in terms of like maybe your target benchmark, the surgical option or some other historical benchmark you try to kind of beat before you can say I want to move forward into the pivotal?\n\nPeter Kies -- Chief Financial Officer\n\nI think that would be making us speculate on the data. So I'd rather wait until we see the full readout of the data, and then we can present that in the full context of the clinical situation.\n\nRoger Song -- Jefferies -- Analyst\n\nAll right. Understood. Maybe just one last one, if I can, is for the 5401. I think the ASCO data looks pretty promising and maybe what will be the potential next steps and the timing of the study and the data disclosure? Thank you.\n\nJacqueline Shea -- President and Chief Executive Officer\n\nThanks. Well, we were very pleased with the data that was presented at ASCO, and maybe I can hand over to Jeffrey here for further color on next steps and where we are. Jeffrey?\n\nJeffrey Skolnik -- Senior Vice President of Clinical Development\n\nSure. Thanks, Jacque. Roger, thanks for the question. Again, as Jacque just said, we were very pleased with what we were able to share.\n\nAnd as we talked about a few moments ago at the 2022 ASCO meeting, where we were really able to demonstrate median overall survival in both the MGMT-unmethylated and the MGMT-methylated patients, demonstrating that as we look when compared with historical controls, certainly, we're seeing the potential for positivity. I think in terms of what comes next, as we've shared, we are encouraged by what we're seeing in the current Phase 2 trial and we continue to discuss with our partners, Regeneron, what will come next and when that will come next. So I would say that continues, that conversation continues to move forward, but certainly stay tuned.\n\nRoger Song -- Jefferies -- Analyst\n\nAll right.\n\nOperator\n\nThank you. Your next question comes from Hartaj Singh with Oppenheimer. Please go ahead.\n\nEka Gigauri -- Oppenheimer and Company -- Analyst\n\nHi. Good afternoon. This is Eka Gigauri dialing in for Hartaj today. Thank you for the update.\n\nGood to connect with all again and also thank you from taking our questions. A couple from us, irstly, we're curious for INO-4800. What the regulatory requirements are for the main markets? Where the heterologous booster might get approved? And then secondly, could we get an update on the status of the CELLECTRA device utilization for your various trials? And lastly, maybe I missed this, but could you walk us through market sizing for MERS, Lassa fever and Ebola maybe from largest to smallest and maybe explain what the key next steps are for these programs.\n\nJacqueline Shea -- President and Chief Executive Officer\n\nGreat. Thank you. I think we're going to kick off with the INO-4800 and the regulatory part with Dave. Dave, would you like to comment there?\n\nDavid Liebowitz -- Senior Vice President of Clinical Development of Infectious Diseases and COVID-19 Clinical Lead\n\nYes, and thank you for the question. So currently, we're continuing our discussions with regulators in the countries -- select countries that we had received authorization to proceed with Innovate. And we're exploring the regulatory pathways in those countries for licensure. At this point, since these discussions are continuing, we can't disclose the names of those countries, and we can't comment on behalf of the regulators.\n\nJacqueline Shea -- President and Chief Executive Officer\n\nThanks, Dave. To address the CELLECTRA utilization. So Inovio has primarily two devices that were -- that we've been using in our clinical trials. The 5PSP, which is our IM device and is used across our IO portfolio as well as our HPV-related portfolio.\n\nAnd then on the intradermal or ID side, which we've been using across our infectious disease programs, we have our new 3PSP device which is a handheld device as well as our historical CELLECTRA device, which has mainly been used for clinical applications. So we have two sets of devices, the 5PSP for intramuscular. And then we have the CELLECTRA and the 3PSP device for ID administration. With regards to MERS, Lassa and Ebola market, so we'll be providing some updates with regards to those clinical programs later on in the year.\n\nAnd then perhaps we could address some of the market questions as we talk around some of the data there. But clearly, these are diseases with important global implications some of these are diseases for which stockpiles are likely to be established while other diseases may potentially have a role in ongoing vaccination campaigns within an endemic setting. So we'll provide some more color on that as we talk about the data later on in the year.\n\nEka Gigauri -- Oppenheimer and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Next question comes from Yi Chen with H.C. Wainwright. Please go ahead.\n\nYi Chen -- H.C. Wainwright and Company -- Analyst\n\nHi. This is Yi from Wainwright. Thank you for taking my questions. So regarding 3107 in the clinical trial for recurrent respiratory papillomatosis.\n\nIs this still on track to report top-line results before the end of this year?\n\nJacqueline Shea -- President and Chief Executive Officer\n\nHi, Yi. Nice to hear you. Yes, that's a great question, Jeffrey, would you like to comment?\n\nJeffrey Skolnik -- Senior Vice President of Clinical Development\n\nSure. So as we previously said, we do anticipate sharing in the second half of this year the results from our Phase 1, Phase 2 trial. And that will include, as Mike referenced before, importantly, safety and tolerability and it will also give us our first assessment of the potential for efficacy. So certainly, again, stay tuned for those data ideally by the end of this year.\n\nYi Chen -- H.C. Wainwright and Company -- Analyst\n\nOK. And assuming positive results, what would be the next step?\n\nJeffrey Skolnik -- Senior Vice President of Clinical Development\n\nSure. Jacque, would you let me to answer that?\n\nJacqueline Shea -- President and Chief Executive Officer\n\nPlease do, Jeffrey.\n\nJeffrey Skolnik -- Senior Vice President of Clinical Development\n\nAbsolutely. So we're going to look at the totality of the information of the data that we have. We're going to continue to engage with regulatory authorities, which is really part of what we do normally and almost day-to-day. And then with those data and with what we learned essentially from our regulatory engagements, we'll be able to be clearer on what the next steps will be.\n\nYi Chen -- H.C. Wainwright and Company -- Analyst\n\nOK. Got it. Got it. And just to confirm, you mentioned that the REVEAL 2 trial will report data either in late 2022 or early 2023, correct?\n\nJeffrey Skolnik -- Senior Vice President of Clinical Development\n\nThat's correct.\n\nYi Chen -- H.C. Wainwright and Company -- Analyst\n\nOK, got it. Thank you.\n\nOperator\n\nThank you. That does conclude our question-and-answer session. I would now like to turn the conference over to Jacqueline Shea for any closing remarks.\n\nJacqueline Shea -- President and Chief Executive Officer\n\nThank you, operator, and thank you to everyone who's joined today's call and for all of the questions. I look forward to updating you on our program developments and speaking with you again on our next earnings call in November. Have a good evening, everyone. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nThomas Hong -- Manager, Investor Relations\n\nJacqueline Shea -- President and Chief Executive Officer\n\nMichael Sumner -- Chief Medical Officer\n\nDavid Liebowitz -- Senior Vice President of Clinical Development of Infectious Diseases and COVID-19 Clinical Lead\n\nJeffrey Skolnik -- Senior Vice President of Clinical Development\n\nPeter Kies -- Chief Financial Officer\n\nAlex Hammond -- Bank of America Merrill Lynch -- Analyst\n\nGregory Renza -- RBC Capital Markets --- Analyst\n\nRoger Song -- Jefferies -- Analyst\n\nEka Gigauri -- Oppenheimer and Company -- Analyst\n\nYi Chen -- H.C. Wainwright and Company -- Analyst\n\nMore INO analysis\n\nAll earnings call transcripts"
}