{
  "companyName": "Sonos Inc",
  "companyTicker": "SONO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/sonos-inc-sono-q3-2022-earnings-call-transcript/",
  "content": "Sonos Inc (SONO 1.56%)\nQ3 2022 Earnings Call\nAug 10, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. My name is Emma, and I will be your conference operator today. At this time, I would like to welcome everyone to the Sonos third quarter fiscal 2022 conference call. [Operator instructions] Thank you.\n\nJames Baglanis, head of investor relations, you may begin your conference.\n\nJames Baglanis -- Head of Investor Relations\n\nGood afternoon, and welcome to Sonos' third quarter fiscal 2022 earnings conference call. I am James Baglanis, and with me today are Sonos' CEO, Patrick Spence; CFO, Brittany Bagley; chief legal officer, Eddie Lazarus. For those who joined the call early, today's hold music is from the new episode of live music series from the basement, created by Sonos sound board member, Nigel Godrich. Sonos Radio partnered with Nigel to produce this latest installment with new episodes coming out monthly.\n\nBefore I hand it over to Patrick, I would like to remind everyone that today's discussion will include forward-looking statements regarding future events and our future financial performance. These statements reflect our views as of today only and should not be considered as representing our views as of any subsequent date. These statements are also subject to material risks and uncertainties that could cause actual results to differ materially from expectations reflected in the forward-looking statements. A discussion of these risk factors is fully detailed under the caption Risk Factors in our filings with the SEC.\n\nDuring this call, we will also refer to certain non-GAAP financial measures. For information regarding our non-GAAP financials and a reconciliation of GAAP to non-GAAP measures, please refer to today's press release regarding our third quarter fiscal 2022 results posted to the Investor Relations portion of our website. As a reminder, the press release, supplemental earnings presentation and conference call transcript will be available on our Investor Relations website, investors.sonos.com. I'll turn the call over to Patrick.\n\nPatrick Spence -- Chief Executive Officer\n\nThank you, James, and hello, everyone. Earlier today, we announced that our CFO, Brittany Bagley, will be leaving Sonos to pursue another professional opportunity. Eddie Lazarus, our chief legal officer, will succeed Brittany as interim CFO effective September 1. On behalf of everyone at Sonos, I want to thank Brittany for her hard work and dedication over the past three years as CFO and the previous seven as an investor and board member.\n\nBrittany played an instrumental role at Sonos helping us drive financial performance, make smart investments in the future and increase shareholder value. We greatly appreciate everything Brittany did for Sonos and wish all in her future endeavors. While many of you know Eddie as our chief legal officer, he also has past experience in finance and strategy. In his previous role at Tribune, he ran both strategy and legal and was very involved in the company's strategic planning and capital allocation decisions.\n\nHe's also a board member at Sequoia Fund, a concentrated long-only equity fund. Eddie has always played an active role in our strategic planning and stepped in to provide day-to-day guidance for the finance and technology organization during Brittany's parental leave last year, so he knows the team and the intricacies of our business. With our experienced chief accounting officer, Chris Mason; our head of investor relations, James Baglanis; and the rest of the reporting and planning organization, we have a deeply experienced finance and accounting team that will ensure we don't miss a beat. Now turning to earnings.\n\nSince we reported Q2 earnings, we have seen the macroeconomic backdrop become significantly more challenging. As you all know, the dollars appreciated significantly relative to other major currencies and high inflation has adversely affected consumer sentiment globally, particularly in the categories in which we play. While our results weren't in line with our ambition, our teams executed well against this challenging backdrop, delivering constant currency revenue growth of 2% year over year on a reported basis, revenues of $371.8 million were down 2%. We delivered adjusted EBITDA of $42.1 million, representing a margin of 11.3%.\n\nOur results in the quarter were negatively impacted by three primary factors. First, as many other companies have already discussed this earnings cycle, we saw a softening of consumer demand in our product categories starting in June. We believe this is in part a reflection of consumers shifting their near-term focus from goods to services and travel. Second, we remain supply constrained in some of our key products like Amp and Beam.\n\nAnd as a result, we continue to have a backlog which caused us to miss out on revenue opportunities in the quarter. And third, the strengthening of the U.S. dollar throughout the quarter resulted in a $15 million foreign currency headwind. Let me provide some additional detail on what we saw from a consumer demand and product perspective in the quarter and how that's informing our view of Q4.\n\nSoftening consumer demand across our product categories had an outsized impact on Roam, which was lapping its successful launch in the same quarter last year. In June, we launched Ray, our compact sound bar, which offers the best bang for your buck under $300. We observed that the launch was impacted by softening consumer demand, compounded by a substantial drop in TV sales versus last year. As a result, Ray is significantly missing our expectations for the year.\n\nNonetheless, we remain incredibly excited about having a terrific product at a new price point that has the potential to reach new customers. Looking beyond the short term, we expect that Ray will be very successful as it continues to receive excellent reviews from tech and lifestyle media. Changing consumer spending patterns influenced our retail partners' outlook who in turn are taking a cautious approach to their inventory position. As a result of the macroeconomic softness we are seeing, we are extending the time line we expect it to take to hit our long-term targets with $2.5 billion in revenue, 45% to 47% gross margins and 15% to 18% adjusted EBITDA margin.\n\nHowever, nothing has changed our conviction in the tremendous long-term opportunity ahead for Sonos. Regardless of short-term economic fluctuations, our category leadership is proven and established, our brand is strong, our awareness among our affluent target customer base is growing. Individuals continue to find new ways to consume content throughout their lives and accordingly, they are increasingly demanding better products and services to bring this content to life. This trend plays to our strengths.\n\nThe Sonos flywheel of new household acquisition and existing customer repurchases continues to spend. We have a robust product road map and a track record of at least two new product launches annually. We have a large addressable market and secular tailwinds that further underscore the long-term opportunity for Sonos. Despite the macro dynamics of Q3, we gained or held share in key categories across our geographies, and we saw steady repurchase trends among our growing base of existing households.\n\nIn the past few quarters, I've spoken extensively about the power of our flywheel, and this is yet another proof point that the model we built is working. Sonos is not a typical one-and-done purchase. Our existing customers show us time and time again that they return on a predictable basis to purchase additional products. This is true of customer cohorts that started prior to the pandemic, true of those cohorts that started with Sonos during the pandemic and true of those cohorts that have started this fiscal year.\n\nWe see consistent repurchase behavior across all of these cohorts. We are focusing on what we can control, creating and delivering products that alike consumers. Relentlessly driving innovation is critical to fueling the Sonos flywheel and delivering long-term growth. We continue to thoughtfully invest in innovation both organically, as you've seen with our five product and service launches this year, and through acquisitions, like you saw with the acquisition of Mayht, which closed in the quarter.\n\nThe Mayht team had integrated seamlessly, and we are very excited to take advantage of Mayht's groundbreaking technology to further differentiate our existing and future product portfolio. While investing in the delivery of our product road map is of the utmost priority, we are also taking a hard look at our expense base. We are investing in an exciting number of new products and services in both existing and new categories. I'm confident that these put us in a position to emerge from this period stronger and take a greater share of the $96 billion global audio market.\n\nNow I'll turn the call over to Brittany to provide more details on our results and outlook.\n\nBrittany Bagley -- Chief Financial Officer\n\nThank you, Patrick. We delivered year-over-year top line growth of 2% on a constant currency basis or a decline of 2% on a reported basis to $371.8 million with EBITDA margins of 11.3%. As Patrick called out above, we are now seeing a more challenging macro environment and the continued strengthening U.S. dollar impacting our results.\n\nAnd we have continued to be supply constrained on certain products, especially Amp. These factors led to mixed performance across our regions. Year over year, revenue in the Americas grew 4% on a reported and constant currency basis. EMEA declined 11% on a reported basis and 1% on a constant currency basis.\n\nEMEA revenue was 30% of our business in Q3 and is experiencing particularly soft results, given the ongoing war in Ukraine and weakening currency relative to the U.S. dollar. APAC declined 7% or 4% on a constant currency basis. APAC comparisons got significantly harder from Q2 as we grew over 100% since last Q3.\n\nSonos speaker revenue increased 1% year over year, driven by the introduction of Ray in Q3 and the ongoing strength in Arc and One, partially offset by lapping the launch of Roam last year. Sonos system products revenue declined 19% due to supply availability constraints. Partner products and other revenue decreased 8%, primarily driven by lower accessory sales. Gross margin increased 250 basis points relative to Q2 to 47.3%.\n\nTiming of expenses related to higher component costs was the primary driver of this sequential improvement. On a year-over-year basis, gross margin increased 30 basis points, driven by higher selling prices, partially offset by higher component costs. As we have discussed in prior quarters, we continued to invest in the business this year, notably in R&D. We are proud to have launched five new products, including Beam Gen 2, Roam SL, Roam Colors, Ray and Sonos voice control.\n\nWe have also made three technology acquisitions this year to support our long-term product road map. Additionally, we have been investing in our systems to support further scale and are pleased to have successfully completed the go-live of our new ERP system in the quarter. While we had some minor bumps as with every ERP implementation, we have successfully been able to execute on our business and report our financials, thanks to a great effort across the teams at Sonos. Excluding legal fees and transaction costs, opex grew 4% year over year, driven by product development, professional fees and additional head count, partially offset by lower variable compensation.\n\nWe delivered adjusted EBITDA of $42.1 million, representing a margin of 11.3%. Adjusted EBITDA declined by 10% year over year, driven by the higher investments in the business and lower revenue. From a free cash flow standpoint, we had negative cash flow from operations in the quarter, primarily due to inventory investments. Heading into the holiday quarter, we usually have a seasonal build of inventory.\n\nBut given the softer demand we're seeing, our inventory levels are higher than we would like them to be in Q3. We have now adjusted our inventory build and component buys and believe we will get to a better inventory position after the holiday quarter. Despite the use of cash in Q3, we still delivered $76 million in cash from operations in the first nine months of the year and ended the quarter with $440 million of cash, but no debt. As we work through our inventory position over the next few quarters, you should see a return to a more normalized free cash flow profile.\n\nOur balance sheet remains strong and affords us significant flexibility to navigate this uncertain economic environment. During Q3, we used $100 million of cash on the acquisition of Mayht, and we remain very excited about adding this technology to our future product road map. We also spent $43 million on share repurchases. Over the first nine months of the year, we have deployed $117 million of cash toward repurchases, which leaves $33 million remaining at the end of Q3 on our $150 million authorization.\n\nNow turning to our fiscal '22 outlook. In light of the slowing macro environment, softening run rates in our business and caution from some of our retail channel partners along with FX headwinds and continued supply constraints, we expect a challenging Q4. As we evaluated these trends, we decided to push an anticipated product launch from Q4 into Q1 of '23, which should lead to better launch timing, but which further impacts our Q4 expectations. To cover these factors in a little more detail, we are currently forecasting the run rates we are seeing on our product registrations to be stable to slightly softer through Q4.\n\nWe are also resetting our expectations on Ray during this economic period, though it continues to get strong reviews. Registrations are our best proxy for sell-through and our close to sense for real-time demand along with our DTC channel, and we are watching this closely as we forecast. From a sell-in perspective, which is how we recognize revenue in our non-DTC channels, we are expecting softer ordering from our retail partners. Our current channel inventory remains healthy ahead of holiday selling, but we are seeing extra caution as partners evaluate their inventory positions and decide how many weeks of inventory they will stock, which is especially impacting our revenue in EMEA.\n\nWe are also assuming that the dollar continues to be strong, resulting in an estimated $50 million FX impact for the year, including a $17 million impact in Q4. Finally, we will start to be in a better supply position on Amp in Q4, but do still expect to have a backlog exiting the year. We have seen the supply situation improve relative to last quarter and are catching up on our product availability. While we noted in Q2, we were watching many of these factors, we have now seen their impact and has been particularly challenging to have supply constraints concurrent with demand weakness.\n\nWe do see some easing in the demand for critical components, as well as the cost of shipping and logistics, but these benefits will largely not be seen until '23, given lead times. We continue to believe our supply chain strategy and continued diversification with Malaysia and now Vietnam will serve us well. As a result of all these factors, we are lowering our full year revenue guidance to a range of $1.73 billion to $1.755 billion. This range represents revenue growth of 1% to 2% year over year.\n\nThe midpoint of this guidance implies Q4 revenue of $306 million, down 15% year over year. On a constant currency basis, this would still represent 4.4% growth for the full year with Q4 down 10% at the midpoint. If we had been fully in stock on Amp and not shifted our product release, we would have expected growth in Q4 on a constant currency basis. We would note that these are matters of timing, and this revenue will be earned in fiscal year '23 instead.\n\nWe are narrowing our gross margin guidance range to 45.7% to 45.9% for fiscal year '22. At the midpoint, this implies a 41% gross margin for Q4. This margin is below the levels of the last few quarters for two main reasons. The first is elevated component costs required to improve our in-stock position.\n\nWe incur these costs in advance and expense them in the quarter we expect to sell the product. The other major impact in the quarter is FX. Despite our expected Q4 gross margin performance, we remain committed to operating our business with a long-term annual gross margin target of 45% to 47%, and we do expect to achieve that in fiscal year '22. Our Q4 revenue decline flows through to adjusted EBITDA.\n\nAs a result, we are lowering our full year guidance range to $250 million to $230 million. This represents an adjusted EBITDA margin in the range of 12.4% to 13.1%. For Q4, at the midpoint, this implies adjusted EBITDA of negative $30 million. Despite the importance of continuing to invest in our long-term road map for the amazing products we expect to deliver in '23 and beyond, we are taking cost actions given the change in the forecast.\n\nThis includes pausing our hiring, our travel and making other adjustments to opex as we look at Q4 and fiscal year '23. We expect to provide further guidance regarding fiscal year '23 on our Q4 earnings call. As Patrick discussed, nothing has changed regarding our conviction in the long-term growth potential of Sonos. We continue to believe that Sonos can achieve $2.5 billion of revenue, 45% to 47% gross margins and 15% to 18% adjusted EBITDA margin.\n\nBut because of the changes in the macroeconomic environment, it will take us longer than previously anticipated to deliver these targets. When we have more certainty on these factors, we will provide a further update on timing. Despite the uncertain environment, we have significant brand equity, a resilient and loyal premium customer and a large and growing market opportunity. We believe these attributes, along with a history of consistently delivering innovative new products support our flywheel and position us well to deliver tremendous shareholder value over time.\n\nWe are operating in a dynamic and challenging environment, but we are proud of our team's execution, and we are confident we will build upon our category leadership and exit as an even stronger business. Finally, thank you, Patrick, for the kind words. It is bittersweet that after 10 years of being involved with Sonos, including almost three and a half years as CFO, I will be moving on to a new career opportunity where I will serve as both CFO and chief business officer. I am so proud of what Sonos has achieved.\n\nAnd despite the macro trends discussed, I know Sonos is well-positioned for the long term. The product road map, healthy gross margins, incredible IP and strong balance sheet all position the company for future success. It has been truly a pleasure to work alongside such a talented and dedicated executive team. I want to thank Patrick, Eddie, my incredible leadership team and the whole Sonos team for their support.\n\nI continue to be a fan of Sonos and wish them the best of luck moving forward. With that, I'll turn the call over to Eddie.\n\nEddie Lazarus -- Chief Legal Officer\n\nGood afternoon. First off, I'd just like to say how much I've enjoyed and appreciated having the chance to work so closely with Brittany these last three-plus years. She's been a wonderful colleague, and I know she'll continue to thrive in her next endeavor. I'm also honored to step into our shoes to lead a world-class finance team and to work with Patrick even more closely on seizing the business opportunities that lie ahead of us.\n\nI would just also say that my additional responsibilities as interim CFO will not impact our strategy to defend our intellectual property and hold Google accountable for their infringements. To that end, there have been a few recent developments. First, in the so-called patent showdown in our federal court case against Google in Northern California, the judge has rendered a split decision on the two representative claims addition. Judge ruled that Google does infringe our zones team's patent, but also ruled for Google on the other patent.\n\nWe respectfully disagree with that adverse release. Second, Google filed two new cases against us in Northern California, alleging infringement of a total of seven patents and two mirror image cases at the International Trade Commission based on the same patent. We will defend vigorously against this attempt to dissuade us from pursuing our patent rights. Our track record in defending against Google is strong as reflected most recently in run Google's Canadian case against us, where the court found Sonos does not infringe the patented issue.\n\nThis follows our successful defenses in Germany, the Netherlands and France. Overall, our litigation results have continued to affirm the strength of our portfolio, and our prospects for attaining damages and a fair royalty. We look forward to our day in court for the patent showdown trial scheduled to commence later this year in October. With that, I would like to turn the call over for questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Tom Forte with D.A. Davidson. Your line is now open.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat. Thank you. I have one question and one follow-up. First off, Brittany, though, it's been a pleasure working with you, and I wish you the best of luck in the future.\n\nAnd then, Eddie, you clearly are capable of wearing many hats, which is very impressive. So for my first question, do you think your sales are being impacted by either the decline in the housing market with rising interest rates and/or consumers devoting a larger portion of the discretionary spending on travel?\n\nPatrick Spence -- Chief Executive Officer\n\nHey, Tom, it's Patrick. I'll take that one. We're watching the housing market closely. Our Americas revenue grew actually 4% in the quarter.\n\nWe believe that, to your point, we've also heard from others, and I think seen anecdotally, the focus this summer on travel and services spend. So from everything we've seen, there's something to that. And then I think really, as we think about the pattern, it was really something that hit us in June as we talked about. So we didn't see the demand materialize as we had expected after what was in April and May that were in line with what we had expected.\n\nAnd we obviously had Ray and Roam Colors launching in June as well, and we just didn't see the demand really materialize in the way that we'd expected, given the macro environment. And that really compounded because we also saw retailers see that same macro weakness across all of their inventory positions, not Sono specifically and start to back off any orders of products and just get more cautious across the board, which also impacts us as we go through that. So hopefully, that's helpful in terms of understanding what we saw.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat. Thanks, Patrick. And then for my follow-up, can you talk about your ability to adjust prices outside the U.S. for the strong dollar?\n\nBrittany Bagley -- Chief Financial Officer\n\nI can take that one. It's certainly something that we are looking at, and we'll always keep in mind as we think about our commitment to maintaining that 45% to 47% gross margin. But obviously also took price increases last September. And so it's something that will really want to make sure is the right long-term decision for the business as we contemplate something like that.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat. Thanks for taking my questions.\n\nBrittany Bagley -- Chief Financial Officer\n\nThank you.\n\nPatrick Spence -- Chief Executive Officer\n\nThanks, Tom.\n\nOperator\n\nYour next question comes from the line of Brent Thill with Jefferies. Your line is now open.\n\nBrent Thill -- Jefferies -- Analyst\n\nThanks. Patrick, if you had to put macro versus execution issues, is this all in the macro? Were there any competitive or any missteps from an execution perspective on the inside, how would you frame that? Is this 99% macro? Is there -- how would you frame the balance?\n\nPatrick Spence -- Chief Executive Officer\n\nThat's -- this is exactly the question we asked ourselves, Brent, as we started to see the macroeconomic. And one of the things that we paid close attention to is that market share and what's happening in the market more generally. And as I mentioned, like we're holding steady from everything we can see across our key categories or gaining share. And so we feel good about our position right now.\n\nWe're also looking at the reviews from the media, from our customers and from our channel partners as it comes to new products like Ray and those are living up to the kind of reviews you would expect from any Sonos product and the feedback from retailers has been good. And the feedback from retailers has been that we are holding or gaining share. So we feel good about the position we're in right now. So we largely chalk it up to macro, but I also believe we can always get better at execution.\n\nAnd so as I mentioned, we're going to make sure that the investments we have been making, the investments we're planning to make all will pay off for the long term and are prudent in the environment that we're in, but definitely largely macro from what we can see is favorite.\n\nBrent Thill -- Jefferies -- Analyst\n\nAnd the deterioration in June, was that kind of second part of June? And I guess into July and August, have you seen things stabilize and improve got worse? Can you give us some color? And Brittany, can you just follow up on the decision to push out the new solution in the quarter to next year. Was that just -- was it just -- because it wasn't ready or was it -- you're just like why push it out now in this environment, if you can clarify that?\n\nBrittany Bagley -- Chief Financial Officer\n\nYeah, happy to. So I would say, as we look to June, it really was, as Patrick just said, a lot of the macro factors that we talked about we've also continued to see the dollar strengthen, so FX was a part of that as we look going forward. And then as you remember, probably Ray went to general availability in June. So we were able to see how that product was doing and really factor that performance into our go-forward outlook.\n\nAnd so as I said in my remarks, we are expecting -- as we look at run rate now that we see a stabilization in most of our run rate from a registration basis and then maybe some slight continued softening for some product lines. We've tried to be pretty thoughtful just as we look through the registration data. Nothing that I would call out thematically on those because that's probably one of the next questions. There's nothing thematically, I would call out across those just stable to slightly softer.\n\nBut I would call out, as we talked about, that our retail partners in the Americas, but especially in EMEA, are also being quite cautious on how they think about inventory right now and inventory as they go into the holiday quarter. And as we look at it, we -- I would say we did not have too much inventory in the channel with our retail partners at all right now. We're quite comfortable with where that fits, except for the fact that they are being quite cautious. And so that obviously impacts what we're expecting to see from a sell-in basis.\n\nThat is more of a one-time impact as they readjust how many weeks on they want to have. So that's a lot of what we're looking at. And when we look at all of those things, including retailers being cautious heading into the holiday quarter and what the environment looks like, we thought that the product would do better if we launched it in Q1 rather than in Q4.\n\nBrent Thill -- Jefferies -- Analyst\n\nGreat. Thank you very much.\n\nPatrick Spence -- Chief Executive Officer\n\nThanks, Brent.\n\nOperator\n\nYour next question comes from the line of Rod Hall with Goldman Sachs. Your line is now open.\n\nRod Hall -- Goldman Sachs -- Analyst\n\nYeah, thanks for the question. I guess I wanted to come back to the inventory comment that you just made there Brittany and ask -- we -- of course, we see this as well with TVs and all kinds of other things in retail. I'm curious what you guys think it takes for retailers to get to a point where they feel they know how much inventory they want to have on hand. Do you think that from your experience, they'll know that after we get through the back-to-school season or how do you think this flows on through the back end of the year here in terms of people's decisions on inventory, if you think inventory levels are in fact pretty low? And then I have a follow-up to that.\n\nBrittany Bagley -- Chief Financial Officer\n\nI would say we think they're low for our products. That's what we track most closely. And so our view is that as our partners look at continued sell-through rates and continued movement of that inventory, that will continue to have sort of constructive conversations around what they need to do. That said, they are balancing their overall inventory levels, not just their inventory levels with Sonos, and that's something that we do need to watch, to your point, from a TV sales standpoint.\n\nBut everybody wants to sell what they can sell in the holiday quarter. So that is where we have a bit of confidence that our products are still good products for them to have in the store and important holiday products for them to carry.\n\nRod Hall -- Goldman Sachs -- Analyst\n\nOK. Thanks. And then I guess I wanted to come back to the systems weakness. And I know you called out supply is the main driver of that.\n\nI'm just curious, particularly the Amp, we noticed the lead times are still really long, what is the challenge there with that product? And do you think there's any macro effect there? Or you really do think that's all just supply? It just seems like it's an expensive product, and it's a specialist installer type of products and wonder how those people are behaving these days in addition to the supply constraints.\n\nBrittany Bagley -- Chief Financial Officer\n\nYeah, Rod, it's a great question. I would say it's one that we have a little bit less visibility on right now just because we haven't had the product in stock to see how that's changed. I can tell you from what we are seeing and as we talk to installers, they continue to have an enormous amount of demand for that product and can't wait for us to get back in stock on it. It is one of the products where we've had the biggest challenge from a component standpoint.\n\nAnd I think you can tell from my gross margin commentary in Q4 that we are doing absolutely everything we can to get the components we need to get that product back in stock, and it's back by the end of Q4 and certainly by Q1 that we'll be back to the inventory levels that we need on Amp.\n\nRod Hall -- Goldman Sachs -- Analyst\n\nGreat. OK. Thanks, Brittany. Thank you.\n\nBrittany Bagley -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of John Babcock with Bank of America. Your line is now open.\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nHey, thanks for taking my question. I guess just following up on that, discussion on the supply chain. Could you just talk about general trends in that area and also trends for component cost and how that's looking for you?\n\nBrittany Bagley -- Chief Financial Officer\n\nYeah. It is thankfully starting to --\n\nPatrick Spence -- Chief Executive Officer\n\nShe is on mute.\n\nBrittany Bagley -- Chief Financial Officer\n\nSorry, I was on mute. Thank you, Patrick. You knew I was talking. I would say we have seen improvement in that area.\n\nSo I would say, particularly on shipping and logistics that I called out in my remarks. We have started to see some improvement there. We have started to see some improvement from a component standpoint. There are still components that are challenging to get.\n\nBut between the work our teams have done, as we've talked about on past quarters to really get as many components in as we can. I think as we look ahead, where we are seeing improvement in both our ability to maintain supply. I think as demand has softened a bit, not just for us, but for others in the industry as well, that's also going to provide some easing from a supply chain standpoint.\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nGotcha. And then just generally, as we get into the first quarter of '23 and well, I guess, really only now in the fourth quarter. But as you move into the first quarter '23 and say things don't improve from a macro standpoint, how will you ultimately think about product launches then? I mean is the goal to get our product launches that you were thinking about ahead of the holiday season, so you launched in that quarter anyway. Or do you continue to push that back? I mean what's the general approach or thinking around that?\n\nPatrick Spence -- Chief Executive Officer\n\nWe always consider the type of product that it is, John, and the timing around that. So we're trying to take as many factors as we can to account. Obviously, readiness is one of those, but also what is it? So if it was -- so Roam is a great example of making sure that lined up, for instance, with last spring/summer and hitting a time like that. And so I think this is a bit unique in terms of where we are right now.\n\nBut certainly, we'll look to see what the situation is happening on the macro front as we think about the other product launches to make sure we want to set them up for the most success possible. And so we remain committed to at least two new products, two new product launches every year. As you know, we've done five across this year. And so we'll also make sure that we're balancing that with what we need to do to continue to drive progress and reach our long-term targets.\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nYeah, thanks. And then just last question, and maybe it's a little bit early on this from the standpoint. But as it pertains to the Inflation Reduction Act, obviously, some tax changes there. I don't know if you've gotten a chance to kind of go through that provide some initial read, but any color on that would be great.\n\nBrittany Bagley -- Chief Financial Officer\n\nYeah. We have, I would say, just an initial read. But it does not really impact us from a tax standpoint. We still have a valuation allowance up, and we're still not really a taxpayer at this point.\n\nAnd so at least from what we've looked at and for the foreseeable future, not a big impact for us.\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Thank you.\n\nPatrick Spence -- Chief Executive Officer\n\nThanks, John.\n\nOperator\n\nYour next question comes from the line of Erik Woodring with Morgan Stanley. Your line is now open.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nYeah, thanks for taking my question. I guess maybe if we just start on the fiscal 4Q kind of implied guide. I'd love to just kind of get a better sense maybe of the biggest impact or the biggest headwinds to revenue, right? I think Brittany, you implied if you had been able to fulfill backlog and launch a new product that would have delivered, I think it's about $35 million of additional revenue. But correct me if I'm wrong, I don't want to speak out of line.\n\nFX an incremental $17 million headwind. So there's a fair amount that's still left over there. I'd just love to know maybe if you could help us kind of think about rank ordering, what the biggest impact would be for the kind of that remainder of revenue headwind in the September quarter, that would be helpful. And then I have a follow-up.\n\nThanks.\n\nBrittany Bagley -- Chief Financial Officer\n\nYeah, of course, Erik. So we didn't quantify those. What we said is that on a constant currency basis, if we've been in stock on Amp and if we hadn't pushed the product launch, we would have grown. So that's obviously a big part of it.\n\nWe did quantify FX for you at about $17 million. And then I would say the rest of the delta between, I think, what we were hoping to achieve in Q4 and what it looks like we're achieving in Q4 is really what we would attribute to macro softness from a demand standpoint across our product line, including how Ray is delivering. And so that would be sort of the rest of the delta on that change in Q4 guide. And that macro point is both run rate but also this dynamic with retail partner inventory that we've called out.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nRight. OK. That makes a lot of sense. Thank you, Brittany.\n\nAnd then maybe just a quick clarification on -- I know you mentioned higher levels of balance sheet inventory that you'll kind of work through over the next, call it, quarter or two as you get past the holidays. But any way you can help us understand kind of the mix of raw materials there versus finished goods, if there's kind of -- perhaps their comments imply maybe it's more finished goods than it historically would be. But I just want to make sure we're thinking about that correctly. Thank you.\n\nBrittany Bagley -- Chief Financial Officer\n\nYeah, of course. And you'll see the full breakout. We break that out in our Q. So when our Q gets published, you'll see the exact numbers.\n\nI would say it's more on both. We've got more component inventory than we typically hold, and we have more finished goods. We have more component inventory because we've been trying to drive ownership of more components to mitigate some of these supply chain challenges we've had. And then we have more finished goods, I would say, because the demand trajectory relative to what we were ramping to has just changed.\n\nI think the good news for us is our products are long-lived products. We keep them for a long time. They last well. And so it will just be a process for us as we go through Q4.\n\nBut then really as we get into Q1, which is our seasonally highest quarter of working down that inventory. What we have done is we have certainly slowed down the amount of new finished goods that we're producing to spend some time correcting for that inventory. I get back into a more normal inventory position likely at the end of the holiday quarter.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nOK. That's really helpful. Maybe if I could -- just one final follow-up. On the gross margin, I just want to be clear, you obviously, I think, maybe outperformed expectations and posted really nice strong gross margins in the fiscal third quarter.\n\nThat's related effectively just to the timing of some of your -- of when you're paying for components. And the point is your fiscal fourth quarter might seem some more pressure because you're paying up for components for Amp. Is that the right way to think about it? I just want to make sure. And then that's it for me.\n\nThanks so much.\n\nBrittany Bagley -- Chief Financial Officer\n\nYeah, that's exactly the right way to think about it. We are reconfirming and actually narrowing the range on gross margin, gross margins within the guidance that we put up last quarter in terms of where we thought we would land the year. It's still within our long-term targets, but you see a pretty big difference between Q3 and Q4, and that difference between Q3 and Q4 really is about that timing of when we take the extra charges on some of that components bought by inventory that we built in. Again, it's not entirely on Amp, but a lot of it can be attributed to Amp and getting back in stock on that.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nOK. Thank you so much, guys.\n\nBrittany Bagley -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Tom Forte with D.A. Davidson. Your line is now open.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat. Thanks. A couple of quick follow-ups for me. So in the press release, you talked about delaying your long-term financial targets.\n\nCan you give any color on what that means and what delaying means?\n\nPatrick Spence -- Chief Executive Officer\n\nYeah. Tom, it's Patrick. We believe that those targets are the right ones to be shooting for. You can see that we have proven time and time again to be in that gross margin range.\n\nSo we're very comfortable in terms of the way that we've delivered and continue to deliver on that. We've been in the adjusted EBITDA range there and believe it's very attainable given the way that we manage the business and the way we think about the future. And this is really a matter of the macroeconomic headwinds hitting in such a way that we think it will just take a little longer to get to that $2.5 billion. And so as the macroeconomic headwinds start to ease, we'll certainly put more color around it as we see that, but that hopefully gives you some idea of the way we're thinking about this.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat. Thanks, Patrick. Two more quick ones. So I'd appreciate your current thoughts on M&A.\n\nAsset valuations have come down across the board. Can you just give your updated thoughts here on your strategy?\n\nPatrick Spence -- Chief Executive Officer\n\nYeah. I mean you saw us pick up Mayht and close that in the quarter, and we were super excited about what the breakthrough technology enables for the future. We -- obviously, in a period like this, we want to be both cautious but opportunistic in terms of what's out there and what can help accelerate our road map. We have a lot underway right now.\n\nWe have more underway across a variety of different initiatives than we ever had. So I want to balance that and make sure we're doing that in an effective way. We talked about the fact that we're making sure that we're investing every dollar in a smart way and taking a hard look at that. So we'll continue to be focused on that and driving the sustainable profitable growth we've talked about before our IPO.\n\nAnd we'll look for those opportunities if they come up. We're committed to both the organic and the inorganic investments to make sure that we can take more and more of that $96 billion audio market.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat. Thanks. Last one, and thanks for taking all my questions. And I apologize for not knowing this answer in advance.\n\nBut can you talk about to what extent, if at all, your operating expenses are in local currencies and not U.S. dollar?\n\nBrittany Bagley -- Chief Financial Officer\n\nNo need to apologize. They are predominantly in local currencies.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nThank you, Brittany.\n\nBrittany Bagley -- Chief Financial Officer\n\nOf course.\n\nOperator\n\nThere are no further questions at this time. I turn the call back over to Patrick Spence.\n\nPatrick Spence -- Chief Executive Officer\n\nThanks, Emma, and thanks, everybody, for your questions. As I mentioned, we're focusing on what we can control at this point. We are investing in a tremendous amount of new innovation and new products that we think are going to help us come out of these macroeconomic headwinds in an even stronger position. And so we're excited about what the future brings, and we put ourselves in a strong financial position to weather these macroeconomic headwinds.\n\nAnd so that's exactly what we will do for as long as they present themselves, and we'll look for every opportunity to continue to grow and keep heading toward the long-term targets. So thanks, everybody. And again, many thanks to Brittany for everything she's done for Sonos over the last decade of working together. We'll miss her and wish her well on her next adventure.\n\nThanks, everyone. We'll talk to you soon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJames Baglanis -- Head of Investor Relations\n\nPatrick Spence -- Chief Executive Officer\n\nBrittany Bagley -- Chief Financial Officer\n\nEddie Lazarus -- Chief Legal Officer\n\nTom Forte -- D.A. Davidson -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nRod Hall -- Goldman Sachs -- Analyst\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nMore SONO analysis\n\nAll earnings call transcripts"
}