{
  "companyName": "CVS Health",
  "companyTicker": "CVS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/cvs-health-cvs-q3-2022-earnings-call-transcript/",
  "content": "CVS Health (CVS -0.28%)\nQ3 2022 Earnings Call\nNov 02, 2022, 8:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, good morning, and welcome to the CVS Health third-quarter 2022 earnings conference call. [Operator instructions] As a reminder, today's conference is being recorded. I would now like to turn the call over to Larry McGrath, senior vice president of business development and investor relations for CVS Health. Please go ahead.\n\nLarry McGrath -- Senior Vice President, Business Development and Investor Relations\n\nGood morning, and welcome to the CVS Health third-quarter 2022 earnings call and webcast. I'm Larry McGrath, senior vice president of business development and investor relations for CVS Health. I'm joined this morning by Karen Lynch, president and chief executive officer; and Shawn Guertin, executive vice president and chief financial officer. Following our prepared remarks, we'll host a question-and-answer session that will include Dr.\n\nAlan Lotvin, president, pharmacy services; Daniel Finke, president healthcare benefits; Michelle Peluso, chief customer officer and retail co-president; and Prem Shah, chief pharmacy officer and retail co-president. Our press release and slide presentation have been posted to our website, along with our Form 10-Q that we filed this morning with the SEC. Today's call is being broadcast on our website, where it will be archived for one year. During this call, we will make certain forward-looking statements, reflecting current views related to our future financial performance, future events, industry, and market conditions, including impacts related to the ongoing COVID-19 pandemic, as well as the expected consumer benefits of our products and services, and our financial projections, and the benefits of the proposed acquisition of Signify Health, Inc., and the associated integration plan, expected synergies, and revenue opportunities.\n\nOur forward-looking statements are subject to significant risks and uncertainties that could cause actual results to differ materially from currently projected results, including with respect to the ongoing COVID-19 pandemic, and the proposed acquisition and the integration of Signify Health. We strongly encourage you to review the reports we file with the SEC regarding these risks and uncertainties, including our most recent annual reports on Form 10-K, our recent current reports on Form 8-K, this morning's earnings press release, and our Form 10-Q. During this call, we will use non-GAAP measures when talking about the company's performance and financial conditions, and you can find a reconciliation of these non-GAAP measures in this morning's press release and in the reconciliation document posted to the investor relations portion of our website. With that, I'd like to turn the call over to Karen.\n\nKaren?\n\nKaren Lynch -- President and Chief Executive Officer\n\nThank you, Larry. Good morning, everyone, and thanks for joining our call today. CVS Health delivered another outstanding quarter. Based on our strategic progress and confidence in our execution, we are raising our adjusted earnings per share guidance for the third consecutive time this year to a range of $8.55 to $8.65.\n\nDuring the third quarter, we grew revenue by 10% versus the prior year to over $81 billion and grew adjusted operating income by nearly 4% over the prior year to $4.2 billion. Adjusted earnings per share in the quarter was $2.09, an increase of over 6% from the prior year. Our cash flow from operations was $9.1 billion in the third quarter and $18.1 billion year-to-date. Throughout 2022, we consistently executed on our strategy centered around expanding our capabilities healthcare delivery.\n\nWe are increasingly delivering broader access to quality care, simpler journeys, and better outcomes at lower costs across our channels. With the announced acquisition of Signify Health, we will strengthen our engagement with consumers. We will add best-in-class capabilities that enable in-home services and care coordination, as well as a platform to accelerate value-based physician enablement. Together, we will have a strong foundation for developing new product offerings consistent with our payer-agnostic approach.\n\nWe project that this transaction will close in the first half of 2023. We continually evaluate our portfolio of assets for nonstrategic areas that do not fit our long-term priorities. In October, we reached an agreement to sell Bswift and are actively exploring strategic alternatives for Omnicare. As we divest assets, we will continue to invest in areas aligned with our strategy with a disciplined approach to capital allocation.\n\nThis morning, we made an important announcement on our ongoing opioid legal matter. In late October, we began a mediation to resolve substantially all opioid lawsuits and claims against CVS Health by state, political subdivisions, and tribes. We reached an agreement in principle to pay approximately $5 billion over 10 years beginning in 2023, an outcome that is in the best interest of all parties and one that will help put a decade-old issue behind us as we continue to focus on delivering a superior health experience for the millions of consumers who rely on us. Let's turn to each of our foundational businesses and discuss their strong results.\n\nThe healthcare benefits segment had another strong quarter. Revenues for the segment grew nearly 10% year over year with adjusted operating income of $1.5 billion. Our medical benefit ratio of 83.5% improved by 230 basis points versus the prior year, driven by a lower impact from COVID and medical cost trends that remained favorable. Enrollment in our Medicare and commercial businesses was strong this quarter, with our individual Medicare Advantage and PDP portfolio exceeding market growth once again.\n\nThe 2023 Medicare annual enrollment period is underway, and we are well-positioned for another year of growth in our individual Medicare and dual-eligible products. We remain a leader in offering $0 premium plans, with more than 73% of our plans in that category.We also continued our geographic expansion in the D-SNP and now offer plans to 61% of D-SNP eligible population of more than 8% year-over-year. We were disappointed that the star rating on our national PPO contracts fell to 3.5 star after nearly a decade-long track record of performing at 4 stars or better. We have a strong history of delivering affordable, high-quality plan benefits and a commitment to continuous improvement.\n\nImproving our star performance continues to be a top priority for the company. We have the right actions in place to improve our star rating with our ongoing quality and experience efforts as we address the specific measures scored on the member surveys that contribute to star ratings. We will continue to focus on our members and invest in programs and processes specifically designed to simplify and improve their healthcare experience. This is an important priority for the company.\n\nIn our commercial business, our growth is driven by the combination of our competitive cost structure, our integrated benefit design, and services that utilize CVS Health platforms and capabilities. We achieved a key milestone this quarter with more than 2 million members enrolled in our integrated Aetna and Caremark products. This important goal demonstrates the value we provide our customers through our combined CVS Health offerings, a strong proof point of our strategy. Turning to our ACA individual exchange platform, we expanded our footprint and will be available in a total of 12 states beginning in January of 2023, covering 5.5 million lives or nearly 40% of the individual exchange population.\n\nOur co-branded product offerings include instant access to providers with 24/7 virtual care and face-to-face access in our MinuteClinic locations. We are committed to helping provide access to affordable care for all Americans. Finally, our Medicaid platform continues to be an important area for growth. We grew our OhioRISE program after a successful implementation and have been chosen by the State of Louisiana to serve a portion of their Medicaid-eligible children due to the deep expertise we've built to engage and support children, their caregivers and their families.\n\nWe had expanded our capabilities with a focus on quality and member engagement through our CVS Health community channel as we enter a robust bid period. In Pharmacy Services, our revenue grew nearly 11% with adjusted operating income of $1.9 billion. Specialty Pharmacy revenue grew 22% year-over-year, driven by our industry-leading cost management and service excellence that continue to differentiate us in the marketplace. We closed out another successful selling season, driving $3.5 billion of gross new business for 2023 and a client retention rate of nearly 98%, evidence of the strength of our portfolio of capabilities.\n\nEfforts are underway to support a successful welcome season for our members. Last week, we learned that Centene decided to move their business to a competitor in 2024. While we hope to continue our relationship with Centene and bid to do so, we also maintained our pricing discipline. For the remainder of the contract, we will work with Centene to facilitate a seamless transition for members.\n\nEven after moving this contract, our purchasing power and our ability to drive value for our customers will not be diminished. Our demonstrated success in growing lives under management and revenue is a testament to our high-quality service, compliance capabilities, and specialty pharmacy excellence. Our pharmacy services segment will remain an important driver of growth within CDSL in the years to come. Our retail/long-term care segment also continues to outperform expectations.\n\nRevenues in the quarter grew nearly 7% versus the prior year with $1.4 billion in adjusted operating income. Performance in both the front store and pharmacy was strong. Front store sales were up approximately 4%, driven by growth across the majority of our categories. Demand for COVID vaccines and over-the-counter tests as well as cough, colds, and flu products remain high.\n\nIn pharmacy, scripts grew 1.8% year over year in the third quarter or 3.6%, excluding COVID vaccines. This growth helped propel our retail pharmacy business to another quarter of year-over-year market share gains, extending a trend that started in the first quarter of 2020. Our community retail health destinations play a strengthening role in the overall well-being of the consumers we serve. As demand for health products and services continues to be elevated, we are implementing new digital capabilities that provide a seamless and convenient consumer experience.\n\nNow, most of our pharmacists are empowered to prescribe COVID antiviral treatment. Our investments in omnichannel health are enhancing transparency and helping consumers better manage their overall health. While there is growing economic uncertainty and recession expectations in 2023, we are well positioned across our foundational businesses to manage through these potential headwinds. We are increasingly delivering connected experiences and health solutions that improve overall well-being.\n\nMore and more, we are there for every meaningful moment of our consumers' health. Throughout 2022, we made significant progress advancing our strategy. building a strong foundation for healthcare delivery and expanding our health service offerings, and developing new products. In October, we announced that Dr.\n\nAmar Desai has joined CVS Health to lead our healthcare delivery strategy. Dr. Desai's experience in transforming the healthcare system and driving value-based care will accelerate our vision of becoming the leading health solutions company and our efforts to improve healthcare for consumers. 2022 has also been an important year for growing our digital presence and capabilities.\n\nThis quarter, we added another approximately one million digital customers. CVS Health now serves more than 46 million unique digital customers, an impressive 11 million more since this time last year. Our digitally led omnichannel health approach prioritizes experience that matter most for consumers. This includes advancing our digital tools for a seamless and convenient experience, leading to higher engagement and satisfaction.\n\nFor example, we recently launched a new functionality that drives more choice and convenience for patients filling prescriptions. Patients can expedite urgent prescriptions, have visibility into out-of-pocket costs, and track their order status, all before even coming into our pharmacy. We continue to make strong progress on ESG. For example, we are working to decrease disparities with our focus on women's health as it relates to accessing quality and convenient healthcare.\n\nAs part of our Here for Her initiative, we are launching a variety of new MinuteClinic virtual care services to support women's health that will be available 24/7. And finally, I want to take this opportunity to again thank our CVS Health colleagues, especially those in Florida and Puerto Rico, who faced natural disasters. Our teams pulled together to ensure care continuity for our customers and the communities that we serve. I will now turn it over to Shawn for a deeper look into our operational and financial results and outlook.\n\nShawn Guertin -- Executive Vice President and Chief Financial Officer\n\nThank you, Karen. And good morning, everyone. Our third quarter results reflect the continuation of the strong performance observed in the first half of 2022 as we exceeded our expectations for revenue, cash flow generation, and adjusted earnings per share. This momentum allows us to again raise our 2022 adjusted EPS guidance to a range of $8.55 to $8.65 per share.\n\nA few highlights regarding overall company performance. Third-quarter revenues of over $81 billion increased by 10% year-over-year, reflecting robust growth across each of our operating segments. We delivered adjusted operating income of $4.2 billion and adjusted EPS of $2.09, representing increases of 3.9% and 6.1% versus prior year, respectively. Our ability to generate cash remains strong.\n\nOur cash flow from operations was $9.1 billion in the third quarter and $18.1 billion year-to-date. Cash flows in the quarter benefited from the timing of CMS payments that are expected to normalize in the fourth quarter. Looking at performance by business segment. In healthcare benefits, we delivered strong revenue and adjusted operating income growth versus the prior year.\n\nThird-quarter revenue of $22.5 billion increased by nearly 10% over the prior-year quarter. Membership grew 2.5% year over year despite the divestiture of 283,000 lives from Aetna International earlier this year. Our Medicare franchise remains a strong growth opportunity for us, adding 75,000 members sequentially across our portfolio of solutions for individuals and employers. Underlying growth in our commercial business also remains strong.\n\nWe are excited about the prospects of our individual exchange business, which now includes 12 states as of January 1, 2023. The sequential decline in Medicaid membership is driven by a previously disclosed contract loss, partially offset by the ongoing suspension of redeterminations. Adjusted operating income of $1.5 billion increased 39.6% year-over-year, primarily due to the impact of higher COVID costs in third quarter 2021. COVID pricing actions we took this year and strong underlying performance, partially offset by incremental investments to support growth in the business and net realized investment portfolio losses.\n\nOur medical benefit ratio of 83.5% improved 230 basis points year-over-year, reflecting lower impact from COVID and medical cost trends that remain modestly favorable to our pricing assumptions. Consistent with last quarter, medical cost trends in our commercial business remain generally in line with pre-pandemic trended baselines, and government remains slightly lower than the pre-pandemic trended baselines. Consolidated days claims payable at the end of the quarter was 54.9%, up 0.6 days sequentially as reserves grew at a modestly higher rate than premiums. Overall, we remain confident in the adequacy of our reserves.\n\nIn the pharmacy services business, our ability to deliver industry-leading drug trend for our clients, our specialty management capabilities, and outstanding customer service levels continue to drive growth. During the third quarter, revenue of over $43 billion increased by nearly 11% year over year, driven by pharmacy claims growth, specialty pharmacy, and brand inflation, partially offset by the impact of continued client price improvements. Total pharmacy claims processed increased by 3.6% above prior year and 4.5% when excluding COVID-19 vaccinations, primarily attributable to new business in 2022 and increased utilization. Total pharmacy membership remains steady, exceeding 110 million members as growth in commercial and government lives helped to offset significant membership losses from the California Medicaid carve-out that started this year.\n\nAdjusted operating income of $1.9 billion grew nearly 6% year over year, driven by improved purchasing economics, including increased contributions from the products and services of our group purchasing organization. This was partially tempered by ongoing client price improvements. Quarterly contribution from our 340B product lines improved in the third quarter, in line with our estimates as covered entities address manufacturer conditions for program participation. In our retail/ long-term care segment, we delivered strong revenue growth and adjusted operating income above our expectations despite mixed COVID-related trends and continued economic uncertainty.\n\nSpecifically, during the third quarter, revenue of $26.7 billion grew nearly 7%, reflecting increased prescription and front store volume, including the sale of COVID-19 over-the-counter test kits as well as pharmacy drug mix and brand inflation. These increases were partially offset by a decrease in COVID-19 diagnostic testing and vaccinations, the impact of recent generic introductions, and continued pharmacy reimbursement pressure. Adjusted operating income of $1.4 billion declined 18.9% versus prior year, driven by decreased COVID-19 diagnostic testing in vaccinations, continued pharmacy reimbursement pressure, as well as increased investments in the segment's operations and capabilities. These decreases were partially offset by the increased prescription and front store volume, improved generic drug purchasing, and the favorable impact of business initiatives.\n\nPharmacy prescription volume grew 1.8% year over year, reflecting increased utilization. Excluding the impact of COVID, pharmacy prescription volume increased by 3.6% year over year. Turning to the balance sheet. Our liquidity and capital position remain excellent.\n\nYear-to-date, we generated cash flow from operations of $18.1 billion, and ended the quarter with $7.9 billion of cash at the parent and unrestricted subsidiaries. Cash flows during the quarter were positively impacted by the early receipt of $3.2 billion of CMS payments, which will normalize in the fourth quarter. During the quarter, we repaid $2.6 billion of long-term debt. Through our quarterly dividend, we returned $726 million to shareholders.\n\nWe remain committed to maintaining our investment-grade ratings while also having the flexibility to deploy capital strategically for capability-focused M&A. A few other items worth highlighting for investors. We continue to experience the impact of market volatility on our investment portfolio and recorded net realized capital losses of approximately $110 million in the quarter. These losses emerged predominantly in the HCB segment.\n\nWe were not immune to the impacts of Hurricane Ian and recorded losses of approximately $40 million related to damages from the storm. We recorded a pre-tax loss on assets held for sale of $2.5 billion related to the write-down of our long-term care business, Omnicare, where we are in the process of exploring strategic alternatives. We also recorded pre-tax charges of $5.2 billion for legal settlements related to agreements in principle with certain states and governmental entities to resolve opioid claims. Consistent with past practice, these GAAP impacts have been excluded from our adjusted operating metrics.\n\nTurning to our 2022 outlook. We are raising the midpoint of our adjusted earnings per share guidance by $0.10 to a range of $8.55 to $8.65. This increase reflects favorable underlying third-quarter performance in retail and HCB, an improved Q4 outlook for the retail LTC segment, and slight improvement in the full-year outlook for tax rate and share count, partially offset by the anticipated impact of market volatility on net investment income for the HCB business. We are narrowing our full-year adjusted operating income guidance in healthcare benefits to a range of $5.96 billion to $6.02 billion.\n\nThis reflects the previously discussed strong underlying fundamental performance, offset by continued caution on our outlook for investment income given the volatile rate environment. Our outlook also contemplates the extension of the public health emergency into the early part of the first quarter of 2023. For the retail LTC segment, we are raising and narrowing full-year guidance as follows. Revenue increases to a range of $102.7 billion to $104.0 billion.\n\nAdjusted operating income guidance increases by $105 million at the midpoint to a range of $6.66 billion to $6.72 billion. We now forecast that we will administer 28 million COVID-19 vaccinations in 2022 with approximately 70% already administered through the third quarter of 2022. We expect full-year diagnostic testing volumes of approximately 17 million, which is down from our prior outlook. However, we now expect higher sales of over-the-counter test kits, exceeding 65 million units or nearly triple the number of kits sold last year.In aggregate, we expect these 3 categories of COVID-driven items to continue to produce over $3 billion of revenue in 2022, a decline of approximately 29% versus 2021, but reflective of the endemic tail of COVID on our retail business.\n\nOur updated outlook also contemplates higher levels of investment spending in the fourth quarter as we continue to invest in our workforce and enhance our customer experience. In pharmacy services, we are narrowing our outlook range and now project full-year adjusted operating income guidance to be between $7.31 billion to $7.40 billion. Looking at the enterprise as a whole, we anticipate continued strong cash flow from operations in 2022 and have raised our guidance accordingly to a range of $13.5 billion to $14.5 billion, with capital expenditures unchanged at a range of $2.8 billion to $3.0 billion. We are also updating our guidance on share count to a range of 1.325 billion to 1.33 billion shares and on an effective tax rate to 25.5%.\n\nAs Karen noted earlier, we have reached an agreement in principle to resolve substantially all opioid lawsuits and claims against CVS Health, providing increased clarity regarding this long-standing issue. The agreement amount to be paid is approximately $5 billion and will be paid over 10 years beginning in 2023. The timing of cash settlement payments spread over multiple years results in an annual impact to our cash flows that enables us to continue to invest in our strategic priorities. While we will offer detailed 2023 guidance on our fourth quarter call in early February, I wanted to offer some high-level commentary as investors think through our potential financial performance in 2023.\n\nWe need to consider several factors as we determine the 2022 baseline. First, prior-year reserve development improved our year-to-date 2022 adjusted operating income by over $217 million or approximately $0.12 of adjusted earnings per share, and we do not forecast prior-year reserve development to recur in future periods. Second, due to the turbulent rate environment, we have experienced unanticipated headwinds in our net investment income in 2022. As we look at the full year, these headwinds could exceed $350 million or over $0.20 in adjusted EPS.\n\nIn 2023, we plan to use a reporting convention that excludes capital gains and losses from adjusted operating income, consistent with how Aetna, which bears the vast majority of these impacts, reported these items prior to the acquisition. Third, in the second quarter of 2022, we strengthened reserves in our legacy Aetna long-term care insurance business, which reduced adjusted operating income by $108 million or approximately $0.06 per share. This adjustment was the first time we significantly adjusted this reserve since the Aetna acquisition, and we do not currently project we will need to make additional adjustments to this reserve in 2023. Fourth, we have made great progress this year in rationalizing our portfolio to focus on those businesses that will drive the highest growth for our enterprise over the long term.\n\nWhile none of these divestitures, which include PayFlex, Bswift. And portions of our Aetna international business are material on their own, collectively, they present a 2023 headwind of approximately $0.04 in adjusted EPS. In addition to those specific adjustments, we are projecting that our retail LTC segment will have over $3 billion of revenues in 2022 from COVID, which have a robust margin profile. It is not prudent to anticipate a similar level of COVID-based revenues going forward.\n\nAnd we expect that the economics on vaccines and diagnostic testing will change following expiration of the public health emergency, which we project will happen in the early part of the first quarter of 2023. As detailed in our third quarter slide presentation, starting with the midpoint of our updated adjusted EPS guidance range of $8.60 and adjusting for these items creates a 2022 baseline of approximately $8.20. Shifting to our view on 2023, there are a number of headwinds and tailwinds that we are contemplating as we develop our outlook. In our retail business, we plan to continue to offset reimbursement pressure and wage improvements with continued script growth and purchasing improvements, as well as front store growth and benefits from our store footprint optimization efforts.\n\nWe remain committed to generating at least $6 billion of adjusted operating income in this segment in 2023, consistent with the targets we outlined at our Investor Day in December of 2021. In PSS, we are targeting mid-single-digit growth over our baseline. New sales wins and growth in specialty generic and biosimilar launches will help drive this result, combined with stabilization of 340B dynamics and a continued focus on efficiencies. In healthcare benefits, we will continue to target mid- to high single-digit growth.\n\nThe strength of our Medicare Advantage offering in 2023 and continued membership growth, including in individual and group Medicare, will help to offset losses from Medicaid redeterminations and our divested assets to drive top-line growth. Continued disciplined pricing and efficiencies will help to drive adjusted operating income growth. Capital deployment remains an important part of our growth equation, and we expect to repurchase shares in 2023 opportunistically to ensure we achieve our targets and to offset dilution. Our preliminary outlook does not include any impact from the announced acquisition of Signify Health, which we continue to project will close in the first half of 2023 and be accretive to adjusted EPS.\n\nTaking all these factors into consideration, our initial goal in 2023 is to grow our adjusted EPS to a range of $8.70 to $8.90. At the midpoint, this range is consistent with the high single-digit outlook we provided at our Investor Day last December. Before we conclude, I want to discuss the recent 2024 Medicare Stars updates. We are very disappointed with our Medicare Stars results for 2024 but remain dedicated to providing our Medicare Advantage members with the high quality and service that they have come to expect.\n\nWe also remain committed to maintaining a competitive product and benefits offering in 2024, and to continue to grow Medicare Advantage membership throughout this period. The change in Star Ratings is not projected to impact our 2022 guidance, and we expect to be able to manage the impacts to 2023 and including costs to improve our 2024 Star Ratings. Our intent is to mitigate some of the financial impact of lower Star Ratings in 2024 through our ongoing contract diversification efforts, combined with a variety of operational initiatives as we work to find additional efficiencies. Even if successful, given the magnitude of this headwind, it is appropriate to assume that these efforts alone, while potentially significant, will not close the entire GAAP.\n\nThe recently announced loss of the Centene contract places further pressure on our 2024 outlook. Importantly and to be absolutely clear, the powerful capital generation capabilities of our enterprise provide us the financial capacity to increase share repurchase in excess of the $8 billion of our remaining authorization and produce adjusted EPS consistent with our 2021 Investor Day outlook, which had implied adjusted EPS in the range of $9.75 to $9.95 in 2024. While this would achieve a 2024 EPS objective, repurchasing shares alone will not advance the strategic positioning of the company. Alternatively, strategic capital deployment may not yield the same adjusted EPS accretion in 2024 as share repurchases but could further advance our care delivery strategy and help sustainably accelerate the adjusted EPS growth rate of CVS Health.\n\nAbsent deploying capital toward further strategic acquisitions, investors should expect that we will deploy capital toward share repurchases to address our 2024 earnings headwinds. We remain committed to using our liquidity to help achieve both our long-term and near-term goals. To conclude, our third quarter results reflect continued strength from all our core business segments, and we are pleased to raise our full-year 2022 adjusted EPS guidance. Our focus on growth and operational execution persists, and we continue to progress on our long-term strategy.\n\nWe will now open the call to your questions. Operator?\n\nOperator\n\n[Operator instructions] We'll take our first question from Lisa Gill with JP Morgan.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nThanks very much, and Good morning. Shawn, thank you for all that detail. I just really want to go back to the last comment that you made and just really understand how you and Karen are thinking about this. One, you talked about hiring Dr.\n\nDesai as head of healthcare delivery. And as we think about that strategy going forward? Is it, one, you haven't found an acquisition that fits? Two, do you think that there's organic opportunities? And I do appreciate that if something doesn't come along, you're going to buy back shares. But I think as investors think about your story longer term, they want to see you really propelling the strategy that you and Karen laid out last year. So that would be my first question.\n\nKaren Lynch -- President and Chief Executive Officer\n\nYes, Lisa, it's Karen. So let me start. You're right. We laid out a strategy, and we said that we wanted to expand into healthcare services.\n\nWe said that we wanted to have primary care. We thought we would need an acquisition to do that. We also said we wanted to extend into the home and have provider enablement to the Signify acquisition. That represents strong execution this year of our strategy.\n\nWe will continue to evaluate our options on primary care. And as I said, we believe that we need to do M&A, and we continue to evaluate those options in the marketplace.\n\nShawn Guertin -- Executive Vice President and Chief Financial Officer\n\nYeah. And, Lisa, I would just echo. I mean, obviously, I think with the 10 months since our Investor Day, we've been at this. I think we've demonstrated, and I've talked to you a lot about the discipline we have around value and capability assessment, and that will be something that we continue to embrace and will remain critical for the future.\n\nSo that, I think, has not changed, but it's certainly something we've embraced. As it pertains to M&A and some of my closing comments, what I would say is keep in mind that the ultimate answer here is a byproduct of the specific attributes of any asset and where we are at a given time in terms of our cash in balance sheet capacity. At our current valuation, an M&A deal is likely less accretive than share repurchase. Having said that, for the right strategic deal, we could opt to use the balance sheet capacity we still have even after these enhanced levels of share repurchase.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. And so just so I understand this, I know you're not giving any kind of guidance yet around cash flow, but is there anything that should be different when we think about cash flow for '23? Just to give us an idea of how much cash flow you'll have available for something in this area.\n\nShawn Guertin -- Executive Vice President and Chief Financial Officer\n\nI think in the broad strokes of the year, it's going to be a similar year. Obviously, I think we think capex will be in a comparable position. And obviously, regulatory capital is a byproduct of the growth in the business, and we'll look at that as well. But our sort of baseline assumption that is behind my commentary today is a similar level of cash flow that we're talking about for this year in the same neighborhood.\n\nAgain, we'll provide more detailed guidance on the Q4 call. But the '23 capacity, I think, is very sound and intact.\n\nOperator\n\nAnd we'll take our next question from Justin Lake with Wolfe Research.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nThanks. Good morning. I'll start with my follow-up to Lisa's question gear. Shawn, during your prepared comments at the end there, you gave at least me the impression that there was kind of an if-then statements on this physician -- on the potential for a physician deal versus share repurchase in the ability to hit 2024.\n\nSo I just want to clarify. Are you saying that if you do a large physician group purchase, obviously, that advances the strategy, but if you do that, you probably don't have enough capital to buy back shares and still hit the 2024 low double-digit EPS estimate? So you can hit the low double digits, if you go do a physician deal, you -- that number becomes at risk if you do a physician deal?\n\nShawn Guertin -- Executive Vice President and Chief Financial Officer\n\nYeah. What I'm saying is it's hard for me to be completely definitive when we're talking about a hypothetical asset, right? And so what I will say to you is we have done modeling where we can achieve both objectives. And obviously, we think it's the job of management to always try to achieve your near-term and your long-term objectives. Again, the ultimate answer around that will be dictated by the specific asset and the timing of when we have to fund for that asset, so in the absence of sort of having sort of an actual deal in hand where I could be more definitive.\n\nBut let me be clear. Our goal is to try to achieve both. We think there is a pathway to achieve both, but ultimately, the specifics of having a deal in hand. I'll also clarify, if we don't have the deal, I think I was pretty clear in my remarks, then we will continue to proceed with repurchase and as we march toward achieving those objectives.\n\nSo that, I think, again, in the absence of having sort of something specific to talk about, I think that's the framework I'd like you to understand.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nThat's helpful. And then my question was just around, you mentioned a couple of headwinds to 2024, specifically the '17 loss in the Stars. I assume there's probably a little much to ask for exact potential impacts from that, but maybe you could just put it in the context of the long-term growth targets in those businesses over the PBM. I think it's mid-single digits.\n\nAnd for the healthcare benefit, it's mid to high. Maybe you could talk about how to view the lens to view 2024 in those businesses with those specific headwinds. Thanks.\n\nShawn Guertin -- Executive Vice President and Chief Financial Officer\n\nYeah. Let me talk about the 24 headwinds a little bit more specifically. We project the combined impact of Stars and Centene on 2024 to be approximately $2 billion on an unmitigated basis. My comments today regarding repurchases and achieving our Investor Day commitments, assume that we're successful in mitigating approximately half of this headwind.\n\nThat work is in process and underway, but obviously not 100% certain at this stage. That would leave a headwind of about $1 billion or $0.55 a share for 2024. The amount of repurchases required to combat that headwind could be up to $10 billion. But obviously, the actual amount can vary based on assumed share price and the cost of any debt financing.\n\nAnd going to Lisa's question about capacity, this is an amount that we have the cash and balance sheet capacity to handle and stay within our leverage metrics for 2023.\n\nOperator\n\nWe'll take our next question from Michael Cherny with Bank of America.\n\nMichael Cherny -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thanks for the question. Maybe one just a clarification and then a separate question. With regards to the '23 bridge, can you just let us know in terms of what's preliminarily target on: a, that $0.50 COVID net headwind, that does include some COVID contribution.\n\nAnd then the healthcare benefits mid-to-high-single-digit growth, any way to couch out or tease out what you have in there relative to the investments around the Stars performance?\n\nShawn Guertin -- Executive Vice President and Chief Financial Officer\n\nWe've contemplated whatever SG&A investments that we need to make in that outlook for next year, and we will make some, obviously, and that has been contemplated. I'm glad you asked about COVID and retail because I just want to make sure that everyone's grounded in that. As we mentioned, we're still around $3 billion of revenue. We've talked about the margin profile in that business before.\n\nIn that $0.50, there's an item or 2 that actually kind of goes the other way like the hurricane, for example. But you're talking about probably removing $900 million of operating income on COVID-related categories in retail, which if you went back through each quarter's guidance increase, that's about what we've raised the guidance sort of over the course of the year. So we're resetting back to a number there for comparison purposes to something that's closer to sort of how we kind of entered the year. Again, I think this year is a good demonstration that there's an endemic tail to this business going forward.\n\nAnd so we are expecting some contribution likely not as high as we thought coming into this year. But again, that's also baked into our outlook of getting to $6 billion on that business.\n\nMichael Cherny -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And then I don't mean to keep this completely hypothetical, but obviously, I'm not going to ask you about what could or could not happen with the primary care side on M&A. I am going to ask on what you're doing on an organic basis. And how should we think about the build-out that you're going to be putting in place investments you're going to be making while you do wait for a deal to come or not to come to fruition?\n\nKaren Lynch -- President and Chief Executive Officer\n\nHey, Michael, it's Karen. Yes. So first of all, obviously, we just hired Dr. Desai to help us really clarify our longer-term clinical care delivery strategy.\n\nWe have been making investments across all of our businesses to support healthcare delivery. We've made investments in the clinic to extend our services. We've been making investments in the front store to extend our health and wellness, and we're really driving at our integrated products to drive growth of the top line. And we're having very strong progress around that, so we continue to invest in products and service capabilities to make sure that we are competitive in the marketplace.\n\nSo all across the company, we've been making investments to advance our strategy, and what I would say is that we are continuing to perform on our strategy. I think a good evidence of that is our Signify acquisition. I think that gives you a good sense that we're executing strongly. We said we wanted to be in the home.\n\nWe'll make investments around that. And as I said, we expect to close in the first half of 2023.\n\nOperator\n\nWe'll take our next question from A.J. Rice with Credit Suisse.\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nHi, everybody. I guess I'm doing two quick cleanups hopefully here from previous questions. For the '23 outlook, you don't have Signify in there, but you think it's going to close in the first half of the year, and you have this Omnicare sale you're pursuing. Any way to bracket what the range of potential accretion Signify might represent? And would an Omnicare sale be a positive or negative to the outlook? And then just maybe a little more on the mitigation efforts.\n\nIt sounds like half of the mitigation for '24 or half of -- yeah, you're offsetting -- you said about half of the headwind with mitigation. I'm specifically wondering, with your national PPO, how you can move that. I know we used to be able to just collapse plans, but it's a little tougher these days to move members. Can you talk a little bit about what you're doing with all of that?\n\nKaren Lynch -- President and Chief Executive Officer\n\nHey, A.J., I'll start, and then Dan and Shawn will clean up. Relative -- I just want to go back to your question on Omnicare, I think it's important for you also recognize that we continue to evaluate our portfolio strategically and are making decisions around assets that don't fit into our portfolio. Strategically, Omnicare is a good example of that. Bswift was a good example of that.\n\nAnd as Shawn said earlier this year, we made divestitures as part of our international business and PayFlex as well. Regarding Stars -- and I'll let Shawn talk about the financials in a second. Just a comment on Stars, I would just say kind of across the industry, everyone was challenged with Stars, and we were extremely disappointed in our 3.5 Star Rating plan. But as you know, we have been a very strong leader in Stars performance for a decade.\n\nAnd we continue to invest. We will continue to invest in our Star performance. We have a number of actions relative to the CAP survey and member scores, which is really part of the driver. We do have a diversification effort.\n\nI'll ask Dan to talk about what we're specifically doing there. But I am confident that we have the activities, the investment and approach to mitigate Stars for 2024. And with that, let me turn it to Shawn to talk about the divestitures, and then Dan will pick up on Stars.\n\nShawn Guertin -- Executive Vice President and Chief Financial Officer\n\nOK. Just on the -- so on the divestitures and obviously, this is -- the timing of all this is still to be determined. But I think if successful on Omnicare, there's probably another $0.02 or $0.03 potentially that I would add to that $0.04 that I described in the bridge for a divested asset. Again, not something that I think that would change our outlook on our range.\n\nBut when you're thinking about the baseline, it would be a sort of a small additional item, but again, when we think is navigable for 2023, and obviously, we think this is the right long-term thing strategically to do for the business. Signify, we will -- when we get to the closing, we'll talk more specifically about the accretion. But you're right, we do not have anything in there right now. But when we get more definitive idea on closing day, we can talk about the accretion on that.\n\nDan Finke -- President, Health Care Benefits\n\nYeah. Let me give you a little bit of flavor of our mitigation strategy. I mean the way I would think about it is we do have a broad mitigation strategy, but there are 2 very specific initiative and approaches that we're pushing. First of all, as Karen said, is our track record around Stars shows that we have a robust Stars and CAPS program, and it's through that program that we've already taken some actions and improved things like benefit improvements.\n\nAn example of that is where we moved 200 drugs to a lower tier for about 650,000 members. We've enhancements to our medication adherence programs and continuous operational efficiencies. With that said, we also have a very intense focus across the enterprise on some targeted actions to drive some improved performance in some of those impactable domain measures. Those are the ones that give us the greatest opportunity to really move the score, so things like gaps in care, member incentives, and experience improvement.\n\nSo really intense program efforts there. On the contract diversification, we do recognize that we've had a concentration of members in one contract. That's largely a result of our own success in using that high-quality, popular contract for expansion efforts, and we've been working on this contract diversification. It's been in progress.\n\nAnd we have some additional tactics that we're taking to achieve that, and we'll update you as things progress.\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nOK. Thanks a lot.\n\nOperator\n\nWe'll take our next question from Eric Percher with Nephron Research.\n\nEric Percher -- Nephron Research -- Analyst\n\nThank you. Question on the potential settlement of $5 billion. I'm interested in your view on state buy-in. Obviously, you want to ring-fence all liability, but where the distributors were national pharmacy chains have very different state penetration.\n\nSo what's your view on the likelihood that all states will sign on? And what's a reasonable goal for among the states and municipalities?\n\nKaren Lynch -- President and Chief Executive Officer\n\nYeah, Eric, let me just give kind of a broad view of opioids. I'll give you our perspective on that. I just want to reiterate that in late October, we did begin our mediation discussions. And as we disclosed today, we have an agreement in principle to substantially close all of the opioid lawsuits and the claims against the company.\n\nAs you mentioned, all conditions have to be satisfied, and that means the state needs to buy in. We have experience in Florida, where we have demonstrated our ability to have those conversations, so we'll be monitoring it across the board. But as Shawn and I both said, this clearly provides us more certainty, and it gives us -- puts a decade-long issue behind us so that we can clearly focus on our strategy of improving health quality and access to care for our customers. I would also tell you that we recognize that the seriousness of the opioid abuse in this conduct has had on so many Americans.\n\nAnd I just would say that we have made significant investments over the years to combat the opioid crisis and continue to do so through our leadership and our behavioral health company. So we are working -- we'll work very closely with the states, Eric, and we're -- we'll keep you updated along the way.\n\nEric Percher -- Nephron Research -- Analyst\n\nI appreciate that. And is there any type of minimum we should think of as required to get this to the finish line?\n\nKaren Lynch -- President and Chief Executive Officer\n\nAt this point, there's not necessarily a minimum. We need to kind of work through and have the states, but recognize that all the AGs were at the table having these discussions over this mediation period, so we have a high degree of confidence.\n\nOperator\n\nAnd we'll take our next question from Elizabeth Anderson with Evercore ISI.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nHi, guys. Thanks so much for the question. I had a question in regards to the 2023 preliminary outlook that you provided, maybe specifically on the pharmacy services business, which we haven't talked about as much. Can you sort of walk us through sort of the puts and takes of that mid-single-digit growth that you're outlining for 2023?\n\nShawn Guertin -- Executive Vice President and Chief Financial Officer\n\nYeah, Elizabeth, I would say it's a fairly straightforward story as it pertains to next year. Obviously, we had another good sales season and good renewal season. We had the normal sort of volume and revenue drivers. We also have the normal headwinds around pricing and things like that that we need to sort of solve for.\n\nSo I think the big thing us year over year is we'll have some stabilization now, I think, in 340B, whereas that was a drag, obviously, this year a little bit on growth. That should turn in the other direction, so that will also be helpful. Obviously, we're still -- we think the timing around biosimilars and specialty generics will be pushed out into the year a little bit in that effect. But Alan, anything you'd like to add to the...\n\nAlan Lotvin -- Executive Vice President of CVS Health and President of CVS Caremark\n\nNo. I think the only thing I would add, Shawn, is continued focus on expense management, on optimizing or minimizing our guarantee exposure. So it's, I would say, very much business as usual with sales growth and kind of 340B stabilization as the changes.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nGot it. Thank you very much.\n\nOperator\n\nAnd we'll take our last question from Ricky Goldwasser with Morgan Stanley.\n\nErin Wright -- Morgan Stanley -- Analyst\n\nGreat. Thanks for taking our questions. This is Erin Wright and Ricky here. But we did see that you signed a value-based care contract with the home health provider announced this week.\n\nHow do you think about the trade-off between partnerships and owning home health assets? And can partnerships such as this help you to fill that gap as opposed to necessarily outright M&A? And then I have a quick follow-up.\n\nKaren Lynch -- President and Chief Executive Officer\n\nWell, Erin, on the home services, as you know, we believe that our Signify Health will close some of the gaps that we have in home, and it will give us a platform to accelerate return to care and provider enablement. So we're -- we've made the decision, obviously, to do an acquisition in the home health space. Obviously, the Aetna business continues to have a variety of different contracts, and we'll continue to look at their network to make sure that they have adequate coverage across the country. And I'll ask Dan if there's anything else he wants to add.\n\nDan Finke -- President, Health Care Benefits\n\nKaren, I would just add that value-based contracting has been a key portion of our strategy for a long time in HCB, and it continues to be. It's a way that we can provide value not only to our providers, but also to customers. As you think about the acquisition strategy, that only enhances our ability to provide a really strong network, and so I would think about those as sitting side by side and only strengthening the opportunity that we have to provide value to our customers.\n\nErin Wright -- Morgan Stanley -- Analyst\n\nOK. Great. And then the follow-up is when we think about your ability to achieve those near-term EPS targets as well as long-term strategic targets for you, will this involve taking on more debt? Or is this all based on cash? Thanks.\n\nShawn Guertin -- Executive Vice President and Chief Financial Officer\n\nNo, we would actually use some of our balance sheet capacity. We're well below sort of our leverage metrics now, and we'll continue to do that. So we have been building both cash and balance sheet capacity. And to accomplish both of those objectives, we would need to take on more debt.\n\nBut again, we remain committed to our investment-grade rating structure. And I can -- just as a rough rule of thumb, about 10 basis points on our debt to EBITDA is worth $2 billion of debt or thereabout. So they sound like small numbers, but they're actually significant in terms of capacity. So yes, we would do that, but we would remain committed to sort of our investment-grade ratings today.\n\nOperator\n\nThat concludes the Q&A.\n\nKaren Lynch -- President and Chief Executive Officer\n\nThank you for joining the call today. We appreciate your participation, and we'll talk to you next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLarry McGrath -- Senior Vice President, Business Development and Investor Relations\n\nKaren Lynch -- President and Chief Executive Officer\n\nShawn Guertin -- Executive Vice President and Chief Financial Officer\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nJustin Lake -- Wolfe Research -- Analyst\n\nMichael Cherny -- Bank of America Merrill Lynch -- Analyst\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nDan Finke -- President, Health Care Benefits\n\nEric Percher -- Nephron Research -- Analyst\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nAlan Lotvin -- Executive Vice President of CVS Health and President of CVS Caremark\n\nErin Wright -- Morgan Stanley -- Analyst\n\nMore CVS analysis\n\nAll earnings call transcripts"
}