{
  "companyName": "DexCom",
  "companyTicker": "DXCM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/dexcom-dxcm-q3-2022-earnings-call-transcript/",
  "content": "DexCom (DXCM 1.04%)\nQ3 2022 Earnings Call\nOct 27, 2022, 4:30 p.m. ET\n\nOperator\n\nHello, and welcome to the Dexcom third-quarter 2022 earnings release conference call. My name is Michelle, and I will be your operator for today's conference. At this time, all participants are in a listen-only mode. Later, we will conduct a question-and-answer session.\n\n[Operator instructions] As a reminder, today's conference is being recorded. I will now turn the call over to Mr. Sean Christensen. Sir, you may begin.\n\nSean Christensen -- Head of Investor Relations\n\nThank you, operator, and welcome to Dexcom's third-quarter 2022 earnings call. Our agenda begins with Kevin Sayer, Dexcom's chairman, president, and CEO, who will summarize our recent highlights and ongoing strategic initiatives; followed by a financial review and outlook from Jereme Sylvain, our chief financial officer. Following our prepared remarks, we'll open the call up for your questions. At that time, we ask analysts to limit themselves to one question, so we can provide an opportunity for everyone participating today.\n\nPlease note that there are also slides available related to our third quarter performance on the Dexcom Investor Relations website on the Events and Presentations page. With that, let's review our safe harbor statement. Some of the statements we will make in today's call may constitute forward-looking statements. These statements reflect management's intentions, beliefs, and expectations about future events, strategies, competition, products, operating plans, and performance.\n\nAll forward-looking statements included in this presentation are made as of the date hereof based on information currently available to Dexcom and are subject to various risks and uncertainties. And actual results could differ materially from those anticipated in the forward-looking statements. The factors that could cause actual results to differ materially from those expressed or implied by any of these forward-looking statements are detailed in Dexcom's annual report on Form 10-K, most recent quarterly report on Form 10-Q, and other filings with the Securities and Exchange Commission. Except as required by law, we assume no obligation to update any such forward-looking statements after the date of this presentation or to conform these forward-looking statements to actual results.\n\nAdditionally, during the call, we will discuss certain financial measures that have not been prepared in accordance with GAAP with respect to our non-GAAP and cash-based results. Unless otherwise noted, all references to financial metrics are presented on a non-GAAP basis. The presentation of this additional information should not be considered in isolation or as a substitute for results or superior to results prepared in accordance with GAAP. Please refer to the tables in our earnings release and the slides accompanying our third-quarter earnings presentation for a reconciliation of these measures to their most directly comparable GAAP financial measure.\n\nNow, I will turn it over to Kevin.\n\nKevin Sayer -- Chairman, President, and Chief Executive Officer\n\nThank you, Sean, and thank you, everyone, for joining us today. Today, we reported another strong quarter for Dexcom with third-quarter organic revenue growth of 20% compared to the third quarter of 2021. Our teams executed incredibly well as we work to advance our strategic initiatives while preparing for the largest product launch in our company's history. In the U.S., we saw continued momentum after our strong second quarter new customer starts with ongoing loyalty among endocrinologists and growing traction with primary care physicians.\n\nWe are finding these physicians eager to engage with our teams as they learn more about the clinical benefits and superior outcomes that Dexcom CGM can provide their patients. While we expect these primary care relationships to be critical to our long-term customer aspirations, they also help us better serve the intensive insulin-using population in the U.S. today. The domestic core market still has a long runway of growth ahead as we expect the vast majority of the population to adopt CGM to help them better manage their health.\n\nOutside the U.S., our team continued to deliver customer access wins this quarter. One example, in August, the NHS announced the inclusion of Dexcom ONE on prescription via the England, Wales, Scotland, and Northern Ireland drug tariff for everyone with type 1 diabetes and type 2 intensively managed diabetes. This announcement meaningfully expanded access to Dexcom within these markets as our previous reimbursement was generally limited to a smaller population of higher-risk individuals. Importantly, this is a clear example of how we can leverage our portfolio strategy to reach many more people with diabetes across the globe.\n\nWhether we use Dexcom ONE to enter new geographies or to improve access within existing markets, there is a large opportunity to expand our reach. In many cases, these are segments of the market that have lacked product choice for customers. So, providing Dexcom's leading real-time CGM solution is being welcomed enthusiastically from customers and health systems alike. As many of you have seen, we were also very excited to initiate our full OUS launch of G7 following a successful limited launch.\n\nG7 is now available in the United Kingdom, Ireland, Germany, Austria, and Hong Kong. We have been looking forward to this day for a long time as we view G7 is not only a major step forward for Dexcom but for the entire diabetes technology market. This is a game-changing launch. As we often say, G7 takes everything about G6 and makes it better.\n\nIt has a 60% smaller form factor, 30-minute warm-up time, 12-hour grace period to allow customers to choose a convenient time to change sensors, an improved app experience, and more. All of this while building upon the product performance and accuracy that has earned the trust of our customers and clinicians. These advancements were specifically designed to improve the lives of our customers, and that is being recognized by our earliest G7 users. The feedback from our launch has been incredibly positive, which adds to our confidence that this product will take Dexcom to the next level.\n\nWe are moving quickly to make this life-changing technology available broadly around the world, and we'll be rolling out G7 across a steady cadence of additional geographies over the next several months. In the U.S., we have responded to the FDA, and our G7 regulatory pathway is tracking in line with expectations we shared last quarter. We completed the necessary software changes in response to the feedback we received from the agency and subsequently validated the data to ensure the software is operating as designed. These efforts position us well to receive G7 clearance before the end of the year.\n\nThis is a very exciting time for us. We believe this is the product of the future for Dexcom, and we are working diligently to make that product accessible to a much broader population, not only the intensive insulin-using population but moving into people with type 2 diabetes on basal insulin only, noninsulin-using type 2s, gestational, hospital, metabolic health, and beyond. Along those lines, there is a growing body of evidence demonstrating outcomes beyond the intensive insulin-using population, including a recently published study in Diabetes Technology and Therapies. This study assessed the benefits of Dexcom CGM for a population of predominantly noninsulin-using type 2 individuals.\n\nSimilar to our MOBILE study, it demonstrated meaningful reductions in A1C levels and improvements in time and range across the study group. Notably, the largest improvements in time and range came from the cohort being treated with one or less medication per day. This suggests that a sizable opportunity exists to help individuals earlier in their diabetes journey, potentially preventing escalation of the disease. This has meaningful long-term health implications for those starting on CGM and also holds promise to reduce the economic burden on our health system associated with progression of diabetes.\n\nCMS clearly recognized this potential in 2017 when they became one of the first global payers to cover CGM for people with intensively managed type 2 diabetes, and they appear ready to lead yet again in customer care. In early October, CMS published a proposed local coverage determination that would again meaningfully expand CGM for the Medicare population. Once finalized, this proposal would expand Medicare coverage to include the basal-only population, as well as noninsulin-using individuals that have experienced hypoglycemia. This proposal is in direct response to the clinical outcomes demonstrated in our MOBILE trial, where Dexcom proved to meaningfully improve time and range for this population.\n\nSince publishing that data, we have been expecting a reimbursement decision and applaud CMS for taking the lead. Coverage for the basal-only population alone would allow us to help significantly more people in the U.S. as we size that population approximately 3 million individuals. This will be the first major reimbursement expansion beyond the intensively managed space and one that we expect to be the first of many.\n\nHistorically, CMS has often led commercial payers on coverage decisions, and we anticipate the same dynamic to occur here. However, we're not stopping there. We will continue to advocate for the millions of additional individuals that could benefit from access to real-time CGM. There is a massive opportunity ahead for Dexcom.\n\nWith that, I'll turn it over to Jereme for a review of the third-quarter financials. Jereme?\n\nJereme Sylvain -- Chief Financial Officer\n\nThank you, Kevin. As a reminder, unless otherwise noted, the financial metrics presented today will be discussed on a non-GAAP basis. Reconciliations to GAAP can be found in today's earnings release, as well as on our IR website. For the third quarter of 2022, we reported worldwide revenue of $770 million, compared to $650 million for the third quarter of 2021, representing growth of 20% on an organic basis.\n\nAs a reminder, our definition of organic revenue excludes currency in addition to non-CGM revenue acquired in the trailing 12 months. U.S. revenue totaled $573 million for the third quarter, compared to $490 million in the third quarter of 2021, representing a growth of 17%. Momentum continues to grow in our U.S.\n\nbusiness. We saw initial signs of an inflection in late Q1 and have been encouraged to see those positive customer trends continue in the months that followed. This resulted in a reacceleration in revenue growth in the third quarter. The investments we have made in our salesforce over the past year are starting to pay off.\n\nWe instituted new salesforce tools earlier this year to make calls more efficient. And today, our team is yielding productivity metrics in line with our high expectations. We have also taken steps recently to simplify access for people in the United States by creating multiple cash-pay options. We are seeing growing demand coming from outside our current reimbursement landscape, including the type 2 nonintensive space.\n\nSo, we established these programs to help serve these customers as we work to broaden access. International revenue grew 22%, totaling $196 million in the third quarter. International organic revenue growth was 28% for the third quarter. Our international business continues to deliver impressive results as access initiatives completed over the past year are helping us gain market share.\n\nFor example, in Australia, we are seeing very positive response to the recently expanded reimbursement for G6. Within weeks, we saw an uptick in demand. And currently, our new customers are trending around three times higher than prior to this expanded access. We have seen this dynamic play out again and again, where broader access can serve as an almost immediate catalyst to demand.\n\nAs a result, we will continue to prioritize our efforts to make Dexcom CGM accessible to many more people across the globe. Our third-quarter gross profit was $494.2 million or 64.2% of revenue, compared to 68.7% of revenue in the third quarter of 2021. Similar to last quarter, the launch of G7 creates a difficult year-over-year comparison on gross margin as G7 development costs are now included in COGS. This dynamic accounts for some of the expected step-down compared to 2021.\n\nAdditionally, there were 70 basis point negative impact on gross margin from currency. Absent this, gross margin would have been approximately 65%. Operating expenses were $333 million for the third quarter of 2022, compared to $320 million in the third quarter of 2021. Our focus on cost management was on full display this quarter as we generated over 600 basis points of operating expense leverage despite ongoing investment to support our growth.\n\nWe drove leverage in every category of spend this quarter, while simultaneously offsetting inflationary pressures. Our focus will continue to be on generating leverage in nonvariable expenses while reinvesting those savings into our global commercial infrastructure. Operating income was $160.8 million or 20.9% of revenue in the third quarter of 2022, compared to $123.8 million or 19% of revenue in the same quarter of 2021 as our significant operating expense leverage more than offset gross margin declines in the quarter. Adjusted EBITDA was $226.6 million or 29.4% of revenue for the third quarter, compared to $173.5 million or 26.7% of revenue for the third quarter of 2021.\n\nNet income for the third quarter was $111.9 million or $0.28 per share. We remain in a great financial position, closing the quarter with approximately $2.4 billion worth of cash and cash equivalents. We reached a new high watermark in terms of free cash flow this quarter, generating over $180 million of free cash. This provides us the flexibility to support our ongoing growth opportunity while also assessing any strategic uses of capital on an ongoing basis.\n\nOur largest use of capital continues to be the buildup of our Malaysia manufacturing plant. Construction continues to progress on schedule, and we expect this facility to be producing commercial product by mid-next year. This facility will provide us the necessary scale and manufacturing efficiency to support our long-term cost targets. During the third quarter, we also executed our previously announced accelerated share repurchase program, purchasing over 550 million of outstanding shares.\n\nThis allowed us to reduce the dilution associated with our 2023 convertible notes while buying back our shares at what we viewed as an attractive price point. Turning to guidance. We are updating our full-year 2022 revenue guidance to a range of $2.88 billion to $2.91 billion. For margins, we are updating our full-year guidance to the following.\n\nWe are reducing our gross profit margin guidance to approximately 64%, down from 65% previously. And we are maintaining our previous operating margin and adjusted EBITDA margin guidance at 16% and 25%, respectively. This guidance factors in another sizable uptick in currency headwinds relative to expectations we shared a quarter ago. We now expect approximately $55 million of foreign currency headwinds for the full year relative to our prior estimate of around $40 million.\n\nThis currency impact is the primary reason we found it prudent to reduce our gross margin guidance for 2022. However, we reiterated our operating margin guidance as we expect to offset the additional foreign exchange pressure through ongoing operating expense leverage. We have been able to navigate through a shifting economic environment well to date, but we are certainly not immune to macro pressure. Leading economic indicators continue to point to additional uncertainty in the coming quarters.\n\nSo, we are working proactively to offset these impacts where we can. All these dynamics could create incremental challenges to work through in the near term. We are as bullish as ever about our underlying business and the opportunity ahead for Dexcom. With that, I will pass it back to Kevin.\n\nKevin Sayer -- Chairman, President, and Chief Executive Officer\n\nThanks, Jereme. Our third quarter was characterized by sharp execution and delivering results in line with what we said we were going to do. We're committed to launching G7 internationally in the third quarter, and now we have G7 in five different countries with more following closely behind. We said that our growth rates in the U.S.\n\nwould reaccelerate as the underlying trends in the business remain strong, and we delivered on an acceleration in the growth rate. We committed to advancing our G7 regulatory process in the U.S., and our efforts this quarter leaves us on track for a clearance before the end of the year. We said that the basal-only coverage would be a matter of when, not if. Now we have more clarity around when.\n\nWe will continue to operate with this type of focus on execution going forward. Finally, as we move into Q&A, we have Jake Leach with us. We recently announced the promotion of Jake to the role of chief operating officer, providing him with end-to-end responsibility for product. With almost two decades of experience at Dexcom and serving most recently as our chief technology officer, nobody knows G7 and our product road map better than Jake.\n\nI would now like to open up the call for Q&A. Sean?\n\nSean Christensen -- Head of Investor Relations\n\nThank you, Kevin. As a reminder, we ask our audience to limit themselves to only one question at this time and then reenter the queue if necessary. Operator, please provide the Q&A instructions.\n\nOperator\n\nThank you, sir. We will now begin the question-and-answer session. [Operator instructions] Sir, we do have questions in the queue. The first question comes from Jeff Johnson with Baird.\n\nYour line is open. Please proceed.\n\nJeff Johnson -- Robert W. Baird and Company -- Analyst\n\nThank you. Good afternoon, guys. Kevin, I thought I'd start with a question on your international business. You guys have been benefiting in the last few quarters from recent access wins.\n\nYou talked about those in the prepared remarks. One of your competitors this quarter was dealing with some company-specific issues. So, it's kind of hard to get a good feel for what's going on maybe underlying demand trends outside the U.S. So, I guess the questions are, are you seeing anything tied to macro uncertainties in your international markets? And with a lot of your international markets paid for through nationalized healthcare systems, do you consider international to be more or less, I guess, macro sensitive compared to your U.S.\n\nbusiness? Thanks.\n\nKevin Sayer -- Chairman, President, and Chief Executive Officer\n\nYou know, Jeff, I may ask Jereme to help me on that. I'll take a first pass. We have learned in our U.S. markets getting access and getting reimbursement through these government agencies is absolutely critical and key to driving growth.\n\nAs we've had wins in the U.K., we've had wins in Spain. We've continued to have wins in Germany as we've shifted price to create more access. That's what's driving our growth. We're getting access to more people who can use our technology and use our better product.\n\nFor right now, we haven't seen any macro trends that would make us feel that this isn't going to continue. As we get more access, we will continue to grow and do well. Dexcom ONE is going to be a home run for us. G7 is doing very well out of the gate.\n\nWe look very much forward to a great year internationally in '23. I don't know, Jereme, if you want to add to that.\n\nJereme Sylvain -- Chief Financial Officer\n\nJeff, you know, outside the U.S., historically, there's been a cost-sensitive approach toward care, healthcare. And that's where Dexcom ONE has really played a major role for us of winning some additional access outside the U.S. So, we do believe that providing these opportunities around multiple systems to address the need both more acute and less acute, it provides us really a differentiation. So, we continue to expect to do well there.\n\nAnd we'll keep you posted if we start to see anything change in terms of macroeconomic demand starting to dampen individual access. But for now, what we see is a great opportunity and an opportunity given our product portfolio do very, very well there.\n\nOperator\n\nThank you, sir. The next question in the queue comes from Robbie Marcus with JPMorgan.\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks for taking the questions, and congrats on a really good quarter. Maybe I'll ask about the basal opportunity, and this is really exciting here. I just want to try and set expectations for how we should think about updates to the model.\n\nFirst off, when do you think this can really start to -- when should it start to impact the model and add new patients? And I realize it's about a third of patients are Medicare. And then expectations, if you have them for reimbursement, should this be at the normal Medicare rate, meaning higher than the pharmacy right now? And when should we start to think about commercial plans coming online? Thanks.\n\nKevin Sayer -- Chairman, President, and Chief Executive Officer\n\nYou know what, I'll start with the big picture things. We're starting commercial plans and talking about this now. This is such a big event for us and such a big win that we'd be stupid not to. So, we are thinking about this now.\n\nOur product offerings, our distribution strategy, and all those things, Robbie, as far as when it's exactly going to hit and go into your models, that's something we'll discuss later. We know the time frame for this can be anywhere from like four, five to nine months out as we work through this. But we're confident we're going to get through it. We're just thrilled with the ruling, and we are thrilled that we could be part of this.\n\nOur data from the MOBILE study was a large component in pushing this initiative across the finish line because we saw how well those people did. Jereme, if you want to get into more specifics on the numbers side, go ahead.\n\nJereme Sylvain -- Chief Financial Officer\n\nSure. Absolutely. So, Robbie, the way we're thinking about it now is really -- it's likely a second-half 2023 event just given the time. And so, expect that, but we'll give you more clarity as to how much the contribution is as we guide for 2023.\n\nIn terms of commercial payers following, we do expect to see that as you certainly think of Medicare Advantage plans. But even as you have folks really progressing throughout their journey, we know that this product ultimately reduces cost from the system, improves lives and outcomes. And so, we do expect those to come along as well. In terms of reimbursement, the way that CMS typically reverses it is based on qualification, and this is an expansion of the category of qualification.\n\nAnd so, thus far, it looks like it's reimbursed in line with the existing qualifications. And at the end of the day, it's incumbent upon us, and we think we continue to show it that the economic benefits of putting somebody on CGM far outweigh the costs. And so, it's on us to continue to show that evidence, and we think we can continue to prove that as more and more evidence comes. So, we'll get back to you a little bit later in terms of the expectations of 2023 contribution.\n\nBut that should give you a feel for what we expect over the coming year.\n\nOperator\n\nThank you, sir. The next question in the queue comes from Matthew Blackman with Stifel. Your line is open. Please proceed.\n\nMathew Blackman -- Stifel Financial Corp. -- Analyst\n\nGood afternoon, everybody. Thank you for taking my question. I have another question on basal. Also, as we try to think about modeling the annual value of these less than five patients, what is a reasonable way to think about where frequency for a basal patient? We've heard varying feedback from clinicians.\n\nAnd frankly, it's been tracking higher than we would have thought, maybe a 20-plus days per month, but I can't tell if there's any early adopter SKU in that. Just any thoughts there would be helpful. Appreciate it.\n\nJereme Sylvain -- Chief Financial Officer\n\nYeah. I'll maybe draw you back to the MOBILE study, which the MOBILE study was really targeted at folks wearing it full time, which was the basis for CMS coverage. And so, I think what we would see is as folks get on to therapy, we would expect a relatively similar utilization. There might be dips in between it for here and there, a day here or there, a day here and there as product is coming in.\n\nBut for the most part, we expect full-time wear, and that's how we've seen folks get the most benefit. So, I'd expect it from there. Clearly, this is a new market for us, but all the early work we've done around patient satisfaction, patient results, these folks have wanted to wear it. They wanted to wear it full-time.\n\nAnd so, we expect that to be the baseline going forward.\n\nOperator\n\nThank you, sir. The next question in the queue comes from Margaret Kaczor with William Blair.\n\nMargaret Kaczor -- William Blair -- Analyst\n\nHey, good afternoon, guys. Thanks for taking the questions. Yeah. I wanted to talk a little bit about U.S.\n\ngrowth. Obviously, you saw a really nice acceleration from Q2 to where we are in Q3. So, can you provide any context around the growth in new patient adds, how that's trended going into Q3 and more specifically in Q4? And I know you'll love this, but going into '23, all of this growth is coming in advance of G7 in basal. So, why shouldn't we assume even more of an acceleration to occur for several quarters from now? Thanks.\n\nJereme Sylvain -- Chief Financial Officer\n\nSure. Yeah. Happy to talk about the patient trends. So, what we saw kind of rewind back Q2, a record for us.\n\nQ3, early feedback is it's at least equivalent of that of Q2, and we'll even get more data here soon. So, Q3 was another very strong new patient add quarter for us. And so, when we talked last about and expecting a reacceleration, that was on Q2 and an expectation of a strong Q3. I think we had a very, very strong Q3.\n\nAnd quite frankly, we expect a strong Q4. That's where you see that reacceleration in the U.S. So, very bullish on that particular opportunity. And you are right, that is with G6.\n\nAnd so, we obviously are very excited about the ability to offer G7 to the U.S. population. As it pertains to momentum and moving into '23, we'll talk about that as we give guidance in 2023. But I think the takeaway here is we are still very bullish on this business, very bullish on the opportunity, and ecstatic about the opportunity to offer G7.\n\nOperator\n\nThank you, sir. The next question in the queue comes from Matthew O'Brien with Piper Sandler. Your line is open, sir.\n\nMatthew O'Brien -- Piper Sandler -- Analyst\n\nGreat. Thanks for taking the question. Maybe, Jereme, just if you could put a little bit finer point on basal for next year? I know you said second half of next year, and you're expecting a lot of wear. But it's going to be pretty early days.\n\nA lot of things got to work through. So, is it fair to think of it as a fairly modest contributor next year? And then this might be a kind of a silly question, but you have G7 coming out next year, and then you're going to have new basal patients. Just talk about manufacturing for all these products you're going to need over the next several years, I guess.\n\nJereme Sylvain -- Chief Financial Officer\n\nSure. Yeah. Let me start with the -- maybe the model expectation. We have Jake here.\n\nAnd I think it will be good for him to talk through the manufacturing. So, in terms of how to model it out, Kevin alluded to it earlier. Generally, there's about a six- to nine-month period where look, there's a proposal, and things have to go through. And so, as folks start to open up coverage, that's why we expect that coverage to really start in the back half.\n\nAnd again, this is a recurring revenue business. So, there will be a contribution we expect in 2023. How material, we're going to size that up, and we'll make sure that we -- as we size it up for you, we'll give you the context for how we're guiding to it in 2023, so you understand our assumptions. If things come earlier or things go faster or slower, we'll certainly give you that clarity so that you have it.\n\nBut our expectation is there's a contribution. How material, it's going to take a little bit of time as that grows, but still a contribution and really momentum exiting '23 into 2024. But in terms of capacity, maybe let me turn it over to Jake to give you some context there.\n\nJake Leach -- Chief Operating Officer\n\nYeah. Thanks, Jereme. So, from a capacity perspective, we've been gearing up for this G7 launch for quite a while. So, we've got G7 lines installed here in San Diego, as well as in Mesa.\n\nAnd so, we feel really good about our position to meet the needs of our full G7 U.S. launch, as well as the international launches that will continue throughout the year. Also, to remind you that we've got our Malaysia plant coming online the next year. So, that should also help boost our capacity.\n\nAnd so, I feel really good about the ability to both provide G6 and G7 product.\n\nOperator\n\nThank you. The next question in the queue comes from Joanne Wuensch with Citi. Your line is open.\n\nJoanne Wuensch -- Citi -- Analyst\n\n[Inaudible] Sorry, I don't know if you heard any of that. But --\n\nKevin Sayer -- Chairman, President, and Chief Executive Officer\n\nLet's start over.\n\nJoanne Wuensch -- Citi -- Analyst\n\nGood evening, and thank you for taking the question. Dexcom ONE launched in -- I think you said six geographies outside the United States. How is that ramping? How should we think about that contributing? Because I was starting to put together in my mind like your core base business, you layer on top of that G7 benefit. You layer on top of that Dexcom ONE and, of course, basal.\n\nWhat's the layer for Dexcom ONE?\n\nKevin Sayer -- Chairman, President, and Chief Executive Officer\n\nI'm not going to get into numbers, and we'll get into models later, Joanne. I can tell you, again, I'll reiterate our comments on the call. There are many geographies where CGM is accepted where we have been isolated to higher-risk patients, patients on pumps, or severe hypoglycemia. And we were reimbursed more, but we were narrowly viewed.\n\nIn many of these geographies now with Dexcom ONE with our lower-cost offering, but with real-time CGM and the accuracy and other features we deliver, we're now able to go compete for those customers. That will be a very important level of business for us, particularly in Europe going forward and other countries and other places where we need to launch it. That will be a layer -- I mean, our core business, our core G Series product is going to be our primary source of revenue for a while. But over time, you will see all these elements grow bigger and take a bigger piece of the pie.\n\nAnd Jereme, you build the models. You -- why don't you add a little more?\n\nJereme Sylvain -- Chief Financial Officer\n\nYeah. So, Joanne, I completely understand the question and how to model it. I think what I would say is in 2022, this is a business just getting started. So, it's not a material contributor in 2022.\n\nHowever, we understand the challenge. And so, we will make sure that we're able to identify what the contribution looks like as we start to give forward-looking guidance over time. So, just rest assured, as that business gets bigger, we'll start to give you line of sight into that. For now, what's most important is we've unlocked an incredible amount of TAM.\n\nAnd that's super important as we think about how many new patients we're certainly going to be bringing in. So, more to come there. We'll certainly help you with models going forward. But for now, just know Dexcom ONE is a relatively small contributor this year, and we'll talk about 2023 here in a few months.\n\nOperator\n\nThank you. The next question in the queue comes from Jayson Bedford with Raymond James. Your line is open.\n\nJayson Bedford -- Raymond James -- Analyst\n\nGood afternoon. Thanks. Just a quick one. I may have missed this, but did you talk about volume growth in the quarter? And if not, can you? And maybe comment on any geographic differences.\n\nThanks.\n\nJereme Sylvain -- Chief Financial Officer\n\nSure. Yeah. So, we were in the unit volume in the mid- to upper 30s globally. In terms of the performance, the U.S.\n\nwas slightly below that but still in the mid-30s, and OUS was slightly above that in the upper 30s. And so, really just continued strong momentum in that patient cohort or that underlying patient volume.\n\nOperator\n\nThank you, sir. The next question in the queue comes from Larry Biegelsen with Wells Fargo.\n\nNathan Treybeck -- Wells Fargo Securities -- Analyst\n\nGood evening. This is Nathan Treybeck on for Larry. In terms of your comments around G7 U.S. launch timing by year-end, is there anything that still needs to be done? And then how soon after the approval do you expect a full launch? And how should we think about the ramp? Is there any reason why it should be different than the G6? Thanks.\n\nJake Leach -- Chief Operating Officer\n\nYeah. Thanks for the question. This is Jacob. I'll take that one.\n\nSo, yes, we responded to the FDA in Q3 with the answers to their final questions. And so, we feel really good about how that positions us for approval in Q4, so before the end of the year. We're really planning our launch to occur in Q1. So, that will be a full launch, and the -- our status with the FDA is we've gone back and forth.\n\nWe're feeling really good about this being kind of the end of the review period. And so, we're very confident in that Q4 approval timing and a Q1 U.S. launch.\n\nOperator\n\nThank you, sir. The next question in the queue comes from Matt Taylor with Jefferies. Your line is open.\n\nMatt Taylor -- Jefferies -- Analyst\n\nHi. Thanks very much for taking the question. I actually wanted to double-click on some of your commentary on Dexcom ONE and thinking about your portfolio strategy as you get G7 out there. I guess, can you talk a little bit more about how you're going to use G7, G6, and ONE together to kind of meet customers where they're at in different markets around the world? What are some of the different flavors or different ways you could use that portfolio?\n\nKevin Sayer -- Chairman, President, and Chief Executive Officer\n\nYeah. This is Kevin. I'll take that at a high level. Certainly, our G Series product, our G7 is going to be our flagship product, we roll it out.\n\nAnd that will be -- we're very comfortable with that being a home run. There will be some countries where G6 is so new. It's not going to be prudent to go rush G7 into those geographies. We can let that customer base grow while we expand others.\n\nSo, we look at G6 and G7 in a very similar light as far as their features, the connectivity, and all the things that they do. With Dexcom ONE currently on a G6 platform, we have areas where we need to grow, and we need to get there fast. And that product will remain on the G6 platform. We're not ready to move it to G7 anyway.\n\nWe're going to use our existing G7 capacity to sell G7s in the beginning and strengthen ourselves in our current business and where we are doing very well now with our partners and everybody else ultimately Dexcom ONE will shift to that platform. And we'll roll out that way. So, as you look at Dexcom ONE, we've said many times that product is for two major purposes. The first one is to go into new geographies where we can do an online e-commerce type business and launch it as we have in those first four countries, in countries where CGM is reimbursed.\n\nBut again, we have this situation where there are two types of CGMs they will pay for the -- that for the high-risk patient and connectivity and with those features that we've always had on the G Series. And then the other area, we are using Dexcom ONE as a vehicle to get into those markets and utilize our capacity to go sell sensors and serve customers there and give them a better experience than they've ever had before. And that is the plan for right now.\n\nOperator\n\nThank you, sir. The next question in the queue comes from Marie Thibault with BTIG. Go ahead, ma'am.\n\nMarie Thibault -- BTIG -- Analyst\n\nThank you so much for taking the questions. I wanted to ask one here on your comments on cash pay in the U.S. Unless I'm mistaken, I believe that's a recent shift or a new shift for Dexcom strategy? Would love to hear a little bit more about how that's being rolled out and how patients and providers are hearing about that cash pay option. Thanks so much.\n\nJereme Sylvain -- Chief Financial Officer\n\nYeah, sure. Thanks for the question. This is Jereme. It's a bit of a change.\n\nI'd say it's an addition or an augment to an existing strategy. So, we've always believed that access is incredibly important. And we believe that over the long term, access is at the basis of adoption. However, there are some certain populations out there that have high interest in the product that continue to want to use the product to manage their diabetes.\n\nAnd we felt that this was a way to allow them to do so while we work on that access. And so, what we are doing is we're launching multiple different versions of cash pays. We'll have those being promoted here shortly to targeted populations. And what the goal here is that folks don't have coverage, while we work in the background to get coverage, basal is a good opportunity, a good example, I should say.\n\nThey can't get the product for a discount price. And the price is less than 50% of what -- the cost of them is 50% less than what it historically would have been. So, real good opportunity, multiple different options, multiple different ways we're going to be rolling it out. You'll see some marketing materials around it soon.\n\nBut I would -- I think this is a great thing for access. I think it's a great thing for folks who have been looking to get on a Dexcom that, for whatever reason, haven't been able to allow them to do so.\n\nOperator\n\nThank you, sir. The next question in the queue comes from Kyle Rose with Canaccord.\n\nKyle Rose -- Canaccord Genuity -- Analyst\n\nGreat. Thank you for taking the question. So, obviously, the G7 launch, you're starting in a few countries now, going to move into the U.S. in the Q1 next year.\n\nJust how should we be thinking about gross margins when we -- when you turn on those facilities and then, in particular, the Malaysia facility coming online as well? Just how should we think about the COGS line over the course of the next 18 months?\n\nJereme Sylvain -- Chief Financial Officer\n\nYeah. So, the best way -- good question. The best way to think about it is in the first quarter in which we turn on lines, you generally have a dip in gross margin. And that's the initial set up the yields.\n\nWe'll give you guys a little bit more line of sight into cadence as we get into 2023 guidance. But as you turn on those lines, the first sets, the yields are a little bit lower. You're absorbing in depreciation, and then as those yields start to improve, you start to get a better gross margin run on those. So, I think the expectation is, is you'll have some blips there in the periods in which we launch into certain countries, specifically U.S.\n\nAnd then as more and more folks transition off of G6 to G7, and those increase, you're going to see those margins improve. Longer term, G7, we can make at a lower cost than G6. And so, it's just this transitory. We'll help you out on the modeling as we get into 2023 guidance, but as you're trying to get your head around what the cadence looks like when we turn online, that's the expectation of when you'll have the dip and then a recovery after that.\n\nOperator\n\nThank you, sir. And the next question in the queue is Steven Lichtman with Oppenheimer.\n\nSteven Lichtman -- Oppenheimer and Company -- Analyst\n\nThank you. Hi, guys. You know, as we think about some of these new opportunities from the LCD, I'm wondering in the near term how things are progressing on the intensive type 2 side. With -- given the comments you made in terms of primary care doc progress, as well as the work you've done on coverage, can you update us on where you guys -- do you think the market is in terms of penetration, intensive type 2s? And are the pieces in place for that just to continue to expand meaningfully in the coming couple of -- two years?\n\nJereme Sylvain -- Chief Financial Officer\n\nYeah. Thanks for the question. We continue to do very, very well. So, if you think about kind of where that type 2 intensive penetration is, it's surpassing 35%.\n\nIn terms of how we're doing, I think couple of maybe data points, which I think is helpful. First off, record new patients, Q2. Q3 is in line with that based on early feedback, could even be a little bit higher. And so, you're seeing patients coming in, which is just an indication of more and more folks adopting where a good majority of those are coming from that type 2 intensive population.\n\nIt's our fastest-growing segment. I think you also think about it from a context of who we call on. And as we look at our sales team, we talk about productivity, more than three-quarters of the calls we make are now to primary care physicians. And that's because that's where we're looking to expand over time.\n\nSo, I think what we've done in expanding the salesforce last year and really focusing on those sales tools, thinking about the type 2 intensive and then beyond, basal and beyond, I think you're really seeing that play out. And you're seeing some very strong growth in that type 2 intensive segment, and it sets us up well for that basal segment.\n\nOperator\n\nThank you, sir. The next question in the queue comes from Matt Miksic with Barclays.\n\nMatt Miksic -- Barclays -- Analyst\n\nHi. Great. Thanks so much for taking the question. Maybe just a follow-up on some of the questions about how the ramp-up of G7, it is a little bit of a modeling question, not really at all sort of a guidance question.\n\nBut just in terms of how the portfolio comes together and works maybe following up on Kyle's question on ramping up these new lines. Can you talk a little bit about channel, how the sort of middle of the P&L might respond or flex as you kind of get into some of the opportunities you're talking about? Is there a channel synergy across all of these? Do you expect to have to kind of spend into some of these opportunities and then get leverage over time? Maybe if you could talk a little bit about that, that would be super helpful. Thank you.\n\nJereme Sylvain -- Chief Financial Officer\n\nYeah, sure. So, the line -- the way you think about the lines, and this is the way we've set it up is Dexcom ONE physical form factor cost to manufacture, not necessarily cost to support and how we service it, but really the physical product. Dexcom ONE is very similar to G6. There are other features that G6 has, but hardware is very similar.\n\nAnd it's very similar in G7. G7 lines and eventually Dexcom ONE will migrate to a G7 line. And so, as you think about these products, then it becomes a question of price point and then how we ultimately service the patient there. So, that's the way to think about it.\n\nOver time, as we go into certain markets depending on price point, it's got much less to do with what I would say is the physical product itself. We grow into those markets over time through economies of scale. And so, that's one of the reasons we believe with Dexcom ONE, there's a real great opportunity here. The economies of scale for us are massive.\n\nAnd by going into those markets, we certainly can grow into that profitability profile. So, as you think down the middle of the P&L, certainly, as you go into Dexcom ONE, there could be a slight margin differentiation, but those economies of scales help offset it. We also look at the service model, and we're able to manage the service model in a different way. So, the ultimate operating margin contribution is the same.\n\nSo, that's how we think about it. And so, as you're modeling it through, that's how I would think about it.\n\nKevin Sayer -- Chairman, President, and Chief Executive Officer\n\nYes. I'd just add to that. And I don't want this lost on the call. Take a look at our operating performance this quarter.\n\nRecord cash flows as a former CFO is something I love to hear. And so, we have managed our business very tightly. As we look at these workstreams and these new product lines, your question is very appropriate. And we do have work streams about our cost to serve our patients, our cost to develop our new products, our manufacturing costs given all these new things we're doing.\n\nWe are looking at the cost structure of the company every bit as much as we're looking at the product launches. So, we can make sure that when we get to the end of this road with these launches and with these products and new markets and new products that we have operating margins that are acceptable to us as we increase our customer base dramatically.\n\nOperator\n\nThank you, sir. The next question in the queue comes from Joshua Jennings with Cowen.\n\nJoshua Jennings -- Cowen and Company -- Analyst\n\nHi. Thanks for taking the questions. I wanted to just ask about the sequential acceleration in 3Q of revenue growth. And either if you could quantify or just qualitatively describe the contributions from your new pump partner.\n\nAnd just on that topic, if you can just remind us the requirements once G7 is approved to integrate G7 into the Tandem insulin pumps. Any steps that you can highlight and what your expectations are on that front? And can anything be done in front of G7 approval with your partners? Thanks for taking the question.\n\nJereme Sylvain -- Chief Financial Officer\n\nSure, I'll start with the contribution. And let me turn it over to Jake, who is our maestro on product development and understanding products. In terms of contribution, look, we're very excited about both Tandem and Insulet products. And as they launch more and more products that we are obviously integrated with, we expect it to contribute.\n\nNow, quantifying that and having those contributions, it's a little bit difficult to do given some products -- some folks were already on Dexcom CGM who bring in a pump, and some folks pull over. So, as time moves on, we'll be able to really tease that apart. But I think what we would say is we're still bullish on the opportunity of folks ultimately using our product with these incredible pump partners. I'll leave it at that just because it gets hard to contribute.\n\nAgain, we'll be able to retrospectively give feedback as time moves on. But let me give it to Jake in terms of the connectivity and the timelines on G7.\n\nJake Leach -- Chief Operating Officer\n\nYeah. Thanks, Jereme. So, on G7 integration with our pump partners, basically, the steps are to make a few updates on the pump side to take advantage of the new features that are within G7 such as the fast warm-up, as well as the grace period. And so, those groups are already -- they have been already working on that for quite a while.\n\nAnd so, we do see great progress on those integrations. They've gone through kind of final steps of development and validation. So, a lot of that work can be, to your point, done ahead of time. And so, when it comes to a specific timing of approvals and launches, we'll leave that to our pump partners.\n\nBut we're progressing very rapidly, and we do expect them to be integrated soon. One thing I'll note is that on our other side on the digital health partners, for example, in Europe where we have G7 out, those that are connected up to our real-time API already have G7 integrations. For example, Sugarmate is a group that's already consuming G7 data within their app at the beginning of the launch. So, very excited about the opportunity to bring more to the ecosystem with G7.\n\nOperator\n\nThank you, sir. We have no further questions at this time. I will turn the call over to Mr. Sayer for closing remarks.\n\nKevin Sayer -- Chairman, President, and Chief Executive Officer\n\nThanks a lot, everybody. This was a great quarter for us with growth, with excitement related to our product launches, expanding global access, and performance on the bottom line as well. In a time when the world is in a lot of chaos, we've done what we said we were going to do yet again. Our teams are just executing very well as we press toward the end of the year and look to build momentum next year.\n\nI want to thank our team members for their hard work to strive toward these goals. It is all hands on deck to get G7 done, to get Dexcom ONE out in these markets, and do all the things that we are trying to do. But I want to close with a special note. I want to thank all the members of the diabetes community that have been working together to help improve access to CGM technology.\n\nThe recent CMS proposal represents a big win for people with diabetes, and we're only one member of a large group advocating for this result. This was a collective effort from the diabetes community on behalf of the diabetes community. We want to acknowledge all the hard work that led to this proposal, both inside and outside of Dexcom, and share our excitement to help so many more people with diabetes in the U.S. live healthier lives, and it's only the beginning.\n\nThanks a lot, everybody.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSean Christensen -- Head of Investor Relations\n\nKevin Sayer -- Chairman, President, and Chief Executive Officer\n\nJereme Sylvain -- Chief Financial Officer\n\nJeff Johnson -- Robert W. Baird and Company -- Analyst\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nMathew Blackman -- Stifel Financial Corp. -- Analyst\n\nMargaret Kaczor -- William Blair -- Analyst\n\nMatthew O'Brien -- Piper Sandler -- Analyst\n\nJake Leach -- Chief Operating Officer\n\nJoanne Wuensch -- Citi -- Analyst\n\nJayson Bedford -- Raymond James -- Analyst\n\nNathan Treybeck -- Wells Fargo Securities -- Analyst\n\nMatt Taylor -- Jefferies -- Analyst\n\nMarie Thibault -- BTIG -- Analyst\n\nKyle Rose -- Canaccord Genuity -- Analyst\n\nSteven Lichtman -- Oppenheimer and Company -- Analyst\n\nMatt Miksic -- Barclays -- Analyst\n\nJoshua Jennings -- Cowen and Company -- Analyst\n\nMore DXCM analysis\n\nAll earnings call transcripts"
}