{
  "companyName": "Karat Packaging Inc.",
  "companyTicker": "KRT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/karat-packaging-inc-krt-q2-2022-earnings-call-tran/",
  "content": "Karat Packaging Inc. (KRT 0.63%)\nQ2 2022 Earnings Call\nAug 11, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the Karat Packaging second quarter 2022 earnings conference call. I would now like to turn the call over to Roger Pondel, investor relations for Karat Packaging. Please go ahead.\n\nRoger Pondel -- Investor Relations\n\nThank you, operator, and good afternoon, everyone. Welcome to Karat Packaging's 2022 second quarter earnings call. I'm Roger Pondel with PondelWilkinson, Karat Packaging's investor relations firm, and it will be my pleasure momentarily to introduce the company's chief executive officer, Alan Yu; chief financial officer, Jian Guo. Before I turn the call over to Alan, I want to remind our listeners that today's call may include forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995.\n\nSuch forward-looking statements are subject to numerous conditions, many of which are beyond the company's control, including those set forth in the Risk Factors section of the company's most recent Form 10-K as filed with the Securities and Exchange Commission, copies of which are available on the SEC's website at www.sec.gov, along with other company filings made with the SEC from time to time. Actual results could differ materially from these forward-looking statements, and Karat Packaging undertakes no obligation to update any forward-looking statements, except as required by law. Please also note that during today's call, we will be discussing adjusted EBITDA, adjusted EBITDA margin and adjusted diluted earnings per share, which are non-GAAP financial measures as defined by SEC Regulation G. A reconciliation of the most directly comparable GAAP measures to the non-GAAP financial measures is included in today's press release, which is now posted on the company's website.\n\nAnd with that, it is my pleasure to turn the call over to CEO Alan Yu. Alan?\n\nAlan Yu -- Chief Executive Officer\n\nThank you, Roger. Good afternoon, everyone. Our second quarter 2022 results continue to reflect strong demand for our products, particularly our environmentally friendly offering, which grew 50% over the comparable prior-year period. The positive sales performance was broad-based across all categories, paced by a 30% growth in the distributor channels.\n\nWe continue to gain wallet share with our existing customers, and we added several new wholesale distributors to our customer roster. Sales were negatively impacted by approximately $2 million of fewer order fulfillment caused by shipping delays between our China manufacturing plant and other Karat warehouses, including two new facilities in Southern California and Hawaii that we leased in May. The shipping delay issues was transitional due to inventory overflow received in May and June and have been resolved. I thank the entire Karat team for working diligently through it.\n\nAs more cities and states in the United States and around the world enact new regulation to ban Styrofoam and single-use plastics, demand for compostable and biodegradable product is rapidly growing. We are experiencing increase from national chains and grocery accounts for our compostable product. Karat is committed to its leadership position in eco-friendly disposable food service product. As we continue to provide new and innovative offerings, our joint venture announced in April, Green Earth Technology in Taiwan is progressing well.\n\nThe 180,000 square foot state-of-the-art automated bagasse factory to manufacture 100% compostable food service product is expected to be completed ahead of schedule, where production and shipment to begin before the end of this year. The plant is expected to produce approximately 648 containers of product annually. We are in discussion with our Taiwan partner to extend production lines to double the manufacturing capacity by mid-2023. Additionally, we plan to accelerate our initiative to build a bagasse plant in the U.S.\n\nin 2023, using the proprietary manufacturing processes of the new Taiwan facilities. As we proceed further into 2022, we believe we expect continued growth from our eco-friendly product lines, improvement in our fulfillment rates with the recent warehouse expansion and continued operating efficiencies. We are currently targeting net sales for 2022 third quarter to be in the range of $117 million to $120 million, up from the $102.7 million for the 2021 third quarter. For the full 2022 year, we are reiterating our guidance with net sales expected to be in the range of $445 million to $449 million versus the $364 million in 2021.\n\nDespite the significant increase in total freight and duty capitalization costs in the 2022 second quarter, we've achieved gross margin of 29.6%, consistent with the 29.7% in the same period last year. Gross margin benefited from higher-margin, eco-friendly products, as well as favorable foreign currency exchange rate. Our gross margin goal for the 2022 full year remains 31% to 32% on average. We are currently seeing some meaningful drop in ocean freight rates.\n\nAs we absorb the higher ocean freight costs, we are confident that we can still accomplish our full year average gross margin of 31% to 32%. I want to leave adequate time for questions. So with that, I will turn the call over to Jian Guo, our chief financial officer, to discuss our financial results in greater detail. Jian?\n\nJian Guo -- Chief Financial Officer\n\nThank you, Alan. As Alan mentioned, we delivered another quarter of solid sales growth and increase in adjusted EBITDA on top of the exceptional growth achieved last year due to post-COVID reopening. We reported record quarterly net sales for the 2022 second quarter, rising 22% to $114.9 million from $94.5 million in the same period last year, reflecting strong growth from existing and new customers. The increase was driven by our eco-friendly products and price increases implemented to partially offset higher product, freight, and labor costs, as well as increased revenue from our expanded logistics services.\n\nBy channel, sales to distributors, our largest channel, grew 30% for the 2022 second quarter. Sales from the online channel increased 13%. Sales to national and regional chains increased 12%, and sales to the retail channel increased 5% for the quarter. Gross profit increased 21% to $34.0 million for the 2022 second quarter from $28.1 million last year.\n\nGross margin was 29.6%, consistent with 29.7% in the same period last year despite the significant increase in total freight and duty costs. Overall, freight costs as a percentage of net sales increased to 18% in the second quarter of 2022 from 10.3% in the second quarter of 2021. Gross margin benefited from a shift to higher-margin eco-friendly products and favorable falling currency exchange rate, along with improved operating efficiencies and leverage. With some abatement in the current ocean-freight rates, we expect total freight and duty costs to continue to decrease as a percentage of net sales in the second half of 2022.\n\nWe also continue to focus on optimizing our product mix and improving our operating efficiencies, and we are confident to deliver on our gross margin goal for the full year. Operating expenses in the 2022 second quarter were $26.2 million or 23% of net sales, compared with $21.2 million, also about 23% of net sales in the same period last year. The increase included incremental warehouse transfer costs to manage inventory overflow, higher demurrage fees, additional temporary labor costs, including for COVID-related illness and higher rent and stock-based compensation expense. Other income net was $1.1 million for the 2022 second quarter, including a gain on foreign currency transactions of $850,000, compared with $4 million in the same period last year.\n\nThe decrease primarily reflects a gain of $5 million from the PPP loan forgiveness, partially offset by interest expense of $1.1 million in the 2021 second quarter. Provision for income taxes was $1.7 million or 20% for the 2022 second quarter, compared with $1.5 million or 14% for the prior-year quarter. The lower tax rate last year was primarily attributable to the gain of $5 million from forgiveness of debt. Net income for the 2020 second quarter was $7.2 million, compared with $9.3 million for the same quarter last year, which included the gain on debt forgiveness.\n\nNet income attributable to tariff packaging for the 2022 second quarter was $6.3 million or $0.32 per diluted share, compared with $9.6 million or $0.50 per diluted share a year ago. Adjusted diluted earnings per common share increased 17% to $0.34 from $0.29 in the prior-year quarter. Adjusted EBITDA for the second quarter was $11.8 million, an increase of 15% from $10.3 million a year ago. Consolidated adjusted EBITDA margin was 10.3% in the second quarter versus 10.9% for the same quarter last year.\n\nNet cash provided by operating activities was $3.7 million for the three months ended June 30, 2022, compared with net cash used in operating activities of $7.2 million for the same quarter last year. The difference primarily reflected the increase in net income year over year, excluding a one-time gain of $5 million from debt forgiveness included in the prior-year quarter and more effective working capital management. During the 2022 second quarter, we invested $4.4 million in regular capex, principally for manufacturing machinery and another $4 million to set up our joint venture in Taiwan. We finished the quarter with $96.7 million in working capital, compared with $72.1 million at the end of 2021.\n\nWe believe Karat is well-positioned to execute on its future growth strategies. As of June 30, 2022, the company had $11.6 million of borrowing outstanding under the line of credit and additional availability of $28.4 million under this line. With Global Wells refinancing of one of its term loans in June 2022, we gained additional liquidity of $8 million. We continue to explore other options to further expand our liquidity to support the business growth and enhance shareholder value.\n\nAlan and I will now be happy to answer your questions, and I'll turn the call back to the operator.\n\nOperator\n\n[Operator instructions] Our first question comes from Jake Bartlett from Truist Securities.\n\nJake Bartlett -- Truist Securities\n\nGreat. Thanks for taking the question. Alan, my first question is on fill rates. You talked about improving fill rates helping sales.\n\nBut can you give us an update on how the fill rate has improved or changed from the first quarter? And how you think that -- what -- how you think that should trend for the rest of the year? And then also, if you could kind of confirm or talk to whether fill-rates are really the limitation on your sales growth right now or whether you're seeing any sort of softness in demand? I get the picture that demand is much higher than really than you can meet. So volume demand is a pretty low risk. But if you could kind of help frame that for us that would be helpful.\n\nAlan Yu -- Chief Executive Officer\n\nSure, Jake. Well, thank you. First of all, the fill rates, we are seeing our fill rate out of our Texas facility, which is one of our largest associates. We're still at most of the purchase order that we received.\n\nThe second quarter was at 50%. So we have to short customers, almost 50% of the item they needed to orders. But in California, it was much better. California fill rate was up to 85% except for the item that would basically vary under the -- or inside the warehouse.\n\nWe had to emergency lease a secondary warehouse in California just to be able to operate and start getting the product out of the warehouse shipped. So that was one of the issues. So in second quarter, we did transfer -- move more product into Texas. And at this moment right now, we're trying to move product into South Carolina, New Jersey, and Washington to stock up other warehouses because we have a lot of customers in different parts of the States that also need our products.\n\nSo that's what we have been doing right now. Is there a softness in the market? No, I do not see a softness in the market. Actually, I've seen it. The market is growing even stronger and the demand, especially the demand for compostable ecofriendly product is -- it's -- basically, it's growing faster than ever.\n\nFor example, I've seen that the San Mateo County is requiring every restaurant to be using compostable products starting October 1, Hawaii starting September 1. So everyone is gearing up with ecofriendly product line right now. And we spoke to a national chain account last week, and they were saying that prior to the pandemic, their takeout was 15% of their overall volume. As of today, they're at 40% of their entire volume.\n\nAnd not to mention that they even added four different branded virtual kitchen that increased the volume, the usage of the packaging. And this is where we're seeing that the entire industry is going to looking to grow with the disposable packaging with this trend moving into more ghost kitchen, virtual kitchen from the existing chain accounts?\n\nJake Bartlett -- Truist Securities\n\nAnd I wanted just to focus in on gross margins for a moment. One is I know in the first quarter, there was that big impact of capitalization of freight and duty. Was there any impact in the second quarter? I might have missed that, but whatever impact was in the second quarter. And then we've been tracking weekly spot ocean freight rates from East Asia to the West Coast, and they're down about 60% currently is from what I'm seeing year over year.\n\nSo the question is, should -- when do you see that sort of benefit flowing through? I mean, is there a quarter or two delay? I mean, when should we see the benefit of really dramatically falling ocean freight rates coming through with the gross margin?\n\nAlan Yu -- Chief Executive Officer\n\nSure. The ocean freight started to increase last year. So in last year fourth quarter, when we had the -- our earnings conference call, we were mentioning that everyone is saying that there's going to be a headwind because ocean freight is growing. And the peak of the ocean freight was the first quarter.\n\nAnd that's where we see a -- we had -- in the first quarter earnings, we had a favorable capitalization, freight duty capitalization in the first quarter because we brought in a lot of products using the higher freight rate. And the freight rates started to drop. When it started to drop, it dropped from early, I would say, early June. That's when it first started to drop, not in May.\n\nSo basically, June, we wouldn't see a much favorable freight duty and capitalization gain in the second quarter, but we will see a tailwind starting the end of the third quarter and into the fourth quarter. And yes, the freight has dropped tremendously from, I would say, $21,000 of spot rate to currently at $5,700 today.\n\nJian Guo -- Chief Financial Officer\n\nJust to add on to Alan's comments to answer your question, during the second quarter, we did have an unfavorable impact from the freight and duty capitalization of about $2.3 million. So it did have a fairly significant impact on our gross margin. And now also to what Alan was talking about, we expect to start to see the benefit from the decrease in ocean freight rate in the third quarter, the later part of the third quarter and then probably more so in the fourth quarter of 2022.\n\nJake Bartlett -- Truist Securities\n\nAnd then my last question, the Taiwan, the JV, my impression was that you were going to -- that was going to be the way you could prove the automation to produce bagasse in an effective way. I know it's typically a very labor-intensive process. So you're going to try to see how that automation works and whether it's cost effective. And then if successful, you might bring it to the U.S., but it sounds like you're kind of making the decision to bring it to the U.S., but I'm not sure if you've kind of -- do you feel like you've proven out the automation at this point?\n\nAlan Yu -- Chief Executive Officer\n\nWell, yes. Last -- or earlier this year, our problem was to start in Taiwan and see it's workable and bring it to U.S. But at this point, we are seeing progressing very well. The production basically is set up and everything.\n\nSo we are confident that we should be able to train and hire people in Taiwan and get it operational. That's why we are already jumping into the second phase of the Taiwan investment. Basically, we know the demand for compostable product is going to be widespread in the U.S. And there has been already other larger manufacturers that have tried to bring bagasse manufacturing domestically.\n\nAnd so far, I haven't seen it done very well. I would think that our manufacturing facility and our equipment, we compare with different type of other equipment that are out there in the market. We would say that our -- the partnership, the equipment that our partners are developing is actually more advanced and also have higher efficiency rates. And basically, because of their experience, we wouldn't see any issues of bringing them over to United States.\n\nAnd basically, we already spoken to a lot of chain accounts, and they're very supportive of the domestic manufacturing versus buying product from China. Right now, I still see majority of the many company chain accounts in the market that are behind these -- using these for gas products are mainly, I would say, 80% are from China, and that's where we want to reduce our reliance from Chinese manufacturer into other parts of the world, especially if we can manufacture domestically, I would think that -- I've already spoken to a lot of chain, and we are gaining a lot of support that if the price is not too much more, they would actually support the domestic manufacturer like us.\n\nJake Bartlett -- Truist Securities\n\nGreat. Thank you very much.\n\nOperator\n\nOur next question comes from Michael Hoffman from Stifel.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nHi. Alan, Jian, thank you very much for taking the questions. On the freight side, can we follow through in the commentary of -- so there was a couple of million-dollar headwind in 2Q if rates are falling and given the inventory turns, you've added $27 million of inventory sequentially. We're going to see probably not as great, but still have pressure in 3Q and then a fairly significant reversals, the way to think about that that capitalized number.\n\nAlan Yu -- Chief Executive Officer\n\nYes. We have increased our inventory in Q2, and we are looking to significantly decrease our inventory in Q3 compared to Q2. And at the same time, we are going to see some favorable freight duty capitalization gain in Q3. That's where we're seeing it right, at this point because the ocean freight has dropped significantly.\n\nrat\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nOK. Just to be clear, though, you've got a whole bunch of inventory that's sitting on a freight and duty that's higher than the current market is. So -- I mean, that's a drag, isn't it in the third quarter until you get more inventory turns, you got to turn this inventory and get the stuff coming in at lower rates.\n\nAlan Yu -- Chief Executive Officer\n\nYes. Michael, I wouldn't say it's a drag. And I wouldn't say a lot of inventory at a higher cost. The higher costs came in, in the first quarter, not necessary in the second quarter.\n\nThe second quarter freight has already dropped. The product that we brought in the first quarter had a much higher rates have already been depleted, sold, and it's reflecting in the second quarters. And basically, right now, I would -- the reason I said that our inventory is going to drop significantly, especially, by the end of the third quarter is that we have already seen a reduction in terms of ocean freight coming in. And basically, all these new inventory that we brought in are at lower cost freight rates.\n\nAnd that's where we see that. And also starting next month, we'll be -- we reduced our inventory for six weeks period, and we're adding the inventory back starting this week. And all of our -- basically by the end of the quarter, most of our products will be at the normal market rates. And internally, we have not shown any decrease in prices in the market.\n\nSo it wouldn't be a market drag on our segment at this point.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nSo just to be clear, the $2.3 million freight and duty drag in 2Q should not repeat, it should be neutral to positive in 3Q?\n\nAlan Yu -- Chief Executive Officer\n\nIt will be -- I would say that it'll be neutral in Q3.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nOK. And then it should turn --\n\nJian Guo -- Chief Financial Officer\n\nAnd Michael --\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nGo ahead, Jian.\n\nJian Guo -- Chief Financial Officer\n\nHi, Michael. Thank you for the question. I just wanted to provide a little color there. So I think Alan is exactly right.\n\nIf you look at our inventory turns, our average inventory turn is about a little over 60 days. As far as total ocean freight and duty costs, including sort of the cash-based cost, as well as the capitalization piece. If you look at the second quarter, the total ocean freight represented about 18% of net sales, which, as I said, included the unfavorable impact of a little over $2 million already from this capitalization. When we look at the third quarter, our current expectation for the total ocean freight costs, including the impact from the capitalization, we expect to see that percentage to decrease to mid-teens.\n\nSo we do expect probably 200 basis points to 400, roughly, basis-point decrease in our total ocean freight and duty as a set of -- net sales in the third quarter, if that answers your question.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nPerfect. That's what I was trying to get at. What -- are you -- did you end up with signing a contract and having to take a contract rate in May, like lots of the world did. And if you did, where are you on the mix of spot versus contracts in your containers?\n\nAlan Yu -- Chief Executive Officer\n\nWell, that's a very good question. Yes, everybody signed a contract in end of April, starting in May. And as shipper realized, the spot rate is much lower than contract rate, the ocean -- all the ocean freight liners have agreed to reduce the contract rate to match the spot rate. So your mix would have been really high contracting earlier in the year.\n\nNow it's more spot, is what I'm hearing.\n\nEveryone is on spot now. Yes.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nAnd then what percent of sales was ecofriendly -- if you said that in the prepared remarks. I'm sorry, I missed it.\n\nAlan Yu -- Chief Executive Officer\n\nJian, you have the number?\n\nJian Guo -- Chief Financial Officer\n\nYes. It's still in the high teens. As a percentage of total net sales, we are seeing year over year, it probably -- it increased by roughly 1% is still in the high teens as a percentage of total sales.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nSo basically flat sequentially but up year over year. So we've settled in sort of a current level of demand based on access to the product and things of that nature, but the trend is still to drive it higher.\n\nAlan Yu -- Chief Executive Officer\n\nYes. We see a trend to drive this one higher.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nYes. Right.\n\nJian Guo -- Chief Financial Officer\n\nAnd that trend is going to be boosted, obviously, by -- as Alan talked about the joint venture in Taiwan, once the manufacturing start to -- once we start to get the products out of the joint venture in Taiwan.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nRight. And if I remember hearing it correctly, this should be in production in 4Q, but what am I looking at? It's really a 1Q before anything gets onshore USA.\n\nAlan Yu -- Chief Executive Officer\n\nThat is correct.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nOK. And then the $2 million fulfillment issue, was this a function of some of the labor challenges you've been dealing with? And you just didn't have enough people to move all of the goods out of Chino to be able to redistribute it into the other distribution centers in order to be able to then deliver it to the customers?\n\nAlan Yu -- Chief Executive Officer\n\nYes. Actually, in California, during the second quarter, end of like May and June, we've seen a much higher increase in COVID cases, related cases. We've never seen so many staff that are calling on sick for five to seven or eight even more days, and there's short staff getting product out. There are some challenges.\n\nAnd also, we have to call in temp agency people, and that also increased operational costs. But second quarter, we have to face a lot of shortage in labor that was one of the challenges. And that's one of the things that we did at open house, end of the second -- actually early July. And we actually added 5% of our -- we hire 5% additional labor force just to cover those shortages.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nAnd is it fair to say that $2 million is not a recoverable revenue, somebody else fulfills it ultimately? Or do you think you might actually get that $2 million back?\n\nAlan Yu -- Chief Executive Officer\n\nWe will probably get half of that back because of the shortage of -- everyone out there, we know that if a restaurant needs a product, and they can't find it from us, they will find from someone else. But one thing is, of course, for the items that we didn't strip out, we had a delay in shipment that wasn't moving. We were delaying about 10 days in some of the shipment out of California. So now we're pretty much caught up in terms of shipping product.\n\nEven online order, we were delayed for Amazon order and online orders after today, we're pretty much caught up. So -- and we're looking to increase more fill rates. So I would say that we recover 50% of that $2 million shortages from last quarter.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nAnd based on the comments you made in your opening remarks about moving product into Texas, South Carolina and New Jersey, you would expect in 3Q those fulfillment rates out of those distribution centers to be better than they were in 2Q.\n\nAlan Yu -- Chief Executive Officer\n\nYes. That's our goal.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nOK, great. Thank you.\n\nAlan Yu -- Chief Executive Officer\n\nThank you, Michael.\n\nOperator\n\nOur next question comes from Paul Dircks from William Blair.\n\nPaul Dircks -- William Blair -- Analyst\n\nGood afternoon, everyone. I think my first question is on price. Could you maybe quantify for us what price contributed in the quarter? And looking forward, do you expect to see any price deflation in particular on the plastic products side of the business?\n\nAlan Yu -- Chief Executive Officer\n\nI will lead the -- what the price in terms of the effect of the quarter. But on the question, on the remarks, on the price deflation, we do not see a price deflation in the paper. So I guess you already know that paper product is actually looking to go even higher potentially next year -- or actually early next year, possibly end of this year. That's what everyone is seeing, a shortage of paper product.\n\nPlastics, on the other hand, are we looking at a price drop in the past -- at this moment, I haven't seen any price drop. Domestically, the raw material did drop about 10% in terms of raw material, but most -- all of the manufacturing out there are seeing a higher operating cost in terms of warehouse, storage, feed, the labor cost has increased, the operational cost, the transportation of the movement of the raw materials; so that, we haven't seen the softness in terms of demand for plastics. And especially when -- right now, we're in the summer season, everyone is still looking to getting plastic cups in. Also everyone looking to switch to Styrofoam into plastic containers.\n\nSo, so far, the demand still outgrow the availability of the product. So I haven't seen much of that soften in that part of the area. Would that continue forward? We'll see how it moves but the things is right now, I just -- earlier, as I mentioned, the growth in takeout is 40%. There is still some supply issues in the market for most of the products, not all the product, but that's what we're seeing right now.\n\nPaul Dircks -- William Blair -- Analyst\n\nMy next question is, sequentially, could you maybe talk, Alan, about your conversations with the national chains and also your retail customers? On a sequential basis, sales were only up modestly. And thinking about how sales progressed last year, it's quite a bit of a lower growth rate than what we saw moving seasonally into the summer months last year. Can you maybe talk about those conversations that you had? Did the tone of those conversations change or perhaps get a little bit more cautious as we got into June and into July?\n\nAlan Yu -- Chief Executive Officer\n\nSure. One of the softness that we've seen is our The Zone product, our boba supply product that we're seeing a drop in terms of the sales volume. As last year, when the economy opened up, everyone was craving for a drink or a high end or expensive drink in terms of boba supplies. That we saw a softness this year.\n\nBut we do see that trend might continue to go upward trending up, as more chain account, national chain are looking to incorporate boba supply into their offering. Now in terms of discussion with the national chain account, now that we're open, and we're able to travel and meet our national chain account, we are in discussion with most of our national chain account to increase what they've been purchasing back store. That's one of our strategies to increase our wallet share for the existing customer, national chains. And we are talking to some meaningful large chain accounts.\n\nWe are looking to add additional product line into their firm usage and that sense we will be announcing in the third quarter, letting everyone know which chains actually were -- we've added new chains, or which distributor we have added in the third quarter. And also at the same time, despite how our growth with the national chain account will be growing because when with this -- that's with the national chain account, it does take a long time to get approval, get a markup, it's sample testing. And we've done all that in the -- during the second quarter, and we are looking to close most of the majority of the deal in the third and fourth quarter of this year. So that will trend into an increase in sales for 2023.\n\nPaul Dircks -- William Blair -- Analyst\n\nAnd my final question is on the bagasse facility in Taiwan, can you share with us, how did those product margins compare to the other eco-friendly products that Karat currently offers? And how would those margins be affected with the introduction of the new U.S. facility? Could those U.S. facility margins be yet the most rich that you guys would have in your portfolio? Can you help us understand the profitability of these products?\n\nAlan Yu -- Chief Executive Officer\n\nWell, the key aspect of having a bagasse product is, there's a need for it. Regulations in most places are banning plastic. So they're not even allowing the polypropylene or the reusable plastic. So basically, all the restaurant has to change into the compostable such as bagasse or sugarcane product line.\n\nIn terms of margin wise, is the -- I would think that the operational expense in U.S. is going to be definitely higher than overseas. But the benefit is that it is made in U.S.A. It is reliable.\n\nIt is domestic. Our customers can actually come and visit the facility to see how it's made versus if it's made overseas, what if there is a supply chain disruption? What if there's a ship down or a blockade in the certain part of the port in China. So that aspect, people will see the benefit in terms of not necessarily looking for the pricing-wise, as long as the price is not too far off compared to the product that are coming from overseas, that's where we see it. In terms of margin-wise, I don't -- I'm not going to see say that there's going to be a higher margin because we have to see how the operational expense will be in -- when we first started in domestic U.S.\n\nand part of the raw material that we will be receiving will be from our existing paper plants that we can mix into the -- we can recycle the paper pulp into, with the existing material, sugarcane or wheat and blend it in, that will reduce our operational -- actually our raw material costs. So this is where we see how effective we are able to use our raw material, recycled raw material, to produce the product.\n\nPaul Dircks -- William Blair -- Analyst\n\nI appreciate the color. Thank you.\n\nAlan Yu -- Chief Executive Officer\n\nThank you, Paul.\n\nOperator\n\nThat does conclude today's questions. I would now like to turn the call over to Alan Yu for closing remarks.\n\nAlan Yu -- Chief Executive Officer\n\nThank you, everyone. Well, thank you, all, for joining the conference call for Karat Packaging second quarter. We look forward to speaking with you again in the third quarter. Again, thank you very much, and have a nice, wonderful day.\n\nOperator?\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRoger Pondel -- Investor Relations\n\nAlan Yu -- Chief Executive Officer\n\nJian Guo -- Chief Financial Officer\n\nJake Bartlett -- Truist Securities\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nPaul Dircks -- William Blair -- Analyst\n\nMore KRT analysis\n\nAll earnings call transcripts"
}