{
  "companyName": "Albemarle",
  "companyTicker": "ALB",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/albemarle-alb-q3-2022-earnings-call-transcript/",
  "content": "Albemarle (ALB -0.28%)\nQ3 2022 Earnings Call\nNov 03, 2022, 9:00 a.m. ET\n\nOperator\n\nHello, and welcome to the Q3 2022 Albemarle Corporation earnings conference call. My name is Alex, and I'll be coordinating the call today. [Operator instructions]. I'll now hand over to your host, Meredith Bandy, vice president of investor relations and sustainability.\n\nPlease go ahead.\n\nMeredith Bandy -- Vice President, Investor Relations and Sustainability\n\nAll right. Thank you, Alex, and welcome, everyone, to Albemarle's third quarter 2022 earnings conference call. Our earnings were released after the close of market yesterday, and you'll find the press release and presentation posted to our website under the investor relations section at albemarle.com. Joining me on the call today are Kent Masters, chief executive officer; and Scott Tozier, chief financial officer; Raphael Crawford, president of catalyst; Netha Johnson, president of bromine; and Eric Norris, president of lithium, are also available for Q&A.\n\nAs a reminder, some of the statements made during this call, including our outlook, guidance, expected company performance, and timing of expansion projects may constitute forward-looking statements within the meaning of federal securities laws. Please note the cautionary language about forward-looking statements contained in our press release and presentation, that same language applies to this call.  Please also note that some of our comments today refer to non-GAAP financial measures. A reconciliation to GAAP financial measures can be found in our earnings release and the appendix of our earnings presentation. Lastly, I would like to highlight that in January, we plan to host a webcast to provide our full-year 2023 guidance and new five-year targets for our restructured businesses.\n\nWith that, I will turn the call over to Kent.\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nThanks, Meredith, and thank you all for joining us today. On today's call, I'll highlight our third quarter results and achievements. Scott will provide more detail on our financial results, outlook, balance sheet, and capital allocation. I'll then close our prepared remarks with an update on our structure and our strategic growth projects.\n\nWe had another excellent quarter as Albemarle continues to benefit from the demand for lithium-ion batteries driven by the energy transition. This, plus growth in bromine, drove a strong third quarter. We generated net sales of $2.1 billion or more than two and a half times the prior year period. Third quarter adjusted EBITDA of $1.2 billion or approximately five times the prior year period, continued the trend of increase -- of EBITDA increasing significantly outpacing sales growth.\n\nWe are tightening our previously raised 2022 outlook and reaffirming our expectation to be free cash flow positive for the year. Scott will review the key elements of our outlook in his remarks. In October, we completed the acquisition of the Qinzhou lithium conversion facility in China. This, along with the mechanical completion of the Kemerton 2 lithium conversion project in Australia has us on track to more than double our lithium conversion capacity this year.\n\nIn response to the growth opportunities ahead of us, we announced during the quarter a new segment structure that is expected to take effect in January of 2023. We are realigning our core lithium and bromine businesses into Albemarle energy storage and Albemarle specialties.  Additionally, we completed the strategic review of the catalysts business. After our work, we determined that the best course was to hold the business as a separate entity with a separate brand identity. Going forward, this business will be known as Ketjen.\n\nAfter the founder of the refining catalyst business, a call back to the business' proud history of innovation and sustainability.  Now I'll turn the call over to Scott to walk through our financials.\n\nScott Tozier -- Chief Financial Officer\n\nThanks, Kent, and good morning, everyone. I'll start on Slide 5. Diluted EPS for the third quarter was $7.61, compared to a loss of $3.36 in the prior year period. As a reminder, last year was negatively impacted by a settlement of a legal matter.\n\nAdjusted diluted EPS for the third quarter was $7.50, seven times the prior year EPS of just over $1. This overall performance was driven by strong net sales and margin improvement for the total company. Albemarle generated third quarter net sales of $2.1 billion, up two and a half times year-over-year due to ongoing momentum in the lithium and bromine businesses. Adjusted EBITDA margins improved from 26% to 57% this year.\n\nLet's turn to Slide 6 for more details on adjusted EBITDA. Third quarter adjusted EBITDA was up $1.2 billion, nearly 450% increase year-over-year. This strong growth continued to be driven by higher lithium EBITDA that was nearly $1 billion higher than last year. In fact, lithium's Q3 EBITDA was more than double what we generated in all of last year.\n\nThis record performance for the lithium segment was driven by higher realized pricing, which was up nearly 300%, and higher volumes that were up 20% versus the prior-year quarter. Lithium adjusted EBITDA margins of 74% were more than double the previous year. Margins are expected to moderate in Q4 and into next year for several reasons. First, a spodumene shipment from Talison originally expected in the fourth quarter occurred in Q3, resulting in a $100 million benefit in equity income.\n\nThis benefit is not expected to reoccur. Second, margins benefited from the timing of spodumene shipments and the rapid rise we have experienced in spodumene and lithium prices. It takes up to six months for a ton of spodumene to navigate our supply chain from the mine to the customer. This has given us above-average margins in 2022, particularly in Q3 because we are selling at higher lithium market prices, but cost of sales is based on lower-priced spodumene held in inventory.\n\nNote, we would not expect this benefit to repeat in 2023 unless we see a similar rise in spodumene and lithium prices from current levels. And third, as the MARBL joint venture starts to generate revenue and earnings, we anticipate some margin rate reduction. This is because the MARBL joint venture is being reported under a distributor model. Under this structure, we report -- Albemarle reports 100% of the revenue but only our pro rata share of earnings.\n\nWe would expect overall a return to more normal Lithium margin levels in the mid-50% range in Q4. Bromine was also up compared to the prior year, primarily due to higher pricing, up 18%, and volumes up 10%. However, we are beginning to see softness in some bromine markets, which I'll talk about in a few minutes. Catalysts EBITDA declined versus the year-ago quarter as higher sales volumes and pricing continue to be more than offset by cost pressures, particularly for natural gas in Europe and raw materials.\n\nMoving to Slide 7. We are tightening our ranges from the increased 2022 outlook we provided last quarter. This reflects the continued strength in execution in our lithium business and more modest growth in bromine while our catalysts performance is in line with our expectations. We have narrowed the ranges for the full-year 2022 guidance as follows: net sales of $7.1 billion to $7.4 billion, more than doubling versus last year; adjusted EBITDA of $3.3 billion to $3.5 billion, reflecting a year-over-year improvement of nearly 300%; and adjusted diluted EPS of $19.75 to $21.75, up about five times from 2021.\n\nWe still expect to have positive free cash flow for the full year. And assuming flat market pricing, we expect to continue to generate positive free cash flow in 2023, even with continued growth investments. Security of supply remains the No. 1 priority for our customers, and we continue to partner and work closely with them to meet their growth requirements.\n\nLet's look at the next slide for more detail on our outlook by segment. Lithium continues its stellar performance. We maintain our expectation for the lithium segment's full-year 2022 adjusted EBITDA to be up more than 500% year-over-year as strong market pricing flows through our index-referenced variable price contracts. Pricing growth is expected to be 225% to 250% year-over-year resulting from our previously renegotiated contracts and increased market pricing.\n\nWe also continue to expect year-over-year volume growth in the range of 20% to 30%. The current guidance range for the lithium segment reflects the potential upside for spot price improvements and the potential downside of volume shortfalls for the remainder of the year. For bromine, we are slightly modifying our full-year 2022 EBITDA expectations with year-over-year growth at the lower end of our recent outlook of 25% to 30%, but that's still above the outlook we had earlier in the year. The modification in our expectations reflects emerging softness in some end markets, such as consumer and industrial electronics and building and construction.\n\nThe slowing in construction is a natural consequence of higher interest rates. Full-year volume growth is also projected to be at the lower end of previous guidance for a 5% to 10% volume increase. For catalysts, we expect full-year EBITDA to be down between 45% and 65% year-over-year. We noted earlier that this market is being affected by significant cost pressures primarily related to natural gas in Europe affected by the Ukraine war, certain raw materials as well as freight and is partially offset by higher sales volumes and pricing.\n\nWe are beginning to realize some price increases associated with natural gas surcharges and inflation adjustments, and those are expected to ramp up in Q4 and going into next year. Turning to Slide 9 for an update on our lithium pricing and contracts. This slide reflects the expected split of our 2022 lithium revenues. Battery-grade revenues continue to make up approximately 85% of our lithium contracts.\n\nOur revenue and contract mix are unchanged from last quarter. We remain committed to long-term contracts with our strategic customers, and most of our volumes are sold under two- to five-year contracts. The market index structure of our contracts allows us to capture the benefits of higher market pricing while also dampening volatility. It also means that neither Albemarle nor our customers are too far out of the market.\n\nFrom the beginning of the year to today, market indices are more than 100% higher on average, moving from about $35 per kilogram to over $70 now. After holding at these levels for the last six months, indices recently ticked up again, thanks to healthy EV-related demand, particularly in China and North America. If price indices remain where they are, we would expect to realize healthy double-digit percentage price increases in 2023. Slide 10 shows the expected lithium sales volumes, including technical grade spodumene and tolling sales.\n\nIn 2022, as I said, we are looking at volume improvement of 20% to 30%, largely due to the expansion at La Negra, additional tolling, and some Qinzhou volumes. Volume growth in 2023 is expected to be north of 30% as La Negra, Kemerton, and Qinzhou continue to ramp plus additional tolling volumes. Based on current project timelines, we see room for further upside in 2025 from additional conversion assets such as our greenfield plant in Meishan. Turning to Slide 11.\n\nOur strong net cash from operations and solid balance sheet support continued organic growth and our ability to pursue acquisitions that complement our growth strategy. Our balance sheet includes $1.4 billion of cash and available liquidity of over $3 billion. Since last quarter, net debt-to-adjusted EBITDA improved to approximately 0.9 times and should end the year between 0.6 and 0.7 times. These levels give us excellent flexibility.  During October, we upsized and extended our revolving credit facility to reflect our larger scale and position us well in case of market turbulence.\n\nOver 90% of our debt position is at a fixed rate, which safeguards us against the impacts of a rising interest rate environment. Knowing that the economy is on everyone's mind, let's turn to Slide 12 for more on the macro environment. We expect all three GBUs to grow in 2023 even in the turbulent market environment. But it's going to look different for each of our businesses.\n\nFor example, in lithium and bromine, our vertical integration and access to low-cost resources helps control our cost structure. While approximately 45% of our costs come from raw materials and services, 20% of those relate to our own spodumene. We continue to expect strong demand for lithium driven by the secular shift to electric vehicles, including OEM investments and public policy support. We are watching to see how rising interest rates impact luxury vehicle sales in the short term, but we expect EVs to continue to grow and gain market share just as we saw in 2020 during the peak of the COVID pandemic.\n\nOf the three businesses, bromine and our lithium specialties demand is likely the most leveraged to global economic trends in consumer and industrial spending, automotive, and building and construction. At the same time, they benefit from having diverse end markets, meaning they can allocate production to higher growth or higher margin end markets as needed. Bromine and lithium specialties also tend to rebound quickly after a recession. Finally, catalysts demand is closely linked to transportation fuel demand.\n\nIn a typical recession, catalysts is relatively resilient. Think about it this way. Oil prices generally drop in a recession and that drives higher fuel demand, which equals higher catalyst demand for refining. And typically, the catalysts business would benefit from lower raw material costs in a recessionary environment.\n\nBefore I turn the call back over to Kent, I wanted to briefly reiterate our capital allocation priorities to support our growth strategy as seen on Slide 13. Investing in high-return growth opportunities remains our top capital allocation priority. We remain committed to strategically growing our lithium and bromine capacity in a disciplined manner. For example, the Qinzhou acquisition we just closed allowed us to accelerate growth and meet our return hurdles.\n\nMaintaining financial flexibility and supporting our dividend are also key priorities. As we saw during the COVID pandemic, maintaining an investment-grade credit rating and a strong balance sheet are key to executing our growth strategy and weathering temporary economic downturns. Now I'll turn it back over to Kent.\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nThanks, Scott. Before we look at the growth projects, I wanted to update you on the separation of our catalysts business and the reshaping of our core portfolio. We are realigning our core lithium and bromine businesses into energy storage and specialties and expect this to be effective in January of 2023. The restructuring is designed to allow for stronger focus and better execution on our multiple growth opportunities.\n\nEnergy storage will focus on lithium-ion battery evolution and the energy transition. And Albemarle specialties combines the existing bromine business with the lithium specialties business to focus on diverse growth opportunities in industries such as consumer and industrial electronics, healthcare, automotive, and building and construction. Following the strategic review of the catalysts business, we determined that the best course was to hold the business as a separate entity with a separate brand identity. This structure is intended to allow the catalysts business to respond to unique customer needs and global market dynamics more effectively while also achieving its growth ambitions.\n\nThe business will be named Ketjen, referencing the business' original founder, which draws on our entrepreneurial heritage, our catalysts business. This business will continue to be managed by Raphael Crawford. Additionally, we have established an advisory board for Ketjen, with Netha Johnson acting as chair. Its primary purpose is to provide thought leadership and strategic advice to Ketjen senior management.\n\nThese changes reflect Albemarle's focus on growing our business, our people, and our values by being agile and providing innovative solutions that anticipate customers' needs and meet the markets of tomorrow. So looking at Slide 15. As one of the world's largest producers of lithium, we are well-positioned to enable the global energy transition. We are focused on building the structure and capabilities to deliver significant conversion capacity around the world.\n\nWe are investing in China, Australia, and North and South America and anticipate production up to 500,000 tons per year on a nameplate conversion capacity by 2030. And we are off to a great start. When you look at where we were just a year ago at 85,000 tons, compared to our expectation to end 2022 with 200,000 tons of capacity. Now a few recent highlights around that capacity.\n\nIn Chile, the La Negra 3 and 4 conversion plant has completed commercial qualification is now generating revenue and running as expected. We are looking at a variety of options to enhance our Chilean operations to accelerate sustainability and potentially expand production. For example, as discussed in our sustainability report, we are progressing options for renewable energy and desalinated water projects. Albemarle and our predecessor companies have operated in Chile for more than 40 years.\n\nOur current contract with CORFO runs through 2043. By continuing to advance sustainability, we can continue to be the partner of choice, sharing the benefits of lithium production with the community and earning the right to grow our operations in the future. In Australia, the Kemerton 2 conversion plant has successfully reached mechanical completion and has entered the commissioning phase of the project. Kemerton 1 continues in qualification, and we expect to produce qualification samples by year-end.\n\nWe are also making progress with engineering on our Kemerton 3 and 4 project as we started placing orders for long lead-time equipment. In China, besides the acquisition of the Qinzhou lithium conversion plant, construction is progressing to plan at the 50,000-ton-per-year Meishan lithium hydroxide facility. Our ownership stakes at the Wodgina and Greenbushes lithium mines ensures we have access to low-cost spodumene to feed these conversion facilities. And finally, in the United States, the expansion to double production at Silver Peak is progressing ahead of schedule.\n\nAt the Kings Mountain mine, studies continue to progress positively. We announced two weeks ago, we have received a $150 million grant from the U.S. Department of Energy to partially fund the construction of a lithium concentrator. We're proud to partner with the federal government on this project.\n\nTo leverage our Kings Mountain lithium mine, we plan to build a multi-train conversion site in the Southeast U.S. This Megaflex site is designed to handle mineral resources from Kings Mountain and other Albemarle sites as well as recycling feedstock. We continue to expect the mine and the conversion site to be online later this decade, most likely in 2027. With our best-in-class know-how to design, build and commission both resource and conversion assets, Albemarle is well-positioned to enable the localization of the battery supply chain in North America.\n\nThe recently passed U.S. Inflation Reduction Act, or the IRA is designed to encourage domestic EV supply chain investment, among other objectives. The law includes manufacturing and consumer tax credits for sourcing critical minerals like lithium in the United States or in free trade agreement partner countries like Chile and Australia. The solid bar indicates 2022 expected lithium production in the United States and free trade agreement countries, both from Albemarle and other lithium producers.\n\nCompared to the forecasted U.S. EV demand for lithium by 2030, there's a 400,000-ton gap between today's supply and the supply needed in 2030. The bar on the right indicate how Albemarle's planned expansions in the U.S., Australia, and Chile can play a key role in increasing U.S. lithium supply and assisting our customers with increased demand for electric vehicles and localized supply.  Now moving to our last slide, let me sum up the key points on our growth strategy.\n\nFirst, a strong outlook. For 2022, we're projecting revenue at double 2021, adjusted EBITDA at nearly four times 2021, and cash from operations at four times 2021. And we expect continued growth into 2023. Second, financial flexibility to fund profitable growth and maintain our credit rating while still supporting our dividend.\n\nThird, a strong operating model that should power us through the current macroeconomic turbulence. Fourth, high-return growth projects are underway in both lithium and bromine. In total, Albemarle is well-positioned to deliver growth and build long-term shareholder value. This concludes our prepared remarks.\n\nNow I'll ask Alex to open the call for questions. And we'll go from there.\n\nOperator\n\nThank you. [Operator instructions]. Our first question for today comes from P.J. Juvekar from Citi.\n\nP.J., your line is now open.\n\nP.J. Juvekar -- Citi -- Analyst\n\nYes. Good morning. Some good information here. Kent and Eric, you just built Kemerton 1 and 2 conversion plants in Australia, La Negra 3 and 4, the Qinzhou plant in China that you just bought.\n\nSo you have a good handle on the cost to build a conversion plant. What's your estimate to build a comparable conversion plant in U.S. versus Australia versus China? And do you think the costs are as much as 10 times higher in the U.S. than China to build a convergent plant?\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nGood morning, P.J. So no, not 10 times. I wouldn't -- I mean it's going to be more expensive to build in the U.S. than China.\n\nSo we -- but we built in Australia now, and we're building in China. So we've got a good handle on that. So we think North America will be something like Australia and say for, and that might be twice China, but nothing like 10 times.\n\nP.J. Juvekar -- Citi -- Analyst\n\nOK. And then we know that there is going to be huge demand for lithium hydroxide in the U.S. You have the IRA now and availability of funding and grants. Why wouldn't you go ahead and announce several sites than just rather than building just one mega site?  And the reason I say that is that the time, as you know, takes to permit these facilities and build, why not get ahead of the curve if you want to meet that gap that you show on the chart between now and 2030?\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nYes. So we're building pretty aggressively, and we need both elements. We need the resource and then we need the conversion assets. So I mean, between balancing those, we're keeping less in balance and moving pretty much with the market.\n\nWe may be half a step behind. I don't know that we wanted to three or four facilities in the U.S., I don't think we could feed those. I'm not sure that would make sense. We would do -- I mean, our plan is we'll do this large facility that we're looking at in the conversion site in the U.S.\n\nThat's going to be a big facility and probably do another one at that scale, but we have to have the resource defeated.\n\nScott Tozier -- Chief Financial Officer\n\nKent, I'd add too, we're progressing our direct lithium extraction work in Magnolia, Arkansas. And so as that comes to maturity, you could expect a conversion facility in that area as well?\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nYes, it's a good point. And that's probably will be a little smaller facility just because of the resource from the direct lithium extraction. But that is a slightly different time frame than the conversion facility in the Southeast.\n\nP.J. Juvekar -- Citi -- Analyst\n\nRight. Just quickly, what was the size of the Megaflex facility? Thank you, and I'll pass it on.\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nWhat was the question? What is the site? We have [Inaudible] southeast --\n\nP.J. Juvekar -- Citi -- Analyst\n\nNo. No, the size. The size, yes.\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nOh, the size. OK. Sorry. So the size of -- we're planning 100,000 for a conversion facility of 100,000 tons.\n\nIt will come in phases. But the idea is roughly 25% would be from recycled materials, 75% from virgin material.\n\nP.J. Juvekar -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Matthew DeYoe from Bank of America. Matthew, your line is now open.\n\nMatthew DeYoe -- Bank of America Merrill Lynch -- Analyst\n\nGood morning, everyone. So I wanted to tap a little bit more on the equity income side of the equation. If I were to just look at what IGO reported as it relates to the equity income and the internal transfer pricing, can you help us kind of square how that kind of runs through your numbers, how that impacted the 3Q margins and maybe the puts and takes as we bridge to 4Q?\n\nScott Tozier -- Chief Financial Officer\n\nYes. So if you look at IGO's report, they show Talison's full equity -- full net income for the quarter. One thing to remember is for Albemarle, once we buy spodumene, we have to inventory that profit until we actually sell it to the end customer. And so that adjustment is kind of the reconciling item.\n\nAnd one way to kind of look at it is because of that six-month supply chain that I talked about in the prepared remarks, you actually go back to first quarter of this year, and that amount versus the amount in the third quarter is about what that inventory adjustment is.\n\nMatthew DeYoe -- Bank of America Merrill Lynch -- Analyst\n\nUnderstood. And can I ask how you're thinking about future investment in China? I know you have Meishan and I remember when the Tianyuan acquisition was initially announced, there was talk about potentially debottlenecking that facility. But how do you balance the lower capex in market size with kind of what feels like growing geopolitical risk to the region?\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nYes. So that -- it's a good question. And what we are -- I mean you get lower capital, we referenced that kind of like half the capital to do that in China. The Qinzhou acquisition was good for us.\n\nSo we'll look at -- once we operate that for a while and get a good understanding, we'll look at expanding it. Probably, most likely, we'll expand that. And then we've got the Meishan project that we're doing there. And then we had a project that we were looking at Zhangjiagang, and that's another one that we think about.\n\nBut we're -- as demand grows. So China is still the largest lithium market in the world, and their growth is quite significant. We've got demand growing in North America and Europe now. So we're trying just to balance that, manage the opportunity, and minimize the risk.\n\nSo I think that that's something that we look at all the time. Our plans -- our firm plans at the moment are -- we've done the Qinzhou acquisition, and we're building the Meishan project. And we're planning to do an expansion of the Qinzhou facility but we won't actually have to pull the trigger on that because we want to get a little bit of operating experience with that plant. And then change the design somewhat when we do the expansion.\n\nSo we look at it all the time and something that we just adjust to as to what's current.\n\nOperator\n\nThank you. Our next question comes from Aleksey Yefremov from KeyBanc Capital Markets. Aleksey, your line is now open.\n\nAlex Yefremov -- KeyBanc Capital Markets -- Analyst\n\nThanks. Good morning, everyone. The lithium volume guidance for this year is 20% to 30% and you posted 20% year-over-year in third quarter, 18% in the second. So is it fair to say if you're trending toward the lower end of this guidance for the full year at this point?\n\nScott Tozier -- Chief Financial Officer\n\nNo, we should be probably in the middle of that guidance range. So as we're ramping up volume at La Negra, you should see improvement to that growth rate in the fourth quarter. I don't know, Eric, if you have any more.\n\nEric Norris -- President, Lithium\n\nAlex, I'd just add that, that has always been the case, is that because of the nature of the ramp of our plants, both La Negra, Kemerton, Qinzhou coming into the full, we've always been back half loaded. The challenge we had in the third quarter was on the production side, mostly in tolling in China due to brownouts -- rolling brownouts in the region and how that impacted operating rates of our tollers ability to toll convert.  As we go into the cooler time of the year where we don't expect and have not seen those, obviously, now with the weather being warmer, we expect higher production rates on the tolling side plus the continued ramp up these plants as Scott referenced, that our owned plants. So we'd expect to get into the middle of that guidance with a strong volume performance in the fourth quarter.\n\nAlex Yefremov -- KeyBanc Capital Markets -- Analyst\n\nVery helpful. Thanks. And just pretty fresh news. The Canadian government is forcing some divestments of lithium assets there.\n\nAre you potentially interested? And if not, do you have any thoughts on this development? Does it matter for lithium industry in general?\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nYes. I mean I don't know if we have specific thoughts on it, but we are always looking at lithium assets. We were kind of comb the planet for lithium assets. So if they're interesting, we would be looking at them, but nothing to say on those particular assets today.\n\nOperator\n\nThank you. Our next question comes from Arun Viswanathan from RBC Capital Markets. Arun, your line is now open.\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\nGreat. Thanks for taking my question. Congrats on the good results here. Just wanted to, I guess, maybe ask you guys to elaborate on some of the market movements you're seeing.\n\nYou noted there's been some recent strong demand in EVs is moving prices higher. What's kind of the outlook as you look into the next couple of months? And could you also comment on potential elasticity impacts on EV demand, if there are any? What have you observed as far as demand trends kind of accelerating or decelerating on price increases?\n\nEric Norris -- President, Lithium\n\nThis is Eric. As you may know, EV sales through, I believe it's the end of September around the world are up 75%. And that's after a pretty soft part of the year -- early part of the year for China, in particular, because of the lockouts and because of supply chain challenges. The tone within the industry now on the automotive side is one of more concern about supply chain than it is about demand.\n\nAnd so as the supply chain pressures ease, automotive vehicle stocks are very low. We expect to see continued strong growth through the balance of the year and well into next year as well. So we remain bullish about those trends. Of course, the second part of your question, we continue to watch the economic impacts on purchasing behaviors.\n\nWe note that in the COVID time and in other periods of economic weakness, EVs have been, by and large, more of a luxury item and have not seen reductions in volumes coupled with just the strong secular trend and government policies now that are reinforcing that. But we'll watch the effect of interest rates on that. A big part of the mid-to-low end of the market is actually in China. And with China is coming out of its COVID lockdowns and recovering, we're seeing strength in that sector.\n\nSo we'll continue to watch what the economy -- economic effects and higher interest rates around the world might have on demand, but we don't see any impact nor is history tell us we should expect one.\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\nOK. Great. And then just on the upstream resource side, we've been hearing reports that some of the recently announced projects on the spodumene side may be difficult to move ahead just because of the increase in price and the capital that's required to develop those projects. Is that something that you're observing as well? And if so, what impact should that have, I guess, on spodumene and downstream hydroxide markets, if any?\n\nEric Norris -- President, Lithium\n\nTo clarify, you said increase in price was affecting projects. So you're referring to the capital cost to build the facilities for such plant?\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\nYes, both. There is -- we've been hearing there's been some increase in spodumene costs, both the capital costs as well as the acquisition costs are prompting some recently announced projects to get delayed. I don't know if that's -- at least that's what we've been reading.\n\nEric Norris -- President, Lithium\n\nYes. I mean, I think certainly, the effects of inflation are having an impact on -- we see those in our own capital cost. They can have an impact on our inflation. And it's highlighted for us the importance of our scale and our global procurement strategy to drive down costs.\n\nFor smaller companies, less experienced in executing capital. It could definitely have an impact. I don't know -- those are longer-term impacts than shorter-term. So we haven't seen that manifest itself yet in a change in market tone.  And as we said earlier, the demand is so strong and the balance of supply and demand is such that at the moment, this would only aggravate the supply demand issue and sustain strong prices at a market basis for lithium.\n\nSo we'll continue to watch it, but I think that's -- there might be some truth to what you're referring to that could have a long run impact.\n\nScott Tozier -- Chief Financial Officer\n\nUltimately, it's another example of how lithium projects take time and effort and challenges to get through it. That's not an easy thing to go through.\n\nOperator\n\nThank you. Our next question comes from John Roberts of Credit Suisse. John, your line is now open.\n\nJohn Roberts -- Credit Suisse -- Analyst\n\nThank you. Will the Megaflex plant be hydroxide or carbonate or both? And will the production trainer align campaign-specific types of feedstock or -- and then switch back and forth? Or will it run a continuous blend of mixed feedstocks?\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nYes, you're way ahead of it, John. I think it is -- will be -- it will run. It will be a blend, right? We'll blend things that come through, but it's going to be designed around Kings Mountain. And then other resources that will feed that and then the recycling.\n\nSo it's going to be quite flexible and why we're calling it the Megaflex. So there's -- there'll be flexibility around it. But I don't -- and it's not specific. We're not designing for a particular ore typically.\n\nWe try and -- we design in flexibility so we can operate on multiple resources.\n\nEric Norris -- President, Lithium\n\nSo that's where -- John, just to add. That's for some of the know-how and the process technology advantages that we have comes into play as we design that. But to go back to the first part of your question, the initial trains were targeting hydroxide at the moment. That's how it's -- we're looking at a 50,000-ton plant, and we're looking at what we've built in China, what we built in Australia.  We're taking the learnings in the best and developing that into a plan for execution here.\n\nWe'll watch the carbonate market development very carefully. With the recently passed IRA, it's very possible that more LFP capacity could come into the U.S. That being -- excuse me, cathode capacity. If that's the case, there could be a justification of future trains should be carbonate.\n\nWe'll have to watch that carefully.\n\nJohn Roberts -- Credit Suisse -- Analyst\n\nOK. And then on the newly combined bromine and lithium specialty segment, it's going to be back integrated to resource and bromine. But I assume you're going to purchase lithium from the energy storage segment? How will that transfer pricing be handled?\n\nScott Tozier -- Chief Financial Officer\n\nYes, John, we're still working through that. Likely, it will come through at cost, but we haven't sorted through all the details yet. So we'll let us share that in our January meeting.\n\nOperator\n\nThank you. Our next question comes from Vincent Andrews of Morgan Stanley. Vincent, your line is now open.\n\nVincent Andrews -- Morgan Stanley -- Analyst\n\nThank you. Good morning, everyone. Are you still looking to potentially change your relationship with mineral resources or the JV terms? And could you also provide an update on the Wodgina restart? And do you think that as debottlenecking opportunities or potential to operate sort of above prior nameplate?\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nOK. So first question about the JV. So we continue to talk and look at opportunities to kind of optimize that between the two of us. So those are ongoing discussions.\n\nAnd if we get to something that's different, we'll finalize that. We'll tell the market as soon as that information is available. Wodgina is operating. It's up and operating and the -- there are debottlenecking opportunities and additional trains that are potential, but it is up and operating today on two trains, I believe.\n\nAnd then we have -- and we're talking about starting -- we're talking about a third train, but it's -- there are two trains today, and they are operating.\n\nVincent Andrews -- Morgan Stanley -- Analyst\n\nWhat would be -- what's prohibiting you from going forward with the third train?\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nWell, we need to -- we have designs of it, and we need to be able to have conversion capacity for that.\n\nOperator\n\nThank you. Our next question comes from Kevin McCarthy of Vertical Research Partners. Kevin, your line is now open.\n\nKevin McCarthy -- Vertical Research Partners -- Analyst\n\nNow that you've had a few months to digest it, would you comment on what the economic impact of the IRA would be on Albemarle in terms of direct and indirect influences? And do you think it will influence how you allocate capital beyond the Megaflex project?\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nSo has it been a couple of months? That's -- but it will -- I don't know that it directly impacts our economics, but it's changed the market a bit. I mean there's more requirement for local supply in the U.S. and then supply from countries with free trade agreements with the U.S. And actually, it works out, we're well positioned for that, and we had planned to have -- we were planning the Kings Mountain facility and conversion in the U.S., but that is accelerating that, I would say, trying to go as fast as we can.\n\nWe did have plans already on the books before that happened, and this just kind of makes it more critical. So I know -- now that you translate it specifically into our P&L, but it does drive demand toward North America and to localize supply to as much as possible, and I think it will accelerate EV demand in North America.\n\nScott Tozier -- Chief Financial Officer\n\nYes. Beyond the effects, Kevin, of the incentives -- on the consumer incentives that are being put in place, there's a manufacturing tax credit that we will be able to benefit from. We're not exactly sure how it's going to work yet because the regulations haven't been put out. But it's 10% of manufacturing cost for battery materials.\n\nSo for us, that's probably in the $10 million range on a full facility. And then the other aspect is the minimum income tax or what some people are calling the new AMT. Again, that wouldn't affect us immediately, but a minimum tax of 15% potentially could affect us in the future.\n\nEric Norris -- President, Lithium\n\nAnd finally, Kevin, that's immediate topic you asked, I'll just add that it has an impact on purchasing behaviors. We're seeing a real not surprising interest for those who have U.S.-based production to preferentially put a premium in their view on sourcing from free trade countries or from the U.S. itself. So we'll be carefully sort of segmenting our customer base and looking at how we create the right value for ourselves and for our customers in terms of how we go to market and bring that and price that product in the marketplace.\n\nKevin McCarthy -- Vertical Research Partners -- Analyst\n\nThat's really helpful. I appreciate the color. And then as a follow-up, Scott, I think you mentioned in your prepared remarks that lithium prices on a realized basis could rise at a double-digit pace in 2023. Can you elaborate on that? What are you assuming in terms of market pricing vis-a-vis the uptick that you referenced in October? Maybe you could just kind of talk about where we're tracking in terms of low double digits or substantially higher than that and what you're baking in?\n\nScott Tozier -- Chief Financial Officer\n\nYes. So when I said that it's really based on market indices that are where they are today, so there's really two big effects happening as we go into next year. One is just the annualization of what we experienced in 2022. And then the second is we continue -- Eric and his team continue to work on those fixed price contracts and convert those to the index reference variable contracts.\n\nSo that's going to have a benefit for us as well.  And while we haven't provided specific guidance, the kind of ranges we are talking about are kind of healthy double-digit price increases next year. So again, contributing to what we're expecting to be another strong year of growth from lithium. And we're seeing it from all three of our businesses, to be honest, even in the face of potential slowdowns.\n\nOperator\n\nThank you. Our next question comes from Josh Spector from UBS. Josh, your line is now open.\n\nJosh Spector -- UBS -- Analyst\n\nSo just on the lithium contracts and some comments you made earlier. So your index references contracts used to be labeled a three- to six-month lag. Now they're about three months. You talked about moving more fixed price over to those types of contracts.\n\nI guess the duration continues to get a bit shorter. I'm just wondering, should we expect that duration to approach less than three months, say, one month at some point in the future? Or is three months kind of the right range that you're finding customers want to two and four?\n\nEric Norris -- President, Lithium\n\nJosh, I mean, I would think of it this way, first of all, to answer your question, three months is what we expect going forward as the lag. And that's a product of moving from a fixed contract with reopeners that are -- that had been up to six months to a full index where it's looking back three months on a rolling basis. So that is -- that's the standard of the term we're taking into the marketplace, and it's allowing us to benefit from rising prices while dampening the impact to the customer. So that's how we -- that's the strategy and how we plan to drive the portfolio going forward.\n\nAnd as Scott pointed out, we do expect some of the fix in that category of 20% that's on our contract slide to come down as we go into next year as well.\n\nJosh Spector -- UBS -- Analyst\n\nOK. And just on the DOE grant that you guys received. Is there a potential for you guys to receive more than one of those? I don't know if there's a limit per company or something else we could consider about additional support if you were to build additional facilities in the U.S.?\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nYes. So that was a particular program. So we wouldn't expect to get anything additional out of that. There was a process we went through and applications.\n\nWe got that particular grant. So if there are other programs, we could do that. But under this existing program, that was it.\n\nOperator\n\nThank you. Our next question comes from David Begleiter from Deutsche Bank. David, your line is now open.\n\nDavid Begleiter -- Deutsche Bank -- Analyst\n\nEric, just on Kemerton 1 and Kemerton 2, what are you expecting for production output next year from these two units?\n\nEric Norris -- President, Lithium\n\nLook, I think -- well, certainly, when we get into our January investor outlook for '23 and beyond, get into more details. But in the meantime, I apply the same rule of thumb we've applied all along, which is it takes up to two years to fully ramp to nameplate capacity. And you would expect that ramp to start with upon commissioning a six-month lag for qualification of the customer base. And in the first 12 months, getting to about half or slightly thereabouts of the capacity of any one of those plants.\n\nSo -- we are -- just to put that into practical terms, we are now expect to sample for qualification Kemerton 1 this quarter, and we'd hope to early or during the first half of next year begin sampling for the second train and then you can apply those rules of thumbs I just outlined.\n\nDavid Begleiter -- Deutsche Bank -- Analyst\n\nVery helpful. And just on the recent spike in Chinese spot prices, how sustainable do you think this is over the next few months? And thoughts on the spot prices for next year?\n\nEric Norris -- President, Lithium\n\nI don't -- it's very hard. I can only tell you, I think that the uptick of late has been a recovery in the market in China, in particular, from a demand perspective. And that has caused prices to -- they modulate -- moderated rather a bit in the middle part of the year and to come back up again. Where they go from here, David, hard to say.\n\nWhat we do know is as we look into next year, we still see a tight undersupplied market. So the dynamics are going to be favorable for strong prices. What that means for a point estimate of Chinese spot prices is a tough one to come up with.\n\nOperator\n\nThank you. Our next question comes from David Deckelbaum from Cowen. David, your line is now open.\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nGood morning, Kent, Scott, and Eric. Thanks for taking my questions. I wanted to just talk about IRA compliance. You highlighted, obviously, the fact that you have active production and conversion and free trade agreement countries.\n\nI just wanted to confirm whether it's your view that would you be selling qualifying materials from Kemerton or La Negra into the United States? Or would Kemerton be feeding U.S. customers? Or is that predominantly going to be feeding the Chinese market?\n\nEric Norris -- President, Lithium\n\nSo the answer is different by plant. If you start first with hydroxide and Kemerton, the intent for Kemerton, ever since it was built, long before IRA, long before recent geopolitical concerns was to supply a broad global market and to leverage the China assets we have for a China market. And as geopolitical circumstances have changed and things like the IRA have come along, as Kent said earlier, we're really moving toward a country-per-country or region-per-region-based strategy. So China for China, Australia would feed Asia and Europe, and North America in that regard.\n\nAnd we believe that to be the efficient route to go. If you look at carbonate, carbonate is a little different. The majority of the carbonate market today is China. And we don't have carbonate assets currently within China.\n\nSo a large purchase, chunk of what we make, a large percentage of what we manufacture at Chile goes into China. As the RA develops -- as demand develops in the U.S. and Europe, and I have to say, develops because it's still very, very small. That could change that dynamic, driving the need for us to try to get more out of Chile or other carbonate sources as we go forward.\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nI appreciate the color there. Perhaps my follow-up, there's a lot to ask here. But with the January update on your '23 outlook in the context of some of the U.S. expansion, the Megaflex site, Kings Mountain, you highlighted, I think before, Kent, that you'd aim to have these perhaps online in '27.\n\nIs that specific to just the Megaflex site? Or would that include Kings Mountain as well?  And do you expect to have a capital program for those assets envisioned in 2023, perhaps even in January with this announcement and start beginning the permitting process next year?\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nYes. So I mean we'll have capital. We'll definitely have capital in the '23 plan around those facilities. And the date, the '27 date is mine and conversion optimistically.\n\nIt all depends on the permitting process and the schedule, but that's the thinking.\n\nOperator\n\nThank you. Our next question comes from Joel Jackson from BMO Capital Markets. Joel, your line is now open.\n\nJoel Jackson -- BMO Capital Markets -- Analyst\n\nGood morning. You obviously have some visibility now in the types of prices you're getting January, February into Q1 obviously. Can you give us a sense of if -- are February pricing coming in better than January, January price is coming better in December on a realized basis on average?\n\nScott Tozier -- Chief Financial Officer\n\nWell, I mean, Joel, I'd say where the indices are today, that -- you'd have to say that they're better than what they were a quarter ago. However, recognize that there's room for movement either up or down from that depending on how those indices move. So --\n\nJoel Jackson -- BMO Capital Markets -- Analyst\n\nOK. You made a comment earlier in the call, I think that if spot pricing stayed the same, that 2023 pricing would be up double digits. I think you said that. What would spot prices -- it's a very high-level question.\n\nMaybe you can just give us some color. What would spot price have to do across 2023 for your realized price in '23 to be about equal to '22? It seemed like a linear decline, just a hypothetical scenario. What would that imply in that scenario to get -- where would you need to get to flat pricing in '23 versus '22?\n\nScott Tozier -- Chief Financial Officer\n\nI got to think through the math there because there are a lot of different contracts with different caps on them that we've got an account. I don't know, Eric, have you got a gut feel for it or I have to get back to Joel.\n\nEric Norris -- President, Lithium\n\nWe may get back to you, Joel. But the factors are that, obviously, we've been moving all year long, this year, in 2022 in price. And that's been part of our growth. That's been part of our strategy.\n\nThat's been part of what's driven some of the upsides to expectations along the way. We'll do a small amount of that to move to -- from fixed to variable next year, but the bulk of that is complete. But what happened during the year, if you just annual -- if you just take where we are now and annualize it in the next year, you've got a big increase. That, I think, is Scott's point.\n\nSo you'd have to see decreases that are pretty significant to draw that average down versus 2022. We'd have to do some modeling to see if we can give you better guidance than that.\n\nOperator\n\nThank you. Our next question comes from Christopher Parkinson from Mizuho. Christopher, your line is now open.\n\nChris Parkinson -- Mizuho Securities -- Analyst\n\nGreat. Thank you so very much. Got two fairly simple ones for you today. The first, just any quick update on your preliminary thoughts on a China EV subsidies in '23 and onwards?\n\nScott Tozier -- Chief Financial Officer\n\nI'm sorry I missed --\n\nEric Norris -- President, Lithium\n\nOh, right. Yes. Well, I don't know that our crystal ball is any better than anybody else's. I mean China has been easing its subsidies of late, and that has not dampened demand.\n\nDemand is up over -- sales are up over 100% year-on-year and then now accelerating in the back half of the year. I don't know that they need to accelerate but then they certainly have a lot of capacity in country that could serve that from a battery and cathode standpoint. Hard to say what industrial policy will be, sorry.\n\nChris Parkinson -- Mizuho Securities -- Analyst\n\nYour crystal ball is better than mine, for what it's worth. And then second question, just in the recent acquisitions in China, is that product already spec-ed in? Or what's the plan to have that spec-ed in with customers? Thank you.\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nYou mean qualified, you mean? Yes. So we've been actually tolling through the facility. So the acquisition took us a little longer to get some of the approvals than we anticipated. So we told our spodumene through it.\n\nSo we've qualified that product already.\n\nOperator\n\nThank you. That's all the time we have for Q&A. So I'll hand back to Kent Masters for any further remarks.\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nOK. Thank you, Alex, and thank you all again for your participation on our call today. Albemarle is a global market leader with a strong track record of financial and operational performance. We have a clear strategy to accelerate profitable growth, and we play an essential role in meeting the world's sustainability challenges.\n\nWe are proud of what we have accomplished, and I am personally thankful for our outstanding employees as we reshape our business for even greater success going forward. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMeredith Bandy -- Vice President, Investor Relations and Sustainability\n\nKent Masters -- President, Chairman, and Chief Executive Officer\n\nScott Tozier -- Chief Financial Officer\n\nP.J. Juvekar -- Citi -- Analyst\n\nMatthew DeYoe -- Bank of America Merrill Lynch -- Analyst\n\nAlex Yefremov -- KeyBanc Capital Markets -- Analyst\n\nEric Norris -- President, Lithium\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\nJohn Roberts -- Credit Suisse -- Analyst\n\nVincent Andrews -- Morgan Stanley -- Analyst\n\nKevin McCarthy -- Vertical Research Partners -- Analyst\n\nJosh Spector -- UBS -- Analyst\n\nDavid Begleiter -- Deutsche Bank -- Analyst\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nJoel Jackson -- BMO Capital Markets -- Analyst\n\nChris Parkinson -- Mizuho Securities -- Analyst\n\nMore ALB analysis\n\nAll earnings call transcripts"
}