{
  "companyName": "Allbirds, Inc.",
  "companyTicker": "BIRD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/allbirds-inc-bird-q3-2022-earnings-call-transcript/",
  "content": "Allbirds, Inc. (BIRD 2.11%)\nQ3 2022 Earnings Call\nNov 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to the Allbirds third quarter 2022 conference call. [Operator instructions] Now I'd like to turn the call over to Katina Metzidakis, VP of investor relations and business development at Allbirds.\n\nKatina Metzidakis -- Vice President, Investor Relations and Business Development\n\nGood afternoon, everyone, and thank you for joining us. With me on the call today are Joey Zwillinger and Tim Brown, Allbirds' co-founders and co-CEOs; and Mike Bufano, Allbirds' chief financial officer. Before we start, I'd like to remind you that we will make certain statements today that are forward looking within the meaning of the federal securities laws, including statements about our financial outlook, 2022, and medium-term guidance targets; impact and duration of external headwinds; our simplification initiatives; and other matters referenced in our earnings release issued today. These forward-looking statements involve a number of risks and uncertainties that could cause actual results to differ materially.\n\nPlease also note that these forward-looking statements reflect our opinions only as of the date of this call, and we undertake no obligation to revise any statements to reflect changes that occur after this call. Please refer to the SEC filings, including our quarterly report on Form 10-Q for the quarter ended September 30, 2022, for more detailed description of the risk factors that may affect our results. Also, during this call, we will discuss non-GAAP financial measures that adjust our GAAP results to eliminate the impact of certain items. These non-GAAP items should be used in addition to and not as a substitute for any GAAP results.\n\nUnless otherwise noted, we will be speaking to adjusted net revenue, which is a non-GAAP financial measure, when referring to net revenue during today's call. During today's call, we will also be referring to our active customers. Active customers are defined as the total number of unique customers who have made at least one purchase in the preceding 12-month period measured from the last date of such period. You will find additional information regarding these non-GAAP financial measures and the reconciliation of these non-GAAP measures to their most directly comparable GAAP measures to the extent reasonably available in today's earnings release.\n\nNow I'll turn the call over to Joey to begin the formal remarks.\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nThank you, Katina, and good afternoon, everyone. I'd like to start us off today by taking a moment to commemorate the one-year anniversary of our IPO, which is a critical step in building Allbirds into a defining global brand for this century, and what a year it's been. Despite the external headwinds and uncertainty, it's been a year full of wins, including cutting-edge materials innovations, a deep pipeline of new style introductions, the addition of our new third-party channel, and the launch of our ReRun program to enable a circular economy for our products. And through it all, we remain on track to deliver on all commitments from our sustainability principles and objectives framework that we outlined in our S-1, and we continue to lead the conversation on sustainability in the footwear and apparel industries.\n\nI could not be more proud of what our brand stands for, the incredibly passionate team and culture we've built, and our fiercely loyal customer base. Needless to say, Tim and I remain tremendously optimistic about the future of Allbirds. Before digging into the quarter, I want to provide a bit of context on the consumer environment as I see it. Back in Q2, thanks to our direct relationship with our customers and sophisticated data platform, we believe we were early to identify changes in demand signals.\n\nOur diagnosis of the market is playing out as we expected, and we entered the third quarter prepared for the demand environment. Thanks to these insights, coupled with some great work from our team, I am proud to report that we exceeded our Q3 net revenue and adjusted EBITDA guidance target while taking market share and delivering on our sustainability goals. Since we last spoke, we are seeing increased choppiness in the external environment, in addition to worsening FX headwinds and extended COVID lockdowns in certain areas of China. We expect Q4 to be negatively impacted by persistent inflation and high levels of promotional activity which will impact our U.S.\n\nbusiness, along with a weaker consumer backdrop in Europe and worsening FX headwinds. In fact, we are preparing for a scenario in which consumer headwinds worsen in the coming coming months and as the full impact of these myriad market dynamics are fully digested by consumers. We have taken this complex operating environment as an opportunity to streamline processes and optimize our cost structure and continue to execute against the simplification initiatives announced during Q2 while also investing in a customer experience that we believe that positions our business for continued growth with meaningful adjusted EBITDA improvement in 2023 and beyond. On the balance sheet, the high-quality, evergreen nature of our inventory has allowed us to tighten our open to buy, something we'll continue to do going forward, targeting increased terms to free up working capital and increased margin from lower holding costs.\n\nDespite this cautious outlook on consumer demand, given the economy, we expect a meaningful increase to inventory turns in 2023 as these initiatives fully take hold. These points validate my belief that the actions we took last quarter were the right things to do at the right time. Looking ahead to holiday season, we expect the external environment to be the most promotional we have experienced since launching the company in 2016. Despite that, we have prepared a great product road map alongside the right mix of inventory, and we've coupled that with a strong holiday marketing campaign.\n\nTaken together, I feel confident as we head into this all-important season despite the noisy external environment. And while we are taking a more conservative approach to planning our business, we continue to prudently invest behind our three growth initiatives: one, expanding and energizing our product portfolio; two, growing our store fleet; and three, scaling our international business. Starting with product, we are incredibly proud of our recent launch of Plant Leather, a first-of-its-kind innovation, performing similarly to bovine leather but with 100% plastic-free material. This is a key point of differentiation from other leather alternatives.\n\nOur first product with Plant Leather was on a new silhouette called the Pacer, which provides our customers with an elevated sneaker style, expanding the use occasions where consumers can select a pair of Allbirds. We also have good product flow for holiday that we expect our customers to love. Moving to stores, our own retail channel grew net revenue 53% year over year. We opened eight new stores during the quarter, including six in the U.S.\n\nIt's important to note that nearly half our current store fleet is still in the ramp-up phase, which has historically taken around four quarters to reach a revenue maturity. However, that sales ramp is taking longer right now given the macro headwind. Our stores remain a powerful acquisition tool, allowing us to gain leverage on marketing spend to lower customer acquisition costs, increase the penetration of valuable omnichannel repeat customers, and are ultimately the best expression of our brand. Our U.S.\n\nstores maintain an impressive score for NPS of above 90, which we believe positively correlates to repeat purchase and the health of the Allbirds brand. That said, we continue to be negative negatively impacted by traffic that remained below pre-COVID levels. The slow traffic recovery appears to be consistent across our industry and that we believe that we will recover the majority of this traffic. The timing of that recovery is unclear given the operating environment.\n\nWrapping up on retail, even in a choppy environment, we continued to see an overall uplift in omnichannel sales in markets with stores, above what we see in e-com-only region. Turning now to third party, I am happy to report that we are tracking ahead of our expectations with strong early sell-throughs. We are thrilled to have added REI as our most recent retail partner, along with our 20-million-plus co-op members. REI's belief in the transformational power of nature and their dedication to climate action aligns perfectly to our goal of making better footwear and apparel products in a better way.\n\nI'm also pleased to announce that we will be furthering our partnership with DICK'S Sporting Goods beyond the company's Public Lands banner. In the coming weeks, we will enter DSG's newest House of Sport format which delivers a fantastic customer experience in three doors and intend to expand to other DSG core format stores beginning in Q1. We are taking a methodical approach to develop unique and compelling stories for customers with each of our marquee partners. Our center-stage activation at Nordstrom was a great example of this, as is the holiday activation that we currently have in REI flagships.\n\nAt just over 100 doors, we have a long runway of potential growth ahead of us in third party. Similar to our direct retail strategy, a key tenet of our third-party strategy is to use the channel to meet consumers who have not yet heard about our wonderful brand and fantastic products. We believe that our third-party footprint is already increasing new customer acquisitions and brand awareness. In fact, we have found very little overlap between our direct channel customers and those of our third-party partners, providing a fantastic runway and opportunity for brand discovery.\n\nAs we noted last quarter, the journey we take to achieve our strategic and financial goals may shift, but the destination looks the same. In a time of significant volatility, we continuously evaluate our channel strategy to determine the optimal balance between third-party and owner retail stores. As we plan growth across our channels, including digital stores and third party, we will be conscious of and deliberate on the balance between top-line growth, profitability, and importantly, capital efficiency. I look forward to providing more updates on upcoming calls as we continue along our journey and methodically grow the marketplace for our products.\n\nTurning quickly to our international business, revenues grew nearly 11% despite an approximate 1,500 basis points year-over-year headwind from FX. Though we remain confident in the long-term demand in our international markets, as we mentioned last quarter, we are primarily focused on five key geographies as we continue to navigate this choppy macro environment: the U.K., Germany, Canada, Japan, and China. As an example of this focus at work, we are experiencing strong momentum in the U.K. despite the overall environment being challenged in Europe.\n\nDuring Q3, we saw over 20% growth in local currency, driven by solid comps in our established Allbirds stores in London and positive initial response to our new King's Road store. We also opened Selfridges shop and shop which is increasing brand awareness and driving sales. In closing, I am proud of the work we are doing to build Allbirds into a generation-defining brand and remain confident we can simultaneously drive efficiency into the business. Thank you for taking the time to be with us in the call today.\n\nAnd with that, I'll turn it over to Tim.\n\nTim Brown -- Co-Founder and Co-Chief Executive Officer\n\nThanks, Joey, and good afternoon, everyone. As we look at what's happening in the world, never has it felt more important to emphasize our sustainability goals. We recently published our 2021 Sustainability Report, and I'm proud to highlight that while growing our revenue by 27% in 2021, we actually reduced our average product carbon footprint by 12%. Our teams are energized by our goal to cut our already low per product carbon footprint in half by 2025 and drive it to near 0 by 2030.\n\nIn support of this long-term plan, we are proud to have made groundbreaking, tangible progress and set a new industry standard for others to follow. We've done this by focusing on three key areas: regenerative agriculture, renewable materials, and responsible energy, which have helped make 2021 a banner year toward meeting our brand promise for consumers. In regenerative agriculture, we partnered with supplier New Zealand Merino and other brands to pave the way for regenerative wool in New Zealand through the ZQRX framework. To date, nearly 500 growers have signed up, representing 15% of New Zealand's farmland, committing to work with nature to continuously improve human, animal, and environmental outcomes.\n\nIn renewable materials, we introduced our Tree Dasher 2 running shoe, reducing its carbon footprint by 5% by introducing a midsole that was 21% lighter and removing unnecessary components. And on renewable energy, in 2021, we procured 100% of our energy from renewable sources to meet our electricity use of manufacturers in the U.S. and Vietnam. And across the globe, our manufacturing partners work to install on-site solar at their facilities.\n\nIn addition, we increased our share of ocean shipping, which has a significantly lower carbon footprint than shipping by air from 80% in 2020 to 84% in 2021 to over 9% this quarter. In addition to carrying a global carbon footprint, ocean shipping has real benefits for our gross margin. This signifies the essence of our model. The more sustainable we are, the better our businesses.\n\nThese are just a few of the many things we're up to, and I encourage all of you to take a look at our latest sustainability report to see how we continue to lead the conversation in sustainable footwear. Turning to product, Q3 was a big materials innovation quarter for Allbirds. We launched Plant Leather, a first-of-its-kind leather alternative that is 100% plastic-free, 100% vegan, and exclusively contains natural materials, like plant oils and agricultural by-products. We also launched two lightweight materials, woven wool and canvas, which make up a growing and robust suite of materials that we work hard to build.\n\nMoving forward, we will continue to inject these into our new and existing product franchises to expand and enhance the supernatural comfort experiences we offer. Looking across our broader product portfolio, we have made meaningful progress in both performance and lifestyle this quarter. We remain very happy with our performance footwear protfolio. In fact, the Flyer was just recognized by Men's Health as a top-running sneaker for 2022.\n\nWe continue to see the Flyer franchise as another important step toward building our performance credibility. In lifestyle, our new Pacer silhouette, which is available in limited supply in plant leather, broadens our lifestyle repertoire with a true sport style shoe, providing additional use occasions for our consumers. We've intentionally launched the Plant Pacer with limited supply, and we are encouraged by the media and consumer reaction. We will continue to invest in growing this new franchise moving forward.\n\nContinued style innovation will be paramount to our next phase of growth and play a key role as we move into third party. I'm also excited about our strong product pipeline going into holiday, including our recently launched Wool Runner run collection, which combines our best-selling water-repellent Mizzle material and performance footwear, as well as our new Fluff Wool collection, which is perfect for gifting, at the heart of our recently launched holiday campaign focused on our core brand offering of supernatural comfort. In closing, amid all the volatility, we are continuing to do the hard work and material innovation, and product creation and remain focused on leading the conversation on sustainability in the footwear space with great products made from supernatural materials. With that, I'll turn it over to Mike.\n\nMike Bufano -- Chief Financial Officer\n\nThanks, Tim, and good afternoon, everyone. I'd like to start by adding my thanks to our teams for focusing on controlling what we can control. Their execution led to a solid financial outcome in the quarter. Adjusted net revenue increased 15% to $72 million, 19% when excluding the impact of FX.\n\nLet me break down the growth drivers. Starting with geographies, we saw balanced growth with the U.S. up 17% and international up 11%, 26% when adjusted for FX. Looking at channels, third party was a significant growth driver and represented a mid-single digits percent of revenue mix.\n\nWe continue to expect third party to be an EBITDA-accretive growth driver in 2023. Looking at revenue growth through our customer lens, in our direct business, orders increased 16%, and average order value was up 2%. I'd like to go deeper and provide some granularity on active customers which we view as a good indication of the health of our branded business. In Q3, active customers increased 12% on a year-over-year basis, roughly in line with the trend we saw in Q1 and Q2.\n\nIn addition to strong growth and active customers, we have seen steady increases in spend per customer. We saw gains across active customers in both digital and retail. As you'd expect with more stores in 2022, retail was the bigger driver. As Joey noted, our stores build brand awareness, efficiently, acquire new customers, increase repeat rates of existing customers, and drive omnichannel customer LTV.\n\nWe view our consistent growth and active customers as a strong indicator of brand health and an important proof point that our growth pillars are helping us build a durable business for the medium and long term. Moving on to adjusted gross margin, Q3 came in consistent with expectations at 47.6%. Business segment mix away from our gross margin accretive international business and the increase in third-party sales and COVID-related cost headwinds were partially offset by increased ocean shipping and a modest early benefit from our simplification initiatives. We also experienced modest pressure from our previously discussed strategic increase in promotional activity, which partially offset some of the benefit of our price increase.\n\nWe continue to believe that we need to respond in this highly competitive environment and meet customers where they are. Importantly, customers that we have acquired through promotions continue to behave similarly to prior cohorts. Finally, our adjusted EBITDA was negative $12.7 million. We benefited from tight SG&A control tied to the simplification initiatives, as well as lower marketing spend.\n\nMarketing decreased both sequentially and on a year-over-year basis due to increased efficiencies in our digital channels and the shift of some marketing spend from Q3 into Q4. Again, we feel really good about delivering this result in Q3. Moving to the balance sheet, we ended Q3 with $127 million of inventory, which was up 3% from the end of Q2. In-transit inventory accounted for over one-third of that inventory but has come down slightly compared to Q2.\n\nIncluded in that $127 million is about $5 million of end-of-life products that we're continuing to liquidate as part of the simplification initiatives. We feel good about the makeup of our inventory, the vast majority of which is core evergreen footwear. As mentioned during our last call, we have begun to buy tighter on core footwear as we plan for a more uncertain consumer demand backdrop in 2023. Tighter buying, coupled with our selective promotional strategy, is expected to reduce inventory levels and improve terms.\n\nWith mid-teens revenue growth this year, a structural slowdown in spending due to the simplification initiatives, and improved inventory terms, we expect free cash flow to improve and believe our Q3 ending cash position of $181 million is more than ample to fund our growth initiatives for the foreseeable future. Before leaving Q3, I would like to provide an update on the simplification initiatives announced last quarter. These initiatives have set us up to continue delivering top-line growth while keeping us on a path to reach our profitability and cash generation targets. I'll walk through the initiatives and provide updates on each.\n\nThe first initiative is investing in our supply chain to reduce both costs and our carbon footprint. Later this year, we will commence production with a new factory partner. The full impact of this change will flow through the P&L in 2024, but we expect to significantly decrease our land and product costs on a run-rate basis in early 2023. I'm also pleased to report that just last week in the U.S., we successfully transitioned to our automated distribution centers and new dedicated returns processor.\n\nTaken together, these changes have already provided greater logistics cost predictability for Q4, and we would expect to see a positive impact on gross margin in 2023. The second initiative is streamlining our organizational structure and reducing SG&A to free up resources to continue to invest in areas that are critical for demand generation. We are on track to deliver the previously communicated corporate SG&A savings target of $4 million to $5 million in 2022 and $13 million to $15 million on an annualized basis starting in 2023. The third initiative is the one-time liquidation of end-of-life inventory, which is proceeding as we expected.\n\nOverall, we are on track with the simplification initiatives and continue to expect the total nonrecurring net costs associated with them to be $18 million to $24 million. To echo what Joey said earlier, it is clear to us that these actions were the right thing to do at the right time. I'd like to now turn to our guidance targets for the rest of 2022, which exclude any nonrecurring revenue and costs associated with the simplification initiatives. Our 2022 annual guidance target range has remained unchanged.\n\nWe continue to expect adjusted net revenue of $305 million to $315 million, up 10% to 14% versus 2021, 13% to 17%, excluding the impact of FX. This implies a Q4 range of $92 million to $102 million, which, when compared to Q4 2021, is a range of minus 5% to plus 5%. We expect the U.S. and international to grow at roughly similar rates in Q4.\n\nFor adjusted gross profit, we continue to expect a range of $150 to $157.5 million. The midpoint of our revenue and gross profit targets represent an adjusted gross margin of 49.6%. We also continue to expect adjusted EBITDA of negative $42.5 million to negative $37.5 million. One model update is that we are now expecting to open 22 net new stores, up from 16 to 17, as a few projects finished faster than anticipated.\n\nBy the end of 2022, we expect to have 57 total stores: 42 in the U.S. and 15 internationally. These additional openings will modestly pressure Q4 adjusted EBITDA. Thinking of Q4, like everyone else leading a consumer business right now, we're passing through all the cross-currents that are impacting spending this holiday season.\n\nI'd like to share a few thoughts on how we're viewing Q4 and what we're doing in response. In our business, Q4 has historically the highest sales volume quarter of the year with November and December alone accounting for over 25% of full year sales in 2021. So far in the quarter, consumer spending habits and traffic have been notably choppy, especially in the U.S. Our read is that the impact of high inflation and recession fears is creating more cautious behavior, and we believe consumers will buy closer to need as they wait for promotions this holiday season.\n\nThis is different than last year when spending started earlier because of headlines about supply chain delays. Q4 guidance targets assume an improvement versus our quarter-to-date trends. We feel confident in that improvement because we have what we believe to be our best holiday marketing and product campaign in our company's seven-year history. We have to meet consumers where they are right now and factor in the competitive environment, so our broader marketing strategy for the season includes an enhanced promotional calendar.\n\nDepending on how the holiday season plays out, we could end the year at full price sell-through of 80% to 85%. That remains much better than industry peers but below the 85% to 90% we communicated on the Q2 call. I'd also like to remind everyone that in the retail channel, we will begin lapping weeks that were pressured by Omicron later this quarter. Finally, there are several additional external macro factors we are considering as we look at the quarter.\n\nOne, we continue to see increasingly negative FX headwinds. Indeed, our current Q4 estimate is that the year-over-year impact is now $45 million, which is a couple of million worse than what we factored into the guidance last quarter. Given the volatility in rates, there is potential for further headwinds in the next few months. Two, we continue to see volatility in our China business due to consumer spending ripple effects [inaudible] rolling COVID lockdowns.\n\nAnd three, there is risk that U.S. consumer spending does not bounce back and could moderate further. Taken together, we believe all these factors create increased risk of Q4 results coming in at the lower end of our guidance target ranges. In closing, while this is a really tough operating environment, we continue to feel confident about how we are positioning our business for the future and our ability to become better operationally, deliver on our sustainability initiatives and take share.\n\nThrough our thoughtful approach to our supply chain, operating structure, and processes, we have built a stronger and leaner infrastructure. We believe these actions, coupled with our three growth pillars and our intense focus on cash management, position us to drive the business toward our medium-term profitability targets and create shareholder value. Thanks for your time. Operator, please open the line for Q&A.\n\nOperator\n\nThank you. At this time, we will conduct the question-and-answer session. [Operator instructions] Our first question comes from Mark Altschwager with Baird. Please go ahead. \n\nUnknown speaker\n\nHi. This is Amy on for Mark tonight. We've seen you take the footwear assortment in a few different directions this year with the Flyer launch earlier in the performance-owning category, not the Pacer's new lifestyle shoe. Where are you focusing on now in the product development pipeline? Should we expect to see more internal on the lifestyle side around the performance side?\n\nTim Brown -- Co-Founder and Co-Chief Executive Officer\n\nYeah. Thank you for the question. We'll continue to stay laser-focused on the idea of supernatural comfort across all the products that we're making. The majority of our product focus and innovation focus remains on the lifestyle space.\n\nWe're really excited and pleased with the launch of the pace, our most recent Quarto-style franchise, that is performed well and also introduces a new natural material platform and plant letter that we feel really excited about. We still remain in the early days of our journey into performance. The Dasher, our original franchise, is at the core of that, and the trust continues to perform really, really well for us as an entry-level running product. The Flyer pushed that even further with the new material technology in Swift form, again, that we feel really good about.\n\nAnd overall, the performance -- there's about a quarter of the business, and we'll continue to build that and build credibility with that over time and expand the use case. We continue to think that there's a great white space in the category for natural materials and for the consumer trend around our sustainability purpose. So lots more to come, and we're really, really excited about the product road map looking forward to in '23\n\nUnknown speaker\n\nGreat. Thank you. And then switching gears, can you talk a little bit more about how you're thinking about your own promotional activity? We noticed the file 15% off on this side is a bit different than your past promotional strategy. Are you seeing customers react to increased promotional cadence? Or is this just coming ahead of what you expect to happen?\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nYeah. I think we -- thanks. This is Joey. We've really signaled this early on that we anticipated a very significant increase in the overall environment promotion.\n\nAnd I think if you look around the industry, it certainly stand out that way. So -- and we're feeling it, and Mike alluded to the fact that we're expecting perhaps even a slight uptick in the promotional activity will do as a result of meeting the moment and making sure we're competitive for the consumer in this super promotional environment. So we're elevating that to a certain degree. That said, I'll reiterate, we feel really good about the balance that we're making in terms of meeting the consumer where they are for the moment, meeting the industry, and still being best-in-class in terms of the premium nature of how we're approaching discounts and promotions.\n\nSo feeling generally pretty good about that, and it's all on track with what we kind of signaled to you all at the last quarterly call.\n\nUnknown speaker\n\nAll right. Thank you.\n\nOperator\n\nThank you. The next question comes from Lorraine Hutchinson with Bank of America. Please go ahead.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThank you. Good afternoon. You spoke last quarter about your simplification program setting you up for significant adjusted EBITDA improvement in 2023, as we getting closer to '23, can you provide some numbers of board rails around your goals or targets for EBITDA?\n\nMike Bufano -- Chief Financial Officer\n\nYeah. Hi, Lorraine. It's Mike. We'll get into that more on the next call after Q4 in part, just really thinking to the fact that it's a pretty volatile demand environment right now.\n\nSo when we look at it, we think we're making material improvements, especially on the gross margin side, we iterated the $13 million to $15 million of structural SG&A savings that are coming on that as well on the corporate side. still in the world of the middle, the P&L, and the things that we can have the most direct control over, we feel like we're making really good progress there. The one other factor that will play into that for us as well when we look at 2023 EBITDA is the fact that we do be the third-party channel add EBITDA accretive. So once we have a better handle around exactly how much we're going to expect out of that channel and how much we can potentially expand it in '23.\n\nThat will also play into it as well. So we look forward to talking a little bit more about that when we get into more detail on '23 and the next call.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThank you. And then maybe as a follow-up. I'll just ask for some details around the comments you made on improving marketing efficiency further. Do you want to start on that, Joey?\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nSure. Yeah. So I think what we're really referring to is the continued path toward getting leverage on marketing. And part of that, of course, comes from channel shift, and while we still have our brick-and-mortar fleet in its infant in terms of, as we mentioned, about half of it still in the ramp-up phase before hitting revenue and overall target maturity on profitability.\n\nSo it's a little bit of that mix shift. And then it's also just being really balanced through the funnel and making sure we're optimizing our -- both our creative and our media mix and as we've said before, we've done a really nice job as a team to navigate through a whole bunch of IDFA challenges that we were well ahead of and we're able to continue to drive good leverage throughout the P&L on marketing despite the fact that we continue to invest in the brands.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Bob Drbul with Guggenheim Securities. Please go ahead.\n\nBob Drbul -- Guggenheim Securities -- Analyst\n\nHey, good evening. Just a couple of questions. On the store fleet, can you talk a little more around some of your older stores, more established stores, or more mature stores if that's the right word to use, mature stores? But just in terms of what you're seeing there in terms of volume and/or markets? And then on the brand itself, have you guys done any more recent evaluations on sort of aided awareness, unaided awareness, progress that you think you're making with the brand? That would be helpful. Thanks.\n\nMike Bufano -- Chief Financial Officer\n\nHey, Bob. I'll start on the stores. Joey alluded to, it's a tough environment out there overall in retail, as you well know. So the pre-'19 stores are not all the way back up to the same level of traffic they were Corvid.\n\nBut we feel pretty good overall about how those stores are performing right now, and they're certainly serving the role that we talked about, which is they really help us drive brand awareness. They drive LTV for our omnichannel customer deliver sort of the best customer experience that we can offer kind of going forward. So that's how we're viewing it on the retail side. Tim or Joey, do you want to jump in on the brand question?\n\nTim Brown -- Co-Founder and Co-Chief Executive Officer\n\nYeah. I'll just really quick, Bob, on that. It's not a metric that I'd say is reliable quarter to quarter, in general, which is why we don't really share it all the time. But I can tell you that directionally, we're making great progress, and it continues on a trend line basis to increase.\n\nAnd when we look at specific cities where we have retail stores, that really helps drive it a lot. So when we focus on certain concentrations of our target consumers in certain cities. And we infill that region with stores, it does a really nice job for us. . And of course, too much -- too early to tell on the third-party actual quantitative impact of that, but being in 100 doors kind of a drop in the bucket in the market that we play in.\n\nBut obviously, you'd expect, as we've outlined in the strategy of why we're doing this to really significantly uptick on aided awareness there.\n\nBob Drbul -- Guggenheim Securities -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Edward Yruma with Piper Sandler. Please go ahead.\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nHey, good evening, guys. Thanks for taking the questions. I guess, first, you've expanded the SKU count pretty materially, and it sounds like you're going to continue to innovate. How do you think about editing SKUs, making sure the right assortment, given that I think historically, your variation was largely color driven? And then as a follow-up, on the 5%, I think it was incremental growth from wholesale, how should we think about the gross margin impact, understanding that it is EBITDA positive and if wholesale continues to grow, how we should be thinking about that medium-term model implication? Thank you.\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nThanks, Ed, for the questions. I'll jump on the first one and then pass it over to Mike on the second one. So as you noted, as we increase the SKU count, there's an inevitability that we need to be a little bit more seasonal with some of those offerings to deliver a balance of freshness to the consumer being seasonally relevant and then also managing inventory very prudently. It's going to drive some promotional activity and markdowns for us.\n\nMarkdowns is a better way to put that. So that is the normal cycle that we expect to continue to deliver, and that's all within kind of that premium brand positioning that we expect to navigate our markdown site discounts and to a certain extent in our physical retail stores. So we're managing that carefully, and we're also trying to be very smart about how we keep the overall marketplace very clean when we interact with third parties in this which is why we're taking kind of that marquee strategic account approach to building the third-party marketplace for us because we really want to maintain as much control over price and how we show up to the consumer across channel as effectively as we can.\n\nMike Bufano -- Chief Financial Officer\n\nI'll take your second part of the question there, and on third parties. Just a couple of things there. First, Remember, because we're starting these relationships new with some of these retail partners in Q3 and Q4, there's a little bit of load in, right, into the stores, into the sales there. That's part of why we called that out as a bit unique for the quarter.\n\nIn terms of the gross margin impact, it wasn't one of the biggest drivers on a year-over-year basis, it was a little bit of the stuff that we laid out in the call were the things that we felt really like moved gross margin on land this environment, we feel pretty good about where gross margin landed for the quarter, especially very much in line of our expectations coming into the quarter. Your question on the model implications in the medium term, again, much like my response levering earlier, I think that's something we'll take on a little bit when we get into the Q4 call, we have a better sense on the ultimate size of the third-party business in 2023. And we can lay that out. And I just ground again, we've talked about our gross margin objective and our gross margin target.\n\nThat's been focused on the direct business. So third party, we would probably break out a little bit differently over time due to visibility on to both.\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Matthew Boss with J.P. Morgan. Please go ahead.\n\nMatthew Boss -- J.P. Morgan -- Analyst\n\nGreat. Thanks. So, Joey, could you speak to any changes in consumer demand that you saw by region as the third quarter progressed? And on the projection for flat revenues at the midpoint for the fourth quarter, could you speak to the choppier trends that you cited? Maybe elaborate on the opportunity for improvement in the back half of the quarter? And then just, Mike, is there a time line you see as reasonable for a return to the medium-term revenue target?\n\nMike Bufano -- Chief Financial Officer\n\nSo I guess we're in the first one in terms of the distribution of kind of trends across geographies. As Q3 progressed into Q4, there was -- I think we called it pretty clearly in our European market, and that has that has gone about as we expected. I think that consumers are increasingly pressured by the kind of the inflation that they're seeing, particularly on energy prices. That could continue through the holidays.\n\nSo that's reasonably consistent with what we said with one of the notable bright spots coming in the U.K., as we mentioned earlier in the call. China was a different story, and that was really underpinned by rolling COVID lockdowns that seemed to persist the longest than anywhere in the world. We've seen that lighten up already. Early indications there show some green shoots in terms of the consumer reaction on their big festival on 11/11, so good start to that have been fully eclipsed yet.\n\nSo it's a little early to call there. And then in the U.S., I think as we said earlier in that call -- in the last call, we were starting to see some pullback on consumer demand, which is probably addressed our outlook for the year. And I would say that has largely continued into this period. Our expectation, if you look at kind of the 2-year stack that it's reasonably consistent.\n\nBut right now, if you look at where the consumer is at, I think when you look at the situation in the industry last year with a lot of companies reporting that they couldn't get the supply into the mix that they were looking for versus this year where there's a lot of inventory outstanding, things are going to look a little bit different in the trends. And so we are expecting that consumers are going to be a little bit more backloaded than they were last year in their spending and are lining up all of our marketing and product flow to meet that moment. And then on your question on the medium-term targets, Matt, if you look at the business this year, excluding the impact of FX, to the upper end of the range 17% really just a hair below the 20%, the lower end of the medium-term target range, which given in inflation, a war, COVID lockdowns in our second biggest fast-drying country. We feel pretty good about the revenue outcome we're driving toward in '22, and we'll talk a little bit more about '23, like I said earlier on the next call, and some of the drivers we have in place to move the business forward.\n\nMatthew Boss -- J.P. Morgan -- Analyst\n\nGreat color. Best of luck.\n\nOperator\n\nThank you for your question. Our next question comes from Ashley Helgans with Jefferies. Please go ahead.\n\nBlake Anderson -- Jefferies -- Analyst\n\nAll right. It's Blake on for Ashley. Just wanted to ask a little bit more on the U.S. consumer expectation in Q4.\n\nI know you said you've seen some slowdown there. I believe you also said you expect some improvement versus the quarter-to-date based on holiday strategy. Just wanted to make sure I heard that correctly. And kind of what gives you more confidence in the holiday period.\n\nAnd if you could just give a little bit more color on the consumer expectations there for the U.S. in Q4.\n\nMike Bufano -- Chief Financial Officer\n\nYeah, Blake. Happy to do it. So in terms of how the reason we have the confidence for the balance of the quarter, really, again, to reiterate, this is the best holiday marketing calendar, best execution actually of our creative the holiday by far, I think a few folks on this call actually sent us one email that launched last week and the way the execution has kind of shown up in people's inboxes and driving activity. And that's back with a really strong product pipeline as well right now during the holiday season.\n\nAnd then in addition, like Joey and I have both referenced and we know we have to meet consumers where they are, be a little bit more promotional right now for a brand that historically haven't done a lot of that. We typically see a nice response from customers when we do that. So that's why we have confidence in getting there. In terms of adding more on what we're seeing in the U.S.\n\nconsumer, again, Joey and I have covered it a little bit in the call. Our sense of it is the recession here are really hanging over folks right now. The inflation impact is real. The fluctuations in gas prices are real for people right now.\n\nAnd our read of it is people are waiting until a little bit closer to the holiday, things get a little bit more promotional. They're buying a little closer to need or last year, there's a lot of pent-up demand, a lot of pent-up personal balance sheets. And that's why we really feel like it was important for us to put our best foot forward with everything we're doing on the marketing product and promotional side through the holiday.\n\nBlake Anderson -- Jefferies -- Analyst\n\nThat makes a lot of sense. And then I wanted to ask on the store strategy. It sounds like that's still making great progress, adding more stores I know you mentioned that you haven't seen some of those older stores make a full traffic recovery. Just wanted to touch base there because obviously, e-comm has grown so much, and now you're shifting into wholesale -- so really, how big is the deal is it if you don't get that full traffic recovery? Do you feel like maybe there is some leeway there given the growth in wholesale and direct to consumer?\n\nMike Bufano -- Chief Financial Officer\n\nYeah. I think Joey and I will tag team this one. I think there's kind of a number side of that and the strategy side of that a little bit, so I'll take a little bit of the number. To your question on getting back to the pre-COVID levels and how important is that, I mean, those stores are best-in-class productivity.\n\nLike pre-COVID. I mean, the kind of like per square footprint activity, anybody would want. So of course, we'd love to get back to those levels, and that would be fantastic if we get there. But again, we feel pretty good overall about the role the stores are playing and even to those stores that were pre-'19.\n\nWhere at the sales levels they are now are very strong sales and profitability levels pretty good about that part of it. Joey, do you maybe want to comment a little bit more on the part of the question around how we think about this mix of digital, owned retail and third-party coming together?\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nYeah. I think all of this needs to be thought of as a system. And it's our -- we're building a very smart marketplace with distribution to fuel what is increasingly a fantastic product engine to deliver products that customers are going to really want. So as we add incremental doors in our third party as an example, we really do expect that to drive great awareness for the brand.\n\nThey may transact with that retailer. They may also just learn about the brand and come back to our direct channel. But we expect, even if they're buying in our retail partners' four walls, that is going to translate to great what we would consider new customer acquisition inside of our direct channel. And that's going to buoy not just our digital but also our physical doors.\n\nSo all of this is how we expect this to work going forward. And that's fairly similar with how we think about our physical stores and their interaction with our digital channel and our own direct channel. So all of this really needs to work hand in glove. And so far, so good, and that's why we're taking a methodical approach to building the marketplace as we have.\n\nBlake Anderson -- Jefferies -- Analyst\n\nThat's great. Thank you very much.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Alex Gratton with Morgan Stanley. Please go ahead.\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nGreat. Thanks so much for taking my question. I just wanted to talk about that end-of-life inventory that you're adjusting numbers for. Is the majority of that apparel? Or is there any other part of the composition that we should be aware of? And then I was just wondering, do you still have more access to clear there and when you expect to kind of be done with clearing that?\n\nMike Bufano -- Chief Financial Officer\n\nHi, Alex. Yeah, the majority of it, overall majority is apparel. Of the $127 million we have on the balance sheet right now, about $5 million of added stuff that we're still clearing through First time we've done something like this. We're pleased with the progress the team has made so far.\n\nI don't know if I can give you an exact end date, whether that all happened in Q4, some might bleed in Q1, maybe in Q2 next year. It's an interesting marketplace out there to be doing this in. But we're really making good progress on that and happy with what we've seen thus far.\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nGreat. OK. That's super helpful. Maybe one quick follow-up is just it's encouraging to hear that you guys are expanding your wholesale partnerships.\n\nI was just wondering if you could give us some color kind of on how you select those partners and what you're looking for as you assess which ones are the right ones to enter.\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nYeah. I mean, thanks for the question. We do believe that taking a pretty concentrated approach with very good partners on the premium end of retail distribution for our category is the right move, particularly as we start here. And we've really chosen one marquee partner in, I would call it, four, maybe five different channels.\n\nwe're trying to show up in a very premium way with a brand expression that is unique and we think resonant with that consumer. And we're also trying to keep it narrow enough on the number of partners that we take on that we can really differentiate with our assortment across those medium having still a reasonably lean assortment relative to the rest of our industry and some of our competitors. We think that's a pretty important and smart approach to concentrate that. So a couple of key partners focused on a great brand expression, focus on driving great sell-through and great margins for our partners, and then allow that sell-through to indicate strong sell-in the future season.\n\nSo that's the kind of -- that's the build that we're taking, and we're certainly happy to update a little bit more as we round Q4 and get into next year conversation.\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from Dylan Carden with William Blair. Please go ahead.\n\nDylan Carden -- William Blair -- Analyst\n\nThanks a lot. Just curious, I think some of the focus here on stores has to do the fact you've come sort of a long way quickly. And if you're not kind of seeing that volume return from prepayment levels and you're pulling forward some openings this year. I guess, what guardrails do you kind of have in place? And is the cadence that you've seen this year, something that you expect to kind of carry into next year? if the environment remains choppy and particularly with wholesale expanding your reach and awareness, does that change some of the calculations you're making around kind of the extent of the retail expansion?\n\nMike Bufano -- Chief Financial Officer\n\nYeah. Thanks for the question. So as we mentioned, half are still in the ramp-up phase. So obviously, not fully clear on how quickly those get the revenue maturity, and we've noted that given the depressed traffic that we're seeing across the industry, it's just still a little bit of uncertainty there.\n\nSo we certainly are -- and again, we're not going to give anything super specific in terms of guidance for next year now. But what we can say is and alluded to in earlier part of the call, we are taking not just into account top line, but we're really focused on the profitability of the channel to drive the right mix. And we're thinking about capital efficiency in an era of greater uncertainty with where the consumer is at. All of this channel mix is going to be something that we're taking into important consideration.\n\nAnd maybe I'll just end in saying, pre-COVID levels, I will say, were very exceptional for the industry. They were kind of at levels that, frankly, were tough for us to even handle inside of the store footprint that we had. So that's just one thing to consider when thinking about pre-COVID versus today, particularly when we have infill in some of those markets with other stores that take a little bit of the heat off some of those original ones. So it's just another thing to keep in mind as we think about apples-to-apples, given the nascency of the overall fleet.\n\nDylan Carden -- William Blair -- Analyst\n\nFair enough. And I guess it's a related question. The marketing leverage you saw was nice in the quarter. Is that a sales mix predominantly? Or is there anything else to add there as far as how sustainable that is?\n\nMike Bufano -- Chief Financial Officer\n\nYes. It's mostly sales mix and a little bit the efficiency on the digital side, Alan. So there's nothing really else notable there.\n\nDylan Carden -- William Blair -- Analyst\n\nGot it. All right. Thanks a lot.\n\nOperator\n\nI am showing no further questions at this time. I'd now like to turn it back to Joey for closing remarks.\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nGuys, thanks very much for tuning in. We're proud of the team's efforts given how choppy the environment has been, and I just want to say thank you to all the flock here at Allbirds. Thank, all, for tuning in, and we look forward to giving you another update at the end of the year.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKatina Metzidakis -- Vice President, Investor Relations and Business Development\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nTim Brown -- Co-Founder and Co-Chief Executive Officer\n\nMike Bufano -- Chief Financial Officer\n\nUnknown speaker\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nBob Drbul -- Guggenheim Securities -- Analyst\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nMatthew Boss -- J.P. Morgan -- Analyst\n\nBlake Anderson -- Jefferies -- Analyst\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nDylan Carden -- William Blair -- Analyst\n\nMore BIRD analysis\n\nAll earnings call transcripts"
}