{
  "companyName": "Chicos FAS",
  "companyTicker": "CHS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/31/chicos-fas-chs-q2-2022-earnings-call-transcript/",
  "content": "Chicos FAS (CHS 2.29%)\nQ2 2022 Earnings Call\nAug 31, 2022, 8:00 a.m. ET\n\nOperator\n\nWelcome to the Chico's FAS second quarter 2022 earnings conference call and webcast. [Operator instructions] I would now like to turn the conference over to corporate controller, David Oliver. Please go ahead.\n\nDavid Oliver -- Corporate Controller\n\nGood morning, and welcome to the Chico's FAS second quarter 2022 conference call and webcast. For reference, our earnings release can be found on our website at www.chicosfas.com under press releases on the investor relations page. Today's comments will include forward-looking statements regarding our current expectations, assumptions, plans, estimates, judgments, and projections about our business and our industry, which speak only as of today's date. You should not unduly rely on these statements.\n\nImportant factors that could cause actual results or invest to differ materially from those projected or implied by our forward-looking statements are included in today's earnings release or SEC filings and the comments made on this call. We disclaim any obligation to update or revise any information discussed on this call, except as may be otherwise required by law. Certain non-GAAP measures may be referenced in today's call. A GAAP to non-GAAP reconciliation schedule is included in our earnings presentation posted this morning on the Chico's FAS investor relations page.\n\nNow, I'll turn the call over to our CEO and president, Molly Langenstein.\n\nMolly Langenstein -- President and Chief Executive Officer\n\nThank you, David, and good morning, everyone. Our strong momentum continues with comparable sales up 19.5% to last year and 17.4% to 2019. We posted another quarter of outstanding operating income in our highest-ever second quarter EPS, driven by both digital and store sales growth and meaningful year-over-year gross margin rate expansion. Our consistent performance is evidence of the power of our portfolio and the successful implementation of our strategic pillars.\n\nSix months into our three-year strategic plan, we are pleased with the considerable progress to date and remain confident in our ability to achieve our long-term goals. Our power of three brands and strategic pillars have proven resilient in this environment. We remain focused on delivering over 2.5 million in sales by 2024. Let me cover some highlights of the second quarter.\n\nWe generated exceptionally strong bottom-line results with diluted EPS of $0.34, which was 62% over last year. This performance was driven by comparable sales growth of nearly 20%, combined with significant gross margin expansion. Consistent newness, innovation, and product enhancement drove strong digital and store sales growth and allowed for greater full-price selling and higher AUR. In fact, full-price sales were 35% greater than last year and nearly 60% higher than 2019.\n\nWhite House Black Market continued to deliver exceptional sales results with comparable sales growth of 32%. White House Black Market customers responded to our versatile dressing, seasonal fabric, and product innovation to meet for work-from-anywhere needs and return-to-occasion where. Compared to the second quarter of 2019, White House Black Market delivered comparable sales gains of 25% and generated higher AUR and more full-price sales. Chico's continued to deliver exceptional sales results with comparable sales growth of 30%.\n\nChico's customers return to traveling and entertaining and responded to our higher-quality product and fashion newness, building our outfit with solution-oriented products. Compared to the second quarter of 2019, Chico's delivered a comparable sales gain of 11% and also generated higher AUR and more full-price sales. While Soma posted a second quarter 9% decrease in comparable sales versus last year's second quarter, driven largely by the slowdown in loungewear clothing categories, Soma's comparable sales grew 24% compared to the second quarter of fiscal 2019, demonstrating the overall strength and long-term power of the brand. Inventories are well-controlled, and AUR was up to last year and 2019.\n\nSoma continues on its innovative and solutions-based path, and we believe we are competitively positioned to continue to capture market share over time. We've successfully opened three new stand-alone SOMA stores during the second quarter with plans to open over 20 additional stores this fiscal year. We continue to elevate our marketing, allocating targeted resources to digital and driving more traffic and customers to our brand. Total year-over-year customer count rose mid-single digits.\n\nSpend per customer is up over last year's second quarter, and the average age of new customers is continuing to trend younger. Second quarter gross margin rate rose to 41.4%, exceeding last year's second quarter by 300 basis points and 2019 by 820 basis points. This improvement was driven by higher average unit retail and full-price sales, combined with occupancy and freight leverage, offset by elevated raw material cost. Our nearly 20% sales growth and 300-basis-point margin expansion delivered an operating margin of more than 10%, well-above last year's second quarter operating margin of 7.5%.\n\nOur four clearly defined strategic pillars of being customer-led, product-obsessed, digital-first, and operationally excellent continue to guide us to deliver on our three-year strategic plan. Let me update you on each of these pillars. We are customer-led, focused on community engagement and creating extraordinary and memorable customer experiences, forming lasting relationships and increasing customer lifetime value. The power of our three unique brand is fueling growth through three powerful platforms, creating connections and enabling our customer to interact with us in a seamless manner.\n\nOur physical stores are community centers for brand introduction, customer celebrations, and key interactions with our stylists and bra experts. Digital is a community hub for content, a first impression of our brand, and an efficient way to teach and inspire. And our social brand ambassadors can expertly connect the two. Chico's FAS has a uniquely strong foundation with some of the most loyal and dedicated customers in retail.\n\nOur newly launched loyalty programs are exceeding expectations and customer sentiment and redemption rates, and they are increasing shopper frequency. We are strengthening our already-strong customer relationship and adding new customers through these elevated loyalty programs. And we are product-obsessed, continually delivering innovative and best-in-class goods in each of our brands that offer our customers beautiful solutions and inspire confidence and joy. At each brand, we are focused on elevating AUR and driving full-price sales growth.\n\nAt Chico's, style, fit, comfort, and solution are our homework. And these are driving our revenue increases. Customers responded enthusiastically to our product innovation and elevated fashion, including dresses, pants and denim, woven shirts, and our Zenergy and Travelers collection. At White House Black Market, versatile dressing with feminine details and seasonal fabrics drove the business in key categories.\n\nWhether she was looking for power pieces or outfits for special occasions, or just relaxing on the weekend. Customers responded to dresses, jackets, woven, pants, and premium denim. At both Chico's and White House Black Market customers bought coordinating outfits and accessories instead of single items, which increased AUR and basket size. At both apparel brands, nearly every category grew significantly over last year, demonstrating that product enhancements and innovation are moving the entire brand forward and that customers appreciate our elevated quality and are receptive to paying for value.\n\nSoma continues to make investments in cutting-edge product innovation, including our new Bodify demi, which successfully launched in the quarter, as well as newness in strapless and push-up bras and solutions in panties. We are chasing the categories customers are overwhelmingly responding to, and we are well-positioned with replenishment inventory to drive growth. We are digital-first, leveraging technology to engage and deliver to our customers across channels and brands. Digital sales grew by double digits for the quarter, outpacing store sales, which were also strong.\n\nWe are focused on growing multi-channel customers, as evidenced by our 9% total customer count growth and 17% increase in spend during the trailing 12 month. Each digital touchpoint inspires the customer to find solutions and deliver wardrobe across brands. And we are driving frequency of visits by adding new features like our limited edition online capsule collections. Our customized branded digital styling tools, like StyleConnect and MyCloset, continue to drive sales and engagement is growing.\n\nOur mobile apps are exceeding our expectations, with downloads and engagement growing month over month and driving higher average order value and conversion. Sales generated from the app are over 25% higher than the site average, and conversion is more than 10 times the site average. Our apps are being designed to become the key hub for our new loyalty program. Combined, digital tools grew over 40% over last year's second quarter.\n\nAll of these actions further nurture and grow a multi-channel customer who is so valuable to us, spending more than three-time single-channel customers and fueling overall digital growth. We are thrilled that Leana Les will be joining Chico's FAS next month as SVP of marketing. Leana not only has valuable agency experience but has held key roles at Coca-Cola, Estee Lauder's Aveda. With her 27 years of experience, she is a data-driven marketing expert with deep understanding of performance marketing, digital and e-commerce personalization, CRM, and loyalty programs which will help us drive top-line growth.\n\nAnd last, we are operationally excellent, continually focused on prudently managing our inventory cost of sale, supply chain expenses, and real estate, generating healthy cash flow and delivering a strong bottom line. During the quarter, we had exceptional gross margin performance, driven by strength in full price sales, higher AURs, and improved leverage and inbound freight and occupancy costs despite increases in raw materials. We are focusing on constantly improving our sourcing, logistics, and operational processes to help drive efficiencies and lower costs. We have carefully managed our calendar and inventory flow to assure product will be available to our customers in a timely manner.\n\nWe have also prudently controlled our mix of ocean versus air freight compared to last year, with air costs for the second quarter approximately 85% less than last year, reducing overall freight costs by approximately 50%. The benefit of which will be realized as we sell the goods into the back half of the year. Now, let me turn the call over to PJ to update you on our financial performance. PJ?\n\nPJ Guido -- Chief Financial Officer\n\nThank you, Molly, and good morning, everyone. Our second quarter performance further demonstrates the power of our diverse portfolio and our ability to execute our strategic growth plan. We posted diluted EPS of $0.34 for the quarter, driven by strong sales growth and gross margin expansion. This EPS performance was 62% over last year's second quarter and the company's highest-ever second quarter earnings per share.\n\nSecond quarter sales of 559 million increased 18% over last year and nearly 10% over 2019. Comparable sales for the quarter increased nearly 20%, driven by greater year-over-year breadth and depth of product, combined with enhanced marketing efforts that drove full-price selling. Although both channels continue to see strong traffic and sales growth throughout the quarter, the digital business outpaced store sales. Looking at the apparel brands, comparable sales were strong.\n\nWhite House Black Market was 32%, and Chico's increased 30%. Relative to 2019, White House Black Market grew 25%, and Chico's rose over 11%. For the quarter, Soma's comparable sales declined by 9% from last year's second quarter but, relative to 2019, were up nearly 24%. Second quarter gross margin was 41.4% compared to 38.4% last year.\n\nThe 300 basis point improvement primarily reflected higher average unit retail, combined with moderating freight costs and occupancy leverage, which more than offset elevated raw material costs. SG&A expenses for the quarter totaled 173 million or 31% of sales, just slightly higher than last year's second quarter of 30.9%, reflecting higher marketing investments to drive customer growth, as well as elevated labor costs, partially offset by ongoing expense management. For the quarter, we generated 58 million of operating income, an increase of more than 60% over last year. Our higher sales and gross margin expansion produced an operating margin of over 10%, well-above last year's margin of 7.5 percent, clear evidence of the strength of our powerful portfolio and business model, which focuses equally on sales, earnings growth, and cash flow.\n\nEBITDA for the quarter was close to 70 million and, for the first half, was over 125 million, which was higher than what we generated for the full fiscal year of 2021. Now, let's turn to our balance sheet and overall financial strength. Our cash position, total liquidity, and operating cash flow remain very strong, providing us with the flexibility to manage the business and make investments to further propel our growth. We ended the second quarter with cash of 173 million and total liquidity of 331 million, inclusive of capacity on our credit facility.\n\nAt the end of the second quarter, total inventories were 339 million compared to 202 million at the end of last year's second quarter. Adjusted for in-transit and early deliveries, total on-hand or customer-facing inventory was up approximately 25%, more in line with total sales growth. On this basis, inventories were down 2% compared to 2019 levels. Through the end of the quarter, we expect inventory levels to remain above last year and ahead of demand as we flow products early to guard against potential supply chain disruptions.\n\nThis is a strategic decision and one that has served us well this entire year. As we move into the fourth quarter, we are confident in our assortments and our ability to maintain healthy full-price sales and expect to end 2022 with lower inventory levels than last year. As a result, we do not anticipate any material markdown or margin risk in the back half of this year and believe inventories are appropriately assorted and positioned relative to our sales plan. Now, let me give some color on our outlook for the third quarter and full year of 2022.\n\nWe remain on track for strong top line-growth for both the third quarter and the full year. Traffic levels in both our stores and digital channels remain strong, and the breadth and depth of our assortments are supporting higher conversion as well. In short, both loyal and new customers are showing up for us, and we are showing up for them by delivering the product, service, and overall experience that are on point with their lifestyles and expectations. We are confident in our ability to sustain healthy gross margins through full price selling, product mix, occupancy leverage, and supply chain cost management and believe we are well down the path to reach our annual margin target of 40% by 2024.\n\nRegarding expenses, we are forecasting continued pressure on CMA due to inflation, particularly related to store labor. However, we remain highly focused on maintaining profitability and have the ability to flex our cost structure in response to shifts in performance for the underlying environment. Our investments in store labor, our biggest expense bucket, are supporting higher sales and customer growth. Also, given our strong performance in cash flow, we are continuing to make capital investments that will fuel traffic and conversion, as well as customer growth and retention across all three channels.\n\nOur planned capital expenditures for fiscal 2022 are still expected to total between 65 million to 70 million, to build out our digital and marketing platforms, as well as invest in new summer stores and upgrades to our existing fleet of Chico's stores. On the digital side, we have entered into strategic technology partnerships to build out our connected commerce platform, which will offer customers a seamless, personalized integration of in-person and digital experiences and. With regard to stores, we continue to actively manage our portfolio to enhance overall store and company profitability and view our current real estate footprint as a competitive advantage, given our prime locations across the U.S. We opened three stand-alone Soma stores during the quarter and planned to open over 20 more during the balance of the year.\n\nIn addition, we will have renovated 37 of our most productive Chico's boutiques by year-end. And due to the continued improving productivity and profitability of our store base, we are now estimating approximately 30 store closures this year, down from our original target of up to 40. I would also highlight that our cash flow and EBITDA base is growing every quarter, and we expect our financial position to strengthen from here. In addition to allowing us to fund strategic investments, strong cash flow will allow us to navigate an uncertain environment that has presented a host of challenges for all retailers.\n\nSo, with that, for the third quarter and full year 2022, we are revising our outlook upward. For the third quarter, we now expect total sales of 495 million to 510 million, gross margin rate as a percent of sales to be in the 38.9% to 39.4% range, SG&A rate as a percent of sale to be in the 34.4% to 34.8% range, and effective tax rate of approximately 25% and diluted EPS of $0.11 to $0.14. For the full year, we now expect total sales of 2.14 billion to 2.17 billion, gross margin rate as a percent of sales to be in the 38.8% to 39.1% range, SG&A rate as a percent of sales to be in the 32.2% to 32.5% range, and effective tax rate of approximately 25% and Diluted EPS of $0.79 to $0.87. In closing, we are well-positioned to fuel our existing momentum and remain confident in our three-year strategic plan and our ability to create shareholder value now and over the long term.\n\nWe look forward to keeping you posted on our progress. Now, I'll turn the call back over to the operator. Operator?\n\nOperator\n\n[Operator instructions] And today's first question comes from Dana Telsey at Telsey Group. Please go ahead.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGood morning, and congratulations on the beat-and-raise, a real differentiator in this earnings season. As you think about the Soma business, which obviously is tied into cozy and lounge, how are you planning that going forward? What do you expect there? Secondly, the freight reduction is impressive. How do you see that moving through the back half of the year? And then it is interesting on digital versus stores. What differences are you seeing with the growth in digital outpacing stores? Is it more customers? Is it a higher average spend? And does it differ by brand? Thank you.\n\nMolly Langenstein -- President and Chief Executive Officer\n\nDana, good morning, and thank you so much for supporting our business. We are and remain confident in our ability to connect product and the customer and deliver our outlook for the year evidenced by Q2 but, also, what we are seeing in August. As it relates to Soma and the 9% decrease that we experienced in the quarter, one other thing to note is that according to NPD, we still continue to outpace the market in nonsport bras and panties for the trailing 12 months. So, we remain confident in our innovative and solutions-based path.\n\nWe believe we are competitively positioned to continue to capture market share over time. We also continue to make investments in cutting edge-product innovations, including our new Bodify demi launch, which we successfully launched in the quarter. We're seeing newness in strapless and push-up bras and solutions in panties. So, we are chasing these categories, and customers are overwhelmingly responding to.\n\nAnd we are well-positioned with replenishment inventory to drive growth. So, we believe this is a point in time. And that staying close and listening to our customer will continue to propel the brand forward. And we remain on track with our growth trajectory in the SOMA brand.\n\nPJ, you want to take freight?\n\nPJ Guido -- Chief Financial Officer\n\nSure. Hey, Dana. And on the freight in the back half, you know, our decision to move our calendar up by 10 weeks back in 2020 is now paying off. We are using far less airfreight, which, as you know, is much more costly than ocean.\n\nWe started to see a big benefit in Q1, and that has continued into Q2. In fact, it's offset most of our higher raw material costs. We do expect airfreight usage or overall supply airfreight costs and freight costs as a whole to be lower in the back half. And we do expect a tailwind.\n\nThere that is reflected in our guidance.\n\nMolly Langenstein -- President and Chief Executive Officer\n\nAnd, Dana, I'll take digital versus stores. We remain very pleased with our digital tools and the ability for all of these tools to work together, including MyCloset, StyleConnect, our app launch, and our also new launched loyalty program. And all of these things working together are driving engagement, frequency, and AOB. And all of those tools are up 40%.\n\nWhat we're seeing in particular is our focus on being able to grow the multi-channel customer, and that has been strategic. And what we saw this past quarter is that our customer crown accounts for multichannel customers grew by 9%. And that spend per customer for the omnichannel customer grew by 17%. And that customer is three times more valuable to us than a single-channel customer.\n\nBut also the single-channel customer spend overall was up 12% year over year. So, we are experiencing higher frequency and bigger basket and AUR, which is driving both channels but also really helping us continue to outpace our growth in digital.\n\nOperator\n\n[Operator instructions] Today's next question comes from Marni Shapiro with The Retail Tracker. Please go ahead.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nHey, guys. Congratulations. The stores look absolutely beautiful. Can you talk to -- can you just clarify one thing? I think you said you were going to close 30 stores.\n\nWas that for the rest of the year? Is that for the full year? I just want to confirm that I heard that right.\n\nPJ Guido -- Chief Financial Officer\n\nHi, Marni, it's PJ. It's 30 stores for the full year.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nOK, fantastic. That's a nice reduction. So, along those lines, I know you're not aggressive store openers. But are you seeing still very good rent reductions and the ability to relocate stores where you want them to be and things like that just further rightsize the fleet?\n\nPJ Guido -- Chief Financial Officer\n\nWell, Marni, the competition for premium mall space is actually getting higher. So, we're not necessarily seeing rent reductions. What we are seeing is store productivity pick-up to leverage those rents. So, it's less about store rent and more about store productivity.\n\nMolly Langenstein -- President and Chief Executive Officer\n\nAna, Marni, just to add to that, we've had -- we've been strategic with the planning and allocation teams on the merchandising team. We have rigorous strategies put in place on how to specifically grow by store type and by region and category each one of the store's productivity. So, that a target of ours to hit while we are growing digital that we want to grow our productivity per foot in our stores in the remaining stores in our fleet.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nThat's great. And then can we just touch on the wage? Because I know wage pressure has been a conversation for a little while. But your store associates are not like regular store associates. They're just at a totally different level.\n\nAnd so, I guess how do you think about going forward, you know, keeping them so that other people don't steal them from you? And what's your balance look like compared to, say, your average specialty retailer of full time versus part time?\n\nMolly Langenstein -- President and Chief Executive Officer\n\nThank you, Marni. We couldn't do what we do without our store associates, so thank you for recognizing that. And our store associates are loyal to our brands, and we enjoy some of the, you know, longevity with associates. And we also leverage our store culture and our community to be able to really manage that full-time, part-time ratio.\n\nIt really varies by market. We have a lot of associates that really like to work four days a week. And our customers know the day that their person works. And there is a community there that is so incredibly important.\n\nSo, we try and make sure that, in our full-time, part-time mix that we are allowing for the associate to help us guide what they want to do, which really has allowed us to really keep our turnover down and at a minimum. And actually, we are looking at 19 levels, nothing really about the great resignation we've experienced in stores which we find to be fantastic. And, you know, that, really, I attribute to the leadership in the stores organization and being able to keep people happy. And really, it's about that community and staying close to them.\n\nWe just redid in the first quarter a pretty big realignment in stores to make sure actually that we put more coverage from a leadership standpoint. That's something the stores overwhelmingly told us they missed during COVID, that they wanted to see their leaders. They get inspired when they do store visits and learn more about them. Now, the coverage for it for the brand is over the three brands.\n\nSo, if you go into a center now, that is one district sales manager, where, in the past, that used to be three. So, we're really actually taking the community up another notch because it's not just the Chico's community, but now it's now the center community. And that's also helping us to be able to fill hours, being able to manipulate individuals between the two, between each one of the boxes if we do have needs. Right now, today, we are staffed at a little more than 96% of our stores.\n\nAnd we have a plan to walk into the fourth quarter fully staffed and making sure that we can take care of customers appropriately.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nDid you just -- so you had somebody out sick in Soma, somebody at Chico's or White House presumably in that region is trained well enough to just hop in to Soma and pitch it for the day. Is that what you're saying?\n\nMolly Langenstein -- President and Chief Executive Officer\n\nThat's correct. We've actually educated our White House Black Market and our Chico's associates on that 360 profit and been able to make sure that we can have coverage. So, that is working for us. And actually, it's also helping us to be able to introduce the brand to customers.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nThat's it for me. I'll take the rest offline. Congratulations. Best of luck for the fall season, guys.\n\nMolly Langenstein -- President and Chief Executive Officer\n\nThanks, Marni.\n\nPJ Guido -- Chief Financial Officer\n\nThanks, Marni.\n\nOperator\n\nAnd, ladies and gentlemen, this concludes our question-and-answer session. I'd like to turn the conference back over to Molly Langenstein for closing remarks.\n\nMolly Langenstein -- President and Chief Executive Officer\n\nThank you. In closing, I want to summarize, we are extraordinarily confident in the momentum of our business and our ability to deliver our outlook. Digital and store sales grew for the quarter. Full time sales were 60% greater than 2019.\n\nWe delivered higher AUR, traffic, and conversion. And customers are overwhelmingly responding to our product differentiation. Thank you for your interest in Chico's FAS. We look forward to speaking with you again during our third quarter call.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDavid Oliver -- Corporate Controller\n\nMolly Langenstein -- President and Chief Executive Officer\n\nPJ Guido -- Chief Financial Officer\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nMore CHS analysis\n\nAll earnings call transcripts"
}