{
  "companyName": "Motorcar Parts of America",
  "companyTicker": "MPAA",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/motorcar-parts-of-america-mpaa-q1-2023-earnings-ca/",
  "content": "Motorcar Parts of America (MPAA 0.17%)\nQ1 2023 Earnings Call\nAug 09, 2022, 1:00 p.m. ET\n\nOperator\n\nHello. My name is Chris, and I'll be your conference operator today. At this time, I'd like to welcome everyone to the Motorcar Parts of America's fiscal 2023 first quarter conference call. [Operator instructions] Thank you.\n\nGary Maier, VP of investor relations and corporate communications, you may begin.\n\nGary Maier -- Vice President of Investor Relations and Corporate Communications\n\nThank you, Chris. Thanks, everyone, for joining today. Before we begin and I turn the call over to Selwyn Joffe, chairman, president, and chief executive officer; and David Lee, the company's chief financial officer, I'd like to remind everyone of the safe harbor statement included in today's press release. The Private Securities Litigation Reform Act of 1995 provides a safe harbor for certain forward-looking statements, including statements made during today's conference call.\n\nSuch forward-looking statements are based on the company's current expectations and beliefs concerning future developments and their potential effects on the company. There can be no assurance that future developments affecting the company will be those anticipated by Motorcar Parts of America. Actual results may differ from those projected in these forward-looking statements. These forward-looking statements involve significant risks and uncertainties, some of which are beyond the control of the company and are subject to change based upon various factors.\n\nIn particular, expectations about anticipated future growth and opportunities with customers may not be achieved. The company undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. For a more detailed discussion of the ongoing risks and uncertainties of the company's business, I refer you to the company's various filings with the Securities and Exchange Commission. With that said, I'd like to begin the call and turn it over to Selwyn Joffe.\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nThank you, Gary. I appreciate everyone joining us today. I hope you're all safe and healthy. As announced this morning, our new fiscal year is off to an excellent start with sales climbing 10% on a year-over-year basis, reaching record levels, supported by continued strong demand for non-discretionary products across our North American customer base.\n\nLet me highlight several items that support our optimism as fiscal 2023 evolves. Our brake pad line utilizing an industry-leading proprietary formulation is rolling out as planned, as are our brake rotors. Our brake calf operation continues to gain momentum with expected operating efficiency improvements as volume increases with fixed cost absorption opportunities. We are targeting our brake-related business to exceed $300 million in annual sales above our fiscal 2022 reported results in the next three to five years.\n\nWe are growing sales in Mexico with multiple product lines, including rotating electrical, wheel hubs and master cylinders. Major automotive retailers continue the rollout of our rotating electrical benchtop tester and we expect sales from this opportunity to reach a cumulative $80 million over the next five years. We also expect additional revenue for maintenance and add-on services. Our EV contract testing center in Detroit, Michigan continues to attract interest to support the design and development of electric vehicles.\n\nThis contract testing is an initial entry into SaaS, Software-as-a-Solution, model. We are excited about all of our multi-year new business commitments and expect these numerous opportunities to continue to fuel our growth. As I emphasized during our fiscal year-end call in June, we are well-positioned to address both the internal combustion engine market and the emerging market with product functionality and applications across both markets. Nonetheless, we expect strong demand for internal combustion engine application for decades and we offer a broad line of non-discretionary aftermarket parts necessary to service the internal combustion engine car population of approximately $280 million.\n\nAt the same time, our applications and services also offer significant opportunities to address the emerging electric vehicle market. Clearly, the electric vehicle market continues to gain momentum. So we will not only benefit from our non-discretionary product offerings but also from increasing demand for battery power emulation, testing and development of inverters, electric motors and high-speed battery charging applications offered by our electric vehicle subsidiary. As I highlighted earlier, our benchtop testers for alternated starters continue to roll out of more than 15,000 retail customer store locations.\n\nThese benchtop testers enable retailers to offer accurate advice with the latest protocols to diagnose problems for consumers and reduce unnecessary returns. This provides a value-added benefit for the retailer while strengthening their consumer relationships. Notwithstanding the continuing challenges facing the aftermarket industry and all businesses for that matter, during these unpredictable times, we are working diligently every day with our customers and suppliers to meet the demand for our products. Let me take a moment to summarize where we are today.\n\nOur strategic investments have been completed. We have further solidified our position in the industry with an expanded line of non-discretionary automotive aftermarket products, customer commitments and opportunities. Our global footprint is scalable, supported by approximately 6,000 global employees with vast experience to support growth and profitability. We believe our initiatives will fuel our growth to more than $1 billion in sales.\n\nI will now turn the call over to David to review our results in greater detail.\n\nDavid Lee -- Chief Financial Officer\n\nThank you, Selwyn, and good morning, everyone. I would like to encourage everyone to read the earnings press release filed as an 8-K earlier today, which contains more detailed explanations of our results. On this call today, I will review our fiscal first quarter results. As someone mentioned, we achieved record net sales for the fiscal first quarter, reaching $164 million, an increase of $15 million or 10% from $149 million for the prior year.\n\nGross profit for the fiscal '23 first quarter increased $6.7 million or 28.6% to $30.3 million from $23.6 million a year earlier. Gross profit for the quarter was impacted by non-cash items, as well as cash items. Let me provide details for each and then I'll provide further details on the impact on each additional line item that you can accurately understand the underlying fundamentals between periods and appreciate our optimism as the new fiscal year evolves. The non-cash items reflect core and finished premium amortization and revaluation of cores on customer shelves, which are unique to certain of our products and required by GAAP.\n\nThe total for these non-cash items in the quarter was approximately $3.6 million. A more detailed explanation of core accounting is available on our website and I would encourage anyone with questions about this topic to review the video. In terms of the cash items, let's begin with Malaysia. The shutdown of the country by the government due to COVID and then the slow reopening impacted our facility and our regional network of key suppliers.\n\nIn response, we quickly moved to outsource certain products in China but these products were unfortunately subject to 25% tariff. These transitory disruptions in the supply chain, as well as timing of shipments are being reduced as we ramp back up in Malaysia and our suppliers recover. As a reminder, one of the benefits of production in Malaysia is low tariffs. So a return to production at our facility in this country result is fairly immediate relief on tariff.\n\nNext, we incurred higher freight costs that were in excess of the customer freight surcharges that we already implemented. We have taken swift action to implement additional freight surcharges and further price increases to mitigate this impact going forward. These are expected to be further in effect in the fiscal second quarter ending September 30, 2022 and should offset more of the higher freight cost we incurred based on current rates. The total cash impact of these transitory costs, including freight and tariffs related to supply chain disruptions on gross profit, was $2.5 million compared with $4.8 million a year ago, as referenced in Exhibit 2 of this morning's earnings press release.\n\nSo in short, we are encouraged that these costs are decreasing. Before moving on, I should note that there were no ramp-up and transition expenses related to our Mexico expansion in this quarter compared with $1.9 million in the prior-year first quarter. We are pleased that brake caliper production is increasing nicely. Reported fiscal first quarter gross profit as a percentage of net sales was 18.5% compared with 15.8% a year earlier.\n\nReported gross margin was impacted by 2.2% from the previously mentioned non-cash items, as well as 1.6% on the previously mentioned cash items from transitory costs related to supply chain disruptions. We continue to experience extraordinary global supply chain challenges and inflationary costs. While our price increases were not fully in effect and we made strategic inventory investments to support business growth and mitigate supply chain challenges. In addition, gross profit, as you would expect, was further impacted by three key items.\n\nFirst, we experienced inflationary costs related to raw materials and supplies and offshore wage increases. The price increases that I mentioned a moment ago should help offset these price pressures. Second, we experienced ramp-up costs related to our growth initiatives for the new brake caliper product line. With price increases and the ramp-up of our new business opportunities, we expect enhanced gross margins.\n\nFinally, gross margin was impacted by product mix. Moving on. Operating expenses were $23 million compared with $17.8 million for the prior-year period. The increase was primarily due to a non-cash loss of $678,000 for the mark-to-market, foreign exchange impact of lease liabilities and forward contracts compared with a non-cash gain of $2.5 million for the prior-year first quarter.\n\nThe remaining $1.9 million increase was primarily due to increased commissions, employee-related expenses, professional fees, travel, outside service expenses and non-cash foreign currency fluctuations. We reported a net loss of $175,000 or $0.01 per share. A primary factor was due to higher interest expense, reflecting higher interest rates, which are being addressed by working with our customers, including price increases, and we are focused on generating cash flow to pay down borrowings. Additionally, results were impacted by items that totaled $6.9 million or $0.36 per share as follows: these include non-cash items totaling $4.2 million or $0.22 per share, including core and finished premium amortization and revaluation of cores and customer shelves totaling $3.6 million, as previously explained.\n\nNon-cash items also included a loss of $678,000 or $0.04 per share on a pre-tax basis for the foreign exchange impact of lease liabilities and forward contracts. Cash items that impacted results include transitory costs related to supply chain disruptions totaling $2.8 million or $0.15 per share. Additionally, results for the fiscal first quarter were also impacted by higher interest expenses, primarily due to higher interest rates compared with the prior year. Interest expense was $6.9 million compared with $3.9 million for last year, primarily due to higher interest rates on the accounts receivable discount programs offered by our customers and higher borrowings to support higher sales.\n\nAdditionally, income tax expense was $589,000 compared with $947,000 in the prior-year period. I should also mention that the effective tax rate was impacted in part due to specific foreign jurisdictions from which we do not expect to recognize the benefit of losses. However, we expect these losses will be utilized against future profits, which will benefit future tax rates. Net income was $861,000 or $0.04 per diluted share in the year-ago period.\n\nResults a year earlier were impacted by a total of $7.6 million or $0.39 per diluted share. These include non-cash items totaling $2 million or $0.10 per diluted share, including a non-cash gain of $2.5 million or $0.13 per diluted share on a pre-tax basis for the foreign exchange impact of lease liabilities and forward contracts and cash items totaling $5.6 million or $0.29 per diluted share, primarily transitory costs related to supply chain disruptions. EBITDA for the first quarter was $10.5 million. EBITDA was impacted by $5.5 million of non-cash items, as well as $3.7 million in cash items, primarily due to the transitory costs related to supply chain disruptions.\n\nEBITDA before the impact of non-cash and cash items mentioned above was $19.7 million for the first quarter. EBITDA for the prior-year first quarter was $8.9 million. EBITDA a year ago was impacted by $2.7 million of non-cash items, as well as $7.3 million of cash expenses, primarily transitory costs related to supply chain disruptions. EBITDA before the impact of non-cash and cash, as mentioned above, was $18.9 million for the prior-year first quarter.\n\nNow we will move on to cash flow and key corporate items. Net cash used in operating activities during the fiscal first quarter was $982,000 versus $4.7 million cash used in operating activities in the prior-year period. This reflects working capital requirements, support record sales growth and inventory increases for anticipated business growth, as well as proactive strategic initiatives to address potential supply chain disruptions. We believe that these investments in our business will not only mitigate risk, but will also spur further growth on the company on a year-over-year basis.\n\nWe do expect to generate cash from operating activities for fiscal '23. We expect to generate an increase in operating profit on a year-over-year basis, supported by organic growth from customer demand, introduction of new product categories, price increases and operating efficiencies from our footprint expansion that we completed last year. Our return on invested capital on a pre-tax basis at June 30, 2022 was 18.9% compared with 22.1% a year earlier. As our investments bear fruit, we expect to realize further benefit from the expansion of our Mexican operations and the launch of our new brake categories with expectations of increased returns from both new and existing product lines.\n\nAnd lastly, our net debt at the end of the quarter was approximately $152.6 million, while cash and availability on the revolving credit facility was approximately $95.5 million. For further explanation on the reconciliation of items that impacted results and non-GAAP financial measures, please refer to Exhibits 1 and 3 in this morning's earnings press release. I would now like to open the line for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question is from Brian Nagel with Oppenheimer. Your line is open.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nHi, good morning. I guess, I'm sorry about this. Good afternoon, morning, depending on where you are. So a couple of questions.\n\nFirst off, I guess, first, maybe bigger picture. Just with regard, you talked about the nice sales increase here in the fiscal Q1 and drivers behind that. But behind that, can you talk a lot about just what you're seeing from a consumer's perspective, particularly given a lot of the various factors out there play right now, whether it be gas prices or just discretionary spending broadly? And then, my second question, and David, you laid out a lot of the kind of the puts and takes with gross margin here in the quarter. I guess, the question I have is, how should we think about, and I recognize you don't really have long-term guidance out, but how should we think about the underlying margin potential of the business as some of these factors begin to normalize?\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nOK. So let me start out just with the demand side of the question. I think, the fundamentals of the aftermarket continued to be strong. I mean, the average age of vehicles is over 12 years.\n\nYes, gas prices have gone up but so alternative cost of travel, and so, we see a fundamental strength in the demand for non-discretionary parts and are sort of seeing that across the board in our product lines. I would say the miles driven is a little bit of a headwind but we continue to see growth despite that. I think that's reversing out. We are fairly comfortable.\n\nWe'll continue to see strength in sales. We are off to a strong start this quarter. So that looks good. And in addition to sort of the base organic growth that I see from the fundamental statistics within the aftermarket, we're also experiencing, I don't want to be too exuberant, but I'll call it significant success in our brake pad and rotor business.\n\nThe demand profile for that is turning out to be very, very strong. And as we ramp up through that, we expect, again, we mentioned that we think our brake product lines can reach $300 million and I think the speed depends on how fast we can ramp it and get changeovers done on customers' shelves. So very positive there. Our Mexico expansion is going well and we continue to grow that business.\n\nOur benchtop tester, we have all three retailers committing to roll out the benchtop tester in their stores and more interest from others. And so, that benchtop tester business, while it's taken us some time to get here, it looks like the thesis is unfolding as we expected but albeit a little bit longer than we thought it would take. And then, last but not least, I think there's some headwinds a little bit on the EV capital expenditure front where some of these OEs are not getting the supply that they want, so they're pulling back in some of the capex. But having said that, we see our base fundamentals in that business also perhaps strengthening and sort of the new direction they're focused on trying to drive revenues from software.\n\nSo all in all, for us, I think we have so many multiple drivers for our business, right now that we're bullish on our opportunity. And when you see more volume that goes through the volume that goes through our facilities, we've got an overhead structure designed to support this growth. And so, leveraging the existing overhead with incremental revenue will certainly contribute to better contributions on the gross margin side and on the operating income side. I think, short-term margin profile, we're looking in the mid to upper 20s as we get through that.\n\nWe are going to have to see what happens with inflation and how we keep up with that with the price increases. We continue to lag the market on price increases, just with the time delay of getting it through our customers but we are getting price increases and we are certainly eliminating any waste that we possibly can from our structure so that we can enhance the margins as we go forward.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nAppreciate the detail. Thank you.\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question is from Matt Koranda with ROTH Capital. Your line is open.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nThank you, guys. So maybe just, I guess, my traditional first question is, usually, could you provide a breakdown of revenue by product category, David, between rotating electrical wheel hub, brake and other products?\n\nDavid Lee -- Chief Financial Officer\n\nYes. So for the first quarter, rotating electrical was 67%, wheel hub, 12%; brake-related products, 17% and others was 4%.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nOK. Great. Thank you. And then, I think, in the release, you guys had said that demand had improved throughout the quarter, especially in the May and June time frame.\n\nCurious if you could maybe speak to the magnitude of that improvement? And then, just any commentary on sort of follow-through as we've gotten through July, August, obviously, a bit early here, but just any commentary or follow-through on that demand through July?\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nYeah, I don't know off the top of my head, the exact increases between the first months and the back month but it's double digits and it's continuing. I mean, we expect to have a strong quarter. Demand continues to be strong and that's fueled by organic demand and growth and then also by the rollout of our new brake pad and brake rotor business. And as the quarters progress, we expect the tester business to continue to increase.\n\nWe are starting to receive purchase orders from customers there and that's ramping up nicely. So a lot of growth drivers. I think, I've mentioned in the past, Matt, that price increases in September, October, we should see the majority of them through that and we should see the margin profile will get better as volume and price increases kick in.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nOK. Since you mentioned price, maybe just curious if you could maybe disentangle or help us understand how much price contributed to the 10% year-over-year growth in the quarter? And then, you did mention there's some incremental price action. It sounded like maybe even in addition to what you had talked about on the last call when you had mentioned higher factoring costs. And I'm curious if that was in reference to price action that is incremental to what we've already discussed on calls before or is that sort of just what's on to come from what you had mentioned on the last call?\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nI think, it's hard to break down the differential because the mix of products has changed so dramatically. I mean, the new product launch certainly contributed to the growth of the pads and the rotors. There is some price increases that contributed to the growth. But I still think that when I look at fundamental demand through the register continues to be strong.\n\nAnd can you repeat the second part of your question, Matt, I missed that. I'm sorry.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nYeah, sure. You had mentioned sort of in the prepared remarks that pricing action was either in place or in the process of being implemented to offset some of the increase in factoring costs that you guys are experiencing just with the higher rates. And I'm just curious if that was incremental price take that is over and above what we've discussed on prior calls?\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nYes, it is. So we definitely have product price increases that are staged to come in. And now, we're working through the factoring cost increases. So that's separate and above.\n\nYes.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nOK. Got it. Understood. And then, I didn't hear you guys discuss the outlook for fiscal '23 and maybe I missed it but are we just to take sort of the 1Q in line here with our expectations as sort of a reiteration of the full year fiscal '23 guidance for revenue and EBITDA, any changes to sort of the outlook from your standpoint?\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nNo. No changes. We still have the same outlook but we're feeling really positive about how things are developing.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nGreat. And then, just lastly, you mentioned a goal of $300 million between sort of the new brake products that you've launched over the next three to five years. Just curious if folks should be factoring in sort of a linear progression to that $300 million over the next, call it, four years or so, if I'm taking the midpoint of the goal? How does that sort of play out? And then, when we get to maturity in the brake products business, what does that look like in terms of mix between pads, rotors, calipers and other brake products?\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nOK. Let me try and do it one at a time. Linear is probably a good example. I mean, obviously, we're starting from zero.\n\nI think that as we go through this fiscal year to the next fiscal year, I mean, we should see that business grow by 100% in the next fiscal year, obviously, coming off a launch year. And then, sequentially after that, we expect double-digit growth in that business. So that's good. The mix, that's a tougher one to predict.\n\nI mean, today, we include brake calipers in the brake-related products, so that mix is we're pushing close to $100 million in that business as we get through our commitments with all of our new customers. And then, in rotors and pads, I think we're probably looking with existing commitments north of $50 million, $60 million just as a kickoff. And so, the breakdown going forward, eventually, and I'm not sure when this turns, but the pads and rotors will become the largest revenue generator out of the brake category. That's not to say that the rest of the brake category is not going to grow significantly, just the fact is that brakes and rotors, I mean, they're not a failure item, they're a replacement item, and so, you get a far more volume out of that.\n\nCertainly, the most exciting part of the rotor, pad equation for us is, we have a very unique proprietary formulation for our brake pads and it's being sold on their own brand name. And it's a proven formulation as well and a very recognized formulation by the professional installer. And so, as we get this product out, the traction and the ability to roll all of our other products out under the same brand names to customers that may not have tried our brands in the past is pretty significant. So we're bullish on, in particular, the pad business and rotors come along as sort of a mandatory match where you can match up your friction with your metal.\n\nAnd so, hard to tell you exactly what that mix is going to be but again, longer term, as you look out four to five years, the pads and rotors going to be the biggest part of it.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nGot it. Yeah, it sounds like, I'm paraphrasing caliper is probably a little further along in the growth phase, maybe not hitting maturity yet but more mature than the other two but rotors and pads probably eventually eclipsed the caliper opportunity over time?\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nYeah, the size of the category is so much larger as well. So just by definition, if we can get to our fair share in each of these categories, the pads and rotors should be very significant amount of revenue.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nAll right. Perfect. Got it. I'll try back in.\n\nThank you, guys.\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nThank you.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nOK. Thanks. Appreciate it.\n\nOperator\n\n[Operator instructions] The next question is from Bill Dezellem with Tieton Capital. Your line is open.\n\nBill Dezellem -- Tieton Capital -- Analyst\n\nThank you. I want to pick up on a comment in the release and someone else has already asked about that momentum building in May and June. Would you discuss in a little more detail why that momentum has been accelerating?\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nWell, I wish I know exactly, Bill. I couldn't tell you the exact reason but I can give you some theories. Firstly, I think, if you listen to the retailer public reports in May, there was a lot of rain early in the quarter. And so, certainly, drier, generally, when weather is bad, you see sort of a decline in their media repairs.\n\nAnd then, the next part of it is, we've had some extreme heat throughout the country and certainly for our rotating electrical and for the brakes, and when you have extreme heat, you have accelerated failure rates, so I see that. And then, over and above that, we've had delayed update orders that are starting to come in. We have the launch of our new product lines are starting to come in. We have so much new business kicking in in multiple categories.\n\nWe have new business that's ramping up. That starts now really as we go forward and then price increases. So just coming from in a positive way, and I want to be cautiously optimistic but in a positive way coming from a lot of different areas.\n\nBill Dezellem -- Tieton Capital -- Analyst\n\nThat's helpful. Thank you. And relative to inventory, we know that you have intentionally increased your inventory. Do you feel like you have won orders as a result of having that higher inventory? And maybe in cases where others were not able to fulfill orders and you were able to slide in there?\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nYeah, so I won't comment on others because I don't really know that as factual but I can tell you that both significant wins in the brake pad business and in the brake caliper business were dependent on us having the inventory. And so, yes, having that inventory was a significant competitive advantage. And again, when you have uncertainty in supply chain, customers are not willing to take a chance without knowing that your supply chain is reliable. They don't want to take a chance on switching suppliers because the last thing they want to do is switch a supplier and then find out they're not getting the product.\n\nConsidering the environment, our fill rates are actually excellent. And I think, at the end of the day, that is a competitive advantage, yes.\n\nBill Dezellem -- Tieton Capital -- Analyst\n\nThat's helpful. And then, I did just hear what you said, so pardon this next question, but do you feel like inventory has now peaked out and that it will fall from this level or is this really a new normal, particularly given what you just stated?\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nNo, I think, the supply chain is opening up. I mean, barring again, it's hard to predict shutdowns in different places but it seems like the supply chain is opening up. I think, we've got our arms around it. And I think, we have peaked out on inventory.\n\nCertainly, inventory as a percentage of revenue should start coming down. And we should see some positive cash flow and some easing of the inventory requirements.\n\nBill Dezellem -- Tieton Capital -- Analyst\n\nGreat. Thank you. And then, I believe that with everything you've said that, I think I understand the answer to this next question, but are you feeling like the March quarter, so last quarter, was the low point for both reported and adjusted gross margin and we had growth this quarter sequentially but that that will continue now going forward?\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nYeah, yeah. Look, I think, theoretically, that is correct. I mean, we are subject to fluctuations in foreign exchange, which is unpredictable. But putting that aside, I mean, interestingly enough, I read this morning or yesterday that Warren Buffett made a comment on that people get confused assessing Berkshire Hathaway's performance because of the mark-to-market fluctuations in his portfolio.\n\nAnd we have the same fluctuations. I mean, in mark-to-market, whether it be from foreign exchange relating to our lease liabilities or to this non-cash write-down of closing customer shelves. And I just think that he said he encourages people to ignore those when evaluating his company's health, and I feel the same way. So if you ignore those, I think you're correct.\n\nI think that we did see a low point. So yeah, I mean, I think our fundamentals today, I mean, what we've done over the last five years, and I've been trying to say it as clearly as I can is, we've done a few things. We've changed the footprint of our organization to leverage low-cost production opportunities. We've also changed the footprint to become less dependent on China imports, which makes us less susceptible to the Chinese tariffs.\n\nWe've also increased capacity to leverage the existing G&A so that we can start seeing better operating income margins. And we've also leveraged our capacity to take on all the new product lines and the new business that we're getting, which ultimately will help the operating absorption and gross margin profile. And all of that now is fundamentally completed. We've now just got to ramp up, get the new business under control, start shipping that.\n\nAgain, we've given guidance and we're optimistic about our guidance and we're optimistic about our business, in general. Despite a pretty unpredictable time, I just do want to be cautious there, and there is unpredictability in the world today, as we all know, but putting that aside, we feel like our strategic initiatives are all set to start reaping the benefits from it.\n\nBill Dezellem -- Tieton Capital -- Analyst\n\nGreat. Thank you. And if we have time for one more, I'd like to ask relative to the interest expense, David, what alternatives, if any, do you see to reduce your interest expense other than paying down debt and avoid the obvious?\n\nDavid Lee -- Chief Financial Officer\n\nSo as we have commented, we are working with our customers to address pricing increases. And as you pointed out, also generating positive cash flow for the year to pay down borrowings.\n\nBill Dezellem -- Tieton Capital -- Analyst\n\nAnd those price increases are essentially in part to offset the higher AR factoring costs?\n\nDavid Lee -- Chief Financial Officer\n\nJust overall market rates that have increased.\n\nBill Dezellem -- Tieton Capital -- Analyst\n\nThank you, both.\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nThank you.\n\nOperator\n\nWe have no further questions at this time. Mr. Joffe, I'll turn it to you for any closing marks.\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nOK. Well, I think, as you've all heard just in summary, we're excited about our future and the prospects ahead of us. We've built a solid foundation for both top-line and bottom-line growth from our existing product lines and supported by strong demand for replacement parts and tailwinds from an aging car park. In closing, as usual, I want to thank all of our team members for their ongoing commitment and customer-centric focus on service.\n\nThey've been absolutely outstanding. During these challenging times, we are particularly focused on the safety and well-being of our employees and I'm extremely proud of our team members and company for their performance and conduct. And we appreciate all their continued support and I thank you all again for joining us for the call, and we look forward to speaking with you when we host our fiscal 2023 second quarter conference call in November and at investor conferences in the future. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGary Maier -- Vice President of Investor Relations and Corporate Communications\n\nSelwyn Joffe -- Chairman, President, and Chief Executive Officer\n\nDavid Lee -- Chief Financial Officer\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nBill Dezellem -- Tieton Capital -- Analyst\n\nMore MPAA analysis\n\nAll earnings call transcripts"
}