{
  "companyName": "Sotera Health Company",
  "companyTicker": "SHC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/sotera-health-company-shc-q3-2022-earnings-call-tr/",
  "content": "Sotera Health Company (SHC 0.73%)\nQ3 2022 Earnings Call\nNov 02, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning. My name is Denise, and I will be your conference call operator today. At this time, I would like to welcome everyone to the Sotera Health Q3 2022 earnings call. All lines have been placed on mute to prevent any background noise.\n\nAfter the speaker's remarks, there will be a question-and-answer session. [Operator instructions] I will now turn the call over to Jason Peterson, vice president and treasurer.\n\nJason Peterson -- Vice President and Treasurer\n\nGood morning and thank you. Welcome to Sotera Health's third quarter 2022 results call. You can find today's press release and accompanying supplemental slides in the Investors section of our website at soterahealth.com. This webcast is being recorded and a replay will be available in the Investors section of the Sotera Health website.\n\nOn the call with me today are chairman and chief executive officer Michael Petras; and interim chief financial officer, Michael Biehl. During the call, some of the statements the company makes may be considered forward-looking statements. The matters addressed in these statements are subject to risks and uncertainties that could cause actual results to differ materially from those projected or implied. Please refer to Sotera Health's SEC filings and the forward-looking statements slide at the beginning of this presentation.\n\nFor a description of these risks and uncertainties. The company assumes no obligation to update any such forward-looking statements. Please note that during the discussion today, the company will present both GAAP and non-GAAP financial measures, including adjusted EBITDA, adjusted EPS, net debt, net leverage ratio, and constant currency comparisons. A reconciliation of GAAP to non-GAAP measures for all relevant periods may be found in the schedules attached to the company's press release and in supplemental slides.\n\nThe operator will be assisting with the Q&A portion of the call today. [Operator instructions] I will now turn the call over to Sotera Health chairman and CEO, Michael Peters.\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nGood morning, everyone, and welcome to Sotera Health's third quarter 2022 earnings call. I am pleased this morning to be reporting another quarter of year-over-year top and bottom line growth. This marks the eighth consecutive quarter of top and bottom line growth since we began reporting as a public company. Our team has done a good job executing considering the macroeconomic environment that we are experiencing.\n\nAlthough we see some improvement in certain areas of the broader macroenvironment, other areas remain choppy, which makes delivering consistent growth that much more of a challenge and an accomplishment. I would like to thank the Sotera Health team for living our values each and every day. As long as we focus on executing against our strategy, serving our customers, and remaining committed to our values, I am confident that we will continue to perform. Michael Biehl will provide more detail on our financial results in a moment.\n\nBut first I want to highlight a few items from our third quarter results. We reported total revenue growth of 10% and adjusted EBITDA growth of 7.3% compared to third quarter of 2021. On a constant currency basis, revenue grew by 13.2% as FX continues to remain a significant headwind. We delivered adjusted EPS of $0.23 for the quarter, which is a $0.02 increase over the same period last year.\n\nCompared to the first nine months of 2021, year-to-date revenue grew by 9%, which equates to 11.3% growth on a constant currency basis. Let me now shift to cover what we are experiencing across the businesses. Sterigenics, our largest reporting segment, operationally delivered another strong quarter as the team continues to work off that inflation pressures being felt around the globe. The segment is seeing solid demand across all major modalities in both medical device and bioprocessing products.\n\nOn a year-to-date basis, Sterigenics has delivered both top and bottom line double-digit growth, which is a testament to the strength of the business model. Sterigenics continues to make progress on its capacity expansion programs and facility enhancements. We have now completed three expansions in 2022, including our recent move to a state-of-the-art EO facility in Canada to help meet growing customer demand through meeting seven active capacity expansions, which includes two greenfields, are expected to come online at various points over the next 24 months or so. We also continue to make solid progress on the EO mission control enhancements we are making across our U.S.\n\nnetwork. An additional facility was completed during the quarter. The industry leading investments mark our ongoing commitment to maintain best-in-class operations for our employees, customers, and the communities in which we operate. Nordion, our other reporting segment within the sterilization services business, continues to have a strong year as demonstrated by double-digit top and bottom line growth in both the third quarter and on a year-to-date basis.\n\nAs I've highlighted throughout the year, the Nordion team has done an exceptional job successfully navigating a difficult geopolitical environment to mitigate the risk of Cobalt-60 shipments in 2022. At this point in the year, we have completely derisk any disruption of Russian supply for 2022. As we have mentioned in the past, the timing of Nordion's revenues are lumpy due to the timing of nuclear reactor supply schedules. Although we expect the remainder of 2022 to play out as previously communicated, we expect to see continued lumpiness in the future during 2023.\n\nNelson Labs, our lab testing advisory service business, grew revenue by over 7% versus the third quarter of '21. Although we are pleased with the Nelson Labs growth compared to the prior year quarter, the demand recovery for certain testing services has been slower than expected. We have seen some areas of testing perform well, while others have not ramped up as quickly. Over the past two quarters, Nelson Labs increased staffing, anticipated -- in anticipation of incremental volume.\n\nUnfortunately, we have not seen a strong increase in demand for certain testing services, which has resulted in some pressure on margins. However, the more stabilized staffing levels have resulted in improved customer service metrics and overall customer satisfaction scores. I also want to note, the experts required for this type of work are challenging to find, and we are fortunate in Nelson Labs have been able to retain our high caliber talent. We feel confident Nelson Labs is positioned well to take on incremental demand as customers continue to work through the macroeconomic headwinds that exist.\n\nToday with three quarters of the year complete and good visibility in year end, we are adjusting our full year 2022 outlook, taking into consideration the macroeconomic pressures I mentioned as well as the slower recovery at Nelson Labs. Therefore, we expect our full year net revenue growth to be 7% to 8% while full year adjusted EBITDA to grow 4% to 6%. We have also narrowed our capital expenditures range to $150 million to $170 million for the year. We continue to feel very good about the growth prospects of Sotera Health.\n\nOur strategy has not changed and we are executing for growth over the long term. We play a critical role in safeguarding global health and our service -- our services are necessities for many healthcare companies. Before we turn the call over to Michael Biehl, I want to show you some recent examples of how we deliver on our mission, safeguarding global health. One area of testing I like to highlight is our extractables and leachables testing, referred to E&L testing.\n\nThis testing is required for both medical device and pharma products. Nelson Labs has a leading position in this growing test segment. This mission critical analytical chemistry testing identifies the presence of potentially harmful compounds that could be present in drug delivery and container closure systems. The medical device extractables testing is evaluating the potential biological hazards that a patient could experience with use of the product.\n\nOne example of this testing is the toxicological evaluations of feeding tubes used for neonatal patients. Nelson Labs performs these evaluations to identify compounds that would be at unsafe levels for babies. The Nelson Labs team then works with the customer to remediate any issues to ensure safe usage in the future. The E&L testing is largely done in our Leuven, Belgium location, serving global customers.\n\nThis is just another example of how Nelson's Labs is working to better serve our customers and safeguarding global health. At Sterigenics, one of our EO facilities sterilizes the only improved interventional cardiac replacement system for patients with a severe dual diagnosis of aortic stenosis and aortic regurgitation. The U.S. FDA and the Canadian Ministry of Health are using these medical devices through their humanitarian assistance programs to save patient's lives.\n\nWe are proud to once again share these examples of how our Sotera Health team is working to ensure healthcare is consistently, reliably, and safely delivered every day. Now, Michael Biehl will take us through the financials in more depth.\n\nMichael Biehl -- Interim Chief Financial Officer\n\nThank you, Michael. I'll first cover the third quarter 2022 highlights on a consolidated basis and then provide some details in each of the business segments along with updates on capital deployment and leverage. I'll conclude with some additional details around our update for the 2022 outlook. On a consolidated total company basis, revenue grew by 10% as compared to the third quarter of last year to $249 million.\n\nThis equates to 13% growth on a constant currency basis. Adjusted EBITDA grew by 7.3% from the third quarter of 2021 to $125 million. Adjusted EBITDA margins were 50.3%, representing a 127-basis-point decline from the third quarter 2021 levels. The adjusted EBITDA margin decline compared to third quarter 2021 was driven primarily by the following items.\n\nFirst, an unfavorable impact at Nelson Labs from increased staffing in anticipation of the incremental volumes, as well as lower margins due to some of our recent acquisitions as they integrate into the overall company. And second, the timing of pricing actions versus realized inflation at Sterigenics. Both of these were partially offset by favorable volume, mix, and pricing at Nordion. Our operating performance drove adjusted earnings per share of $0.23, an increase of $0.02 from third quarter of 2021.\n\nDiluted EPS for the third quarter, 2022 was $0.09, which was a $0.01 decline from the third quarter of last year. Our reported interest expense of $23 million is burdened by mark to market loss on certain outstanding interest rate hedges for which we did not elect hedge accounting. We have removed the effect of that loss on our adjusted earnings per share. Excluding this loss, Q3 interest expense was approximately $20 million.\n\nNow let's take a closer look at our segment performances. In the third quarter, Sterigenics operationally delivered another strong quarter with 9% revenue growth to $158 million and an 8% segment income growth to $86 million as compared to the third quarter of last year. On a constant currency basis, Sterigenics grew revenues 12% and segment income 11% compared to the third quarter of last year. Revenue growth drivers for the third quarter included favorable pricing of 6% and favorable volume and mix of almost 6%, partially offset by unfavorable foreign currency headwinds of 3.3%.\n\nCompared to the third quarter of 2021, segment income margins contracted by 30 basis points to 54.3%, driven by the timing of contractual pricing actions versus realized inflation. Sequentially, margins did improve over the second quarter 2022 levels. As Michael mentioned, we are seeing solid demand across all modalities as our customers continue to rely on Sterigenics mission-critical services. Nordion had strong third quarter with revenue growing by 22% to approximately $35 million compared to the third quarter of 2021.\n\nNordion segment income grew by more than 24% to $20 million compared to the same period last year. On a constant currency basis, Nordion grew revenues 25% and segment income 27% compared to the third quarter of last year. Nordion's revenue growth was driven by volume and mix growth of nearly 18%, pricing of 7%, which was offset by 2.8% foreign currency exchange headwinds for the quarter. The outsized growth Nordion experienced versus the third quarter of 2021 is representative of the previously noted lumpiness related to the timing of nuclear reactors supply schedules.\n\nNordion's margins were 57.9%, 110-basis-point improvement from Q3 2021 margin levels. Increased margin levels were a result of increased volume, more optimal product mix, and pricing. For Nelson Labs, third quarter of 2022 revenue improved 7.3% to $56 million compared to the third quarter of 2021. Segment income of $19 million was 8% unfavorable versus Q3 2021.\n\nOn a constant currency basis, Nelson Labs grew revenues 11%, while segment income declined by 4% compared to the third quarter of last year. Revenue growth for the third quarter of 2022 was impacted by a 6.3% benefit from pricing and nearly a 6% increase from our recent acquisition. Those benefits were partially offset by foreign currency exchange headwinds of 3.5%. Q3 2022 margins for Nelson Labs contracted to 34.5% or approximately 580 basis points versus Q3 2022 -- I'm sorry, 2021 margin levels.\n\nThis decline was driven by increased staffing in anticipation of incremental volumes, which we now expect to continue in the fourth quarter. In addition, dilution from recent acquisitions and unfavorable revenue mix impacted the third quarter, partially offset by favorable pricing. These trends are reflected in our revised 2022 outlook provided today. Prior to providing highlights related to capital deployment and net leverage, I'd like to touch on cash generation.\n\nSotera Health is proud to deliver mission-critical services to the healthcare industry through its sterilization and lab testing services. Because of the important services we offer and the strength of our business model, we have generated between $50 million and $70 million of operating cash flow each quarter during 2022. This allows us to fund operating needs, invest for future growth, all from operating cash flow. As of September 30, 2022, we had $165 million in cash and over $440 million in available liquidity.\n\nOur net leverage fell to 3.3 times adjusted EBITDA for the quarter. Our capex for third quarter of 2022 was $39 million, consistent with the increased levels of spend that we communicated for our full year 2022. Growth capex and facility enhancements continue to drive our increased investment levels and we are on track to invest $150 million to $170 million into the business in 2022. Now I'd like to recap our update for the full year 2022 outlook, which reflects the trends that we are seeing and believe will continue to impact the remaining months.\n\nFor the full year 2022, we have adjusted total net revenues to the range of $995 million to $1.005 billion, representing annual growth of approximately 7% to 8%. We have adjusted our adjusted EBITDA range to $500 million to $510 million, representing annual growth of approximately 4% to 6%. This guidance range incorporates an incremental 1% unfavorable foreign currency impact on top of what we communicated last quarter as well as slower recovery in certain testing categories at Nelson Labs. We have lowered our adjusted net income effective tax rate to approximately 28%.\n\nAdjusted EPS is now expected to be in a range of $0.91 to $0.95, reflecting the adjusted EBITDA flow through as well as the change in the effective tax rate. Our current expectations are that net leverage will land in the range of 3.2 times to 3.3 times by the year end, subject to any changes to our debt related to appellate bonding, which Michael will comment on further. The other elements of our previously issued outlook remain the same. I will now turn the call back over to you, Michael.\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nThanks, Michael. Before we open it up for Q&A, I will provide an update on our EO litigation in Illinois because I know many of you understandably have questions. A deference to the court system as the appropriate forum in which all parties and their lawyers ought to be addressing these complicated issues, I will not provide further comment beyond this briefing. As has been widely reported in the media, in September, the jury in the first EO trial, Cook County, Illinois, returned a verdict in favor of the plaintiff, Susan Kamuda, and awarded her compensatory damages, punitive damages, and prejudgment interest in the amount of $358.7 million against our subsidiaries Sterigenics U.S.\n\nLLC, and Sotera Health LLC. Sterigenics U.S. operates EO and gamma sterilization facilities in the United States. Sotera Health LLC is the holding company of Sterigenics U.S.\n\nand a subsidiary of Sotera Health Company. We do not believe the facts, the science or the law, justify the verdict or damage awards, and we intend to vigorously challenge them through all appropriate motions for post-trial relief and appeals. On October 25th, we began that process by filing a motion for post-trial relief with the trial court. The motion for post-trial relief addresses both the verdict and the damages awarded.\n\nFirst, the motion for post-trial relief asked the court to enter judgment in favor or in the alternative to grant a new trial. The basis for this request of relief includes the insufficiency of the evidence at trial to support the verdict, numerous errors in the trial court's rulings and important motions, and about the admissibility of evidence in numerous errors in the court's instructions to the jury. Second, the motion for post-trial relief asked the trial court to reduce the compensatory damages on the grounds that the award was excessive and not supported by the evidence. Third, the motion for post-trial relief requests the trial court to vacate or reduce the award of punitive damages on the grounds that the strict threshold standard for allowing a jury to award punitive damages was not met and that the jury's award was not supported by the evidence.\n\nWhile I will not go into the details, the motion for post-trial relief presents our argument that there are no credible scientific studies suggesting, let alone establishing, that exposure to the levels of EO alleged by Mrs. Kamuda can or do cause cancer. Various rulings by the trial court improperly impeded our defense on this case, particularly on the lack of causation and otherwise resulted in unbalanced and unfair trial. The compensatory damages, which were nearly double the amount sought by the plaintiffs lawyers at trial, were excessive and fueled in significant part by evidence and argument that should not have been presented to the jury.\n\nThe strict and high standard for awarding punitive damages was not met and the punitive damage awards were entirely out of proportion to the alleged misconduct. The motion for post-trial relief and any subsequent appeals are expected to stay the enforceability of the Kamuda judgment, including citations and means that Mrs. Kamuda's lawyers attached before the motion for post-trial relief was filed against Sterigenics U.S., Sotera Health LLC, our parent company, and many of our other subsidiaries. Obviously, these are the company's use of the verdicts in the issues associated with the verdict.\n\nMrs. Kamuda and her representatives have different -- differing views. If our post-trial motions are not successful, we intend to take these serious issues up to the appellate courts. The range of loss for this case could be from $0 to $358.7 million plus potential post-judgment interest.\n\nHowever, the company does not believe that after rulings on all appropriate motions for post-trial relief in appeals liability to the plaintiff is probable and thus no reserve has been recorded. If and when appeals prove necessary, Sterigenics U.S. and Sotera Health LLC will be required to post a surety bond or other security pending the appeals. The amount of the bond will ultimately be determined by the courts, and per the typical application of the governing rules to less atypical outcomes could be as high as 150% of the judgment, unless the trial or appellate courts determine a lower amount to be more just and appropriate under the totality of circumstances.\n\nWe are working to secure the bond or other security and expect to be able to do so. But we will have to navigate the present state of the capital markets. Regarding the timelines for review of this first EO case, we are eager to proceed with the post-trial proceedings as expeditiously as possible. However, it is difficult to predict with any degree of certainty the exact timelines.\n\nMotions and appeals can take months at minimum and at times require a year or more to resolve. This second EO trial is now underway before a different judge and a different jury in Cook County and is currently expected to conclude in mid-November. The third trial is scheduled begin in January 2023, and a fourth trial is scheduled to begin in April 2023. These are individual plaintiff trials in which only the claims of each of the plaintiffs case will be litigated.\n\nThese trial dates in the overall case management schedules will be turned by the courts in due change from time to time. Subject to change, we expected the five individual Illinois trials previously scheduled to begin in January 2023 will not be treated at that time -- tried at that. Furthermore, at a recent hearing, the court indicated the claims of small groups of plaintiffs should be tried jointly, starting in late May 2023. The parties have been instructed to confer to identify plaintiffs whose claims could be tried jointly because the details in the individual claims are similar.\n\nWe will know more in mid-November about whether joint trials are possible and when they will be scheduled. But even if the joint trials proceed, they will remain individual actions and will not become class actions by the virtue of this latest procedural development. And finally, as announced earlier today, we welcome seasoned executive and highly respected litigator, Alex Dimitrief, to our executive team as general counsel. Alex grew up in Illinois and was a litigator in the Chicago office of Kirkland & Ellis LLP for 20 years.\n\nAlex and I worked together when he left K&E to join G.E. And Alex has a brilliant legal mind, a successful litigator, and champion of integrity with respect to law and justice. We welcome Alex's experience, input, and guidance regarding the EO cases. I want to reinforce several important points.\n\nSotera Health respects the legal system and the rights of the plaintiffs to present their cases. But with respect, we regard the outcome of the first EO trial to be unjust and unsupported by the facts, the science or the law. We intend to continue to vigorously defend Sterigenics U.S. LLC and Sotera Health LLC against these claims.\n\nOur company plays an indispensable role in healthcare. We conduct our operations with profound respect for our legal, regulatory, and other obligations, and our employees operate our facilities safely, responsibly, and compliantly. It's our employees commitment to our company, our mission, our customers, and the communities in which we operate that have driven Sotera Health's consistent and outstanding performance for so many years. It gives me so much optimism over our outlook for 2022 and beyond.\n\nAt this point, operator, Denise, let's open the call for Q&A.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Sean Dodge with RBC Capital Markets. Sean, your line is now open.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nYep. Thanks. Good morning and [Inaudible]. In Nelson, you mentioned one of the items pressuring margins there in the quarter was increased staffing ahead of an anticipation of higher volumes.\n\nI guess if you could share a little bit more detail on that. What kind of visibility do you have on [Inaudible] increase that you're looking for there?\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nYeah. Good morning, Sean. Can you hear me OK? Because you were breaking up a little bit in your question, but I think I got the gist of it. Can you hear me OK?\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nYeah, I can hear you clear. So it was just --\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nI got it. I think I got the question. It was on Nelson on labor, I think is your question, right?\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nYeah, in anticipation of higher volumes, the visibility of that and the volumes.\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nYes. Thanks, Sean. So the visibility on the Nelson business isn't as great as it is on the other business. Obviously, Nordion has the most visibility out of the business units.\n\nNelson has less visibility. And as we mentioned, coming out of '21 and rolling into '22, the labor challenges, staffing challenges have been pretty, pretty difficult. We've been able to stabilize that, but the volume just hasn't come through to the extent we wanted. So we lost some productivity in the quarter, which put pressure on the margins.\n\nBut overall, the business is performing pretty well. As we've referenced, the Net Promoter Score in the overall turnaround times and service has been much better.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nAnd -- OK. And staying on Nelson, you mentioned a few things that are dragging on [Inaudible] foreign exchange. Can you give us [Inaudible] magnitude of those? Is it the staffing increase that's kind of the biggest drag or kind of impact on the Nelson margins right now?\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nYeah, yes. It's -- the biggest drag is the labor productivity piece. And then you have, as we mentioned, some product mix and there's well, currency has got some impact as well, but that's the biggest driver in that order.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nOK, great. Thanks for taking the question.\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nYeah. Sean, don't forget, also embedded within that mix, you've got the protective barrier piece. It's down 50% year over year, which was pretty high mix. Although as we've stated, we're at more normalized levels now going forward, it's still in the quarter was down 50% from last year same quarter.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Patrick Donnelly with Citi. Go ahead.\n\nYour line is now open.\n\nUnknown speaker\n\nJason on for Patrick. Maybe just one on Nordion. You mentioned you derisked all of 2022 from a geopolitical standpoint, but there might be some lumpiness in '23. So how should we think about the potential risks there in sourcing cobalt from places like Russia maybe next year?\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nYeah. Jason, thanks for the question. Yeah, as we referenced, we feel confident of where we stand with cobalt supply in 2022. We're not going to get into a lot of details on 2023.\n\nAs we turn the quarter, we'll be able to give guidance on the total year and kind of how we see it. But from time to time with any of our cobalt supply, we've got to work through challenging or different opportunities that present itself during the course of the year. What we wanted to call out as it will be lumpy like it was this year, it's not a smooth, consistent harvest schedule from the reactors every single quarter. There will be variation in that.\n\nIt could be significant at times resulting in the word lumpiness, our new official word over at the Nordion side.\n\nUnknown speaker\n\nWell, and then maybe one on the litigation outside of Willowbrook. I guess just how should we be thinking about litigation going forward across some of the other various trials you had have taking place here in the coming months?\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nYeah, what I would tell you is those are all different various stages in process. Georgia will have a case that'll go to trial late next year, and then the rest of the Georgia cases and New Mexico are going to be beyond 2024 on the litigation that you see similar to the Illinois litigation.\n\nUnknown speaker\n\nThank you.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Phil Coover with Goldman Sachs. Go ahead.\n\nYour line is now open.\n\nPhil Coover -- Goldman Sachs -- Analyst\n\nThanks for taking the questions. Appreciate it. One fundamental one and then one on facility. So the first one, just looking for a little bit more clarity on the Nelson Labs side.\n\nI think the language was limited recovery and then waiting for customer demand to reaccelerate. Just hoping you can give a little bit more color on kind of systemically what's still limiting recovery on the Nelson Labs side and then what you're looking for to change with regard to customer demand for it to reaccelerate.\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nYeah. Phil, it's Michael. What I would say is we've seen -- as you heard in the prepared remarks, we've seen some growth in the Nelson business. It just hasn't returned to the levels that we are hopeful that it would.\n\nWe're seeing routine testing doing very well. We're seeing extractable and leachable testing, as I referenced in my remarks, doing very well. It's just some more of the validation, more complex testing that's been a little slower to recover. And that's really as we talk to our customers, they're a little slower in some of the development activities that would drive that.\n\nBut overall, we still feel optimistic about growth going forward in that business. It just hasn't been to the level that we were expecting here in the second half of the year.\n\nPhil Coover -- Goldman Sachs -- Analyst\n\nSorry to push, but just what's precipitating that slower recovery? Is it FDA timelines or what would you kind of pinpoint as why customer demand hasn't reaccelerated at the rate you would have anticipated?\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nI would just say some of the development with the customers on new products or requalifications of products has been a little slower. We have one particular customer that's having an issue with the FDA that they're working through that's causing some challenges as well. And so there's a little bit uncertainty with the FDA, but then there's also some customer-specific activities that are driving that.\n\nPhil Coover -- Goldman Sachs -- Analyst\n\nOK. That was really helpful. Thanks. The second one, we noticed two notice of violations in Southern California plants that you guys operate.\n\nI'm wondering if you have any comment on the circumstances there and any disruption you've either seen so far or anticipate as a result of the communications with the local authority. Thanks.\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nNo, we're working -- yeah, thanks. So we're working with South Coast. We've got two facilities in the L.A. area that are about next to each other and then one on Ontario.\n\nWe continue to work with the regulators we have -- in L.A., we have an agreed upon process and plan going forward for the enhancements that we're rolling out throughout the United States. And in Ontario, we continue to have discussions with them. We continue to operate those facilities and serve our customers day in and day out with the millions of devices we sterilize there.\n\nPhil Coover -- Goldman Sachs -- Analyst\n\nOK. And right now, nothing that would indicate a legal risk in Southern California for either plant?\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nNow we continue to operate the facility. There's always legal risk, as you know, but we continue to operate those facilities or we continue to take care of the customers and we're running in full force in those facilities as we speak.\n\nPhil Coover -- Goldman Sachs -- Analyst\n\nOK. Thank you, Michael. Appreciate it.\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nThank you. Yeah, Phil.\n\nOperator\n\nOur next question comes from Matt Mishan with KeyBanc. Apologize for that delay.\n\nMatt Mishan -- KeyBanc Capital Markets -- Analyst\n\nOK. Great. Thank you for taking the questions, Michael. Just a quick one.\n\nJust to quantify the -- let's call it, the change in guidance. Looks like maybe $10 million to $12 million, a $10 million at the midpoint and $11 million at the midpoint. Just how much of that is FX and how much of that is organic?\n\nMichael Biehl -- Interim Chief Financial Officer\n\nAbout -- this is Michael Biehl. About 60% of it is on the revenue side is impact --\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nFX.\n\nMichael Biehl -- Interim Chief Financial Officer\n\nFX?\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nYeah.\n\nMichael Biehl -- Interim Chief Financial Officer\n\nAnd then roughly 40% --\n\nMichael Petras -- Chairman and Chief Executive Officer\n\n20%. It is about 60% on -- 60% on FX and 20% FX on EBITDA.\n\nMatt Mishan -- KeyBanc Capital Markets -- Analyst\n\nRight. OK. Two more, if I can squeeze them in. First, why is testing slow at Nelson, like what's really driving that?\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nAs I just referenced, Matt, with one the previous questions, we're seeing more in the validation, the more complex testing. It's a result of customers not as -- moving long as fast and some new product development activities as well as some regulatory challenges either with the regulators themselves or just problems within the customers with some challenges that they're facing. Those are two primary drivers. But the routine lot release is doing well.\n\nExtractable, leachables is doing well. It's more on the validation, more complex testing.\n\nMatt Mishan -- KeyBanc Capital Markets -- Analyst\n\nAnd then last one, just bigger picture. I mean, as part of one of the the drawbacks of litigation, a lot of people have asked about what has changed in capital allocation and how you think about that over the next couple of years? Just broadly how you how you're looking at capital allocation and some of your investments as a result of some of the uncertainties?\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nYeah, as we referenced earlier we had previous gains, $140 million to $170 million of capex for the year. Based on the run rate of all the activities that we have in process, it looks like it could be closer to $150 million to $170 million. So we tightened that range. We are rolling up our plans for '23.\n\nAs we get in the operating budgets for '23, we continue to invest in capacity expansions to meet our customers demand and take care of the needs that they have. We'll be very thoughtful on how we do it. We're going to continue to look for opportunities to deleverage in the business and over the long term, looking at M&A as well. So we go through a pretty rigorous process in how we evaluate capital expenditures, and we'll continue to do that as we roll into '23.\n\nMatt Mishan -- KeyBanc Capital Markets -- Analyst\n\nThank you very much.\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nThanks, Matt.\n\nOperator\n\nThank you. We have one more -- couple more questions. Our next question, please stand by. Our next question is from Michael Polark with Wolfe Research.\n\nGo ahead. Your line is now open.\n\nMike Polark -- Wolfe Research -- Analyst\n\nHey, good morning and thank you for taking the questions and appreciate the full update on the EO litigation matters. My question on that topic is bigger picture. The initial Kamuda verdict was high profile. It was a higher than expected number.\n\nWhat do you hear from your customers on the heels of this? I mean, obviously, the system hasn't figured out a better way to do this critical work. And I'd just be curious kind of the tone and tenor of the conversations with important customers on the heels of this outcome.\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nMike, I -- with the backdrop that 50% -- according to FDA, 50% of medical devices in the U.S. are sterilized with EO, over $20 billion devices a year. It's a critical sterile with no alternatives out there. The customers recognize that.\n\nThey've got broader concerns when they see how this was handled in the courts, but they continue to support this business, continue to rely upon Sterigenics. You see Sterigenics had a very solid quarter, continue to grow. It's had a great year. So our customers have been very supportive and understanding of the critical role that Sterigenics plays day in and day out.\n\nAnd we're working to do the best we can to continue to meet their needs as we go ahead and put these improvements in and wait to navigate through this regulatory uncertainty. We're still hopeful that we get a new rule here from the EPA on these rules. And it's the same thing that the broader industry is waiting for. Right now, it looks like that probably won't come until 2023.\n\nSo I would say the customer has been very supportive. We continue to see robust demand and interest in how we could fill their needs.\n\nMike Polark -- Wolfe Research -- Analyst\n\nThen a follow up. It's just a small-picture numbers question. The tweak to the leverage reduction target this year from a half a turn to, call it, a quarter turn. I mean the change to EBITDA, as far as I'm doing the math, doesn't explain all that.\n\nSo can you just walk me through kind of what drove the fine tuning of the slightly more modest leverage reduction goal this year?\n\nMichael Biehl -- Interim Chief Financial Officer\n\nIt's really based upon the reduction of EBITDA for the year. That's the primary driver.\n\nMike Polark -- Wolfe Research -- Analyst\n\nOK. All right. Thank you very much.\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nThanks, Mike. Thank you.\n\nOperator\n\nThank you. Looks like we have a follow-up question. Our next question comes from Phil Coover with Goldman Sachs. Welcome back.\n\nYour line is now open.\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nPhil, are you there?\n\nPhil Coover -- Goldman Sachs -- Analyst\n\nMichael, can you hear me?\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nThere we go, Phil. Go ahead.\n\nOperator\n\n[Inaudible] from Goldman Sachs. Thank you.\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nHey, Phil.\n\nPhil Coover -- Goldman Sachs -- Analyst\n\nHi. Thanks. Just a quick one on FX. Other companies have been amenable to giving a preliminary kind of estimate for '23 from FX with currencies having impacted the quarters.\n\nJust wondering if you can give a comment on top line and potential EPS or EBITDA headwind right now that you're projecting for '23 from currency? Thanks.\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nNo, we're -- Phil, we're not prepared at this time to give comments on '23 regarding FX.\n\nPhil Coover -- Goldman Sachs -- Analyst\n\nOK. Fair enough. Thanks for taking the follow up.\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nGreat. OK, Denise, any further questions?\n\nOperator\n\nAt this time, no more further questions. I'd like to turn the call back over to Michael Petras for closing remarks.\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nYes. Great. Thank you, Denise. Thank you, everybody, for taking the time this morning.\n\nI know the prepared remarks were a little bit longer, but we felt that was important. You folks had several questions. We wanted to make sure that we were able to address those upfront. So thanks for your time.\n\nAppreciate your continued support of Sotera Health. And as you can see, we're really proud of what this team is doing. We had another solid quarter and we look forward to rounding out '22 and then being able to talk to you about '23. So thanks for all your ongoing support and have a great day.\n\nBye bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJason Peterson -- Vice President and Treasurer\n\nMichael Petras -- Chairman and Chief Executive Officer\n\nMichael Biehl -- Interim Chief Financial Officer\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nUnknown speaker\n\nPhil Coover -- Goldman Sachs -- Analyst\n\nMatt Mishan -- KeyBanc Capital Markets -- Analyst\n\nMike Polark -- Wolfe Research -- Analyst\n\nMore SHC analysis\n\nAll earnings call transcripts"
}