{
  "companyName": "Sanofi",
  "companyTicker": "SNY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/28/sanofi-sny-q3-2022-earnings-call-transcript/",
  "content": "Sanofi (SNY -0.25%)\nQ3 2022 Earnings Call\nOct 28, 2022, 8:30 a.m. ET\n\nEva Schaefer-Jansen\n\nGood morning, good afternoon, and good evening to everyone. Thank you for joining us to review Sanofi's 2022 third quarter results, followed by a Q&A session. As usual, you can find the slides to this earnings call on the Investors page of our website at sanofi.com. Moving to Slide 3.\n\nI would like to remind you that information presented in this call contains forward-looking statements that involve known and unknown risks, uncertainties, and other factors that may cause actual results to differ materially. I refer you to our Form 20-F document on file with the SEC and also our Document d'enregistrement universel for a description of these risk factors. With that, please advance to Slide 4. Our speakers on the call today are Paul Hudson, chief executive officer; the global business unit heads, Bill Sibold, Thomas Triomphe, Olivier Charmeil, and Julie van Ongevalle; and Jean-Baptiste de Chatillon, chief financial officer.\n\n[Operator instructions] With that, I'd like to turn the call over to Paul.\n\nPaul Hudson -- Chief Executive Officer\n\nWell, thank you, Eva, and thanks to everyone for joining. I'm truly delighted to show our outstanding financial results with you today. And as always, key members of the executive team are with me in the room to take you through the business and the financials. The strong performance of our businesses exceeded expectations with sales growing 9% at constant exchange rate.\n\nDupixent was once again the main driver within Specialty Care with robust growth in all markets and new indications. The next major waypoint of EUR 10 billion sales is now approaching and is achievable as soon as next year. To remind you, we introduced this submission only three years ago, when many of you considered this target to be, well, rather aggressive. Dupixent's unique profile in treating type two inflammatory diseases, coupled with our team's ability to execute launches, propel this exceptional medicine to new sales milestones while raising the bar for novel treatments in immunology.\n\nThis quarter marked another record Imvexxy sales, reaching EUR 3.3 billion, an increase of almost 24% from Q3 2021. Our success is primarily credited to our differentiated flu vaccines, exemplifying our unparalleled leadership in this field. Two-thirds of our global flu sales in Q3 were generated by our high-dose flu brands, reflecting the recognition by payers and providers of this superior value and protection beyond flu. Higher sales were also driven by our capacity to speedily manufacture and supply the vaccines to our customers.\n\nFinally, our core general medicines business and consumer health brands continue to grow while we stay disciplined in our efforts to divest nonperforming tail products. Moving to Slide 7. Let's look at our pharma and vaccine performance in the United States. With 15% growth at CER in the quarter, our U.S.\n\nsales reached almost 50% of total company sales, a remarkable achievement driven not only by Dupixent but Specialty Care at large and -- sorry, and Vaccines. In Specialty Care, the launches of Nexpeazyme and Sarclisa are also contributing to growth. In Vaccines, sales remain centered around our influenza and meningitis businesses. And we also continue to be impressed by the launch of Rezurock and are seeing a positive effect on the performance of the broader transplant franchise.\n\nIn mid-August, a set of healthcare policies were signed into law by President Biden as part of the broader Inflation Reduction Act Bill. We believe that the implementation of these policies will likely create significant uncertainties across our industry with regards to sustainable investment in science and innovation and artificially influence future R&D decisions. Importantly, the new reform bill does not address the core concerns around patient affordability and access to innovative medicines. Inflation penalties will present a significant challenge to an industry dependent on a constant cycle of investments into innovation and expectations from others in the supply chain for additional rebates and fees.\n\nBecause Sanofi has followed an industry-leading responsible pricing policy for several years, we do not see any immediate impact from the inflation penalty provision. Overall, Sanofi is well positioned in the short term to navigate the core elements related to this drug pricing reform bill in the coming years. Our portfolio of products in the U.S. has limited exposure to government channels.\n\nOur growth drivers are generally newer medicines and vaccines. And specifically to Dupixent, we do not expect impact from Medicare pricing negotiation to take effect before 2031. On Slide 8. Well, we're excited about the prospectus of launching two potentially transformative medicines in 2023.\n\nFirst, we believe alpha or Oltuvia, an undergoing priority review by the U.S. FDA in hemophilia A could potentially transform the treatment paradigm in a highly fragmented market. Market research suggests that a majority of people living with hemophilia remain open to alternative treatment options. What worked against us with Hemlibra and how dynamic these patients actually are will work for us with Oltuvia's new benchmark in efficacy.\n\nSecond, with Bay Fortis, we'll be breaking new ground in how we protect all infants against RSV, a leading cause of infant hospitalization worldwide. The CHMP has recently adopted a positive opinion, and our teams are having frequent interactions with ACIP in the U.S. Given its potential to prevent 80% of hospitalizations, we expect Befor to become the best option in 2023 to achieve all infant protection against RSV. Moving to Slide 9.\n\nOur R&D transformation continues at pace. Our transition from a -- well, a me too late to a competitive first-in-class, best-in-class medicines company is fully underway. Over the last three years, we have almost doubled the number of NMEs across the key areas in immunology, oncology, neurology, and vaccines. Two-thirds of our portfolio is now in biologics and more than 70% are fully owned assets.\n\nWe also continue to establish partnerships with cutting-edge biotechs, such as Scribe Therapeutics and its technology to enable genetic modification of NK cells. And we look forward to demonstrating over the next years the progress we're making in this area in particular. Through business development, we also access innovation in areas where we have stopped R&D but still have a successful commercial franchise, such as tablizumab for type 1 diabetes and organ-specific autoimmune disease. Before we look at the rich scientific news flow over the next 18 months on Slide 10, let me comment on two recent pipeline updates.\n\nAmcenestrant, our oral CERD, was recently discontinued as it failed to meet our high efficacy bar for the target product profile to win in a competitive field. While we are disappointed by this outcome, we believe going for at speed was the right thing to do given its excellent safety and the potential to become a new standard of care in adjuvant breast cancer care. On SAR'245, our non-alpha IL-2, internal and external data emerged over recent months. And we took the decisive action to discontinue the current Phase 2 and reallocate resources to initiate a new Phase 1/2 program.\n\nWe remain optimistic that with an intensified dosing regime, SAR'245 still holds promise and will play a role in cancer treatments in the future. So as we do things that we've never done before, we're taking on some risks and possibilities of early failures, but it will also lead us to eventually win big with truly transformational medicines. Now looking forward, we expect two major pivotal readouts in 2023, Dupixent and COPD, and tolebrutinib in RMS. The first Dupixent COPD study is fully enrolled, and results are expected in the first half of 2023.\n\nThe second study started later, as you know, and is expected to finish recruitment early next year with the results expected in early '24. And what a game changer that would be. Regarding tolebrutinib, we previously mentioned that the RMS studies are fully recruited with an expected readout in the second half of 2023. Regarding the FDA request for additional information to address the partial hold in the U.S., I can confirm that the responses were submitted to the agency as we planned.\n\nWe have several other pivotal data sets reading out: the fitusiran Phase 3 study data for the 50-milligram and 20-milligram dosing and the IMRO study for Sarclisa. Bill will tell you a little bit more about these opportunities in a moment. Finally, we close to 30 early stage readouts from assets with first- or best-in-class profiles, especially in immunology. We are set to deliver on our ambition to transform the purpose of medicine.\n\nAs Sanofi teams around the world are taking decisive actions to minimize the environmental impact of our products and activities, we remain committed to play our part in driving further change across the entire healthcare sector. That's why at COP26 in Glasgow last year, upon the invitation of King Charles III, Sanofi joined the Sustainable Markets Initiative, a healthcare task force that includes leaders from the WHO, UNICEF, other renowned academic and nongovernmental organizations, and, of course, pharmaceutical companies. I have the privilege of championing the task force on the decarbonization of the patient journey, and I will engage with authorities, payers, healthcare professionals to identify concrete solutions. In parallel, we have also launched internal initiatives on how to decarbonize the patient care pathway for Dupixent, for example.\n\nAnd with that, I hand over the call to Bill. Bill?\n\nBill Sibold -- Executive Vice President-Sanofi Genzyme\n\nLargest business unit by sales. We are excited to report another strong quarter of roughly 20% growth, reaching EUR 4.4 billion. Rare diseases, both benefiting from launch momentum. Before we move to discussing Dupixent performance in more detail on the following slides, let me remind you that Q3 double-digit sales growth for Specialty Care has to be seen against the deconsolidation of Libtayo sales, which were EUR 35 million in Q3 2021.\n\nRare diseases once again showed sustainable performance driven by the success of our teams to unlock commercial potential through persistent accrual of patients and execution in key markets. In oncology, our launch momentum continues for Sarclisa with strong uptake in key launch territories, globally supported by its compelling data in later lines. More on Sarclisa's launch trajectory in a minute. Moving to Slide 14.\n\nLet's take a closer look at Dupixent performance in Q3. Adding to Paul's earlier comments, this outstanding medicine and team generated another quarter of impressive sales, already annualizing close to EUR 9 billion. On its growth trajectory, Dupixent achieved a number of new milestones underpinning its success, including reaching a 0.5 million patients now on therapy five years after launch and recent approval in its fifth disease indication, prurigo nodularis. Of note in this quarter, ex U.S.\n\nsales continue on a greater than 40% growth trajectory, now annualizing close to EUR 2 billion and nearly blockbuster status in Europe alone. Looking at sales evolution in the U.S. market. We are pleased by the robust growth of 45% driven by all indications, including our most recent launches in EOE and our AD age expansion down to six months of age, which makes Dupixent the first biologic in immunology to be approved in this age group.\n\nTurning to Slide 15. We highlight the steady expansion of our leadership in specialty dermatology. Today, we are pleased to focus on the benefit of Dupixent in patients suffering from prurigo nodularis, a debilitating skin disease, which impacts 75,000 most-in-need patients across the U.S. alone.\n\nPatients suffering from PN experience persistent itch, thick nodules, and sensations of brand-stinging skin. The impact of PN on quality of life is one of the highest among inflammatory skin diseases due to the relentless itch. The PN approval was another proof point of our conviction in the science of type 2 inflammation and the incredible execution of our team moving directly to a Phase 3. The FDA granted us approval under priority review as the first-and-only treatment indicated for PN, and we are now launching in the U.S.\n\nWe will continue to innovate under the same guiding principles evaluating the potential of inhibiting IL-4 and IL-13 with Dupixent, of which we highlight on the slide, those focused on chronic skin diseases. Turning to Slide 16. I'd like to provide you with an update on our excellent launch progress with Nexviazyme, which is now available in 9 countries, including the U.S., Japan, and beginning in Q3, the first launches in Europe. Nexviazyme is our important new innovation in the treatment of Pompe disease, a progressive and debilitating rare disease that impairs the patient's ability to move and breathe.\n\nWe believe it has the potential to become the new standard of care in the Pompe market, where we have already achieved blockbuster sales of EUR 1 billion in 2021. We see strong market adoption of Nexviazyme, demonstrating that we are only at the beginning of unlocking the full global commercial potential. Just about one year into the U.S. launch, more than 60% of the treated LOPD, or late onset Pompe disease patients, are now using Nexviazyme, representing the majority of the EUR 58 million in sales indicated on this slide.\n\nNew country launches, market penetration, and the expansion of the U.S. label to infant onset patients, or IOPD, which represents approximately one-third of the U.S. Pompe population, provide additional growth opportunities for Nexviazyme in the future. Moving to Slide 17.\n\nWe shine a brief spotlight on the successful uptake of Sarclisa, our anti-CD38 monoclonal antibody for multiple myeloma. As you will recall, Sarclisa is currently only approved for treatment in later lines of therapy, which represents roughly one-third of the total estimated multiple myeloma market potential depicted on this slide. Leveraging the strong clinical data from both the Ikaria and Dykema trials, we continue to capture significant market share in approved indications with continuous growth in launch markets. We remain excited about the additional growth potential based on MROs, which will open up the largest commercial opportunity in the newly diagnosed patients.\n\nThe readout is now expected in the second half of 2023. We are making good progress with our competitive subcutaneous program and have started recruitment in our pivotal trial. With that, I hand over to Thomas to update you on the Vaccines business.\n\nThomas Triomphe -- Executive Vice President, Sanofi Pasteur\n\nThank you, Bill. This quarter, Vaccines reached the highest level ever at EUR 3.3 billion, an impressive 23% growth versus prior year. All geographies and all franchises contributed to this outstanding performance. Our flu franchise is on track to reach another record sales year.\n\nThe strong growth in Q3 was supported by an outstanding time to market in all geographies due to important contributing factors. First, there was no change to the flu train composition compared to the [Inaudible] campaign. Second, on top of continuous process improvement, we now have larger manufacturing capacity at our Swiftwater plant. And third, we had an excellent yield in this year's production.\n\nThe great demonstration of our hundreds of millions of doses of egg-based flu vaccines can be swiftly manufactured and delivered to major markets to support the national flu vaccination campaigns. We had initially planned for a 60-40 sales split between Q3 and Q4. But in fact, we managed to deliver in Q3 almost 70% of our Q3-Q4 flu vaccine sales. The growth of our flu sales will, again, this season be driven by the switch from standard dose to differentiated flu vaccines.\n\nMore and more recommending bodies and health authorities recognize the superiority of Fluzone high-dose and true blood. As mentioned last quarter, ACIP has excluded standard dose from the recommendation for seniors, and I'm very glad to see a similar trend now in Europe. Regions in Italy and Spain are awarding tenders to have high dose flu vaccines for the senior campaign this year. On PPH vaccines, we continue to see sustained demand in Europe and Rest of the World regions.\n\nIn the U.S., some CDC order phasing helped to offset the decline resulting from Vaxelis continuous uptake. Finally, meningitis vaccines also benefited from favorable CDC shipment in the U.S. and deliveries of first tenders won in Europe, while the travel vaccines continue to recover from the pandemic. Moving on to Slide 19.\n\nI'd like to share with you some new data recently generated to support of Fluzone high-dose superiority over standard dose flu vaccine. We have a related clinical data with 34 million patients over 10 years to support Fluzone high-dose ability to protect beyond flu, i.e. not only against flu infection alone but also against its severe consequences, such as pneumonia, cardiovascular events, and hospitalizations. And we continue to gather amazing results every time we run a study.\n\nIn this most recent trial have Dant that randomized 12,000 subjects, people vaccinated with our high-dose vaccines had an associated 64% reduction in flu and pneumonia hospitalizations compared to people vaccinated with the standard dose flu vaccine. It is thanks to such strong evidence that Fluzone high-dose continues to gain recognition of its superiority versus standard dose with health authorities and recommending bodies. When we do continue to build a high-dose body of evidence, we are also very active in developing a compelling flu vaccine. I'm glad to inform you that our program is on track.\n\nAs communicated at our vaccines event last December, our quadrivalent flu-modified mRNA vaccine program is entering Phase 1/2 with not only one candidate but with three candidates testing three different LNPs. Please remember that the ambition of our next-generation mRNA vaccine is to meet three criteria: optimal safety and tolerability profile, stability at normal refrigerated temperature in profile syringe, and superior efficacy to existing vaccines. In this case, we do want to at least reach cutaneous protection beyond flu efficacy levels. In addition to these product features that are required to be commercially successful in flu prevention, we do believe that our leading commercial organization in flu will also be a key competitive advantage to leverage.\n\nOn my final slide, let me share with you the latest data on nirsevimab or Befor. First, the prespecified tool analysis presented at SP 2022 Congress showed statistically significant efficacy of 79.5% for the primary endpoint and 77.3% reduction in hospitalization. Second, you may recall that our pivotal MELODY trial read out early as the study had accrued sufficient number of cases. After blaming the data, the study continued to recruit up to the 3,000 babies initially planned, and I'm glad to share today the results about the entire enrolled population: 76.4% efficacy compared to placebo, 76.8 reduction of RSV associated hospitalization and the safety and tolerability comparable to placebo.\n\nThese study results were presented at ACIP meeting last week. Of note, ACIP also requested an analysis pulling the two data sets on this slide, and it showed a 80.6% efficacy against medically attended LRTIs, including hospitalization. I invite you to look at the ACIP website to get more details about this data. Overall, the consistency of the efficacy data was hospitalization reduction and safety numbers that we at across all pivotal studies speak to the strength of the product, and these results reinforce the public value Befor can provide against the first cause of hospitalization in infant.\n\nI'm thrilled by the progress made. With the recent CHMP positive opinion and the U.S. FDA filing acceptance expected in Q4, we do look forward to bringing the first RSV immunization available to all infants next season. Let me now hand over the call to Olivier.\n\nOlivier Charmeil -- Executive Vice President, General Medicines\n\nThank you, Thomas. Moving now to general medicine on Slide 21. The execution of our strategy with a focus on core assets continues to deliver. This core portfolio grew 2.4% in the third quarter.\n\nExcluding Lovenox that is affected by a market decline following high demand during COVID, the portfolio grew 11%. Total general medicine sales decreased 8.5% to 3.4 -- EUR 3.5 billion in Q3. This was mainly driven by the performance of the noncore assets that were down 12.8%. As we outlined in early 2021, we have down prioritized this part of the business and dramatically reduced the promotion behind those assets.\n\nIn Q3, the anticipated China DBP impact on Lantus contributed negatively on top. Total margin sales, which include launches and Toujeo, were down 31.6% in Q3 due to launches while with three strong uptake of Toujeo. Product divestitures, which are key to our ongoing strategy streamlining efforts, had an impact of minus 1.8 percentage points on the noncore asset performance in Q3. Adjusting for the impact of divestitures and the deconsolidation of Euroapi third-party sales, gen med sales decreased 4.1%.\n\nOn Slide 22, I'd like to focus on the performance of our core assets in the third quarter. Toujeo sales were up 17.2% driven by Europe and the Rest of the World region. The strong performance of Toujeo in Rest of the World is mainly due to China. Our transplant franchise continued to deliver a strong performance.\n\nSales are driven by Rezurock as well as by the strong growth of Time globally. We are seeing robust adoption of Rezurock with more than 1,300 patients treated since launch. This corresponds to more than 30% of the current addressable market in the U.S. HCP and patient demand continue to be strong for Rezurock transplant centers across the U.S., showing the therapeutic unmet need for an effective and tolerable treatment option.\n\nIron sales grew by 34% in Q3 driven by continued growth in Europe as well as the ramp-up in China due to the inclusion in general since the beginning of the year. Plastic sales were slightly down in the third quarter. We saw some sales growth in China offset by mandatory price cuts in Japan at the beginning of April and lower sales in Europe. In conclusion, our performance in the first 9 months makes us confident to deliver this year, meet single-digit growth for our core assets and a slight decline of overall gen med sales, excluding Euroapi.\n\nWith that, I hand over the call to Julie.\n\nJulie van Ongevalle -- Executive Vice President, Consumer Healthcare\n\nThank you, Olivier. As you all know, robust consumer demand for health and wellness solutions has resulted in high pace growth even at rates above 2019 pre-COVID. Now in recent months, we have started to see growth moderation driven by a high base from last year's COVID vaccination and cough and cold boost and by a market exhibited science of tier economy and inflationary pressure. This is resulting in growth driven by price over volume.\n\nIn this context, our performance continues to outpace the market on a 12-month rolling basis. I am proud to highlight two achievements that demonstrate the excellence and continuity of our execution. The first is allergy, where we have constantly gained share over the past two years. Alegra, our largest global brand, is a key driver of our success in this category.\n\nStrong base and innovation performance, coupled with successful expansion into new geographies, has positioned Alegra as the largest growth contributor to the category worldwide. Notably, the brand has achieved a 10% market share in the U.K. in only nine months post launch. The second big achievement is digestive wellness.\n\nWe hold the No. 1 position globally in gastrointestinal plus probiotics subcategories and have outperformed the market for 15 consecutive months. On the next slide, I will highlight our performance in this category in the third quarter. But first, let me share with you our overall Q3 performance.\n\nOn the next slide. In Q3, our sales grew almost 2% and 3.5%, excluding the impact of divestments. This growth is on top of the strong third quarter last year driven by a post-COVID rebound in vaccination. Digestive wellness in cough and cold categories posted exceptional results, while allergy was down on the back of a mild season in the U.S.\n\nTurning to cough and cold. We continued to deliver strong performance with our largest cough brands, Mucosolvan and Mislan, that together grew over 40% versus prior year. A sustained strong season bolstered these Q3 results. Digestive wellness also delivered a standout performance in the period with the category growing across all regions.\n\nWe have several global digestive brands that are leaders within their segments and delivering growth. Just to name a few on the next page, I'm happy to share that Antero Germine has become No. 1 in probiotics, expanding to preventative use and to adult segments across key markets. Dulcolax is the No.\n\n1 nonprescriptive laxative, spurred by innovation in Chewy Bites and Sub Chews together with our successful communication campaign that is attracting new users by challenging the taboo associated with the category. Buscopan is the world's No. 1 nonprescription antispasmodic and IBS remedy and growing across all markets due to strong fundamentals and expansion into new segments in Latin America. Last is [Inaudible] the No.\n\n1 nonprescription liver and bile remedies brand worldwide and continues to outperform the market. This consistent momentum in performance is made possible by the tremendous work of our teams to set up an infrastructure that allows us to succeed. First, we are on track to establish our stand-alone set organization within Sanofi. All but two CHT legal entities are live as of today, and we are working now on the second phase of this stand-alone process, which consists of moving additional critical support functions under the CHC umbrella and build a fit-for-growth organization.\n\nAt the same time, we continue to simplify our portfolio, increasing our focus and as a result, gaining the agility that enables us to size opportunities. I am very proud of the enthusiasm and resilience of our teams, delivering while transforming in an increasingly challenging environment. With that, I'm handing it over to Jean-Baptiste, our CFO.\n\nJean-Baptiste de Chatillon -- Chief Financial Officer\n\nThank you very much. Thank you, Julie. A year ago, Sanofi planned to be carbon-neutral by 2030. On this journey, our priority is to reduce our GHG emissions as much as possible and to neutralize the residual emissions with carbon-offsetting projects.\n\nToday, almost 90% of our emissions are coming from our value chain, meaning our suppliers. Through our supplier program, we are working with them to reduce our emissions. Our offsetting programs are thus mainly designed to cover the residual emission of our suppliers, known also as Scope 3. We want our offsetting projects not only to capture carbon but also to have a positive impact on vulnerable communities.\n\nWe want a fully integrated ESG approach. On the delighted tenants, we have signed our first two carbon-offsetting programs with EcoAct. The projects highlighted on the slide will help us capturing carbon while improving leading and social conditions of local rural families in Kenya. On Slide 28, turning to our financial performance.\n\nCompany sales increased 9% at constant exchange rate in the third quarter driven by a remarkable performance of 20% growth in both Specialty Care and Vaccines. We said we would be improving on our gross margin, and we are delivering based on favorable portfolio shifts and savings. But given the macroeconomic environment, the pace is slowing down. We are committed to science, and our R&D spend increased during the quarter by close to 13% driven by some of our large fully recruited Phase 3 trials as well as our investment in the marine.\n\nSG&A was mainly driven by Specialty Care, the flu vaccine, and our digital infrastructure. Other operating income benefited from net gains from disposal of around EUR 125 million on the true-up for the increased Dupixent development balance, contributing to a BOI margin of 36% in the quarter. With an effective tax rate of 19% versus 21% in the same period last year, EPS grew 17.9% at constant exchange rates. Moving to Slide 29.\n\nOn taking a year-to-date view, sales grew 8.6%, and our BOI margin improved by 110 bps at constant exchange rate. R&D investment grew by close to 13% in the first nine months driven by our fully recruited estate trial as well by adding earlier assets on investing in our Emera center of excellence, as I mentioned. So on Slide 31, we have to achieve around 160 bps BOI margin improvement for the full year to reach the 30% target that we set in 2019. And in fact, we upgraded this target during the journey.\n\nWe upgraded it in 2020 by 100 bps when we sold our part in return on equity stake. With 110 bps achieved in the first nine months, a further step-up will be needed. On the top right, we are highlighting the main drivers of Q4 profitability. The main contributor would be Dupixent growth accretive to group BOI margin starting from this year, as pointed out before.\n\nOther contributing factors will be capital gains from planned divestitures, which we estimate to be around EUR 200 million for the remainder of the year. We will also deliver marketing and savings as part of our EUR 2.5 billion selling plant in Q4. On the other hand, some negative drivers to keep in mind are the flu vaccines phasing with close to 70% of planned orders per sales already shipped in Q3 on continued macroeconomic headwinds, such as increased cost of energy and transportation as well as labor costs. Getting to the last slide on the full year 2022 guidance.\n\nwe are upgrading our expectation on EPS growth to around 16% at constant exchange rate and foresee a positive currency impact of 9.5 to 10.5 based on October actual rates. In summary, it's another quarter of strong commercial and financial execution, leading to double-digit EPS growth. We laid out our strategy in 2019, and we are rigorous about delivering on it. We are fully on track to achieve our 30% BOI target and double-digit EPS growth in 2022.\n\nOur business fundamentals are strong. Risks are low compared to our peers' LOE. And of the six priority assets we picked in December '19, Dupixent is outperforming all expectations as Tuban Befor are getting ready to launch. We aspire to be a sustainable growth story.\n\nAnd for this, it takes some groundwork. The rich pipeline news flow that we expect in the next 18 months has a potential to identify more key assets that we will need for the growth mid- to long term. Let's open now the call to Q&A.\n\nEva Schaefer-Jansen\n\nThank you, Jean-Baptiste. So we will now open the call to your questions. [Operator instructions] So can we have the first question?\n\nOperator\n\nYes. The first question is from Graham Parry. Graham?\n\nGraham Parry -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks for taking my question. So the first one is just on the launches next year. So you just help us understand the speed of launch that you can expect from Finacea and amlitelimab next year.\n\nSo these products where you see -- you feel there's large awareness already, reimbursement will be straightforward, guideline committees likely to include quickly, and therefore, we could see a very rapid launch? Or is there quite a lot of building to be done on those? And then the second question is on the findings of the tolebrutinib Hepatic Assessment Committee. So if you could just perhaps detail what they were. I know that date is obviously now being filed back to FDA, and your own DMC seems satisfied with it. But perhaps you can just give us a little bit more color about what the conclusions of that committee were.\n\nThank you.\n\nPaul Hudson -- Chief Executive Officer\n\nThank you, Graham. We're going to call it Altuvio, Graham, from here on out. So thank you. That's a mouthful.\n\nAnd with Factor VIII Boinet, you can see in the brand name, so just trying to help out. I'm going to go to Bill, and then I'll go to Thomas to give you an update on loan trendiness and the likely sort of steepness of the upticks. So Bill?\n\nBill Sibold -- Executive Vice President-Sanofi Genzyme\n\nGreat. Thanks for the question, Graham. Look, we're really excited about AltuVIo. As you know, we are redefining efficacy in the hemophilia A space.\n\nI think this is something that the community is just starting to understand that rather than most of the wee only being hitting a maximum of being kind of mildly having mild hemophilia, we're offering something which gets you close to normal. So this is going to take some rethinking by the community, but they're excited. And as you heard in our ISTH presentation, the KOLs there, I think they both said they don't see a reason why every patient with hemophilia A who is on factor wouldn't be on Eluvia. And that's certainly the approach that we're taking, and that's the value proposition that we'll be offering to the community that you can achieve a new level of efficacy with a true weekly administration, which is something new.\n\nSo with that, we're very excited. It will take some education. We think that we'll be able to secure the appropriate reimbursement and so forth. But we have to work through the practicalities of patients coming back into the hemophilia treatment center, etc.\n\nBut we are going to be making the request to the community that they switch all patients on factor.\n\nPaul Hudson -- Chief Executive Officer\n\nI think that's pretty clear. And as we said -- I said in my comments, what worked against us with Hemlibra at the beginning will work for as these patients are searching for that normal life. And I think we're going to be well set. I was eyes ISTH to you.\n\nIt was really fabulous. And maybe we'll come to you, Thomas. What about guidelines going to play a role RSV outstanding efficacy? But how do you think the uptake is going to have?\n\nThomas Triomphe -- Executive Vice President, Sanofi Pasteur\n\nGreat question, Graham. Of course, we're very excited about the coming launch in 2023. And you know very well that there is currently very severe RSV season in the U.S. or in Europe.\n\nSo I think the timing for the first-ever intervention to prevent for infant RSV efficient is really due for newborns. In terms of dynamic for the coming launch, well, as you know, in the process for immunizations, we have to go through recommending bodies. Our expectations is that we expect in the U.S., for example, an ACIP recommendation in June 2023, which will enable us then to launch the product for the 2023 RSV season. So it's really going to be about the discussion with a different recommending bodies then recommendation, then launch.\n\nAnd of course, as always primition, you have a progressive ramp-up plan to fix is.\n\nPaul Hudson -- Chief Executive Officer\n\nAnd I've learned, Thomas, from you and others that once those guidelines move, things really move very fast. And I think that's quite interesting for us. So we look forward to that. It's great, but we're going to start with two launches, right? When was the last time we've had that opportunity to call on that and moving to perhaps what could be our third launch.\n\nBut John, maybe give an update.\n\nJohn Reed -- Executive Vice President, Global Head of Research and Development\n\nYes, Graham. The Hepatic Assessment Committee did meet several times and took a fine-toothed comb to the data. Their recommendation to the DMC was to continue to resume dosing in the countries that allow that, of course, with the appropriate monitoring. You'll recall that we did adjust the protocol for more frequent monitoring in the early couple of months.\n\nAnd so we did do that, and we've been back to enrolling outside the United States and a couple of other countries. So I'm pleased to say that in addition to the relapsing MS studies, both of those now fully recruited. And incidentally, we've had 97% retention of patients on those studies. So safety has been good.\n\nWe now are almost, very close, a couple of patients away, from having a secondary progressive MS study fully recruited as well.\n\nPaul Hudson -- Chief Executive Officer\n\nThanks, John.\n\nOperator\n\nThe next question will be from Wimal Kapadia from Bernstein. Wimal?\n\nWimal Kapadia -- AllianceBernstein -- Analyst\n\nGreat. [Technical difficulty]\n\nEva Schaefer-Jansen\n\nSorry, Wimal. Your connection is very bad. We cannot hear you.\n\nWimal Kapadia -- AllianceBernstein -- Analyst\n\nPlease. So annualizing --\n\nEva Schaefer-Jansen\n\nWimal, we can't hear you.\n\nPaul Hudson -- Chief Executive Officer\n\nYes. Vimal, we can't hear you. So you may have to reconnect.\n\nWimal Kapadia -- AllianceBernstein -- Analyst\n\nCan you hear me now?\n\nEva Schaefer-Jansen\n\nNo. We're going to park you. We're just going to move to the next question and come back to you if you connect again.\n\nPaul Hudson -- Chief Executive Officer\n\nWe'll find a way back to Wimal.\n\nOperator\n\nYes. So we'll take the next question from Richard Parkes from Exane BNP and come back to you, Wimal.\n\nRichard Parkes -- Exane BNP Paribas -- Analyst\n\nHi. Thanks very much for taking my questions. Just got a couple. I know you're not going to guide for 2023 yet, but I just wondered if you could talk about the pushes and pulls to margin performance next year.\n\nThere's been a fair amount of gains this year. So I wonder if that gets fully offset, if that turns to a headwind by operational efficiencies and leverage to see continued margin improvement next year. I know you're not going to guide. If you could just talk us through the moving parts there and your thinking in terms of prioritizing continued margin evolution versus reinvestment back in the business? And then secondly, just out of interest on Sarclisa, you flagged the good uptake there.\n\nI'm just wondering where you're seeing that use coming from. Is it in patients that have previously been exposed to Darzalex? And I'm wondering what the physician experience is in terms of the efficacy holding up in those patients. Thank you very much.\n\nPaul Hudson -- Chief Executive Officer\n\nOK. Thank you, Richard. Maybe Jean-Baptiste a moment for you not talk about 2023.\n\nJean-Baptiste de Chatillon -- Chief Financial Officer\n\nRichard, right guess, we are not guiding for '23 yet. But we are all in mind what it is about '23. We have the LOE so that everybody kind of parse. Everything is on the table.\n\nOur eyes are on '25 really, '25. We know what we have to deliver. And of course, in each choices we make, we always tend to privilege the R&D for value creation for the future. And that's our internal guidance on what guides us in all our choices.\n\nSo '25, on track. And we have this LOE. We will make all the choices, which allow us to create as much value as possible for the midterm.\n\nPaul Hudson -- Chief Executive Officer\n\nGreat. Thanks, J-B. Bill, a quick comment on Sarclisa.\n\nBill Sibold -- Executive Vice President-Sanofi Genzyme\n\nYes. No, thanks for the question. Look, we're seeing it in second and third line where it's indicated right now. These don't tend to be patients that have been exposed to Dara in the past.\n\nThese are actually -- physicians are making the choice based upon the really strong clinical profile that we see with Sarclisa. And just as you think about our IKEMA Phase 3 results, which was ESKD versus KD, we showed an unprecedented PFS of three years-plus in that study, and that's something which the community is starting to understand better. We think that each successive trial shows that we are emerging as perhaps the best in class. But physicians are making the choice to use it.\n\nPaul Hudson -- Chief Executive Officer\n\nThanks, Bill. And I think it was touched on earlier, Kennametal, but I think you touched on it, that getting into the earlier setting, getting into subcutaneous is really where we should see the breakthrough. But I think we have to say pleased with how things are going given where we started. So all went pretty good.\n\nOK, next question.\n\nOperator\n\nYes. Let's try again with Wimal Kapadia from Bernstein.\n\nWimal Kapadia -- AllianceBernstein -- Analyst\n\nCan you hear me now?\n\nEva Schaefer-Jansen\n\nYes.\n\nWimal Kapadia -- AllianceBernstein -- Analyst\n\nPerfect. OK. Thanks very much for coming. Thanks for coming back to me.\n\nSo two questions, please. So Dupi -- first on Dupi. It's annualizing at over EUR 9 billion. Paul, you mentioned potentially over EUR 10 billion next year.\n\nSo what's really stopping you coming out today and saying this is now at least a $15 billion drug -- EUR 15 billion drug ex COPD. I'm assuming internally, actually, you're assuming potentially higher numbers in the 13. So just curious how you think about that, Paul. And then my second question is just on some of the smaller catalysts over the next 18 months.\n\nWe know about fitusiran around the OX40, the CEACAM5. But if you had to point to two or three assets from the earlier immunology pipeline over the next 18 months that you highlighted on Slide 10, which do you think are the most interesting? So really, what I'm asking about is, is it rise, is it a CD40, is it a topical BTK, the TNF, IRAD 4, etc.? There's quite a lot there. So which one should we really be focused on?\n\nPaul Hudson -- Chief Executive Officer\n\nOK. Thank you, Wimal. We've announced a series of waypoints for Dupixent. We said back in '19, we'd go beyond 10.\n\nAnd we said earlier this year, I think it was that beyond 13. You know as well as I do, we don't get a ton of credit for trying to post a bow number, but we're being very disciplined about how we operate the launches. All these launches and all these countries are just truly incredible. And the eosinophilic esophagitis launch, for example, and recent setbacks for the competition, it is really truly incredible the number of prescribers.\n\nSo we're learning as we go, and I think it's just a really fabulous performance, an incredible drug. And to remind everybody, you know this, but there will be competition and the market needs to grow. But nobody competes with us across all of the diseases. No single competitor.\n\nSo the opportunity is significant. So when we feel it's necessary to do so, we'll share another waypoint. But I think we've been quite generous, communicating that will be -- that we hope to exceed EUR 10 billion in 2023. To your other point, there's quite a few exciting things going on really.\n\nAnd we've been very clear about -- with the Nanobody platform, for example, we're able to take quite a few shots and we shared some of the shots with you at the Immunology Day earlier this year. And some are going to be big successes and some will fail. And we're sort of learning that, but we're setting a high bar. We -- myself, I get quite bullish, but only bullish when we set a high bar and a target product profile and that it delivers.\n\nThat's what we're trying to do. That's what we continually try to do. And not all of the antibodies will work. But if I'm really happy with the progress, it be the IL-13 TSLP, for example, which I think could really -- that has the opportunity to raise the efficacy bar in asthma.\n\nI mean, how incredible would that be? We've talked a little over the last weeks and months about the oral T&F you've never been done. Can you imagine if we get the efficacy and we'll pick up proof-of-mechanism data in psoriasis in the first part of next year. And that's going to be really interesting. Again, I'm learning, for good or for bad, in this job that things, particularly early things, do fail.\n\nBut the number of shots on goal that are first and best is becoming really compelling. And I have a little bit of a -- how should I put it, like another sleeper would be I4. If we can get that through the finishing line and have two orals in this space, well, that would be pretty incredible too. And remember, we're really trying to grow these assets in the right way with the right level of understanding.\n\nAnd we're going to become the world's leading immunology company. So they're just a few. Jean-Baptiste?\n\nJean-Baptiste de Chatillon -- Chief Financial Officer\n\nI think I have to start to watch out on the speed at which we catch up on mRNA because there very attend so we have T vaccine coming up. So I'm quite excited also by those too.\n\nPaul Hudson -- Chief Executive Officer\n\nMy friendly neighborhood CFO loves vaccines, and you have figured out so far. An unscripted response from he has always said. Next question, please.\n\nOperator\n\nThe next question will be from Emily Field from Barclays.\n\nEmily Field -- Barclays -- Analyst\n\nHi. Thanks for taking my question. I had a question on Sarclisa, just on the subcutaneous study. If that were to be successful and then we also saw a success with the MRAS study in '23, would you be able to move that formulation into earlier lines of therapy? And does the subcutaneous formulation extend the IP at all? And then just secondly on Dupixent, is there any updates on the implementation of the new manufacturing process? Should we still expect that to be coming through in 2024? Thank you.\n\nPaul Hudson -- Chief Executive Officer\n\nOK. So two questions. And Sarclisa, subcutaneous and Imrestor conversions of that, could we go -- and how does that look, maybe I'll start with you, Bill, if you want to.\n\nBill Sibold -- Executive Vice President-Sanofi Genzyme\n\nSure. No. Thanks for the question. Look, it's the same formulation for the subcutaneous.\n\nAnd this is a device which the community is actually really excited about. And feedback from investigators so far, there's been a lot of interest in participating in the trial, a lot of anticipation about the benefit that it offers. It's a very simple. Patient puts it on their skin.\n\nAnd over the course of 10, 20 minutes, whatever, it slowly gives you an injection. And so far, satisfaction has been great, what we've seen. And we're looking forward to the results. And those will get closer and closer now to those MROs readouts.\n\nPaul Hudson -- Chief Executive Officer\n\nIt's funny as well because I think -- I would agree with you, Bill. When we first started working together, we met KOLs talked about Sarclisa, they really are impressed by it. They think it's quite unique. But to be honest, you have to be in early lines and you have to be subcutaneous.\n\nI think when J-B talked about how we're managing the R&D spend, it was also one of our -- it's going to la bit of work to partner for a low royalty to be able to take the risk with, in this case, Blackstone to get that subcutaneous there while not having an opportunity cost on the rest of our pipeline. So a really nice word really, to be honest. And it's one of the things that could really come a little bit later and quite strongly for us. I don't know, Brendan, on do you want to add to Emily's question around the Dupi process.\n\nBill Sibold -- Executive Vice President-Sanofi Genzyme\n\nYes. Sure. Happy to update that we've had approved for the new process in the U.S. and in Europe in Q3.\n\nAnd we're expecting expanded approval for additional sites manufacturing in that process later in Q4 as well. So we're in good shape to expand the rollout of that new formulation coming in 2024.\n\nPaul Hudson -- Chief Executive Officer\n\nOK. Great. Thank you.\n\nOperator\n\nThe next question will be from Peter Welford from Jefferies. Peter?\n\nPeter Welford -- Jefferies -- Analyst\n\nHi. Thanks for taking my questions. The one actually, just going back to Sarclisa again. Just curious on the MRO Phase 3.\n\nDid that study pass an interim analysis, and therefore, now read on into second half '23? Or is it just a slowing of the event rate that's resulted in that? And equally, any plans to initiate any other combination studies in the earlier-line settings? And then just the second question is just more broadly on business development. Wonder if you can give us your updated thoughts in terms of what's happened with valuations and expectations in the biotech sector for management there. We've seen a couple of deals from other companies come through, particularly what you're thinking is now with regards to pipeline assets versus, on the other hand, deals that have perhaps more near-term financial benefits for Sanofi, particularly potentially diversifying growth drivers of profit streams. Thank you.\n\nPaul Hudson -- Chief Executive Officer\n\nOK. Thank you. It's nice to get some questions on Sarclisa, to be honest. But John, do you want to add something, early combinations and other expectations.\n\nJohn Reed -- Executive Vice President, Global Head of Research and Development\n\nYes. So first on the MROs indeed, we -- there was a look at the data at the DMC. We -- their recommendation was to continue moving the study forward. The health authorities, too, have been recommending that we not get too serious about unwinding until we've had about 75% of advanced member, it's a event-driven study.\n\nSo we're chugging along and expecting some more insights to the next year delivery unfolds. On the early side, yes, we are gearing up. You'll probably be seeing some new things in the near future with other early combos with Sarclisa. I guess I would only hint that you'll notice that we're doing a lot in the NK, natural killer, space.\n\nAnd that's a good combo partner for Sarclisa because it's an ADCC-competent antibody, antibody-dependent cellular cytotoxicity and a lot of media via the NK cells. So that's a nice opportunity for us to try to bring some of our portfolio together around Sarclisa and exploit that mechanism in that biology.\n\nPaul Hudson -- Chief Executive Officer\n\nI think as well, we looked at Sarclisa early on and certainly when we get through the prioritization exercise in 2019. And we knew there were other options for a higher, if you like, level of breakout performance. But three years later, as the data matures and the meta subcutaneous in combination opportunities present themselves, you start to realize that this medicine that's already doing very well could really do something significant. It's worth a deeper dive maybe at an R&D Day or beyond over the then we may get to that.\n\nAs for biotech, valuations or things, I don't know whether Jean-Baptiste, you want to just make a quick comment?\n\nJean-Baptiste de Chatillon -- Chief Financial Officer\n\nYes. Well, as we commented before, we are not opportunistic on that front. We really look at the interesting value of the deals we are looking at. And we do think that to fuel our pipeline, where it has to be in terms of number of shot on goal, it's a mix.\n\nIt's a mix of our internal work, BD, M&A. So yes, we don't think to do otherwise what we declared in December '19 on go on that route, which is always a bumpy road when you aim for best in class, first in class. But that's where we are on whatever the valuations are, we are counting and looking with the team what could be done.\n\nPaul Hudson -- Chief Executive Officer\n\nThank you. OK. Next question.\n\nOperator\n\nThe next question will be from David Risinger from SVB Leerink.\n\nDavid Risinger -- SVB Leerink Partners -- Analyst\n\nYes. Thanks so much. Can you hear me?\n\nPaul Hudson -- Chief Executive Officer\n\nYep.\n\nDavid Risinger -- SVB Leerink Partners -- Analyst\n\nGreat. So congrats on the performance. I have two questions, please. First, could you discuss your corporate governance strategy as it relates to U.S.\n\nproduct liability litigation, Specifically, the company's corporate responsibility not to issue financial payments to plaintiffs when it's unknown what causes cancer? Even if local juries come to the wrong conclusion, one would think state appellate courts are unlikely to conclude that Xantec caused a specific individual's cancer. And my second question is -- could you provide some more clarity on the yet to be realized cost efficiencies in coming years that will help offset the U.S. Obagi patent cliff? Thank you.\n\nPaul Hudson -- Chief Executive Officer\n\nThank you. Well, David, thank you for the congratulations. By way of starting off, I appreciate it. J-B, maybe I could just throw you -- because we've shared quite a bit that the LOE -- last major LOEs of ag in '23.\n\nWe have perhaps the least exposure versus the other big pharma companies through the rest of the decade, great. But we still have to work hard to improve our operational efficiencies to make sure we can cover that as much of that as possible. Any comments on productivity gains.\n\nJean-Baptiste de Chatillon -- Chief Financial Officer\n\nYes. First -- well, my first look is always at the top line. Can we get it -- some more from it? And so that's the first aspect. And you see that the commercial dynamic we are in for the last quarter nine quarters now is quite demonstrative of the know-how and the skill within the teams.\n\nSo that's the first bit. Then everybody knows about only you have to add up some headwinds from the context, of course, that will impact us. So we have not declared anything specific around the cost, but it's really about being selective on the priorities. Yes, we will push on it.\n\nYou know that we will -- before year end, we will be certainly slightly ahead of our EUR 2.5 billion plan. But it's a real endless job. So we will go on fighting against those headwinds. So -- with always one focus, top line to help because that's a big driver.\n\nBut we will not destroy future value for short term. So our R&D spend will be steady.\n\nPaul Hudson -- Chief Executive Officer\n\nDavid, as to your other question, I mean, I'll throw it to GC in a moment. We -- I think I understood it. It was quite a sort of interwoven question. Just as the first response, I will tell you that we'll take a deeper look at it and get back to.\n\nSecondly, we don't really get drawn into debates about legal strategies and different things. There's plenty of things that can happen. But I don't know whether, Roy, you'd like to add something.\n\nRoy Papatheodorou -- Executive Vice President, General Counsel\n\nI think we believe in the strength of our case. If you talk about general policies on how we deal with these cases, I will remind people that we've said that now settlement payments have been made, and we feel very strongly about the case. I think that's all you really need to know at this stage.\n\nPaul Hudson -- Chief Executive Officer\n\nThank you, Roy. OK. Next question.\n\nOperator\n\nYes. The next question will be from Jo Walton from Credit Suisse. Jo?\n\nPaul Hudson -- Chief Executive Officer\n\nJoe Walton? We never [Inaudible] with Jo.\n\nJo Walton -- Credit Suisse -- Analyst\n\nCan you hear me? Can you hear me now?\n\nPaul Hudson -- Chief Executive Officer\n\nYes. We got you, Jo. We got you.\n\nJo Walton -- Credit Suisse -- Analyst\n\nThank you. I would like to margin going forward. You've done very well in 2022, but you've told us that you're only going to go to a 32% margin by 2025. Can I just confirm that all of the extra sales above whatever it is that you're expecting, you're going to reinvest to really keep that margin only at about 32% so that we are likely to see most of the growth that we are going to see over the next few years really driven by the top line? And within the margin, can you confirm -- I would assume that you're going to have quite high marketing costs to ensure that your two new products for next year get a really good send-off.\n\nYou're spending at a high rate on R&D. So are we expecting to see a gross margin uplift and maybe some higher sales as we stay at that 32% margin for '22? And could I just also ask for an update on your consumer business and the Rx-to-OTC switches? Are those studies still on track so that you could consider a next step in the '24-'25 time frame for consumer? Thank you.\n\nPaul Hudson -- Chief Executive Officer\n\nOK. Jo, thank you so much. J-B, I mean, do you want to start us off on the margin question?\n\nJean-Baptiste de Chatillon -- Chief Financial Officer\n\nWell, I feel a bit impressed by the solid ask. So the big frozen. Well, I think you capture certainly the spirit. We are effectively one of the few solar company with a very secured and derisked top line growth for the next years.\n\nAnd that's a fundamental piece of our story. I mean we certainly have that well in mind. And from this growth of the top line, we are aiming to really fuel the post '28 growth story of Sanofi by investing in R&D. So this is a very simple and short story.\n\nSo it's not about being some saying that we will not do better than 22. It's not about this, but it's about being true to our commitment to innovative medicine.\n\nPaul Hudson -- Chief Executive Officer\n\nYes. I think -- thanks. Look, we know the commitments we put out there. We think we can create more value, but we reserve the right to toggle between how we deploy that.\n\nI think that's very fair. And I'm glad you're looking at it that way, frankly, because that's why we chose BOI in the first place. We want the opportunity, if we think we can create more value or density differently. So Julie, how the switch is progressing?\n\nJulie van Ongevalle -- Executive Vice President, Consumer Healthcare\n\nSo as I shared in the last quarter, on both switches, actually, we're continuously working with the FDA and have submitted for Cialis a proposed plan in order to proceed toward our AUC. We are currently actually waiting for the FDA's feedback on all the components of our proposal, so to be continued as soon as they come back to us. And for Tamiflu, we have no update on timing right now. Again, here again, we're working with the FDA to gain alignment on key studies that the FDA is requiring.\n\nAnd of course, also -- I mean there's many factors that are impacting because it may -- that may in fans because of the flu season is number one. And of course, we continue to watch the flu season as it develops. But we're also following the evolving at-home diagnostic space and the emergence of the test-and-treat consumer behavior of any implications for influenza or switch. So we're still on it.\n\nPaul Hudson -- Chief Executive Officer\n\nThanks, Julie. Thank you. Actually, I should have made it part just before we get to the next question that because Jo asked about execution of the launches, you mentioned them. And Jo, I just want to add that while we've been building out the pipeline, I think we are building credibility on how we execute and certainly commercially as a company, whether it's Rezurock, whether it's Dupixent, whether it's our vaccine performance.\n\nWe're really, I think, really very good at executing. And I think -- I would hope that all of you that watch us so closely understand how that will carry over into these launches. We have -- we know how to do this. And you know with our track record, we will know how to get this done.\n\nSo I don't want to leave any uncertainty around that. That's why it's exciting. That's why for us to be able to talk about two launches next year is big because no stone is left unturned, I can assure you. OK.\n\nNext question.\n\nOperator\n\nNext question from Tim Anderson from Wolfe. Tim?\n\nPaul Hudson -- Chief Executive Officer\n\nTim, do we have you?\n\nOperator\n\nTim, you have to unmute.\n\nBrian Lau -- Wolfe Research -- Analyst\n\nSorry. This is Brian on for Tim. Just two quick questions from us. First one on Dupi.\n\nCurrently, 75% of sales are coming from U.S. It's holding steady for the last couple of quarters. As you think about the long-term guidance of at least EUR 13 billion. As other indications mature and expand, what percent of mix does that look like? And then one on CHC.\n\nWe have been assuming at some point, possibly soon, you turn over the CHC spin card, meaning you do what GSK did recently and spin that out or otherwise divest it. But if there are plans to do anything near term, I have to imagine those get put on ice because of those antac litigation?\n\nPaul Hudson -- Chief Executive Officer\n\nOK. Sorry. The -- so a couple of things. So to you in a moment, Julie, maybe I'll make a comment.\n\nBut first, Bill, dupi. I don't think we share the split, to be honest. But do you want to -- do you have any comments on that?\n\nBill Sibold -- Executive Vice President-Sanofi Genzyme\n\nSo I mean -- thanks for the question, first of all, Brian. The thing to keep in mind with Dupixent is this pace, I think, gets lost. I think Paul talked about the execution a few minutes ago. We have five indications, four age expansions, and we're now in three therapeutic areas in five years.\n\nIt's actually -- it's pretty remarkable. And the reason why I set it up with that, Brian, is because the U.S. is usually the first to get those approvals and enjoy that expansion of the market. As we've seen with all the other indications, globally, they will roll out in time as well.\n\nSo that's why you're having a little bit of a weighting toward the U.S. Over time, we expect it to fall more in the balance of typical biologics in the immunology space.\n\nPaul Hudson -- Chief Executive Officer\n\nYes. It's -- I think that's spot on because we see the rolling reimbursement ex U.S. just takes longer, but it comes strongly and it always comes with good timing, to be honest. And then -- and of course, we've been on lockdown in China.\n\nAnd I don't think we shared the China-specific performance, but it's -- given the pressure that's been on just society, how fast patients are returning to see derms is pretty phenomenal. So there's a lot to come at income. For CHC, just to maybe just take it in two parts, just quickly and then feel free, J-B, to add if you want to, Julie. The -- we said in '19, and I think we were right, which is this business was struggling, wrapped up in a pharma governance and time line.\n\nAnd I think Julie has demonstrated her leadership of her team have demonstrated that by simplifying and by standing it up on its own, we have -- it has been completely turned around. There's work to do. There's other things to look at, but a really phenomenal performance. And that was our goal.\n\nThat was our goal. And that's pretty much the -- how we felt at the time and how we feel today. At the Zantac piece, I'm not going to try and cover those things, but you've heard already from our GC, you've heard from him. Zantac does not influence decision-making across anywhere across our business.\n\nWe believe in where we're at. So anything to add now. OK. Next question.\n\nOperator\n\nYes. The next question will be from Luisa Hector from Berenberg.\n\nLuisa Hector -- Berenberg Capital Markets -- Analyst\n\nHi there. Thank you for taking my question. I wanted to get into some of the immunology pipeline. I see a little bit of progress there, but maybe to start with the OX40.\n\nSo you've now got the 2 Phase 2bs running in AD and asthma. Do you maybe just discuss the potential target profile in each setting? And update us on your filing time line here. I seem to recall it an intention to run a Phase 3 concurrently, so then you would potentially be filing on a Phase 2b and a Phase 3. Is that still the plan? Or would this happen at the end of Phase 2b, you make the decision on the Phase 3 entries? Thank you.\n\nPaul Hudson -- Chief Executive Officer\n\nMaybe, John, do you want to do time lines and AD announcement? I don't know if, Bill, you want to talk about TPP. But John, you first.\n\nJohn Reed -- Executive Vice President, Global Head of Research and Development\n\nYes. So amlitelimab, as you mentioned, we're pursuing it very aggressively in AD. The Phase 2b study is fully enrolled now. We'll have the data next year.\n\nAnd we are exploring a number of schedules, and we'll learn a lot from that Phase 2b. There was a hint of disease-modifying activity in the early data that Kymab generated where even after ceasing the drug, the patient's skin remained clear for several months. So we're looking at various durations of dosing and various ways that we can really flesh out that TPP for the future. The asthma study is just underway, and so it's difficult to make a lot of prognostications about that yet.\n\nWith respect to the Phase 3 indeed, we had helped to go in an accelerated way from a seamless Phase 2/Phase 3, but every health authority that we spoke with really recommended or even mandated that we deliver the Phase 2 package first and then launch into Phase 3. So that's where we sit right now. And really looking forward to those Phase 2b, really a nice robust study there in AD to help inform the best design on that Phase 3 program.\n\nPaul Hudson -- Chief Executive Officer\n\nYes. I mean I would have added deal fully lag and, but I think it was referencing the question when I was asked what I was excited about. It could be an absolutely fabulous molecule. I think we've hinted that we might try and go for an earlier strategy and partly because we thought we had a way to 2-, 3-plus looking where the competition is.\n\nBut I think we must also remember that we had a full look at the entire landscape before we acquired this. And the ligand was considered to be the best approach, OX40-Ligand rather than OX40. And so we feel, I think that getting it right is the priority. And so we won't lose any time in the competitive set.\n\nAnd I think that's good for us. Bill, TPP itself, I mean, would you like to add something?\n\nBill Sibold -- Executive Vice President-Sanofi Genzyme\n\nYes. Look, I think because of its targeting higher up in the immune cascade, we're hoping for a long and durable efficacy with the potential of extended dosing. So that's something which we think is kind of a next level of target product profile for the community where they can have the high levels of efficacy, some of -- mostly, which is established at this point but to have that longer-term durability. And who knows, we can even look to see if there's any kind of disease modification for the future.\n\nPaul Hudson -- Chief Executive Officer\n\nYes. Well, I mean, we're maybe -- it's interesting. Rita has been the holy grail for a long time in drug-free remission, disease-free remission, maybe longer and longer, longer intervals. So this ambition to be the world's leading immunology company -- we have Dupixent, which is simply incredible.\n\nBut making sure that we have all of the other important tools for physicians and patients, it's starting to mature a little bit. We wait with every data set. Again, always learning myself about the -- you can be proven wrong. But at the same time, if you're really on the right track, the bar we're setting for ourselves on really having winning assets is much higher than it's ever been before.\n\nAnd that becomes much more relevant the further we go. OK. We're taking another question.\n\nOperator\n\nYes. Next question is from Richard Vosser from J.P. Morgan. Richard?\n\nRichard Vosser -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks for taking my questions. Two vaccine ones, please. Firstly, just going on to the flu vaccine.\n\nHow are you seeing the uptake of the vaccine? Obviously, clearly excellent deliveries. But we're seeing the uptake of COVID vaccines through the floor this year in terms of penetration in the above 65. So are you seeing any reticence around flu vaccine? And therefore, what's the risk of high returns hitting your sales this year in Q4? And then the second question, and I'm going to duck pronouncing the new name for nirsevimab as well. Nirsevimab, how's supply on the antibody? Can you supply the entire U.S.\n\nbirth cohort in '23? Do you have enough supply for that? And maybe just thinking about the positive ACIP, why wouldn't everyone for that RSV season, given there's a value this year, take advantage next year? Thanks.\n\nPaul Hudson -- Chief Executive Officer\n\nOK. Tom, as some great questions. I had my own Sanofi flu shot, so I'm contributing. So let's go -- so where do you think about the flu season? And what do you think about Befor will we be ready for the entire birth cohort in '23?\n\nThomas Triomphe -- Executive Vice President, Sanofi Pasteur\n\nGreat questions, which I'll start with the second one, and I love the way you phrased the question. Why not every single U.S. parent will make sure that their newborns protected with. I agree with you, why not.\n\nAnd definitely, with our partner, we are making sure to be ready for that. So our goal is to get a strong U.S. ACIP recommendation because simply, we believe that's the best way to prevent every single, as much as possible, hospitalization from newborn. It's No.\n\n1 cause of hospitalization. 80% of those can be avoided year one, which means it's cost-saving year one. So definitely, we're preparing for a strong U.S. ACIP recommendation with our partner.\n\nOn the -- your first question, which is about flu. It's always a little bit of a crystal ball thinking on where we're going on the flu take. We're only, as you know, were in October. But maybe a couple of points.\n\nThere's always a different dynamic and a different timing in terms of flu vaccination between Europe and North America. It's early, but the early indication is that I would say in Europe, we are seeing the flu vaccination ramp up similar this year versus last year. In North America, I think that you're kind of indicating something, that seems to be right. There's a bit of a soft demand for the moment.\n\nAnd you've noticed some vaccination fitting into COVID-19 boosters. But again, it's a bit too early because at this stage today, we are in a situation where the flu disease has not struck in most of these areas. And I remind you that overall, our returns are always taken into account and the provision for when we're giving you the 70-30 indication for Q3-Q4. So that's already included in our assumptions.\n\nPaul Hudson -- Chief Executive Officer\n\nOK. Thank you. Maybe we have the last question, if that's possible.\n\nOperator\n\nLast question from Keyur Parekh from Goldman. Keyur?\n\nKeyur Parekh -- Goldman Sachs -- Analyst\n\nGood afternoon. Two questions, please, if I may. The first one, kind of strategically for you, Paul. You had a couple of disappointments on the oncology pipeline recently.\n\nHow important is oncology as a therapeutic area of focus for you guys going forward? Or is it a scenario where given all the optionalities you have on the immunology side, that kind of takes a lot more importance and your return profile on those assets is meaningfully higher on a risk-adjusted basis compared to oncology? That's question number one. And then separately, on the flu vaccine side, as we look at 2023, how should we think about increased capacity on one hand versus your ability to further push kind of the high-dose flu vaccine in the ex U.S. markets? Thank you.\n\nPaul Hudson -- Chief Executive Officer\n\nThank you, Keyur. And maybe we'll start with Vaccines.\n\nThomas Triomphe -- Executive Vice President, Sanofi Pasteur\n\nWhen it comes to -- thanks for the question, if I understood correctly, 2023 northerner potential demand from Fluzone high-dose what did we mean on our supply. What I was trying to allude to during the slide presentation, we've been doing significant investment over the past two year to ensure that both the overall supply was there by investing into Swiftwater plant. So we're looking forward, very strong with that. In parallel to that, we're going to be also in a position from next year onwards to do fill and pack of Fluzone high-dose for Europe in Europe.\n\nSo we're really expanding our ability of flu protection with Fluzone high-dose. So we're really looking forward there, and supply will not be in.\n\nPaul Hudson -- Chief Executive Officer\n\nThank you, Thomas. So our oncology questions, a couple of parts of it. We've talked about Sarclisa a little bit. We think that can play a part.\n\nYou know that, but we're fully deployed around it. So it's really waiting for data. We have the IL-2, which we're going for an intensified dosing interval, and let's see if we can get there. We lost a competitor, of course.\n\nAnd so it gets a bit more interesting for us, but we still have to show efficacy. And so while the pathway has proven, we've got to thread that needle. And I think it's the right thing for us to do to step back and change the dosing schedule. We pretty much followed the competition, by the way, for speed.\n\nBut at this point, it's about where we think we'd get the best result. And that will be unique. And that's an important thing for me to say, same with toSumitomab because that also will be unique, and we don't know until we turn the cards over. So why do I tee it up that way? Probably because we have some really interesting cars to turn over on an IL-2 and on CEACAM5.\n\nIf they turn over well, that will be great, and we'll double down on what we need to do. But if they don't, then of course, we'll just take a pause. We've spent a lot of time with the leadership team and in R&D, looking at our early onco pipeline, really focusing around NK and other approaches. We think we can be much more efficient with our investments to not trans fast follow in late drugs coming much -- sorry, almost ready for launch or paying large premiums to participate.\n\nI think we like the idea of going earlier and highly differentiated. So we'll turn the cards over on these things. Why would we make that choice? Well, of course, because there's always an opportunity cost. And for us, in immunology, we have to be resourced to win, hands down.\n\nSo we'll take the opportunity to be thoughtful in late oncology, be demanding and ambitious in early oncology and take every shot in immunology. And I think that's how we feel about it. And we've -- we're aligned as a team on that. I think that's going to bring us to a close.\n\nI just want to say, I'm very proud of the performance in Q3. I think we did an excellent job. I think the strategy is coming together. The science is maturing.\n\nI hate losing and I hate failing, and it's just how I'm wired. But the most important thing is that we're taking really important shots scientifically. So while it takes a little while, I think we're bringing two of those medicines in '23 forward. That's very important for us because we know how to execute the hell out of things.\n\nSo I'm really pleased with where we sit as an organization and we're in good shape, and we look forward to closing out the year strongly. So thank you to everybody for your time today.\n\nEva Schaefer-Jansen\n\nThank you very much. And with this, we end the call for today.\n\nDuration: 0 minutes\n\nEva Schaefer-Jansen\n\nPaul Hudson -- Chief Executive Officer\n\nBill Sibold -- Executive Vice President-Sanofi Genzyme\n\nThomas Triomphe -- Executive Vice President, Sanofi Pasteur\n\nOlivier Charmeil -- Executive Vice President, General Medicines\n\nJulie van Ongevalle -- Executive Vice President, Consumer Healthcare\n\nJean-Baptiste de Chatillon -- Chief Financial Officer\n\nGraham Parry -- Bank of America Merrill Lynch -- Analyst\n\nJohn Reed -- Executive Vice President, Global Head of Research and Development\n\nWimal Kapadia -- AllianceBernstein -- Analyst\n\nRichard Parkes -- Exane BNP Paribas -- Analyst\n\nEmily Field -- Barclays -- Analyst\n\nPeter Welford -- Jefferies -- Analyst\n\nDavid Risinger -- SVB Leerink Partners -- Analyst\n\nRoy Papatheodorou -- Executive Vice President, General Counsel\n\nJo Walton -- Credit Suisse -- Analyst\n\nBrian Lau -- Wolfe Research -- Analyst\n\nLuisa Hector -- Berenberg Capital Markets -- Analyst\n\nRichard Vosser -- JPMorgan Chase and Company -- Analyst\n\nKeyur Parekh -- Goldman Sachs -- Analyst\n\nMore SNY analysis\n\nAll earnings call transcripts"
}