{
  "companyName": "OrganiGram Holdings",
  "companyTicker": "OGI",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/30/organigram-holdings-ogi-q4-2022-earnings-call-tran/",
  "content": "OrganiGram Holdings (OGI 6.42%)\nQ4 2022 Earnings Call\nNov 29, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning. My name is Rob, and I will be your conference operator today. At this time, I would like to welcome everyone to the Organigram Holdings fourth quarter and full year fiscal 2022 earnings conference call. [Operator instructions] Craig MacPhail, you may begin your conference.\n\nCraig MacPhail -- Group Director, National Capital Markets\n\nThank you, and good morning, everyone. Before we start, I would like to remind everyone that today's call will include estimates and other forward-looking information from which the company's actual results could differ. Please review the cautionary language in today's press release on various factors, assumptions, and risks that could cause our actual results to differ, further, reference we made to certain non-IFRS measures during this call, including adjusted EBITDA and adjusted gross margin. These measures do not have any standardized meaning under IFRS.\n\nOur approach to calculating these measures may differ from other issuers, so these measures may not be directly comparable. Please see today's earnings report for more information about these measures. Listeners should also be aware that making certain statements relating to market share data. The company relies on reputable third-party providers.\n\nUnless otherwise indicated, all references to market data are sourced from Hifyre data as of August 31, 2022, pulled on October 18, 2022. I would now like to introduce Beena Goldenberg, chief executive officer of Organigram Holdings Inc. Please go ahead Ms. Goldenberg.\n\nBeena Goldenberg -- Chief Executive Officer\n\nThank you, and good morning, everyone. With me is Derrick West, our chief financial officer. For today's call, we'll discuss the financial results for the three months and year ended August 31, 2022, and I will provide a general business update. We will then open the call for questions.\n\nNow, I joined Organigram in September of 2021. And at the time, I said, what attracted me to the company was its high-quality products, strong brand portfolio, and proven ability to innovate to meet consumer needs. This was bolstered by a strong sales team to get products into distribution and efficient operations that would enable us to compete in the large value segment. I'm happy to report that, in fiscal 2022, those strengths proved to be significant and resulted in success on several fronts.\n\nIn fiscal '22, we generated net revenue of $146 million, an 84% increase over fiscal '21. In Q4, our net revenue was $45.5 million, an 83% increase over Q4 '21, and our sixth consecutive quarter of record revenue growth. We also became adjusted EBITDA positive in Q2 of this year and have delivered three consecutive quarters of positive earnings. Our share of the adult recreational market grew to 8.2% in Q4 fiscal 2022 from 7% in Q4 '21.\n\nFor the month of October 2022, we held the No. 2 position in terms of market share. According to Hifyre, Organigram was the only top five LP to grow market share in our fiscal 2022. At the end of our fiscal year, we held the No.\n\n1 position in the flower category, which represents the largest portion of the adult recreational market. Also, according to provincial board data, since January, we held the No. 1 position in Ontario in ship sales with a Q4 market share of 8.8% and in The Maritimes with a 14% share in Q4. In Quebec, we moved into the No.\n\n3 position in September, as shown by data from Weedcrawler. We have built SHRED into a recognized brand across multiple categories, milled flower, gummies, and vapes. It is one of the biggest brands in the country with over $150 million in retail sales. SHRED also has a solid net promoter score of 77%, according to Brightfield based on field surveys from August 4th to September 27th.\n\nWe continue to hold the No. 3 position in the gummies category. This includes SHRED'ems and Monjour CBD-infused gummies, and are the No. 2 in terms of volume sold.\n\nIn Q4, we had a 24.3% volume market share, which means that close to one out of every four gummies sold in Canada was an Organigram product. In fiscal 2022, we introduced over 60 new SKUs to the market to refresh and optimize our product offering. These new SKUs represented about 30% of our sales in the year, which speaks to our ability to not only innovate but to create products that engage consumers. In Ontario, we have the highest average sales per SKU, which is more than double the average of the top 10 LPs, showing the efficiency of our line-up.\n\nA great example of innovation is our ingestible extract, Edison JOLTS. We introduced JOLTS in August 2021 using proprietary IP, and it quickly took the second position in the capsules category. There are now three flavors in the JOLTS lineup, and it holds a 26% market share. In fiscal 2022, we also launched our Monjour wellness-focused brand.\n\nIt was the first large-format and multi-flavor offering in the space and quickly gained share. It is now the No. 1 selling pure CBD gummy with a 37% share. We continue to innovate with Monjour by adding new flavors and other minor cannabinoids into our formulations.\n\nWe have also been successful at innovating in the value segment. Big Bag O' Buds was introduced in May '21 in the 28 gram format. It was unique in offering quality, high potency strains, not typically available on the value segment, such as Ultra Sour and GMO cookies. It was quickly embraced by consumers and received positive reviews on social media.\n\nNow, we did not have a presence serving the value segment in smaller-pack sizes, which accounts for over $300 million in retail sales. So, to address this, subsequent to quarter end, we introduced a new brand, Holy Mountain. Currently, we are in market with the strains R*ntz and MAC-1 in 3.5 gram formats, as well as pressed hash. I'd also like to talk about our success with acquisitions.\n\nCompared to the rest of the industry, we have taken a very prudent approach to acquiring companies. We look for those that will complement our product line and have the potential to be accretive to shareholder value. First was the edibles and infusions corporation based in Winnipeg, which we acquired in April '21. It was pre-revenue and pre-sales license but had a manufacturing facility purpose-built for cannabis-infused products with highly efficient state-of-the art equipment.\n\nThis provided us with a significant opportunity to disrupt the cannabis edible market in Canada. We launched three gummy SKUs in Q4 of 2021 and grew that to 14 SKUs by the end of 2022. The three original SKUs continued to grow in sales from Q1 to Q4 by 19%, which we brought new ones -- while we brought new ones to market, indicating that the new SKUs attracted new consumers and further built our market position. We have invested in additional automation at Winnipeg, including high-speed pouch packing lines and automated excise stamping.\n\nIn September of '21, we shipped 339,000 gummies. In October of '22, we shipped 3 million and have the capacity to increase further. In December, we purchased Laurentian Organics, a licensed producer of craft cannabis and hash, as well as giving us an important presence in Quebec. It was a successful operation with accretive revenue and EBITDA.\n\nWe have committed $13 million to expand the facility to increase its annual capacity to 2,400 kilograms of flower and over 2 million package units of hash. Construction is expected to be complete by the end of this calendar year. Our new Holy Mountain pressed hash is produced at this facility. We added Laurentian Tremblant hash to our national distribution, and it was available in 10 provinces in five month post close.\n\nIt has maintained its No. 1 position in the Quebec market and is now the No. 2 hash SKU in Canada. Also, a very important contemplated synergy, our new foothold in Quebec enabled significant growth of core Organigram SKUs in the province.\n\nIn fiscal 2022, we achieved a 50% increase in revenue per SKU. And as of September 2022, we increased the number of SKUs in market from 21 to 35. I'm also pleased with our production success of fiscal 2022. In Q4, we brought all the cultivation rooms in our 4C expansion at our Moncton Cultivation Center online.\n\nWe have 115 grow rooms available to us for the flowering period, which provides an annual growing capacity of 85,000 kilograms. We have also completed environmental enhancements at the facility with LED lighting in every room. This has resulted in an 11% increase in yield per plant, decreased power consumption per room, and a 21% reduction in the cost of cultivation. We have also introduced fractional watering.\n\nIt will be available in all rooms by the end of this calendar year and has already shown to create further improvements. The results of these efforts have been lower production costs, higher yields, and higher potency. In Q4 of fiscal '22, we had a record harvest of 16,000 kilos, 33% higher than Q4 of fiscal '21. And yield per plant was 141 grams compared to 127 grams a year earlier.\n\nIn fiscal 2022, the Center of Excellence formed as part of our product development collaboration with BAT completed all key spaces, including the R&D lab and the state-of-the-art biolab for advanced plant science research. As part of the development, the COE has undertaken initial stage development and safety studies on first generation edibles and novel beverages as part of its work. The COE has created and set numerous delivery systems and created over 60 unique formulations to develop differentiated products in the future. Another key strategic advantage for us is the dedicated cultivation R&D space.\n\nThis new space has accelerated rapid assessment and screening by delivering 20 to 30 unique cultivars every two months, while freeing up rooms for commercial growth. The plant science team continues to move the garden toward unique, high terpenes, and high THC in-house grown cultivars, while also leveraging the newly commissioned biolab for ongoing plant science innovation. Their focus is on quality, potency, and disease resistance to enrich the future flower pipeline. In fiscal 2022, Organigram established a significant position as an international supplier of cannabis.\n\nWe shipped a total of $15.4 million of flowers to Canndoc in Israel, and Medcan and Cannatrek in Australia. This compares to the 351,000 of international sales in fiscal 2021. To-date, this fiscal year, we have shipped approximately $6 million of dry flower internationally. With our expanded capacity at Moncton, we expect to increase our revenue from international sales.\n\nOn November 17, we entered into a new agreement with Canndoc in Israel. This new agreement over a three-year supply term allows for the shipments of 10,000 kilograms of dry flower with an option for Canndoc to order an additional 10,000 kilograms. This agreement speaks to the consistently high quality of our flower and our strong relationship with Canndoc and allows us to collaborate in the future on other emerging medical cannabis markets in [Technical Difficulty]. I will now turn it over to Derrick to present the financial overview.\n\nDerrick West -- Chief Strategy Officer\n\nThanks, Beena. As Beena mentioned, we achieved record revenue in both the fourth quarter and the full year fiscal 2022. Gross revenue grew 81% from Q4 2021 to 66 million and revenue grew 83% from the same period of this point to 46 million. On an annual basis, gross revenue grew by 86% to 209 million from $110 million in fiscal '21.\n\nNet revenue grew by 84% to 146 million from 79 million in the previous year. These revenue increases were primarily due to higher recreational net revenue, which grew 64% from Q4 of fiscal '21 and 78% over the prior fiscal year. The cost of sales in Q4 fiscal '21 was 37 million compared to 26 million in Q4 fiscal 2021, an increase of 42%. Annually, cost of sales were 119 million, a 15% increase over 104 million in fiscal '21.\n\nThe low increase of cost of sales relative to the large increase of revenues was due to the lower cost of production that was primarily achieved through improved efficiency from automation. We harvested approximately 16,000 kilos of flower during Q4 of '22 compared to about 12,000 kilos in Q4 of fiscal 2021, an increase of 33%. Annually, for fiscal 2022, we harvested 51,000 kilograms, a 76% increase over the 29,000 kilos in fiscal '21. The annual capacity at the Moncton growing facility has increased to 85,000 kilos.\n\nThis positions us well to meet our growing Canadian and international sales demand. On an adjusted basis, gross margin was 10.4 million or 23% of revenue over the 3 million or 12% for Q4 fiscal 2021. On an annual basis, adjusted gross margin was 33.4 million or 23% of revenue as compared to 3.6 million or 5% for the prior fiscal year. The significant improvement in adjusted gross margins was primarily due to the higher overall sales volumes combined with the lower cost of production.\n\nSG&A, excluding noncash share-based compensation, increased to 15.7 million in Q4 2022 from 12.4 million in Q4 '21. Annually, SG&A was 60 million compared to 46 million for the prior fiscal year. The increased amounts over the period are largely due to the increased employee headcount related to the acquisitions of the Winnipeg and Lac-Superieur facilities, increased professional fees, ERP implementation costs, and noncash amortization of the intangible assets acquired from the two acquisitions. While there was an increase in SG&A, as a percentage of net revenue, it decreased from 56% to 39%.\n\nIn the quarter, we achieved a positive adjusted EBITDA of 3.2 million compared to a negative 4.8 million in Q4 '21. Annually, adjusted EBITDA was 3.5 million compared to a negative 27.6 million for the prior fiscal year. The primary drivers of the significant improvement to profitability were the higher volume of products sold, lower proven the cost of production, which increased margins. Q4 '22 was our third consecutive quarter of positive adjusted EBITDA.\n\nAnd based on our outlook for revenue, including international sales and improved efficiencies primarily achieved through scale, we expect this trend to continue. The net loss was 6 million in Q4 fiscal 2022, compared to a net loss of 26 million in Q4 fiscal '21. For the fiscal year, the net loss was 14 million compared to 131 million for the prior fiscal year. The decrease in net loss was primarily due to the increased revenues of improved cost structure, along with reductions to inventory provisions.\n\nFrom a statement of cash flow's perspective, beginning with operating activities, there was net cash used of 36 million during the year, and this was mainly driven by the increase to our working capital assets, which grew as a result of higher sales and production levels. From an investing perspective, organic brand dispersed 49 million in capital expenditures across factory facilities, 8.4 million in cash consideration toward the acquisition of Laurentian Organic, and a 2.5 million investment into Hyasynth Biologicals. From a financing perspective, the company had lease obligation payments of approximately 1 million and raised 6.4 million from the issuance of common shares, which was primarily through BAT exercising its top-off rate. In terms of our balance sheet, on August 31, 2022, we had 125 million in cash and short-term investments compared to 215 million at the end of the prior year.\n\nDuring the year, the company undertook a significant expansion at its Moncton facility, which resulted in an expected decrease to our cash position. As we completed our expansion off at Laurentian and automation and enhancement investments at the Winnipeg and Moncton facilities, the company expects to spend approximately 29 million for fiscal 2023. The company's 125 million in cash and short-term investment includes 26 million unrestricted cash for the center of excellence, thereby leaving 99 million of unrestricted cash. With the company now generating positive adjusted EBITDA, we believe that we'll generate positive cash flow from operating activities during fiscal 2023 and positive free cash flows in calendar 2023.\n\nWe believe our capital position is healthy and that there is sufficient liquidity available to support the growth of the business over the near to medium term. This concludes my comments. I would like to turn the call back to Beena.\n\nBeena Goldenberg -- Chief Executive Officer\n\nThank you. We are pleased with the success of fiscal 2022, which reflects all our efforts in building a leading Canadian consumer package goods focused on cannabis. With the progress we've made, the market penetration we've achieved, our highly efficient production and our innovation platform, we are positioned to deliver long-term shareholder values. I want to express my gratitude to our board for their valued support and guidance, as well as to our employees for their dedication and ingenuity.\n\nWe look forward to further success in 2023. Thank you for joining us today. And, operator, you may open the call for questions.\n\nOperator\n\n[Operator instructions] Your first question comes from a line of Tamy Chen from BMO Capital Markets. Your line is open.\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nHi. Thanks for the question. First, I just wanted to ask in terms of your thinking on the flower portfolio. It does seem like, especially with Holy Mountain, and Beena, you talk a bit about the rationale of launching this, but it seems like your portfolio continues to be more in value.\n\nSo, I'm just wondering, as you go forward, is that where you want to stay for the most part, things are working there? Or would you consider trying to up-price the consumer with some more mainstream or premium type products in the future to improve your margin?\n\nBeena Goldenberg -- Chief Executive Officer\n\nThanks for the question, Tamy. I think the answer is we're comfortable in participating in the value segment because it's the largest segment in the market, and it's important to be able to compete there profitably. But we do have our Edison brand, which is now going through a revitalization to really establish a stronger position in a more premium space. And through the acquisition of Laurentian, we also have craft opportunity to continue to push the craft flower set.\n\nSo, you know, we'll have products in all the different consumer segments, flower products, but we have brands that fulfill the value segment because that's where a lot of the volume is.\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nGot it. OK. And then, a follow-up from me is, so this quarter, your fiscal year ended in August. And, you know, some of your competitors that had September and talked about how the disruptions in Ontario from the cyberattack, as well as from labor strikes, I believe, in both BC and Quebec, gave them a bit of a noisy period, had some disruptions on the sales side.\n\nSo, I was wondering if, to the extent, you can comment, did you see something similar post quarter? Thank you.\n\nBeena Goldenberg -- Chief Executive Officer\n\nSure, no problem. So, listen, despite the challenges in the market during the month of August, so both the cyberattack and the BC strike. We were able to deliver a record net revenue in our fourth quarter. In terms of the OCS, we were proactive with our sales team.\n\nThey were able to work directly with retailers to let them know which SKUs were available at the OCS warehouse. So, they were able to get around of the allowed or work within the allowed limits. So, that, you know, we kept up our position on our sales through that period until things got back to normal. Now, I will say, we did see some minor impact in September, as we had such strong sell through in September that we have had to run down to some minimum volume levels at our distribution centers on our high-velocity SKUs.\n\nAnd we had a bit of a delay in replenishment of those. So, there was a slight impact. But overall, we are very pleased with the results of our quarter, and we feel very good that everything is resolved. And we are having a solid Q1 as well.\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nYour next question comes from the line of Ty Collin from Eight Capital. Your line is open.\n\nTy Collin -- Eight Capital -- Analyst\n\nHi. Thanks for taking my question, and congrats on the quarter. Just wanted to start off. I'm wondering if you could share your views, Beena, on the structure that Canopy Growth is using to roll up its U.S.\n\nassets and whether that's a pathway you are considering for OGI to establish a presence in the U.S.?\n\nBeena Goldenberg -- Chief Executive Officer\n\nSo, Ty, thank you for your question. And listen, every single cannabis company is looking at what Canopy has done in the marketplace. I think it's important to start with that. We have been laser-focused first and foremost and making sure, we have a sustainable and profitable position in Canada, right, and taking advantage of some international opportunities through exports.\n\nNow, we have looked at the U.S. and in particular, in the past, we have looked at CBD. But we haven't found a transaction that makes sense to us. You know, so on the THC side, we will continue to develop a market entry strategy.\n\nWe'll pay close attention to the proposed legislative changes, and the acceptance of the certain transactions from some of our competitors. So, I guess the answer to your question is. We will enter only when we have determined the risk reward dynamic makes sense for the company and all stakeholders. But we are watching it, and we are going to see what works.\n\nTy Collin -- Eight Capital -- Analyst\n\nOK, great. Thanks for that. And then maybe one directed more toward Derrick. I'm wondering if you could unpack the gross margin rate a little bit for us.\n\nIt looks like that came in lighter than expected, particularly given the significant step-up in international revenues this quarter. I'm just wondering how much of an influence maybe pricing and mix were, for example. Just appreciate any color you can provide there.\n\nDerrick West -- Chief Strategy Officer\n\nSure. In Q4, we did have a significant increase over Q3 for the international sales. However, that was actually less than the increase that we had on flower sales in the rec market, which did allow us to achieve the highest rec sales overall for the company in the quarter. So, it was -- so the mix was still somewhat heavier with the wet flower and with the value brands.\n\nBut I will note that, on overall basis, our gross margin was 10.4 million. It was the highest quarterly amount in the past three years over the last 12 quarters. And as well, we had the larger harvest now that are lower cost of production over Q4. But those harvests were just coming off at the end of Q4 and, therefore, were not part of our cost of sales in the quarter.\n\nAnd they'll be more likely to impact our Q1 margins. But overall, the margin was essentially flat quarter to quarter even with the increased in international sales only because the larger reason our sales went up in the quarter was with the extra sales in flower that we had in the rec market.\n\nTy Collin -- Eight Capital -- Analyst\n\nThanks for that.\n\nOperator\n\nOur next question comes from a line of Aaron Grey from Alliance Global Partners. Your line is open.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nHi. Good morning, and thank you for the question. The first question for me is on international, nice to see the $6 million of sales you guys had in the quarter. It sounds like 6 million year to date as well.\n\nSo, I want to talk about your expectations there, you know, more longer term, specifically on the Israel market. I know you guys signed the agreement within InterCure earlier this month, $20,000, 10,000, now with an option on another 10,000. Sounds like 3,000 already delivered. Just given some of your peers kind of backing away from that market, we'd love to get your longer-term view there.\n\nDo you think it's more just the indoor quality that's why you're not seeing some of the pricing pressure that some of your competition has called out? And just how you're seeing that overall marketplace because, I know there's been different views regarding some of your competitors for this real market. Thank you.\n\nBeena Goldenberg -- Chief Executive Officer\n\nSure. So, thanks for the question. We have a great partnership with Canndoc. The product in the market is dual branded.\n\nIt includes Organigram, and it clearly says, you know, indoor grown Canadian flowers. So, we certainly are known for indoor grown, and we don't have competition at that market space. So, the quality of the flower is there and well accepted by consumers. And we see continued opportunity in the Israeli market.\n\nI think that the question on international opportunity, you saw the new agreement we signed with Canndoc. But more importantly, we've said in previous calls, at the position where our demand was out stripping our supply, now that we have our 4C expansion complete, and we have more flower, we could explore other opportunities beyond our current customers to see where we could export our high-quality indoor grown flower. So, we're very optimistic about international sales moving forward and looking at other customers and other markets as well.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nOK. Great. Thanks for that. And just given, you know, like the excess factory wouldn't have international versus Canada, as you look to allocate the extra capacity, is it fair to say that you might prioritize some new customers internationally versus what you might have domestically particularly as you're targeting? Sounds like a little bit more of the value segment in the near term on the Canadian side? Thanks.\n\nBeena Goldenberg -- Chief Executive Officer\n\nNo. I think the answer is the reverse. As I said earlier, we really want to make sure we have a sustainable, profitable leadership position in the Canadian marketplace. And so, over the course of last year, we prioritized our domestic market and continue to supply not only the value flower, but we supplied our Edison brand that has close to a 2% market share.\n\nSo, we continue to have a brand playing in the premium segment. We are building capacity at our Laurentian facility in Lac-Superieur to really participate in the craft flowers. So, it will have a complete portfolio of products for the Canadian market. And we'll explore excess opportunities with international markets because, you know, we have great quality flower, now we have the capacity to do it.\n\nSo, I think the priority will still be to make sure we're strong at home and then build from there on opportunities internationally.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nOK. Great. Thanks very much for the color. I'm going back in the queue.\n\nOperator\n\nYour next question comes from the line of Andrew Partheniou from Stifel. Your line is open.\n\nAndrew Partheniou -- Stifel Financial Corp. -- Analyst\n\nHi. Good morning. Thanks for taking my questions. Maybe first, just to expand on the previous question on gross margin, correct me if I'm wrong, but if I understand, you know, the better international sales, higher margin international sales were kind of offset by more rec value flower sales.\n\nJust thinking going forward here, understanding that expansion is going to benefit with operating leverage and the word production cost going forward. Just kind of want to understand what the uplift potential to gross margin is? You know, as mentioned, this quarter, it seems value kind of offset international, but is that something that we're going to see less of starting in Q1 of fiscal '23? And again, what kind of pickup on gross margin could we see from the expansion here, assuming that a lot of your, you know, future demand is going to be value focused?\n\nDerrick West -- Chief Strategy Officer\n\nWell, 75% of our revenues are in the flower categories. And, yes, there is a delta between the margins on international versus domestic as a consequence of the excise tax, which is fairly high on the flower categories for all LPs. And we are selling a large portion of our products in the value brand. However, we currently are profitable in that sector in Canada.\n\nAnd that is really without the benefit of getting to scale. While we left our leading fiscal '22 with this higher annual capacity from the month of sale at 85,000 kilos, and at the beginning of the year, we were at 45,000 and the construction was only completed at the beginning of Q4. And then, we were planting in rooms on a staggered basis. So, while we had some benefits to our cost structure through efficiencies and some automation, we didn't really have the benefit to our income statement yet for just the lower cost of production.\n\nAnd -- but we did indicate that our cost on a year-over-year basis for cost of cultivation has decreased 33%. And that amount will ultimately lower our cost of flower. And -- I'm sorry, 23%, I apologize. And that will start to benefit our margins across all flower categories in fiscal '23.\n\nAnd again, we didn't see really much of that benefit lift on our income statement for fiscal '22. So, I won't give guidance on the exact margins that can come from this, but our main offerings are in the flower categories and the main cost of the cost of cultivation kind of seemly significant decrease on the cost of cultivation as we leave fiscal 2022 just based on getting to scale.\n\nAndrew Partheniou -- Stifel Financial Corp. -- Analyst\n\nThanks for that. And then, thinking about cash and the guidance that you put out there, positive cash flow in fiscal '23 and positive free cash flow and calendar '23, first, could you just confirm, you know, is this positive guidance more specifically to the entire fiscal '23 as a whole and the entire calendar '23 as a whole? Or is this achieving, you know, positive in any one of those quarters through the fiscal and calendar year? And secondly, just to understand kind of the cadence of what we should expect, especially given the, you know, working capital increase this quarter. Should we expect a big step change? Is this going to be a little bit more gradual to get to positive. And just kind of managing expectations here would be helpful.\n\nThank you.\n\nDerrick West -- Chief Strategy Officer\n\nYeah. The guidance that's being given is not for the whole fiscal year. It is that we will achieve that income during the fiscal year in one of our quarters. So, starting with the operating cash flow, we finished the year with fairly large increased sales.\n\nWe do expect sales to continue to grow. We have significantly increased the production level in Moncton. And if we plan in those rooms, that will increase our investment in our biological assets and our inventories. So, as we continue to have success in the marketplace with our products and getting to a higher level of scale, there will be negative cash pressures on the operating activities for the first half of the year.\n\nHowever, we do expect that once we are fully operating our capacity at all facilities that that will level off. And we are confident that we will have a positive operating cash flow prior to the end of fiscal '23. And with regards to free cash flow, our main capex spend program, while significant in fiscal '22, we are doing further enhancements in automation in Winnipeg and Moncton and as well with completing the expansion at Laurentian. We expect to have that completed in fiscal 2023.\n\nAnd from there, we have no identified large capital projects. It would be more sustaining capital and as a consequence, as we get into the first part of fiscal '24, we would expect that positive operating cash flow with nominal capex will lead us to a positive free cash flow. And that's why we indicated in the guidance by the end of calendar '23, which covers our first quarter of next year -- of fiscal '24.\n\nAndrew Partheniou -- Stifel Financial Corp. -- Analyst\n\nOK. I appreciate that. Thanks. Will get back on the queue.\n\nOperator\n\nYour next question comes from the line of Matt Bottomley from Canaccord Genuity. Your line is open.\n\nMatt Bottomley -- Canaccord Genuity -- Analyst\n\nGood morning, everyone. Congrats on a strong finish to the fiscal year. Just wanted to kind of maybe more of a state of the union on what we are seeing and what's a saturated landscape in just terms of the number of participants in this sector, particularly on the cultivation production. So, appreciate all the commentary on how you are positioned and, you know, you are pretty much sort of top three in everywhere where you are playing.\n\nBut are you seeing any shakeouts right now, a lot of the commentary we have had from LPs as of late as there is a bit of what may be a bottoming in market share declines that we have seen pretty much across the board and you guys have been making good progress? So, are you seeing that as well? Or maybe there is less competition for wholesales with the provincial boards? Or is this just more specifically where you are choosing to allocate time and effort in terms of the SKUs that you're looking at that's resulting in these gains?\n\nBeena Goldenberg -- Chief Executive Officer\n\nWell, an interesting question. So, let me start by saying, we do see, over the course of this past year that there has been -- those cultivation facilities that couldn't compete whether it was on quality or price that have shuttered, that has taken some capacity out of the marketplace. But there are other players that are still in there, trying to make a goal of it. And so, we are still going to see some level of price competitiveness in the marketplace.\n\nWe are comfortable because of our cost base that we could compete in the value segment. As I said earlier, we have products that compete in other segments, but the value segment, especially today in the high inflation market is the space, where we expect to see the most growth, and we are comfortable participating in that. While some of our competitors have said they only want to participate in the premium segment, it's not a large enough segment. We'll get economies at scale.\n\nAnd at the end of the day, while people are focused on our margin percent, the dollars matter. That's what you take to the bank. And we are continuing to grow our overall gross margin dollars. So, I feel comfortable that the market, you know, we will have some further consolidation.\n\nWe've seen some companies go into CCAA, we've seen some shuttered facilities over the last while. This is going to be an interesting next 12 months in the market. We're comfortable in our position, in our, you know, improved -- we're projecting improved gross margins, as you've heard Derrick say. And we'll continue to compete in a segment that consumers are finding the right value, so the right quality at a fair price, right? And so, you know, I'm comfortable with our position.\n\nIn terms of other market share, I mean, we're growing in the gummies category. We introduced product, SHRED X vapes. into a segment that we really haven't been participating in leveraging our SHRED brand and saw some nice growth in that segment. We have more opportunities to build on Tremblant hash portfolio because of the strength of that brand and that product.\n\nSo, we do see opportunities in other segments. As Derrick said, we're predominantly a flower company right now, and we have great assets that give us great quality there. But we continue to build our portfolio and our two acquisitions that we completed in the last year really have helped us expand our portfolio to some higher margin --\n\nMatt Bottomley -- Canaccord Genuity -- Analyst\n\nGot it. Thanks. I think I might have dropped, maybe not. But if I'm still on the line, just one more follow-up for me.\n\nI know you touched on this a little bit, but I just want to make sure I understand the cadence of what's in your guidance as well. So, you know, given calling for a significant increase in adjusted EBITDA, you know, over the last fiscal year. I'm just wondering if you think that the sort of run rate that you're at now, or at least the 3.2 million that you did in this quarter. Are you expecting to continually see gains sequentially? Or do you think there'll be some volatility in terms of being breakeven and sort of up and above that sort of breakeven level?\n\nDerrick West -- Chief Strategy Officer\n\nYeah, with regards to the EBITDA, we do expect significant improvement in fiscal '23 compared to fiscal '22. And but I do know that for the first three quarters of fiscal '22, we were nominally positive, and most of the current fiscal '22 EBITDA was generated in Q4. We do see EBITDA sequentially improving over next year. There can be some swings.\n\nIt can depend on mix. But again, generally speaking, with the lower cost of production that we will have for next year and with our sales being at the level that they are, that we think that we can maintain and continue to increase that. Ultimately, we will see that it would increase over the year. But we can't guarantee one quarter over another at this time.\n\nSo, we're not giving guidance specifically by quarter, but we would certainly see the year fiscal '23 being higher than fiscal '22 in a significant way as a consequence of overall sales being higher and cost of production being much lower than it was for fiscal '22.\n\nMatt Bottomley -- Canaccord Genuity -- Analyst\n\nGot it. OK. Thanks for all that.\n\nOperator\n\nOur next question comes from the line of Michael Freeman from Raymond James. Your line is open.\n\nMichael Freeman -- Raymond James -- Analyst\n\nGood morning, Beena, Derrick, and Craig. Congratulations on a terrific quarter and a really impressive year. So, my first question is on capacity. You indicate you've completed built out of the 4C expansion in Moncton.\n\nYou're continuing to expand cultivation capacity in the Laurentian facility. But with international agreements looking like they're on a trajectory of growth, there seems to be continued unmet demand in Canada, do you see even with these capacity expansion projects you've been undertaking reaching, running out of capacity to meet demand both domestically and internationally? And if so, what routes might you take to address that?\n\nBeena Goldenberg -- Chief Executive Officer\n\nThank you for the question. I think to start with, we continue to look at ways to enhance our yields further. So, even with the completion of our expansion build out in Moncton, some of the LED lights only roll through all of our facility by the end of this past quarter. And so, the full impact of that benefit isn't yet in our numbers.\n\nAs I mentioned and as I was talking, fractional watering will only be complete through the end of the calendar year. So, that benefit is still to come. And we work with our plant science group, the, the work that they're doing on cultivars, breeding, cross-breeding, and selection. We're finding cultivars that have higher yields and higher potencies and will continue to update our garden with those products.\n\nSo, there is upside even to the 85,000 kilograms that we're talking about right now as we work through the fiscal year at our Moncton facility. With that being said, and as you also mentioned, we have the capacity at Laurentian facility. You know, there is always the opportunity to go out into the market and buy incremental flower as required to fulfill our pro our sales needs. We don't anticipate needing it for fiscal year '23 based on sales.\n\nBut if opportunities come up, we can certainly look at that. There is excess capacity in the marketplace. And again that will be buying product that meets the specifications that we need to have to meet our consumers' demand and the quality of products they're looking for from us.\n\nMichael Freeman -- Raymond James -- Analyst\n\nOK. And if I didn't just drop, I have another question. Thank you for that answer. Talking about the categories in which you play, you know, Organigram has been in dominant and far very strong in edibles.\n\nThe No. 2 and 3 most important areas large categories apart from these or largest categories in the nation are pre-rolls, and vapes after that, in which, by my calculations, Organigram stands No. 9 and Nov. 12 position respectively among LPs.\n\nHow is Organigram thinking about these categories? I recognize there's an increased attention put toward vapes? Recently, we saw some positive movement there. How can Organigram cultivate a right to win in each of each of those categories, if these are aims?\n\nBeena Goldenberg -- Chief Executive Officer\n\nSo, I think, a couple of answers here. Look, it's always important to look at all the different categories and where there's new opportunities for growth. Certainly, pre-roll is one that we have been, and we have held higher market positions than where we are. And at the end of the day, no different than our flower demand in fiscal '22.\n\nYou. know, we had demand that outstripped our supply. And so, we were at fully pushing on our pre-roll opportunities. Now that our flower is coming in, we have more opportunity to expand our pre-roll offering, and we will continue to do so.\n\nSo, we have a strong pre-roll offering under our SHRED brand, called Jar of Joints. And we have a really good product offering under our Edison brand, our Pinners that are dual. We have dual-flavored, dual-strained offerings under Edison. So, we have good competing offerings.\n\nWe just haven't been pushing pre-rolls to the extent, as a result of our available capacity. And that will change going into fiscal year '23 as we have more flower available. In terms of vapes, as you said, we were not really a player in the vape market. We introduced vapes under our SHRED X brand, again leveraging our brand strength and saw very strong off take at the beginning.\n\nNow, we have to find -- you know, make sure that, we are offering a product that meets both what consumers are looking for at the right price. And it's a very crowded space in vapes right now, and the market is very highly competitive. So, you know, while we have something to offer that's unique and different, we are in there and we do believe, but offering flavors that match our very successful flower flavors for our SHRED-milled flower that we had something unique to offer in the marketplace. But we will continue to explore how we could provide a differentiated offering in those segments.\n\nThat's part of the work we do both in our R&D group as well as through the center of excellence with BAT to look for how to have differentiated offerings. So, we could come in and really disrupt the market. And that's what we are working on behind the scenes, while we continue to push on the segments that we have good penetration.\n\nMichael Freeman -- Raymond James -- Analyst\n\nOK. That's really helpful. And if you would indulge just one more, since you mentioned the COE with BAT. I wonder, if you could remind us the fate of those products that you develop in tandem with BAT.\n\nYou mentioned 60 formulations developed and a bunch of delivery systems worked on this year. Where might we see these products and under what company might these be commercialized?\n\nBeena Goldenberg -- Chief Executive Officer\n\nRight. So, just let me start off as a reminder to everyone that, we have the ability to commercialize all the products and all the IP that comes out of the COE, including through sub-licensing arrangements. So, it's not necessary for us to even have physical footprints in some international markets to monetize the products or the IP that we have developed. That gives -- so we have the right to do that.\n\nAnd look, we will look to leverage these formulas not only internationally, but also within the Canadian marketplace where big products have differentiated offering that really stands apart. So, some of the work, some of the science going on behind the scenes, working on improved onset or improved bio-availability, those kind of things, we are working on those. And if we come up with products that really will differentiate our products, they will be introduced in our, you know, SHRED'ems or Monjour brands or into our SHRED X vapes, or whatever the portfolio where it makes sense, to continue to build the strength of our brands with differentiated products and to give us a competitive advantage over those that aren't doing the kind of research we are doing in the background.\n\nMichael Freeman -- Raymond James -- Analyst\n\nTerrific, and congrats again. I'll pass on.\n\nBeena Goldenberg -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Frederico Gomes from ATB. Your line is open.\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nGood morning. Congrats on the quarter. Thanks for taking my questions. My first question is on your guidance for capex next fiscal year.\n\nSo, if I got that right, you're planning to spend, you know, about 29 million. So, it seems like, you know, you're continue to materially invest in your automation and your cultivation, your capabilities, so that stands out compared to what many of your competitors are doing right now in the marketplace. So, could you provide a bit more color on the return you expect from that investment capital, and why does it make sense to, you know, from a capital location standpoint, to continue to invest at that space in the grid market conditions? Thank you.\n\nDerrick West -- Chief Strategy Officer\n\nYeah. Maybe I'll start the answer on that one. I would say that the substantial portion of that capital that we're allocating for fiscal '23 relates to the plan spend at the Laurentian facility and Lac-Superieur. You know, we acquired a company that had the capacity for hash of 1 million units a year, and we're looking to double that capacity to 2 million and take the -- and quadruple the craft flower capacity there that would provide certain automation equipment that will make it more profitable.\n\nSo, a large portion of that spend relates there. And in Moncton and Winnipeg, we're continuing to look at automation, you know, that will drive margins. Everything that we're investing in based upon our outlook on margins has a very quick paybacks and are very attractive. But we have not identified anything significant with our current three facilities that we now have going beyond fiscal '24.\n\nThis would be just the planned expenditure at Lac-Superieur and funnel touches to completely automate the Moncton facility and as well in Winnipeg. I don't know, Beena, if you wanted to provide any color there.\n\nBeena Goldenberg -- Chief Executive Officer\n\nYes. I just want to say that, listen, we recognize that we have an opportunity to continue to invest, to drive significant efficiencies in our operations, where some of our competitors who don't have the cash balances that we have, have had to stop that kind of investment, which again provides us with an opportunity of a competitive advantage as we continue to see our cost program go down through this investment of automation and other enhancements. So, you know, this is again, a long term play. We're here for the long term, and we believe these are the right investments now to make us on, you know, continued ongoing improvement in our profitability and really be a leader in the space.\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nOK. Thanks for that. And then in terms of pricing in Canada and your average selling prices, so I know that in the past, Beena, you have mentioned that, you saw and sign off stabilization here in Canada in terms of pricing, but at the same time in terms of net average selling prices that you report, we continue to view decline there. So, could you talk about that dynamic, what you're seeing in the market right now, and how you expect that to evolve going into 2023? Thank you.\n\nBeena Goldenberg -- Chief Executive Officer\n\nSure. So, thanks for that question. Listen, our average selling price per gram did go down this quarter. And that really is attributed to our mix.\n\nSo, you know, a little bit more of, of our SHRED flower really as opposed to, you know, Edison flower that mix does drive the lower average selling price. But overall, you know, we didn't take any price reductions in the market in Q4. This was simply the impact of mix. There is a drive to more value offerings in the marketplace, right? It's back to the comment earlier about.\n\nWe're in a high inflationary market right now. While consumers are not going to use less cannabis, they're going to look for the best value they could buy. And so, we have to be aware that that's out there and, you know, there's going to be a push to more larger format so that 1 ounce or 28 gram formats is growing, and it's going to be, you know, pricing compression there while consumer, while companies are trying to attract that consumer. We're comfortable that we have the right cost structure that we could compete in that space and, you know, offer competitive 28 gram offerings.\n\nAt the same time, as we talked about, we launched the Holy Mountain offering to provide value in some of the smaller formats as well. So, the smaller formats are going to obviously be priced a little bit higher than the large flower format, so, you know, we'll have that benefit to our pricing. But we also have a strong program planned on Edison on the revitalization of that brand. And, you know, that's important to us.\n\nIt was delayed this past year because again, we had our flower demand was outstripped for our supplies, so we had to delay some of the work we've -- but we expect that will improve as well. So, you know, I guess for us, average selling price is important, but it really -- it will depend on the mix of our brands. And then, our portfolio, obviously derivative have higher prices. So the more we could sell of our Tremblant hash, you know, overall margins will go up.\n\nAnd we'll continue to operate like that. I think a more macro answer to your question in terms of what we see in the marketplace, you know, we'll see some further challenges on especially the large-format flowers, simply because there is still excess capacity in Canada. And so, while there's excess capacity companies might do different things. But, you know, from our perspective, we're comfortable with where we are.\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nOK. Thanks for that color, and congrats on the quarter again. Thank you.\n\nBeena Goldenberg -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd there are no further questions at this time. Ms. Beena Goldenberg, I turn the call back over to you for some closing remarks.\n\nBeena Goldenberg -- Chief Executive Officer\n\nPerfect. Thank you, operator. And to everybody who congratulated us quarter, thank you for that. We did have a great quarter and a great year.\n\nSo, thanks for joining the call today. And I do look forward to providing an update on our fiscal '23 progress in the New Year. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCraig MacPhail -- Group Director, National Capital Markets\n\nBeena Goldenberg -- Chief Executive Officer\n\nDerrick West -- Chief Strategy Officer\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nTy Collin -- Eight Capital -- Analyst\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nAndrew Partheniou -- Stifel Financial Corp. -- Analyst\n\nMatt Bottomley -- Canaccord Genuity -- Analyst\n\nMichael Freeman -- Raymond James -- Analyst\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nMore OGI analysis\n\nAll earnings call transcripts"
}