{
  "companyName": "Designer Brands Inc.",
  "companyTicker": "DBI",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/31/designer-brands-inc-dbi-q2-2022-earnings-call-tran/",
  "content": "Designer Brands Inc. (DBI -0.71%)\nQ2 2022 Earnings Call\nAug 31, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, everyone, and welcome to the Designer Brands, Inc. 2Q 2022 earnings conference call. [Operator instructions] Please also note, today's event is being recorded. At this time, I'd like to turn the conference call over to Jesse Miller, senior director of investor relations.\n\nPlease go ahead.\n\nJesse Miller -- Senior Director, FP&A and Investor Relations\n\nGood morning. Earlier today, the company issued a press release comparing results of operations for the 13-week period ended July 30, 2022 to the 13-week period ended July 31, 2021. Please note that remarks made about the future expectations, plans and prospects of the company constitute forward-looking statements. Results may differ materially due to various factors listed in today's press release and the company's public filings with the SEC.\n\nThe company assumes no obligation to update any forward-looking statements. Joining us today are Roger Rawlins, chief executive officer; Jared Poff, chief financial officer; and Doug Howe, president of DSW. Now, let me turn over the call to Roger.\n\nRoger Rawlins -- Chief Executive Officer\n\nGood morning, and thank you, everyone for joining us today. I want to begin by saying thank you to all our associates across the globe. We are operating in an incredibly dynamic environment and your ability remain nimble on your feet during these last couple of years continues to power our growth. We are very pleased with our second quarter results and our continued momentum against our long-term plan of doubling sales of our owned brands by 2026, while maintaining sales levels of national brands as we continue to strengthen relationships with our top partners.\n\nWe ended the quarter with net sales up 5% compared to the second quarter of 2021, which is on top of last year's record net sales gain of 67% and reported a healthy adjusted diluted EPS growth of 11% compared to the second quarter of 2021. Before we dive into the details of our performance, I'm going to take a moment to address the current macro environment we are operating in. As you are all aware, the recent downturn in the macroeconomic market has included inflation, rising interest rates and softened consumer sentiment. As a result, the overall footwear market was slightly softer in the second quarter versus the first quarter of 2022.\n\nThat being said, Designer Brands is still far outpacing the major footwear retail indices, and we believe we are better positioned than many to deliver on our fall expectations. That's because this team has developed a clear mission, vision and strategies that allow us to differentiate ourselves from the balance of the industry. Our ability to stay ahead of the competition by leveraging the diversity of our teams, assortment and business model is allowing us to continue to successfully execute and grow during this time. We are able to quickly adjust our assortments to match consumer demand, which we have demonstrated repeatedly.\n\nAnd while still very important, we are less reliant on our seasonal business alone than we have been historically following our work to diversify our product offerings to match the consumer's demands. It is also worth noting that our customer base skews toward a higher income demographic that is somewhat less impacted by inflation. And to date, we have not seen a significant shift in consumer behavior. We continue to monitor consumers' trends closely and are taking a cautious view, namely, assuming these trends do not materially change in the back half of the year as we consider our inventory investments and outlook.\n\nTo that point, we feel we are well positioned from an inventory perspective as we move into the back half of this year. We believe there continues to be pent-up demand for dress and seasonal products tied to social occasioning and travel. Our back-to-school business has driven demand for kids and athletic footwear as planned. We are starting to see the return of the clearance shopper as we have strategically worked to rebuild our clearance assortment to win back this customer who hasn't shopped with us in over a year.\n\nAs you've heard us say many times, a flexible and diverse assortment is central to our strategy. According to NPD, DSW outpaced the rest of the footwear market by 5 percentage points in kids footwear in the second quarter based on dollar sales. Compared to 2019, DSW dollar growth outpaced the rest of the market in athletic and sport-lifestyle by 12 percentage points in the second quarter according to NPD. We anticipate this momentum will continue in the back half of the year.\n\nI also want to remind you that DBI has a proven playbook and track record that demonstrates the strength of our foundation and ability to gain market share by leveraging our adaptable business model even during difficult economic periods. Most recently, in the midst of COVID, we demonstrated the ultimate flexibility of our operations and assortment and streamlined our business even further to enable us to be faster in the future. As we move forward, we have a strong ability to act quickly and decisively to set ourselves up to best serve our customer's needs. To recap, Designer Brands is uniquely positioned to continue to succeed because of three major things.\n\nOne, we are incredibly flexible. We can lean into the brands we own and control in our direct-to-consumer channels and quickly adjust our national brand assortment to match our customer's needs. Two, we have implemented numerous cost control initiatives that allow us to invest in the most critical areas of our business to build our brands and grow our customer base. And three, our customer base is still healthy.\n\nOn average, our customers have a household income over a $100,000 and are somewhat less impacted by the headwinds we are seeing in the market. We are confident in our business model as we navigate ahead and in our team's ability to be nimble and adapt. Let's walk through the key elements of our assortment, starting with our owned brands. As you have been hearing from us, bolstering the momentum of our owned brands is a top priority.\n\nIn the second quarter, owned brands sales grew 40% compared to the same period last year. Additionally, our owned brands represented 23% of DBI revenue compared to 17% in the second quarter last year, continuing the significant increases we saw in the first quarter. Our ability to take our brands directly to a consumer through our retail stores and websites is key to our growth and it delivered a 45% increase to last year, while still growing our wholesale distribution by 25%. We are extremely pleased with these results and remain on track to deliver our commitment of doubling the sales of our owned brands by 2026.\n\nTo give you a sense of just how prominent these brands are in the industry, I want to direct you to our second quarter earnings infographic, which can be found on our investor relations website. As you can see, we have a chart including the most relevant brands in fashion footwear as of the end of the second quarter. I am so proud to share that based on a combination of market and internal data, we have concluded that six of DBI's owned brands, Kelly & Katie, Vince Camuto, Jessica Simpson, Mix No. 6, Crown Vintage and Lucky ranked within the top 50 brands in fashion footwear industry based on the impressive sales of each of those brands in the second quarter.\n\nSpecifically, we determined that in the second quarter, Kelly & Katie was among the top 10 fashion footwear brands and Vince Camuto in the top 20. Let me repeat that, we have determined that all six of these owned brands would fall in the top 50 brands in fashion footwear based on a combination of market and internal data in the second quarter. I am even more excited with the fact that we feel we are just at the beginning of our brand-building journey with many of these brands, bringing together great product with best-in-class distribution and customer relationships gives these brands an incredible platform to further grow their market share and leadership position. As we told you at investor day, we are continuing to invest in ensuring we have the best breadth and depth of product represented in our owned brands.\n\nOur strength has historically been in dress and fashion and we remain the leader in these categories. We are also building out our athletic presence within our owned brands assortment. To that end, I want to highlight the Le TIGRE investment and partnership we announced in the quarter. Its unique style is the perfect addition to our growing portfolio of owned brands that customers have come to expect.\n\nThis partnership with Le TIGRE, coupled with our already announced partnership with Reebok allows us to expand our owned brands dominance in the increasingly important athletic category. Moving to our national brands. We continue our work of going narrower and deeper with our top brand partners. In the quarter, our top 50 brands represented 80% of our sales and grew 20% over the second quarter of 2021.\n\nTo get into our DSW strategy a bit more, I am excited to welcome my colleague, Doug Howe, president of DSW to today's call. In a moment, he will be sharing more details on the initiatives we have in place to continue strengthening our partnerships with our top national brands as we move into the back half of the year. Before I turn it over to Doug, I want to reiterate how pleased we are with our current results and operational strengths, especially amid an uncertain macro environment. We believe we are well positioned for the back half of the year and are confident in our ability to deliver our fiscal 2022 guidance.\n\nI'll now turn it over to Doug Howe, president of DSW. Doug?\n\nDoug Howe -- President, DSW\n\nGood morning, everyone. As Roger said, I'm Doug Howe, president of DSW. I joined the company this past May, and I'm excited to be working with such a visionary team. At DSW, I'm helping to bring our differentiated customer experience and desired brands to life across direct-to-consumer channels.\n\nI have a long history in brand building and retail operations and a privilege to join DSW as we evolve retail to the next level with the determined focus on customers while offering the best owned and national brands and delivering products with incredible speed. I'm joining today's call to give you some more color on how we are executing on our strategy here at DSW. As the team has mentioned time and time again, we are always looking for ways to grow our relationships with our national brand partners. You've heard Roger and Jared described it as going narrower and deeper.\n\nI personally like to think of it as amplifying and editing. While you've heard our strategic plans to maintain national brands in totality, I want to share with you a little bit how that breaks down and how we are actually growing our relationships with the most prominent national brands. We are prioritizing growing with the top brands that our customers are demanding across the board. We continue to evolve our assortment and the breadth and depth of the top brands we offer our customers.\n\nIn doing so, we have seen meaningful growth, upwards of 20% with many of these top brands over the past year. And we have strategic initiatives in place to provide added value for our brand partners, helping them to effectively showcase and spotlight their products in our DSW stores. A perfect example of this is our new Warehouse Reimagined store, which we opened in Hedwig, Texas earlier this year. We continue to glean learnings from this new format and remain happy with the initial results.\n\nIn the meantime, we continue to test shop-in-shops in existing store formats to leverage additional insights and have been pleased with the lift we are seeing with our national brands through these investments. Other points of implication are our various holidays. We are particularly proud of the way we have leaned into back-to-school over the past two seasons, which has allowed us to increase market share and grow even closer to mom and her entire family in the process. As a reminder, this is a new peak demand period for us, and we are viewing it as a new holiday in our calendar, buying inventory and optimizing marketing accordingly.\n\nWe started focusing on the season last year as we shifted our assortment to be more inclusive of athletic and kids products and have further refined our approach this year to maximize the potential of this time frame. To provide some background, we consider the back-to-school season to be roughly seven weeks long, which coincides with the beginning of the academic calendar across different parts of the country. This has been supported this year by a new optimized marketing calendar that aligns with the back-to-school timing by region. We are particularly proud of our strong athletic assortment in our kids department.\n\nIn fact, even without the presence of Nike in our assortment, we've seen sales increases compared to 2021. We are gaining market share, we are growing, and we have no intention of taking our foot off the gas. At the heart of everything I've discussed today is our customer. We are pleased that our customer retention remains strong.\n\nAs of the end of July, DSW engaged members were up 9% compared to the prior year driven by strong reacquisition of pre-pandemic customers and the addition of new customers. This has been partially driven by our focus on regaining our clearance customer, which, as a reminder, is a strategic focus for us as clearance is such an integral part of our business model and a true strategic differentiator. We have reacquired approximately two million clearance customers year-to-date, resulting in clearance sales being up 5% in the quarter compared to being down 5% in the first quarter of this year, a showcase of strong sequential growth. We anticipate continuing to grow penetration as we move throughout the fall, which will start to bring us back to more normalized levels of clearance.\n\nClose, I want to speak to our inventory position. In Q2, our focus was on preparing for back-to-school and gearing up for Sep-tober. We have seen inventory availability continue to improve, but there has still been uncertainty in timing of some deliveries. Because of this, we plan to head, protected ourselves and brought receipts in early for the back-to-school and Sep-tober seasons.\n\nAccordingly, we ended the quarter with retail inventories up 33% on a square footage basis compared to the second quarter of 2021. It's important to note that the second quarter of 2021 was a period of extraordinary light inventory as we navigated supply chain challenges. Compared to 2019, a more normalized period, our inventory is up only 8% on a square foot basis. This also positions us well for the demand peak period of Sep-tober, and we have planned year-over-year inventory levels to further normalize as we move through the back half of the year.\n\nI'll now turn the call over to Jared and look forward to continuing to update you all on our DSW performance in the future.\n\nJared Poff -- Executive Vice President, Chief Financial Officer\n\nThank you, Doug, and good morning, everyone. We are very proud of our second quarter results and continue to be highly encouraged by the impressive growth in our owned brands as well as our top national brands. Please note the financial results that we will reference during the remainder of today's call excludes certain adjustments recorded under GAAP unless specified otherwise. For a complete reconciliation of GAAP to adjusted earnings, please reference our press release.\n\nLet's turn to our results. For the second quarter, net sales increased 5.1% to $859.3 million compared to the same quarter 2021. For the second quarter, total comps were up 6.2% on top of a robust 84.9% comp last year. Within this growth, owned brands were up 40% in the second quarter compared to last year, with notable growth in both direct-to-consumer and wholesale channels.\n\nWe feel great about the progress, which we believe showcases our ability to build our owned brands to reach nearly one-third of our sales by 2026. Overall, we saw positive sales across all of our segments. U.S. retail comps were up 2.7% for the second quarter on top of a remarkable 94.3% last year.\n\nVincecamuto.com comps were up 43.3% in the quarter on top of a strong 10.6% in the second quarter of 2021. This double-digit growth on top of impressive growth last year amplifies the reach we believe we have to grow our brands across multiple channels to many different customer sets. Comps in Canada increased 47.3% in the quarter versus 14.6% in the prior year. As a reminder, Canada has had a slower recovery in 2021 compared to the U.S., and we are continuing to see strength building here.\n\nOur consolidated gross profit increased 3.9% to $295.7 million in the second quarter. Consolidated gross margin was 34.4% in the second quarter, down 40 basis points compared to 34.8% last year. The change was driven by a couple of factors. First, we had a planned increase in clearance sales in our U.S.\n\nRetail segment as we aim to strategically reacquire the clearance customer whom we lost during this recovery. This progressed exactly as we discussed during our last earnings call. As we mentioned, we expected our core business margins to be more in line with last year as we look to strategically regain our clearance customers. We were successful in the quarter with clearance up 5% year over year compared to down 5% in the first quarter.\n\nAdditionally, we continue to see higher freight costs impacting all of our segments, which increased roughly $12 million compared to the second quarter last year as well as some elevated costs related to the consolidation and optimizing of our fulfillment centers. Overall, we are still 390 basis points above 2019 gross margin levels, which speaks to the structural shifts we have made in our business. I want to reiterate what we have spoken about all year thus far and what Doug echoed in his remarks. We firmly believe that a consistent clearance assortment is a strategic differentiator and a critical part of our unique business model, and we have been executing on plans to rebuild our clearance assortment and reacquire those clearance customers.\n\nThis started in the second quarter and is building through the third quarter. As we succeed in this initiative, we expect to see reacquired customers incrementally return to our business while delivering slightly lower gross profit rate than what we have been generating during this record-setting supply constrained COVID recovery. Accordingly, we expect to see Q3 of this year lower than Q3 of 2021, resulting in margin rates for the full-year, slightly below that of 2021. And this is a good thing, and exactly what we planned and have been communicating from the start of the year.\n\nAnd importantly, rates are anticipated to continue to be meaningfully above 2019 levels and are expected to continue growing over the next few years as we execute against our long range plan of doubling sales of our owned brands. Turning to our inventory. We ended the second quarter with inventories of $694 million compared to $504.3 million last year. As Doug mentioned, much of this was driven by tactical planning we deployed for the fall season, including back-to-school in Sep-tober.\n\nWe expect continued strength in our retail inventory levels as we end the third quarter. In the second quarter, consolidated adjusted SG&A was $227.7 million, up 4.5% versus last year. Similar to the first quarter, selling expenses drove the majority of the increase as customers continued coming back to the store. Our adjusted SG&A ratio for the second quarter was 26.5% of sales compared to 26.7% of sales last year, an improvement of 20 basis points.\n\nAdjusted operating profit for Designer Brands was $70.4 million in the second quarter compared to $69 million last year. This represents our second highest second quarter adjusted operating income in our history. Adjusted operating margin was 8.2% in the second quarter compared to 8.4% operating margin last year. We had $2.8 million of net interest expense during the second quarter compared to $8.1 million in the prior year.\n\nAs mentioned in previous calls, with the extinguishment of our term loan, we expect our interest expense to be materially lower than fiscal 2021. Our effective tax rate on our adjusted results were 31.8% in the second quarter. Second quarter adjusted net income was $46.1 million or $0.62 per diluted share compared to $43.4 million or $0.56 last year, an increase of 11%. As we moved into the third quarter, our liquidity position remains strong.\n\nWe are still awaiting receipt of our roughly $160 million CARES Act tax refund due to us from the IRS. Our liquidity position, which includes cash and availability under our revolver is healthy, and we ended the quarter at $208.5 million versus $410.5 million last year. We had $387.4 million of debt at the end of the quarter versus $247.1 million last year. We ended the quarter with $50.8 million of cash versus $46.5 million last year and have $157.7 million available to draw on our revolving credit facility.\n\nDuring the quarter, we repurchased 7.8 million shares. Repurchases year-to-date through July were 9.4 million shares. We are proud of our second quarter performance and the progress we are making on our long-range plan that we outlined at our investor day earlier this year as well as the fact that we are accomplishing so much amid a challenging macro environment. To that end, we are reiterating the majority of our guidance but raising our EPS guidance range for the full-year of 2022 driven by our share repurchase activity and better-than-anticipated second quarter results to a range of $2.05 to $2.15, up from a range of $1.90 to $2.\n\nOur fiscal 2022 guidance assumes that the multitude of pressures, including the freight costs, competitive inventory, the health of the consumer and overall macroeconomic headwinds will persist through the remainder of the fiscal year. We also wanted to point out again that our third quarter is anticipated to be our toughest quarter this year as we lap a record-setting quarter last year in terms of gross margin, adjusted operating income and EPS. We anticipate our third quarter will be below 2021 performance with stronger growth year over year coming in the fourth quarter. With that, we will open the call for questions.\n\nOperator?\n\nOperator\n\n[Operator instructions] And our first question today comes from Steve Marotta from C.L. King & Associates. Please go ahead with your question.\n\nSteve Marotta -- C.L. King and Associates -- Analyst\n\nGood morning, Roger, Jared and Doug. Congratulations on the second quarter. Jared, can you just talk a little bit about any sort of margin differential and the expectations for the second half of the year. I know that you mentioned most of the revision -- upward revision in guidance from an EPS standpoint was due to share repurchase as well as results in the second quarter.\n\nIs there anything that changed other than that for the second half of the year?\n\nJared Poff -- Executive Vice President, Chief Financial Officer\n\nYeah. And thank you, Steve, and I will answer your second question first. No, there is nothing that's changed from the back half projection that we've had all year. So that we are reaffirming and feel pretty good about as has always been the case, and as we've been signaling all year, we did expect to see some margin deleverage in the back half because most importantly, because we are going after reacquiring that lapsed clearance customer, which is exactly what we started in Q2, and you heard Doug talk about almost two million new customers, incremental customers who have returned to the fold buying clearance and that assortment is building and is really pretty much in place now in the third quarter.\n\nSo that's a good thing. That's going to drive roughly around 200 basis points of deleverage on the margin side. But again, that's been the plan that it's always been, and we're very happy with that.\n\nSteve Marotta -- C.L. King and Associates -- Analyst\n\nThat's really helpful. And Roger, can you talk about the success of the incremental purchase by mom during the current back-to-school season? And maybe also a little bit of color on how long of a tail you expect to continue from back-to-school -- the back-to-school activity, if you will? Thanks.\n\nRoger Rawlins -- Chief Executive Officer\n\nYeah. I think, Steve, one of the big things that we've done over the last couple of years, and Doug touched on this, is investing in this what is now a new holiday for us called kids. And we are still in the middle of it. So I don't think we should share anything.\n\nBut I would tell you, out of the gate which is really the first, let's just say, five weeks of that window, we are on our plan, which was to grow our kids business and to continue to gain some market share in the athleisure space, and we're very happy with both of those metrics is what I would tell you.\n\nSteve Marotta -- C.L. King and Associates -- Analyst\n\nOK. That's helpful. I'll take the balance offline. Thank you.\n\nRoger Rawlins -- Chief Executive Officer\n\nSure. Thank you.\n\nOperator\n\nAnd our next question comes from Jay Sole from UBS. Please go ahead with your question.\n\nJay Sole -- UBS -- Analyst\n\nGreat. Thank you so much. My question is just about the brand portfolio. Jared, how should we think about modeling sales in Q3 and Q4? Just given the trends that we've seen in Q1 and Q2 and just with the changes that have been made in the business over the last couple of years?\n\nJared Poff -- Executive Vice President, Chief Financial Officer\n\nYeah. We are very happy with what we've seen from the kind of the recovery of our wholesale business. As you know, we've really shut that down basically during COVID. We saw that come roaring back with the dress and seasonal business starting last year and continued into the first half of this year.\n\nWe have taken a bit of a cautious approach for the back half of the year or as to say a more cautious approach. So I think our wholesale sales are not anticipated to be as robust as far as a growth perspective in the fall. However, I will tell you a decent amount of that is stuff that we have planned for our sales to ourselves, which is eliminated in intercompany, eliminations to be sold in the spring anyway. So that really is not impacting our overall year because we eliminate that out until that's ultimately sold.\n\nAnd one thing we are very good at is if things change differently and caution wasn't necessary, then we can chase back into inventory very, very quickly, which we've demonstrated over the last two seasons. So I would say maybe a bit of a tempering in the back half on that wholesale business, but more than made up for from a reduction in the assumed intercompany eliminations.\n\nJay Sole -- UBS -- Analyst\n\nOK. Understood. And then maybe just a follow-up on that. If you can just talk about -- you made some comments about gross margin in Q3.\n\nDoes that apply to the brand portfolio? I mean how do you see the gross margin shaping up for the brand portfolio in the back half of the year?\n\nJared Poff -- Executive Vice President, Chief Financial Officer\n\nYes. On the brand portfolio side, I'm not seeing huge deviations on their gross margin in the fall versus the spring. It's not really been a change in posture from discounting or anything like that. It's really just more around the amount we want to bet on an inventory production side.\n\nJay Sole -- UBS -- Analyst\n\nOK. Thank you so much.\n\nRoger Rawlins -- Chief Executive Officer\n\nAnd Jay, one thing. This is Roger. One thing I wanted to add was if you look at the brand portfolio piece of our business, I know many of the analysts had suggested that we could not have success in that space. And I just want to emphasize again how proud I am of our team that have proven that we can play in this space and that if we build great product and we put great marketing behind it, we have good partners that want to buy product from us.\n\nAnd I'm really, really proud of our Camuto team and the work they've done to not just drive wholesale, but when you look at our direct-to-consumer business, it increased 45% to last year. That is remarkable. And it is because the combination that we have of an amazing store fleet and amazing digital experience and the ability to make design and source our own shoes. There isn't anyone else in our segment that we are aware of that has that same capability across 30 million people.\n\nAnd that's where we are having success. So again, I just want to give a shout out to my team at Camuto.\n\nJared Poff -- Executive Vice President, Chief Financial Officer\n\nAnd then I would even add to that, we added a chart in the infographic. And hopefully, you all received that and you pulled it down from the website. But we wanted to take a look at how those brands were performing vis-a-vis their national brand competitors. And of course, three of ours are national brands.\n\nThey're in the wholesale channels as you were talking about, Jay. You can see there when you look at all fashion footwear across the industry, we now have six of our brands that are in the top 50, one that is in the top 10 and only one of those even existed in 2019. So when you marry together the brand building and design and sourcing with the infrastructure of our DTC infrastructure, it really is a powerful combination.\n\nRoger Rawlins -- Chief Executive Officer\n\nAnd to Jared's point, I know you guys all follow other brands that we carry. And to see Kelly & Katie sitting in the same range as Steve Madden, Skechers, Doc Martens or Vince Camuto sitting next to Sam Edelman, HEYDUDE, BIRKENSTOCK, Timberland, or Jessica and Mix No. 6 right there with Crocs, Clarks, UGG and Cole Haan, like that was the vision we had years ago. And those investments we made four years ago are paying off and we're reaping those benefits right now.\n\nJay Sole -- UBS -- Analyst\n\nGot it. Thank you so much.\n\nRoger Rawlins -- Chief Executive Officer\n\nThanks.\n\nOperator\n\n[Operator instructions] Our next question comes from Dana Telsey from Telsey Advisory Group. Please go ahead with your question.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nHi, good morning, everyone. As you think about the Reimagined store of the future, can you tell us any -- expand on any updates there, what you're seeing and how you see the learnings from that translating into your other stores? And then also on inventory levels, how do you see that progressing through the third and fourth quarter? And then lastly, on the clearance customer, how is that strategy working to reacquire some of those customers? Thank you.\n\nDoug Howe -- President, DSW\n\nHey, Dana. This is Doug Howe. Thanks for your question. The first one on Reimagined, I would just say just to remind you, we're only about 90 days into the concept, but the initial customer feedback that we're getting from the concept is incredibly positive.\n\nSo as we shared, we opened this up as a laboratory. We want to continue to watch and iterate. There definitely been some learnings that we'll be able to scale. But again, we want to be mindful of just making sure that we really leverage those when we roll them out to the full fleet.\n\nIn particular, I mean, we're really pleased with the shop-in-shop concepts that we've deployed there in partnership with some of our national brands. So again, just an opportunity to get more suit at storytelling in that store environment. So really pleased, but again, early days there. On inventory, we're really feeling confident about our inventory.\n\nAgain, as we said in the remarks, this was part of our strategy to grow our inventory to reposition for the back half of the year, specifically, as we looked at this opportunity to expand our back-to-school business. And then as we gear into this very important time period for us, which we call Sep-tober, the receipt levels will moderate as we go through the back half of the year. But again, we're feeling really good about the content and the flow of that inventory. And then lastly, the clearance customer, again, as we said, we acquired approximately two million more customers year-to-date.\n\nAnd that, again, was part of the strategy as well because those were customers that hadn't shopped with us for over a year. So again, critical component of our business model, it's a key differentiator, more important now than ever, probably just given the uncertainty in the macro environment, but definitely part of our strategy, and we're feeling really good about the momentum that we're seeing there as well.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nDoug Howe -- President, DSW\n\nThanks, Dana.\n\nOperator\n\nAnd ladies and gentlemen, at this time and showing no additional questions, I'd like to turn the floor back over to the management team for any closing remarks.\n\nRoger Rawlins -- Chief Executive Officer\n\nThank you. I just want to again say thanks to our team and reinforce what you guys have accomplished in the last six months. And if you think about what we've done, we've raised our guidance for the third time. We've bought back approximately 12% of our company's stock in the last six months.\n\nWe've initiated a dividend of nickel a quarter. We've now built our owned brands to be in the top 56 of those in the top 50 fashion footwear, and we've done that in less than three years, and you guys are seeing the benefit right now. We've acquired Le TIGRE, which we didn't get a ton into that, but we will in the future. It's an opportunity for us to play in that athleisure segment.\n\nAnd then when you look at what Mary and Nancy and Eric and Eric, and I shouldn't say names because I'm leaving somebody out, Joe, our team in Canada is killing it. They are amazing. They are grabbing enormous amounts of market share and driving profitability. And we've done all of that because we have developed and acquired amazing people.\n\nSo thank you for everything you're doing. Let's keep it up, and let's have a great back half. Thank you, and have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJesse Miller -- Senior Director, FP&A and Investor Relations\n\nRoger Rawlins -- Chief Executive Officer\n\nDoug Howe -- President, DSW\n\nJared Poff -- Executive Vice President, Chief Financial Officer\n\nSteve Marotta -- C.L. King and Associates -- Analyst\n\nJay Sole -- UBS -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nMore DBI analysis\n\nAll earnings call transcripts"
}