{
  "companyName": "Oatly Group AB",
  "companyTicker": "OTLY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/14/oatly-group-ab-otly-q3-2022-earnings-call-transcri/",
  "content": "Oatly Group AB (OTLY -0.57%)\nQ3 2022 Earnings Call\nNov 14, 2022, 8:30 a.m. ET\n\nOperator\n\nLadies and gentlemen, greetings and welcome to the Oatly's third-quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. A brief question-and-answer session will follow the formal presentation. [Operator instructions] As a reminder, this conference is being recorded.\n\nIt is now my pleasure to introduce your host, Rachel Ulsh from investor relations. Please go ahead.\n\nRachel Ulsh -- Investor Relations\n\nGood morning and thank you for joining us on Oatly's third-quarter 2022 earnings conference call webcast. On today's call are Toni Petersson, chief executive officer, and Christian Hanke, chief financial officer. Jean-Christophe Flatin, global president, and Daniel Ordonez, chief operating officer, will also be available for questions. Before I begin, please remember that during the course of this call, management may make forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding our future results of operations and financial position, industry and business trends, business strategy, and market growth and anticipated cost savings.\n\nThese statements are based on management's current expectations and beliefs and involve risks and -- risks and uncertainties that could differ materially from actual events or those described in these forward-looking statements. Please refer to the company's annual report on Form 20-F for the year ended December 31st, 2021 filed with the SEC on April 6, 2022, our Form 6-K for the period ended September 30, 2022, and other reports filed from time to time to the Securities and Exchange Commission for a detailed discussion of the risks that could cause actual results to differ materially from those expressed or implied in any forward-looking statements made today. Please note, in today's call, management will refer to certain non-IFRS financial measures, including EBITDA, adjusted EBITDA, and constant-currency revenue. While the company believes these non-IFRS financial measures will provide useful information for investors, presentation of this information is not intended to be considered in isolation, or as a substitute for, the financial information presented in accordance with IFRS.\n\nPlease refer to today's release for reconciliation of our non-IFRS financial measures and the most comparable measures prepared in accordance with IFRS. In addition, Oatly has posted a supplemental presentation on its website for reference. I'd now like to turn the call over to Toni Petersson.\n\nToni Petersson -- Chief Executive Officer\n\nThanks, Rachel. Good morning. We appreciate you joining us to discuss our third quarter results. Today, I will provide an update on our business performance, address strategic actions we have taken as an organization, and our future growth opportunities.\n\nChristian will review our financial results and updated 2022 outlook. And Jean-Christophe, Daniel, Christian, and I will be available for questions. As a reminder, our new global president, Jean-Christophe Flatin, and Chief Operating Officer Daniel Ordonez joined Oatly in June. These two accomplished industry leaders have over 60 years of combined experience at global and fast-growing consumer brand.\n\nSince joining, they have focused on activating multiple growth initiatives and positioning Oatly for the next phase of growth. Since our last earnings call in early August, we have faced challenges mainly driven by COVID-19 restrictions in China and ramp-up [Inaudible] due to technical issue in our Ogden facility in the U.S., as well as FX headwinds, and the third-quarter results came short of our expectations. However, we believe these challenges are transitory, and we are encouraged by our current volume growth, underlying consumer demand, and future growth opportunities. In the third quarter, we saw year-over-year sales volume growth of 15% across all regions and continue to see strong category-leading velocities.\n\nThe global demand remains resilient, yet I am disappointed with our ability to translate this third-quarter gross profit margin and sequential EBITDA improvement due to our operational execution shortcomings, as well as the worsening macro environment, which I will touch on more shortly. The 2.7% gross margin was below our expectations. Past two years have taught us the hard way that being a high-growth company in an unprecedented, complex, and volatile environment demands an even sharper allocation of resources and capital. This is why, as shown on Slide 5, we have made strategic decisions with immediate actions items to achieve three goals: first, prepare for the next phase of continued high growth; second, to increase the simplicity and agility of the organization; and third, to drive profitability with more asset-light strategy.\n\nWith these goals and increased focus on balancing growth with profitability, we expect to be adjusted EBITDA positive exiting Q4 2023. Christian will walk through the path of profitability shortly. Turning to Slide 6. This reset plan involves two fundamental streams: adjusting our supply chain network strategy and simplifying the organizational structure.\n\nStarting with the supply chain network strategy. One of our company's core strengths is our proprietary expertise in oat-based technology, which forms the foundations of our product portfolio. Going forward, we will simplify our supply chain strategy by focusing our investment in our oat-based technology and capacity, which will also reduce the capital intensity of our future facilities. As such, we are actively pursuing and are in discussions with manufacturing partners to create a more hybrid production network across our geographies.\n\nWe are specifically looking at transitioning the Fort Worth and Peterborough plants to hybrid facilities versus end to end. This move toward a more hybrid network is expected to significantly reduce our future capital expenditures and have a positive effect on our cash flow outlook. It will also enable us to support growth and provide us with more flexibility to expand capacity faster in the future in addition to the phasing of capex project we laid out last quarter, which has already improved our cash flow to the near to medium term. Moving to the organizational structure, we have been reviewing our organizational structure to adjust our fixed-cost base globally for a more balanced growth and profitability equation.\n\nTo start, we are executing an overhead and headcount reduction impacting up to 25% of the costs related to the group corporate functions and regional EMEA layers. By doing this, we expect annual savings of up to 25 million from the reorganization, which should take effect starting in Q1 2023. We have identified incremental opportunities in the rest of the organization from which we expect up to 25 million in additional annual savings in the first half of 2023. As part of this review, Jean-Christophe has assumed oversight of the global supply chain network following the departure of our chief supply chain officer, while Daniel has assumed oversight of EMEA markets following the departure of our EMEA president.\n\nWe continue to evaluate our global operations and potential opportunities to recalibrate our global organizational structure for the next phase of growth. As shown on Slide 7, growth remains a top priority. The strategic actions we are taking are expected to strengthen our positioning entering 2023 and beyond. It's important to remember we are operating in a category that is still very strong, and this reset is necessary to prepare for the next phase of growth.\n\nPlant-based is growing globally, and oat continues to be the growth driver within plant-based beverages. While our supply is stable, we have strong position. And even where we have not been able to fulfill demand, including in the U.S., we still have the leading velocities despite a higher price point and lower promotional spend. Turning to Slide 8.\n\nWe see a significant white-space opportunity as we work to convert dairy users to Oatly consumers globally. We expect to drive conversion by increasing our brand reach, pioneering through new product innovation, driving asset-light production capacity expansion to support demand, expanding our presence across channels, and entering new markets. Now, moving to our business performance on Slide 10. Third-quarter revenue was 183 million, a 7% increase compared to 171.1 million in the prior-year period.\n\nHowever, FX was a significant headwind in the revaluation of the dollar versus all European currencies, and the RMB impacted our results by 16.6 million in the third quarter. In constant currency, revenue increased 16.7% year over year to 199.7 million. We saw volume growth across regions, and we still have the No. 1 selling oat milk SKU and highest velocities across key markets.\n\nWe have also successfully rolled out new product launches across geographies and continued channel expansion. Turning to the regions, starting with EMEA on Slide 11. EMEA third-quarter revenue was 82.6 million with strong FX headwind impacting revenue by 14.5 million in the third quarter. In constant currency, EMEA revenue increased 11% year over year to 97.1 million.\n\nSales volumes increased approximately 7% with steady performance across different markets in Europe. This was in line with our expectations but also reflects the difficult macro environment. We see our continued ability to drive category growth, proving the resilience of our brand and business model with improving velocities and market shares across the board. Turning to Slide 12, which is the result of driving growth in our existing markets through, one, the synchronization of our brand portfolio and in-store activations; two, disruptive brand event, the unique deployment of out-of-home activation; three, focused distribution and execution of new product development with chilled and Mini Barista, as was the ice cream launch in DACH; and fourth, distribution gains, both retail and foodservice.\n\nGoing forward, we still have a significant international expansion opportunity in EMEA as our current key markets consist only the U.K., DACH, the Nordics, and the Netherlands. This quarter's continued macro condition in EMEA slowed our new market and channel expansion. We incurred one-time charges related to higher scrap and co-packer volume adjustments. Turning to the Americas on Slide 13.\n\nAmericas' third-quarter revenue increased 22.7% year over year to 60.7 million, which was below our expectations. Demand for Oatly brand in the U.S. remained strong with minimal signs of elasticity through our recent pricing action and No. 1 velocity in the total dairy and plant-based milk categories.\n\nOur ACV is still limited by supply in U.S. and only 36% with significant upside once we have supply to meet demand. The increase in third-quarter sales was driven by the progress we have been making. However, we are still limited by supply.\n\nTurning to Slide 14. We ran into production challenges in Ogden at the end of August and into September that disrupted this progress. A technical issue led to one of the two Ogden oat-based lines being down for approximately three weeks. It has since been resolved, and production is stabilizing so we can start rebuilding inventory.\n\nBut it did have an impact on Q3 and will also have an impact on the volumes we can sell in the fourth quarter, which is the main driver of our guidance update Christian will touch on shortly. With all of the production back on track and Millville's second oat-based line expansion ahead of expectations, we expect production volumes to improve in Q4 and into 2023. With more volumes, we expect to close the fill-rate gap and drive distribution and market share gains with our leading velocities. We also expect accelerated revenue and margin performance in 2023 based on production improvements.\n\nTurning to Asia on Slide 15. Asia third-quarter revenue was 39.8 million. In constant currency, Asia revenue increased 22.5% year over year to 41.9 million, which is below our expectations. We are seeing that zero-tolerance COVID policy is having a continued impact in changing consumer behavior.\n\nA number of businesses have shortened business hours, consumers are traveling less, and preventive health measures have been tightened with resurgent outbreaks. The restrictions not only had an impact on top-line performance but also in profitability, which Christian will expand on later in this presentation. Our Asia team has been resilient, and we'll continue to adapt the best we can in this restrictive environment, including accelerating our expansion into retail and e-commerce. Retail and e-commerce sales represent 13% and 24% of total Asia sales this quarter, respectively, and continue to be an important growth driver going forward.\n\nTurning to Slide 16. We continue to see the power of the Oatly brand across Asia. Oatly has been nominated as the star top brand by Emagazine magazine for being a leader in the food industry and named as a leading brand by several other outlets. We continue to have the No.\n\n1 plant-based brand on Tmall with 48% market share in the new plant-based category and 24% market share in the overall plant-based category year to date through September. Our innovations are performing well with [Inaudible] expected to be in 25,000 stores by the end of Q4. We also recently partnered with Xiang Piao Piao food company to jointly develop prepackaged plant-based drinks under the Lan Fong Yuen and Oatly brand. We have two ready-to-drink co-branded products available today at convenience stores such as FamilyMart, and e-commerce platforms, including Tmall and JD.com.\n\nFrom a production standpoint. In September, our facility in Singapore started producing at full-year ramp capacity, and the Ma'anshan facility is continuing to increase production. The low-cost production would enable us to expand to other international markets across Asia as well. Though COVID-19 weighs heavily on our results for the third quarter and our outlook for the remainder of the year, underlying demand remains strong, and we continue to be excited about the growth opportunities across Asia as these external pressures abate.\n\nWith that, I would like to turn the call over to Christian to walk through the financials and guidance.\n\nChristian Hanke -- Chief Financial Officer\n\nThanks, Toni. And good morning, everyone. It's nice to speak with you today. Turning to the financials on Slide 18.\n\nRevenue for the third quarter of 2022 was $183 million, an increase of $11.9 million, or 7%, compared to revenue of 171.1 million in the third quarter of 2021. Excluding a significant foreign currency exchange headwind of $16.6 million, revenue for the third quarter would have been $199.7 million or an increase of 16.7% in constant currency compared to the prior-year period. As Toni mentioned, third-quarter revenue results were below our expectations, primarily due to production challenges in Ogden and continued market restrictions in Asia due to COVID-19. However, we experienced growth across retail, foodservice, and e-commerce channels.\n\nMoving to Slide 19. Sold volume for the third quarter of 2022 amounted to 126 million liters compared to 110 million liters last year, an increase of 14.5%. We experienced broad-based growth with 7% sales volume growth in EMEA, 17% growth in America, and 38% volume growth in Asia. Consolidated net sales per liter was $1.45 in the third quarter of 2022, compared to $1.55 in the third quarter of 2021, mainly driven by foreign exchange and promotional activities in Asia, offset by the pricing actions in the Americas and EMEA.\n\nAs a reminder, our highest regional net sales per liter is typically in Asia, followed by the Americas and EMEA. Gross profit in the third quarter was $5 million, or 2.7% gross margin, compared to $44.9 million or 26.2% margin in the prior-year period, well below our expectation. Compared to the second quarter of 2022, gross profit margin of 15.8%, we had a 1,310-basis-point sequential margin decline as shown on Slide 20. We did not achieve sequential improvement as we had anticipated, primarily due to the mentioned production issues in Americas, at our Ogden facility, and continued COVID-19 restrictions in Asia.\n\nThe decline was mainly driven by continued pricing actions of 390 basis points to offset higher cost inflation of 380 basis points; continued COVID-19 restrictions in Asia resulted in short-term underutilization of our Asian facilities, higher promotional activities, co-packer and inventory provisions of 490 basis points; unexpected production challenges at our Ogden facility, impacting our margin by 110 basis points; continued macro headwinds in EMEA slowed our new market and channel expansion, which impacted cost of production and resulted in charges related to higher scrap and co-packer volume adjustments up 630 basis points, most of which are expected to be nonrecurring; and other items, net, of approximately 90 basis points. We have seen improvement in October gross margin already, which is what gives us confidence in our ability to achieve higher gross margin in the fourth quarter. The gross profit margin improvement in Q4 2022 and into 2023 is expected to be driven by lapping these transitory, largely macro-related challenges, as well as by a select number of key actions that we are executing on: first, continued pricing actions to combat inflation; second, driving steady production progress at Ogden and our new Millville oat baseline; third, optimizing the utilization of our supply chain network, driving cost of production efficiencies; fourth, expanding our channel footprint and product portfolio in Asia to navigate the COVID-19 uncertainty; and lastly, improving our operational execution with a simplified organizational structure. Some improvements in utilization are already taking place.\n\nIn Asia, Singapore is now at fully ramped capacity. And in Americas, Millville's oat baseline expansion has commenced commercial runs in November. We expect that the continued and improved ramp-up of our production facilities in the fourth quarter of 2022 should result in improved fixed-cost absorption as well as a better sales mix and the implementation of pricing actions will drive gross profit margin expansion. Moving to Slide 2.\n\nThird quarter of 2022 EBITDA loss was 92.2 million compared to an EBITDA loss of 36.5 million in the third quarter of 2021. Adjusted EBITDA loss for the quarter -- the third quarter of 2022 was $82.7 million. The adjusted EBITDA loss was primarily related to the lower gross profit of $39.9 million and, to a lesser extent, driven by higher employee branding and customer distribution expenses, offset by lower consultancy spend and positive impact from foreign exchange rate. In the third quarter, total operating expenses as a percent of revenue increased to 59.7%, compared to 57.6% in the second quarter of 2022 due to the lower-than-expected revenue.\n\nWe expect operating expenses as a percent of revenue to improve in the fourth quarter as we closely manage costs with the actions Toni mentioned earlier. However, we will not see the full benefit until 2023. Now, focusing on our balance sheet and cash flow. As of September 30, 2022, we have cash and cash equivalents and short-term investments of $120.3 million and total outstanding debt to credit institutions of 4.4 million.\n\nWe have not drawn any loans under our revolving credit facility of approximately $320 million, excluding the accordion of an additional $76 million. Net cash used in operating activities increased by 66.6 million to $215.2 million for the nine months ended September 30, 2022, compared to 148.6 million during the prior-year period, driven by our higher loss from operation. Capital expenditures were 170.5 million for the nine months ended September 30, 2022, compared to 186.7 million in the prior-year period. Capex spend was lower than last year due to the phasing of our facility investment.\n\nNet cash used in financing activities was $10 million for the nine months ended September 30, 2022, primarily reflecting the repayment of lease liabilities and repayment of liabilities to credit institutions. Turning to the guidance on Slide 22. For fiscal year 2022, we are updating our revenue outlook and now expect revenue of $755 million to $775 million based on 2021 exchange rates or constant currency, an increase of 17% to 20% compared to fiscal year 2021. At the prevailing FX rates, this implies revenue guidance of $700 million to $720 million, an increase of 9% to 12% compared to fiscal year 2021.\n\nOur previous guidance implied accelerated revenue growth in Q3 and Q4, primarily coming from the Americas and Asia. Given the lower-than-expected revenue in Q3 and our current outlook for Q4, we have reduced our forecast. $53 million to $58 million of the reduction is driven by operational challenges in Americas, which limits our ability to accelerate sales momentum. And $32 million to $37 million is driven by COVID-19 pressures negatively impacting sales in Asia.\n\nWe believe these challenges are transitory. As COVID-19 restrictions ease in Asia and we have more stable production in Americas, we have significant opportunities for growth. As you know, currency exchange rates are volatile and difficult to predict. Our updated guidance is now based on spot rates as of September 30, 2022, accounting for approximately $50 million of the change versus the previous revenue guidance.\n\nPlease refer to the last slide independent of the earnings presentation for details on exchange rates. As I stated a few moments ago, compared to the third quarter of 2022, we expect gross margin improvement and operating expenses as a share of net revenue to improve sequentially in the fourth quarter. Moving to Slide 23. We continue to expect capital expenditures to be in the range of $220 million to $240 million for fiscal 2022 given the phasing of certain projects.\n\nWe continue to expect run-rate production capacity to be approximately 900 million liters of finished goods by the end of fiscal 2022. With the phasing of capex projects, we believe that our current sources of liquidity and capital will be sufficient to meet our existing business needs through the end of 2023. In terms of our funding plan, first, we are simplifying our organizational structure, which is expected to result in total annual savings of up to $50 million. Second, we have rephased capex projects and are working to adjust our supply chain network to a more asset-light model.\n\nThese measures support our actions to achieve future growth and profitability and will significantly reduce our capital needs. We have lowered the capital rate requirement to $200 million and extended the capital raise period until June 30, 2023, in our RCF amendment to reflect these actions. With this refined clarity on our capital needs, we are actively working on multiple financing tracks. Turning to Slide 24.\n\nWe are not in a position to provide 2023 guidance until our fourth-quarter earnings call in March. However, we expect higher revenue growth in 2023 than 2022 and to be adjusted EBITDA positive exiting Q4 2023. In order to get there, we plan to expand our distribution footprint with new geographies and within existing channels, improve gross margin, and leverage our improved cost structure with the organizational changes Toni outlined. We see a path to improving gross profit margin with the actions I discussed earlier.\n\nIn regards to our long-term guidance, we are currently evaluating the impact of the strategic actions we are taking, especially as it relates to a more asset-light, less capital-intensive operating model. Now, I'll turn the call back to Toni for closing comments.\n\nToni Petersson -- Chief Executive Officer\n\nIn conclusion, we are disappointed in the quarterly results. I remain confident in our strategy and the strength and uniqueness of our brand, which have continued to demonstrate the ability to generate demand and grow revenue. At the same time, we have taken decisive action to address the operational issues to prepare for the next phase of growth. With that review, we are now ready to take your questions.\n\nOperator?\n\nOperator\n\nThank you. Ladies and gentlemen, at this time, we will be conducting a question-and-answer session [Operator instructions] Our first question comes from the line of Andrew Lazar from Barclays. Please go ahead. \n\nAndrew Lazar -- Barclays -- Analyst\n\nGreat. Thanks very much. Maybe -- maybe to start off, I think your initial target for self-manufacturing was 50% to 60%. Do you have a new longer-term target for what self-manufacturing would look like given some of the actions you're taking? And is this move around more of an asset-light model targeted to a more specific geographic region? And then, as part of that, obviously, the shift to self-manufacturing was a -- was the key factor, I think, basically, in the -- the longer-term margin improvement story.\n\nSo, I guess, how does this margin improvement come about now? And aren't some of these sort of self-manufacturing facilities already under various states of kind of construction or completion?\n\nToni Petersson -- Chief Executive Officer\n\nHi, Andrew, This is Toni here. Thanks for your question. I just -- let me just start off with the gross margin. I will let Christian double-click on the rest of the questions here.\n\nNow, in terms of gross margin, transitioning into hybrid will potentially have a small concession on margins, but we are not ready at this time to provide any guidance as we are discussing with various parties. The small concession, though, on modest, will -- is outweighed by this -- by simplifying supply chain operations and execution. So, I can't give you any clear updates on the margins. Let's come back to that once we've finalized all the discussions. \n\nChristian Hanke -- Chief Financial Officer\n\nI don't think that there's anything more to add there, Toni [Inaudible] \n\nToni Petersson -- Chief Executive Officer\n\nWell, maybe in terms of -- maybe, Christian --\n\nChristian Hanke -- Chief Financial Officer\n\nThe self-manufacturing piece will obviously have a slightly different share of our total capacity as compared to before. I will have to come back to you on that point.\n\nAndrew Lazar -- Barclays -- Analyst\n\nYeah, I just didn't know how -- how significant the magnitude of that change would be, you know? And then, any specific geographic region that that's focused on and as -- as you make these shifts, or do we not know that yet either?\n\nChristian Hanke -- Chief Financial Officer\n\nWorking across all of the various regions, I mean, we're specifically looking at one facility in the U.S, Dallas-Fort Worth, and then U.K. [Inaudible]\n\nAndrew Lazar -- Barclays -- Analyst\n\nGot it. And then just a quick clarification. I think you had mentioned, 4Q, you expect gross margins to improve sequentially. And then, Christian, earlier in the -- in the prepared remarks, you mentioned 4Q gross margin expansion.\n\nSo, I didn't know if that meant year-over-year expansion or not. I was hoping you could just clarify that. Thank you.\n\nChristian Hanke -- Chief Financial Officer\n\nSequential improvement compared to the third quarter is what we meant.\n\nAndrew Lazar -- Barclays -- Analyst\n\nGot it. Thank you.\n\nToni Petersson -- Chief Executive Officer\n\nAnd can I just clarify again, because you mentioned magnitude, what we see is potentially a small concession of the margins [Inaudible]\n\nAndrew Lazar -- Barclays -- Analyst\n\nGot it. Got it. Thank you.\n\nToni Petersson -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nThank you. Our next question comes from the line of Ken Goldman from J.P. Morgan. Please go ahead.\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nHi. Thank you. I wanted to build on Andrew's line of questioning about the pivot toward a more hybrid strategy. You know, obviously, to his point and your point, there were better economics that you had laid out for end-to-end manufacturing.\n\nBut, you know, you had also talked about some others -- some other tailwinds, right, in terms of having more control over the process. I think you had mentioned some flexibility to, you know, maybe build some value-added processes when you control the entire supply chain. So, you know, I do appreciate the need to conserve cash right now. I do understand that companies can pivot, but I'm just curious how comfortable you are with some of the choices you have to make.\n\nI don't want to use the word sacrifices, but choices, as you kind of veer away from end to end on a more permanent basis.\n\nToni Petersson -- Chief Executive Officer\n\nNo, thanks, Ken. I think that's a great question here. So, let me just elaborate a little bit here. So, we are continuously adapting our -- to our environment, and this is just one example of that.\n\nAnd fundamentally, we will need more capacity to support growth. This gives us flexibility to add capacity faster. There are a number of reasons why we're taking this course. And if you allow me, just -- just let me bring forward three of them.\n\nSo, first of that is resource allocation decision. Now building, you know, multiple end-to-end factory is just a heavy lift, especially now. Hybrid enables us to put more focus on our proprietary oat-based production and other value-driving items such as, you know, innovation, branding, sales, etc. So, we simplify and remove complexity.\n\nSecond, the availability of strategic co-packers is easier to find now than before since we have both scale and growth. So, meaning that we have more qualified partners to work with in terms of food safety, quality, and -- and security of supply. Now, because you are hitting on -- on the finance here, we have the liquidity and are confident in our ability to raise capital going forward, but this does not drive the decision. This is a business strategic decision considering the macro environment.\n\nWe want to drive innovation and sales aggressively and want to be focused about it. So, it was difficult to do everything we did before, and it's even harder now, as you know. So, we just want to make things easier on ourselves to simplify execution. So, it was -- I know it was a long answer, but I just want to give you color.\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nThat's helpful. Thank you. And then, I wanted to ask, you know, the departures of the chief supply chain and EMEA heads, Can you give us a little more color about the circumstances around that, which was made by these individuals? Typically, we'll hear a little more color than just they've departed the company.\n\nToni Petersson -- Chief Executive Officer\n\nWell, we are continuously evaluating the skill set. And, you know, as we grow a high-growth company, the capabilities of both JC, Daniel, and specialty combined is -- is really, really adding a lot of value to the company. And -- and Jean-Christophe has a very solid background in building other companies rapidly, including the complete supply chain network on a global scale. And that is, of course, something that we want to benefit from.\n\nAnd besides that, John-Christophe is also overseeing innovation, food science, supply chain vis-a-vis expandability and people in transformation functions. Daniel is focusing on -- on the -- on -- on supporting and leading the regional businesses here. But to your point, we are just an organization that is continuously evaluating various skill sets across the organization.\n\nOperator\n\nThank you. Our next question comes from the line of Rupesh Parikh from Oppenheimer. Please go ahead.\n\nErica Eiler -- Oppenheimer and Company -- Analyst\n\nGood morning. This is actually Erica Eiler on for Rupesh. Thanks for taking our questions. So, I guess I just wanted to hit on cost pressures real quickly, just sort of the latest you're seeing here.\n\nYou know, curious what remains the biggest pressure point and maybe where you see some things starting to ease. And then, you know, along those lines, you know, some of your CPG peers have, you know, given some early reads in terms of what they're expecting next year. If there's any color you can provide there, that would also be helpful.\n\nChristian Hanke -- Chief Financial Officer\n\nYeah. I mean, in terms of the inflationary pressure, what we're expecting in the fourth quarter compared to the third quarter is, in terms of COGS, inflation increase of around 3% to 4% across direct materials conversion cost, you know, electricity, labor. So, that's -- that's what we're saying. And then, going into 2023, it's not at the same levels that we have experienced so far this year, which is in the high double digits.\n\nCurrently, what we're seeing is in the range of 6% to 7% on a consolidated level in 2023. And I think I also want to add in terms of what we will do is to continuously combat inflation with pricing actions.\n\nErica Eiler -- Oppenheimer and Company -- Analyst\n\nOK, great. And then just, you know, given the macro impacts on your business, I mean, you've talked about some of the slower version of plant-based that you've seen in recent quarters. I mean, can you maybe just give us an update in terms of what you're seeing there in terms of consumer behavior and kind of the -- the -- the slower conversion that you've been seeing and kind of how that -- how that looks lately?\n\nToni Petersson -- Chief Executive Officer\n\nThanks, Erica. This is Toni. And so, just want to make sure that it's clear that the getting down has nothing to do with the grant or demand. The underlying demand for our product, it's still strong.\n\nWe start to see signs of growth in Europe that Daniel will -- can double click on. In Asia, we are building us our positioning stronger despite COVID-19 in terms of adding doors and partnerships in foodservice and in retail channels. And in U.S., we still have the -- the highest velocities in the dairy universe. And, Daniel, maybe you can put some color to -- to that [Inaudible]\n\nDaniel Ordonez -- Chief Operating Officer\n\nThank you, Toni. And thank you for the question. It's -- it is indeed -- let me acknowledge that this is pretty extraordinary environment and why we are -- we are experiencing. However, what we observe is that our velocities remain very strong and the penetration levels continue to be very stable.\n\nSo, we don't see any -- any wavering on that. And we also see, specifically related to the last earnings call. and with that, we improve execution. In our part, we see the -- the ability to start changing the dynamics of the category.\n\nSo, we have seen some volume growth restoring in the countries in EMEA, the Netherlands, Germany, where we are growing ahead of private label, and also the U.K. So, with improved execution, the path is to converting dairy consumers into plant-based. And we see that impact. As you know very well better than me, in the U.S., it's all about capacity, supply, meet the service levels, which are improving.\n\nErica Eiler -- Oppenheimer and Company -- Analyst\n\nGreat. That's very helpful. I'll pass on.\n\nDaniel Ordonez -- Chief Operating Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Brian Holland from Cowen and Company. Please go ahead.\n\nBrian Holland -- Cowen and Company -- Analyst\n\nYeah. Thanks. Good morning. I want to follow up on Andrew Lazar's question at the top.\n\nI think you mentioned, Toni, during your prepared remarks, you called out Texas in particular when discussing the pivot to a more hybrid production network. I just wanted to try to get a little more color around that. So, you know, is the Texas facility under construction yet? And what could a manufacturing partnership look like? You know, would that be a lease back? I think Andrew was asking about, you know, how this sort of evolves given some of these facilities are under construction. So, just trying to get a sense of the capacity situation sort of shifts from Oatly to co manufacturers or, in essence, taking capacity out or if you're still building all these plants and maybe just working with partners from there.\n\nToni Petersson -- Chief Executive Officer\n\nSo, hi. Hi, there. Well, that's a good question. Thank you.\n\nFirst of all, what we do here is to protect growth. And we're balancing and calibrating growth and cost here. And first of all, it will not have an impact on -- on volumes going forward or the growth rate going forward. In terms of Texas, yes, we are building there, but what we are now thinking about is -- or very actively pursuing is to turn Fort Worth into a hybrid model like we have listing in Yeo Hiap Seng as well in Singapore.\n\nAnd that also go for -- goes for Peterborough. Now, JC, maybe you want to -- maybe a little bit?\n\nJean-Christophe Flatin -- Global President\n\nThank you, Toni. And hi, Brian. So, scope-wise, across -- as for the U.S. and the other one that we are currently building that is, of course, in Peterborough in the U.K., in both cases, we are actively working to find the right strategy partners.\n\nAnd to answer the second part of your question, while we are looking at what we call our hybrid model, where we really take ownership and full responsibility for [Inaudible] the oat-based process, and then we partner with other company partners for the filling part. So, I think we -- the intent is to do exactly the same model. It has served us well, and -- and we see that as a great way to nurture [Inaudible]\n\nBrian Holland -- Cowen and Company -- Analyst\n\nGreat. I appreciate the color there. And then, I wanted to talk about the -- the U.S.' total distribution points, and the track channels appear to decelerate meaningfully commensurate with the recent shelf resets. Several of your oatmeal competitors accelerated simultaneously.\n\nHow much is that dynamic that we're seeing is just your inability to supply at this point versus customers now opting to give space to peers who -- who maybe today are in a better position to fill that shelf space? And maybe said another way, is it fair to say you are getting punished by customers at this point that you're -- for lack of a better term? \n\nDaniel Ordonez -- Chief Operating Officer\n\nI'll take that, Brian. Daniel here again. Let me -- let me add some of the details that you're asking rightfully. Demand and velocities remain very resilient in the U.S., and we don't see any effect, any impact on that.\n\nAnd the best proof of that is the recent market share development, where we see -- in the last 12 and four weeks, we see we're gaining share despite the service-level issues. So, that's exactly -- as you said, that's exactly what you're seeing there. The impact in some of the TDPs have to do with the service levels, which we see are improving already. And we look forward to sharing more with you in the next earnings call.\n\nToni Petersson -- Chief Executive Officer\n\nBrian, just to be clear, no, it is related to supply. And also, remember that we're still balancing supply between retail and foodservice channel.\n\nBrian Holland -- Cowen and Company -- Analyst\n\nUnderstood. Appreciate it. I'll leave it there. Thank you.\n\nDaniel Ordonez -- Chief Operating Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Rob Dickerson from Jefferies. Please go ahead.\n\nRob Dickerson -- Jefferies -- Analyst\n\nGreat. Thanks so much. Just a question for you, Christian. I thought I heard you say in the prepared remarks kind of briefly, you know, also kind of looking into other or, let's say, multiple financing tracks, you know, if -- if needed over time for incremental capital.\n\nMaybe if you could just expound on that. Whatever you're willing to actually say would be helpful. \n\nNo, I mean, I think we -- we -- we are actively working on multiple financing tracks, and we will provide more clarity when we have more to share. I mean, one example is -- which I didn't say in our prepared remarks, is that we just recently signed a credit -- local credit facility in -- in Asia [Inaudible] providing more flexibility there. But we're actively working on and we're very confident we also have the support from our shareholders as well.\n\nOK, fair enough. And then, just, you know, in terms of -- I mean, it sounds like it's really the two facilities that, you know, are shifting more to hybrid versus the end to end. And, you know, when we think about the capital needs kind of previously that sort of required, you know, kind of for the full development of the prior plan, I think, at some point, you had thrown out a number approximately, let's say, $400 million or so to complete all the projects in capex. Now, I look at all the facilities.\n\nI know the two that would be shifting. And then, I hear you talk about, you know, the savings come in kind of more from, you know, the P&L side. In terms of that capital savings piece, you know, is this like somewhat of a material, you know, savings piece on the capex side? Or would you argue it's probably a little bit more P&L related with obviously some -- some reduction in longer-term capex? And that's it. Thanks. \n\nChristian Hanke -- Chief Financial Officer\n\nNo, in terms of the cap -- of the lower capital requirement, a big part of that is related to the strategic direction that we laid out in the call in terms of turning into a more asset-light model. We also talked about the capex phasing actually in our previous earnings call when we reduced our annual capex by $200 million in 2022. That -- combined -- we reduced the capital funding that we have by -- by 200 million.\n\nRob Dickerson -- Jefferies -- Analyst\n\nRight. OK. But -- but, I mean, this -- this -- this next phase that we're discussing today, you know, it doesn't sound like that was the lion's share. The lion's share was kind of what we were talking about on the reduction in Q2 call.\n\nIs that -- is that fair?\n\nChristian Hanke -- Chief Financial Officer\n\nYeah, but also looking ahead, if you're looking more moving toward an asset-light model, that will also drive a lower capital needs going forward as well.\n\nRob Dickerson -- Jefferies -- Analyst\n\nOK. OK. All right. All right.\n\nThank you so much.\n\nToni Petersson -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Bryan Spillane from Bank of America. Please go ahead.\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nThanks, operator. Good morning, everyone. Just -- just two questions on my end. The first one, in Ogden, you described technical -- some technical issues.\n\nCan you provide more color on -- on what -- what the technical issues are? Is it the equipment doesn't work? Is it a lack of training? Just really trying to understand, you know, like what -- what actually isn't working?\n\nJean-Christophe Flatin -- Global President\n\nThank you, Bryan. Jean-Christophe. I will take this one. So, in Ogden, lead to two different things.\n\nOne is the continued development of -- of the factory. I think we said last quarter we were in the last-mile improvements to enter production, and the reality is that we are still improving and stabilizing production. So, Daniel and myself have been three times to the site. We have now very clear root-cause analysis of what driving this long ramp-up, and we have now clear action plan.\n\nAnd I'm happy to report that, over the last six to eight weeks now, we have seen stable production there. On the other side, what Toni referred to is we have a one-time incident -- technical incident in the line at the end of the third week of August that kept one of our two old big lines still up to meet September. And because you asked for specificity, what happened is we had an incident with one of our fire suppression system, which is a safety device that is connected in the pipe between the oats -- where we receive oats from our oat tank into the process. It's a safety device that didn't work anymore.\n\nAnd it took us a lot of time to get it to replace simply because it was an empty explosive device into that, which means we cannot extract it and it has to go through the hole. So, that's exactly what happened. But the main topic is we continue the ramp-up, the full production, and we see good stability in the past weeks.\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nOK. Now, that's -- that's very helpful. Thank you for the detail. And then, I guess maybe the follow up on -- on the earlier question around, you know, multiple financing tracks.\n\nToni, have you thought at all of you -- has -- has Oatly at all explored the potential of -- of just merging with someone who's larger, has more scale? I mean, there's a little bit of, like, the dog caught the car here, like you've caught the -- you've got the growth, but really, you know, having a difficult time scaling up to -- to -- to sort of service that growth. So, you know, in the range of possibilities, you know, is that -- is that something you've considered? And, you know, if not, why?\n\nToni Petersson -- Chief Executive Officer\n\nNo, it's -- it's a good question. And the answer is no, we're not exploring that path.\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nAnd -- and why?\n\nToni Petersson -- Chief Executive Officer\n\nWell, the -- the ways that we have, our runway is absolutely massive. And remember one thing, the hurdles that we have experienced are very much related to the macro combined with supporting the high growth that we have. So, there's so much -- so much more to do, and we have so much confidence in that very decisive strategic actions that we're taking now to prepare this organization and company for growth. And again, we have this underlying demand.\n\nAgain, no demand issues. We see the opposite. We see velocity strength. We see market share gains.\n\nWe see us expanding across regions. So, the confidence level is high. This is -- this has been very much an execution exercise that we need to improve, and we are taking decisive action. So -- so, that is the reason.\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nOK, great. Thanks, Toni.\n\nToni Petersson -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of John Baumgartner from Mizuho. Please go ahead.\n\nJohn Baumgartner -- Mizuho Securities -- Analyst\n\nGood morning. Thanks for the question. I want to come back to the reorganization and reductions to your operating expenses. Relative to sales, your opex is a multiple of your peers with similar levels of revenue.\n\nAnd I guess a big part of that gap can be explained by the infrastructure to support your geographic breadth, and that gets leveraged over time with sales. So, as you've given the business a second look here, what costs have become more discretionary in your view relative to what was maybe previously viewed as more structural in nature? And how do we think about the risk that you're reducing costs excessively or at least prematurely? Thank you.\n\nJean-Christophe Flatin -- Global President\n\nSo first of all -- Jean-Christophe speaking. I think, technically, within our SG&A costs, you have also customer distribution costs. So, I think that's -- that's an important factor when you benchmark or compare which -- which I know is at the heart of [Inaudible] So then, to your next question, which was as we reset our cost base, are we taking any risk there, I think we have -- we have had a very, very bottom-up approach. We have done the entire analysis ourself leveraging the very people that exist in the various teams.\n\nAnd we have really done the exercise in the exact -- with the three streams that Toni has listed initially. So, the question we asked was what do we need, capability-wise, in order to propel us into the next chapter of growth. So, we are really looking for a scalable model. The second thing that's driving us is simplicity and clarity.\n\nAs any fast-growth company, we have grown very fast and so have some parts of our organization, and therefore, we really needed to bring simplicity and -- and clarity. And finally, the expected outcome of that is by diminishing our fixed-cost structure is to accelerate the path to profitability, which both Toni and Christian, I believe, referred to. The specific intersection we have looked at first, back to your regional resources, was the intersection of the corporate and the global layer with the European layer. And Daniel and I coming in, in June, we had the opportunity to see some opportunities there, and this is what we have done.\n\nSo, I want to leave you with the thing that really the main priority. The main focus for us has been to position ourselves to invest in growth because that is and will remain our No. 1 priority.\n\nJohn Baumgartner -- Mizuho Securities -- Analyst\n\nOK. Thanks for that. And just a follow-up on the European environment. It looks like, in the slide deck, that velocity in the U.K.\n\nand Germany was down about, you know, high single digits sequentially versus Q2, which was better than the category. I'm just curious, how much of that was -- was due to the seasonality relative to just the overall macro environment? And what's your confidence level for seeing velocities and demand sort of bottoming, you know, given the -- given the macro uncertainty in Europe? Thank you.\n\nDaniel Ordonez -- Chief Operating Officer\n\nThanks for the question. Daniel taking it here. And I think you're referring very well to what Toni was mentioning in the previous earnings call. That means these were the following.\n\nWe have seen, with improved execution, better synchronization and resource allocation on our innovation and distribution points. We see the early signs of restoration of growth. It's early days, but we have seen two, three months of stable volume growth across the markets in Europe. And we have seen that reflected -- that reflected in market share gains.\n\nAs I said to one of your colleagues before, we're even growing ahead of private labels in Germany. So, we are starting to connect the dots. Thank you.\n\nOperator\n\nJohn, any further questions for the management?\n\nJohn Baumgartner -- Mizuho Securities -- Analyst\n\nNo, no, I'm good. Thank you.\n\nOperator\n\nThank you. Ladies and gentlemen, we have reached the end of the question-and-answer session. And now, I would like to turn the conference to Toni Petersson, CEO, for closing comments.\n\nToni Petersson -- Chief Executive Officer\n\nSo, thanks, everybody, for joining us today. We look forward to speaking with many of you over the coming weeks and -- and on our next earnings call in March. A safe and happy holiday season. Thank you, everybody.\n\nOperator\n\nThank you. The conference has now concluded. Thank you for your participation. You may now disconnect your lines.\n\nDuration: 0 minutes\n\nRachel Ulsh -- Investor Relations\n\nToni Petersson -- Chief Executive Officer\n\nChristian Hanke -- Chief Financial Officer\n\nAndrew Lazar -- Barclays -- Analyst\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nErica Eiler -- Oppenheimer and Company -- Analyst\n\nDaniel Ordonez -- Chief Operating Officer\n\nBrian Holland -- Cowen and Company -- Analyst\n\nJean-Christophe Flatin -- Global President\n\nRob Dickerson -- Jefferies -- Analyst\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nJohn Baumgartner -- Mizuho Securities -- Analyst\n\nMore OTLY analysis\n\nAll earnings call transcripts"
}