{
  "companyName": "Futu Holdings Ltd",
  "companyTicker": "FUTU",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/30/futu-holdings-ltd-futu-q2-2022-earnings-call-trans/",
  "content": "Futu Holdings Ltd (FUTU -31.00%)\nQ2 2022 Earnings Call\nAug 30, 2022, 7:30 a.m. ET\n\nOperator\n\nHello, ladies and gentlemen. Welcome to Futu Holdings second quarter 2022 conference call. [Operator instructions] Today's conference call is being recorded. [Operator instructions] I would now like to turn the conference over to your host for today's conference call, Daniel Yuan, chief of staff and head of IR at Futu.\n\nPlease go ahead, sir.\n\nDaniel Yuan -- Chief of Staff, Head of Investor Relations\n\nThanks, operator, and thank you for joining us today to discuss our second quarter 2022 earnings results. Joining me on the call today are Mr. Leaf Li, chairman and chief executive officer; Arthur Chen, chief financial officer; and Robin Xu, senior vice president. As a reminder, today's call may include forward-looking statements, which represent the company's belief regarding future events, which, by their nature, are not certain and are outside of the company's control.\n\nForward-looking statements involve inherent risk and uncertainty. We caution you that a number of important factors could cause actual results to differ materially from those contained in any forward-looking statements. For more information about the potential risks and uncertainties, please refer to the company's filings with the SEC, including its registration statement. So with that, I will now turn the call over to Leaf.\n\nLeaf will make his comments in Chinese, and I will translate.\n\nLeaf Li -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nDaniel Yuan -- Chief of Staff, Head of Investor Relations\n\nThank you all for joining us today. As of quarter end, we had approximately 1.4 million paying clients, up 39% year over year. Net addition was over 60,000, bringing our first half-paying clients growth to 143,000. This is also the 10th consecutive quarter for which organic growth contributed over 50% of new paying clients.\n\nLeaf Li -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nDaniel Yuan -- Chief of Staff, Head of Investor Relations\n\nIn the second quarter, client acquisition was resilient in Hong Kong, where we launched targeted marketing campaigns around the green bond issuance in May and attracted allocation-driven clients to subscribe to the green bond on our platform. We contributed over one-third of the overall green bond subscribers, which speaks to our leading brand recognition and superior product experience. In Hong Kong, we will continue to focus on clients over 30 years old as our current penetration rate among 30-plus Hong Kong residents is at a near 7.5%. To achieve that, we have rolled out new marketing initiatives and launched new features, including the light trading mode, which offers a more simplified and sleek trading interface, and the regular savings plan for Hong Kong stocks, which caters to clients less interested in market timing.\n\nIn Singapore, we've realized that the local users are more conservative during market downturn and thus launched a series of investor education activity to help users understand how to better navigate market turmoil and continue to diversify our product offerings in wealth management. We are encouraged to see that our quarterly client retention rate remained above 98% despite sharp market correction in April and May.\n\nLeaf Li -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nDaniel Yuan -- Chief of Staff, Head of Investor Relations\n\nTotal client assets decreased 14% year over year and increased 12% quarter over quarter to HKD 434 billion. The sequential increase was largely due to strong net asset inflow across different regions, and to a lesser extent, rebound of China technology names in June. In Singapore, we continued to acquire higher-quality clients. The average asset balance of our newly acquired paying clients in Singapore exceeded SGD 10,000 within three months.\n\nThis compares to about nine months for clients we acquired last year. Margin financing and securities lending balance increased 13% quarter over quarter as sentiments around technology stocks improved sequentially.\n\nLeaf Li -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nDaniel Yuan -- Chief of Staff, Head of Investor Relations\n\nTotal trading volume was HKD 1.3 trillion, up 2% quarter over quarter. U.S. stock trading volume was HKD 897 billion, constituting 67% of the total volume and up 6% quarter over quarter. The sequential growth was mostly driven by higher turnover of leveraged and inverse ETFs amid heightened market volatility.\n\nHong Kong stock trading volume was HKD 424 billion, down 5% sequentially due to muted market sentiment around China tech names in Hong Kong. In the meantime, our market share in Hong Kong futures and options trading climbed to 6.7% and 13.5%, respectively. We launched multi-leg options function for Hong Kong stocks by the end of June, which enables our clients to formulate advanced options trading strategies to better manage risk and achieve investment targets. We believe this function will attract more sophisticated options traders to our platform.\n\nLeaf Li -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nDaniel Yuan -- Chief of Staff, Head of Investor Relations\n\nTotal client assets In wealth Management were HKD 22 billion, up 59% year over year and 5% quarter over quarter. As of quarter end, over 200,000 clients, 15% of our total paying client base, held wealth management products. The money market funds became increasingly attractive to our clients amid interest rate hike. And to help our clients navigate a ripe inflation environment, we also launched the model portfolio of global real return strategy in collaboration with Aberdeen.\n\nIn Singapore, wealth management asset balance increased 377% quarter over quarter as we further expanded mutual fund offerings and launched new product features.\n\nLeaf Li -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nDaniel Yuan -- Chief of Staff, Head of Investor Relations\n\nAs of quarter end, we have 276 IPO and IR clients as well as 519 ESOP clients, up 48% and 97% year over year. Over 1,000 companies are now using their enterprise accounts in our social community to communicate with retail investors. Among the new additions in the second quarter are BYD Electronics and Tianqi Lithium. In the first two quarters, we acted as the underwriter for 12 Hong Kong IPOs, tied for first place in terms of the number of Hong Kong IPOs underwritten.\n\nLeaf Li -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nDaniel Yuan -- Chief of Staff, Head of Investor Relations\n\nWe believe that our superior user experience remains our biggest competitive advantage. In the first half of this year, we continued our relentless pursuit of product experience by releasing 99 versions of our mobile app and desktop clients and adding 3,989 new features, up 21% and 52% year over year. Going forward, we intend to launch more customized features for clients of different regions.\n\nLeaf Li -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nDaniel Yuan -- Chief of Staff, Head of Investor Relations\n\nNext, I'd like to invite our CFO, Arthur, to discuss our financial performance.\n\nArthur Chen -- Chief Financial Officer\n\nThanks, Leaf and Daniel. Now please allow me to walk you through our financial performance in the second quarter. All the numbers are in Hong Kong dollars, unless otherwise noted. Our total revenue was HKD 1.7 billion, up 11% from HKD 1.6 billion in the second quarter of 2022.\n\nBrokerage commission and handling charge income was HKD 1 billion, an increase of 30% year over year and 7% Q over Q. The year-over-year increase was mostly driven by a higher blended commission rate of 7.7 basis points, up from 6.1 basis points in the year-ago quarter, underpinned by greater contribution from derivative trading. The Q-over-Q increase can be attributed to our commission-per-share pricing model for U.S. stock trading as a decrease in the average share price of the stock our clients trade can result in a higher blended commission rate.\n\nInterest income was HKD 620 million, an increase of 2% year over year and 8% Q over Q. The slight increase year over year was due to higher income from cash deposits and securities lending, which was largely offset by lower margin financing income and IPO financing interest income. The Q-over-Q increase was mostly due to higher interest income from cash deposits amid a rising rate environment. Other income were HKD 93 million, down 45% year over year and 6% Q over Q.\n\nThe year-over-year decrease was driven by a lower IPO financing service income and underwriting fee income. The Q-over-Q decrease was mainly due to lower currency exchange income and enterprise public relationship service charge income. Our total costs were HKD 208 million, a decrease of 25% from HKD 279 million in the second quarter of 2022. Brokerage commission and handling charge expenses were HKD 88 million, down 40% year over year and 10% Q over Q.\n\nDespite the year-over-year increase in brokerage commission and handling charge income, the expenses declined due to the cost savings from our U.S. sales -- U.S. securities self-clearing migration and upgraded service package with our U.S. clearinghouse and the lower IPO subscription fees.\n\nThe Q-over-Q decrease was mostly due to self-clearance. Interest expenses were HKD 27 million, down 67% year over year and 32% Q over Q. The year-over-year decrease was mostly due to lower expenses for margin financing and IPO financing. The sequential decline was driven by lower blended funding costs as we finance an increasing percentage of our margin book with cash collateral generated from security borrowing.\n\nProcessing and service costs were HKD 94 million, up 74% year over year and 1% Q over Q. The year-on-year increase was primarily driven by higher cloud service fees to support overseas market expansion and process a large number of concurrent trades. As a result, total gross profit was HKD 1.5 billion, an increase of 19% from HKD 1.3 billion in the second quarter of 2021. Gross margin was 88%, as compared to 82% in the second quarter of 2021.\n\nOperating expenses were HKD 747 million, up 12% year over year and down 4% Q over Q. To break down, R&D expenses were HKD 292 million, up 69% year over year and 3% Q over Q. The increase was mainly due to an increase in R&D head count as we continued to support a new product offering, invested in the U.S. self-clearing capabilities, and customized product experience in different markets.\n\nSelling and marketing expenses was HKD 219 million, a decrease of 42% year over year and 24% Q over Q. The year-over-year decrease was due to lower overall marketing and branding spending, especially in international markets. The expenses declined Q over Q as marketing spending came down due to slower paying client growth. G&A expenses were HKD 211 million, up 118% year over year and 19% Q over Q.\n\nThe increase was primarily due to increase in head count for general and administrative personnel. As a result, our net income increased by 20% year over year and 12% Q over Q to HKD 639 million. Net interest margin expanded to 37% in the second quarter, as compared to 34% in the same quarter last year, partially attributed to lower tax rate of 10%. This lower tax rate was due to the tax credit benefit from our U.S.\n\nself-clearinghouse. We maintain our long-term tax rate guidance of 12% to 14% for tax benefit for later another two quarters also. That concludes our prepared remarks. We'd now like to open the call to questions.\n\nOperator, please go ahead.\n\nOperator\n\nThank you. [Operator instructions] And the question comes from Cindy Wang from China Renaissance. Please ask your question.\n\nCindy Wang -- China Renaissance -- Analyst\n\n[Foreign language] OK. Thanks for taking my question. So I have two questions. So first question is, can management give us some breakdown for the customer acquisition by different regions? Since July and August, the stock market turnover are coming down.\n\nSo what's the new customer acquisition trend in July and August? Please give us some color on that. And the second question is related to Singapore. Since Futu has got the self-clearing license in Singapore, so do we have any schedule when we will finish the self-clearing for the Singapore stocks? And the ones we finished the self-clearing, can we have further helping out in terms of the Singapore new customer acquisition? Thanks.\n\nArthur Chen -- Chief Financial Officer\n\nThank you, Cindy. Let me just answer your second question first. I will leave the first question in terms of the new paying clients breakdown to my colleague, Robin. I think now the most -- the focus of our technology capabilities still lies on our U.S.\n\nself-clearing operations. This migration has conducted very smoothly. And so far, we have already migrated over 80% dollar value of our U.S. security positions from our business partners to our own clearing house.\n\nAnd we do expect this exercise will be largely complete by the end of this year. Afterwards, we do think -- you're right, the self-clearing capability in the Singapore market definitely is on our schedules, but we will be following subsequent to the completion of our U.S. self-clearing migrations.\n\nRobin Xu -- Senior Vice President\n\n[Foreign language]\n\nCindy Wang -- China Renaissance -- Analyst\n\nOK. Thank you. Very clear.\n\nOperator\n\nYour next question comes from the line of Zoey Zong from Jefferies. Please ask your question.\n\nZoey Zong -- Jefferies -- Analyst\n\n[Foreign language] Thanks, management for taking my question. Congratulations on the solid results first, and I have two questions. So first, in Q2, we recorded HKD 95.5 million loss. So please provide more color about this item? And my second question is how should we expect the customer acquisition [Inaudible]? Thank you.\n\nArthur Chen -- Chief Financial Officer\n\nThank you. I'll also take your second question first. I think you are right. The year-to-date volatility in the capital markets definitely had some certain negative impacts in terms of our client positions.\n\nAnd you can see our blended CAC number is around HKD 3,500 in the second quarter, which is slightly higher than our previous guidance of HKD 2,500 to HKD 3,000. We do think the current market turmoil may be continued in the near term or even in the whole second half of this year. So therefore, we do think our previous estimation may be a little bit too optimistic. And we currently expect the CAC numbers in the second half of this year may maintain at the current level for a while.\n\nCan I just -- could you just repeat your first question regarding the P&L items?\n\nZoey Zong -- Jefferies -- Analyst\n\n[Foreign language]\n\nArthur Chen -- Chief Financial Officer\n\nSure. The others mainly consist of unrealized financial gain on the loss. The nature is that we provide certain margin financing to our clients, which trade A-shares Connect. Previously, we do pour in the offshore RMBs to fund this margin balance.\n\nBut given the current -- the balance sheet situation, actually we try to -- we have exchanged certain of the positions from our Hong Kong dollar position to the RMB position ourselves. Due to the very volatile RMB-Hong Kong dollar movement in May and June, we recorded unrealized loss. But this is actually on the cash item. If we look in the long run, we do think it can be a chance to reverse that.\n\nZoey Zong -- Jefferies -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. We will take our next question. And the question comes from Emma Xu from Bank of America Securities. Please ask your question.\n\nEmma Xu -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language] So my question is regarding the financial impact of U.S. self-clearing, as well as the U.S. rate hike's impact to your financials.\n\nArthur Chen -- Chief Financial Officer\n\nSure. Let me answer these two financial number questions. For the self-clearing, as I mentioned before, we have already migrated over 80% of our U.S. stock positions to our own clearinghouse.\n\nAccording to the current run rate, we do expect in the second half of this year the self-clearing capability can enhance HKD 200 million to HKD 250 million incremental revenues to our own P&L. Secondly, regarding the interest rate hike, definitely we do think we are a beneficiary from the rate cycle given that we will get more interest income from client's idle cash. Just do some very simple calculations, as the rate hike do follow the consensus expectation nowadays, say, toward the end of this year, the rate will be increased to, say, 300 or 325 basis points. In the second half of this year, we can generate additional HKD 200 million to HKD 250 million interest income because of that.\n\nEmma Xu -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language]\n\nArthur Chen -- Chief Financial Officer\n\nJust to the second half of this year.\n\nEmma Xu -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Thank you. That's very clear.\n\nArthur Chen -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. We will take our next question. And the question comes from Leon Qi from Daiwa. Please ask your question.\n\nLeon Qi -- Daiwa Capital Markets -- Analyst\n\n[Foreign language] Thank you for the opportunity to ask my question. Congrats on the very strong results. I have two questions today. Firstly is regarding your new customer acquisition guidance.\n\nAppreciate your very strong new customer acquisition in the second quarter, which reached 61,000. And given you had also a very strong customer acquisition in the first quarter, now your first half new customer acquisition has reached well over 50% of your full year guidance of 200,000. So wondering if management want to take any revisions to your full year target of 200,000. The second question is regarding your capital management.\n\nWe are very delighted to see that the free cash position of the company actually saw a sequential increase while the company is doing very decent buybacks. Could management give us any color in terms of the comfortable level of the cash position you want to hold so that we have some clues to gauge the amount of capital that you will be kind of made available to return to shareholders. Thank you very much.\n\nArthur Chen -- Chief Financial Officer\n\nThank you, Leon. I'll let my -- our CEO, Leaf, to answer your first question and I will take your second question afterwards.\n\nLeaf Li -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nDaniel Yuan -- Chief of Staff, Head of Investor Relations\n\nSo the overall market has recorded pretty poor performance year-to-date, and we expect this uncertainty to persist for a reasonable period of time in the future. And we believe the current market is not that attractive to new clients and we think we'll continue to focus more on the quality of our new clients, the net asset inflow of our existing clients and the unit economics of the various regions, especially in such a sluggish market. So we now plan to keep our previous guidance of having 200,000 net new paying clients, and we may revisit the guidance later on this year. Thank you.\n\nArthur Chen -- Chief Financial Officer\n\nYes. For the second question, I think we are still in the early stage of Futu's long-term growth strategy. So it is too early to tell ideal capital ratios we should focus. Instead to give a fixed number, I think what we focus will be our long-term growth potential, especially in the new markets, and also further deployment of our resources on the key technology operations going forward.\n\nDefinitely, we will focus more on the client -- on the ROE side in the long run. But in the near future, I do expect we do not have any, say, dividend payout plans in the foreseeable future.\n\nLeon Qi -- Daiwa Capital Markets -- Analyst\n\nOK. Thank you very much.\n\nArthur Chen -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. We will take our next question. And the question comes from the line of Frank Zheng from Credit Suisse. Please ask your question.\n\nFrank Zheng -- Credit Suisse -- Analyst\n\n[Foreign language] Let me quickly translate my two questions. The first one is on blended fee rate. As we see fee rate continue to increase in the second quarter on a sequential basis, can the management provide more color on the drivers behind this time? And also, will this trend pass into the second half? And the second question is on IPO market. As Hong Kong IPO market slowly recovers, do we see a recovery in the IPO bridge loan interest income and subscription fee income? And in terms of proportion, what is the proportion of IPO rev income as of total revenue? Thank you.\n\nArthur Chen -- Chief Financial Officer\n\nSure. I will take these two questions. As I mentioned in the opening remarks, you're right, you do see on a blended basis our commission rate continue to hike year-on-year basis and also Q-on-Q basis. Largely, I think, it's more contributions from the derivative trading, which now roughly accounts for 30% of our total trading commission revenues.\n\nBut we do not have any target or try to encourage people to trade on these derivative stuff. The other indication is because of the market volatility in the U.S. market, in particular, the reason is we set our commission per share pricing model for our U.S. stock trade.\n\nYou can understand that in the second quarter, U.S. markets corrected significantly. So a decrease in the average share of the stock of client trade can actually result on higher blended commission rate. So this is more due to the market volatilities.\n\nFor the second question, the contribution from the IPO business actually in history just accounts for high single-digit or low teen numbers of our total revenues. We do think it will -- we do not see a very meaningful pickup despite the number of IPO in Hong Kong starts to rebound since June. I think it will still take some time for the market, especially for the retail investors, to build up further momentum to participate in these transactions.\n\nFrank Zheng -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nThank you. I would now like to hand back to Daniel Yuan for closing remarks. Please go ahead.\n\nDaniel Yuan -- Chief of Staff, Head of Investor Relations\n\nThat concludes our call today. On behalf of the Futu management team, I would like to thank you for joining us. If you have any further questions, please do not hesitate to contact me or any of our Investor Relations representatives. Thank you, and goodbye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDaniel Yuan -- Chief of Staff, Head of Investor Relations\n\nLeaf Li -- Chairman and Chief Executive Officer\n\nArthur Chen -- Chief Financial Officer\n\nCindy Wang -- China Renaissance -- Analyst\n\nRobin Xu -- Senior Vice President\n\nZoey Zong -- Jefferies -- Analyst\n\nEmma Xu -- Bank of America Merrill Lynch -- Analyst\n\nLeon Qi -- Daiwa Capital Markets -- Analyst\n\nFrank Zheng -- Credit Suisse -- Analyst\n\nMore FUTU analysis\n\nAll earnings call transcripts"
}