{
  "companyName": "Akoustis Technologies, Inc.",
  "companyTicker": "AKTS",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/12/akoustis-technologies-inc-akts-q4-2022-earnings-ca/",
  "content": "Akoustis Technologies, Inc. (AKTS 1.07%)\nQ4 2022 Earnings Call\nSep 12, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to Akoustis Technologies' fiscal 2022 fourth quarter conference call. [Operator instructions] A replay of the call will be available on the investor relations section of the Akoustis website.\n\nTom Sepenzis -- Director, Investor Relations\n\nThank you, operator, and good morning to everyone on the call. Welcome to Akoustis' fourth quarter fiscal 2022 conference call. We are joined today by our founder and CEO, Jeff Shealy; CFO, Ken Boller; and EVP of business development, Dave Aichele. Before we begin, please note that today's presentation includes forward-looking statements about our business outlook.\n\nAll statements other than statements of historical facts included in this conference call, such as expectations regarding our strategies, operations, costs, plans and objectives, including the timing and prospects of product development and customer orders, our expectations regarding achieving design wins from current and future customers, the possibility of entering into collaborative or partnering relationships, potential impacts of the COVID-19 pandemic, litigation matters, guidance regarding expected revenue, product orders, and milestones for the current and future fiscal quarters, and expectations regarding the integration of acquired business operations are forward-looking statements. Such forward-looking statements are predictions based on the company's expectations as of today and are subject to numerous risks and uncertainties. The company and our management team assume no obligations to update any forward-looking statements made on today's call. Our SEC filings mention important factors that could cause actual results to differ materially.\n\nPlease refer to our latest Form 10-K and Form 10-Q filed with the SEC to get a better understanding of those risks and uncertainties. In addition, our presentation today will also refer to certain non-GAAP financial measures. A reconciliation of these measures to the most directly comparable GAAP measure is presented in our earnings call highlight release available in the investors section of akoustis.com. I would now like to turn the call over to Jeff Shealy, founder and CEO of Akoustis.\n\nJeff Shealy -- Founder and Chief Executive Officer\n\nThank you, Tom, and welcome, everyone, to our fiscal 2022 fourth quarter conference call. I am pleased to report that Akoustis delivered over 140% year-over-year revenue growth and more than 13% sequential revenue growth as we continue to ramp commercialization of our leading BAW filter products. We were able to accomplish this despite the ongoing challenges in the macro environment, driven by COVID-triggered lockdown and power outages in parts of Asia, as well as the associated semiconductor chip shortages. The silicon chip shortages continue to have a major impact on the number of Wi-Fi access points that can be produced by our customers and has led to a significant production backlog across the Wi-Fi landscape.\n\nI'll discuss this in greater detail in a few minutes. Nevertheless, we were able to post a record quarterly revenue in June of $5.2 million and expect to continue revenue growth in sequential quarters with robust growth expected in calendar 2023. From a product development standpoint, we had one of our most successful quarters to date. We managed to achieve 10 out of the 11 stated milestones that we laid out at the end of the March quarter.\n\nI would like to congratulate the Akoustis team for working with a great sense of urgency and focus given the difficulties in the broader market. During the June quarter, five new customers entered production of finished products, which incorporate Akoustis XBAW filters, bringing the total number of customers ramping production to 13. We expect to see this number continue to grow throughout calendar 2022, including two new expected Wi-Fi 6E design wins in the current September quarter. Our growing customer activity in Wi-Fi, 5G mobile, 5G infrastructure, and other market is being offset by the previously discussed headwinds in our back-end supply chain.\n\nAs such, we expect revenue growth in the current first fiscal quarter ending September 30, 2022 of more than 5%, with continued top-line growth expected in the December quarter and throughout calendar 2023. Before discussing each of our target market segments in greater detail, I'm going to speak about the recent passage of the CHIPS and Science Act of 2022, commonly referred to the CHIPS Act, and how Akoustis hopes to benefit from the act. The CHIPS Act legislation was introduced and authored in part by senate majority leader, Chuck Schumer. Its goal was to boost U.S.\n\ncompetitiveness with China by allocating tens of billions of dollars to increase domestic semiconductor manufacturing and science research. As some of you may recall, Senator Schumer gave a speech at the Akoustis fab in upstate New York in June 2021, shortly after he introduced legislation to provide $52 billion in funding to implement semiconductor related manufacturing and R&D programs in the United States. More recently, in August 2022, Akoustis had the opportunity to provide an extended tour of our New York fab facility to Senator Schumer to share our commercial progress over the last year. Akoustis senior management plans to work closely with the local, regional, and state government of New York, along with Senator Schumer's office to support implementation of the CHIPS Act, which we expect will present a significant opportunity for the revitalization of upstate New York's semiconductor presence and, in particular, the Greater Rochester area where Akoustis' RF filter chip manufacturing facility is located.\n\nThe CHIPS Act includes capital for U.S. semiconductor chip manufacturers, as well as billions more in tax credits to encourage investment in domestic U.S. semiconductor chip manufacturing, it also provides billions of dollars to fund scientific research and to spur innovation and development of other U.S. technologies.\n\nOver the past five years, Akoustis has proudly manufactured its innovative RF filter chip products in the USA. We believe we are an ideal candidate for CHIPS funding and that we fit perfectly as part of Senator Schumer's blueprint to make New York the global innovation and semiconductor hub. We plan to promptly apply for funding under the CHIPS Act to add multiple new 8-inch silicon wafer manufacturing lines at our New York site. In addition, given the supply chain delays, energy shortages and constraints associated with our Asia packaging partners, we hope to leverage CHIPS Act funding to build an advanced packaging center to reduce product cost and support shorter time to market for our products.\n\nSuch funding would position Akoustis to manufacture and deliver billions of XBAW filter chips annually and position us to service both Tier 1 and Tier 2 mobile companies for 5G smartphones, as well as other high-volume end markets, including 5G networks, high-frequency Wi-Fi devices, and other wireless markets. The outstanding performance of Akoustis XBAW filters has, in fact, attracted the interest of many of the largest wireless companies in the world, names that everyone would recognize. But the reality is the capital cost to build out capacity to service these billion-dollar wireless companies is substantial. We believe that CHIPS Act funding would allow us to make that enormous leap and build a world class state-of-the-Art fab and advanced packaging center that both New York state and our country would be proud of.\n\nI would now like to discuss each of our target market segments in greater detail beginning with the Wi-Fi segment. As I previously discussed, the Wi-Fi market continues to experience significant disruption from the ongoing supply chain issues, as well as COVID lockdowns in China. And this has negatively impacted our near-term top-line growth relative to earlier expectations. An industry report by the Dell'Oro Group noted that the lead time for receiving wireless LAN access points has stretched to between six months and a year, a significant change from the weeks to months lead times at the end of 2021.\n\nI want to clarify that the impact on Akoustis is not due to our ability to supply RF filter chips to our Wi-Fi OEM customers, but rather the inability of our OEM customers to procure the complete billing materials necessary to ramp production of the finished goods. So, whereas we continue to gain design wins in Wi-Fi, our end customers simply are not able to procure several other components necessary to produce new access points, routers and other Wi-Fi devices. While this has resulted in weakness and imperfect visibility in our near-term Wi-Fi-related revenue, we expect the supply chain issues to resolve over the next six to 12 months, which will improve both the clarity and the ramp of our future Wi-Fi filter revenue. On a more positive note, in the June quarter, we were thrilled to add Aruba Networks to our growing list of Wi-Fi customers, bringing the total number of Wi-Fi customers in production to nine.\n\nAruba is one of the leading enterprise0class Wi-Fi infrastructure providers in the world, and they are using our custom made XBAW filter solution to deliver the highest performing Wi-Fi 6E access point on the market today. Each Wi-Fi 6E access point uses multiple Akoustis XBAW filters, providing multi-user, multiple-in, multiple-out architectures for high throughput and allows for the use of UNII-1 through 4 and UNII-5 through 8 performance, unmatched by any other RF filter solution. We now have over 15 announced Wi-Fi design wins. And we expect to add both additional customers in production, as well as new design wins throughout the balance of calendar 2022, including the two expected new Wi-Fi 6E design wins I previously mentioned.\n\nRecently, we completed significant and frankly very exciting performance improvements to our 5.5 gigahertz and 6.5 gigahertz Wi-Fi 6E and Wi-Fi 7 filter solution. These enhanced filters use our new chip scale packages and are currently shipping to multiple customers for testing. The advantages of these new filters include a massive improvement in out-of-band rejection, far superior to anything we have seen from our competitors. We have received significant interest from customers for these new filter products and expect to see design wins and production ramps using these new filter products in the near term.\n\nI am also pleased to announce that we fully qualified four Wi-Fi 6E, Wi-Fi 7 XBAW filter products during the June quarter, in line with the milestones we set. At the end of March, we expect to release into production these four Wi-Fi 6E, Wi Fi 7 filters in the current September quarter. Additionally, we continue to advance the progress on our Wi-Fi 7 diplexer, which we are currently developing for one of the largest PC chipset makers in the world. The first design of this new diplexer was shipped to this Fortune 100 customer in December, and we received positive feedback on the design.\n\nThe initial diplexer performed well and enabled the customer to characterize the product in their system, providing valuable technical feedback for the next design iteration, which was produced in our New York manufacturing facility in the June quarter and recently shipped to the customer in the past month. We remain on schedule for commercialization of this extremely exciting product and have received interest from other OEMs for diplexer, triplexer, and other multiplexer products. This includes the new Fortune 100 internet company customer that we announced on August 24th, which has given us a development order for two new Wi-Fi 7 XBAW RF filters for the AR/VR markets and wearables and other mobile devices. Both the PC chipset company and the internet company expect to enter production with our developing diplexer products in calendar 2024.\n\nWe attribute our surge in recent design wins to the fact that we were an early entrant in Wi-Fi 6, 6E, and 7 BAW filter solutions, and, today, have one of the most extensive Wi-Fi 6E portfolios and are expanding to include seven BAW filters to address the enormous challenges of difficult dual band coexist, wide-bandwidth, and high-frequency operations within the 5 to 7-gigahertz frequency spectrum. While near-term macro supply chain issues remain, we are executing on design wins, new production ramps, and new product development at a higher pace than ever before. And we expect to see the outlook improved quickly once the supply chain issues improve. To summarize our recent Wi-Fi activity, we now have 12 commercialized XBAW Wi-Fi filters, eight for Wi-Fi 6E, and four for Wi-Fi 6.\n\nAs of today, we have announced a total of 15 design wins, including the two we announced last week. We are currently in production with nine customers in Wi-Fi 6 and Wi-Fi 6E. And lastly, we are advancing the development of our XBAW multiplexer products led by our diplexer efforts, which have resulted in two development orders from two Fortune 100 companies. Moving on to 5G mobile, we continued our momentum in 5G mobile during the June quarter, getting closer to our goal of entering production in the 5G mobile market by late calendar 2022, early calendar 2023 with the first of three Tier 1 customers with whom we are currently engaged.\n\nWe shipped a second design to our Tier 1 customer in the June quarter using our new advanced wafer level packaging. We recently completed a quality audit with this customer and received a volume order for the first design. We remain focused on entering production with this customer on the targeted timeline. We also successfully developed and delivered one new engineering sample to our third Tier 1 customer an RF front-end module maker.\n\nWe initiated the next phase of this development with new engineering samples expected by the end of calendar 2022. These new XBAW filters incorporate the customer's designs, and we are targeting production ramp in late calendar 2024, early 2025. During the June quarter, we also iterated a redesigned filter for our Tier 2 5G mobile customer and shipped first samples to this customer in our new WLP. We continue to target a production ramp with this customer in mid calendar 2023 for this first filter and have just received a purchase order for the development of two additional XBAW filters targeting Wi-Fi 6E applications.\n\nAs we mentioned on our last quarterly update call, we have brought the production of our WLP in-house within our New York fab. We continue to work toward the design lock of multiple new advanced packages with full WLP process qualifications expected to complete later this calendar year, we believe bringing the WLP process in-house enhances substantially our ability to control the quality, cost, and customization of our advanced packages. To summarize our 5G mobile activity, we have multiple customer funded XBAW filters in design with four customer engagements, including three Tier 1 customers. We shipped samples of our second design XBAW mobile filter to our Tier 1 RF component company in our advanced wafer level packages.\n\nWe also successfully developed and delivered one new engineering sample to our third Tier 1 customer, an RF front-end module maker. And we iterated a redesigned filter for our Tier 2 5G mobile customer and ship first samples to this customer in our new wafer level package. Our customer engagements also included our second Tier 1 RF front-end module maker that is using our XBAW resonators to develop multiple filters for 5G handsets. We shipped multiple 5G mobile XBAW filter samples to our customers during the June quarter, including multiple wafer samples, utilizing our new advanced wafer level packaging.\n\nAnd finally, we are currently migrating the manufacturing supply chain of WLP into our New York fab, which we expect to have design locked and available for qualified production later this calendar year. And now, I would like to discuss our network infrastructure business highlights. I am pleased to announce, we officially began ramping production with three Citizens Broadband Radio Service, or CBRS, infrastructure companies in the June quarter. One of which is already experiencing higher-than-expected end customer demand.\n\nWe expect these three customers to continue to ramp in the current September quarter and beyond and believe we may see revenue upside in this segment, given the current demand picture is increasing. During the June quarter, we successfully completed the next iteration of our 3.7 gigahertz to 3.98 gigahertz XBAW infrastructure RF filter for the U.S. 5G market in C-band. We are currently sampling this new filter with multiple OEMs and expect to see greater small cell adoption beginning in the second half of calendar 2023 when we will be well positioned.\n\nTo summarize our 5G network infrastructure activity, we have four completed 5G network infrastructure XBAW filters, three for 5G small-cell base stations, and one for CBRS. We are currently sampling our new 3.7 gigahertz to 3.98 gigahertz C-band filter for the U.S. 5G market. To date, we have announced three design wins in small cell with our Tier 1 customer and one design win from a second customer.\n\nAdditionally, we have received four design wins for CBRS from three leading network infrastructure OEMs. And now, I would like to discuss the highlights from our other business segments during the June quarter. In our defense contract business, we continue to progress on our existing R&D contract with DARPA to further enhance our XBAW PDK. In addition, we recently finalized a multiyear, multimillion-dollar contract with DARPA to extend the operating range of our XBAW RF filters up to 18 gigahertz using novel materials and device manufacturing as we announced in June.\n\nThese new materials may have positive implications in our current 2- to 7-gigahertz frequency range that we are focused on today given higher power handling capability and higher Q values. In our other market segment, we recently announced entering the RF timing and frequency market with our leading XBAW resonators. We are working with a leading maker of timing RF components to develop ultra-high frequency XBAW resonators for use in the customer's finished devices. The timing RF market represents a significant opportunity for Akoustis in both unit volume and revenue.\n\nOur primary customer is developing products that could be disruptive in the timing RF components market, looking to displace older analog technologies with ultra-low jitter and phase noise devices. We are extremely excited that our leading XBAW resonators can be a part of this groundbreaking opportunity. And we have a new development in this area that I will be discussing shortly as part of our upcoming milestones. To summarize, our other market segment activity, we have seven completed XBAW filter solutions for civilian and defense markets.\n\nFurther, our ultra-high frequency XBAW resonators are now being used to deliver disruptive digital timing and control products to the broader communications industry. In addition, we continue to refine and improve our XBAW PDK, driven by the direct to phase 2 contract with DARPA. We signed a new multiyear multimillion-dollar contract with DARPA in June to scale our XBAW technology to 18 gigahertz. And finally, in addition to the numerous customers acquired through the RFMI acquisition, we have a total of three XBAW customer engagements, two of which have already placed purchase orders for us or provided NRE revenue.\n\nAnd now, I would like to hand the call over to Ken to go through our financial highlights.\n\nKen Boller -- Chief Financial Officer\n\nThank you, Jeff. For the fourth quarter ended June 30, 2022, the company reported revenue of 5.2 million, which is an increase of 13% over the prior quarter ended March 31 2022, and an increase of 140% year over year. On a GAAP basis, operating loss was 17.7 million for the June quarter, mainly driven by revenue of 5.2 million, offset by labor costs of 9.1 million, depreciation of $2.4 million, and other operational costs totaling 11.4 million. As a result, GAAP net loss per share was $0.29.\n\nOn a non-GAAP basis, operating loss was 14.9 million, and non-GAAP net loss per share was $0.26. Reconciliation of these amounts to the corresponding GAAP measures is available in the press release issued this morning available on the Investors section of our corporate website. Capex spend for Q4 was 5.9 million, a decline from 9 million in the prior quarter, reflecting the continued capacity expansion and equipment redundancy project in the company's New York fabs. Cash used and operating activities was 11.9 million, up from 9.7 million in the prior quarter, mainly due to certain items outside of the normal course of operations.\n\nWe expect to see our operating expenses decline in the second half of the year as our costs benefit from greater fab utilization. The company exited the June quarter with 80.5 million in cash and cash equivalents versus 55.9 million at the end of the previous quarter, primarily as a result of the issuance of $43.6 million in convertible notes. During the June quarter and prior to the closing on the convertible notes, the company raised $2 million in cash through additional at the market equity financing, an average price of approximately $3.88 per share. In the current September quarter, we expect multiple new Wi-Fi 6E and network infrastructure customers to ramp production.\n\nAnd therefore, we expect to see record revenue up more than 5% sequentially from the June quarter. And based upon our growing backlog of design wins, we anticipate the top-line growth will continue into our next fiscal year and beyond. I will now turn the call back over to Jeff to discuss our first fiscal 2023 quarter performance and future milestones.\n\nJeff Shealy -- Founder and Chief Executive Officer\n\nThank you, Ken. The ongoing semiconductor chip shortages and supply chain delays that are impacting the broader industry continue to impact our customers, while our design win momentum continues to grow driven by Wi-Fi 6, Wi-Fi 6E, Wi-Fi 7, 5G mobile, 5G infrastructure, and our other markets. Our ability to grow revenue is being negatively impacted in the near term, given the broader market disruption. Despite the near-term supply chain impacts, it's important to point out that revenue was up over 140% year over year in the June quarter.\n\nAnd we are currently expecting at least 200% growth year over year in the September quarter. We are beginning to experience greater-than-expected demand in CBRS and are targeting entry into the 5G mobile smartphone market by the end of the current calendar year or early calendar 2023, which should help accelerate revenue growth once again. By the end of the current quarter, we expect to ramp production from 12 customers to more than 14 customers, with additional customer design wins expected across all our market segments as calendar 2022 progresses. In the September quarter, we expect to generate revenue from each of our business segments, including 5G mobile, Wi-Fi, 5G network infrastructure, and our other markets segment.\n\nWe continue to strive toward executing our targeted milestones, and we'll continue to keep you informed of our progress. Our anticipated September 2022 milestones include, in our Wi-Fi segment, first, we expect to ship samples of our next generation Wi-Fi 6E, Wi-Fi 7 filter solution to multiple customers. Further, we expect to secure at least two additional Wi-Fi 6E design wins during the quarter. And we expect a development order from a Fortune 100 internet company for two diplexers for design into next-generation AR/VR headsets and other consumer devices, a milestone we have already achieved and announced in late August.\n\nFor our 5G mobile segment, we expect to receive our first purchase order for a 5G mobile filter from a Tier 1 customer announced in December 2021. In addition, we expect to iterate the original filter design for our first Tier 2 RF front-end module customer and receive a purchase order for two additional XBAW filters for development, a milestone we have already achieved and announced in late August. And we expect to receive a volume order from our first Tier 1 mobile customer for the 5G XBAW filter that is expected to go into preproduction in late 2022, early 2023. Next, in our 5G network infrastructure segment, we expect to secure a development order for a new high-frequency 5G massive MIMO infrastructure receive filter.\n\nWe expect to deliver a 3.7 to 3.98 gigahertz C-band 5G filter for the U.S. market and expect to sample with multiple Tier 1 customers for both small cell and DAS/AAS base station equipment. And we expect to scale our CBRS production capability, given stronger-than-expected demand from one of our customers. And finally, in our other market segment, we expect to receive a purchase order for the development of a new XBAW multi-chip module from a multibillion-dollar Tier 1 defense customer.\n\nWe expect to start qualification for two resonators for the timing market from our first customer. And we expect to receive an order from a second resonator customer for the timing control market. In conclusion, we believe the market opportunity for our patented high-frequency XBAW filters is substantial. We now have 67 issued patents and 117 patents pending, as we continue to build a substantial IP mode around our technology.\n\nWe continue to work diligently to achieve each of our stated objectives and we will continue to provide updates on our execution against these objectives going forward. Finally, I would like to thank our employees for their hard work, passion, and dedication, which accounts for multiple design wins across the Wi-Fi 5G network infrastructure and defense markets. We have also experienced exceptional momentum in the 5G mobile market, driven by our leadership in filters that operate above three gigahertz and our new and expanding wafer level packaging capabilities. I also wish to thank our shareholders who continue to support the company.\n\nAnd with that, I would like to open the call for questions from the investment community. Operator, please go ahead with the first question.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Anthony Stoss with Craig-Hallum Capital Group. Please proceed with your question.\n\nTony Stoss -- Craig-Hallum Capital Group -- Analyst\n\nHey, guys. Let me start with you, Jeff. On the wafer level packaging side, how important is it -- or maybe I should rephrase that. On the customer side, what percentage of your design wins you think going forward will have wafer level packaging? And then, also, you're talking about 500 million units production by the end of this year, rapidly approaching 2023? Can you give us a glimpse as to where you think you need to be by the end of 2023? And then I had a follow-up after that for Ken.\n\nJeff Shealy -- Founder and Chief Executive Officer\n\nHey, Tony. Well, good morning to you. Couple of things you touched on there. And let's start with WLP.\n\nWLP is absolutely critical, it's critical for several aspects. I think for the -- really a broader statement. WLP for us is the packaging approach that allows our chips to drive into the mobile market, which, as we've said before, that's the largest volume opportunity for our technology. So, that is extremely critical there.\n\nWe have been -- just to say as an extra word on that, we have been -- as we said in the script, we've been bringing that technology in-house. We're now shipping WLP with -- in its final form to the mobile customers. So, that's extremely critical. So, in terms of percentage of customers, the four engagements we described in mobile, they're all in WLP.\n\nSo, in terms of percentage, it's 100% in the mobile market. In terms of the other significance of that, we talked about chip scale package and WLP. Both of those are on a cost-saving roadmap that help us reduce the cost to goods for the filters that we're currently shipping. So, that's extremely important for cost structure of our products.\n\nSo, as we were very clear, we think, in the script, we're producing that in-house as we speak. In terms of the half billion chips, we look out one to two years in terms of forecast and demand. We have said that in calendar 2022, we're ramping in Wi-Fi. We gave a lot of elaborate details, you know, 15 design wins.\n\nIn Wi-Fi, we've got nine programs. We're currently ramping in Wi-Fi. What we've also said is 2022 is also about first design win into mobile. So, this is going to -- we still believe we're on track for that this calendar year to secure a design win.\n\nThose customer engagements have been robust, and we try to keep investors updated on that. So, that's the mobile market, what's going to be consuming that 500 million capacity. That's what we put it in place for. When we talk about going beyond the 500 million capacity, it's really to drive that, we said in script, over to an 8-inch manufacturing platform, which again drives cost.\n\nIt's -- not only scale, but it also drives cost savings in the cost structure of the chip. So, let me pause there and -- for your follow-up.\n\nTony Stoss -- Craig-Hallum Capital Group -- Analyst\n\nThanks, Jeff. Really appreciate it. And then for Ken, given the component issues from the other suppliers into the Wi-Fi food chain things getting pushed out, can you now take a look at when you think you'll be at breakeven? And just refresh our memories with all the moving parts, what revenue per quarter level you need to be for breakeven?\n\nKen Boller -- Chief Financial Officer\n\nSure. Thanks, Tony. Good morning. So, yes, we still hold to our model of operating cash flow breakeven in the next 15 to 18 months.\n\nAnd that revenue projection for a quarter would be revenue of 15 million to 18 million in revenue per quarter depending on mix.\n\nTony Stoss -- Craig-Hallum Capital Group -- Analyst\n\nGot it. Thanks, guys. That's all my questions. Appreciate it.\n\nJeff Shealy -- Founder and Chief Executive Officer\n\nThank you, Tony.\n\nOperator\n\nThank you. Our next question comes from the line of Suji Desilva with ROTH Capital. Please proceed with your question.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nHi, Jeff. Hi, Ken. So, I'm wondering, in terms of the OEM constraints that -- in wireless that are impacting the revenue, can you highlight which components maybe the lead times have stretched out down? Do you have a sense of that with the OEMs, and, you know, how quickly that can correct, or whether this is maybe a structural challenge that segment has for the next few quarters?\n\nJeff Shealy -- Founder and Chief Executive Officer\n\nYes. Good morning, Suji. Let me -- I'll let Dave take first part of that question. Go ahead.\n\nDave Aichele -- Vice President, Business Development\n\nGood morning, Suji. I think the main impact we have is with the SoCs of what we see with the OEMs as the SoCs, we've got one customer that actually has discontinued a, you know, production platform due to the availability of the chipset and, you know, also the cost of the chipsets, which have gone up as well. So, two leading chipset vendors are having week lead times, up to 52 weeks, so that -- if you look at between, I guess, existing platforms and new platforms coming, they're trying to find new nodes that they can get capacity allocation. And so, this is a dynamic landscape that we're looking at.\n\nThere's also, you know, impact around the rolling blackout that we're seeing in China that our, you know, production with some of the ODMs that operate in China and also the COVID situations, you know, where they go to 100% lockdown. So, those are impacts that could be week or weeks. We just, you know, work with the -- our distributor network and the ODMs, you know, to manage that on our side as well.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nOK. Thanks.\n\nJeff Shealy -- Founder and Chief Executive Officer\n\nAnd, Suji, one additional piece was we have seen -- on top of the SoCs, we also have seen availability of memory chips in the past have an impact on architectures. And that's something that, you know, continues to linger. So, we'll keep an eye on that as well. But certainly, I agree with Dave's point on the SoCs.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nOK. Great. And then maybe a follow-up for Jeff or Ken. Can you help us quantify or understand that the magnitude of the impact you're seeing in terms of push-outs versus the revenue you reported? Or any way you can qualitatively discuss that would be helpful.\n\nJeff Shealy -- Founder and Chief Executive Officer\n\nLet me talk -- since we're talking program, I'll actually pull Dave back in to talk about impact in what we're seeing on the program front.\n\nDave Aichele -- Vice President, Business Development\n\nYes. So, the impact that we've highlighted, you know, the one program that we saw discontinued. So, we have to -- what we're continuing to do is increase the design wins and then overlap those, you know, with the programs that maybe going into life slowly or end of life quickly. So, the revenue is -- slows down, you know, at least for the next two quarters as we layer in the new programs this quarter and the following quarter, but then picking up again, you know, with not only the Wi-Fi 6E design wins that we're in process with and executing, but also the ramp of the production, and also the new Wi-Fi 7 programs that we expect with the new designs that we have coming out.\n\nAnd a good example I'll give you, Aruba, which we did announce. They're really just starting to hit their stride. And, you know, it's one customer, but we're actually designed into three programs. And so, those three programs service, you know, high-tier, mid-tier and low-tier.\n\nAnd we're, you know, ramping up quickly with them and working with the ODM supply chain. So, I think the next two quarters, there'll be some slowdown but as we talk about accelerating in 2023.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nOK. All right.\n\nJeff Shealy -- Founder and Chief Executive Officer\n\nAnd, Suji, just one additional piece is just on the supply chain, the impact on the supply chain front, I think what that tends to happen is the average lead time actually increases when you're talking about COVID lockdowns, as well as rolling blackouts that -- in some of these facilities. So, we've -- that's what we're observing. It's some of the lead time. And these are very large OEMs.\n\nSo, these are the biggest of the bids that are suffering these types of circumstances. So, you know, it's added some challenges on the supply chain, you know, and we've been certainly complement our team for working through those. But it does have a tendency of increasing lead time to the overall impact.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nAll right. Thanks, Jeff, Dave, Ken. Thanks.\n\nDave Aichele -- Vice President, Business Development\n\nThanks, Suji.\n\nOperator\n\n[Operator instructions] Our next question comes from the line of Rick Schafer with Oppenheimer and Company. Please proceed with your question.\n\nWei Mok -- Oppenheimer and Company -- Analyst\n\nHello, good morning. This is Wei Mok on the line for Rick. So, you guys highlighted a 200% year-over-year increase in September and a growing backlog? So, I was wondering if you could talk about how big this backlog is. What's the split between Wi-Fi, network infrastructure, and mobile? And do you have any visibility of how much this backlog extends into 2023?\n\nJeff Shealy -- Founder and Chief Executive Officer\n\nHey, good morning, Wei. Jeff here. I'll hand it off to Dave for the breakdown you requested.\n\nDave Aichele -- Vice President, Business Development\n\nGood morning, Wei. So, a majority of the backlog right now is in the Wi-Fi side for the EP infrastructure. We've got backlog out, you know, 15 months. And that is part of our strategy of working with the distribution network and the ODMs to make sure that we've got backlog, you know, that matches against the other materials that they're placing orders on because of long lead time on other components.\n\nSo, we're competitive in the market. But we're working closely with the ODMs and OEMs to get backlog, you know, to match obviously the demand out on other material side. We are seeing an increase in some of the development customers that we have as well. And the Wi-Fi non-smartphone mobile customers that's pretty healthy demand.\n\nAnd we're working with them as we transition through the development phases to preproduction targeting 2023. And then lastly, the infrastructure side, it's actually in the prepared remarks, we're getting pretty good demand visibility. And it's actually increasing double percentage points quarter over quarter, you know, with the CBRS customers, particularly one. So, we expect that to continue to progress, you know, and accelerate in 2023 as well.\n\nJeff Shealy -- Founder and Chief Executive Officer\n\nAnd, Wei, let me just add to that. You know, Dave gave a kind of a current picture of that. As we move into the second half of this fiscal year with what we stated in terms of objectives and where we think we're tracking on the mobile front, we would expect a significant increase in the backlog on the mobile front. And that would have the expected outcome of driving revenue growth.\n\nSo, you know, we're looking at the numbers of those programs, and we're looking at -- and they certainly -- the volume production is, you know, substantial in terms of against unit volumes that we currently have a backlog.\n\nWei Mok -- Oppenheimer and Company -- Analyst\n\nGreat. Thanks. As far as for my follow-up, it looks like in capex, you guys spent 28 million last fiscal year. How do you guys think about capex as you enter fiscal '24? Have you modeled in capex factoring fundings from the U.S.\n\nCHIPS Act?\n\nJeff Shealy -- Founder and Chief Executive Officer\n\nSo, let me -- I'll first start with that and then hand it off to Ken. So, first thing I wanted to preface is, you know, capex is something that -- as we said in our prepared comments, we just want to make sure we quantify that. You know, CHIPS Act funding is -- could have a material impact on any numbers we provided. So, with that being said, let me hand it off to Ken.\n\nKen Boller -- Chief Financial Officer\n\nGood morning, Wei. Yeah, for capex, we've been spending primarily on commercialization of our New York fab to half a billion filters. But if you remember, we're also completing a redundancy project for which we expect to be roughly 90% through by the end of this calendar year, as well as wafer level packaging. We have spoken about an update to our ability to deliver wafer level packaging but also in a commercial sense at significant volumes, as well as rapid prototyping.\n\nSo, this is where we can develop our products quicker and come to market faster as well. So, above that in mind, we did spend roughly 28 million last fiscal year. I do expect that to come down greater than 25% in the next fiscal year. But as we know a lot of the spend is a forward spend.\n\nSome of our lead times are still out there, up to 18 months in some cases. So, it's an investment for the future that we're making today.\n\nJeff Shealy -- Founder and Chief Executive Officer\n\nYeah. And lead times -- just to put a punctuation on that, the lead times of equipment continue to be a challenge. You can see all segments of the globe are pushing invest in semiconductors. So, that's something we got ahead of in the current expansion.\n\nI think we're thankful that we did, but that's something we got to watch going forward.\n\nWei Mok -- Oppenheimer and Company -- Analyst\n\nGreat. Thank you.\n\nDave Aichele -- Vice President, Business Development\n\nThanks, Wei.\n\nJeff Shealy -- Founder and Chief Executive Officer\n\nThank you, Wei.\n\nOperator\n\nThank you. Ladies and gentlemen, this concludes our question-and-answer session. I'll turn the floor back to Mr. Shealy for any final comments.\n\nJeff Shealy -- Founder and Chief Executive Officer\n\nOK. Thank you, all, for your time today. We look forward to speaking with you during our next update call to discuss the current quarter execution against our milestones and future expectations.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTom Sepenzis -- Director, Investor Relations\n\nJeff Shealy -- Founder and Chief Executive Officer\n\nKen Boller -- Chief Financial Officer\n\nTony Stoss -- Craig-Hallum Capital Group -- Analyst\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nDave Aichele -- Vice President, Business Development\n\nWei Mok -- Oppenheimer and Company -- Analyst\n\nMore AKTS analysis\n\nAll earnings call transcripts"
}