{
  "companyName": "Organogenesis Holdings Inc.",
  "companyTicker": "ORGO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/organogenesis-holdings-inc-orgo-q2-2022-earnings-c/",
  "content": "Organogenesis Holdings Inc. (ORGO 2.67%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to the second quarter 2022 earnings conference call for Organogenesis Holdings Inc. [Operator instructions] Please note that this conference call is being recorded and that the recording will be available on the company's website for replay shortly. Before we begin, I would like to remind everyone that our remarks today may be containing forward-looking statements that are based on the current expectations of management and involve inherent risks and uncertainties that could cause actual results to differ materially from those indicated, including the risks and uncertainties described in the company's filings with the Securities and Exchange Commission, including Item 1A Risk Factors of the company's most recent annual report. You are cautioned not to place any undue reliance upon any forward-looking statements, which speak only as of the date made.\n\nAlthough it may voluntarily do so from time to time, the company undertakes no commitment to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise, except as required by applicable securities laws. This call will also include references to certain financial measures that are not calculated in the accordance with generally accepted accounting principles or GAAP. We generally refer to these as non-GAAP financial measures. Reconciliations of those non-GAAP financial measures to the most comparable measures calculated and presented in accordance with GAAP are available in the earnings press release on the Investor Relations portion of our website.\n\nI would now like to turn the call over to Mr. Gary S. Gillheeney, Sr., Organogenesis Holdings' president and chief executive officer. Please go ahead, sir.\n\nGary Gillheeney -- President and Chief Executive Officer\n\nThank you, operator, and welcome, everyone, to Organogenesis Holdings Inc.'s second quarter 2022 earnings conference call. I'm joined on the call today by Dave Francisco, our chief financial officer. Let me start with a brief agenda of what we'll be covering during our prepared remarks. I'll start with a high-level review of our second quarter revenue results and some recent operating highlights.\n\nAfter my opening remarks, Dave will provide you with a more in-depth review of our second quarter financial results, our balance sheet and financial condition at the end of the second quarter and the guidance for 2022 that we updated in today's press release. Then we'll open up the call for questions. Beginning with a review of the results for Q2, we reported net revenue of $121.4 million, a decrease of 1% year over year, driven by a 2% growth in our sales of our advanced wound care products and a 35% decrease in the sale of our surgical and sports medicine products. As expected, the decline in surgical and sports medicine reflects the suspension of commercialization of our ReNu and NuCel products following the expiration of the FDA enforcement grace period last year.\n\nExcluding net revenue from these products, net revenue increased 3% year over year on an adjusted basis. Second quarter sales results came in at the midpoint of the growth expectation range we provided on our first quarter call. However, our GAAP revenue results included a $1.6 million GPO settlement in the period. Dave will review the details of this settlement in a few moments, but I wanted to call out that excluding this impact, our sales on an operational basis were approximately $123 million in Q2 at the high end of the growth expectation range we provided in our first quarter call.\n\nAs expected, we experienced an improvement in the COVID-related headwinds that impacted our business in Q1, and the team performed very well in the period as we continue to execute against our growth strategy and leveraging our competitive positioning, including the strength of our expanded sales force, the benefits of our comprehensive portfolio and leveraging multiple channels and new product introductions and brand loyalty that we enjoy. Let me first update you on the progress of each one of these areas in Q2. First, our commercial team has grown to 350 direct sales reps, and we are continuing our expansion initiative into the back half of 2022. The strength of our sales force enables us to continue expansion across the country and deeper penetration as our team increases the awareness of the benefits of our advanced modalities, and we believe our commercial team continues to be a key competitive advantage for Organogenesis.\n\nSecond, we continue to make progress in diversifying our revenue across physician specialties and sites of care by targeting our product development and commercial strategies to drive growth in these key channels. And third, our broad, highly differentiated product portfolio continues to be a competitive advantage. Sales of our PuraPly products increased 84% year over year, far exceeding our expectations and our long-term strategy to introduce new products and line extensions have enabled access to multiple sites of care and physician specialties and continue to drive strong demand for the well-established, highly differentiated PuraPly brand. Within our non-PuraPly product portfolio, sales of our amniotic products were softer than expected, declining 46% year-over-year, while our guidance had contemplated a year-over-year decline in sales of amniotic products as a result of the difficult comparison in the prior year period, our second quarter results also reflected the impact of a more challenging environment in that period.\n\nAnd lastly, in our PMA and other products, net revenue declined 19% year over year in the second quarter, driven by the expected impact from the suspension of Dermagraft commercialization. With respect to the overall operating environment in the second quarter, and while we were pleased to see the expected improvement in COVID-related headwinds as we move through the second quarter, specifically in lower absenteeism and better access, our customers are still continuing to struggle with staffing challenges and patient visit trends that remain very choppy depending upon the region of the country that you look. We continue to expect to see measured improvement in these COVID-related headwinds as we move through the balance of 2022. Noticeably, we experienced a level of disruption in the second quarter that impacted the growth trends for our amniotic products.\n\nAs discussed on prior calls, we've been working through our national launch of Affinity in recent months and have been introducing our Novachor product as part of our limited launch plan. We encountered a higher-than-expected level of competitive noise, which challenge our share of voice with new customers and slowed the adoption of our new novel amniotic technologies. While this represents unexpected headwinds in the second quarter, we have done in the past, we've successfully leveraged our diverse portfolio and drove better-than-expected sales of our PuraPly brand. We are pleased with the continued strong performance from the PuraPly brand as sales have increased 55% year over year over the first six months of 2022.\n\nWe updated our full guidance for 2022, which now calls for a net revenue range of $465 million to $490 million, representing a year-over-year change in revenue of down 1% to up 5% on a reported basis and up 2% to 7% year over year on an adjusted basis. Our full year 2021 guidance expectation now reflects more measured contribution from our new product introductions. Note, our planned guidance continues to reflect stronger trends in the second half of 2022 as compared to the first half, driven by a combination of, one, the assumption that we'll continue to see progressive improvement in COVID-related headwinds; easier comparisons related to ReNu and NuCel, which did not contribute to prior year sales beginning on June 1, 2021; and the continued strong adoption and utilization of our PuraPly franchise. We view the competitive noise from the amniotic players discussed earlier as largely transitory and believe that we are well positioned with our unique customer value proposition, offering a broad portfolio of products across a continuum of wound care, diversified revenue sources across multiple sites of care and physician specialties and are broad in continually growing commercial reach.\n\nLong term, we will continue to lead this space by launching highly innovative and highly efficacious products as we deliver on our mission to provide integrated healing solutions that substantially improve the outcomes while lowering the overall cost of care. Before I turn the call over to Dave, I wanted to share a brief update on our efforts to expand our clinical evidence. We continue to make progress during the second quarter in our ongoing Phase 3 clinical trial of ReNu for the treatment of knee osteoarthritis. Notwithstanding COVID-related challenges and the typical enrollment slowdown during the summer months, our clinical team has enrolled 70% of the patients needed for the trial.\n\nAnd we are in the final stages of adding seven additional investigative sites in Q3 that we expect will further accelerate the pace of enrollment. We remain on track to complete the first interim analysis of data for 50% of the subjects in late Q4 and continue to target completion of enrollment by the end of this year. In addition, we continue to build our evidence-based data foundation with four new journal articles published in Q2, three for advanced wound care products and one for ReNu. These include two important manuscripts for our PuraPly antimicrobial product for the management of venous leg ulcers and pressure ulcers, one preclinical manuscript for Apligraf and a publication of the excellent outcome from the crossover subject group from our completed 200-patient ReNu randomized controlled trials.\n\nWith that, let me turn the call over to Dave for a review of our financial results in the second quarter, our balance sheet and financial condition as of quarter end and a review of the 2022 guidance that we updated in today's press release. David?\n\nDave Francisco -- Chief Financial Officer\n\nThank you, Gary. I'll begin with a review of our second quarter financial results. Unless otherwise specified, all growth rates referenced during my prepared remarks are on a year-over-year basis. Net revenue for the second quarter of 2022 was $121.4 million, down 1%.\n\nAnd excluding ReNu and NuCel, we grew adjusted net revenue by 3%. As Gary mentioned, net revenue included a $1.6 million impact related to a GPO settlement. In August of 2022, the company reached an agreement with one of its GPOs to settle previously disputed GPO fees for $3.3 million. This settlement was included in the GPO fees as a direct reduction of revenue.\n\nThe company recorded $1.6 million of the settlement fees during the three months ended June 30, 2022, and has revised its previously issued historical financial statements to include a reduction of $1 million in the three months ended March 31, 2022, and a reduction of $0.7 million in the three months ended December 31, 2021, as reflected in the company's Form 10-Q filed with the SEC today. Importantly, we remain in good standing with this GPO partner and have recently renewed our contract. We look forward to continued growth in partnership with them in the years to come. Turning back to a review of our Q2 results.\n\nOur advanced wound care net revenue for the second quarter of 2022 was $113.8 million, up 2% year over year. Net revenue from surgical and sports medicine products for the second quarter of 2022 was $7.6 million, down 35%, driven by the suspension of marketing of our ReNu and NuCel products in connection with the expiration of the FDA's enforcement grace period on May 31, 2021. Excluding sales of ReNu and NuCel in the period, net revenue from surgical and sports medicine products increased 13% year over year in Q2. Net revenue from PuraPly products for the second quarter of 2022 was $69.4 million, up 84%.\n\nGross profit for the second quarter of 2022 was $94.7 million or approximately 78% of revenue compared to 75.7% last year and represented a record gross margin for the company, reflecting the impressive gross margin potential in our model in the years to come. Operating expenses for the second quarter of 2022 were $82.8 million compared to $69.7 million last year, an increase of $13.1 million or 19%. The increase in operating expenses in the second quarter of 2022 was driven by a $10.3 million increase in selling, general and administrative expenses and a $2.9 million increase in research and development costs compared to the prior year period. The year-over-year increase in selling, general and administrative expense was primarily due to additional headcount, primarily in our direct sales force, higher spending in travel and marketing programs amid relaxed COVID-19 travel restrictions.\n\nThe year-over-year increase in R&D was driven by a step-up in clinical study spend and related costs necessary to seek regulatory approvals for certain of our products. Operating income for the second quarter of 2022 was $11.9 million compared to an operating income of $23.6 million last year, a decrease of $11.7 million. Total other expenses for the second quarter of 2022 were $0.8 million compared to $2.4 million last year, a decrease of $1.7 million or 69%, driven primarily by the reduced interest rate for borrowings under our new credit agreement signed in August 2021. Net income for the second quarter of 2022 was $8.7 million compared to net income of $20.7 million last year, a decrease of $11.9 million.\n\nAdjusted EBITDA of $18.6 million for the second quarter of 2022 or 15.3% of net revenue compared to adjusted EBITDA of $25.1 million or 20.4% of net revenue last year. We provided a full reconciliation of our adjusted EBITDA results in our earnings press release issued this afternoon. Turning to the balance sheet. As of June 30, 2022, the company had $112.9 million in cash and cash equivalents and restricted cash and $72.6 million in total debt obligations, and that compared to $114.5 million in cash and cash equivalents and restricted cash and $72.6 million in total debt obligations, of which $0.2 million were capital lease obligations as of December 31, 2021.\n\nWe also have up to $125 million available to borrowings on our revolving credit facility as of June 30, 2022. Turning to a review of our 2022 net revenue guidance, which we updated in our press release this afternoon. For the 12 months ended December 31, 2022, the company now expects net revenue of between $465 million and $490 million, representing a decrease of approximately 1% to an increase of 5% year over year or 2% to 7% growth on an adjusted basis. The 2022 net revenue guidance range now assumes net revenue from advanced wound care products increases approximately 1% to 6% year over year.\n\nNet revenue from surgical and sport medicine products decreases approximately 8% to 19% year over year. Net revenue from the PuraPly products increases approximately 21% to 31% year over year. And by way of reminder, our 2021 revenue results include approximately $11 million in revenue attributable to our ReNu and NuCel products during the five months ended May 31, 2021, the end of the FDA enforcement grace period. Excluding sales of ReNu and NuCel for the first five months of 2021, our 2022 revenue guidance implies growth of 2% to 7% on an adjusted basis.\n\nIn terms of our profitability guidance for 2022, the company now expects to generate GAAP net income between $26 million and $36 million, adjusted net income between $33 million and $43 million. We also expect EBITDA of between $49 million and $63 million and adjusted EBITDA between $60 million and $74 million. In addition to our formal financial guidance for 2022, we are providing some consideration for modeling purposes. Our full year 2022 guidance range now assumes sales of our amniotic products will, at the midpoint of our full-year net revenue range, decrease approximately 15% year over year in 2022 compared to our prior guidance range, which assumed growth of 12% year over year.\n\nSales of our non-PuraPly non-amniotic products, which collectively formed a group called PMA and Other, will decrease at the midpoint of the range of approximately 70% year over year in 2022 compared to our prior guidance, which assumed a decrease of 5% year over year. Gross margins of approximately 76.5% to 77%. Total GAAP operating expenses will increase approximately 13% to 16% year over year compared to our prior expectation of growth in the range of 10% to 15% year over year. Total interest and other expenses of approximately $3.5 million.\n\nGAAP tax rate of approximately 27%. Noncash D&A and noncash stock comp expense of approximately $11 million and $6 million, respectively. And our weighted average diluted share count of approximately 134 million shares. We also expect full year 2022 capex to be approximately $50 million to $60 million as the quarterly cadence of capital expenditures continues to be impacted by supply chain challenges.\n\nFinally, we expect our third quarter GAAP net revenue to increase in the range of approximately 4% to 9% year over year. With that, operator, I'll turn the call back over to you.\n\nOperator\n\n[Operator instructions] One moment for our first question, and that will come from the line of Steve Lichtman with Oppenheimer.\n\nSteve Lichtman -- Oppenheimer and Company -- Analyst\n\nJust wanted to touch on the amniotic competition that you mentioned. Can you talk a little bit more about what you're seeing in what types of areas you're seeing it? And what gives you the confidence that it is transient or will be transient?\n\nGary Gillheeney -- President and Chief Executive Officer\n\nSure, Steve. So what we've seen is more of the smaller players in the space that mostly amniotic products, and those products are competing with our products, competing for share of voice and we just see a lot more of them. I think the transient component of it is with no published ASPs, that competition continue in the -- particularly in the office. So we think over time, those smaller players will not be as competitive going forward.\n\nSteve Lichtman -- Oppenheimer and Company -- Analyst\n\nOK. And then just I wanted to ask this on the proposed professional fee changes in the wound care space. What type of impact would those have on the business if they are finalized?\n\nGary Gillheeney -- President and Chief Executive Officer\n\nSo we are aware of the July 7 proposal, and it is a proposal. It's complicated. So we are working with our outside advisors to assess it. At this point, we really don't have an assessment at this point.\n\nWe don't know what will get finalized, and we really can't assess the impact of it right now and certainly don't want to speculate all of the potential changes that could come out.\n\nOperator\n\nOne moment for our next question. That will come from the line of Ryan Zimmerman with BTIG.\n\nRyan Zimmerman -- BTIG -- Analyst\n\nAnd I just want to follow up on a couple of things. So and I apologize, I was juggling calls this evening. So if I missed this, I apologize, Gary. But can you just -- I understand some of the competitive dynamics in the amniotic impact the quarter.\n\nBut can you just elaborate on kind of what drove such a significant jump in PuraPly sales in the quarter? And then I have a couple of follow-ups.\n\nGary Gillheeney -- President and Chief Executive Officer\n\nSure. I'll start, and David, you can jump in. So PuraPly did well in Q1 and continue to do well in Q2. Our expectation is we would have a published ASP in Q3 for PuraPly.\n\nThat did not happen. And we had built in a pause in June, as you normally would see at the end of a quarter once there is an announced public rate. So we didn't have that pause, and that contributed -- obviously contributed to the quarterly revenue. Dave?\n\nDave Francisco -- Chief Financial Officer\n\nYes. No. I think, Gary, you've seen this, Ryan, over the last several quarters, too. I mean it's -- obviously, it's a very well-established brand.\n\nIt's very differentiated with the antimicrobial component. And so when we get the other items going on in the portfolio, obviously, we lean on that PuraPlay to some extent and share a voice of the sales force, and it works out quite well. So we're pleased to see it up 84% in the quarter.\n\nRyan Zimmerman -- BTIG -- Analyst\n\nAnd just a follow-up on that, Gary and Dave. I mean you had talked about kind of a new SKU for PuraPlay in the second half of the year that could have a negative impact on PuraPlay adoption in the back half of the year. Given that the pricing impact hasn't come through yet, is it still your plans to introduce new SKUs around PuraPly?\n\nGary Gillheeney -- President and Chief Executive Officer\n\nYes. We do plan later in the year to launch those products. They won't have a significant contribution this year at all, but we need to get them in the market and get them established. So we will -- that is our current plan.\n\nRyan Zimmerman -- BTIG -- Analyst\n\nOK. And then again, following up on some of the pricing questions and appreciate that pricing was largely stable in the second quarter and really in the third quarter as the third quarter rates were released. With that dynamic said though, Dermagraft and Apligraf, really more so Dermagraft, I should say, was down a bit. And I believe that you've transitioned a lot of the usage away from Dermagraft as you reset up, I should say, Dermagraft manufacturing.\n\nBut can you just remind us kind of when you expect to have Dermagraft manufacturing up and running and when it can become a material product again for you guys?\n\nGary Gillheeney -- President and Chief Executive Officer\n\nYes. So that's governed by the manufacturing capabilities. So as we've talked about before, that's years out. But on the pricing piece, I recognize that we exhausted most of the inventory we had that we built in the loyal facility at the end of last year in the second -- excuse me, the first quarter.\n\nThere was almost nothing in the second quarter.\n\nRyan Zimmerman -- BTIG -- Analyst\n\nOK. And I know Steve asked the question on the proposed changes to reimbursement and the structure. I mean assuming the proposals hold, and I know, Gary, you're reluctant to comment on it at this point. But assuming the proposal holds to some degree, I mean how do you think about kind of your ability to navigate more of a capitated payment model under some new reimbursement scheme in this space? And what impact -- if, again, this does go through, which we could argue may or may not, but what impact do you think that has in terms of utilization broadly on skin substitute?\n\nGary Gillheeney -- President and Chief Executive Officer\n\nWell, as I said earlier, it's really too early to tell. This is a fairly complicated proposal. Still a lot of unknowns, and it's very difficult to figure out exactly what the final proposal will be. So we really aren't going to speculate on what may or may not happen based on what CMS does.\n\nBut as we know, as we learn, we'll certainly share what we believe the implications are.\n\nOperator\n\nOne moment for our next question. That will come from the line of Steve Lichtman with Oppenheimer.\n\nSteve Lichtman -- Oppenheimer and Company -- Analyst\n\nGreat. Just a couple of follow-ups. So on PuraPly, Gary, once you see some recovery on the amniotic side, what do you see as sort of the steady state growth potential for PuraPly off of this higher base in 2022?\n\nGary Gillheeney -- President and Chief Executive Officer\n\nSure. So we do expect, and Dave, you can jump in. We do expect PuraPlay, the brand long term, particularly with our additional product offerings, to be a low mid-teen grower. So that's still our expectation for the brand.\n\nWe really haven't penetrated all the sites of service that we believe the product will do extremely well in as an example of surgery, and even has implications on our burn franchise when we launch TransCyte. So we think long term, this is still a low to mid-teens grower.\n\nDave Francisco -- Chief Financial Officer\n\nYes. I completely agree, Gary. I mean, obviously, we haven't talked about '23 yet, but -- and as the product family continues to grow, obviously, the comp is getting more difficult. But we do believe long term, the brand continues to perform extraordinarily well, and we expect it to be, as Gary said, low to mid-teens for long term.\n\nSteve Lichtman -- Oppenheimer and Company -- Analyst\n\nOK. Got it. And then, Dave, on the updated guidance, gross margin guidance, I think, ticked up a bit. But I think you also ticked up opex growth.\n\nWhat -- beyond some of the nonoperating things, which, I guess, went up a little bit, what else is driving that increase?\n\nGary Gillheeney -- President and Chief Executive Officer\n\nYes. So we're certainly pleased with the gross margin in the second quarter and didn't have the confidence to bring it up a little bit in the back half for the full year. So obviously, as I said in the prepared remarks, it really gives us confidence in the long-term trajectory of the gross margin. But the operating expenses, a lot of what we're talking about here.\n\nWe are increasing advisory costs, obviously, continuing to expand the commercial team in the back half. There was some incremental commissions and expenses in the second quarter that there was a little bit higher than we had anticipated. So that's some of the increase that you see. Including clinical spend.\n\nSo Gary had mentioned the higher enrollment and those types of things. So a lot of excitement around the continued progress we're making on the BLA.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGary Gillheeney -- President and Chief Executive Officer\n\nDave Francisco -- Chief Financial Officer\n\nSteve Lichtman -- Oppenheimer and Company -- Analyst\n\nRyan Zimmerman -- BTIG -- Analyst\n\nMore ORGO analysis\n\nAll earnings call transcripts"
}