{
  "companyName": "ADC Therapeutics SA",
  "companyTicker": "ADCT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/adc-therapeutics-sa-adct-q2-2022-earnings-call-tra/",
  "content": "ADC Therapeutics SA (ADCT 1.32%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nWelcome to the ADC Therapeutics second quarter 2022 financial results conference call. My name is Gigi, and I'll be your operator for today's call. [Operator instructions] I will now turn the call over to Amanda Hamilton, investor relations manager. Amanda, you may begin.\n\nAmanda Hamilton -- Investor Relations Manager\n\nThank you, operator. This morning, we issued a press release announcing our second quarter 2022 financial results and business update. This release is available on the ADCT website at ir.adctherapeutics.com under the Press Releases section. On today's call, Ameet Mallik, chief executive officer; Jennifer Herron, chief commercial officer; Joe Camardo, chief medical officer; and Jenn Creel, chief financial officer, will discuss recent business highlights and review our second quarter 2022 financial results before opening the call for questions.\n\nAs a reminder, this conference call may contain forward-looking statements. Such statements are subject to risks and uncertainties. For additional information concerning forward-looking statements and factors that could cause actual results to differ materially from those expressed or implied in these statements. We refer you to the section titled Cautionary Statement Regarding Forward-Looking Statements and Exhibit 99.2 of our report on Form 6-K filed with the U.S.\n\nSecurities and Exchange Commission earlier today. Such statements speak only as of the date of this conference call and we expressly disclaim any obligation or undertaking to update these forward-looking statements, unless required to do so by applicable law. Today's presentation also includes non-IFRS financial measures. These non-IFRS measures have limitations as financial measures and should be considered in addition to and not in isolation or as a substitute for the information prepared in accordance with IFRS.\n\nYou should refer to the information contained in the company's second quarter earnings release for definitional information and reconciliation of historical non-IFRS measures to the comparable IFRS financial measures. It is now my pleasure to pass the call over to Ameet Mallik. Ameet?\n\nAmeet Mallik -- Chief Executive Officer\n\nThanks, Amanda, and thank you for joining us today. Before we get into the details of the quarter, now that I've been in the role of CEO for three months, I would like to take this opportunity to share my observations and thoughts on the company and its business plan looking forward. I've spent the last three months on a listening tour speaking with physicians and investors and meeting with employees across all sites and levels. My intent was to take a deep dive into all aspects of the business and determine how to best capitalize on our unique science and tremendous talent to maximize the impact we deliver for our stakeholders.\n\nFirst and foremost, and one of the main reasons why I joined the company is that ADC have emerged as a promising and exciting class of therapies that have the potential to benefit a broad set of patients for years to come. ADC Therapeutics is both a pioneer and leader in the field of ADCs. We are a fully integrated company with a strong value chain that we built from the ground up, starting with our innovative ADC platform and the expertise and capabilities, extending from research and clinical development to CMC and commercial. The seamless integration of our agile and experienced team has been validated by the approval and launch of Zynlonta for third-line DLBCL, as well as our advancing pipeline of promising hematology and solid tumor programs.\n\nSo how do we plan to deliver to patients and maximize the potential of our platform and portfolio? We think about value creation in three time horizons: the near, mid, and long term. Starting with the near-term horizon and the hematology program, we will continue to execute on our plan to maximize the potential of Zynlonta in the third line plus DLBCL market. We delivered $17.3 million in Q2 net sales, representing 5% growth over Q1. We have increased awareness and advocacy for Zynlonta, and we'll continue to amplify our messaging.\n\nWe have fine-tuned our approach to increase breadth and depth in both the academic setting and in the community. With Zynlonta's differentiated product profile, we believe tremendous opportunity remains, and we are confident in our ability to steadily capture this growth. We are also working to move Zynlonta into earlier lines and in combination therapies. In Q2, we continued to enroll our confirmatory Phase 3 LOTIS-5 trial in combination with rituximab.\n\nWe also initiated the LOTIS-7 trial in novel combinations and the LOTIS-9 trial in frail and unfit first-line patients. The combination of Zynlonta and rituximab offers a sizable expansion opportunity. The LOTIS-5 trial doubles the current addressable patient population for Zynlonta and LOTIS-9 serves an additional population with a clear unmet medical need in the frontline setting. Beyond the U.S., we now have three strong strategic partners to expand the reach of Zynlonta globally.\n\nIn Asia, we have our collaborations with Overland ADCT in Greater China and Mitsubishi Tanabe in Japan. We also recently signed an agreement with Sobi, an experienced and committed partner for the development and commercialization of Zynlonta in Europe and all other open territories worldwide, which will allow us to focus even more on executing commercially in the U.S. while making Zynlonta more widely available to patients in need. Our second heme program, Cami for Hodgkin's lymphoma is based on the same validated PBD-based ADC platform.\n\nWe released top-line data from the Phase 2 pivotal trial in Hodgkin lymphoma. In an oral presentation at EHA in June, our pre-BLA meeting with the FDA has been scheduled for September. And based on the results of that meeting, we plan to complete our regulatory submission in the second half of next year given the time we need for manufacturing stability data to mature. Moving to the midterm horizon where we are leveraging our expertise in ADC development to advance our solid tumor pipeline, we have five programs: three in the clinic and two heading toward IND filings.\n\nThese include a mix of clinically validated and novel targets, all of which are supported by strong scientific rationale and promising preclinical data. The long-term horizon provides the opportunity to build upon our proprietary technology toolbox in new and different directions. We are working on next-generation assets, incorporating new antibody constructs and payloads, as well as broader partnering approaches, to expand the toolbox and realize the full value of our ADC platform. With the signing of the Sobi agreement, we are pleased to now have a cash runway extending into early 2025.\n\nThis will allow us the time to execute on our strategy and deliver on our objectives. We will take a disciplined approach to capital allocation based on science, unmet medical need, and commercial opportunity. We aim to identify and accelerate promising programs and terminate those that are not supported by strong data, which will ultimately accelerate the growth of the company and value creation for all stakeholders. Finally, after having the privilege to visit and meet employees at all of our sites, I'm struck by the capabilities of our team.\n\nI'm impressed by the talent, common purpose, and drive to help cancer patients, and we are energized about the many opportunities ahead. We look forward to keeping you updated on our progress. I would now like to turn the call over to Jennifer to report on the Zynlonta launch. Jennifer?\n\nJennifer Herron -- Chief Commercial Officer\n\nThank you, Ameet, and good morning, everyone. I am pleased to share an update on the Zynlonta launch in Q2. Zynlonta Q2 net sales were $17.3 million, representing 5% growth versus Q1. We saw steady month-over-month growth in demand as we progress through the quarter.\n\nJust a little over a year into the launch, we have made solid progress in a challenging environment. However, there are many more opportunities for growth in the third line plus DLBCL market. We have a focused plan in place to capture that opportunity, and we remain confident that with Zynlonta's differentiated product profile, we will drive steady growth in the coming quarters. Since the launch, we have focused the majority of our efforts on the academic centers.\n\nWe have built advocacy with team of specialists and thought leaders at these institutions who are influencers across the entire market. Although there are more DLBCL patients in the community setting, on average, academic-based clinicians seek two times to three times the number of third line plus DLBCL patients as compared to their respective community counterparts. We have made good progress engaging and educating key lymphoma doctors across the country with approximately 60% of our volume coming from academic accounts. With this solid foundation in place, we see good opportunity for growth as we continue to convert awareness to advocacy and building increased breadth and depth in academic accounts.\n\nWhile it made strategic sense to focus on academic centers during the initial launch period, the broader opportunity is in the community setting where the majority of the third line plus DLBCL patient population is treated. With the permanent J-code now in place, we are intensifying our efforts to increase awareness and adoption in these centers. We are confident that the versatility of Zynlonta's differentiated product profile will resonate well with physicians and patients in the community. Factors such as significant single-agent efficacy, rapid time to response, manageable side effect profile, and importantly, our practice and patient-friendly administration schedule.\n\nFor the second half of this year, we have a focused plan to capture the significant opportunities that remain in the market. We plan to drive Zynlonta awareness, experience and advocacy and we have identified three areas for execution. First, on the healthcare provider level, we are optimizing the execution of all of our customer-facing team as in-person opportunities are increasing, including at local and regional congresses. This will help us capture a broader and deeper market share in both academic centers and the community setting.\n\nWe are encouraged with the increasing access to healthcare providers that we have seen expand through Q2 with approximately 75% of our total interactions being face to face as we exited the quarter. This is important trend as we know it often takes several visits for new products, such as Zynlonta to be embedded into practice. Next, we are partnering with key community oncology networks. We are broadening our educational efforts within the network to make sure physicians understand the differentiated profile of Zynlonta.\n\nWe also want to ensure the proper positioning of Zynlonta in the DLBCL treatment paradigm so that every patient who may benefit from Zynlonta has that opportunity. Finally, on the patient level, we recognize the active role patients and their caregivers can play in discussing infusing treatment options with their physicians. We are intensifying regional and local marketing efforts to build grassroots product efficacy at the patient level, as well as mobilizing the DLBCL community through a newly launched campaign to educate about our patient-friendly profile. A little over a year into the launch our cross-functional Zynlonta team has established a good foundation for us to build on.\n\nNow we will work to expand into untapped areas. We have a focused plan in place to continue to grow Zynlonta sales over the coming quarters and remain confident we will establish Zynlonta as the third line standard of care. And over time, we see Zynlonta as a cornerstone of earlier lines of DLBCL treatment. Now I'll turn the call over to Joe to provide an update on our pipeline.\n\nJoe?\n\nJoe Camardo -- Chief Medical Officer\n\nThank you, Jennifer. I'm happy to provide an update on our clinical trials. During the quarter, we made good progress on our Zynlonta development programs with a focus to explore novel combinations and the potential to move into earlier lines of treatment. We initiated the LOTIS-7 trial, the Phase 1b clinical trial of Zynlonta in combination with other newer lymphoma drugs, starting with polatuzumab.\n\nThis combination has shown enhanced activity in our preclinical studies. Other novel combinations will be added to the study, and we will keep you updated as this occurs. In July, we enrolled the first patient into LOTIS-9. The Phase 2 trial to evaluate Zynlonta in combination with rituximab in first-line DLBCL patients who are unfit or frail.\n\nI am particularly excited about this study as it will investigate the potential of Zynlonta with rituximab and to address the significant unmet need in frontline patients who are unable to tolerate the R-CHOP regimen even at the reduced doses. These patients are often excluded from clinical trials. And so they lag behind advances in treatment open to younger and more fit patients. We've received positive feedback and a high degree of interest from physicians on this initiative, and we have activated several sites in the United States.\n\nTo execute on our targeted strategy, we have decided to terminate the LOTIS-6 trial of Zynlonta in relapsed/refractory follicular lymphoma due to the comparator idelalisib being removed from the U.S. market. While we have discontinued the monotherapy program, we will continue to explore opportunities for novel combinations with Zynlonta for follicular lymphoma. Finally, we continue to enroll patients in the randomized part of LOTIS-5.\n\nThe Phase 3 registration study of Zynlonta in combination with rituximab in second-line DLBCL patients who are not eligible for stem cell transplant. Expansion into the randomized part of the trial was supported by the safety run-in which was completed in the first quarter, and we look forward to sharing these results at an upcoming major medical meeting. To give you an update on our ex-U.S. activities and partnerships, we are on track to receive a regulatory decision from the EMA by the first quarter of 2023.\n\nIn partnership with Mitsubishi Tanabe, we are moving forward with a development plan for registration in Japan. In China, Overland ADCT Biopharma completed enrollment of their single agent bridging study ahead of schedule and the joint venture has also dosed the first patient in China in the LOTIS-5 confirmatory Phase 3 global clinical trial. We are focused on the successful execution of the Zynlonta trials, and we look forward to keeping you updated on our progress. Turning now to Cami in Hodgkin's lymphoma.\n\nThe one-year follow-up data from the Phase 2 study was released at an oral presentation at the EHA Congress in June. This presentation showed an overall response rate of 70%, a complete response rate of 33% and the duration of response of 13.7 months for all responders in patients with a median of six prior lines of treatment. Our advisors have told us these data represent a significant benefit to the patients that were included in this study. Recall these patients have progressive disease despite the use of both brentuximab and pembrolizumab, as well as other treatments, and over half progressed after stem cell transplant.\n\nWe have a pre-BLA meeting scheduled with the FDA in September, and we will complete our regulatory submission in the second half of 2023. The timing is driven by the availability and maturity of the manufacturing stability data. Before we move on from hematology, I would like to provide an update on ADCT-602. You may recall ADCT-602 is an antibody drug conjugate targeting CD22.\n\nThis is being evaluated in a Phase 1/2 clinical trial in patients with relapsed or refractory accruement for blastic leukemia. We see early signs of activity and continue to work with MD Anderson to optimize the dosing schedule. We will update you in the future. Now moving on to our solid tumor portfolio.\n\nFirst, we have the ongoing Cami Phase 1b safety and efficacy dose escalation trial in combination with pembrolizumab. When we complete the escalation and the optimum dose has been determined, the study will enter a dose expansion stage. From a timing perspective, we expect to have data on the safety and tolerability of the combination, as well as any signal of antitumor activity next year. We are proceeding with the Phase 1 trial of ADCT-901 targeting KAAG1.\n\nWe continue to dose escalate and expect to have an indication of the safety and tolerability, as well as early signals of antitumor activity in 2023. Moving on to ADCT-601, targeting AXL. The first patient has now been enrolled and dosed in the Phase 1b trial. The study includes a monotherapy arm in patients with AXL gene amplification and a combination arm with gemcitabine in patients with sarcoma.\n\nFinally we are completing IND-enabling work for two advanced preclinical solid tumor programs. ADCT-701 targets a DLK1 in neuroendocrine malignancies. This is a project in collaboration with the National Cancer Institute. ADCT-212 is our optimized second-generation PBD-based antibody-drug conjugate targeting PSMA, a validated target in metastatic prostate cancer.\n\nWe plan to take both of these assets into the clinic next year. With that, I will turn the call over to Jenn to give a financial update.\n\nJenn Creel -- Chief Financial Officer\n\nThank you, Joe, and good morning, everyone. As of June 30, we had cash and cash equivalents of $377 million as compared to $431 million as of March 31, 2022. The cash balance does not include the upfront payment of $55 million we received from Sobi in July of this year. Based on our business plan and expected milestones from Sobi and Healthcare Royalty Partners, we now have a cash runway that extends into early 2025.\n\nPotential near-term milestone payments from these agreements include the $50 million due from Sobi upon European regulatory approval of Zynlonta and third-line DLBCL and the potential $75 million milestone from our Healthcare Royalty Partners agreement for the first EU commercial sale. Turning to the P&L. As we reported in the press release issued earlier today, Zynlonta net sales were $17.3 million for the second quarter 2022. Cost of product sales was $2.3 million for the quarter, compared to $0.1 million for the same quarter in 2021.\n\nThe increase was primarily associated with impairment charges related to the manufacturing of antibodies that were not within the company's specifications. In addition, cost of product sales increased due to a full second quarter of sales activity in 2022 as compared to the same period in 2021 due to the commencement of Zynlonta's sales in May 2021. R&D expenses were $49 million for the second quarter of 2022, compared to $40 million for the same quarter 2021. R&D expense increased for the quarter due to the reversal of previously recorded impairment charges was $6.8 million during the second quarter of 2021 based upon the FDA approval of Zynlonta during that quarter.\n\nIn addition, we continue to invest in Zynlonta trials in earlier lines of treatment and our broad portfolio. Selling and marketing expenses were $18 million for the second quarter 2022, compared to $15 million for the same quarter 2021. The increase in selling and marketing for the quarter reflects the expenses for the Zynlonta launch and ongoing commercial efforts. G&A expenses were $18 million for the quarter, compared to $19 million for the same quarter 2021.\n\nG&A expenses decreased for the second quarter 2022 as compared to the same quarter in 2021, primarily due to lower share-based compensation expense. Net loss was $64 million for the second quarter, compared to a net loss of $73 million for the same quarter 2021. Our diluted net loss per share was $0.84 in the second quarter, compared to a net loss of $0.95 for the same quarter 2021. The decrease in net loss for the quarter ended June 30, 2022, as compared to the same period in 2021 was primarily due to higher product revenue, partially offset by the increase in cost of product sales, R&D and selling and marketing expenses.\n\nIn addition, net loss decreased for the second quarter of 2022 as a result of income arising from changes in the fair value of derivatives associated with our Deerfield facility agreement, partially offset by higher interest expense associated with the deferred obligation with Healthcare Royalty Partners. Adjusted net loss a measure that excludes certain items as described in the press release issued earlier today, was $56 million for the second quarter, compared to an adjusted net loss of $54 million in the same quarter 2021. Adjusted net loss per share was $0.73 for the second quarter, compared to an adjusted net loss per share of $0.70 in the same quarter 2021. With that, I will turn the call back to Ameet for closing remarks.\n\nAmeet?\n\nAmeet Mallik -- Chief Executive Officer\n\nThank you, Jennifer, Joe, and Jenn. To conclude, we remain focused on executing on all areas of the business, and we are well-positioned to achieve our key objectives going forward. This includes driving the Zynlonta launch, working to develop Zynlonta in earlier lines of therapy, advancing our pipeline of differentiated hematological and solid tumor programs and expanding our ADC platform. Now the team will be available for questions.\n\nOperator?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes to the line of Kelly Shi from Jefferies.\n\nKelly Shi -- Jefferies -- Analyst\n\nThank you for taking my question. So for targeted BLA submission Cami in the second half of next year, you mentioned the manufacturing stability data mature. I'm also curious if the clinical data package in good shape for submission and for GBS toxicity in the Hodgkin lymphoma patients, would you anticipate AdCom requested by FDA. I also have a follow-up. \n\nAmeet Mallik -- Chief Executive Officer\n\nYeah. Thank you for your question. I'm going to pass this on to Joe to answer.\n\nJoe Camardo -- Chief Medical Officer\n\nSure. Yeah. The clinical data package is in very good condition. I mentioned the response rates and the duration and that's all very positive from the efficacy side.\n\nOn the safety side, you mentioned the Guillain-Barre syndrome, we have been able to develop some very straightforward interventions to make sure that GBS is diagnosed early and treated. We only have eight cases in the package of the Phase 2 study for Cami. We don't have any late cases. And so our advisors, and we believe that the balance of efficacy and safety now is very positive, and the benefit is clear, and the safety can be addressed.\n\nThe last question was -- the last part of that was about an AdCom. It's impossible to predict FDA activity, but we are not thinking that there will be an AdCom. If there is, we will be prepared for it.\n\nKelly Shi -- Jefferies -- Analyst\n\nGreat. And I also have a question on Zynlonta sales. So the CAR-T extended to second-line lymphoma patients, and so the CAR-T showed a strong revenue increase in the second quarter and also ADC now has a J-code effective since April 1. I'm curious how those factors are going to start impacting Zynlonta sales? And understood the no sales guidance to be offered for 2022.\n\nBut could we think that Q3 and the Q4 sales number? Could it be -- we could get some clue from the first-half reported sales to signal the ramp-up for the whole year.\n\nAmeet Mallik -- Chief Executive Officer\n\nYeah. Thanks, Kelly. And before I turn it over to Jennifer and one more thing I want to address from your previous question, which is you'd also asked about the manufacturing stability. So Joe had said that the clinical package is moving in good shape, and we have a meeting planned with the FDA in September.\n\nThe manufacturing stability, just to be clear, it's just a matter of time. So when the manufacturing batches were produced. We're just waiting for that stability data to mature. And that's what's going to drive the timing for the planned completion of the filing in the second half of next year.\n\nBut now I'll turn it over on the Zynlonta question to Jennifer.\n\nJennifer Herron -- Chief Commercial Officer\n\nYeah. Kelly, thanks for your question. Your specific question with regard to CAR-T, we have seen increased utilization in CAR-T in the second line setting. We have been seeing a lot of post CAR-T use for Zynlonta.\n\nThere are tremendous opportunities ahead of us in the second half of this year. And we're encouraged because as we moved through Q2, we did see month-over-month growth in demand and an increasing face-to-face access as we exited the quarter about three quarters of our engagements with physicians was in person, which we think is really important to portray the differentiated profile of Zynlonta. And if we think of it specifically about the growth opportunities, we started out this year really focusing on the academic centers and developing national and regional level thought leadership as we -- and influence across the marketplace. We've had really good awareness in the academic centers.\n\nAnd as I've mentioned, 60% of our volume is coming from academia. We still have opportunity in the academic centers, not only for depth of prescribing, so converting those trialists to true advocates and embedding Zynlonta in their treatment paradigm, but also, more importantly, in the community, and you mentioned the J-code, the permanent J code that we got in April definitely takes away a barrier to prescribing and now we are doubling down on our awareness initiatives and partnering with community oncology to realize that opportunity.\n\nKelly Shi -- Jefferies -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Gregory Renza from RBC.\n\nGregory Renza -- RBC Capital Markets -- Analyst\n\nHey, good morning. Ameet, team, congrats on the progress, and Thank you for taking my questions. maybe just one for you, just more higher level, it's helpful to hear the feedback from your listening tour over the past few months and just laying out the near, medium, and longer-term goals. I'm just curious if there's anything in particular that's jumping out at you certainly helpful to hear about all the positive, any particular challenges that you think are unique with respect to what ADC is facing? And even in this environment? And just how you're thinking about allocating your time across those different time horizons.\n\nAmeet Mallik -- Chief Executive Officer\n\nYeah. No, it's a great question, and thanks so much for asking it. Yes. Look, I think one challenge that was pretty clear to me, and I've spent a lot of time with Jennifer and Joe's team, particularly in the field with a lot of customers because I always think you get the best insights when you meet with employees on the ground, you meet with customers and just you meet with investors, I mean, you get a lot of insights.\n\nAnd that's how I spend a lot of my time on for few months. So one thing I would say is with Zynlonta. This launch is in a pretty challenging environment because during this COVID period where institutions were relatively shut down, awareness of the product, particularly unaided awareness in the community is still relatively low. And while that's a challenge, I think it equally provides a big opportunity because as Jennifer mentioned, now that we have the J-code established, which was a key barrier for prescribing and access is really -- we really saw an improvement in Q2.\n\nSo when I look at the indicators of activity, and not only the activity -- we're getting a lot of initial calls to customers that we hadn't had in the first part of launch. So three as much as it's been a challenge. I see it as an opportunity now going forward and at least good early indicators of those sort of things in Q2. When it comes to the midterm -- and our pipeline, in general, what I would say is just, for me, the key is we have a lot of things in our pipeline and a lot of activity going on.\n\nAnd what I want to make sure is that we're really disciplined in terms of our portfolio prioritization and portfolio management. So we've implemented -- we're in the process, I'd say, implementing a really robust set of process in terms of how we're going to manage our portfolio at the research stage, the gaining decisions to move into IND in clinical stages and the gain decisions to move into later stage clinical development. Because these -- our judge is all key investment decisions. And I think there's more we can do in terms of the robustness of that criteria.\n\nAnd so you see with decisions as to the team, if the data doesn't bear if the opportunity is not there from a business standpoint, we will stop things because we don't want to just keep putting money after things because we started things. So that's an area, I'd say, again, for opportunity where we can do even more, and that's going to be a big focus for me. And then finally, on the third horizon, we've been very PBD focused in terms of our payloads. And I think PBDs are really, really strong payloads that for a number of targets, particularly the ones that we picked in our pipeline, they really fit well.\n\nBut as we want to expand the number strong payloads that for a number of targets, particularly the ones that we picked in our pipeline, they really fit well. But as we want to expand the number of biological targets that we can go after, we want to expand the toolbox and open up the possibilities. We've done a number of different technology deals in the past, particularly around linker technology, some antibody constructs, and conjugation chemistry. We've been a little bit more limited on payloads, but there are things that we've done and there's more to come, I would say, on that front because to continue to lead in the ADC space, I think we have to open up our lens in terms of our technology toolbox.\n\nSo those are just my initial thoughts of where there's still areas for opportunity and where we're focusing on to take the company going forward.\n\nGregory Renza -- RBC Capital Markets -- Analyst\n\nThat's really helpful. And maybe just one quick follow-up. In case I missed it, if you could just comment on the inventory impact from 2Q on Zynlonta. And also just note that the Zynlonta is over a year now, do we have a better sense of that predictability of what the quarters how you're thinking about the quarters when it comes to inventory and build there?\n\nJenn Creel -- Chief Financial Officer\n\nYeah. I'll take that question. So in terms of inventory for Q2, we believe that the net sales of $17.3 million reflects real-time patient demand. And we're not aware of any significant inventory build at this time.\n\nAnd I can't really comment on future trend there.\n\nGregory Renza -- RBC Capital Markets -- Analyst\n\nGot it. Thanks again.\n\nOperator\n\nThank you. Our next question comes from the line of Boris Peaker from Cowen.\n\nBoris Peaker -- Cowen and Company -- Analyst\n\nMy first question is sticking with the Zynlonta discussion. Can you maybe give us kind of a rough patient characteristic of these initials Zynlonta adopters?\n\nJennifer Herron -- Chief Commercial Officer\n\nCertainly, Boris, and thanks for the question. So as we started off our launch by design and strategy, we developed our national and regional thought leaders and many times, they reside in the academic centers. And so in the academic centers, we've seen utilization of Zynlonta across the entire spectrum of the indication. I think the prioritized business opportunities as we see it in the fairly dynamic marketplace are in the post-CAR-T setting, and we've heard very strong support from our thought leaders in the post CAR-T setting.\n\nAnd then for those patients that are unsuitable for CAR-T, there are a variety of reasons why a patient would not be eligible or not choose to pursue CAR-T treatment. And with our differentiated product profile, we believe that physicians and patients have a lot to benefit from both the efficacy, including a rapid time to response, the manageable side effect profile, and the very convenient administration.\n\nBoris Peaker -- Cowen and Company -- Analyst\n\nAnd on that topic, we talked about CAR-Ts as moving to early lines of therapy. And obviously, that's well known and the helping those patients. But there are several competing drugs in second and third-line DLBCL outside of CAR-T. Can you comment how that competitive landscape is shaping up? And where do you see Zynlonta fitting in there more specifically?\n\nJennifer Herron -- Chief Commercial Officer\n\nYeah. Boris, I don't think that our positioning -- our outlook for the positioning of Zynlonta has changed versus our launch positioning. So it really comes down to the differentiated profile of Zynlonta, the robustness of the LOTIS-2 trial and the fact that in the real-world setting, physicians are seeing a LOTIS-2 type of experience with a rapid time to response and have those patients getting into a response. Recall, these were heavily pretreated patients.\n\nAnd so I think that Zynlonta continues to compete well from a profile standpoint, where we're putting a little bit more effort is really optimizing the execution of all of our customer-facing teams because we have that unique opportunity with access really opening up. And so as Ameet mentioned, we have still a bit of opportunity ahead of us, both in the academic centers and in the community, and that's where we're putting our focus.\n\nBoris Peaker -- Cowen and Company -- Analyst\n\nGreat. Thanks very much for taking my question.\n\nOperator\n\nThank you. Our next question comes from the line of Matthew Harrison from Morgan Stanley.\n\nChris Yu -- Morgan Stanley -- Analyst\n\nThis is Chris Yu speaking for Matthew. So we have two questions. The first question is regarding Zynlonta, just wondering whether you are getting any patients in the community setting in Q2?\n\nJennifer Herron -- Chief Commercial Officer\n\nYeah. We are getting patients in the community setting. As I mentioned, the J-code -- the permanent J-code came through in the beginning of April. And that while that takes away a barrier to prescribing, I think we still have some work to do to really raise the level of awareness in the community that we have achieved in the academic centers.\n\nAnd so about 60% of our volume is coming from the academic centers. And so conversely, 40% of the volume is coming from the community. I think the real opportunity for us moving forward is not only the full execution of the J-code, but also partnering with the community oncology networks.\n\nAmeet Mallik -- Chief Executive Officer\n\nYeah. And I would just add to what Jennifer said that the adoption typically in a field like this, later-line DLBCL, you tend to have slower adoption in the community than the academic, partly because community doctors on average see just a part of their patients that Jennifer had mentioned during the earnings call. And so you have slower adoption in general, all new therapies. I think as our profile gets more known, more understood by physicians.\n\nI think we have a real opportunity for many of the reasons that Jennifer mentioned, the fact that we have a really strong efficacy profile, fast time to respond. The fact that it's a manageable safety side effect profile, the fact that it's a single agent. The fact that the molecule also is very easy to administer, one 30-minute infusion every three weeks. So it's really easy to administer.\n\nSo I think there's a lot of reasons why it's going to fit well. And as I think Jennifer and the team have predicted, you'll get later adoption, and it takes longer to get the adoption of the community. But we believe we should start to see that happening now in Q2.\n\nChris Yu -- Morgan Stanley -- Analyst\n\nThat's very helpful. And my second question is regarding Zynlonta in follicular lymphoma. You mentioned that the LOTIS-6 is terminated. And do you get any feedback from the FDA? And what's your path forward with Zynlonta in follicular lymphoma?\n\nAmeet Mallik -- Chief Executive Officer\n\nYeah. So Joe, do you want to take that?\n\nJoe Camardo -- Chief Medical Officer\n\nSure. Yeah. Thanks for the question. I would -- we did not get specific information from FDA, but it was very clear from the recent advisory boards and some of their public statements that FDA is much more interested in earlier treatment for follicular lymphoma, where the chance of the long-term remission remains as an option, a possibility.\n\nThe late line single agent sort of as a rescue don't look like the future and FDA actually said that. So we took that into consideration and change the focus of our program to look at some combination data for earlier lines. And so it's going to take some time for us to get that data, but we're doing that. And that looks like a much more promising and, I would say, moderate and future way of dealing with follicular lymphoma.\n\nChris Yu -- Morgan Stanley -- Analyst\n\nThank you.\n\nJoe Camardo -- Chief Medical Officer\n\nYou're welcome.\n\nOperator\n\nThank you. Our next question comes from the line of Tazeen Ahmad from BofA.\n\nTazeen Ahmad -- Bank of America Merrill Lynch -- Analyst\n\nThanks for taking my questions. Just wanted to get your sense of what you think the data catalysts will be over the next 12 months. With the upcoming oncology conferences in the second half of the year, should we expect any presentations from any of your ongoing programs? And then lastly, on the slope of the launch for Zynlonta, if you had to ask doctors what they would need to feel comfortable prescribing it today, is it simply just a matter of awareness? Or as you said for community-based doctors, it's limited patient pool. Just trying to understand how well doctors today in your view, might appreciate the benefits of the drug?\n\nAmeet Mallik -- Chief Executive Officer\n\nYeah. So maybe I'll take the question on upcoming milestones, and then I'm going to turn it over to Jennifer to ask -- to answer the question around Zynlonta adoption. I'd just highlight a few different milestones, let's say, over the next let's call it, 12 to 18 months. With Zynlonta from LOTIS-5, we're going to be presenting the safety lead-in data from the combination study with rituximab, at an upcoming medical meetings, so we haven't announced which one, but it will be this year and the second half of the year.\n\nWe also expect to get a regulatory decision around our European approval from EMA by the Q1 of next year. With Cami, we have an upcoming meeting that we think is going to be really important in a pre-BLA meeting in September of this year, which will give us clarity on the path forward. And then as we mentioned, given the timing for the stability data mature, we plan to complete the submission of that in the second half of next year. With Cami and with KAAG 1, we expect to have initial signs of safety and efficacy data for both programs in 2023.\n\nWe're not being more specific as we're still in the process of dose escalation, but we expect to have some initial results from both of those programs next year. So those are, I'd say, the key milestones that I would highlight over the next 12 to 18 months. And I'll turn it to Jennifer to you to talk about Zynlonta.\n\nJennifer Herron -- Chief Commercial Officer\n\nYeah. Thanks for the question. This past year has been pretty challenging with a lot less face-to-face interactions or educational opportunities that's really needed for a new product introduction. We are encouraged, though, as we move through Q2 that it's really opening up and hopefully for good, and we're seeing a lot more face-to-face interactions.\n\nOur team is doing quite well with face-to-face interactions even versus the competitors and industry norms at this time. We do have quite a few opportunities, as you mentioned, as I mentioned earlier, in the academic centers where we have done a fairly good job with regard to awareness and initial trial. We need to convert those trialists really to product advocates and embed Zynlonta in the treatment paradigm there. In the community, which represents over half of all third line, plus DLBCL patients, so a significant opportunity.\n\nI think there, with the permanent J-code now well in place, we have the opportunity to raise awareness, to get that initial positive experience with Zynlonta and really embed Zynlonta in the community as a third-line standard of care. So I think that the access has been a challenge for this first year of launch, but I'm very encouraged from what I'm seeing and the receptivity to the profile continues to be strong.\n\nAmeet Mallik -- Chief Executive Officer\n\nYeah. And Tazeen, just to add on to what Jennifer said. I mean the community tends to adopt new products mycologic hematology slower anyway than academic physicians. I think in this case, it was probably heightened by two things.\n\nOne is the lack of access. So just a lack of knowledge about many new therapies, I'd say, in the community, particularly ours, which is just a year into launch. And then the second thing is just the diffuse nature of the patients where community doctor may be seeing a patient every three to four months. So that frequency also drives the urgency to learn about new therapies, especially when you're not getting access.\n\nBut I think that remains the big on top opportunity. And I think our profile fits particularly well in that setting. So for some physicians right now, we're in the early launch phase right now in the community in terms of the number of interactions they've had, the knowledge of the product. And I think as that picks up, given the access that Jennifer spoke about, I think that's the much bigger opportunity for growth in the near and midterm.\n\nTazeen Ahmad -- Bank of America Merrill Lynch -- Analyst\n\nOK. I'm sorry if I might have missed this if you've already said it. What is your split between community docs and academics right now?\n\nJenn Creel -- Chief Financial Officer\n\nYeah. So in terms of volume, we still have about 60% of our volume coming from academia. In terms of ordering accounts, it's a 50-50 split, but we do see that in terms of ordering, there's a lot more account acquisition opportunity in the community to come. But that, as Ameet mentioned, it's going to take time.\n\nIt will fuel our steady growth in the future.\n\nTazeen Ahmad -- Bank of America Merrill Lynch -- Analyst\n\nOK. And you don't have any constraints on supply right now, do you?\n\nJenn Creel -- Chief Financial Officer\n\nThere are no issues with regard to commercial supply that I'm aware of.\n\nTazeen Ahmad -- Bank of America Merrill Lynch -- Analyst\n\nOK, great. Thank you.\n\nOperator\n\nThank you. I would now like to turn the conference back over to Ameet Mallik for closing remarks.\n\nAmeet Mallik -- Chief Executive Officer\n\nNo, thank you. And thank you to all of you very much for joining our call today. Thanks for your continued support of ADC Therapeutics. We look forward to keeping you updated on our progress, and I hope that you have a nice day.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAmanda Hamilton -- Investor Relations Manager\n\nAmeet Mallik -- Chief Executive Officer\n\nJennifer Herron -- Chief Commercial Officer\n\nJoe Camardo -- Chief Medical Officer\n\nJenn Creel -- Chief Financial Officer\n\nKelly Shi -- Jefferies -- Analyst\n\nGregory Renza -- RBC Capital Markets -- Analyst\n\nBoris Peaker -- Cowen and Company -- Analyst\n\nChris Yu -- Morgan Stanley -- Analyst\n\nTazeen Ahmad -- Bank of America Merrill Lynch -- Analyst\n\nMore ADCT analysis\n\nAll earnings call transcripts"
}