{
  "companyName": "FLEXSTEEL INDUSTRIES, INC.",
  "companyTicker": "FLXS",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/flexsteel-industries-inc-flxs-q4-2022-earnings-cal/",
  "content": "FLEXSTEEL INDUSTRIES, INC. (FLXS -0.65%)\nQ4 2022 Earnings Call\nAug 23, 2022, 9:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the Flexsteel Industries fourth quarter fiscal year 2022 earnings results conference call. [Operator instructions] Please note, this event is being recorded. I would now like to turn the conference over to Alejandro Huerta, CFO. Please go ahead.\n\nAlejandro Huerta -- Chief Financial Officer\n\nThank you, and welcome to today's call to discuss Flexsteel Industries' fourth quarter and fiscal year 2022 financial results. Our earnings release which we issued after market close yesterday, Monday, August 22, is available on the investor relations section of our website at www.flexsteel.com, under news and events. I am here today with Jerry Dittmer, president and CEO, and Derek Schmidt, chief operating officer. On today's call, we will provide prepared remarks, and then we will open the call to your questions.\n\nBefore we begin, I would like to remind you that the comments on today's call will include forward-looking statements, which can be identified using words such as estimate, anticipate, expect and similar phrases. Forward-looking statements, by their nature, involve estimates, projections, goals, forecasts and assumptions, and are subject to risks and uncertainties that could cause actual results or outcomes to differ materially from those expressed in the forward-looking statements. Such risks and uncertainties include, but are not limited to, those that are described in our most recent annual report on Form 10-K as updated by our subsequent quarterly reports on Form 10-Q and other SEC filings as applicable. These forward-looking statements speak only as of the date of this conference call and should not be relied upon as predictions of future events.\n\nAdditionally, we may refer to non-GAAP measures which are intended to supplement, but not substitute for the most directly comparable GAAP measures. The press release available on the website contains the financial and other quantitative information to be discussed today, as well as the reconciliation of the GAAP to non-GAAP measures. And with that, I will turn the call over to Jerry Dittmer. Jerry?\n\nJerry Dittmer -- President and Chief Executive Officer\n\nGood morning and thank you for joining us today. I'd like to start by welcoming Alejandro. His addition to our team aligns with our strategic focus of building talent across the organization, and we are glad to have him as part of the Flexsteel team. We performed solidly in the fourth quarter, given challenging conditions, which included slowing consumer demand exacerbated by glut of retail inventory, continued inflationary pressures most notably fuel and intensifying competitive pricing pressures.\n\nI'm encouraged by the fact that we adjusted to these challenges, and we're able to deliver sales for the quarter of $124 million, which was within the range of our guidance of $120 million to $135 million. While sales have slowed, revenue from our ongoing residential furnishings business is still ahead of pre-pandemic levels. In addition, we prudently managed our spending to deliver operating income of $3.6 million for the quarter. While near-term challenges may create choppiness in our first half fiscal year 2023 earnings, we remain committed to delivering long-term profitability.\n\nReflecting on fiscal 2022, it was a year of significant challenges, but also many successes. We navigated major disruptions in the supply chain, quickly responded to extraordinary ancillary shipping charges and adapted to surgeon inflation while making important strides in advancing our strategic agenda. I am very proud of and grateful to all our dedicated employees around the world. Their agility, resilience and commitment led to us achieving record home furnishing sales of $544 million, an increase of over 13% from the previous record set last year.\n\nAnd while full year profit results fell short of our expectations due to the exceptionally high ancillary shipping costs and inflationary pressures, I am encouraged by our ability to return to positive operating income in the second half of the fiscal year. We remain committed to focusing on profitable growth over the long term. Notable achievements in advancing our strategic agenda included continued investment in our digital abilities and product content to grow our omnichannel sales capabilities. At the same time, we continue to invest in new and innovative product development.\n\nWe believe these investments will allow us to effectively compete across retail and e-commerce sales channel by offering high-quality products consumers want with an ability to conveniently purchase them where and how they would like. We made meaningful investments in our capacity and supply chain by opening a third manufacturing plant in Juarez, Mexico. In addition, we opened a new distribution center in Greencastle, Pennsylvania to service our customers in the Northeast and create a stronger partner alignment to support both domestic and global transportation. The capacity and supply chain investments allowed us to improve our customer service levels, reduce lead times to three to five weeks, which are advantaged compared to many of our competitors and build a solid foundation for the future.\n\nWhile I am encouraged by our progress and the foundation we have created, there are a few major headwinds that we face entering fiscal year 2023, which may create a drag on sales and profits in our near-term outlook. One significant headwind is slowing consumer demand for the furniture, which we believe is driven by several factors. First, in the fourth quarter, we began to see consumer demand reverting to more normalized levels after an extraordinary period of pandemic-induced consumer buying for everything related to the home. We are consistently hearing from our customers that both online and retail furniture traffic has shifted downward.\n\nThe second factor influence demand is macroeconomic uncertainty especially regarding inflation and fears of an economic recession, which have driven down consumer confidence. The surge in food and gasoline prices are clearly taking a toll on consumer spending habits. At the same time, actions taken by the Federal Reserve to combat inflation have led to an increase in home mortgage rates slowing the purchase of new home, as well as tempering the pace of new construction, which are often a catalyst for purchasing new home furnishings. Third, the mix of consumer spending is shifting away from goods and back toward travel, entertainment and services that were largely abandoned during the peak of the pandemic.\n\nReferring to manufacturers like Flexsteel, slowing demand is being further exacerbated by retailer inventory that remains stubbornly high. Many retailers have warehouses full of inventory order to support the post-COVID demand that was delayed due to supply chain disruptions. Until retailers are able to move some of this product, they won't have room to replenish their Flexsteel inventories in the short term. Another significant headwind is cost inflation as we continue to field cost pressures across all areas of our business, including materials, domestic and global wage rates in all forms of transportation.\n\nWhile ocean container rates have begun to fall, they are still well above historical rates and the decline is being offset by rising domestic transportation costs due to surging diesel prices and a shortage of truck drivers. We've been largely successful at offsetting these pressures through price increases to both our retail and e-commerce channels but as consumer demand fall and retail inventories remain high, our pricing power may be squeezed as we look to maintain competitive pricing in the market. As always, our goal is to continue providing customers with products of superior quality, comfort and durability at attainable prices. Finally, disruptions in the supply chain and logistics have eased somewhat but continue to be a challenge for our industry.\n\nWe have adjusted to overcome many of these challenges, and we remain focused on mitigating our supply chain risk and be ready to adapt quickly to changing market conditions. While current conditions present some near-term challenges, I remain encouraged by the steps we have taken to create a foundation for growth, and we are committed to profitably growing the company over the long term. Now I'll turn the call over to Derek to discuss our operational priorities before Alejandro takes you through further details of our financial results. I'll be back at the end of the call with some closing comments on what we see ahead.\n\nDerek Schmidt -- Chief Operating Officer\n\nThank you, Jerry, and good morning, everyone. As Jerry noted, business conditions for the furniture industry are challenging at the moment. But we experienced management team that's agile and skilled at maneuvering through periods of uncertainty. We're embracing the current environment because in times of disruption, we know there are opportunities to gain share from competitors who are less agile, less financially secure and take a more defensive posture.\n\nWhile near-term sales will likely be strained for the next three to six months, due to slowing consumer demand and bloated retail inventories, we're staying on the offense and aggressively pursuing opportunities to gain share in our existing markets but as important to enter new growing markets where we believe we can provide differentiated solutions and have a right to win. As we have shared in the past, our long-term growth pursuits for new business have three legs. All of which we are progressing in fiscal year 2023. First, new sales distribution.\n\nWe know that consumers are broadening where and how they buy furniture, and we are pivoting to where people shop. On the retail side of the business, we are expanding with new customers beyond traditional furniture retail, most notably, big box retail. As an example, we recently launched a successful trial of motion product with a large national retailer and we'll be shipping a new program of custom manufactured stationary product to them in the coming months. In the e-commerce channel, our historical sales have predominantly come from our Home Styles brand and have been concentrated with a few major players like Amazon, Wayfair and homedepot.com.\n\nWhile we'll continue to aggressively grow with these customers, we are also focused on expanding relationships with other leading e-commerce partners, like Overstock, walmart.com and Cymax to name a few. We are also extending the Flexsteel brand online in a meaningful way with select e-commerce partners in fiscal year '23. The second leg of our growth strategy is new product categories. Two focus areas where we are driving big innovation this year.\n\nFirst, sleep solutions. Most living room furniture isn't designed with sleep in mind. We have a solution, which we intend to launch later in the year, which we believe can define an entirely new furniture category and satisfy a sizable unmet need in the market. Health and wellness continues to present itself as an avenue for growth long term.\n\nOur second innovation focus is on small parcel modular furniture, which is growing in popularity as it changes with shifts in people's lifestyles and needs. However, the quality, comfort and ease of assembly are lacking in current market offerings, and we are leveraging our know-how and patent-pending innovations to bring a better solution to the market in the second half of fiscal year '23. The third leg of the growth strategy is new consumer segments, and we have two initiatives in progress. First, we're addressing new consumers through a lower-priced soft goods brand.\n\nThere is a large mass market for value-oriented furniture, which is below the Flexsteel brand competes due to the large disparity and quality, durability and comfort. However, we believe we can compete effectively with a new brand at these lower price points by leveraging our engineering prowess and manufacturing capabilities to reach these prices while offering quality and comfort that is superior to the competitive alternative. This new lineup will start shipping in the second quarter. Second, we're addressing a new consumer segment for modern lifestyle brands, which have been hugely successful in the past several years by becoming a preferred product development and manufacturing partner to some high-profile lifestyle brands.\n\nIn summary, market conditions will be rough near term but we remain focused on our growth vision and have a set of ambitious initiatives in fiscal year '23 that we believe will position the company for long-term profitable growth and shareholder value creation. Many of these efforts should deliver meaningful incremental growth in the second half of the fiscal year as well. Beyond the growth priorities, we've also reinforced efforts in fiscal year '23 on cost savings initiatives to both offset continued inflationary pressures and lower prices to the market. As Jerry alluded to earlier, competitive pricing pressures are growing exponentially.\n\nCompetitive manufacturers and retailers alike have amassed large inventories and are accumulating significant ancillary charges on inbound product that they have no place to put at a time when consumer demand is slowing. The result, heavy discounting and promotions. There's nothing too irrational in the market yet, but we expect pricing to remain aggressive until the value chain works through its inventory glut. We worked tirelessly during the last two years to gain significant product placements at retail, which resulted in above industry growth, and we stand prepared to vigorously defend our position.\n\nTo do so, we will have to respond to pricing pressures, but intend to fund these price reductions through continuous improvement and cost-saving efforts rather than accept margin erosion. We've strengthened the leadership in all areas of our operations, logistics, manufacturing and sourcing, and we have the talent in place to drive the savings necessary to compete effectively in the market while generating profit and positive cash flow for the business. With that, I'll turn it over to Alejandro to give you additional details on the financial performance for the fourth quarter and outlook for the first quarter of fiscal year '23.\n\nAlejandro Huerta -- Chief Financial Officer\n\nThank you, Derek. Good morning, everyone. I'm glad to be with you today and happy to be part of a great team here at Flexsteel. For the fourth quarter, net sales were $124.5 million, down $11.7 million or 8.6% compared to $136.2 million in the prior year period.\n\nWhile down from the prior year, our sales results were within our $120 million to $135 million guidance range provided during our third-quarter earnings call. Sales performance in our retail channel decreased by $7.6 million or 6% versus the prior year. Product sales through e-commerce declined $4 million or 23% versus the prior year. While we are competing well in both the retail and e-commerce channels, several of our customers are reporting sizable declines in both in-store and online traffic compared to last year's robust results that were spurred by pandemic-driven buying.\n\nAlthough the downward shift in traffic is expected to remain a near-term headwind, we remain positive on the long-term prospects as we are pursuing aggressive plans to gain share through new customers new product launches and improved content and advertising effectiveness. From a profit perspective, in the fourth quarter, the company delivered operating income of $3.6 million or 3% of sales. We recorded a net loss of $0.3 million and a loss per diluted share of $0.05. The net loss was primarily driven by a $3.6 million income tax charge, mainly related to changes in our deferred tax assets for which we do not receive the tax benefit due to our full valuation allowance.\n\nAdjusted net income for the quarter, which excludes the impact of remeasuring our valuation allowance was $2.2 million, and adjusted income per diluted share was $0.41. Gross margin as a percent of net sales in the fourth quarter was 14.2%. The decline from the third quarter was largely driven by competitive pricing pressure due to slowing demand coupled with inflated retail inventory levels and continued inflation in domestic transportation charges, primarily due to surging fuel prices. Operating income was supported by controlled SG&A spending, as fourth quarter SG&A expense dropped to 11.3% as a percent of sales, the lowest quarter of the fiscal year.\n\nMoving to the balance sheet and statement of cash flows. The company ended the quarter with a cash balance of $2.2 million, and working capital of $125.4 million, which represents a reduction of $13 million during the quarter, largely driven by a $12.9 million decrease in inventory. The result of the strong working capital management was solid operating cash flow of $11.9 million during the quarter. As previously communicated, debt reduction is a key priority.\n\nAnd in the quarter, we reduced our outstanding borrowings by approximately 9% or $3.9 million. The strong operating cash flow also enabled us to fund $7.1 million of share repurchases in the period. Looking forward, guidance for first quarter sales is between $80 million and $90 million. While this represents a significant decline from prior year results and the recent quarter, we feel it will be the low point of the fiscal year as most of our retailers have recently pulled back substantially on orders for in-stock products as they are battling full warehouses and containers piling up in yards.\n\nWe do expect demand for our North American manufactured products to remain solid near term given our competitive lead times compared to other manufacturers. Based on discussions with our distribution partners, we're cautiously optimistic that retail inventories should normalize late in calendar 2022 or early 2023. Until then, we expect retailers to be heavily focused on selling the inventory that they have, rather than placing new orders for sourced goods. The result will be a near-term drag on our first quarter and second quarter sales.\n\nWe do expect that sales will sequentially grow each quarter throughout the fiscal year as the inventory situation improves, and we realize the benefits of the various growth initiatives, which Derek outlined. Regarding profitability, the significant decline in sales in the first quarter will have an outsized adverse impact on profits. While we have and will continue to take steps to adjust our costs in line with lower sales levels, we are protecting strategic investments that we feel are critical to support our long-term growth ambitions, namely our investments in the new Mexicali manufacturing facility and new Northeast DC. These investments have added structural costs to the P&L and will be under leverage near term with lower sales.\n\nAs such, we are projecting operating income as a percentage of sales in the range of negative 3.5% to 0% for the first quarter. With the largest drivers of variability in the range being sales demand and competitive pricing conditions. While there is much uncertainty in the market and demand and pricing conditions could worsen, it is our best view at this time that we would deliver profit in the second quarter and results would sequentially improve in the second half of the year. We expect gross margins in the range of 13% to 16% in the first quarter, weighed down by fixed cost deleverage from lower sales and pricing pressures.\n\nIf sales improve, as expected, during the fiscal year, gross margin should improve to the mid- to upper teens in the second half. We intend to prudently control SG&A costs and expect SG&A costs between $14 million and $15 million in the first quarter. SG&A spending may ramp up later in the year dependent on gross margin expansion. Regarding our cash flow outlook, working capital is expected to be a source of cash flow in the first quarter and full year as we anticipate inventories to steadily decline throughout the year.\n\nNear-term priorities for cash remain reducing debt and funding capital expenditures. We may continue to be opportunistic with share repurchases at modest spending levels if the stock price remains at a significant discount to our view of intrinsic value. We expect debt levels at the end of fiscal 2023 in the range of $0 to $15 million. For the first quarter, we expect capital expenditures between $2.5 million and $3.5 million.\n\nThe effective tax rate for fiscal 2023 is expected to be in the range of 27% to 28% excluding the impact of any revaluation of deferred tax asset valuation allowances. Now I'll turn the call back over to Jerry to share his perspectives on our outlook.\n\nJerry Dittmer -- President and Chief Executive Officer\n\nThanks. We believe the next 12 months will be challenging for our industry due to slowdown in the economy, continued inflationary pressures and bloated retailer inventory levels. These challenges, along with decreased furniture demand will continue to put pressure on our profit margin in the near term. However, I am confident that our team, the investments we made in fiscal 2022 and the fiscal 2023 priorities, which Derek outlined earlier, will provide a solid foundation for long-term profitable growth.\n\nProduction in our third and newest manufacturing plant in Juarez, Mexico accelerated the reduction of our backlog and successfully brought our lead times for manufactured products down to three to five weeks, faster than many of our competitors. Our new distribution center in Greencastle, Pennsylvania is supporting improved service levels and growth in the East Coast furniture market. While these recent investments to expand North American capacity may be underutilized in the near term, they will support improved customer service levels, build supply chain resiliency and provide meaningful capacity for future growth. These initiatives, combined with ongoing investments in talent, product innovation, digital capabilities in our brand position us well to compete effectively in the near term, as well as achieve our longer-term growth ambitions.\n\nIn the near term, we remain focused on delivering profitability and generating cash flow to pay down debt and preserve liquidity while supporting critical strategic investments. With that, we will open the call to your questions. Operator?\n\nOperator\n\n[Operator instructions] The first question today comes from Anthony Lebiedzinski with Sidoti. Please go ahead.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nYes. Good morning. I thank you for taking the questions, and welcome Alejandro, good to catch up with you guys as well. So first, just curious as far as the monthly cadence of revenue during the quarter, was there much variability in terms of going from April through June? Or was it fairly consistent throughout the quarter? Just wanted to get a better handle on that.\n\nJerry Dittmer -- President and Chief Executive Officer\n\nYes. So for that -- Anthony, for the fourth quarter, basically, April, May, June were almost identical months. And that's on the sales side. We really didn't see much difference on the -- and a lot of that has to do with our backlog.\n\nWe were still finishing up our backlog even back down to kind of the historical level, which is where we're at now. The order side was obviously different. The orders have really trended back now toward the pre-pandemic level that we would have seen back in calendar 2019.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nGot it. OK. And then, as far as geographic positioning, I mean, are you seeing much variation there? Or is it just kind of consistent throughout different parts of the country? Just curious about that.\n\nJerry Dittmer -- President and Chief Executive Officer\n\nNo, geographic is very consistent. We really haven't seen any shifts. I mean, where we're stronger, we continue to be stronger. So no real changes there.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nOK. All right. And then, Derek, in terms of the three main strategies that you outlined, which one out of these do you think will be the most impactful, would you say?\n\nDerek Schmidt -- Chief Operating Officer\n\nYes. I think in fiscal year '23, our entry using a new brand in a lower-priced soft goods is probably going to have the biggest impact on sales, I think as we think about the next two to three years, all those initiatives that I mentioned, will have a meaningful impact. But in terms of '23, it's really our launch actually here in a couple of months, we'll actually be fulfilling orders for that new brand. And as I mentioned kind of during the call, we feel pretty strongly that not only are we matching competitive price points in the market, but we're doing so, we're providing a product that has superior quality and comfort versus the alternative.\n\nSo we're pretty jazzed up about that opportunity, and our sales team is excited to sell it.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nGot it. OK. And so, in terms of this new brand, what will be the distribution? Where will consumers find this product? And will this be supported by additional marketing spending? Just curious about that.\n\nDerek Schmidt -- Chief Operating Officer\n\nYes. We're thinking about this new brand really omnichannel. So we're selling it to our traditional furniture retailers. We're having discussions with club stores regarding the offering, and we're having discussions with our large online marketplaces like Wayfair.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nOK. So we will be broadly distributed, got it. OK. All right.\n\nAnd then, so just in terms of the near-term outlook, so as far as -- so at this point that you are fulfilling orders within looks like three to five weeks. So it definitely implies quite a meaningful step down. As far as how you see your own inventories? Like where would you say like how should we expect that by the end of the first quarter, and you may have said this, but I may have missed this, but just in terms of how you're thinking as far as your own inventories throughout the course of the year.\n\nAlejandro Huerta -- Chief Financial Officer\n\nYes, Anthony, this is Alejandro. Good question. We're going to work to bring down inventory levels consistently over the rest of the year. It's a meaningful place to go somewhere in the near term of $20 million to $25 million, as we look toward the end of the year.\n\nBut that will also depend on where our sales demand goes throughout the year because we may have to reinvest back into inventory throughout the -- as demand may or may not pick up.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nGot it. OK. All right. And then, lastly, I guess, in terms of the SG&A spending, so you guys did a nice job there for the quarter here, roughly 11% of revenue near term and longer term as a percent of revenue, kind of what do you think is the right appropriate way to think about that?\n\nAlejandro Huerta -- Chief Financial Officer\n\nYes, from a normal run rate, Anthony, at this at this time, we're looking at a normalized 14% to 15% SG&A spend as a percent of sales.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nOK. All right. Well, thanks a lot. Best of luck.\n\nAlejandro Huerta -- Chief Financial Officer\n\nThanks, Anthony.\n\nOperator\n\nThe next question comes from JP Geygan with Global Value Investment Corporation. Please go ahead.\n\nJP Geygan -- Global Value Investment Corp. -- Analyst\n\nGood morning. Thank you for taking my questions. You made the decision several quarters ago to invest in inventory, which, of course, allowed you to continue supplying your customers during COVID. But it's now looking like it might force you to engage in some discounting.\n\nCan you talk about retrospectively the ramifications of that decision, either positive or negative, particularly as it pertains to customer relationships and market share?\n\nJerry Dittmer -- President and Chief Executive Officer\n\nYes, JP, good question. Yes. So we -- it really helped us as far as you know, customer demand went high. We were able to do a lot of good things in there.\n\nWe are able to supply a lot of our customers, which really helped us. We've been able to get decent control of our inventories. Obviously, we've been able to get under control all of our ancillary charges and costs, which we had problems with last year. Those are largely behind us, which is great.\n\nSome of the discounting, there may be some mostly because we're seeing it more from a competitive landscape where we've got competitors out there now that are bringing things down and we're going to obviously be smart about it, but we're looking at everyone else we can possibly do there. We don't think it's going to be a huge drag. But like I said, we're going to keep looking at it.\n\nDerek Schmidt -- Chief Operating Officer\n\nA couple of things, JP, I'll add. No. 1, in terms of the positive ramifications, in traditional retail, retailers sell what placements they have on their floor. And our investment in that inventory, among other things, helped us gain significant placements during kind of the post pandemic period.\n\nI mean our retail placements went up double digits, largely because I think we serviced our customers better than the competitive set. Jerry went through some of the adverse ramifications. The other thing I'd share with you is that we've been really disciplined around product life cycle management. So we are constantly cutting slow-moving items.\n\nSo we do not have a long tail in our inventory of obsolete or slow moving. So yes, we're doing surgical discounting on some products where we've got really deep inventory levels. But the good news is the inventory of what we have is stuff that sells in the market still wants.\n\nJP Geygan -- Global Value Investment Corp. -- Analyst\n\nHelpful. Can you give us a sense for how much excess inventory exists across the industry. But I'm recognizing that that might be a more nuanced question than on its face.\n\nJerry Dittmer -- President and Chief Executive Officer\n\nYes. So from a time frame standpoint, there's probably six months out there. We're thinking it's going to take at least to the end of this calendar year, maybe into the first part of calendar '23. Obviously, it really depends on what the demand looks like.\n\nWe will see a lot of changes hopefully here now after Labor Day, people will kind of know we'll move into market, and -- but we're really feeling that by the end of the calendar year, inventory should be in a pretty good place.\n\nJP Geygan -- Global Value Investment Corp. -- Analyst\n\nOK. Great. Moving on, you mentioned a lot of exciting developments slated for fiscal '23, sleep oriented living room furniture, part sized modular furniture. Can you give us a sense of the expected size of those opportunities, either by dollar amount, by magnitude or relative to your existing business? And then the second part of this question, which Anthony addressed a little bit was what type of investment in design, production and distribution sales, marketing, etc., be required?\n\nDerek Schmidt -- Chief Operating Officer\n\nYes, JP. So for competitive reasons, I prefer not to share sales forecast on specific product initiatives. What I can tell you, though, all the growth initiatives that I shared earlier. In aggregate, we believe that those will contribute somewhere between $40 million and $50 million incrementally to our core business.\n\nSo again, a big part of our growth strategy is going after new markets, new consumers, new products. And we've invested fairly heavily around product development here this past year, and I think we'll start to see the fruits here in fiscal year '23. In terms of the spending, what I will tell you is we've managed SG&A in a very prudent manner, but all the growth initiatives that I shared are fully funded, both in terms of IP, product development, as well as marketing to launch those successfully in the market. So we are managing within the SG&A guidance that Alejandro gave and still fully supporting those initiatives.\n\nJP Geygan -- Global Value Investment Corp. -- Analyst\n\nAll right. You mentioned some sort of value-oriented product lines. How should we understand the effect of those product lines under consolidated margin profile?\n\nDerek Schmidt -- Chief Operating Officer\n\nYes. The margins are similar, if not better. And there's really no cannibalization with the Flexsteel brand because there is such a huge disparity around kind of price points and the quality. So this truly is new incremental business for us.\n\nJP Geygan -- Global Value Investment Corp. -- Analyst\n\nOK. Great. Finally, you previously provided long-term performance guidance, including gross margins in I think a three-year time frame ranging in the 20% to 22% range. And then, longer term, which I think you said is five-plus years potentially exceeding that range.\n\nIs that guidance along with the other broad parameters you've put around your kind of midterm and long-term performance still intact, considering recent developments?\n\nDerek Schmidt -- Chief Operating Officer\n\nWhat would I tell you, JP, I think the long, long-term goals are still intact. I think given the disruption that we've seen here because of the economic slowing, because of inflation, the road map on how we get from where we're at today to that will probably look different than the view that we had six, 12 months ago. So as things become more certain, more clear  we'll certainly provide the investment community our best view on what that road map -- that new road map might look like. The intent still is to get gross margins longer term above 20%, certainly.\n\nJP Geygan -- Global Value Investment Corp. -- Analyst\n\nGreat. OK. Thank you. All right.\n\nOperator\n\n[Operator instructions] The next question comes from Richard Dearnley with Longport Partners. Please go ahead.\n\nRichard Dearnley -- Longport Partners -- Analyst\n\nGood morning. When would you think that the Juarez plant will be up to normal loading or utilization?\n\nJerry Dittmer -- President and Chief Executive Officer\n\nSo right now, we've obviously had to make some adjustments because of the slowing demand, it's probably something that we won't probably see again until probably fiscal year '24 because we think '23 is obviously, as we mentioned is going to be a rough year. But we gradually see it increase, especially with some of the new stuff that Derek was talking about, so we're probably a good 12 months out until we have it totally back out to where it was.\n\nDerek Schmidt -- Chief Operating Officer\n\nI think in the first quarter, I mean, we're running in the 50% to 60% utilization in terms of maximum capacity. Given our view of how demand will shape here throughout the year, we'd expect to end the year closer to the 80% utilization range. Certainly, if demand picks up, we'll -- that will increase. And if we see a more sustainable increase in demand, we will then have the option to start up our new Mexicali facility.\n\nRichard Dearnley -- Longport Partners -- Analyst\n\nRight. And what's the current outlook for the Mexicali facility starting?\n\nDerek Schmidt -- Chief Operating Officer\n\nRight now, as Jerry kind of alluded to -- yes, fiscal year '24, so it is a strategic long-term asset. We are still focused on our long-term growth ambitions. And having that facility and the capacity is an important part of the strategy. So in the near term, the asset is going to be underutilized, but we still feel confident that it's going to play a really important role in our success in the future.\n\nRichard Dearnley -- Longport Partners -- Analyst\n\nI see. And then, it would seem as though your new growth initiatives for the next three years or so, lean less on the Flexsteel steel capability, stronger, better implied by the word steel. Is that -- am I reading that incorrectly? Or does that -- is that less important these days?\n\nJerry Dittmer -- President and Chief Executive Officer\n\nSo it's still very, very important to us. And our plans are to continue to grow in there. We've still got a lot of product development and a lot of great new launches that are planned there. Really what we are highlighting here are other ways that we're going to also grow besides there.\n\nSo we're not going to be downplaying that at all. It's very, very important, and the durability and the whole Flexsteel story and where we've come from and how we go forward. These other though, we have a lot of capabilities in manufacturing, sales and customers that are looking for other things and whether that's more modern furniture, whether it's the sleep solutions, whether it's our new brand at lower price points. These are all great ways for us to grow the company.\n\nRichard Dearnley -- Longport Partners -- Analyst\n\nRight. And have you reexamined at all the buyback versus paying out dividends and/or accumulating cash?\n\nJerry Dittmer -- President and Chief Executive Officer\n\nYes, go ahead.\n\nAlejandro Huerta -- Chief Financial Officer\n\nYes. We continue to look at how to give back to our shareholders. At this time, we are not planning to stop the dividend, but we're in continuous conversations with our board on how to maximize shareholder experience. And so, right now, we are -- we have always been examining it.\n\nBut at this time, we're still planning to have the dividend in place.\n\nJerry Dittmer -- President and Chief Executive Officer\n\nA little bit too also. We've continue to look at, hey, what investments do we need an inventory? What do we need from like a manufacturing and distribution center equipment, et&cetera. We obviously look at investments in talent to support not only our current business, but growth acquisitions that could possibly accelerate our growth in the future. And then, with all that, we also then look at on both the share buyback and dividends and kind of doing that order.\n\nAnd as Alejandro said, we review our dividend all the time. In the near term, there is no intention to reduce the dividend.\n\nRichard Dearnley -- Longport Partners -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Jerry Dittmer for any closing remarks.\n\nJerry Dittmer -- President and Chief Executive Officer\n\nGreat. Thanks, everyone. In closing, I'd like again to thank all our Flexsteel employees for their outstanding performance and service during the fiscal year and what they're going to do for us going forward. I'd also like to thank those of you that had questions today and participated in today's call.\n\nThank you for your questions. And if you have anything else, please reach out if you have any additional ones, and we look forward to updating you on our next call. Everybody, have a great day. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAlejandro Huerta -- Chief Financial Officer\n\nJerry Dittmer -- President and Chief Executive Officer\n\nDerek Schmidt -- Chief Operating Officer\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nJP Geygan -- Global Value Investment Corp. -- Analyst\n\nRichard Dearnley -- Longport Partners -- Analyst\n\nMore FLXS analysis\n\nAll earnings call transcripts"
}