{
  "companyName": "BlackBerry",
  "companyTicker": "BB",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/28/blackberry-bb-q2-2023-earnings-call-transcript/",
  "content": "BlackBerry (BB)\nQ2 2023 Earnings Call\nSep 27, 2022, 5:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the BlackBerry second quarter fiscal year 2023 results conference call. My name is Brent, and I will be your conference moderator for today's call. During the presentation, all participants will be in a listen-only mode. We will be facilitating a brief a question-and-answer session toward the end of the conference.\n\n[Operator instructions]. As a reminder, this conference is being recorded for replay purposes. I would now like to turn today's call over to Mr. Tim Foote, vice president of BlackBerry investor relations.\n\nSir, please go ahead.\n\nTim Foote -- Vice President, Investor Relations\n\nThank you, Brent. Good afternoon, and welcome to Blackberry's second quarter fiscal 2023 earnings conference call. With me on the call today are executive chair and chief executive officer, John Chen; and chief financial officer, Steve Rai. After I read our cautionary notes regarding forward-looking statements, John will provide a business update, and Steve will review the financial results.\n\nWe will then open the call for a brief Q&A session. This call is available to the general public by pooling numbers and via webcast in the investor information section at blackberry.com. A replay will also be available on the blackberry.com website. Some of the statements we'll be making today constitute forward-looking statements and are made pursuant to the safe harbor provisions of applicable U.S.\n\nand Canadian Securities Laws. We'll indicate forward-looking statements by using words such as expect, will, should, model, intend, believe, and similar expressions. Forward-looking statements are based on estimates and assumptions made by the company in light of its experience and its perception of historical trends, current conditions, and expected future developments as well as other factors that the company believes are relevant. Many factors could cause the company's actual results or performance to differ materially from those expressed or implied by the forward-looking statements.\n\nThese factors include the risk factors that are discussed in the company's annual filings and MD&A. You should not place undue reliance on the company's forward-looking statements. Any forward-looking statements are made only as of today, and the company has no intention and undertakes no obligation to update or revise any of them, except as required by law. As is customary during the call, John and Steve will reference non-GAAP numbers in their summary of our quarterly results.\n\nFor a reconciliation between our GAAP and non-GAAP numbers, please see the earnings press release published earlier today, which is available on EDGAR, SEDAR, and blackberry.com website.  And with that, I'll turn the call over to John.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nThank you, Tim. Good afternoon, everyone, and thanks for joining today's call. This was a solid quarter for BlackBerry, delivering revenue in line with expectations and beats on the earnings. I'll start today with view with the IoT business unit.\n\nThis quarter, IoT delivered a strong 28% year-over-year revenue growth. QNX design base revenue remains the top performer. That is revenue from developer -- development fees and professional services. Q1 was the third consecutive quarter that we set an all-time record in this category.\n\nAnd this quarter, we almost set another. When we win a new design, this revenue is the first to be recognized with royalties coming later when a vehicle enters into production. This strength in design phase revenue is expected to continue, given the significant amount of professional services we already have lined up and the pipeline of potential new design wins in the next few quarters. On the production front, we saw an uptick in royalty revenue, but it remains below the pre-pandemic level, mainly due to supply chain headwinds.\n\nGross margin came in at 82%. The strength of design wins was clearly illustrated by Volkswagen, one of the world's largest automobile selecting BlackBerry QNX for its new vw.os platform. This platform will be deployed in all brands across the Volkswagen Group. We're rapidly being trusted to power the safety critical ADAS and autonomous drive applications.\n\nThe QNX is currently the market leader. This builds on design wins in recent quarters with BMW, Volvo, and a long list of electric vehicle players in China. BlackBerry continues to win market share in core safety-critical domains. A couple of examples included an ADAS design win with Hyundai and a digital copper design with one of the world's largest Tier 1 supplier that utilizes the QNX hypervisor.\n\nThe hypervisor will host a safety-critical instrument cluster along non-safety-critical entertainment applications all on the same chip. On the EV front, we won another ADAS design with the Chinese automaker, and Blackberry QNX is now embedded in seven of the China's 10 largest EV OEMs. In addition to our strong position in auto, we have significant opportunities in the other verticals, too. This quarter, we announced additional support for the aerospace and defense market, with QNX achieving the latest technical standard known as the Future Airborne Capability Environment, or FACE.\n\nFACE is a software standard, jointly developed by government and industry that establish a common operating environment. It enables the reuse of software components across different hardware, reducing developer friction, and costs. In addition to aerospace and defense, we saw progress in the medical and industrial markets with wins that include surgical robotics, a retail distribution pick-and-pack robot as well as control for a nuclear power plant. Overall, in the quarter, we won 19 new designs with nine in auto and 10 in the general embedded market.\n\nWe successfully added talent to our IoT team this quarter despite the tight labor market. This investment is supported by the large and growing schedule of professional services secured through the recent design wins, and by adding headcount, it will enable additional revenue. The macro environment for auto remains a mixed picture with varying dynamics across regions and OEMs. The Chinese market where Blackberry has won a number of designs recently appears to be bouncing back to the end -- due to the end of some COVID-related shutdowns and the impact of robust stimulus measures.\n\nIn North America and Europe, however, there appears to be a short-term contraction with certain chip supplies, constraining the ability of OEM to build inventory and meet demand. Going forward, the impact of rising interest rate on consumer financing, together with economic uncertainty created by the possibility -- creating the possibility of future choppiness. Despite this ongoing challenge, we're delivering strong year-over-year growth and have a solid pipeline of potential new designs coming in the upcoming quarters. Normally, given the strength of the QNX business, we will adjust our revenue outlook upwards. However, given the macro headwind, we've been prudent in holding our outlook as is.\n\nWe expect the full year '23 revenue for the IoT business unit to still be in the range of the $200 million to $210 million as previously stated. On the IP front, we made good progress. Our product development road maps remain firmly on track. We have had another new release in August that enabled support for a greater range of in-vehicle hardware and software.\n\nThis new release incorporates not only [Inaudible] features but also value to real time feedback that we are getting from the ongoing group of concept trials. You may recall that we are currently running a limited number of these trials, including the travel OEM and Tier 1s and these are progressing well. We continue to receive requests for additional trials and this ongoing demand remains a positive sign of the customer receptivity of IVY. On the ecosystem side, we were excited to close another investment by the IVY fund this quarter in the German start-up named COMPREDICT.\n\nCOMPREDICT uses AI to enable automakers and fee providers to utilize predictive maintenance, i.e., using vehicle sensitive to get ahead of the maintenance issues. The predictive maintenance use case are added to many other [Inaudible] enabling, including usage space insurance, intelligent EV Avery management, in-vehicle payments and the next-generation 911 emergency response, just to name a few. Looking ahead, we expect our product -- our next product release in December and remain focused on IVY design wins, which we currently expect to secure in calendar year 2023. We also plan to showcase more of IVY exciting capabilities and use cases at CES in January.\n\nSo please stay tuned for more details on that in the coming months. Moving on to cybersecurity business unit. Revenue for the quarter was in line with expectation at $111 million. The business also delivered sequential billing growth of 15% to $102 million.\n\nCyber billing for the first half of the fiscal year grew 6% year-over-year. Gross margin was 55%, ARR came in at $321 million, dollar-based net retention rate was 85%. In the quarter, we closed business with a wide range of customers but saw particular strength in our core verticals of government and financial services. In North America, we secured business with the Department of Treasury, the Federal Trade Commission, Department of Energy, AIRS, Union Stock Exchange and the U.S.\n\nMint. We also won business with leading merger agency such as the U.S. Army Corps and Engineers, U.S. Central Command, U.S.\n\nMarine Corps and other branches of the Department of Defense. Internationally, we secured business with U.K., her majesty, I guess, we change that now, the majesty treasury, the UAE Ministry of Presidential Affairs, the New Zealand Parliamentary Services, the Australian Electoral Commission and the Polish Ministry of Foreign Affairs, just to name a few. In financial services, we won new logos as well as renewal and upsells with leading banks in U.S., U.K., Switzerland, Japan, Israel, Italy, and more. In addition to these core verticals, we recorded a strong quarter for new business in the middle market.\n\nThis is a large segment of the market dominated by legacy players, altering legacy solutions and one where our finance product portfolio is resonating well. BlackBerry is very well placed to grow in this market for a number of reasons. The level of timing risk for mid-market customers is high. With our current research team identifying that SMBs, phases upwards of 11 cyber-attacks per device per day.\n\nSMBs are also those with the lowest level of insurance against ransomware demand. As our study with the Corvus Insurance Show, meaning that they can often ill afford a breach. Customers in this segment, particularly like our lightweight agent and how effective our products are at detecting threats. Our AI engine, the most mature in the market has seen billions of data points, both malicious and non-malicious and use machine learning over several years to effectively distinguish between the two.\n\nFurther, mid-market customers among those with the fewest resources and expertise to staff a 24/7 security operating center. And customers like how our managed service offering CylanceGUARD have solved the issues for that. As we described in previous quarters, there have been some headwinds for Cyber ARR. However, we expect ARR to return to grow early next fiscal year.\n\nA lot of efficient and investment made in the past two quarters are starting to bear fruit, and we see some data points and feel confident in this outlook. First, we saw the total timeline of potential opportunity for our Cylance product at the end of Q2 increased by 23% year-over-year. And for new logos specifically, the increase was 73%. Second, significant progress has been made with the product portfolio in recent quarters and is continuing.\n\nFor example, I'll give you an example, recent enhancement to our PROTECT EPP product have positively impacted our positive rates as evidenced by trusted third-party VirusTotal. Third, on the global markets front, we're working to replicate the success we already had, particularly with the mid-market customer, we added a lot of cybersecurity industry experience this year, and we expect to see more traction at these new hires fully ramp up. Fourth, this coming quarter, we're commencing a program to build strong relationship with key channel partners and distributors that are well-established players in the cybersecurity market. We also received a lot of positive feedback following the Cylance product rebrand, including a significant increase in both website traffic and new leads.\n\nTurning to the overall demand environment for cybersecurity, the rest of the FY '23 looks fairly solid. As I mentioned earlier, BlackBerry has a strong government footprint and demand in vertical appears to still be robust. Overall, we're marketing customers coming back on the cybersecurity budget, even in the mid-market, given how critical it is to maintain the cyber defense. Therefore, there are no change to the outlook that we have provided previously.\n\nWe continue to expect the cybersecurity business unit revenue to be broadly in line with fiscal year '22. Let me now turn to licensing. Revenue in the quarter came in at $6 million. The sales process for the non-core patent portfolio continues.\n\nWe understand that the length of time that this has taken is frustrating for shareholders, and we are equally as frustrated, if not more, as we work on it every day. However, we firmly believe that divesting the portfolio remains the best option for shareholder value. While the portfolio is still relatively fresh, the IP as part of the deal and the business of monetizing it, it's not related to our core business. At the time, we were required to announce the deal, we understand that getting the government approval could take up to 210 days, if not longer, but we were pleased that the process was completed much sooner. [Inaudible] we're working to conclude the financing in parallel to getting government approval.\n\nUnfortunately, we believe the turmoil in the financial markets created unexpected challenges for the original financing syndicate. However, there has been much interest from other parties wanting to take their place, in [Inaudible] are currently working to lock down their final syndicate. In parallel to this, we're actively working on an argument where financing is not a contingency as well as finalizing our plan to restart the monetization engine ourselves should that be necessary. We will, of course, keep shareholders posted until our final outcome is achieved.\n\nLet me now hand over the call to Steve, who will provide additional color on our financial results for the quarter.\n\nSteve Rai -- Chief Financial Officer\n\nThank you, John. As usual, my comments on our financial performance for the second quarter will be in non-GAAP terms unless otherwise noted. Total company revenue for the quarter was $168 million. Total company gross margin was 64%.\n\nOur non-GAAP gross margin excludes stock compensation expense of $1 million. Operating expenses for the second quarter were $129 million, and these non-GAAP operating expenses exclude $22 million in amortization of acquired intangibles, a $10 million fair value gain on the convertible debentures, $5 million in stock compensation expense, $4 million from the impairment of long-term real estate lease assets and $3 million of restructuring expenses.  BlackBerry continues to make carefully considered investments for top line growth, such as adding additional headcount to the IoT team in response to a strong schedule of professional services from design wins as well as expanding our reach in the cyber market, as John outlined earlier. The non-GAAP operating loss for the second quarter was $22 million, and non-GAAP net loss was $29 million. The GAAP basic loss per share was $0.09, and the non-GAAP loss per share was $0.05.\n\nAdjusted EBITDA, excluding the non-GAAP adjustments previously mentioned, was negative $16 million. Now breaking down revenue in the quarter. IoT revenue was $51 million and cybersecurity revenue was $111 million. Software product revenue remains in the range of 80% to 85% of total revenue, and professional services formed a balance.\n\nAs before, approximately 80% of software product revenue was recurring. Licensing and other revenue was $6 million. Now turning to the balance sheet and cash flow. Total cash, cash equivalents and investments were $699 million at August 31, 2022.\n\nFree cash flow was negative $26 million with cash used by operations of $23 million and capital expenditures of $3 million. That concludes my comments. I'll now turn the call back to John.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nThank you, Steve. Before we open the lineup for Q&A, let me summarize the key points for the quarter. Number one, our IoT business unit delivered strong year-over-year revenue growth, in large part driven by ongoing strength from design phase revenue. IoT remains firmly on track with proof-of-concept trials progressing well, and the team is executing on the product development road map as planned.\n\nOur cybersecurity business unit, net revenue expectations, delivering strong sequential business growth and continue to implement a strategy to build the business with ARR expected to return to growth early next fiscal year. Despite the volatility in the macro market, we are maintaining our revenue outlook for both business units and continue to execute against our plan. That concludes my remarks. And operator, could you please open the line for Q&A.\n\nOperator\n\n[Operator Instructions]. Your first question comes from the line of Mike Walkley with Canaccord Genuity. Your line is open.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nHey, Mike.\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nHey, John. Thanks for taking my question. If you delve in a little bit more to the cybersecurity business. The billings commentary sounds promising.\n\nCan you just update us maybe on the UEM side, kind of where we are and that's falling off and the confidence that gives you that ARR will start to grow next year?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nYes. So the UEM, as you know, it's a very price-sensitive market on the mid and low end. And particularly dominated by one major player in the market, including [Inaudible] and so forth. For the higher-end markets, where they absolutely needed better security, we tend to hold on to those businesses as well, and in some cases, expand on it.\n\nWe also have -- in addition to just the UEM, secure communication and also an opportunity to upsell our UES product too, the finance product. So on a whole for the UEM, we kind of expected our sales to holding is pretty flat. And then we'll have a way to grow the business next year by bundling some more other stuff and new products that come out and features. The final point I'd like to make is you -- Microsoft, for example, their Intune is really a mobile application manager.\n\nThis is really not a UEM. So the customers are beginning to recognize that the security side of the equation, they're not fulfilling their requirements. So I think there might be a good strong argument for us to either overcome their tack from Microsoft Intune or actually coexist with them in account that absolutely needed mission-critical security. So that's kind of our current thinking.\n\nAnd we feel reasonably good about what I said in terms of where the market validation has been, especially with big customer.\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nAnd as a follow-up question, how has pricing in the endpoints security market as you go head-to-head with both legacy and some of the other next-generation vendors? And then also with the progress on your platform, are you sharing any metrics or give any rough color on how upsells going and how maybe some of your new customers are landing with more than just one product from Cylance?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nI get the first part about the legacy. What's the second part? Was it about platform and the ability to upsell. Is that right, Mike?\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nJust how you're going? Any metrics on customers taking more than one Cylance module?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nI see. I don't have that information handy with me. So either we're going to have to follow up with you [Inaudible] John chew on that information. And the legacy product line, it's interesting, we see actually the most progress we made against the legacy player, particularly in the mid-market where the mid-market doesn't really have a CECL [Inaudible] what we offer, and particularly on GUARD which is the managed service, that's very well, resonates really well.\n\nWe see a pretty big strong growth. The numbers are not huge in terms of the actual amount of dollars, but the number of accounts that we're winning are reasonably sizable.\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nThanks for taking my question. I will pass it on.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question is from the line of Luke Junk with Baird. Your line is open.\n\nLuke Junk -- Baird -- Analyst\n\nHello there. Good afternoon and thank you for taking the questions. My first question, maybe a little bit of a bigger-picture question, John. I'd be curious to get your updated perspective on the auto software competitive landscape in regards to the IoT business.\n\nIn the last few months here, we've seen both companies that haven't traditionally played in auto looking to make inroads here and in some cases, announcements with customers and some of the chip companies as well talking a bigger game of auto software, your thoughts on both, especially any comments that you build offer on your direct engagement with the chip companies and how that's evolved or incrementally grown recently? Thank you.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nOK. That's a good question. So QNX is probably the biggest player in the auto embedded software space, particularly in the area of operating system and so we, by far, touch wood, with most of a big deal. I will refer you to the last two, three quarters of big win in BMW, in Volvo, in Volkswagen and a lot of the electric vehicle player.\n\nBecause we occupy a pretty unique position on the stack. Most people, when you talk about a big company, once again, in auto software, they tend to be more on the UI side, user interfaces, more on the infotainment side, but sell them on their core side of the deck, a case point is the announcement of that we won vw.os, Volkswagen intend to build their own software stack. They do work with just a few players and the chip level up. And so we are one of the players because of operating system.\n\nSo as for your question -- so we feel pretty good about where we focus and the more mission-critical and safety certified components of our products, and there will be more that will come out. And we have -- just in case you don't remember this, but we have the highest level of ISO Certification in safety. So we feel pretty good about our position. And so as the question on chipset, probably the two or three biggest chip vendors that we work with are very committed to each other for a very longtime account in particularly two of them are Qualcomm and NVIDIA.\n\nAnd Qualcomm and NVIDIA are quite dominant in the auto space. So we feel very comfortable in both our partnerships and their position in the market and our position in the market that doesn't overlap. So I think just being overly -- I don't want to change it obviously, but we feel pretty good. And in addition to that, even sales by Google, at a quarter ago or two quarters ago [Inaudible] hypervisor as Google enjoy auto play.\n\nSo that will tell you something about the unique position we are in, but we are not really in contradiction to what they offer.\n\nLuke Junk -- Baird -- Analyst\n\nOK. Thank you for the larger color then. And then staying within IoT for my follow-up, you recently announced that you've gained certification in the aerospace market. And I was just hoping you can expand on the strategic approach to that market.\n\nAre there any parts of the market that you're focusing on initially? How are you investing and resourcing that initiative and anything similar that would be worth adding? Thank you.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nYes. This is a little early for us, but we do have the intent. And so when we look at the success in our auto market, it's really all rely on the highest level of safety certification. So we then -- and we have a new product that comes out that focus on high level of scalability.\n\nAnd so if you think about this, and we think about, OK, who else, which vertical exhibit the same requirements, so needed the same requirement. So medical is one, industrial is one. And we've been doing reasonably well on what we call the general market -- general embedded market, which medical and industrial is in there. But we are very interested in the cycle of replacing some of the legacy software and the aerospace, particularly aircraft area.\n\nAnd so this is why we want to make sure that we're certified so that a developer can reuse the code. And we likely will work through large system integrators like Raytheon and [Inaudible], but that's to the extent that I can share at this point.\n\nLuke Junk -- Baird -- Analyst\n\nThat's -- we understand and helpful color. [Inaudible] understand where you are headed. Thank you.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nAll right. Thank you.\n\nOperator\n\nYour next question comes from the line of Paul Treiber with RBC Capital Markets. Your line is open.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nHi, Paul.\n\nPaul Treiber -- RBC Capital Markets -- Analyst\n\nHi, John. Good afternoon. Just I just wanted to follow up on your previous comments about auto software. What's changed in your mind in terms of the mentality of these auto OEMs and even Google to adopt QNX as a foundational layer?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nWell, it's a -- so first of all, QNX, the operating system has been in the business for over 30 years. And you all remember that on the extent some of it but it was way back when it was the infotainment company, it's actually long to Harman. And BlackBerry bought it before my time, they bought it and was kind of creating an operating system with it. So, the safety certification has always been the claim the same.\n\nAnd they want a lot of infotainment. So, what we have done since the time I arrived, what we have done is to expand from infotainment into areas of more safety-oriented and superior oriented on oriented applications actually related to a car. And of course, then in parallel, the world started to move toward the software-defined vehicle. So therefore, the OEMs are taking more control of the design, the stack, the software stack, OK? And -- but they also know that they can't just sit there and replicate their operating system and get it certified.  Now some people try to use say Automotive Grade Linux, AGL, but AGL couldn't get it certified, and it's an open source also with a -- has its own business challenges to it.\n\nSo, they gradually all came back to QNX. And that's the reason why. And then being having over 200 million cars that use our software today effectively, you will send a pretty sizable market for a lot of other players to ignore. So, on player to be ignored.\n\nSo, this is why Google works with us and Qualcomm works with us and NVIDIA work with us, and GI works with us, and [Inaudible] works with us, and it's a long list of players that all uses us as a foundational piece, and then we'll continue to expand application or different types of features in that foundation base.\n\nPaul Treiber -- RBC Capital Markets -- Analyst\n\nThat's helpful. The -- and it's in my next question. Like how do you think about the economics within the foundational layer? And what's the strategy to try to maximize economics over the long term?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nIt's -- well, our strategy is obviously use more of more of our foundational modules in the stack. And so -- that's the basic strategy. And then if you have multiple copies and then as we get deeper into the engine and deeper into the safety side of the equation of a car operation, it will -- the QNX will be able to demand or command a little bit more ARPU. So we have more copies and higher-value copies like hypervisor is to have a higher value than infotainment.\n\nFor example, that's kind of move up the stack in ARPU and broaden it to be multiple copies in the cart. This is our strategy in general for the business strategy side. And then don't forget IVY, because IVY is our next-generation push into EHS to cloud. And it not only provides security and privacy, it also provides economics because cloud-only solution is too expensive, and it's too much data being generated along the operation of a car.\n\nSo don't forget about that. So we feel that we have a pretty good one, two, three functions on the auto space or at least on the IoT side, and we're going to expand it beyond auto, as I said. But today, we're very focused on auto.\n\nPaul Treiber -- RBC Capital Markets -- Analyst\n\nAnd just if I can just squeeze in one more. Just in regard to the patent portfolio, I mean I know it's -- you're limited in terms of what you can say. But how should we think about the time frame that the clock is ticking in terms of the ability to monetize the patents. As the time goes on, does it -- buying the patents decrease to you or to a potential buyer? Or is there a way to get back damages, per se or back royalties and so the time is less critical?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nYes. Assume there are two data points, you already answered one, which is those that needed our license will have to address the path deployment. So it's not just time ticking away and therefore. So that's one of the answers to your question.\n\nThe other one is there is a miss out there about the time. There was an article published that's actually incorrect, and it's actually incorrectly almost throughout the entire article about the number of years for our portfolio and the value of that, that is absolutely not true. Because if it had been true, then you would have -- you wouldn't have to be syndicate to wanted to make this thing happen. So I will just leave it at that.\n\nI don't want to do a public debate with the writer, but I'm sorry, the writer is absolutely wrong. Even though this article has been around for a little while, this was reprint by a newspaper that would like to, I guess, contextualize something that is not true. And anyway, I'll leave it at that. So yes, we could capture the path deployment and no, it's not that short of life.\n\nPaul Treiber -- RBC Capital Markets -- Analyst\n\nThank you for clarifying.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nAbsolutely.\n\nOperator\n\nYour next question is from the line of Todd Coupland with CIBC. Your line is now open.\n\nTodd Coupland -- CIBC World Markets -- Analyst\n\nHey there. Good evening. I wanted to ask you about the cyber unit. You indicated you still expect revenue to be roughly flat year-on-year.\n\nBut implied in that comment is a seasonal uptick in the fourth quarter. And I'm just wondering, is that also still expected in line with prior expectations. And I just wanted you to close the logic on that point with growth expected early in fiscal 2024?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nEarlier in fiscal 2024?\n\nTodd Coupland -- CIBC World Markets -- Analyst\n\nWell, you commented on ARR growth expected early next year.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nOf course, yes, yes, yes. It's a little bit of a complicated set of math, but I'll focus on the kind of the high level. So yes, our Q4 pipeline is a lot more bigger than Q3. And so we believe that, therefore, my statement about the revenue relatively flat in line with the last fiscal year, it's a proper statement.\n\nAnd then there will be some billings growth because of that. And then we also take a look at what the -- where the headwinds are. And if you look at all the headwinds from all the deals that we expected to either get or renewed and ones that are being attacked, especially the mid-market state, we believe that the major part of our headwind is behind us. We'll be behind us after Q4, sorry, I should say that because we kind of look through it on a quarterly basis.\n\nSo therefore, next fiscal year, I don't know whether it's Q1 or definitely Q2, that we expect ARR to have a year-over-year increase, and we should continue that trend going forward.\n\nTodd Coupland -- CIBC World Markets -- Analyst\n\nAnd on that point --\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nDoes that answer your question?\n\nTodd Coupland -- CIBC World Markets -- Analyst\n\nYes, that's clear. And on that point, just remind us what you think the potential growth in cyber is once you start to benefit from improved product bundling and go-to-market?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nYou saw the three-year plan that we put out -- a three- and five-year plan further release. In fact, I had recently presented to the board, we have not deviated from that, we're not deviating from that at all. So you can see that from a John [Inaudible] group, the cybersecurity group, the compounded annual growth should be roughly about 10%. So that will be what we will focus on getting.\n\nTodd Coupland -- CIBC World Markets -- Analyst\n\nOK. Thank you very much for the clarity.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nSure. Of course.\n\nOperator\n\nYour final question comes from the line of Trip Chowdhry with Global Equities Research. Your line is open.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nHi, Trip.\n\nTrip Chowdhry -- Global Equities Research -- Analyst\n\nThank you. Very solid execution in a brutal environment. Two questions. First, I had this regarding your Volkswagen deal, which is very significant.\n\nCan you give me some directional guidance in a sense that some metrics like you won the design, it's a design win, what should we be thinking in terms of production revenues once these vehicles go into production, how should we think, is it 1x, 2x, 3x the design win revenues? Is production usually more than design wins? Any color on that will be helpful. And then I have a follow-up question.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nOK. OK. So in general, I do auto because our backlog numbers are based on the auto. So in general, if you look at a cycle of an auto win somewhere between seven to 10 years.\n\nSo what we will see upfront is that probably on an overall -- let's say, a deal brings us $1 million. I'm making this up, OK? On total lifetime, obviously, it's a lot bigger than that. But let's just start with $1 million. So I would say the 10% upfront probably is something that we should expect and could expect on development fees.\n\nAnd then probably there are some professional services revenue. So I will put it again in the range of 5% to 10%. Now the bulk of the production will come a year normally four, five, six, seven, eight. However, we see that compressing because of all the -- because we're going electrified, right, the electrification, the electric vehicle market turns the product cycle a lot faster and particularly with the Chinese.\n\nThe Chinese is telling it around a cycle of three to five years instead of seven to 10. So -- and everybody else will probably have to keep up and whether they will get to three or five years, who knows. But it will shorten the seven to 10 years. So we get a little bit of upfront, which is always nice.\n\nAnd then we get some professional services, and then we will get the production royalty.\n\nTrip Chowdhry -- Global Equities Research -- Analyst\n\nExcellent. Now I was also wondering, you have a very solid offering in terms of IVY. And today, you mentioned the hybrid approach that is in cloud and on device, which is a vehicle which is, I think, very novelty -- very novel, because you don't want the OEM to be finalized for success where the success means more data. And if the whole objective is to put the data into the cloud, you, that is, BlackBerry or the OEM purely like a resell around AWS.\n\nSo I like that strategy big time. But I was wondering if you, that is, if there's a customer who is like Volkswagen, which is already standardized on OEM. Are there any plans you may have to make migration or at least experimentation with IVY, like just a mouse-click away, do we have anything like that in plans? And that's all for me.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nYes. That's a good question. I don't want to turn this into an announcement but let me just say that it is logical. It will be -- maybe put it differently.\n\nIt will be illogical for BlackBerry not to take advantage of all the assets. And there is a good reason why both IVY and QNX is in the same IoT group.\n\nTrip Chowdhry -- Global Equities Research -- Analyst\n\nVery good.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nI would now like to turn the call back over to John Chen, executive chair and CEO of BlackBerry for closing remarks.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nThank you. Thank you, operator. Before we conclude today's call, I'd like to remind everyone about our upcoming BlackBerry security summit on October 27, in that particular assess the FSC keynote addresses with BlackBerry executives, customer-led case studies, interactive talk on cybersecurity innovation and a practice from BlackBerry research and intelligence team and more, all virtual and all on demand. Investors could register for the event on the investor page of our blackberry.com website.\n\nAnd I want to thank you all for joining our call. I'm sorry there's always late in the East Coast. And I truly appreciate it. Thank you and see you all next time.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTim Foote -- Vice President, Investor Relations\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nSteve Rai -- Chief Financial Officer\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nLuke Junk -- Baird -- Analyst\n\nPaul Treiber -- RBC Capital Markets -- Analyst\n\nTodd Coupland -- CIBC World Markets -- Analyst\n\nTrip Chowdhry -- Global Equities Research -- Analyst\n\nMore BB analysis\n\nAll earnings call transcripts"
}