{
  "companyName": "Baidu",
  "companyTicker": "BIDU",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/22/baidu-bidu-q3-2022-earnings-call-transcript/",
  "content": "Baidu (BIDU -0.63%)\nQ3 2022 Earnings Call\nNov 22, 2022, 7:30 a.m. ET\n\nOperator\n\nThank you for standing by and welcome to the Baidu Inc. third quarter 2022 earnings conference call. [Operator instructions] There will be a presentation, followed by a question-and-answer session. [Operator instructions] I would now like to hand the conference over to your host for today, Juan Lin, Baidu's director of investor relations.\n\nPlease go ahead.\n\nJuan Lin -- Director, Investor Relations\n\nHello, everyone, and welcome to Baidu's third quarter 2022 earnings conference call. Baidu's earnings release was distributed earlier today, and you can find a copy on our website, as well as on Newswire services. On the call today, we have Robin Li, our co-founder and CEO; Rong Luo, our CFO; Dou Shen, our EVP in charge of Baidu AI Cloud group; and Zhenyu Li, our SVP in charge of Baidu intelligent driving. After our prepared remarks, we will hold a Q&A session.\n\nPlease note that the discussion today will contain forward-looking statements made under the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from our current expectations. For a detailed discussion of these risks and uncertainties, please refer to our latest annual report and other documents filed with the SEC and Hong Kong Stock Exchange.\n\nBaidu does not undertake any obligation to update any forward-looking statement, except as required under applicable law. Our earnings press release and this call include discussions of certain unaudited non-GAAP financial measures. Our press release contains a reconciliation of the unaudited non-GAAP measures to the unaudited most directly comparable GAAP measures and is available on our IR website at ir.baidu.com. As a reminder, this conference is being recorded.\n\nIn addition, a webcast of this conference call will be available on Baidu's IR website. I will now turn the call over to our CEO, Robin.\n\nRobin Li -- Co-Founder and Chief Executive Officer\n\nHello, everyone. Recapping the third quarter in broad terms, we delivered improved bottom-line results despite a challenging macroenvironment. Especially for the mobile ecosystem, operating profit resumed a positive year-over-year growth; and for AI Cloud, operating loss and margin improved meaningfully both on a year-over-year and a quarter-over-quarter basis. Businesses across the line from mobile ecosystem to AI Cloud to intelligent driving have been negatively affected by the resurgence of COVID.\n\nThroughout Baidu's history, however, we have experienced many challenging environment. Periods of challenges have enabled us to emerge stronger given our relentless effort on building long-term growth. We are using this period to ready ourselves for current business conditions to improve. Our key short-term tasks remain unchanged, which are efficiency, optimization, and continued investments in the new AI business.\n\nOur new AI business such AI Cloud and intelligent driving are well aligned with China's tech innovation and national initiatives. By doing so, we will further strengthen our leadership in new AI business and reaccelerate business growth. In Q3, Baidu Core ad revenue was down 4% year over year but improved from the second quarter's 10% year-over-year decline as macro had improved gradually since June. Encouragingly, revenues from healthcare and retail recorded positive year-over-year growth in the quarter.\n\nGoing forward, when COVID situation alleviates in major cities, ad revenue across different verticals such as travel, franchising, and local services should rebound. For our new AI business, I'm proud to report some highlights. Revenues from AI Cloud increased by 24% year over year to RMB 4.5 billion in the quarter. AI Cloud has been a major growth driver for Baidu Core nonadvertising revenue.\n\nIn Q3, nonadvertising accounted for 26% of Baidu Core's total revenue. That's up from 21% a year ago. Baidu Apollo's auto solutions continued to gain traction among leading automakers, and the total projected accumulated sales reached RMB 11.4 billion recently, growing more than 50% year over year. Apollo Go completed 474,000 rides in the quarter, up 311% year over year.\n\nBy the end of Q3, Apollo Go had completed 1.4 million rides on public sector. We believe we remain the largest autonomous ride-hailing service provider globally. Now, let's review the third quarter operational highlight. Revenue from the AI Cloud increased by 24% year over year to RMB 4.5 billion in the quarter.\n\nIn Q3, the operating loss margin for AI Cloud improved notably both year over year and quarter over quarter. Over the past two quarters, we have made a shift away from some lower-margin businesses to build sustainable growth for AI Cloud. Meanwhile, we continue to take measures to standardize our solution to cut down deployment costs as we scale up. Our efforts have allowed us to gradually improve operating profit and margin.\n\nI'll take ACE smart transportation as an example. In the past quarters, we continue to grow revenue and improve operating margin for smart transportation as we gain scale. Leveraging our strong AI capabilities and our insights into the industry, we have developed solutions for typical use cases such as traffic management and V2X for urban roads and highways. Previously, we talked about how our projects helped improve traffic efficiency on city roads in Beijing, Guangzhou, Xiong'an, Chongqing, and other cities.\n\nRecently, Zhuzhou City, an important transportation hub in Hunan Province, adopted our smart traffic management solution. Our solutions cover more than 70% of the major intersections in the busiest district of Zhuzhou. After adopting our solution, delays have been reduced by 22% during rush hour in the covered region. By the end of the quarter, Baidu ACE smart transportation solutions have been adopted by 63 cities, up from 24 cities a year ago and 51 cities a quarter ago, based on a contract amount of over RMB 10 billion -- 10 million per city.\n\nAs we demonstrated in our capabilities to use AI to improve transportation efficiency in more cities, ACE smart transportation will further expand its market share. We're trying to repeat our success in smart transportation in other key verticals such as manufacturing, energy and utilities, and the public sector. We will empower our customers with AI capabilities to help them increase productivity and cost control. With AI Cloud, our customers will be better positioned to take advantage of digital and intelligent transformation.\n\nWe believe we remain well-positioned in this early stage, fast-growing market due to, number one, our capabilities to establish end-to-end solutions based on our full-stack AI capabilities, ranging from chip design to deep learning frameworks to large language models to application-level software; and number two, our insights about customers' pain points and our growing know-how and capabilities to solve their problems. While COVID causes delays in project implementation and complicated our sales team's efforts hampering new contract wins, we believe the long-term trend of digital and intelligent transformation remains unchanged. Looking ahead, we will continue to focus on quality growth and aim to improve margins to achieve profitability for AI Cloud. In intelligent driving, we marked several key highlights in the third quarter, and our years of investments in intelligent driving have begun bearing fruit.\n\nOn Baidu Apollo's auto solution, our total projected cumulative sales exceeded 11.4 billion recently. Based on our current pipeline, some of the major car models equipped with ANP and AVP are expected to be launched in the second half of next year. We expect meaningful revenue contribution from this business to begin in 2024 and profit to expand when material revenue kicks in. Such growth demonstrates the increasing demand for our auto solutions.\n\nIn Q3, we extended our partnership with one of China's largest automotive and technology companies ANP, AVP, and HD Maps for one of their popular models. As of today, we have announced collaborations with many OEM partners. Serving various automakers has helped us standardize our auto solutions, making them compatible with more popular car models. As more cars equipped with our auto solution get into consumers' hands, we will continue to refine and update our solutions.\n\nConsidering the sizable development cost for high-level autonomous driving technology, many automakers seek partnership with reliable suppliers who have strong brand and technology capabilities. We have differentiated ourselves with world-leading Level 4 autonomous driving, which has been established through years of investment. Now, we are proactively building high-quality partnerships with an increasing number of auto OEMs to accelerate our partners' progress in autonomous driving. A few months ago, we integrated Baidu Maps into our intelligent driving group to create synergies between the Baidu Maps mobile app and the map solutions for auto and transportation industries.\n\nSince our maps have already been widely adopted, we have obtained more insights in the transportation industry, allowing us to strengthen our solutions for the mobility sector. On Apollo Go, we continue to scale up our operations, and we believe we remain the largest autonomous ride-hailing service provider worldwide. In the third quarter, the ride provided by Apollo Go reached 474,000, increasing 311% year over year and 65% quarter over quarter. A vast majority of the ride were for serving passengers during rush hour, covering places like subway stations, office buildings, and shopping malls.\n\nAs our operations continue to expand, Apollo Go keeps learning and improving from scenarios that do not occur during the testing phase. Leveraging large-scale operations, we are making Apollo Go a professional AI driver while offering a safe and comfortable autonomous ride-hailing service. Today, with an Apollo Go vehicle enter dense intersections, it is able to easily pick up gaps between pedestrians, bicycles, and other moving objects, safely driving to school while providing a comfortable experience to the passengers. Apollo Go continues to improve autonomous ride-hailing services under extreme weather.\n\nScalable operations have indeed reinforced our Level 4 autonomous-driving capabilities, setting a strong foundation for further operation expansion. We believe this virtuous cycle will make Apollo Go the most experienced AI driver to handle various situations on the road and large scale. We're pacing the expansion of Apollo Go based on a comprehensive financial model. In previous earnings calls, we talked about Apollo Go's achievement in the Yizhuang region of Beijing.\n\nIn fact, Apollo Go has achieved significant progress in other Tier 1 cities as well. In Q3, on average, each vehicle in Beijing, Shanghai, and Guangzhou completed more than 15 rides per day. According to our knowledge, this number is quite close to the average daily ride for traditional ride-hailing services. We believe that our strong and improving safety track record on public roads provide a strong endorsement for more cities to issue permits for fully driverless ride-hailing.\n\nWe believe fully driverless ride-hailing will create more affordable urban transport and attract more consumers to the ride-hailing market. Baidu will continue to invest to capture this massive market opportunity. Moving to the mobile ecosystem, our operating profit improved on a year-over-year basis, and we continued to generate strong cash flow in the quarter. Our mobile ecosystem continues to expand.\n\nIn September, Baidu App's MAUs increased by 5% year over year to 634 million. In Q3, total mobile search queries increased by double digit year over year, and feed distributed through Baidu App increased by 23% year over year. We continue to introduce short videos in feed and search results. In September, short video distribution and time spent within Baidu feed grow double digit year over year.\n\nFor Baidu Search, in September, 23% of the clicks on search with our pages were short videos, and we expect the prevalence of video in search results to continue progressing rapidly. We are using AI to produce more short videos for our mobile ecosystem. While it is still in a very early stage, we believe AI will allow us to generate short videos much faster and more cost-effectively than human-generated content. In e-commerce, users now coming to Baidu App for product search, which resulted in a continuous increase in product-related search queries.\n\nQuarterly GMV facilitated by Baidu Search grow by about 52% year over year in Q3. Today, users come to Baidu App not only to search for information and knowledge but increasingly to look for services and merchandise. As we are able to make purchases and book services without leaving Baidu App, we have been deepening our understanding of user needs. Meanwhile, more customers are leveraging our ecosystem infrastructure to build their marketing campaigns and even operate their businesses on our mobile ecosystem.\n\nThis has allowed us to accumulate more customer insights and better serve the customers. The improving insights into our users and customers have, in turn, allowed us to improve user experience and app conversion. In the future, we believe our mobile ecosystem will continue to generate strong profits and cash flow. To close, during this uncertain time, we're focused on making the long-term investments that well positioned us to be stronger coming out of this challenging period, including Baidu AI Cloud and intelligent driving.\n\nWhile the advertising industry has been impacted by COVID-19, some of our verticals could recover faster when there is an upturn in the economy, which will drive our ad revenue to resume growth. Before I turn the call to Rong, I want to thank Baidu's employees for their dedication to work in a challenging environment and the time and effort they put into making our company story a success in the long term. With that, let me turn the call over to Rong to go through the financial highlights.\n\nRong Luo -- Chief Financial Officer\n\nThank you, Robin. Now, let me go through the details of our quarterly financial results. Total revenue was RMB 32.5 billion, increasing 2% year over year. Revenue from Baidu Core was RMB 25.2 billion, increasing 2% year over year.\n\nBaidu Core online marketing revenue was RMB 18.7 billion, decreasing 4% year over year but improved 10% from the second quarter as macro has improved gradually since June. Baidu Core nononline marketing revenue was RMB 6.5 billion, up 25% year over year, driven by cloud and other AI-powered businesses. In Q3, AI Cloud increased by 24% year over year to RMB 4.5 billion. Revenue from iQIYI was RMB 7.5 billion, decreasing 2% year over year.\n\nCost of the revenues was RMB 16.3 billion, increasing 1% year over year. Baidu Core cost of revenues was RMB 10.7 billion, increasing 15%, one-five, year over year, which was in line with the growth in sales of AI Cloud and other AI-powered businesses. Operating expenses was RMB 11 billion, decreasing 19%, one-nine, year over year, primarily due to a decrease in channel spending, promotional marketing expenses, and staff-related expenses. Baidu Core selling, general, and administrative expenses were RMB 4.2 billion, decreasing 31%, three-one, year over year.\n\nSG&A accounting for 17%, one-seven, of Baidu Core revenue in the quarter and decreased from 25% in the same period last year. Baidu Core research and development expenses was RMB 5.3 billion, decreasing 4% year over year. R&D accounting for 21% of Baidu Core revenues in the quarter and decreased from 22% in the same period last year. Operating income was RMB 5.3 billion.\n\nBaidu Core operating income was RMB 5 billion, and Baidu Core operating margin was 20%. Non-GAAP operating income was RMB 7.2 billion. Non-GAAP Baidu Core operating income was RMB 6.7 billion. And non-GAAP Baidu Core operating margin was 26%.\n\nQ3 presents the first year-over-year growth in non-GAAP operating profit and margin perspective since Q2 2021. Total other loss net was RMB 4.8 billion, decreasing 78% year over year, which mainly including a fair value loss of RMB 3.1 billion and an impairment of long-term investments of RMB 1.4 billion. In the third quarter last year, we recognized a fair value loss of RMB 18.9 billion. A significant portion of long-term investments, including, but not limited to, investments in equity securities of public and private companies, private equity funds, and digital access.\n\nThis is subject to quarterly fair value adjustments, which may contribute to net income volatility in future periods. Income tax expenses was RMB 908 million, compared to an income tax benefit of RMB 1.8 billion in Q3 2021, primarily due to an increase in deferred tax benefit recognized on fair value loss of long-term investments and deduction on certain expenses that were previously considered not deductible in the third quarter of 2021. Net loss attributable to Baidu was RMB 146 million, and diluted loss previous per ADS was RMB 0.87. Net income attributable to Baidu Core was RMB 25 million.\n\nNon-GAAP net income attributable to Baidu was RMB 5.9 billion. Non-GAAP diluted earnings per ADS was RMB 16.87. Non-GAAP net income attributable to Baidu Core was RMB 5.8 billion. And non-GAAP net margin for Baidu Core was 23%.\n\nAdjusted EBITDA was RMB 8.9 billion, and adjusted EBITDA margin was 27%. Adjusted EBITDA for Baidu Core was RMB 8.2 billion, and adjusted EBITDA margin for Baidu Core was 33%. As of September 30, 2022, cash, cash equivalents, restricted cash, and short-term investments were RMB 184.5 billion. And cash, cash equivalents, restricted cash, and short-term investments, excluding iQIYI, were RMB 179.5 billion.\n\nFree cash flow was RMB 6.6 billion; and free cash flow, excluding iQIYI, was RMB 6.4 billion. Baidu Core had approximately 36,500 employees as of September 30, 2022. On a separate note, iQIYI generate positive operating profits on both GAAP and non-GAAP basis in this quarter. In addition, IQiYI also generate positive free cash flow in this quarter.\n\nWith that, operator, let's now open the call to questions.\n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions] The first question today comes from Alicia Yap with Citigroup. Please go ahead.\n\nAlicia Yap -- Citi -- Analyst\n\nThank you. Good evening, management. Thanks for taking my questions. I have two questions.\n\nFirst, can management comment how should we look at the advertising demand recovery in the near term and also in the next two quarters? And then secondly, can management comment on how you think about the competitive landscape in the China advertising market will evolve going forward and what would Baidu long-term market share be? Thank you.\n\nRobin Li -- Co-Founder and Chief Executive Officer\n\nHi, Alicia, this is Robin. Let me answer your questions. Yes, our revenues are very sensitive to COVID control measures. Baidu Core's ad revenues, we turn positive year-over-year growth in August.\n\nBut in September, it decreased again because of a new round of COVID resurgence. Overall, Q3 was much better than Q2 because there was, I think, recovery from the second quarter in which, you know, there were a lot of disruptions caused by COVID. When we entered the fourth quarter, the situation improved in October. But since early November, it got a bit cloudy because another round of COVID impacted some regions like Guangzhou and Beijing.\n\nWe are closely watching how the situation will develop. I think the short term will probably still be quite volatile, but the economy should improve in the midterm and beyond. China has been fighting against this COVID for almost three years and the country has been gaining experience. While we -- we're certainly going to see some ongoing disruptions and uncertainties, the overall situation should improve, should move in a positive direction over the next few quarters.\n\nAs you know, many of our app verticals were affected by COVID and macro. So, once COVID and macro situations improve, our ad revenues from different verticals such as travel, franchising, or local services should rebound. Again, we will closely watch how COVID situation develops, and we will work very hard to bring our ad revenue back to a positive year-over-year growth as long as possible. In addition, AI Cloud and intelligent driving, our new businesses, are also negatively impacted by the COVID disruption.\n\nSo, if COVID impacts subside, these nonadvertising businesses should also see improvement. And regarding to your question on competition in the online advertising market, first of all, I think Baidu App is one of the very few superapps in China's mobile internet industry, well-recognized and well-established. Search has enjoyed the best ROI among various types of performance app because users explicitly express their intent in our search box. And search ads connect users' intentions with the most relevant product and service offerings.\n\nThis is why a lot of advertisers consider Baidu Search as the most important and most efficient channel to reach their targeted audience. And secondly, China's mobile internet is maturing. User growth is gradually slowing down and the competitive landscape is much less volatile than before. With this backdrop, Baidu App still managed to grow its user base nicely over the past many quarters.\n\nOn top of that, with the unique positioning of search, we believe we should be able to sustain our market share in the online advertising market over the long run. And thirdly, unlike our peers, most of our advertisers are SMEs, right, in the real economy. Many of them run businesses in the service sector, such as local services, business services, and travel. These businesses were hurt the most by the pandemic.\n\nSo, when the COVID impact subsides, ad revenues should rebound quickly and Baidu stands to gain share in the overall advertising industry.\n\nAlicia Yap -- Citi -- Analyst\n\nThanks, Robin.\n\nOperator\n\nThe next question comes from Eddie Leung with Bank of America. Please go ahead.\n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\nHey. Good evening, guys. Pretty solid quarter despite all the macro headwinds. I have a couple of questions on cloud services.\n\nSo, we have seen -- it seems like a slowdown in the industry. So, could you talk a little bit about the reasons behind the slowdown and how you guys are thinking about the growth rates in the upcoming, let's say, your quarters or medium term? And then secondly, could you also talk a little bit about the competitive landscape? We have seen media reporting market share gains by cloud companies outside the internet sector in the past one or two years, right? So, any color on the competitive landscape would be useful. And then finally, I remember, Robin, you mentioned about the margin improvement of cloud. So, could you also talk about your thoughts on the road to profitability and the timeline would be helpful.\n\nThank you.\n\nDou Shen -- Executive Vice President and Head of AI Cloud Group\n\nHello, Eddie. Thanks a lot for your questions. This is Dou. I will try to answer your questions.\n\nSo, for the revenue growth part, I think it's slowing down mainly due to the COVID-19 impact. So, for example, as you know, because of the travel restrictions, we could not even implement our projects on time. And the bidding for the new contracts was also affected. Apart from that, you know, I also want to highlight that we are focused on healthier and more sustainable growth by cutting some low-margin businesses.\n\nSo, we believe this approach is crucial for the long-term development. Actually, looking beyond the current quarter, as Robin just mentioned, the trend for China's traditional industries and the public sector to use AI and move their business onto the cloud remains unchanged. So, I think, post-pandemic, companies should gain more confidence in their future growth so that they are more willing to spend more money on digital and intelligent upgrades. Baidu has already, you know, demonstrated that we are very capable of using AI to improve the efficiency in transportation.\n\nSo, as you can already see, you know, our ACE smart transportation revenues have been growing rapidly, and we continue to gain market share accordingly. So, in the meanwhile, we are reducing the operating loss for smart transportation because we continue to expand the scale and continue to increase operating leverage. So, in our next steps, we are excited about, you know, repeating our success in transportation in other traditional industries like manufacturing and utilities. So, actually, in that -- just the past quarter, our cloud revenues from the manufacturing and utilities industries both grow solidly, and it is largely because of our continuous efforts in improving the end-to-end AI capabilities and our understanding of the fundamental needs in these industries.\n\nSo, to answer your questions, we believe these are our sustainable competitive advantages to compete against other players. In addition, you know, the market is expanding and there are plenty of opportunities for us and our peer companies to grow over the long term. So, talking about the profitability. So, by the way, AI Cloud reduced operating loss and continued to improve operating loss margin this quarter.\n\nTo expand on that, you know, our personal cloud have been generating decent operating profit and margin, and our enterprise parts grow faster than personal cloud. And we're very happy to see the trend of a loss reduction because of the efforts I just mentioned earlier. So, our strategy to standardize solutions within the user -- in the use cases for key industries started to bear fruit. So, we have worked very hard to replicate more solutions from one user case to another to grow business scale and improve margins.\n\nSo, it's already proven in smart transportation, as we have mentioned. And in the future, we look forward to extending this approach on a large scale in market industries. So, AI Cloud is a very important new business for Baidu, and we will continue to grow the business and improve margins going forward. Thank you, Eddie.\n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nThe next question comes from Alex Yao with J.P. Morgan. Please go ahead.\n\nAlex Yao -- JPMorgan Chase and Company -- Analyst\n\nThank you management for taking my question. I have a couple of questions on Baidu Core margins. In the past several quarters, you guys did a very good job in terms of cost control and the margin improvement. As large-scale BU and headcount streamlining has been already done, how much more room should we think about for further cost-cutting in Baidu Core in the coming quarters and 2023? And the related question is, how should we think about the Baidu Core operating margin going forward? Lastly, will Baidu slow down the cloud and autonomous driving investments if the macro situation further deteriorates? Thank you.\n\nRong Luo -- Chief Financial Officer\n\nThank you, Alex, for your questions. Let me try to figure out your questions. This is Julius. And I think as Robin has said, you know, while at the beginning of the prepared remarks, I think for Baidu Core, we continue to optimize the cost expenses, and we continue to improve our operational efficiency, which is one of our key short-term task.\n\nAt the same time, we kept investing in the new AI businesses for our future growth. This strategy, actually, has not changed in the past few quarters, and this strategy allows us to weather through the challenging market environment. And we believe that it will prepare us for accelerated growth again once the macro downturn is over. In Q3, let me recap some of the numbers.\n\nBaidu Core's non-GAAP operating profit margin expanding to 26%, from 24% in the same period last year. I think you have to represent here the first year-over-year growth in non-GAAP operating profit margin perspective since Q2 2021. We make a lot of efforts to achieve such results. You probably can see that from our online release.\n\nOur SG&A has decreased once again in Q3, this quarter, from the same quarter last year. We have been very disciplined with the channel spending and promotional activities. And just to act that, it was already lesser consecutive quarter that SG&A achieved a year-over-year decline. And going forward, we will continue to control the variable costs and expenses, as same as what we did in the past.\n\nIf we look into each part of our business, for mobile ecosystem, our operating profit actually is going up on a year-over-year basis, even though we know the revenue was negatively impacted by COVID-19. And we have also already mentioned earlier, which is just repeated by Dou, we make a lot of efforts for the healthy growth of AI Cloud. This quarter, the operating loss margins for AI Cloud improved significantly, both on a year-over-year basis and quarter-over-quarter basis. If we separate two part, for enterprise and public sectors, we're allocating our resources to high-margin business and reduce the low-margin business.\n\nAlso, we continue to standardize our end-to-end solutions, including the IaaS, PaaS, SaaS for key user cases and [Inaudible] as much as expectations started in one of the examples. We continue to grow fast and, at the same time, improve the margins quite notably. In the personal cloud, same as what we did in the past, we continue to generate decent profits this quarter. For our robotaxi business, Apollo Go, we also chose to grow Apollo Go in a measured pace.\n\nWe have a very comprehensive financial model to optimize and forecast the costs and expenses in this business, especially the labor costs and they vary for hardware costs. We have been very careful to measure and estimate the cash flow for this business. Our strategy is to strengthen our leading position in robotaxi all over the world, acquire sizable market shares in the ride-hailing sector, especially in the key cities in China and in the future, and ultimately try to generate more profits in these key areas. We are not expanding our operations without thinking about building sustainable and profitable business models for Apollo Go.\n\nFor auto solutions, as Zhenyu mentioned just now, we already have a project to make sales up around RMB 11.4 billion. While revenue contribution is still very small at this stage, we expect it to run low-key in probably the second half of next year or maybe early in 2024 as smart cars with our solutions can become available in the market. And once the meaningful revenues kick in, this business should start to generate profits. I would also make it clear, the RMB 11.4 billion is our estimate, including the contract sign and nomination letters we received from OEMs.\n\nIn auto industry, a nomination letter means a supplier is affected for certain projects and then the OEMs will sign a contract with us to produce. Our estimate is based on our assumptions of the timing of launch, the pricing, the total volumes. I hope this gives you a better understanding of how we have made these calculations. Looking forward, we will continue to be very disciplined with the costs and expenses.\n\nAnd at the same time, we'll continue to invest in AI Cloud and intelligent driving for our long-term growth despite often the challenging environment in the short term. And in the future, we believe our mobile ecosystem will continue to generate some profits and cash flow to support our investments in the new AI business. And we'll also continue to work very hard to narrow our loss in AI Cloud. Thank you so much for your question.\n\nOperator\n\nThe next question comes from Gary Yu with Morgan Stanley. Please go ahead.\n\nGary Yu -- Morgan Stanley -- Analyst\n\nHi. Thank you for the opportunity and congrats on the expanded partner network and growing backlog for ADS business. I have a question on your auto solutions. Just wondering when should we expect meaningful revenue to start kicking in, and how do you differentiate the Apollo's auto solution from your peers? And could you help us understand the underlying market space for Baidu Apollo's auto solutions? And a related question to that is, have you noticed a significant change in the attitude of the OEMs toward self-developing for intelligent driving solutions? Thank you.\n\nRobin Li -- Co-Founder and Chief Executive Officer\n\nHi, Gary. This is Robin. We're seeing huge opportunities in the auto solutions market. In the first 10 months of this year, EV sales increased by more than 100% in China.\n\nWe're now the largest EV market in the world, accounting for more than half of the global EV sales. A clear trend for the auto industry is vehicle intelligence. Baidu is benefiting from this trend. You know, our years of investments in autonomous driving have begun to bear fruit.\n\nBaidu Apollo's auto solutions and derived from our core technologies. A lot of AI models we build for robotaxi can be used for ASD. Another point to note is that, as the market leader, we have been investing in autonomous driving for about 10 years. And thanks to these investments, we not only have completed tens of millions of testing miles on the public roads but also accumulated a very valuable experience by running the largest robotaxi fleet on urban roads on a daily basis.\n\nThis has provided us with great insight, and we have used these insights to develop auto solutions that best meet our customers' needs. So, for example, ANP 3.0, we believe it is the most advanced intelligent driving solution for city roads on the market. Because ANP 3.0 is derived from our L-4 autonomous driving technology, we were able to use a very limited amount of R&D personnel to make this advanced solution available to the market within a short time. Jidu's first car, Robo-1, will be the first one to use ANP 3.0.\n\nWe believe that with more and more automakers adopting our auto solutions, we will become more experienced in making our solutions compatible with more popular car models. On the other hand, when more and more cars with our auto solutions are on the road, we will be able to grow experience from everyday uses and will continue to improve our auto solutions. As I mentioned earlier, our total projected cumulative sales for Apollo's auto solutions reached 11.4 billion, which is more than 50% from last year. With our current pipeline, some of the major car models that are equipped with ANP, AVP should be launched starting in the second half of next year.\n\nSo, meaningful revenue contributions for this business should begin in 2024, and profit will follow. On the differentiation, if you look at the cost side, as we mentioned many times before, developing advanced intelligent solutions requires massive investment in technology and talent. Frankly speaking, most companies cannot afford this kind of investment. Automakers trust our brand and technology.\n\nSo, a lot of them have been have chosen to partner with Baidu intelligent solutions. For them, we are a trustworthy and reliable supplier because we have made years of investment in intelligent driving technology and we have a strong cash position and our advertising business continue to generate strong cash flow to support our investment. Going forward, this will continue to support the collaboration with many automakers at large scale. That's why more and more leading automakers have recognized us and have brought in partnerships with Baidu.\n\nFor example, in the quarter, we expanded our partnership with one of China's largest auto companies, and they plan to use our ASD solutions for yet another of their popular car model. And the ASD solution they use include ANP, AVP, and HD Maps. Going forward, we are looking forward to more partnerships with OEMs, both domestically and internationally. Thank you, Gary.\n\nOperator\n\nThe next question comes from Kenneth Fong with Credit Suisse. Please go ahead.\n\nKenneth Fong -- Credit Suisse -- Analyst\n\nHi. Good evening, management. Congrats on the solid quarter and thanks for taking my question. I have a follow-up question about Apollo Go.\n\nOn a fully autonomous driving, what kind of progress will be seen in the near term? Could management also talk about a key milestone that Apollo Go will achieve in 2023 and even in the longer term? And to achieve this milestone, how should we think about the impact on your P&L, as well as cash flow? And where should we expect Apollo Go business to achieve breakeven? Thank you.\n\nZhenyu Li -- Senior Vice President and General Manager of Intelligent Driving Group\n\nThanks for your question. This is Zhenyu. We are making progress for the program. We have a package that'll providing a fully driverless ride-hailing suite for the public.\n\nWe believe Apollo Go is the largest autonomous ride-sharing service provider in the world, because, number one, when we look at the numbers back on the Quarter 3, Apollo Go has provided 1.4 million rides for the public. In Beijing, Shanghai, and Guangzhou, each car completes 15 rides per day. We are also providing fully driverless ride-haling service to public in Wuhan and Chongqing. And the number of rides provided at fully driverless car is growing very fast.\n\nAnd number two, Apollo Go is already in more than 10 cities in China and also cities that have populations of more than 10 million. [Inaudible] mentioned in his script. Beginning of operation of us in between [Inaudible] and safety. Take, for example, self-driving [Inaudible] improvement.\n\nI will share some examples of how to help get our operation out to improve the user experience. In operation, we've got a lot of feedback from passengers. For example, passengers one-half, A [Inaudible] customer to moderate. B, to pick them up faster.\n\nAnd the two [Inaudible] all rules can be formed. We've seen the plan and the improvement of them for quality. Our efforts help us to gain more recognition from passengers. Today, in Yizhuang, Beijing, Apollo Go is already the positive rate for early computing.\n\nAfter trying Apollo Go, people come to realize that it is a reliable and that it's [Inaudible] customizable professional driver. Some people may wonder why the Apollo Go can be faster than human drivers. Its operation is always in compliance with the traffic regulation and the AI driver never get tired or distracted like human drivers. All of those allow Apollo Go to provide the various people drive to the public.\n\n[Inaudible] around safety has helped us to entrust both from commuter and also from regulators. We mentioned before that in Wuhan and in Chongqing, we will also provide fully driverless ride-haling service this August. So, operation in both cities is well on track. Going forward, we plan to continue to expand the operation app and is already also there and the more fully driverless vehicles.\n\nIn 2023 and beyond, we will continue to scale up our operation. In particular, fully driverless ride-hailing operation in more region and the reduce hardware and vehicle cost. We believe with all the testing, we'll eventually be profitable and cheaper than the current ride-hailing service. We will continue to invest in robotaxi to capture the huge amount of opportunity.\n\nRong Luo -- Chief Financial Officer\n\nHi, Kenneth. This is Julius. Regarding your question about the impact on our P&L and cash flow, we believe the overriding price is actually manageable. And as Robin was saying in the script, actually, our team today has built a very comprehensive financial model for Apollo Go.\n\nThis model actually help us to understand what should we do, where -- which to improve or adjust to generate profit in this models in the future. For example, today, we are working very hard toward two goals. Number one is we aim to remove safety officers in the cars, as labor costs is where we should reduce and may kind of what new ways. Number two, we continue to reduce the hardware costs.\n\nDuring the past quarters, we continue to improve our L-4 autonomous driving technology. And just now, both Zhenyu and Robin has kept saying examples how we do that, how we leverage the a large-scale operation to improve technology. These efforts help us to earn trust and build track records. Today, we are providing fully driverless ride-hailing services in Wuhan and Chongqing, meaning no safety officers in the cars at all.\n\nIn Beijing, we're also making good progress as the safety officers today are now allowed to -- not to sit behind a steering wheel and maybe even the front seats, which will help us to remove the safety officers in more cities and reduce the labor costs in the future. On the other hand, for the hardware perspective, most of the newly added car in the coming 12 months will be RT5, the model of Apollo Go. This means there will be some investments in hardware next year. Once a sizable amount of RT6, which has just launched a few months ago, put in operation in the year 2024, our unit economy will significantly improve because RT6 has much lower production costs than any previous generations of robotaxis.\n\nThe unit economy in our operations in key cities is also improving because we continue to scale and improve the all the costs and the cost efficiencies. Robin has mentioned our rides continue to grow in the past few quarters. And also, each car now provide 15 rides every day in some Tier 1 cities. Apollo Go today is becoming a -- recognized as a reliable and efficient way for daily commute.\n\nOverall, Apollo Go our measures be -- we aim to achieve the unit economy in key cities before we expand to more cities. I think, just as a summary, all of this impact to our cash flow and the P&L is manageable, and we have lot patience. Thank you.\n\nKenneth Fong -- Credit Suisse -- Analyst\n\nThank you. Very clear.\n\nOperator\n\nThe next question comes from Lincoln Kong with Goldman Sachs. Please go ahead.\n\nLincoln Kong -- Goldman Sachs -- Analyst\n\nThank you, management. I want to ask about our sales of our advanced chips to China because we have seen recently a lot of press report around U.S. chip restriction against China. So, we wonder how you are seeing these restrictions impacting your ability to grow the business by AI Cloud, the autonomous driving, and lastly, wider our AI business.\n\nCould you also remind us our business that the most depending on advanced large AI chips and if there's any way we'll be able to manage this with domestic capability?\n\nDou Shen -- Executive Vice President and Head of AI Cloud Group\n\nThank you, Lincoln. Thank you. You're right. This is a hot topic recently, actually.\n\nSo, the short answer to your question is that, you know, we think the impact is quite limited in the near future. You know, here are the reasons. So, first of all, you know, as of today, a large portion of our AI Cloud business and even wider AI business does not rely too much on the highly advanced chips. And secondly, you know, for the part of our businesses that need advanced chips, we have already stocked enough in hand, actually, to support our business in the near term.\n\nCertainly, there was some alternative to the restricted chips. And we have the technologies to use these alternatives to achieve or most of the same effectiveness and efficiency in our AI Cloud and wider AI businesses. Last but not least, automotive chips are not on the prohibited list. So, this means that in the near future, in-vehicle computing is not affected.\n\nSo, when we look at it at a mid to a longer term, we actually have our own developed AI chip, so named Kunlun. Actually, we already started to use Kunlun chip to support some large-scale AI-computing tasks internally. We also use Kunlun to serve external customers already. So, because we have full stack of AI capabilities from chips to AI frameworks to foundation models and then to application software, so we can achieve much higher efficiency as we optimize the AI tasks from end to end.\n\nSo, let me give you some examples. By using our Kunlun chips [Inaudible] in large language models, the efficiency to perform text and image recognition tasks on our AI platform has been improved by 40% and the total cost has been reduced by 20% to 30%. There are more cases like this in quality inspection in our smart manufacturing projects and image recognition in the smart city products and so forth. So, as our business grows, we believe our end-to-end capabilities will gain us even stronger competitive advantages.\n\nFor the core chips, so we expect to see more auto parts, including core chips, to be manufactured in China in the future. So, as China's intelligent driving market continues to develop rapidly. So, this means that supply chain in auto industry may become more and more independent and less rely on the imports. So, once again, I want to emphasize that Baidu has built a very strong R&D team.\n\nWe keep introducing cutting-edge technologies to the market. And we have users and customers to use these technologies to improve efficiency. So, that's why we believe we can leverage our strong AI capabilities and algorithms to support the top-level computing, even though we faced some turbulence in the semiconductor supply change. So, to sum up, chips sales restriction should have a limited impact on our business operations in the near term.\n\nInstead, we think it creates some good market opportunities for the Chinese chip companies. And our Kunlun AI chips and our AI business will eventually benefit from these opportunities.\n\nLincoln Kong -- Goldman Sachs -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nThe last question today comes from James Lee with Mizuho. Please go ahead.\n\nJames Lee -- Mizuho Securities -- Analyst\n\nGreat. Thanks for taking my questions. I have two here. First, can you guys provide some more color on your progress of e-commerce search and short video opportunities? Can you guys talk about maybe from a consumer, merchants, and creators point of view, what kind of pain point are you trying to resolve here? And second, can you talk about the traction that you have made in open mobile ecosystem and potential monetization opportunities here? Thanks.\n\nRobin Li -- Co-Founder and Chief Executive Officer\n\nHi. Yeah, this is Robin. I mentioned earlier that we have been building closed-loop experience for our users and advertisers in our mobile ecosystem, especially in Baidu App. For e-commerce, because of the efforts we made in the past, users now come to Baidu not only for information knowledge but also for services and merchandise.\n\nSince the beginning of this year, merchandise-related search queries on Baidu have grown much faster than last year. You may be wondering why. It is because users increasingly find out that on our platform, they can now find detailed product information, product reviews, and even buy the product without leaving our app. Now, we have a huge number of SKUs available for search on our platform.\n\nWe have also deepened the partnership with a leading e-commerce platform so that users can easily buy products they need here on the Baidu App. Just like I said in my prepared remarks, in Q3, GMV facilitated by search continued to grow very fast. I also mentioned earlier that retail has been an outperforming vertical for our online app and for quite a few quarters. Even very recently, revenues from the retail vertical during the double 11 e-commerce promotional event grow by double digit from last year.\n\nAnd this all proves that our efforts are gradually bearing fruit. As for short video, we're making short videos increasingly available in our feed and search services. For feed, short video distribution and time spent continue to grow steadily. Right now, about 85% of the feed distributed by Baidu App are short videos.\n\nAnd for search, more than 20% of the clicks on the search result pages were short videos. This number increased by more than 80% year on year during the month of September. So, we believe that the popularity and adoption of video in our search results will ramp up quickly. When we talk about monetization, short videos, especially short videos that provide a fully immersive video experience, can be much better monetized than text and images.\n\nFor example, in feed, ECM -- eCPM for fully immersive video app are much higher than text and images. This is one key reason for feed revenue to show positive growth year over year and this quarter, even though the macroeconomic was unfavorable. This progress in feed has made us quite confident that short videos will also benefit our search revenue later on. Now, we're also trying to use AI-generated content to enrich our short video portfolio.\n\nWe're still at the very early stage for this. We believe with AI, we will generate a large number of short videos in a faster and more cost-effective way. To sum up, e-commerce and short videos are two areas that could drive incremental revenue growth for us, and we will continue to work hard on that. Meanwhile, we would like to stress that profit growth remains a top priority for our mobile ecosystem.\n\nAs for interoperability, we believe it is a long-term trend. As we talked about it before, being a search engine, we benefit from more content becoming searchable on the internet. Looking into the longer term, we believe the government's willingness to build an open mobile internet industry remains unchanged because it benefits the users and the SMEs. And for us, Baidu is getting ourselves ready for that trend.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJuan Lin -- Director, Investor Relations\n\nRobin Li -- Co-Founder and Chief Executive Officer\n\nRong Luo -- Chief Financial Officer\n\nAlicia Yap -- Citi -- Analyst\n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\nDou Shen -- Executive Vice President and Head of AI Cloud Group\n\nAlex Yao -- JPMorgan Chase and Company -- Analyst\n\nGary Yu -- Morgan Stanley -- Analyst\n\nKenneth Fong -- Credit Suisse -- Analyst\n\nZhenyu Li -- Senior Vice President and General Manager of Intelligent Driving Group\n\nLincoln Kong -- Goldman Sachs -- Analyst\n\nJames Lee -- Mizuho Securities -- Analyst\n\nMore BIDU analysis\n\nAll earnings call transcripts"
}