{
  "companyName": "Alteryx",
  "companyTicker": "AYX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/alteryx-ayx-q3-2022-earnings-call-transcript/",
  "content": "Alteryx (AYX 0.28%)\nQ3 2022 Earnings Call\nNov 01, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Alteryx third quarter 2022 earnings conference call. [Operator instructions]. Please note that this event is being recorded. I'd now like to turn the conference over to Mr.\n\nRyan Goodman, the head of investor relations. Please go ahead.\n\nRyan Goodman -- Head of Investor Relations\n\nThank you, operator. Good afternoon, and thank you for joining us today for Alteryx's third quarter 2022 earnings conference call. I'm Ryan Goodman, Alteryx's head of investor relations. With me on the call today are Mark Anderson, chief executive officer; and Kevin Rubin, chief financial officer.\n\nAdditionally, Paula Hansen, our president and chief revenue officer; and Suresh Vital, our chief product officer, will be joining us for the question-and-answer session after prepared remarks. This afternoon, we issued a press release announcing our results for the third quarter ended September 30, 2020. If you would like a copy of the release, you can access it online on our investor relations website. During this call, we will make forward-looking statements related to our business, including statements about our financial guidance for the fourth quarter and full year 2022.\n\nThese statements are not guarantees of future performance. They are subject to a variety of risks and uncertainties, some of which are beyond our control. Our actual results could differ materially from expectations reflected in any forward-looking statement. For a discussion of additional forward-looking statements made during this call and the material risks and other important factors that could affect our actual results, please refer to our SEC filings available on the SEC's website and investor relations website as well as the risks and other important factors discussed in today's earnings release.\n\nAdditionally, non-GAAP financial metrics will be discussed on today's call. A reconciliation of these measures to their most directly comparable GAAP financial measures can be found in today's earnings release. With that, I'd like to turn the call over to chief executive officer, Mark Anderson.\n\nMark Anderson -- Chief Executive Officer\n\nThank you, Ryan, and thank you all for joining us on the call today. We continue to execute at a high level in Q3 and are seeing more and more companies embrace data analytics across their organizations. Our Q3 revenue of $216 million, up 75% year-over-year, came in above our guided range. This drove a non-GAAP operating profit also leading guidance.\n\nOur annual recurring revenue, or ARR, came in at $758 million, up 31% year-over-year. Like many global businesses, we saw a meaningful currency headwind in Q3. Normalizing for this $12 million impact, ARR would have been handily above our guided range and up 33% year-over-year. We are tracking well across our key performance metrics.\n\nSales productivity continued to improve year-over-year, renewal rates held near multiyear highs, and our net expansion rate improved for the second straight quarter to 121%. Our value-based go-to-market motion continues to resonate in this market environment, and our results demonstrate the strong execution across a meaningfully up-leveled sales force. In fact, we closed our largest new logo ACV deal ever in Q3. We are pleased with our Q3 results.\n\nWhile we are mindful of the macroeconomic dynamics and challenges facing many companies, we are fortunate to see data analytics continue to be a top-budget priority. Companies are pushing ahead with multiyear digital transformation projects to improve decision intelligence and decision automation. Every business and government need to run a tighter ship, predict how inflation will affect their environments, and make better data-driven decisions faster.  A recent IDC survey indicated that over 70% of organizations plan to spend more on analytics than other software investments in the next 12 to 18 months. And it's not just about buying additional tools, it's about empowering knowledge workers with data analytic capabilities.\n\nThe study found that enterprises have deployed solutions in less than half of the departments that actually need them, and less than half of nearly all respondents' knowledge workers are actively using any analytics software. These companies need a platform that enables them to empower business users across the organization to incorporate data analytics into everything that they do. This is what we refer to as democratization of analytics.  We are humbled to find ourselves in a unique position to help our customers embrace data analytics. We also take great pride in the fact that our favorable market position today is the result of the strategic initiatives we've put in place over the past two years.\n\nWe've established a forward-looking Alteryx analytics cloud platform innovation roadmap. We've designed our go-to-market to better deliver value to our customers. We've updated our partner program and expanded our partner ecosystem, and we've invested in our customer success organization to help customers achieve desired business outcomes.  We take nothing for granted. We are fully aware of the economic environment out there, and we are effectively executing through an elevated level of deal scrutiny as customers demonstrate greater spending discipline.\n\nI'm so proud of the team for their commitment to these initiatives that have enabled us to deliver another strong quarter. Let me share a few highlights from the quarter. We hosted our Inspire EMEA user conference in Amsterdam last month with over 1,300 attendees from nearly 30 countries. I was there and witnessed the incredible energy and excitement in the general sessions, workshops, training and so much more.\n\nTo me, this demonstrates how data analytics is happening in these times and on a global scale. Our Global 2000 penetration increased to 46%, up seven points from this time last year as top brands across the globe are aligning with Alteryx on their digital transformation journeys. We won two $1 million-plus deals that deeply incorporate Alteryx analytics cloud, one of which leveraged our new cloud ELA bundle. Club momentum is picking up with multiple wins for use cases across the Alteryx analytics cloud platform.\n\nWe achieved a major milestone on the cloud innovation roadmap with Alteryx machine learning now being integrated on the Alteryx analytics cloud platform. And finally, we further scaled our governance capabilities with a new version of server aligned with Federal Information Processing Standards or FIPS. Our strong execution, rapid innovation, and all of our successes ultimately come back to our people. I'm pleased to share that our employee retention rate remains at a multiyear high. We are executing well across all of our key strategic initiatives.\n\nWe are particularly excited about early successes in cloud. As we gain traction with larger enterprise customers, the Alteryx analytics cloud platform is unlocking incremental opportunities for us with more personas and new use cases. We won two seven-figure deals during the quarter with a significant cloud element, one of which was with a Fortune 100 auto manufacturer. This multiyear Alteryx customer not only meaningfully expanded its designer and server license count but also signed on for several thousand designer cloud licenses to enable cloud-native access to data in Google BigQuery.\n\nIn addition, by leveraging a cloud ELA, this customer can engage with machine learning and auto insights as they move forward with cloud transformation. We had another significant cloud win with a global management consulting firm. This company leverages Alteryx designer to empower its consultants in their work with their customers as well as in its own back-office operations. In Q3, they significantly expanded their multi-thousand-user license agreement with more designer seats as well as cloud.\n\nDesigner cloud will provide this customer with greater flexibility and agility in expanding their usage of Alteryx in coming years.  And the list goes on. Genomics England, a U.K.-based healthcare organization that was already using Trifacta, adopted a cloud ELA to expand usage of designer cloud and explore potential use cases with machine learning and auto insights. A leading entertainment and media company adopted auto insights to optimize contact center operations and a very well-known social media company adopted auto insights to enhance analytics on tax data. The early momentum is great to see.\n\nAnd it's a reflection of the platform innovation, market demand, sales execution, and value that customers find in our solutions. On that note, with Alteryx machine learning now available on the Alteryx analytics cloud platform, we are accelerating our multi-tenant, multi-cloud architecture. This was a key strategic driver for the Trifacta acquisition earlier this year, and we're excited to achieve milestone after milestone. New innovation is resonating within our community.\n\nSuresh highlighted several newer offerings at Inspire EMEA, including metric store, app builder, and location intelligence. We are seeing positive early feedback and expect all of these to be available next year as part of our cloud platform.  As for our flagship solutions, governance continues to be a key focus for us. As I mentioned earlier, following our Q2 launch of designer FIPS, we introduced server-FIPS in Q3. This expands on our commitment to best-in-class governance capabilities and enhances our ability to win new opportunities in the public sector.\n\nWe have the most comprehensive, differentiated platform of solutions in the company's history, and the timing could not be better as our increasing traction with larger organizations is creating a broad range of incremental opportunities. To that end, we secured approximately $51 million-plus ACV wins over the last 12 months, bringing us now to over $101 million-plus customers. Our executive-level sales approach is driving more productive engagement with our customers and validating that data analytics is a current spending priority.  Our customer success initiatives, such as delivery of hundreds of use cases and solution blueprints, are driving scalable and repeatable outcomes in which customers can deliver higher ROI. And our ELA construct is garnering favorable customer response as evidenced by roughly doubling our ELA business year-over-year in Q3.\n\nAdditionally, we saw customers with first capacity renew and upsell to a higher ELA tier. This gives us confidence that our 2022 ELA success will offer more predictable and actionable upsell opportunities in 2023 and beyond.  A great example that demonstrates how all these initiatives come together was a Q3 win with one of the largest U.S.-based airlines. This customer was one of our first ELA wins last year. Our customer success team engaged with the regular cadence of enablement programs exploring incremental opportunities to deploy data analytics across the enterprise.\n\nThis simply would not have been possible with the sales motion focused on a single line of business. We found new unique opportunities to create value, such as the optimization of aircraft maintenance schedules and audits on service logistics. After fully exhausting its first capacity earlier this year, this customer signed on for a new ELA in Q3 that was more than double the original capacity, increasing the total ACV to well over $1 million. Our customer success team has done a fantastic job in creating value for our customers and, of course, earning upsell opportunities for Alteryx, and this becomes even more important as we continue to win with large enterprise customers that offer significant long-term expansion opportunities.  We're also seeing strong success with our ability to sign new logo wins.\n\nIn addition to one of our largest new logo wins in the history of the company, we're establishing many new customer relationships with companies as they continue on their digital transformation journey. For example, Okta, a leading independent identity provider adopted, Alteryx designer and server to automate data analytics in both the sales operations and finance organizations. One of the largest food and drug retailers in the United States adopted Alteryx designer to run geospatial analysis and enhance their store placement decision process. I'd also like to take a moment to highlight our growing partner ecosystem.\n\nThis has been a huge focus for Alteryx over the past year as we see partners as a means to both efficiently scale our go-to-market reach as well as enhance our customer success efforts. Since updating the partner program earlier this year, we are seeing positive trends with partners influencing over half of the new ACV wins in Q3. We continue to expand our ecosystem with new partnerships and increased partner engagement momentum. We had a great partner win at Truist, a top 10 U.S. commercial bank.\n\nWe leveraged our partnership with Thomson Reuters to help engage closely with the customer through a steady cadence of workshops and training sessions. This allowed us to identify a breadth of incremental use cases in finance and tax, ultimately resulting in the customer increasing its license count by approximately 300%. In closing, we are pleased with our execution in Q3. We are appreciative of the favorable position we find ourselves in and are increasingly confident in the strategic direction of this company.\n\nWe are very focused on managing our business to balance the growth opportunity we feel exists in this very important market with the requisite discipline and rigor on spending to optimize profitability in 2023 and beyond. I'd like to thank the entire Alteryx team for their fantastic work. And with that, I'll turn the call over to Kevin for a closer look at the financials. Kevin?\n\nKevin Rubin -- Chief Financial Officer\n\nThanks, Mark. Q3 was a strong financial quarter across the board. Our growing traction with large enterprise customers and our disciplined investment philosophy is evident in our results. ARR of $758 million grew 31% year-over-year.\n\nExcluding a $12 million currency headwind versus what we assumed in our guidance, ARR would have been 33% year-over-year, two points of growth higher and above the high end of our guided range. As a reminder, we provided our Q3 guidance in August. We incorporated exchange rates at the then-current levels. Since then, the British pound declined 9%, the euro declined 4%, and dynamics have been similar with other currencies.\n\nBecause we adjust our entire ARR using end-of-quarter rates with approximately 20% of our ARR denominated in foreign currency, FX can have a meaningful impact on ARR in times of higher volatility, like we saw toward the end of September. Revenue of $216 million grew 75% year-over-year, exceeding the high end of our guided range, benefiting from better-than-expected bookings and robust renewal rates. With the revenue upside in our disciplined spending mindset, the business delivered a non-GAAP operating profit of $5 million, which is $10 million better than the high end of our guided range. Over the past several quarters, we've communicated our intent to increase traction with larger organizations given a higher customer lifetime value.\n\nThis quarter, I hosted our first Alteryx CFO event in New York for dozens of CFOs and senior financial leaders from Global 2000 companies. These financial leaders face the challenge of balancing cost optimization with selective investments in their business. The common theme across these leaders was that upskilling workforces with data analytics and digital transformation initiatives were top priorities to create operational agility and further enabling data-driven decisions to drive long-term ROI and shareholder value. We had a great response to the event, and I look forward to hosting more in the future as we find that democratization of analytics often begins in the office of finance of large companies.\n\nAs part of our strategic enterprise go-to-market motion, we've invested in our sales force, our partner ecosystem, our customer success team, and our product roadmap. We are pleased to see clear evidence in our results that these investments are effectively driving forward this initiative. We are seeing our strongest ARR growth with our $1 million-plus ARR customer cohort with over 10 points of acceleration in growth versus Q3 of last year. Our average deal size saw 30% plus year-over-year growth with both new logo and expansion wins.\n\nOur average ARR per customer continues to see strong sequential and year-over-year growth coming in at 91,000 in Q3. And on the ELA front, we continue to see strong momentum, closing approximately as many ELA deals in Q3 as the entire first half of this year. This positive momentum with large enterprise companies is driving favorable dynamics in our financials. First, as our larger customer cohort has our highest retention rate, we are seeing renewal rates near multiyear highs and up significantly year-over-year.\n\nMoreover, our average ARR per customer is more than four times the average size of customers that churned this quarter. Second, as we are identifying and winning a breadth of opportunities within larger customers, we are seeing sequential improvements in our net expansion rate of 121% and a Global 2000 net expansion rate of 129%. And third, with an expanding portfolio of cloud solutions, we're better equipped than ever to meet the growing demand for data analytics throughout the organization. In fact, more than half of our early cloud ACV bookings was with our $1 million-plus customers.\n\nWe are pleased to see the resilience in the growth dynamics of our business. Moreover, the true earnings power of our financial model is becoming increasingly evident in the numbers. In Q3, we captured over $10 million of upside to our non-GAAP operating profit guidance with approximately 50% of the revenue upside following through to the operating level. Sales force productivity was a key driver to profitability with sales and marketing as a percentage of revenue improving by 10 points versus Q2.\n\nWe benefited from both higher productivity year-over-year and increased number of ramped reps. Looking ahead, we are committed to a disciplined investment philosophy as we strive to unlock further leverage in our model. We're also focused on ensuring our pace of investments is appropriately aligned with the current market dynamics. For example, our high level of employee retention enabled us to temper our hiring in Q3.\n\nAnd with growing ranks of fully ramped reps and improved productivity, we expect to further moderate hiring in coming quarters. In addition, with an increasingly distributed workforce, we are evaluating and implementing the future of work at Alteryx and plan to execute a real estate rationalization initiative in Q4. In summary, we are pleased with the Q3 results in which we demonstrated durable, profitable growth driven by strong execution and saw continued evidence that data and analytics remain a top-spend priority for business leaders across the globe. In addition, we are confident in the incremental growth drivers ahead in 2023.\n\nFirst, we expect to have a meaningfully larger renewal base relative to 2022, which consists of both 2020 three-year renewals and the increasing cohort of one-year renewals. Second, we have a growing book of ELAs with burst capacity, creating upsell opportunities for large enterprise customers with high visibility in coming quarters. Third, we have a growing international presence with significant opportunity to further expand. Fourth, we have an expanding ecosystem of partners to accelerate our global market reach.\n\nAnd last but not least, we have our Alteryx analytics cloud, which we expect will continue to build momentum and increasingly become more meaningful to the financials next year and beyond. And with the strategic investments we've made in recent years, coupled with our disciplined operational rigor, the business is well-aligned to demonstrate improving profitability.  As for the Q4 2022 outlook, we expect ARR to be in the range of $820 million to $825 million, representing year-over-year growth of 29%. Keep in mind, we experienced a $12 million FX headwind to Q3 that I mentioned earlier. And excluding this headwind, we beat Q3 by $7 million.\n\nSo this guidance reflects a $2 million-plus raised versus our prior implied Q4 outlook. Our guidance assumes FX rates remain at current levels. We've provided additional color in the Q3 earnings deck available on our investor relations website. We expect GAAP revenue to be in the range of $276 million to $281 million, representing year-over-year growth of 59% to 62%.\n\nThis also assumes FX rates at current levels and assumes no material change in contract duration. We expect our non-GAAP operating profit to be in the range of $50 million to $55 million, and we expect a non-GAAP net profit per share to be in the range of $0.48 to $0.53. This assumes 76.7 million weighted average shares outstanding and an effective tax rate of 20%. For the full year of 2022, we are increasing our GAAP revenue range to $830 million to $835 million, representing year-over-year growth of 55% to 56%.\n\nThis is up from the prior growth range of 44% to 45%. We expect non-GAAP operating profit to be negative $5 million to break even, an improvement from our prior outlook for a loss of $30 million to $20 million. Finally, we expect non-GAAP loss per share to be in the range of $0.37 to $0.32, an improvement from the prior outlook of $0.56 to $0.46. This assumes 68.5 million basic shares outstanding and an effective tax rate of 20%.\n\nIn closing, Q3 was a great quarter. The durable growth trends continue to validate the go-to-market and innovation investments we've made over the past couple of years, and our disciplined approach to spending is increasingly apparent in our improving profitability. While we are certainly mindful of the macro environment and proceeding with a high level of rigor, we are confident in our ability to close out the year with strong momentum, and we believe we are well on our way to becoming a $1 billion-plus ARR company. With that, thank you all for joining us today, and I'll turn the call back to the operator.\n\nOperator\n\nThank you very much. [Operator instructions]. The first question comes from Derrick Wood from Cowen. Please proceed with your question, Derrick.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nThat's on a solid quarter, everybody. Maybe just to kind of start with the -- just to kind of drill down on the macro a little bit. I mean have you seen much change in sales cycle or buying behavior out there when you look across geographies or verticals? What's the tone of demand and budget priority for analytics? And I guess just how are you feeling about your sales force's ability to navigate some of the macro dynamics, particularly as you enter the very big Q4?\n\nMark Anderson -- Chief Executive Officer\n\nDerrick, it's Mark here. Thanks for the question. Yes, listen, I've been traveling nonstop for the last six, seven months with hundreds of customers, and I would say that the demand for data analytics is quite high. It's still a massive spending priority for the people I talked to.\n\nAlmost every meeting I have, customers are asking for help because it's such a fragmented market. And I'm really, really thankful, frankly, that we made the changes that we did in the go-to-market to really move from a bottoms-up motion to a top-down motion because that gives us visibility to the kind of the CFO level spending priorities that allows us to do a better job forecasting. We saw a small number of deals, get additional stages added into the cycle, but we were able to obviously close out a really good solid quarter and I think give a pretty solid print. And I don't think our sales team has been more ready than it is today.\n\nWe've got a lot of people that are moving from ramping to ramp and really excited about the quarter ahead in FY '23.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nGreat. Well done. Thank you.\n\nMark Anderson -- Chief Executive Officer\n\nYes. Thanks, Derrick.\n\nOperator\n\nThank you. The next question comes from Joel Fishbein from Truist Securities. Please proceed with your question, Joel.\n\nJoel Fishbein -- Truist Securities -- Analyst\n\nCongrats on the strong execution. I -- question for you. Was there any early renewals from Q3 that renewed in 3Q -- from 4Q to 3Q? And also, I know you're not guiding to 23%, but can you provide any color on how we should be thinking about seasonal trends next year? Clearly, the business has some seasonality this year, but there are dynamics around revenue rec that impacted sequential growth in 1Q. Any thoughts there would be really helpful.\n\nThank you.\n\nMark Anderson -- Chief Executive Officer\n\nYes, Joel, thanks for that question, and thanks for the well wishes as well. Listen, I think in any quarter, you get some customers that want to do a deal early and some that ask for a little more time, frankly. And this quarter was no different than any other quarter we've seen. I'll tell you, though, we know well in advance that -- when a renewal is coming.\n\nAnd as we talked about over the last three or four quarters, we had a large cohort of 2018 and 2019 three-year renewals coming in this full four-quarter period. And we've been tracking those, especially the large account ones, and working on plans to not only get the renewal but earn the permission to do a lot more, either sell to more personas or sell more seats or ideally both. And so Paula has just done a great job prepping the team and, frankly, bringing on people that can lead and drive that motion.\n\nPaula Hansen -- President and Chief Revenue Officer\n\nYes. And, Joel, I'll just add a little bit on to that in terms of the ongoing opportunity as it relates to expanding with our customers through our renewal programs as well as through our enterprise license agreements. So we see that as being an ongoing and healthy opportunity for us as we go into 2023. If you look at the enterprise license agreements that we've put in place, that gives us great visibility into consumption and utilization and gives the sales team a chance to go back and move them up to the next tier of the enterprise license agreement or expand across the balance of the portfolio.\n\nSo this is a motion that we were committed to that is in place and healthy and will continue to be an engine for growth for us into the future.\n\nMark Anderson -- Chief Executive Officer\n\nYes. And in the prepared comments also, Joel, we referenced the burst ability in our ELAs that is really a tell to how strong the renewal opportunity can be for next year. And so when we give next year's guidance on our Q4 earnings call, you'll see what we see there as well, but I think we're in a really good spot.\n\nKevin Rubin -- Chief Financial Officer\n\nYes, Joel, let me comment on your linearity question, and I appreciate the question. So as you alluded to, I obviously can't give any guidance on 2023 yet. But as you guys think about your models, just a few things to keep in mind. So in terms of revenue, we tend to see 40% the first half, 60% the back half.\n\nAnd I think that's what you're seeing play out again this year, and so I would think about that distribution as you guys are looking at linearity. We also see a pretty significant decline in Q1 relative to Q4 for the obvious reasons. So thinking about back half of the year, I think, would be helpful. If you actually looked at Q1 of '20 relative to '21, it was about a 30% sequential decline.\n\nSo that should help, I think, guide you directionally as you think about your '23 linearity. In terms of operating profit, as you're seeing this year, we tend to get most of the profit toward the back end of the year, so I wouldn't expect anything different there. And then maybe lastly on ARR, just keep in mind that Q1 of '23 will be the first quarter that we lap the addition of Trifacta, so think about that in your net new ARR growth assumptions as well. So anyway, I appreciate the question, and thanks again for participating.\n\nJoel Fishbein -- Truist Securities -- Analyst\n\nThanks.\n\nOperator\n\nThank you. The next question comes from Brent Bracelin from Piper Sandler. Please proceed with your question, Brent.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nThank you. Good afternoon. I guess, Mark or Paula, there's no doubt we're seeing increasing levels of scrutiny across the broader enterprise. My question for you is, what's resonating the most with customers that's helping drive the continued momentum in ARR? Is it workflow automation just being a feature -- must-have feature right now? Is it just the broader analytics category? Is it ELA pricing and packaging and burst stability that's really resonating? Any color to help us explain the strength that you're seeing in the business today given it is a challenging backdrop.\n\nThanks.\n\nMark Anderson -- Chief Executive Officer\n\nYes. You bet, Brent. Listen, the customers that I speak to every day, they want to be able to make better decisions faster. And to do that, they need -- they realize they need to really garner the totality of the data that swirls around the enterprise to be able to do so.\n\nAnd so -- and frankly, so many of them are still very, very early in this journey. And what I think we have going for us is we've made what I think is the hardest part of the journey getting going easy. It's relatively easy to upskill your people a couple of weeks of training and they can start building automated workflows, to your point, to be able to turn around manual processes. And that is a big leap.\n\nI think people are understandably freaked out, coming out of a pandemic, seeing the nightmare if they're in manufacturing of the supply chain in the last year, and trying to deal with inflation and the potential impact of a recession. People need to see around corners more now than ever before, and we help them do that. And we -- our entire sales motion is built around use cases and examples of how we can deliver specific business outcomes, not just sling in licenses.\n\nPaula Hansen -- President and Chief Revenue Officer\n\nYes. And I would add, Brent, to the market opportunity that Mark just explained very, very well, and I hear in all of the conversations that I have. I was traveling a lot in Q3. It was in eight countries outside of the U.S.\n\njust in Q3 alone that, that market opportunity is real because of all the reasons that he cited. And then I would just add to it that what we've been building for the last two years now on the go-to-market side has been about a value-based go-to-market, which really resonates in times where there's extra scrutiny. So our sales team is able to show up with comprehensive use cases and blueprints, return on investment models, clear operating models for customers that want to scale quickly so they can see the return on the investment quickly. So all of the work that we've done over the last two years in the go-to-market to focus on value, value with and through partners, value with and through our customer success team, is certainly helping us manage those extra scrutiny conversations with customers.\n\nMark Anderson -- Chief Executive Officer\n\nYes. And then the specifics that we've rolled out, especially in the last quarter, Brent, around our platform in the cloud really -- is really resonating with people because they do want to be able to provide more people access with less friction, right? And we want to appeal to those personas, and that's really given us a little extra wind behind our sales with our cloud products in Q3.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nSuper helpful color here, and thanks for the color, and great to see the momentum in the business. Thank you.\n\nMark Anderson -- Chief Executive Officer\n\nThanks, Brent.\n\nOperator\n\nThank you. The next question comes from Tyler Radke from Citi. Please proceed with your question, Tyler.\n\nTyler Radke -- Citi -- Analyst\n\nThanks for taking the question. Kevin, I wanted to ask you just about cash flow. So it was down quite a bit relative to a year ago. And certainly, if we look at the last nine months, it's below where it was for the last nine months.\n\nSo could you just help us understand what's driving that? And should we think about next year as being a cash flow-positive year? It sounded like there's kind of some incremental expense efficiencies that you're targeting between the real estate footprint reduction and some other factors. But just talk us through the factors behind this year and how you kind of see that trajectory toward your targets that you laid out at the analyst day. Thank you.\n\nKevin Rubin -- Chief Financial Officer\n\nYes. Thanks, Tyler. Appreciate the question. So just a few comments in that regard.\n\nFirst of all, we've talked for a number of quarters now about the investments that we've made in go-to-market and product in particular. And if you think about just the cadence of hiring, a lot of those hires came early in the year. And so Q3 is going to be the first real full quarter that we have that employee base on board, and so that's going to burn a little bit more cash. We also had a meaningful portion attributable to the semi-annual bonus payout, that we introduced this year.\n\nAnd then when you just think about seasonality as we go through the year, we tend to have the strongest collections in Q1, which are collecting off of the prior Q4. So that should just give you a little bit of a sense of how we think about operating cash flow for this year. I can't comment with respect to operating cash flow in 2023. We don't guide to that, and we haven't provided guidance for '23.\n\nBut we obviously provided a bunch of commentary around how we think about the expense levels of the business, as you indicated, going forward. So hopefully, that gives you a little more color.\n\nTyler Radke -- Citi -- Analyst\n\nIt does. Thank you.\n\nMark Anderson -- Chief Executive Officer\n\nThanks, Tyler.\n\nOperator\n\nThank you. The next question comes from Sanjit Singh from Morgan Stanley. Please proceed with your question, Sanjit.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nThanks for taking the questions, and executing very well, guys. So very nice to see. I wanted to come back to some comments that Kevin mentioned around 2023 renewal base dynamics. You mentioned, I think, two factors, Kevin: one, the 2020 three-year renewal cycle; and then also the impact of ELAs.\n\nCan you just give us some more color on why we think the renewal base is going to be a tailwind going into next year, given that I think 2020 was -- the middle of the pandemic was a tougher year for the company? To that extent, could you give us a sense of what percentage of the business is now or what percentage of the customer base is on one of your deals? Any color on 2023 renewal base, would be very helpful.\n\nKevin Rubin -- Chief Financial Officer\n\nYes. I appreciate it. I'm not sure what more I can offer then in the prepared remarks as it relates to 2023. As you know, over the last couple of years, we've moved pretty significantly to align pricing and value closer as opposed to pricing and duration.\n\nSo we've seen a bunch of customers both elect to maintain on three years and others move to one year. As we project out and look at our renewal base into 2023, we do expect it to be significantly larger than the renewal base in 2022 for those reasons. Additionally, I guess I would point back to -- during the pandemic, we saw the most significant churn in the highest impacted verticals that we had at that time. And so a lot of those customers had gone through whatever dynamics of their business and adjustments that have had, we've had significant improvement in renewal rates to multiyear highs this year, so we're seeing a significant improvement in that respect.\n\nAnd then just, again, calling back to the commentary that I had with the mix of three-year and one year, we intentionally drove duration through our pricing decisions in 2021 down, and we've seen it stabilize, and it's sitting at about one and a half now. So we're getting a significantly larger number of one-year deals proportionate to what we had seen in the past.\n\nPaula Hansen -- President and Chief Revenue Officer\n\nAnd, Sanjit, I'll add on to that relative to ELAs. So obviously, we've been talking for a number of quarters about the opportunity that ELAs present for us to move a customer up and create an expansion opportunity inside the term of the ELA. So while we have one- and three-year ELA contracts, we gave an example in the script about an airline that before they even hit their one-year anniversary, it was an opportunity for us to expand to them to the next tier of ELA. And we're seeing that consistently with our ELA customers that it's reducing friction, it's giving them confidence to expand with us, and it creates opportunity for us inside the term of the ELA to go back for expansion.\n\nAnd last quarter, we did more in Q3 in the ELAs when we did the whole first half, and you can imagine we will be talking about ELAs again at the end of Q4.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nThanks, Paula. Thank you so much for the color.\n\nMark Anderson -- Chief Executive Officer\n\nThanks a lot, Sanjit.\n\nOperator\n\nThank you. The next question comes from Ittai Kidron from Oppenheimer. Please proceed with your question, Ittai.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nThanks. Kevin, I'm trying to tie your answer now to a previous question regarding early renewals. Maybe you can help us reconcile the significant beat on the revenue and the slight miss on the ARR. I understand the FX element, but revenue came well above expectations.\n\nThat usually happens when you have early renewals or you have increasing durations, where you recognize much more upfront. And it doesn't sound like that's the case. So maybe you can kind of explain the gap between the two. And then the second question, I'm trying to figure out -- I mean one of the questions we're getting from investors all the time is, how do I think about the business in the context of your core designer desktop and server business versus all the rest? You've introduced tremendous amount of content over the past year, year and a half year, yet we have no qualification on how that's doing, how is that contributing.\n\nIs there any qualitative data points that you can provide that share some light on the relative adoption of the new solutions you've introduced over the next 12, 18 months? Thank you.\n\nKevin Rubin -- Chief Financial Officer\n\nThanks, Ittai. Let me start with the question about revenue and ARR, and then I'll handed off for the commentary around designer server and cloud. So just for clarification, to Mark and Paula's earlier point, we certainly have customers quarter-to-quarter that would look to early renewal contracts. Early renewals do not create any revenue.\n\nThose -- the revenue attributable to those continue to be recognized in the period the renewal -- excuse me, the period that the renewal expires. So early renewing is really an accommodation to the customer and potentially their budget needs and doesn't contribute to the upside for us. To your point around revenue and ARR, I mean ARR was completely affected by FX. Had it not been for FX, we would have put up a pretty nice beat on ARR.\n\nRevenue has a lesser effect given just the way that FX translation works. So I would attribute the strong revenue growth to strong bookings in the quarter, strong renewal rates, and ARR was affected by FX.\n\nSuresh Vittal -- Chief Product Officer\n\nOn the product question, Ittai, thank you for acknowledging the amount of innovation we've kind of led out this year. Obviously, earlier in the year, we did the Alteryx analyst cloud, which is designer cloud, Alteryx machine learning, and auto insights. We introduced cloud ELA at the end of Q2 to make it easier for our customers to adopt cloud portfolio and the scale. And that's -- we started to see strong traction in Q3 with two of our largest deals include a seven-figure cloud expansion.\n\nSo that's tracking along nicely. We see early wins and momentum with auto insights. It's largely being driven with customers renewing, but also our designer and serve our customers expanding. We did all this in the cloud side while also adding tremendous amount of innovation on to design a desktop.\n\nAnd so where Mark kind of talked about the FIPS release and all the work we did there, that gives us the opportunity to address the customer as the public sector needs. All this machine learning, we continue to see real interest in the product, particularly as teams start to upskill their analysts on machine learning and AI capabilities. So the platform vision, Ittai, is really resonating with our customers. The cloud offering, as Mark talked about this earlier, is going to create -- we are creating a building a platform for everybody, for all our products to serve every persona, the IT teams as they think about their data engineering needs, business analysts as they think about upskilling and going beyond designer and server for business users to get access to insights very readily without having to rely on dashboards to auto insights.\n\nSo it's really resonating with a variety of personas, and this is the kind of innovation you should expect to see from us as we keep rolling out our cloud products.\n\nPaula Hansen -- President and Chief Revenue Officer\n\nAnd we referenced the $2 million-plus cloud wins in this quarter with our largest customer. So that innovation that Suresh and team have built unlocks opportunity and pretty nice tranches with our customers because they are personas that we've not historically been able to address. So we're really excited as a sales organization to have that in our bag as we're partnering with our customers on their analytics journey.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nThank you.\n\nMark Anderson -- Chief Executive Officer\n\nThanks a lot, Ittai.\n\nOperator\n\nThe next question comes from Mike Cikos from Needham. Please proceed with your question, Mike.\n\nMike Cikos -- Needham and Company -- Analyst\n\nThanks for taking the question. I appreciate the commentary on the disclosure, specifically around the FX for ARR. Pretty impressive to see the beat here, especially when thinking about some of the macro volatility we've all been hunkered down and thinking about with respect to the broader market. A two-parter, if I could, though.\n\nFirst, again, I appreciate you calling out that FX headwind to ARR for Q3. Can you specifically quantify the FX rates you're assuming when thinking about Q4 with respect to the pound and the euro? And then the second question I have for you. Again, I appreciate the broad-brush strokes for the growth levers when thinking about calendar '23. But can you discuss maybe the percentage of your ELA customers today that are currently utilizing that first capacity? And what that up-tiering dynamic has been like thus far? I know we're calling out those two, I guess, seven-figure deals, but just curious what you've seen in the broader customer base to provide some more context there.\n\nThank you.\n\nKevin Rubin -- Chief Financial Officer\n\nYes. Thanks. Let me hit the guidance one quickly, and then I'll hand off to Paula. So with respect to FX in the current guidance for Q4 and the full Q4, we are assuming rates as they are today across our major currencies.\n\nSo there's obviously a variety of them, but we're looking at current rates for that portion similar to what you saw in Q3.\n\nPaula Hansen -- President and Chief Revenue Officer\n\nAnd then from a burst capacity within our ELAs, we see really high utilization of the base licensing, and then roughly 40% of our customers are already utilizing burst capacity. And we're four quarters into this now. So every quarter, we see accretive customers moving into the burst.\n\nMark Anderson -- Chief Executive Officer\n\nAnd that always gives us a little bit extra visibility into what the renewal opportunity could be as we're really motivating and incentivizing customers to go faster. And in times like these, I think most of the customers we talk to, they want to do more and they want to be able to have better visibility in CRM corners.\n\nMike Cikos -- Needham and Company -- Analyst\n\nPerfect. Thank you again for the color, guys.\n\nMark Anderson -- Chief Executive Officer\n\nYes. Thanks a lot, Mike.\n\nOperator\n\nThank you. The next question comes from Kamil Mielczarek from William Blair. Please proceed with your question, Kamil.\n\nKamil Mielczarek -- William Blair -- Analyst\n\nHey, everyone. Congrats on the strong quarter. I just want to double-click on some of the macro commentary. So net new customer adds have come down over the past three quarters.\n\nI realize that this is largely driven by a shift in focus to larger, more strategic customers. However, is there any noticeable macro impact on metric? Are there any geographies or industries where you saw an outside slowdown in demand? And can you update us on how customer churn trended through the quarter? Thank you.\n\nPaula Hansen -- President and Chief Revenue Officer\n\nYes. Thank you, Kamil. So on the net new logo, we've consistently talked about the strategy being focused on quality of ads of customer logos versus quantity. We see the opportunity in the Global 2000 to be the most significant, whether it's expansion within the existing customers that we have in Global 2000 or net new customers in the Global 2000.\n\nSo there's nothing about Q3 in terms of net new logos that was unique to Q3 or linked to anything at a macroeconomic level. I will make a comment about our international business because I think that's implied in there as well. That is a big focus for us has been we put two new leaders in place quarter and a half ago in both EMEA and APJ. Really pleased with their leadership.\n\nAnd we saw in Q3 growth in both new logo ACV as well as expansion in our international business. So we did not see material impact from a macro perspective there, and we're starting Q4 with a solid pipeline, and that's part of our business as well from a year-on-year perspective.\n\nMark Anderson -- Chief Executive Officer\n\nYes. And Kamil, regarding customer churn, nothing really new there. As you might remember, we've got our sales team focused on the largest customers, mid-market and above. And we've signed up a few partners to focus on mid-market and below.\n\nAnd so we said previously, whatever nominal churn we do get, it tends to happen in much smaller cohorts of customers. And that's just a direct result from the focus that Paula and her team are putting in large enterprise, large government.\n\nKevin Rubin -- Chief Financial Officer\n\nAnd I would just point out, I mentioned a metric in my prepared remarks. Average revenue per customer was about 91,000 this quarter, which is up again this quarter. And if you look at those customers that churned, their value was about a fourth of that. So again, when we're seeing customer churns, they tend to be much smaller, less penetrated customers.\n\nKamil Mielczarek -- William Blair -- Analyst\n\nThat's really helpful. Thanks again, and congrats on the quarter.\n\nMark Anderson -- Chief Executive Officer\n\nThanks a lot, Kamil.\n\nOperator\n\nThank you. The next question comes from Michael Turits from KeyBanc. Please proceed with your question, Michael.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nHey, guys. Congrats on the solid quarter in a tough environment. So I'd like to come back to Ittai's question about revenue versus ARR. So just I know you said that the revenue renewals -- strong renewals in the bookings.\n\nBut was there greater than expected either duration or the percentage of upfront rev rec than you had originally planned in the quarter that helped drive the revenue outperformance?\n\nKevin Rubin -- Chief Financial Officer\n\nYes. I appreciate the question, Michael. We did not see any material shift in duration. And I would just, I guess, remind that going into 2022, we did comment that there would be a slightly greater upfront portion.\n\nSo when you're looking at year-over-year revenue trends, this year is benefiting from recognizing about 50% upfront, whereas last year was about 40%, so that certainly is creating some of that dynamic that you may be seeing. ARR is obviously unaffected by both of those dynamics.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nJust a part of that or a follow-up and squeezing some in here. It's hard to tell, given that EBIT, of course, is based on revenue and we're more focused on ARR, but if you look -- and you decreased the EBIT loss for the year from last quarter's guide to this quarter's guide. But -- and I know you don't guide to cash flow, but would you say that the cash flow that you're looking for is now higher or lower than -- for this year than what you were looking for previous to this quarter?\n\nKevin Rubin -- Chief Financial Officer\n\nWell, I guess to answer that, Michael, I would just point to -- we've seen a meaningful change in where we thought profitability would be for the full year, from the beginning of the year until today. But for the change in paying out bonuses in -- half of the bonus in Q3 versus paying it all at the end of the year, which we have historically done, I would expect cash flow to trend to operating expenses.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nOK. Thank you very much.\n\nMark Anderson -- Chief Executive Officer\n\nYes. Thank, Michael.\n\nOperator\n\nThank you. The next question comes from Pinjalim Bora from J.P. Morgan. Please proceed with your question, Pinjalim.\n\nNoah Herman -- J.P. Morgan -- Analyst\n\nHey, guys. This is Noah Herman on for Pinjalim. Congrats on the quarter. Thanks for taking the questions.\n\nFor Alteryx auto insights, is that driving any Tableau license consolidation opportunities? And I may have missed it, but what was the FX impact to the net new ARR during the quarter? Thanks.\n\nPaula Hansen -- President and Chief Revenue Officer\n\nThanks, Noah. I'll take the question on auto insights. So we definitely see great interest in the market on this because people today aren't necessarily getting the insights from static dashboards that they're looking for, particularly in this uncertain economic time. So I would not say that we're pursuing Tableau replacement sales campaigns.\n\nRather, it is a supplemental capability because it handles real-time-based data very well. Serves up in a very automated way, insight and anomalies and trends within the data. So it's a very, very powerful capability for business owners in particular.\n\nSuresh Vittal -- Chief Product Officer\n\nAnd really, our customers when they talk about auto insights, they describe it as having an AI-powered analyst at their fingertips. That kind of shows insights that they didn't know to ask about, so reveal hit in insights. This is -- goes beyond the dashboard use, if you will. And so it's not really about Tableau consolidation exercise, it's about making analytics accessible to all.\n\nAnd auto insight is a great way to get business users, business owners. So not deep in the data access to these impacts.\n\nMark Anderson -- Chief Executive Officer\n\nYes. No, I mean just -- what I love about it, it's a whole new persona for whom we can sell -- to whom we can sell. Thanks, man.\n\nOperator\n\nThank you. The next question comes from Shebly Seyrafi from FBN Securities. Please proceed with your question, Shebly.\n\nShebly Seyrafi -- FBN Securities -- Analyst\n\nThank you very much. So my question is on the federal or public sector. We just completed the major federal quarter in Q3. Can you talk about the rough size of the public or federal part of your business now? I think you were working on getting more FedRAMP certified.\n\nWhere are you in that process? And you have these FIPS products for designer and now server. How much of a driver do you think they'll be to your public and federal business going forward?\n\nMark Anderson -- Chief Executive Officer\n\nSorry, was that Steve or Shebly?\n\nShebly Seyrafi -- FBN Securities -- Analyst\n\nShebly.\n\nMark Anderson -- Chief Executive Officer\n\nI remember I mispronounced your name about 10 years ago.\n\nShebly Seyrafi -- FBN Securities -- Analyst\n\nI know, Mark. It's been a while.\n\nMark Anderson -- Chief Executive Officer\n\nI made fun of you for it. Great to hear from you. Listen, we're just ramping up our no pun intended, ramping up our federal kind of presence. We've got a small but very good team.\n\nWe got really good government relations lead now. And with the FIPS certification both on designer and server that Suresh and team have delivered. We now have a hunting license to go hunting, but it's not really a very meaningful percentage of our business yet. As you heard from ServiceNow last week, it's a massive part of their business and a more mature Alteryx.\n\nYou're going to see the same thing from us, but I'd give us a couple of years before we start breaking into the multiple percentage points for federal. But really, I think the bigger picture that FIPS brings is, and every customer is asking for this, is focus on building great governance and security in our desktop products. Of course, we're going to do that in our cloud-based products. But on our desktop products, you could have argued that in the past, we haven't.\n\nAnd that's been a massive focus, especially in the last year and in the next few releases for the team around governance.\n\nShebly Seyrafi -- FBN Securities -- Analyst\n\nThank you.\n\nMark Anderson -- Chief Executive Officer\n\nThanks, Shebly.\n\nOperator\n\nThank you. At this time, this concludes our question-and-answer session. I'd now like to turn the conference back over to Mark Anderson for closing remarks. Thank you, sir.\n\nMark Anderson -- Chief Executive Officer\n\nThank you, operator. And I'd like to say thank you again to our customers, partners, shareholders, and our team here at Alteryx. I believe we had a great Q3, and we're committed to the opportunity ahead. This team is executing at a very high level, and we have a really strong product road map, and I'm confident in the strategic direction of this company.\n\nWe look forward to closing out the year with strong momentum. Thank you so much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRyan Goodman -- Head of Investor Relations\n\nMark Anderson -- Chief Executive Officer\n\nKevin Rubin -- Chief Financial Officer\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nJoel Fishbein -- Truist Securities -- Analyst\n\nPaula Hansen -- President and Chief Revenue Officer\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nTyler Radke -- Citi -- Analyst\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nSuresh Vittal -- Chief Product Officer\n\nMike Cikos -- Needham and Company -- Analyst\n\nKamil Mielczarek -- William Blair -- Analyst\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nNoah Herman -- J.P. Morgan -- Analyst\n\nShebly Seyrafi -- FBN Securities -- Analyst\n\nMore AYX analysis\n\nAll earnings call transcripts"
}