{
  "companyName": "Coinbase Global, Inc.",
  "companyTicker": "COIN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/coinbase-global-inc-coin-q3-2022-earnings-call-tra/",
  "content": "Coinbase Global, Inc. (COIN 1.75%)\nQ3 2022 Earnings Call\nNov 03, 2022, 5:30 p.m. ET\n\nOperator\n\nGood afternoon. My name is Abby, and I will be your conference operator today. At this time, I would like to welcome everyone to the Coinbase third quarter 2022 earnings call. [Operator instructions] Thank you.\n\nAnil Gupta, vice president, investor relations, you may begin your conference.\n\nAnil Gupta -- Vice President, Investor Relations\n\nGood afternoon, and welcome to the Coinbase third quarter 2022 earnings call. Joining me on today's call are Brian Armstrong, co-founder and CEO; Emilie Choi, president and COO; and Alesia Haas, CFO. I hope you've all had the opportunity to read our shareholder letter, which was published on our investor relations website earlier today. Before we get started, I'd like to remind you that during today's call, we may make forward-looking statements.\n\nActual results may vary materially from today's statements. Information concerning risks, uncertainties and other factors that could cause these results to differ is included in our SEC filings. Our discussion today will also include references to certain non-GAAP financial measures. Reconciliations to the most directly comparable GAAP financial measures are provided in our shareholder letter on our IR website.\n\nNon-GAAP financial measures should be considered in addition to, not as a substitute for GAAP measures. We are once again using Safe technologies to enable our shareholders to post questions. And in addition, we'll take some questions from our research analysts. With that, I'll turn it over to Brian and Alesia for opening comments.\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nThanks, Anil. All right. So as I look back at the quarter, obviously, there were some macro headwinds just the macro environment being down, and that ties directly into our trading revenue. But I was really excited to see the growth in our subscription and services revenue.\n\nThis is something where, three-plus years ago, we started planting the seeds of building some of these different product lines with different revenue streams. And we've really started to see that come to fruition, which means the portfolio of products that Coinbase has and works on has started to provide less volatility for the parent company revenue overall. We still have a long ways to go on that, but it's a great trend and it's moving in the right direction. So I just wanted to touch on a few topics.\n\nOne is I want to touch on our move to a product group structure in the company that I think will help us move even faster. And then I'm going to touch on the regulatory environment, and I'll end by sharing a few thoughts about how we're going to continue to lead in this environment. All right. So you may have read the news that our Chief Product Officer is going to be leaving the company.\n\nAnd this kind of accelerated the change that we had been thinking about for a little while, which was the idea of elevating our product group leaders in the org. And so we decided to make that change, and they're now going to be reporting directly to me. It'll be on the executive team. And we really have three different customer segments that Coinbase serves, so the product groups cleanly break down across those three customer segments.\n\nWe've got consumers, institutions and developers. Now we're going to have a fourth product group, which we're calling platform, and this product group is there to build the shared components across the different product groups that all of our products use, for instance, connecting into the different blockchains out there, generating transactions, storing crypto, things like that. So I'm really excited about this change for a few reasons. I think that we're a big enough company now where we want to have more autonomy and P&L ownership for each of the different product group leaders.\n\nWe want to give them the ability to move quickly and nimbly pushing down decision-making in the org, having them operate a little bit like three different start-ups within our larger company. And I'm really excited to see what the leaders of each of those product groups can do, and we have some really incredible talent, some rising stars in the company, and we're giving them more ownership here, which I think will drive our efficiency upscale, which is a -- by the way, I put out a blog post earlier this year, how we're going to operate efficiently upscale. It's probably good to go back and look at that, too. So let me just touch on the regulatory environment as well because, of course, the regulatory environment, I think, is one of the biggest unlocks that we're going to have in terms of growing this industry and perhaps even getting the prices to go back up in the right direction.\n\nBy the way, there's an opportunity at some point for the crypto prices to potentially decouple, I think, from the broader macro environment. And we don't know if that'll happen, but I think it's one of the possibilities. And regulatory clarity is one of the things that could help kick that off. So just generally, if I look at the whole world because, of course, we're engaging with policymakers all over the world, the G20 with the exception of China has actually been generally positive moving toward regulatory clarity.\n\nWhether it's in Europe or in Hong Kong or in Australia or Brazil, we're seeing regulatory clarity emerge around the globe, and that's really exciting and positive. The U.S., I would say, is a little bit behind, but it's also moving in a positive direction. There's a bill going through Congress called the Stabenow-Boozman Bill or simultaneously, it's being referred to as the DCCPA, the Digital Currency Consumer Protection Act. And this is a really positive development overall.\n\nIt gives spot market authority to the CFTC. It helps clarify the regulatory environment for centralized exchanges and custodians, which, of course, is the primary thing that we do. And it clarifies some of the regulation around stable coins, which is also good. Now there's also part of the language in the bill that we're going back and forth with policymakers, helping provide input and draft some of this is around DeFi.\n\nAnd look, I think that DeFi and self-custodial wallets are a super important part of where crypto is going. When you hear about Web3 and decentralized apps or Dapps and DeFi itself, these are really essential to have the ability for new companies and participants to go build these protocols and really give access to these tools to people all over the world, including the 1.7 billion people in the world who don't have access to any bank account or financial services today. So we'd like to see DeFi preserved and the innovation potential of that preserved. I really think in this Stabenow-Boozman Bill, everybody can basically agree that centralized exchanges and custodians should be regulated and my ideal world, I think we would really just focus the bill on that plus stable coins and just take the win.\n\nThere's a lot of good work to do for the industry and regulation. We can come back to DeFi later. But if DeFi needs to be included in somehow, maybe there's a way to sort of create further study and not necessarily opine on something so early in that bill. So anyway, we're very excited to see that bill make its way through Congress.\n\nIt has bipartisan support. I think it would be a great change actually to the current environment in the U.S. where, unfortunately, we're seeing this kind of regulation by enforcement from the SEC. And I do think that's creating a chilling effect on the U.S.\n\nmarket. It's harming U.S. investors in the sense that it's encouraging them to go to offshore exchanges that are less regulated or not regulated. And we'd like to see that change in the U.S.\n\nand for there to be regulatory clarity so that the U.S. can continue to be a leader in this space. As we're working on all these policy efforts, we're also not just sitting back idly. We're going to continue to build and innovate across all of our product suites.\n\nAnd it's going to continue to make us think about how we're making investments internationally because, of course, our mission is to increase economic freedom for the world, and there's various jurisdictions around the world that are a little further ahead on the regulatory clarity or they're even trying to attract crypto businesses there, building something where people can serve the rest of the world. And so we have to think about all of that at the same time as we help these policy efforts come to fruition in countries around the world. So yeah, just in this down environment, the down market, I should say, I'm actually really excited and energized. We've been through four crypto cycles in the last 10 years at Coinbase.\n\nAnd it's kind of funny. I actually enjoy the down cycles a little bit more. In up cycles, there's tons of scaling efforts that has to happen, and a lot of people rush into crypto for sometimes the wrong reasons. In the down markets, you get to focus on building and everyone's there who's a true believer and a true builder.\n\nAnd that's no different in this case. There's a ton of innovation happening. There's still a ton of institutions signing up, kind of getting ready to take advantage when this market we find the bottom of the macro environment. And Coinbase is going to continue to lead in this environment doing what we've always done in the sense that we're taking a very trusted and compliant approach globally.\n\nWe're not trying to cut any corners or move too fast. We're trying to do the right thing for the long term even if it's more difficult in the short term. I think that will pay off for us. We're also leaning into all the variety of different use cases that are emerging in the crypto economy.\n\nWe're leaning into Web3 usage, building a lot of this functionality natively into our app. Trading is great, and it's been a big source of revenue for us. It will continue to be in the future. But we also want to support all of the use cases in crypto, not just trading so that the crypto economy can really come to fruition, and that will be a diversity of different revenue streams that come into our platform.\n\nWe're trying to make crypto easier to use, and that's how we're going to get 1 billion people and eventually half the world onto using crypto and benefiting from it. So I think Coinbase has been a leader in terms of ease of use and design. And of course, we have -- we're one of the companies that have a portfolio of different products. And so this is great.\n\nOur customers love it. They can just sign up once, but anything they want to do with crypto, it's easy. They already have their crypto stored with us. It's just one more click to buy an NFT or a stake and earn yield on their crypto.\n\nAnd so the portfolio of products that we've created, I think, is unmatched in the industry, and we'll continue to build that out. So with that, let me turn it over to Alesia, who's going to go through our Q3 numbers.\n\nAlesia Haas -- Chief Financial Officer\n\nThanks, Brian. I'm just going to quickly recap a few key financial highlights in the quarter. Our results are covered in great detail and at length in our shareholder letter. So while our net revenue did decline sequentially to $576 million, our net loss and adjusted EBITDA both improved sequentially to negative $545 million and negative $116 million, respectively.\n\nAnd we think this really speaks to the cost management efforts that we took in Q3. Our trading volume declined 44% sequentially driven by ongoing headwinds that we discussed in our letter. Our MTUs declined 6% to 8.5 million as user behaviors continue to shift from trading to non-trading transactions. And our users are increasingly engaging in staking and reward-generating products amid this massive reduction in prices and lower crypto price volatility.\n\nWe are so pleased, and Brian alluded to this earlier, that our subscription services revenue grew 43% sequentially to $211 million. And importantly, if we hold price constant, so if Q3 prices were the same price they were in Q2, that would have grown 82%. The biggest contributor within this line item is interest income, which is benefiting from the rising interest rate environment. We took very decisive action on costs, and we were able to reduce our operating expenses by 38% sequentially or 22% when you back out the impact of noncash impairment charges on our crypto assets.\n\nWe are actively updating and evaluating our scenario plans and prepare to reduce operating expenses further if market conditions worsen. We ended the quarter with $5.6 billion in total U.S. dollar resources. In addition, we held a portfolio of $483 million in crypto assets.\n\nAnd combined, we believe this puts us in a strong position to manage through these market headwinds we face. So just in closing, I want to touch on our outlook. For 2022, for full year 2022, we remain cautiously optimistic that we will be able to operate within the $500 million adjusted EBITDA lost guardrail that we previously communicated. This is assuming the market cap doesn't go down and to deteriorate meaningfully below October, and we don't see any changes in the customer behaviors.\n\nAs we approach 2023 planning, we're currently preparing with a conservative bias and assuming the current macroeconomic headwinds will persist and potentially intensify. We are not providing a quantitative outlook yet at this time. So to conclude, we feel confident that we're in a good position to manage through the stress market and will emerge stronger on the other side. So with that, let's go to questions, Anil.\n\nAnil Gupta -- Vice President, Investor Relations\n\nGreat. Thank you both. Before we get into Q&A, I'll quickly reiterate our call principles. So first, we'll answer the most uploaded questions determined by the number of shares.\n\nAnd we might group questions together that touch on the same themes. Second, we don't plan to answer questions related to the potential listing of new assets. And third, we'll avoid questions we've answered in the past or issued blog posts about in the past if there are no material updates. So with that, the first question is from Manuel O.\n\nwho asks, what's the prediction for the next five years. Brian?\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nYeah. Thanks, Anil. So of course, just to clarify, we always have to say we can't actually predict the future. I don't want to make the lawyers too nervous here on forward-looking statements.\n\nBut I kind of like this quote, the best way to predict the future is to invent it. So we can certainly do our best to build some of the things that we think have potential, and that's -- it's a great way that people can have an impact on the world. So I mean what's going to be different in crypto in five years? Well, look, as I addressed earlier, I think there's going to be more clear regulatory environments across the G20 and really around the world. That's going to unlock a lot more institutional capital.\n\nWe're seeing that under the surface, even in this challenging market, we're seeing the adoption from [Inaudible] investors that are basically signing up to our Coinbase Prime platform. And I like the language that we used in the shareholder letter around the spring is coiling. I think there's a lot of people preparing for when the next upswings happen. I think the scalability of the blockchain will continue to improve.\n\nWe saw this a little bit with Ethereum's merge this year, but they have a lot more updates there. We're seeing other blockchains continue to scale with Lightning Network and various Layer 2 solutions, which is really exciting. That will just unlock a whole bunch of new use cases and is similar to how the Internet moved from dial-up to broadband. I think decentralized trading with dexes, decentralized exchanges will continue to grow as a percentage of all global trading, and we're excited about that.\n\nI think you'll see actually more countries in the world adopt cryptocurrency as legal tender, kind of in the way that El Salvador did with Bitcoin. I know that they were a very early adopter, and there's probably going to be -- in the next five years, I wouldn't be surprised if we didn't see other countries continue to adopt cryptocurrency as their legal tender, similar to how some countries actually just peg their currency to the U.S. dollar. I think a lot of countries are also going to pursue Central Bank digital currencies and in the U.S., I think actually USD coin will end up being kind of a de facto central bank digital currency in the U.S.\n\nIn other words, the policymakers in the U.S. will set the frameworks that need to be followed, but the private market will actually create the solutions and USD coin has been on a really rapid rise. And I think it will probably be the largest in the world at that point, ahead of Tether, if I had to guess. I think crypto will just start to have a really big impact on economic freedom.\n\nThat's kind of what we believe is going to happen. That's the mission of Coinbase. And the market will recognize us for the long-term and thoughtful approach that we've made around compliance, trust, security, ease of use. And hopefully, we have, at that time, 1 billion people using crypto.\n\nToday, I think there's probably 200 million, 300 million people in the world who've used crypto. And I think we could easily be at 1 billion people using crypto within five years. But again, we can't tell for sure and this is going to take a lot of hard work.\n\nAnil Gupta -- Vice President, Investor Relations\n\nGreat. Our next question comes from Cordaro S. who asks, how does Coinbase plan on surviving the current economic downturn? Brian?\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nYeah. Well, just one kind of language knit I'll mention here. I don't like the word just surviving in the current economic downturn. I think there's actually opportunities to thrive in this environment.\n\nAnd whether the market is up, there's opportunities. Obviously, we could raise money at higher valuations or whatever. But in down markets, there's also opportunities all around us. There's opportunities to do good M&A deals, and we're looking at a lot of those.\n\nWe've got dry powder to take advantage of that when prices come down. And there's all kinds -- there's opportunities to build, right? If we don't have to focus so much on just scaling in a hyper-growth environment, there's opportunities to help build future, pay down tech debt. We're seeing a lot of improvements across our technical infrastructure just around tech debt that will help us get to the next order of magnitude in the next run. So there's lots of opportunities to thrive.\n\nOf course, subscription and services is another big one that I mentioned, right? We planted those seeds to diversify our revenue streams. That's really coming to fruition. And we don't know exactly what will take off in the next cycle. So we've got to continue building and innovating.\n\nThat's part of why I'm so excited about how we're making Web3 easier to use. There's, I think, a lot of exciting work happening with decentralized social media, Dow's decentralized gaming, all these things we need to make -- the Metaverse, right? People want to own digitally native items inside the Metaverse and various games. So we need to make sure all these things get easier and easier to use over time, and we've got opportunities with our products there as well, not just around trading but all these other use cases. Let's see what else.\n\nI mean we're continuing to do great partnerships, BlackRock and Meta and Google. As a public company, I think we've been really delighted to see that other public companies are willing and excited to work with us and our diligence processes with them has gone even better. And just overall, I think we're going to manage through this the way we've done through the last crypto -- the last four crypto cycles that we've been through as a company. So obviously, we have to be rigorous about managing costs and things like that, but there's good revenue growth opportunities in these different areas.\n\nAnd yes, we're going to keep operating efficiently and making some of these changes like around our product groups.\n\nAlesia Haas -- Chief Financial Officer\n\nIf I could, I'd just like to add on a couple of numbers behind your comments. So just to add on to this question, we did end Q3 with $5.6 billion in total USD resources and $480 million in crypto, so over $6 billion in combined crypto and cash resources. On our operating expense side, as I mentioned earlier, we reduced our operating expense by 22%, excluding impairments. And we're continuing to manage expenses very closely given the macro conditions.\n\nAnd just a final thought for me. I think it's important to share how our team thinks about operating through these volatile crypto markets. And as a team, we spend a lot of time thinking through a variety of scenarios and developing contingency plans. We believe we have the balance sheet to weather a multiyear downturn, and we have action plans we have developed to lower our expenses or extend our runway if needed.\n\nAnil Gupta -- Vice President, Investor Relations\n\nWe had several questions about competition. I'll summarize them by saying how do you plan to compete with companies that offer zero fee trades or other companies that are starting to get into the U.S. market. Emilie?\n\nEmilie Choi -- President and Chief Operating Officer\n\nThanks for the question. So we are seeing a lot of headlines about zero fees, and I want to make sure we unpack that a little bit. So there's two ways that companies generally generate revenue through trading. There is spread and there's a fee.\n\nAnd companies that say zero fee are still generating a spread or charging a partner. So right now, we are roughly in line with other companies in terms of our total costs. In any case, customers are willing to pay for our premium product, and we talked before about we are not going to compete on price because of the quality of the product. We also offer Coinbase One a subscription product where customers can do zero fee trades.\n\nSo then now let me move on to how we compete. At the highest level, our goal is to grow the share of users and wallet across our three customer segments: consumer, institutional and developer. We have three major differentiators or value props. One is that we are the most trusted.\n\nWe've always taken a long-term view on compliance and security, and we're widely viewed as the safest and most compliant player in the space. Ease-of-use, we know that crypto is too complex for the average person, and with Coinbase people can get the utility of crypto technology without having to understand all of the technical details. Finally, we have an integrated product suite. We know that there will be many winners in crypto and there's going to be plenty of opportunities for everyone to extract great TAM.\n\nBut Coinbase is one of the only places where you can have one crypto account and do every sort of crypto activity. You can trade, stake, pay, borrow, earn, create, etc. And we believe that we have begun to prove out this multiproduct strategy. So examples of this.\n\nOne is that we started to invest in USDC back in 2018. We invested in staking in 2019. And now we're seeing that these efforts are yielding pretty great results as demonstrated by the growth of our subscription and services revenue. And we continue to plant seeds for future growth through partnerships like the ones we've announced with BlackRock, Google and others.\n\nAnd then finally, as we look toward big opportunities and big TAM expansion, we should note that our product suite has historically been focused around crypto spot markets, specifically U.S. spot markets. And that is a great opportunity, but that's also a smaller TAM compared with the global crypto trading market. So as we look at product and geographic expansion opportunities to grow revenue in a larger TAM market, that includes things like derivatives in the U.S.\n\nand globally, we think there's a lot of ways to expand that TAM. So in summary, lots of TAM expanding moves. We believe that being the most trusted, easiest to use and having an integrated product suite over time across these three different customer segments is going to help us continue to win share of users and wallet over time.\n\nAnil Gupta -- Vice President, Investor Relations\n\nThanks. Our next question comes from Ezra W. who asked, what are the ways you can diversify your revenue and profits from crypto prices. Alesia?\n\nAlesia Haas -- Chief Financial Officer\n\nThanks for the question, Ezra. So I think it's important to start with we're a crypto company, and we're 100%. We're all in on crypto. So our revenue and profits will be intrinsically tied to the overall crypto market in some form or fashion.\n\nHowever, we can dampen the effect of direct comparison. So today, our largest revenue stream, trading revenues, is directly correlated with crypto prices and crypto price volatility. So we experience that volatile. As you can see over the last 18 months as prices were rising in high volume in 2021, we generated a lot of revenue.\n\nAs prices have come down and volatility has come down, we've had trading headwinds this year. So we are very proud of our trading platform, and we recognize that there's going to be volatility given how early we are in this industry. But because of that volatility, years ago, we started investing in new revenue streams, specifically our subscription and services revenues. And this has been comments that you've heard from Brian and Emilie earlier that it takes time to build these great products and for them to achieve scale.\n\nBut we're really proud that we started planting the seeds back in 2018 with cofounding center with great USDC. In 2019, we rolled out our first staking asset. And you can now see both of these products generating significant growth within our subscription and services revenue lines. In 2020, I think it's important to note that subscription and services was $45 million in full year revenue, $45 million.\n\nIn 2021, it grew to over $500 million. And this year, our outlook is now over $700 million, and that's despite the headwinds we talked about in the crypto market and significant price declines. So we're pleased with the progress we're making, and we think that we need to continue to invest here to create the multiproduct strategy. And this will diversify the drivers of our revenue and dampen out some of the volatility we're seeing.\n\nAnil Gupta -- Vice President, Investor Relations\n\nOur next question comes from Manuel O. who asked, how are you planning to detach the share value from Bitcoin value. Alesia?\n\nAlesia Haas -- Chief Financial Officer\n\nAll right. Different question, same flavor. So we just talked about diversifying our revenues to reduce P&L volatility from crypto prices. And it's a similar answer on reducing the correlation in our stock coin from Bitcoin.\n\nSo again, Bitcoin is the largest crypto asset by market cap, and we generate meaningful revenue from Bitcoin trading and test fees. So I think there will always be some element of correlation between our stock and Bitcoin. But I think it's important to note that this has not been a consistent relationship. So interestingly, there's some periods of 80%, 90% correlation between Coin and Bitcoin and in Q3, we had really low correlation.\n\nIt was approximately 30%. So I don't know how investors are thinking of this, but I think there's a few things that I think are important to note. So one, is not all asset managers or large investors actually have the ability to directly invest in spot Bitcoin. And so as the first public company, some investors are gaining access to Bitcoin and crypto broadly via Coin.\n\nAnd so they're using our stock as a proxy for how they may or may not have traded the underlying spot assets. We believe as ETFs to hopefully get approved and more crypto companies go public, I can see less correlation between Coin and Bitcoin. Further to these trends, we could see less correlation with the development of more institutional trading alongside financing and derivative markets in the U.S. where investors could have more vehicles, easy access to short Bitcoin directly as opposed to Coinbase.\n\nLastly, it comes back to what I said before. The more we can create multiproduct strategies with different revenue drivers and diversify our P&L, I think we'll see less correlation to any single coin or crypto overall. And that is the thing that is most in our control to drive that product strategy, deliver value to our customers and what we are singularly focused on.\n\nAnil Gupta -- Vice President, Investor Relations\n\nOur next question comes from Stephen J. who asks, what software or technological updates does Coinbase have on the way?\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nYeah, I can take that one. So well, first of all, I don't want to preannounce anything that's coming down the pipe here, but I just can talk generally about what technology updates, I think, that we have in the process or we have already live that are really powerful for us. So one of them, I think, is sort of underappreciated is actually our MPC or multiparty competition tech stack. For those who aren't familiar, MPC is a way that you can store crypto securely using different keys in different secure environment.\n\nWithout getting into the technical details of it, what it does is it allows us to store crypto more securely in our hot wallet and things like that. It also enables functionality like in our app, we have something called Adapt Wallet, which allows customers even using our core retail app to go access Web3 apps and decentralized apps. Sorry, if this is too much technical jargon, but basically, it allows the customers to go access these third-party apps and participate just like they would with a self-custodial wallet, but they have all the security and protection that they normally rely on in Coinbase. This was a core piece of technology that we developed in-house.\n\nWe got a lot of key talent team in through the acquisition of Unbound, some real cryptography and the cybersecurity experts that made this work in practice. And I think this is going to be actually a really a core differentiator for us over time. Other core technology updates, I mean, we acquired FairX our derivatives exchange, and that has allowed us to have some really best-in-class IP in-house to make the most reliable and scalable exchange over time, both on spot and derivatives. I think Coinbase NFT had a really cool update recently where we actually began aggregating listings across various marketplaces out there.\n\nAnd one thing that's really nice about the blockchains and the interoperability of these different protocols is that it allows us to interface cleanly with the various apps and ecosystems marketplaces out there to build a world-class experience just for our customers using Coinbase NFT. And then, of course, we've been working a lot on a service-oriented architecture and our scalability in the background, especially during this down market, there's -- we want to make sure we can get to 1 billion users over time, and that requires a lot of investments in our tech stack. By moving to the service oriented architecture, it's allowed us to be -- it's improved the performance and scalability, but it's also improved the resiliency of our app in the sense that if one aspect of our app has a problem, it doesn't bring down the whole app. It's generally things would degrade gracefully.\n\nAnd these are the kinds of investments that you've seen in major -- all major tech companies upscale, Google and Amazon. And it's really seen our tech stack evolve from the start-up that we used to be. We still keep a little bit of that start-up culture, but our tech stack now has to be able to serve over 100 million users, and we think that will be over 1 billion in the future.\n\nAnil Gupta -- Vice President, Investor Relations\n\nOK. Great. We'll take one more question before switching over to the analysts. So Michael T.\n\nasked, will my money ever be backed by funds on your exchange in case it's theft and what are your procedures for taking -- you were taking to ensure safety? Emilie?\n\nEmilie Choi -- President and Chief Operating Officer\n\nThanks for the question, Michael. So we have invested over the history of the company and being the most trusted player in the space, and we take the responsibility of securing customer funds very seriously. I would add that we're proud that we've never had an event where the systems have been materially compromised in any way. And this is because of all of the things that we have invested in since 2012.\n\nWe have an industry-leading insurance policy for the hot wallet. We have $1 million account protection for our Coinbase One subscribers. We've invested in best-in-class AI and machine learning fraud detection. We have a 200-plus person security team and live phone support and in-app chat and we'll continue to invest in these things and more.\n\nSo it is important to know that crypto is a nascent technology. And like many new technologies, scammers will always seek to take advantage of users. So we also invest heavily in educating our users about how to keep their credentials and account safe, for example, using UVs and other things.\n\nAnil Gupta -- Vice President, Investor Relations\n\nGreat. So with that, Abby, why don't we turn it over to the analysts for questions?\n\nOperator\n\nYour first question comes from the line of Lisa Ellis from MoffettNathanson.\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nHi. Good afternoon. Thanks for taking my questions, and good stuff here. I wanted to follow up, Brian, on the international strategy.\n\nYou had highlighted it, I think, in the shareholder letter that crypto trading volumes have been moving offshore over the course of this year. And I noticed you guys recently added Singapore and the Netherlands, and then you also added zero commission trading for Fiat to USDC coin. Can you kind of tie all of that together for us and holistically talk about how Coinbase is thinking about capturing some of that offshore volume and continuing to expand outside of the U.S.? Thank you.\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nYeah, sure. So international expansion is really core to our mission of increasing economic freedom in the world. We want to make sure that we're doing that with a global mindset. And we have seen really good progress on the regulatory front, acquiring licenses in a variety of different locations.\n\nI'm in Singapore right now, and we just got our in-principle approval for -- to hopefully end up with a license here from the monetary authority of Singapore, which has been a great step in that direction as well. I think that we have seen the percentage of U.S. spot trading has shrunk from the beginning of this year as we've seen more of it go overseas. And that's -- I don't know the exact reason for that.\n\nI think the chilling effect that some of the regulatory environment and the rhetoric there may not have helped. So it is causing us to make sure we have our international markets served even more fully. And I don't want to share anything too much beyond that at this point. But it's important for us to make sure we have global coverage, and we are serving customers from the best jurisdictions that we can globally.\n\nAnd we need to see the regulatory environment evolve and get to that clarity both in the U.S. and in other markets where we'll continue to invest. Emilie, Alesia, anything you want add?\n\nEmilie Choi -- President and Chief Operating Officer\n\nNo, that covers it.\n\nOperator\n\nYour next question comes from the line of Owen Lau from Oppenheimer.\n\nOwen Lau -- Oppenheimer and Company -- Analyst\n\nThank you for taking my question. So based on my math, Coinbase has a loss of about $247 million in adjusted EBITDA year to date. If trading volume or if trading revenue stays at October level, and you continue to benefit from rising rate. Is there any reason why you have a loss of over $250 million in EBITDA in the fourth quarter? And then without getting any -- into any specific guidance, your adjusted EBITDA loss has been shrinking.\n\nCould you please talk about if you have any aspirational goal of achieving positive adjusted EBITDA in the near term? Thank you.\n\nAlesia Haas -- Chief Financial Officer\n\nThanks for the question, Owen. So as we articulated in our outlook right now, we are just really focused on operating to the guardrail metric that we set forth. And we are being prudent in our expense management. We are prudently trying to grow our subscription services, but we are facing headwinds on trading.\n\nSo there's nothing that I have to specifically talk about that could be a one-time loss at this time in Q4. But our focus is just managing toward that 500. And specifically, no, we are thinking about investing as much as we can for growth. As Brian said, there's a lot of exciting areas that we can invest in, in the crypto market, and we want to ensure that we are investing through the cycle that we are opportunistically reserving dry powder from M&A opportunities.\n\nAnd so we're not immediately focused on getting to EBITDA profitable. We are trying to manage to profitability across a cycle as we set forth in our S-1, we went public about 18 months ago, that when we're in bull runs, we're going to make profits. When we're in downturns, we're going to take prudent losses, and we do those in the construct of the overall balance sheet capacity that we have. So it is not a near-term goal of our focus of ours to drive EBITDA positive in the near term.\n\nHowever, if markets decouple, as Brian said is a possibility, we could see ourselves returning to EBITDA. But it's not an intentional goal that the management team is setting forth with.\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nYeah. Similar to what Alesia said, I think it's important just to kind of touch on -- to reiterate this point about managing through cycles, right? So last year in 2021, we did roughly $7 billion of revenue and $4 billion of positive EBITDA. And so this year, we're going to -- we're targeting this negative $500 million EBITDA as our guardrail. So you can see that in up markets, we'll do quite a lot of positive EBITDA; in a downmarket, we don't want it to be excessive, but I think it's reasonable to have some moderate amount of negative EBITDA and burn there just to continue to invest through cycles, especially given the strength of our balance sheet.\n\nSo hopefully, that gives you a little bit of a sense of how we're thinking about it.\n\nOperator\n\nThe next question comes from the line of Kenneth Worthington from J.P. Morgan Securities.\n\nKen Worthington -- JPMorgan Chase and Company -- Analyst\n\nGood afternoon. Thanks for taking my questions. I have two on the competitive environment I'm going to try to wrap together. So first, we see Binance offering a number of, I'll say, pricing concessions or promotions.\n\nDoes the pricing seem to be having an impact on retail behavior that you see as sort of persistent or sustainable? And if so, is it impacting the type of customer that you want on the Coinbase platform? And then second, I know it's still early days for Coinbase One, but it is up and running. How effective is Coinbase One, a response for fee trading offerings elsewhere? And can you walk us through the characteristic of a target Coinbase One customer and how the transition impacts the overall economics of Coinbase?\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nYeah, so I think it's giving people directions -- yeah, go ahead, Emilie.\n\nEmilie Choi -- President and Chief Operating Officer\n\nSure. Why don't I start? And Brian and Alesia please jump in. I think that to your first question, we do -- clearly, some competitors can kind of drive market share with zero fees in certain parts of the market. And I just want to reiterate my point about the fact that there's still spread and there's still a fee and that companies that says zero fee are still generating a spread.\n\nWe found that when we benchmark, we're roughly in line with other companies, and we are not going to compete on price because of the premium nature of our offering. I can't speak to the percentage of users that might kind of go for zero fees on a competitor sites. I can say that the nature of the users that we have is one where they tend to be fairly sticky or during these crypto winters, they tend to be huddlers and hold on to their holdings and are less active, but then come back as the market comes back a bit. Whereas there are other behaviors where very active traders might be trading in long-tail assets and potentially are more price sensitive and go to those other platforms during these times.\n\nAlesia, do you want to add on?\n\nAlesia Haas -- Chief Financial Officer\n\nYeah, there's a couple of things I'd like to add on. Thanks, Emilie. The first is, and we shared this in our shareholder letter, that even though our retail investors, and Emilie alluded to this, are not trading as much, we do not see them leaving our platform. And so when we look at our retention rates at those customers, i.e., the holdings in their wallets, it's very high retention rates.\n\nAnd it's very comparable to the same behaviors we saw in the 2018, 2019 time period. And so what we see is that our retail investors just go into huddling mode. They seek out yield. They seek out other activities they can do with their crypto, but they're not converting it to fiat and leaving the platform.\n\nThey're not sending the crypto to competitors and then trading on those platforms. They maybe have other accounts away from Coinbase, which we can't see, but we don't see behavior of our customers leaving our platform. I want to touch on the Coinbase One question though, because we really are excited about this product offering. So the purpose of Coinbase One is to be a product for all of our users if we think it offers a series of benefits that can enable everybody to have $1 million of account protection and produced by its premium customer service.\n\nIt provides low monthly fee to be able to get unlimited trading in just other perks and access to our platform. So we've seen really good both paid and total subscriber based growth quarter over quarter, and we have not made these numbers public. It's in our other subscription and services revenue within the breakout of our revenue on our P&L. But we're seeing good behavior and we're seeing the ARPU of these customers is higher than our other users once they're engaged with Coinbase One.\n\nOperator\n\nYour next question comes from the line of Benjamin Budish from Barclays.\n\nBen Budish -- Barclays -- Analyst\n\nHi guys. Thanks so much for taking my question. I wanted to ask about USDC obviously kind of the biggest driver of your interest income in the quarter. Can you maybe talk about, I know it's a little bit hard to as Brian said, you can't predict the future, but what's sort of your kind of near to medium term outlook? And maybe can you talk about the things that are within your control? Perhaps, the – your expectations for Coinbase generated issuance of USDC where do you see the biggest opportunities? Is it retail users looking to use it to engage in DeFi? Is it institutional customers? That would be helpful.\n\nAlesia Haas -- Chief Financial Officer\n\nMaybe I'll start with this one and feel free to add on Brian and Emilie. So we've made a series of announcements recently around USDC that we think can really help drive adoption. So, for example, we want to make USDC more accessible to our global customer base. We have now made the fees commensurate with our U.S.\n\ncustomers in Europe. So customers who want to buy USDC with euros or GDP do not have any fees to do so. We think this will really generate growth for non-U.S. holders of this asset.\n\nWe've also started to pay out yield on USDC, the word technically. And we made announcement with MakerDAO, which is a large D5 protocol, where they're going to bring 1.6 billion of USDC to our platform, and we're going to pay them a 1.5% reward rate. So we think continuing to make USDC, frankly a better dollar, meaning it's faster, it's 24/7/365, and now it pays an attractive reward rate, will help with adoption not only for us, for folks who are looking to have a stable crypto as they think about trading and moving to other assets, but getting access to a U.S. dollar exposure and non – in countries that don't have easy access.\n\nSo those are some of the growth initiatives that we have within our product control that we're starting to experiment with and roll out. And with regards to our partnership with Circle, we make money in two ways. One is just with regards to the USDC we hold in our platform. So a lot of these initiatives that I spoke to will hopefully grow assets on our platform and that we would generate revenues through that behavior.\n\nAnd then there's another prong that the revenue share that's based on the percent that we distribute of USDC into the ecosystem. Growth in market cap, growth in our behavior and then interest rates are the three drivers of that revenue.\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nYeah. And I think your question touched on sort of the different use cases across different customer segments and USDC has applicability across many different customer segments. So obviously it's used in trading pairs quite a bit, right, both in DeFi and with centralized exchanges. So traders use it quite a bit.\n\nIt's also used by businesses. We're seeing some businesses make intercompany payments that way or B2B payments. It's just faster than getting a wire, it'll arrive in a few seconds and with less fees than sending wires. So for B2B payments, I think it's useful.\n\nWe're seeing some people do payroll in USDC. We're seeing venture investments happen with USDC and then retail customers use it as well. I mean, not just to earn yield on their dollars that Alesia mentioned. But there's many people in the world who would like to have a U.S.\n\nbank account, but they can't actually access it. But through a self custodial wallet or something like that, they can actually hold U.S. dollars through USD coins. So it's applicable across a wide variety of use cases.\n\nAnd as I said in the opening remarks, I think the – USDC will probably end up being kind of like a de facto central bank digital currency for the U.S. which is a little different than some other countries that are trying to really create it themselves. So yeah, I think the use cases are many.\n\nOperator\n\nThe next question comes from the line of Will Nance from Goldman Sachs.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nHey, guys. Appreciate you taking the question. I guess I just want to understand, how important do you think it is for Coinbase to be a U.S. domicile company? If we see so much crypto activity moving overseas, I mean, do you guys ever make the decision or that, you need to be more active in international markets to protect or potentially even primarily in international markets in order to compete with all that's happening at outside of the U.S.\n\nin the ecosystem?\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nIt's a good question. Just zooming out, I mean, look, I think it's the right long-term choice to be have the parent company based in the U.S. and of course we have entities in a variety of countries around the world. So we can serve.\n\nI don't think we're especially hindered in that regard in the sense that we can spin up an entity and in another region that serves non-U.S. customers. And I think our hands are not necessarily tied in that regard. But look, this was a big decision even going back to the very founding of the company.\n\nI didn't really know, this was back in 2012. I didn't really know how the ready for landscape would evolve in the U.S. and I did – the thought did cross my mind, at that time was like, should I go create company in Hong Kong or Singapore or somewhere, Switzerland or something like that. But I made the decision back then to actually build the company in the U.S.\n\nand I felt like, look, it may be a bit difficult, it might be a bit more difficult because the U.S. doesn't always act as quickly or nimbly as some kind of like a special economic zone as like Hong Kong or Singapore, but I think it's the right bet long term, right? In the sense that can read Ray Dalio's changing world order, who knows what'll happen in 50 years. But at least for today, the United States is kind of the leading economy and it's the best place with rule of law and strong property rights and everything to build a global company that can reach the rest of the world. So yeah, I would say sometimes it's felt like we're actually at a disadvantage and it's caused us to move more slowly than foreign competitors.\n\nSome of that by the way, is just our own execution that's fully in our control, but other times it's the regulatory environment. It does feel like we're almost facing unnecessary headwinds given – trying to do the right thing, right, which is definitely frustrating. But I think it's the right long term bet and it's going to allow us to prevail as a like company that stands the test of time globally. And regulators don't always act quickly, but they do eventually act.\n\nAnd so we'll see that regulatory clarity here in the U.S. and we'll see hopefully a more level playing field emerge globally over time.\n\nEmilie Choi -- President and Chief Operating Officer\n\nAnd Brian, I would just also add to reiterate this is, I think when you see the data so starkly that the volumes are moving offshore, we're optimistic that us lawmakers, legislators and regulators understand that now is the time to act on very sensible regulation so that innovation and technology and tax sellers can actually happen in the U.S.\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nYes, I think that's right. I mean, that's the message that we deliver a lot in meetings with policy makers is by pushing so hard on the local companies, you're not actually protecting investors. You're just encouraging them to move offshore to even less regulated options, right? So that's an important message I think for all regulators to hear. And even here in Singapore, I've been not meeting with MAS and Temasek and GIC and various parties and there's a similar message here, which is that Singapore – current Singapore regulators are some of the most sophisticated in the world.\n\nThey've been very open to having institutions, crypto institutions operate here and stablecoin, but they were a little hesitant recently on retail trading and self hosted wallets. And I kind of made the point to them like, it's incompatible. If you want to be a Web3 hub, which Singapore has come out and said, you can't actually prevent retail trading. You can't prevent self hosted wallets like the – only way to access Web3 in many cases is through self hosted wallets.\n\nSo they were very receptive to that conversation. They were eager to work with us. And I think it actually created a much more, I hope we had a positive out outcome there. So yes, I think these regulatory conversations are really important globally to make sure things head in the right direction that protects investors, but also preserve the innovation potential of this technology.\n\nAnil Gupta -- Vice President, Investor Relations\n\nWe have time for one final question.\n\nOperator\n\nOur final question will come from the line of Rich Repetto from Piper Sandler.\n\nRich Repetto -- Piper Sandler -- Analyst\n\nYeah. Good evening, Brian and Alesia. I guess my – I want to be respectful. I am respectful.\n\nYou've been through a crypto winner and – but you have acknowledged, I think Brian and Alesia that this you haven't been through one with interest rates rising like we have. So I guess my question, I looked at the head count, your head count is down 5% quarter over quarter and it's actually up 25% from year end. And I'm just trying to understand, and you got expenses increasing in the fourth quarter. So just trying to see how you sort of felt like your right size, given the sort of the risk and the potential for loss.\n\nIf we stay in this crypto went to – and it looks like trading volumes are flat, they're a little bit down to start. So how do you feel, how did you justify that you right size a company given this volatility?\n\nAlesia Haas -- Chief Financial Officer\n\nEmilie, I will start and you can add.\n\nEmilie Choi -- President and Chief Operating Officer\n\nOK.\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nYeah, I'll start. You feel free to jump in. I mean, so as Alesia mentioned, we targeted this negative 500 million for the year, and at least so far we seem to be on track for that. I do think it's reasonable to given the positive 4 billion of EBITDA last year to sort of have some kind of moderate negative EBITDA in this down environment.\n\nSo it's about investing in the future and we're so far capitalized well enough to do that, which I think makes sense. Now, of course, we're just going to continue to monitor the market conditions. I think, it's very plausible that we'll see a further down trend in the market in next year. And if we feel that we're not on track to meet our goals in terms of EBITDA, we're happy to react to that in that kind of environment.\n\nBut I think right now we're basically monitoring the situation and we're going to see what happens over the coming quarters. Alesia, what do you want to add?\n\nAlesia Haas -- Chief Financial Officer\n\nNo, I think that's right. I just wanted to reiterate, Rich, that in our outlook, we speak to 2023 as that we're taking a conservative bias toward the year and that we think that these headwinds could persist and possibly intensify. And so as we do that, we're doing a lot of scenario planning and understanding what that may mean. We're not prepared to offer quantitative outlook today, however, I just want to let everyone know that we're committed to managing our expenses prudently and watching the macro conditions and the business performance closely, and that we'll continue to update all of our scenarios as conditions involved, and we would take additional actions to further manage our expenses if we deemed that warranted.\n\nAnil Gupta -- Vice President, Investor Relations\n\nGreat. Thank you all for joining us today, and we look forward to speaking to you again on our next call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAnil Gupta -- Vice President, Investor Relations\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nAlesia Haas -- Chief Financial Officer\n\nEmilie Choi -- President and Chief Operating Officer\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nOwen Lau -- Oppenheimer and Company -- Analyst\n\nKen Worthington -- JPMorgan Chase and Company -- Analyst\n\nBen Budish -- Barclays -- Analyst\n\nWill Nance -- Goldman Sachs -- Analyst\n\nRich Repetto -- Piper Sandler -- Analyst\n\nMore COIN analysis\n\nAll earnings call transcripts"
}