{
  "companyName": "Dominion Energy, Inc",
  "companyTicker": "D",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/dominion-energy-inc-d-q3-2022-earnings-call-transc/",
  "content": "Dominion Energy, Inc (D -0.52%)\nQ3 2022 Earnings Call\nNov 04, 2022, 10:00 a.m. ET\n\nOperator\n\nWelcome to the Dominion Energy third quarter earnings conference call. [Operator instructions] I would now like to turn the call over to David McFarland, vice president, investor relations. Please go ahead.\n\nDavid McFarland -- Vice President, Investor Relations\n\nGood morning, and thank you for joining today's call. Earnings materials, including today's prepared remarks, contain forward-looking statements and estimates that are subject to various risks and uncertainties. Please refer to our SEC filings, including our most recent annual reports on Form 10-K and our quarterly reports on Form 10-Q for a discussion of factors that may cause results to differ from management's estimates and expectations. This morning, we will discuss some measures of our company's performance that differ from those recognized by GAAP.\n\nReconciliation of our non-GAAP measures to the most directly comparable GAAP financial measures, which we can calculate, are contained in the earnings release kit. I encourage you to visit our Investor Relations website to review webcast slides, as well as the earnings release kit. Joining today's call are Bob Blue, chair, president, and chief executive officer; Jim Chapman, executive vice president, chief financial officer; Diane Leopold, executive vice president, chief operating officer; and other members of the executive management team. I will now turn the call over to Bob.\n\nBob Blue -- President, Chairman, and Chief Executive Officer\n\nThank you, David. Good morning, everyone. We delivered strong third quarter results and are well-positioned to meet our expectations for the year. We also have been steadily executing on our investment programs focused on decarbonization.\n\nThis successful execution is already benefiting our customers, communities, the environment, and our investors. I'll begin with safety. Through September, our OSHA recordable rate was 0.53, which remains low relative to our historical levels and substantially below industry averages. We take pride in our relentless focus on safety, and it is the first of our company's core values.\n\nNext I'd like to provide some context to our announcement this morning of our initiation of a top-to-bottom business review, with the goal of ensuring that Dominion Energy is best positioned to create significant long-term value for our shareholders. In recent years, we've taken a series of strategic steps both through M&A and through the capital allocation decisions to materially increase the state-regulated profile of our business. Our strategy remains anchored on this pure-play, state-regulated utility operating profile that centers around premier states that share the philosophy that a common sense approach to energy policy and regulation prioritizes safety, reliability, affordability, and increasingly sustainability. These states also strive to create environments that promote sensible economic growth, which, like the rising tide, lifts all boats.\n\nOur state-regulated utility model offers investors long-term earnings visibility and is enhanced by our concentration in these fast-growing constructive and business-friendly states. To state the obvious, we're monitoring what's going on in the broader economy. Like everyone, we're seeing inflation, supply chain limitations, and higher fuel prices, all having an impact on customer rates and our balance sheet strength. We're keenly aware of the economic pressures that are affecting our customers and taking seriously our core mission to deliver reliable, affordable, and clean energy to our customers while creating value for our shareholders.\n\nSo far, our company has navigated this new environment well. Our safety and reliability metrics have remained strong. As we steadily execute on our industry-leading decarbonization investment programs, we must provide energy that is affordable. We're, therefore, proud that residential rates at our electric utilities remain well below state and national averages.\n\nWe've also found creative approaches to provide customer relief. I'll recap a few recent examples. First, we supported legislation in Virginia, which gave customers a fresh start by forgiving $200 million of customer arrears in the depths of the COVID crisis. We also agreed to more than $11 million of forgiveness in South Carolina.\n\nSecond, we elected to recover $200 million through base rates currently in effect in connection with the suspension of Ryder Regi as Virginia works toward its exit from that program. Lastly, we voluntarily agreed in Virginia to spread the recovery of the under-recovered fuel balance over a three-year period to reduce the effect on customer bills. And we have done all of these things while moving forward with our growth plan and delivering results that met our financial guidance just as we did again this quarter. As you can tell, I'm very proud of these accomplishments, and thank all my Dominion Energy colleagues who contributed to these successes.\n\nBut our work is far from done. There are two drivers behind today's announcement of a review: one, enhancing shareholder value and two, ensuring the sustainability of the long-term scope and duration of our regulated decarbonization investment opportunity. First, enhancing shareholder value. We've been delivering industry-leading safety and reliability performance, executing on our sizable investment programs, achieving regulatory outcomes that are constructive and delivering results that have met our financial guidance.\n\nYet our relative share price performance has not met our expectations, including over the past several years as we've been successfully executing our plan. While I'm confident in our state-regulated utility strategy, and I would add that feedback I get from our investors almost unanimously supports our strategic direction, I believe now is the right time to initiate this review. And second, our company has sizable investment opportunities, focused on decarbonization and reliability that extend well beyond our fove-year plan, in fact, well into the next decade. These customer beneficial programs are part of our diverse energy generation and methane reduction strategies to deliver clean energy, while simultaneously meeting the need for affordable and reliable energy grids and gas distribution networks.\n\nHowever, we need to ensure that near-term economic and customer bill pressures don't preclude the full realization of that energy transition and related long-term capital investment. These two drivers led me to initiate this review of potential value maximizing strategic actions of alternatives to our current business mix and capital allocation. And if any regulatory options, which may assist customers to manage costs and provide greater predictability to our long-term state-regulated utility value proposition. A few guiding principles for this review.\n\nWe're committed to our state-regulated utility profile with an industry-leading investment opportunity focused on decarbonization. We're committed to our current credit profile and to our dividend. And we're committed to shareholder value enhancement and to transparency. Of course, we're constantly evaluating our business mix to make sure we're maximizing shareholder value.\n\nHowever, as we carefully weighed our continued relative share price performance in the past several years, as well as the implications of the current macroeconomic environment, we determined that this more formal and thorough review is the right step at the right time. So let me address what I expect may be natural questions relating to this review. One, the scope; two, timing of milestones; and three, the impact to our financial plan. First, what is the scope of this review? I've tasked our team with reviewing each of our businesses to examine opportunities that would improve long-term shareholder value relative to the status quo.\n\nThis includes a review of where we have capital invested in businesses which may be considered nonstrategic or which simply may be worth more to others than they are within our current regulated business profile. We'll also take a hard look at all options to help our customers manage costs and that provide greater predictability to our long-term state-regulated utility value proposition. We remain focused on the customer impact and advocate for energy policy that provides an affordable clean energy transition and long-term predictability for our state-regulated utilities. Next, what do we expect in terms of timing and milestones? Our team is already getting to work.\n\nWe expect to share updates on our fourth quarter earnings call in early 2023 and plan to hold an Investor Day later in the year to update stakeholders more fully on our plan in the key value drivers of each of our business segments. Finally, what's the impact to our financial plan and guidance? We're reaffirming our 2022 financial guidance. No changes from prior communications, other than a narrowing of our annual EPS guidance range given where we are in the calendar year. For 2023, we see paths to achieving our existing targets as we expect we could overcome the macroeconomic challenges with increased unregulated investment activities and other initiatives.\n\nHowever, these nonregulated earnings drivers, among other parts of our business, are subject to the review we announced this morning. So I would caution that outcomes consistent with our existing guidance are only achievable in a status quo result to our review. While we are, therefore, not changing our guidance today, we are indicating that the results of this review may very well lead to different outcomes, qualitatively and quantitatively of our long-term earnings growth, again, other than in that status quo result to our review. What is not likely to result, however, is a change to the core earnings growth driver of this company, the continued execution of what we view as an industry-leading, highly visible, regulated decarbonization growth capital investment opportunity.\n\nAnd to reiterate, we are not reviewing options which would negatively affect our current dividend. A little more color on the way we think about potential outcomes of this review and to overcoming the headwinds I have noted. We, of course, expect to consider all potential levers we have, which could mitigate any impacts to our financial plan. First, we would look to O&M management, where we've created material value for our customers and shareholders, and as Jim will talk about more in a minute.\n\nSo there's some potential in that area, but not likely a game changer, given what we've already been doing. Next, we would also continue our efforts to efficiently review capital allocation given our robust regulated growth programs, while also carefully considering the customer rate impacts of doing so. As part of this more formal review, however, we will undertake analysis to find the most efficient sources of capital to fund our most attractive utility growth programs, all while considering many factors in the best interest of our EPS growth and credit profile. In summary, our team has continued to deliver in the key areas of safety and reliability, our long-term scope and duration of our regulated decarbonization investment opportunity is very much intact, and we're on track to deliver against our goals for 2022.\n\nWe offer an attractive state-regulated decarbonization investment profile, with operations and growth opportunities focused within premier states with constructive regulatory regimes. However, given our continued relative share price performance and the macroeconomic challenges, we think that this top-to-bottom review is the right approach at the right time to ensure we're best positioned to maximize long-term value for our shareholders. Now I'll turn to other business updates. Turning to Slide 6, let me start with Dominion Energy Virginia.\n\nLast week, we announced a settlement agreement in our petition to the SEC to reconsider the performance guarantee included in its August order in conjunction with the Office of the Attorney General and other parties. The agreement provides a balanced and reasonable approach that allows the project to continue moving forward to meet the Commonwealth's public policy and economic development priorities and the needs of our customers. If approved, significant customer benefits include protection from unforeseen increases in construction costs above the project's budget and enhanced SEC review of performance in lieu of a performance guarantee. We look forward to a decision from the SEC later this year.\n\nLet me now turn to execution of that project, where we have further mitigated some of the project's development risks that strengthen our confidence of remaining on time and on budget. We have continued to work closely with Bureau of Ocean Energy Management and other stakeholders to support the project's time line as we continue to expect to receive a draft environmental impact statement by the end of the year. Advanced engineering and design in preparation of immediate release of major equipment for fabrication. Advanced procurement and other preconstruction activities for the onshore scope of work.\n\nAnd completed independent project review and construction readiness assessment, along with a comprehensive assessment of scheduling costs. Development of the project has continued uninterrupted to maintain the project schedule, and we expect over 90% of the project costs, excluding contingency, to be fixed by the end of the first quarter 2023 at the latest as compared to about 75% today, further derisking the project and its budget. As I have mentioned before, offshore winds, economic development, and jobs benefits are transformative for Eastern Virginia and the rest of the Commonwealth, including its diverse communities. [Inaudible] could create over 2,000 direct and indirect jobs during construction and operations, while attracting companies to make investments in Virginia, making it a hub for offshore wind.\n\nFor example, upgrades have recently commenced at the Portsmouth Marine Terminal, where we've leased 72 acres for staging and preassembly of foundations, transition pieces, and wind turbines. Lastly, our Jones Act-compliant turbine installation vessel is currently over 60% complete. We continue to expect it to be in service ahead of the 2024 turbine installation season. Turning to other notable DEV updates on Slide 9, we made our third clean energy rider submission.\n\nThe filing included 10 solar and energy storage projects, and represented around $1.3 billion of utility-owned and rider-eligible investment, further derisking our growth capital plan. We expect to receive an order from the SCC in the second quarter of 2023. On data centers. As I mentioned on our second quarter earnings call, we're actively working on a variety of solutions to serve as much of the increased demand as possible, while we work to accelerate transmission solutions to ensure a safe and reliable grid.\n\nLast week, we filed for a new 500 kV transmission line with the SCC with an expected in-service date of late 2025. The submission included around $700 million of capital investment. Turning to other business updates on Slide 10. At Dominion Energy South Carolina, our crews worked around the clock in response to Hurricane Ian.\n\nMore than 110,000 Dominion Energy customers in South Carolina lost power at the peak of the hurricane after it made landfall, with up to 85 miles per hour wind and dumped heavy rain across the low country and other parts of our service area. And through the 18 hours, the company had significantly reduced that number to approximately 15,000. The efficient restoration process was possible because of year-round preparation through a proactive vegetation management program, which includes safeguarding overhead electric lines from hazardous trees and vegetation. I'm proud of the way our team members responded on behalf of our customers.\n\nAnd on the regulatory front, last month, we filed our 2022 IRP update. Our preferred plan is indicative of the potential for accelerated decarbonization and assumes all coal-only units are retired by the end of the decade. We look forward to engaging with all stakeholders on this planning process. At Dominion Energy Utah, we will complete the testimony and hearings phases in our rate case in the next few weeks.\n\nWe expect an order from the commission by the end of the year, and new rates to be effective in January of next year. And as it relates to our already industry-leading agricultural-based renewable natural gas platform, we're pleased to update our expanding project backlog. Of the four projects currently producing negative carbon renewable natural gas, one is in service and three are in the commissioning phase. We also have 11 projects in various stages of construction, and expect to start construction on five new projects by year-end.\n\nLooking ahead, we now have visibility on $1 billion of potential growth capital investments in this area from 2023 through 2026. Obviously, we're very much on our way toward our goal of investing up to $2 billion by 2035. We see the potential for additional increases to the long-term backlog. Before I summarize my prepared remarks and turn it over to Jim, I'd like to make a few comments about the organizational change we announced this morning.\n\nSteve Ridge, who currently leads our Western Natural Gas Distribution Operations, will be promoted to senior vice president and chief financial officer, succeeding Jim. After nearly a decade in Energy Investment Banking, Steve, who is here in the room with us today, joined Dominion Energy and has spent the last eight years in leadership roles in mergers and acquisitions, corporate strategy, financial management and investor relations. During much of that time, he worked closely with Jim and me, along with the rest of our senior leadership team. For the last year, he successfully been meeting our Western Gas Operations, which serve nearly 1.2 million customers.\n\nHe has a wealth of experience in finance, is well known to many of our investors, and is a strong, capable leader. We're very fortunate to have him in this new role. Jim will be leaving the company to be vice president and treasurer at ExxonMobil. Jim is an exceptional leader and has been an extraordinary partner of mine.\n\nJim played an instrumental role in our rapid transition to an asset mix largely defined by state-regulated utility operations and a capital plan aimed at decarbonization in support of public policy goals and our commitment to our customers, communities, the environment, and our investors. We're very sorry to see him go, but we wish him good fortune in the next chapter of his career. In the interim, Jim will be helping make a seamless transition, including joining us at the upcoming EEI financial conference. Steve will be there as well, obviously.\n\nSteve will play a critical role in advancing our strategy of delivering value to our customers and shareholders. The depth of leadership of this company is impressive. Steve is a great example of that bench strength. And with that, I'll hand it over to Jim.\n\nJim Chapman -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nThank you, Bob. Those are very kind words, and I really appreciate it. As I mentioned in our release this morning, I'm really grateful for having had the opportunity over 9 years to work with just outstanding people here at Dominion. I'm proud of our accomplishments we made together.\n\nOn behalf of these great companies, customers, and shareholders, more accomplishments to come, of course. And as many of our investors already know very well based on their experience with Steve over the years, I'm definitely handing the CFO reins over to an incredibly capable person. So from one great company to another great company for me, but let's move on, and I'll recap what was a great quarter for Dominion. Our third quarter 2022 operating earnings, as shown on Slide 11, were $1.11 per share, which for this quarter represented normal weather in our utility service areas.\n\nThese results were above the midpoint of our quarterly guidance range. Positive factors as compared to the third quarter last year include increased regulated investment across electric and gas utility programs, sales growth, and margins. Other factors as compared to the prior year include interest expense, tax timing, and share dilution. Third quarter GAAP results of $0.91 per share reflect the noncash mark-to-market impact of economic hedging activities, unrealized changes in the value of our nuclear decommissioning trust funds and other adjustments.\n\nA summary of all adjustments between operating and reported results is included in Schedule 2 of our earnings release kit. Turning now to guidance on Slide 12. For the fourth quarter of 2022, we expect operating earnings to be between $0.98 and $1.13 per share. Positive factors as compared to last year are expected to be returned to normal weather, normal course regulated rider growth, sales growth, the absence of a Millstone planned outage, absence of last year's COVID-deferred O&M, and tax timing.\n\nOther factors as compared to last year are expected to be interest expense and share dilution. Given where we are in the year, we're narrowing our 2022 full year guidance range to $4.03 to $4.18 per share, preserving the same midpoint as our original guidance. Turning now to Slide 13. Of course, the review that we announced this morning is still early, and all the details are still yet to come, but we've given you a sense of how we're thinking about the process.\n\nWe expect to provide formal 2023 guidance on the fourth quarter call, which, like always, will include an annual guidance range to account for variations from normal weather. However, let me share some preliminary drivers for 2023 at this point. Positive factors as compared to '22 are expected to be normal course-regulated rider growth. Millstone margin and sales growth, which has been trending above our long-term target.\n\nWe also have ample opportunities for unregulated investment in areas such as solar and RNG development. And a reminder that both of these areas qualify for ITC benefits under the Inflation Reduction Act. And we're also looking into additional O&M management options. Other factors as compared to '22 are expected to be a second planned outage at Millstone, higher interest expense, share dilution, and pension expense.\n\nLastly, as it relates to the impact of the Inflation Reduction Act, we're continuing to review to see how quickly we can deploy options that are available to lower cost for customers over time. And I would remind you of the very detailed remarks I shared on our second quarter earnings call. So no changes from prior communications. I'd also note that assessing the impact is a difficult process of the treasury guidance and implementation process is still a moving target.\n\nSo more to come here also. In summary, we see a path to achieving our existing guidance, but they are subject to the review. What is not likely to result, however, is a change to the core earnings growth driver of this company, the continued execution of our industry-leading, highly visible, regulated decarbonization growth capital investment program. I'll now turn to other financial highlights.\n\nTurning to Slide 14. Let me address electric sales trends. Weather-normalized sales increased 2.6% over the 12 months through September as compared to the prior year. Components of this growth include a slight decline for residential, as you'd expect, with the continued back-to-work trend, and higher growth for the commercial segment driven by data center customers in Virginia.\n\nFor 2022, we expect to remain above our long-term run rate of 1% to 1.5% per year. We've again provided demand-related earnings sensitivities for our two electric utilities in today's appendix materials. Turning to Slide 15, and briefly on O&M management. For perspective, we've highlighted our electric O&M management relative to peers over time.\n\nAs Bob mentioned, we've created material value for our customers and shareholders in our O&M efforts, something we view as quite an accomplishment. As a reminder, our guidance assumes flat normalized O&M by driving down costs through improved processes, innovative use of technology, and other best practice cost initiatives. It's a dynamic process. We very intentionally go through each of our segments, each of our assets, each of our locations to find opportunities to lean into technology, to improve business processes, and to improve in areas like smart buying across our platform.\n\nAs Bob mentioned, O&M is certainly an area where there is some potential to offset headwinds, but likely not a game changer given what we've obviously been doing already. Turning to Slide 16, we have shown how our floating rate debt and all fixed-rate debt maturities over the next three years compare to peers. As you can see, our repricing exposure in this time frame is very much in line with the peer average. Let me share some color on the way we think about the impact of rising rates on our business.\n\nFirst, we, of course, reflect market expectations, in our planning process and in guidance. We, of course, don't model just flat rates. More than 80% of our balance sheet is fixed rate and is long in duration, over 13 years in average tenure. Next, about 50% of our interest rate exposure, the same floating rate debt and all fixed-rate debt maturities over the next three years is at our regulated utilities, where it is a cost of service.\n\nAs a reminder, about 35% of our existing rate base and over 75% of our growth capital is rider eligible, which allows for timely annual true-ups. Looking ahead to future issuances of long-term debt, we manage that interest rate exposure through a variety of hedging and treasury activities, including through what is nearly $9 billion notional of interest rate hedges, which will help us keep future costs low at our parent company and at our regulated utilities. So what does that mean? That portfolio allows us to lock in treasury rates for issuances between now and 2026 at rates almost as low as 1%. Lastly, a reminder that economic growth and inflation, and higher interest rates are all part of the mix when it comes to determining authorized ROEs across our utility businesses and our periodic rate proceedings.\n\nSo in summary, the current rate environment is dynamic, and we're monitoring it closely. At present, however, we're not seeing an earnings hurt from significantly higher interest rates so far this year as higher rates thus far have generally been offset by the factors I just described. We will certainly provide an update on rates, interest expense, hedging strategies, and other mitigants as we provide an update on our business review and guidance on our fourth quarter call early next year. Turning to Slide 17.\n\nLet me address customer bill. Based on data from the U.S. Census Bureau, the share of our customers' wallet attributable to our utilities customer bill has declined over the years, a testament to our continued focus on delivering affordable energy to our customers despite an overall increase in household income during that time. I'd also note that our improvement in affordability has been tracking far better than national utility averages.\n\nAlso as regards to the starting point for relative rates, we are proud to have rates today that remain well below the national and various regional averages. Now on Slide 18, fuel costs. As Bob mentioned, we are proactively working with regulators to help our customers manage costs. Of course, we've been very -- we have very clear pass-through mechanisms for fuel costs across all of our utilities, but let me share some color on where we stand right now.\n\nAt our two electric utilities, we use a diverse portfolio to generate electricity. That includes many different sources of fuel and also our small but growing renewable fleet that, of course, does not incur fuel costs for our customers. Nuclear power currently represents about 40% of our generation portfolio. And as we grow our renewable fleet and add it to our nuclear fleet, our customers will benefit from carbon-free power at predictable and stable rates that are not exposed to fossil fuel markets and volatility.\n\nWe also have long-standing risk mitigation strategies, including hedging and natural gas storage, with most fuel prices trued up to customer bills on a delayed basis, a structure which helps to smooth out the bill impact of commodity swings. In Virginia, we voluntarily agreed to spread the recovery of the under-recovered fuel balance over a three-year period to reduce the effect on customer bills. In South Carolina, we filed a mid-period fuel adjustment rather than our typical annual cadence to avoid a single significant customer bill increase in the future. If approved and submitted, our typical residential customer bill would increase by approximately 14%, and customers would see the increase in bills beginning in January of 2023.\n\nIn our gas distribution service areas, we utilized storage capacity to offset peak day requirements and proactive gas supply hedging and contract strategies to help customers manage costs. In Ohio, where the majority of the gas is supplied through the third parties, access to storage and lower-cost gas, plus fixed-rate customer contracts, all help mitigate gas price exposure. In our Western states, our unique cost of service gas production also helps customers avoid price spikes. In aggregate, as of September 30th, we have an under-collected balance of approximately $2 billion in fuel costs.\n\nWe are working proactively with regulators to address these costs, and we'll continue to use these and other mitigation measures to keep any increase to customer bills as muted as possible. OK. Turning to 19, and briefly on credit. We have positioned Dominion Energy as an increasingly pure-play, state-regulated utility, with the differentiated clean energy transition profile.\n\nOur efforts to improve our credit profile in recent years have significantly improved our financial and business risk profiles. This continued shift toward a regulated utility profile has resulted historically in the reduction of our credit metric downgrade and upgrade threshold. We've shown here how our credit metric upgrade and downgrade threshold at Moody's compares to our large-cap integrated peers. Of course, company-specific circumstances dictate threshold differences.\n\nGenerally, those with lower downgrade thresholds have limited nonutility holdings, scale, and diversity and are operating in attractive states with constructive regulatory relationships. We believe the agencies will continue to consider the intentional derisking of our business profile as they assess our credit going forward. Looking ahead, we expect our credit guidance will be unchanged. We target high BBB range at our parent and single A range at our opcos.\n\nWith that, let me summarize our remarks on Slide 20. Safety remains our top priority and is our first core value. We delivered quarterly results that were above the midpoint of our guidance range. We narrowed the range of our 2022 earnings guidance and are on track to meet that guidance.\n\nWe continue to aggressively execute on our decarbonization and investment programs to meet our customers' needs, while creating jobs and spurring new business growth. We filed a settlement agreement that provides a balanced and reasonable approach that allows our offshore wind project to continue moving forward on schedule and on budget. And we are pursuing a top-to-bottom business review, with the goal of ensuring that Dominion Energy is best positioned to create significant long-term value for our shareholders. Lastly, Bob, Diane, Steve, David, and I, we all look forward to seeing many of you in person at the EEI Financial Conference in about 10 days.\n\nAnd with that, we're ready to take questions.\n\nOperator\n\n[Operator instructions] now. Our first question comes from Shar Pourreza from Guggenheim Partners. Your line is open.\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nHey. Good morning. Hey. Good morning, guys.\n\nBob Blue -- President, Chairman, and Chief Executive Officer\n\nGood morning, Shar.\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nFirst, congrats, obviously, to Jim and Stephen. I guess, this means Mr. Ridge's park city skiing days are over with, but congrats to both you guys. Bob, if you can maybe elaborate a little bit on your prepared remarks as you're looking at sort of a range of scenarios.\n\nI think many would assume you start with looking at a monetization of the contracted assets. But in our view, they're really not why you're trading at a discount or why the stocks underperformed, some would argue the performance maybe driven by local politics. I guess, could we see more drastic actions like divestitures where you would only focus on Virginia or even a sale of the company to really maximize shareholder value? I guess, what is this going to look like in the end? And it seems like an update in February is a very tight time frame. So I guess, are you really progressed in this process? Thanks.\n\nBob Blue -- President, Chairman, and Chief Executive Officer\n\nThanks, Shar. Let me take the last part of that first. This is not about corporate M&A, if that's what you're asking about. This is about a business review, a top-to-bottom business review as we made clear in our prepared remarks, looking at strategies that maximize value, business mix, capital allocation, all those kinds of things.\n\nAnd we're going to make decisions as we would any strategic decision we make with respect to the company and what's in the best interest of our shareholders, of our employees, and of our customers. Fundamentally, we took a look at how we're doing, how our share price is doing. And the market is telling us that we're not performing the way investors expect. And so we think it merits a complete review from top to bottom.\n\nWe're early in the process. And we're going to, obviously, in addition to shareholder value and our share price performance, be thinking about the macroeconomic environment we're in and making sure that we can deliver on our growth program to the level that we expect. So we laid out in the opening remarks, and I'll just reiterate, as we're guided by our commitment to our state-regulated utility profile, to our credit profile, and our current dividend and to transparency in ensuring shareholder value. So as we thought about it, we could keep on the same course.\n\nAs we said, we have a path to 2023. Some would suggest that doing the same thing over and over and expecting a different result doesn't make a lot of sense, or we could have just announced something. But we thought it made a lot more sense to announce that we're doing this review, get some shareholder input and figure out what's right for our shareholders, our employees and our customers going forward in the long run.\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nGot it. And then just lastly, Bob, just on the 6.5% growth rate you have out there. Obviously, you're implying on Slide 13 in your prepared remarks that you could change the target pending the review. Obviously, the share price reaction this morning is implying a cut in the growth rate.\n\nBut could a scenario actually be accretive or even supportive of the target you have out there, especially if we assume the trend with privates and financial players, paying relatively healthy multiples for assets with proceeds you can redeploy organically at onetime rate base. I mean, does the deal need to be dilutive to growth? Are you concerned about the numbers?\n\nBob Blue -- President, Chairman, and Chief Executive Officer\n\nYeah. We're obviously closer to the beginning of this process than the end. So we're going to have to work our way through and see what the ultimate outcome is before I can comment on that, Shar. And I understand your interest in getting more clarity in that today.\n\nBut until we've done the process, that question is impossible for us to answer. Again, I would go back to the fact that we're very focused on earnings quality and earnings predictability. That's what our shareholders are telling us they want. That's what we're going to focus on as we're going through this review.\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nOk. Terrific. Thank you, guys. I'll jump back in the queue.\n\nAppreciate it.\n\nOperator\n\nAnd our next question comes from Ross Fowler from UBS. Your line is open.\n\nRoss Fowler -- UBS -- Analyst\n\nGood morning, Bob, Diane, and Jim.\n\nBob Blue -- President, Chairman, and Chief Executive Officer\n\nGood morning.\n\nRoss Fowler -- UBS -- Analyst\n\nMaybe shifting to offshore wind. I'm sure there's going to be a lot of other questions on the strategic review. But just touching on offshore wind for a minute. As we look at Slide 6 and then sort of Slide 8 in the deck, I think getting the settlement done, obviously, it still needs to be approved.\n\nSort of shifts, investors' thoughts of risk from sort of that performance guarantee around capacity factor and now there's a shift to cost. So maybe you can frame the risk to cost from here given the cost sharing arrangement? And then the second sort of part of the question is you say 75% fixed as of today and then working to that 90% in the first quarter next year. Can you kind of just give us some framework, what has fixed actually imply or mean? Is that locked and settled? Can that move at all? What we have there ex the contingency?\n\nBob Blue -- President, Chairman, and Chief Executive Officer\n\nYeah. Let me start with the first part of your question. And as we said on the last call, the performance guarantee put a level of risk that our investors we knew would not find satisfactory, didn't make any sense. We've been focused on the cost of constructing this project from the very moment we conceived it.\n\nThat's what we do. We built Cove Point on time and on budget, and we absolutely expect we're going to build this project on time and on budget the same way. And we're very advanced in the development here. And as you noted, and as we said in our opening remarks, 75% of costs fixed, expecting 90% by early in 2023.\n\nSo we're very much on target. We're very comfortable with the estimates. The amount of contingency has actually increased since the time we filed, which gives us even more confidence. As we said in our opening remarks, we're working very well with the regulators, working our way through the environmental permitting process.\n\nSo project is very much on track. We have a high degree of confidence in our ability to build it on time and on budget. And I'm going to ask Diane to walk through a little bit more detail on that.\n\nDiane Leopold -- Executive Vice President and Chief Operating Officer\n\nOK. So let me just give a little bit more color to the different aspects of the project. Kind of as you walk through, the first thing would be permitting. And as Bob just said, we're working through the process of the draft environmental impact statement.\n\nIt is on time to come out by the end of this year. And we're working closely with the regulators with DOM and with NOA in addressing issues as they come up to minimize any risk of schedule issues. And then I'd want to remind you, we really focused on derisking the schedule from the start by having two piling seasons, two construction seasons to put those monopiles down. So we don't even install the turbines until the second season.\n\nSo that allows for derisking in the construction, and we look at that as we move forward with the project. The next are our vendors and our suppliers, and we picked the worldwide experts in the offshore wind industry to ensure that we weren't adding any risk in our contracting. And of course, they were fixed-price contracts. And as we move through the pieces that were variable in the offshore were commodities and fuel, and that's where you see 75% fixed as of now.\n\nSo as we're looking to continue to move toward fabrication, we have all the manufacturing slots nailed down, much of the steel plate has been ordered and deliveries have actually already started. In fact, fabrications for our offshore substations and our cables have already begun. So that's as you're seeing the 75% move to the 90%, that's what's going on. The mills are operational.\n\nOur vendors are not concerned with them shutting down due to fuel issues in Europe, anything like that. And as Bob said, as we've looked at the entire projects throughout this time, we've been able to preserve and even add to our contingency. So we're feeling very good about where we are. On the -- so I think I've really answered that additional question of ramping from 75% to 90%.\n\nIt's really as we're getting those deliveries and locking in the remaining part of the metals and the fuel. And the final piece of moving from that 75% to 90% is on the onshore side, on that onshore transmission and locking in those contracts.\n\nRoss Fowler -- UBS -- Analyst\n\nAnd then, Bob, maybe one for you on the strategic review, just following up to Shar's question on the growth rate. I'm trying to just sort of understand what you're trying to communicate there with a little more clarity. 6.5% was where you were, what you're saying for '23, right, in the long-term growth rate. And you see a path to that today absent the strategic review.\n\nAnd I don't want to put words in your mouth here, but I think what I heard you say was the results of the strategic review could be to different outcomes in 2023. And then you have to think about what the long-term growth will look like after that. But your rate base growth at the regulated utilities is about 9%, which is higher than 6.5%, and so if that's your focus, I think that's a good thing. And I don't think you're saying here today that you're going to do things in the strategic review that are dilutive to value.\n\nBob Blue -- President, Chairman, and Chief Executive Officer\n\nYes. I think what we're saying, again, I know you're looking for certainty here, but it's early days and we're just getting started. So what we are focused on, you've correctly identified is regulated high-quality earnings, predictable earnings going forward. How the numbers all settle out at the end of it, we'll report when that time comes.\n\nSo that's why we're saying today, we have a path and a status quo scenario, but the outcome of the review could lead to different growth qualitatively and quantitatively.\n\nRoss Fowler -- UBS -- Analyst\n\nOK. Thank you. I'll come back in queue.\n\nOperator\n\nAnd our next question comes from Steve Fleishman from Wolfe Research. Your line is open.\n\nSteve Fleishman -- Wolfe Research -- Analyst\n\nYes. Good morning. Hi, Bob. So just first on the kind of status quo scenario.\n\nI think for '23, you mentioned that you could do it, but you would need to do more unregulated investment. Could you just comment a little more on what you mean by that?\n\nBob Blue -- President, Chairman, and Chief Executive Officer\n\nYeah. Let me get Jim to walk through the pieces and parts on that.\n\nJim Chapman -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nYes, Steve. Let me go through it a little bit higher level than your specific question, but I'll address that, too. So what's going on with our guidance? So for 2022 -- I know it's not your question, but for '22, we affirmed, we narrowed, we're on track, EPS and credit for '22. For 2023, we never give forward year specific guidance on our third quarter call, and we're not doing it this time either.\n\nI'll come back and talk about that in some more detail though to give some color. And then for our long-term growth rate, we haven't changed it. We haven't withdrawn it. But as you noted, we also haven't explicitly reaffirmed it given the review.\n\nBut we see these paths as we show on Slide 13, path to achieving our long-term guidance and tools we have to overcome some of the macroeconomic headwinds that Bob mentioned, with increased investment on the unregulated side and other initiatives. But some of those tools and businesses are the same ones that are subject to this review. Of course, everything is subject for review. So Bob, as he mentioned in his prepared remarks, cautioned that long-term outcomes consistent with our existing guidance are really achievable in the status quo result to the review.\n\nSo anyway, long story short, that's the color on the '22, '23 and long term. But on the Slide 13, we give drivers for 2023 targets. So let me walk through and provide some detail on each line item that's in our path to make our 6.5% into 2023. So $4.10 for '22, that's the midpoint of our guidance that we just narrowed and 6.5% of the simple math is, of course, implies and our consensus analyst consensus is $4.37.\n\nSo $4.10 to $4.37. And of course, there are some helps and some hurts to bridge that. So let's go through those as listed on that slide. Sales growth.\n\nSales growth we talked about on the electric side is clipping along at a healthy rate, 1% to 1.5%, slightly higher on the data center side. But that financial impact, together with the impact of margin, is probably flat. And we've given some additional detail on margin dynamics, including Virginia, on Slide 31. We're happy to follow up after the call and walk through all that.\n\nThe combination of those two things, flat. Regulated investment, we talked about is the long-term earnings growth driver for this company, call it, $0.27 year over year. Rough number, $6 billion of growth capex, 50% equity ratio, 10% ROE across all our businesses. Millstone margins, $0.08 year on year, help.\n\nAnd here, too, we provided additional disclosure on Page 32 of our hedging position for Millstone for the next several years, $0.08. ITC, an increase in ITC, we have opportunities to complete projects and increase our ITC contribution in 2023. That could be in solar, as we've been doing in mid-teens for years now, or it could be an RNG ITC recognition. So $0.05 to $0.11 as a placeholder.\n\nAnd for RNG, that would assume sort of $200 million to $400 million of projects reaching COD in 2023. Then other, the last help I mention, other. $0.17 to $0.20, a lot of things in there. It includes O&M initiatives.\n\nIt includes regulatory outcomes, including in Utah. -- some help on the Wexpro side, RNG non-IT contribution, and other. But in that bucket, $0.7 to $0.20, a quarter of that impact is just the regulatory outcome in Utah. And then some hurts that we have been mentioned, the double outage at Millstone every three years, like clockwork, $0.06.\n\nInterest expense, let's just take numbers from the outside looking in. We have a lot of tools at our disposal for hedging and more dynamic management of this. But if you just say, OK, almost 20% of your debt balance is variable. Let's just say, rates year on year are up two to three percentage points, that would be $0.13 to $0.19 of hurt, and then share dilution modest $0.03.\n\nFinally, pension we talked about. For most of this year, I've been saying it's too early to talk about pension. Only one date matters in pension world for us, 12/31. But as we sit here in November, it's coming closer, so we can kind of put it in a box, and there's a headwind.\n\nOur assets are down like everybody, our discount rate is up 2.5% or so like everybody. The headwind from that is modest. We're putting it in the high single-digit pennies range, so $0.06 to $0.09. So those are views on one path we have to continue along the 6.5% growth rate through '23 and formal guidance along with updates on the status of our review will come on the fourth quarter call.\n\nSteve Fleishman -- Wolfe Research -- Analyst\n\nOK. Sorry. I have one other question. I didn't expect such a long answer, but that was helpful.\n\nThank you.\n\nJim Chapman -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nMy last chance to talk to you for a while.\n\nSteve Fleishman -- Wolfe Research -- Analyst\n\nYeah. So just, I guess, this is a bit of an unorthodox way of going about something like this. But just to try to put some perspective on how you're looking at things in this review. What do you, Bob, and the board think the reasons are the stock is underperforming? Do you think it's due to the small amount of remaining nonutility businesses? Or is it really, is it Virginia and the kind of unique structure there, some of the noise you had? Is it the offshore wind? Like what do you -- it's kind of hard to have a perspective on this review if we don't know what you think the reasons are.\n\nBob Blue -- President, Chairman, and Chief Executive Officer\n\nYeah, Steve. I think it could be a little bit of all of the above of what you just described. Maybe I'd phrase it a different way is what investors are telling us they're looking for, what they're looking for is predictability. What they're looking for is earnings quality.\n\nThey're looking for confidence in long-term growth. And so again, as we go through the review, those are the things that we're going to focus on to try to achieve for investors.\n\nSteve Fleishman -- Wolfe Research -- Analyst\n\nOK. I mean, obviously, by doing this, you've created more unpredictability. So it's got hard to -- it becomes kind of like a circular loop here.\n\nBob Blue -- President, Chairman, and Chief Executive Officer\n\nSteve, what I would say, maybe it's unorthodox, although I think other companies have announced reviews, maybe it's a little unorthodox. But again, as I talked about before, continuing to do the same thing we've been doing may well just end up in the same results that we've achieved before. And we're going to listen to the market. And we look forward to the opportunity to engage with investors and get their perspectives as we're working our way through this.\n\nAgain, our goal with this is to land on an outcome that provides predictability and quality, and we want to do it in a very transparent fashion.\n\nSteve Fleishman -- Wolfe Research -- Analyst\n\nOK. Thank you.\n\nOperator\n\nAnd our next question comes from Jeremy Tonet from J.P. Morgan. Your line is open.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nHi. Good morning.\n\nBob Blue -- President, Chairman, and Chief Executive Officer\n\nHey, Jeremy.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nI just want to continue with the review a bit here, if I could. I just wanted to see, maybe asking a little bit differently, what options might be off the table here, beyond the nonregulated businesses, could you look to sell some of the LDCs here and we've seen others in the space with a lot of success on this side? And then separately, just as it relates to the customer build pressures, as you said. If you could address, what steps could be taken by Dominion to address that? And is there a way to address that, that isn't EPS or credit negative?\n\nBob Blue -- President, Chairman, and Chief Executive Officer\n\nYeah. So let me start with the first one, Jeremy, what's off the table versus what's on the table. And the answer to what's off the table is the same as the answer to what's on, which is we've kicked off a review, top to bottom, and again, guided by the principles that we described in our opening comments. And then on the second part of your question, sort of policy initiatives, we described examples of things that we have done in our states over the course of the last few years to help customers, whether it was forgiving arrears, recovering reg costs through base rates, spreading out fuel over multiple periods of time.\n\nAs we work with policymakers and think through the most logical ways to assure that current customer bills don't get in the way of long-term customer investment, we'll be thinking about those same approaches that we've used in the past and making sure that we achieve constructive regulatory outcomes, which I think we've demonstrated over the course of many years we're very good at achieving here.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nGot it. That's very helpful. And just pivoting, if I could here. Obviously, a lot of focus on the review, but I just want to touch base on the R&D side and see what kind of new initiatives are there, or if you could just update us on your thoughts.\n\nDiane Leopold -- Executive Vice President and Chief Operating Officer\n\nGood morning, Jeremy. This is Diane. So the backlog just continues. It's going very well.\n\nAs Bob brought up, if you do the count, we have 20 projects underway right now, four producing, 11 under construction and five more to be in construction by year-end. And those that are producing are producing as designed, and we're seeing very strong CARB scores out of them. So just how carbon negative they are, just focusing on this ag RNG business in the dairy and the swine side. So we have invested or will have invested $1 billion in this and expected to produce somewhere in the range of about $200 million by 2025.\n\nSo it's going very well.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nGot it. Great. If I could sneak a last quick one, and just going back with the review here. Does the upcoming triennial impact your thought process at all here?\n\nBob Blue -- President, Chairman, and Chief Executive Officer\n\nNo. Again, there are a lot of factors at play in our business and you can't identify any one of them. Where as we said, the focus is our share performance and what can we do to make sure we maintain our long-term capital investment programs.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDavid McFarland -- Vice President, Investor Relations\n\nBob Blue -- President, Chairman, and Chief Executive Officer\n\nJim Chapman -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nRoss Fowler -- UBS -- Analyst\n\nDiane Leopold -- Executive Vice President and Chief Operating Officer\n\nSteve Fleishman -- Wolfe Research -- Analyst\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nMore D analysis\n\nAll earnings call transcripts"
}