{
  "companyName": "The Trade Desk",
  "companyTicker": "TTD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/the-trade-desk-ttd-q3-2022-earnings-call-transcrip/",
  "content": "The Trade Desk (TTD -1.12%)\nQ3 2022 Earnings Call\nNov 09, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to The Trade Desk's third-quarter 2022 earnings conference call. At this time, all participants have been placed on a listen-only mode. And we will open up the floor for questions and comments after the presentation. It is now my pleasure to turn the floor over to your host, Chris Toth, vice president, investor relations.\n\nSir, the floor is yours. \n\nChris Toth -- Vice President, Investor Relations\n\nThank you, operator. Hello, and good day to everyone. Welcome to The Trade Desk third-quarter 2022 earnings conference call. On the call today, from our Singapore office, our founder and CEO, Jeff Green; chief financial officer, Blake Grayson; and our chief revenue officer, Tim Sims.\n\nA copy of our earnings press release can be found on our website at thetradedesk.com in the Investor Relations section. Before we begin, I would like to remind you that except for historical information, some of the discussion and our responses in Q&A may contain forward-looking statements, which are dependent upon certain risks and uncertainties. These forward-looking statements represent our beliefs and assumptions only as of the date such statements are made. Actual results may vary significantly, and we expressly assume no obligation to update any forward-looking statements.\n\nShould any of our beliefs or assumptions prove to be incorrect, actual financial results could differ materially from our projections or those implied by these forward-looking statements. I encourage you to refer to the risk factors referenced in our press release and included in our most recent SEC filings. In addition to reporting our GAAP financial results, we present supplemental non-GAAP financial data. A reconciliation of the GAAP to non-GAAP measures can be found in our earnings press release.\n\nWe believe that providing non-GAAP measures, combined with our GAAP results, provides a more meaningful representation of the company's operational performance. With that, I'll now turn the call over to founder and CEO, Jeff Green. Jeff. \n\nJeff Green -- Founder and Chief Executive Officer\n\nThanks, Chris, and thank you all for joining us. As Chris mentioned, I'm thrilled to be speaking with you today from our Singapore office, our South Asia headquarters. This is the first time that I have been in Asia since January of 2020 due to the global pandemic. And it's been great to reconnect with our team, our clients, and our partners here in person this week.\n\nAsia, as a whole, is crucial to our long-term growth, and it's always inspiring to spend time here. More on that later, but first, on to our results. As you've seen in the release, The Trade Desk posted another very strong quarter with revenue growth up 31% year over year. We continue to gain share as advertisers embrace vision and relevance of data-driven advertising on the open internet via our platform.\n\nThroughout 2022 and in particular, in Q3, The Trade Desk has significantly outperformed seemingly all other forms of digital with a significant contrast to walled gardens in our ability to win advertising budgets. It is very clear that under the current operating conditions, we are significantly outpacing the market regardless of the macro environment. Our vision and business strategy continues to be validated by our advertising clients. Nearly every single major advertiser wants a world where the open internet thrives, where competition and price discovery thrive.\n\nThey want great measurement that works across the web so that they can compare the performance of each site app or destination to all the others. They want an internet where relative value can be found. As we've predicted, CTV is a catalyst for massive change on the internet. When possible, the power balance is shifting to the open internet away from opaque walled gardens and systems that aren't comparable to others.\n\nIn short, more and more, our clients embrace the value of the open internet compared to the limitations of walled gardens, and they are embracing The Trade Desk as the default platform to execute on the open internet. This is resulting in closer relationships with the largest brands and agencies in the world. Our client relationships are stronger than ever because they are based on shared values and goals, a strong buy-side road map, and internet where relative value and objective measurement can thrive with data-driven empowerment for brands and advertisers rather than a tech company who is just asking the brand or agency to outsource media buying to them and send their first-party data down a one-way street. Because of this contrast, we are signing joint business plans with brands at a record pace.\n\nSome of the largest JBPs signed this year represent spend of over $1 billion in the future. In this way, not only do these JBPs position The Trade Desk for future growth, but they also create environment for joint programmatic innovation. JBPs represent strong alignment with brands that only come as a result of not owning media. Whether it's decision CTV, new approaches to identity, unleashing first-party data, advanced data and retail marketplaces, our clients are working with us to pioneer the future of digital advertising.\n\nWith this context, hopefully, you can see why we continue to outperform the industry and gain share and why we are confident that our future growth outpaces the projections of almost everyone else in our industry. Just one more data point on the market overall and how we are performing. WPP's GroupM predicted worldwide advertising will increase 8.4% in 2022, and we are growing at more than three times that rate. CTV continues to be a key growth driver, and our shopper marketing initiatives are yielding very encouraging results.\n\nWhile still early, it's only our third full quarter, total shopper marketing spend increased nearly 3x from Q2 to Q3. As we said at Investor Day, we believe that more than 80% of the largest retailers in the United States partner with The Trade Desk, and more of the world's leading retailers are also now following suit. The cores of retailers making retail measurement available is furthering the power and benefits of an open, competitive internet. While CTV may be the biggest force of change for the open internet, perhaps, retail media and its accompanying data is a close second.\n\nPolitical also continues to perform well. Midterm election -- over midterm election, we have exponentially grown our business. We're proud of the work we do in political advertising, particularly our focus on helping provide a better advertising process for all political candidates. We are an objective and independent platform, open to registered candidates on both sides.\n\nWith all of this in mind, I believe that through the first nine months of the year, we have gained more market share, grabbed more land than at any point in our history. To provide more color on why, I'd like to touch on three areas. First, is the growing importance of programmatic on the open internet even in a volatile macro environment. Second, is the transformational role of CTV in showcasing that value.\n\nAnd last, is the critical mass of support that is growing Unified ID 2 and why this is so important in building the new identity fabric of the internet. So, first, in terms of the macro environment, increasingly, advertisers view programmatic as one of the most effective ways to drive relevance and differentiation, especially in times of market volatility. And perhaps even more importantly, they believe that the open internet is the best place to create that value compared to the limitations of the walled gardens. You only have to look at a couple of comments made by the CFO of P&G during the most recent earnings call a couple of weeks ago.\n\nAs you may know, Procter & Gamble is one of the world's largest and most progressive advertisers. He said, and I quote, \"It is difficult to describe media sufficiency in dollars, especially when we are actively shifting our spending from linear nontargeted TV into programmatic and into digital spend that is a lot more targeted and a lot more precise in terms of delivering reach and quality of reach where we need it.\" We now have more than 50% of our media spend in digital. We are increasing our first-party data and our digital capabilities to increase precision of reach, not only in the U.S. or in Europe but around the world, and that is allowing us to drive significant productivity while increasing reach -- while increasing quality of reach and while more precisely targeting our consumers.\n\nBack in early 2020, as we entered that short-lived COVID dip, I talked about how easy it was for large brands to turn off programmatic with the first hand of uncertainty. But what you're hearing from P&G there and what I hear from major brands around the world every day now is that programmatic is a central and critical component of any campaign. The world's most sophisticated advertisers understand that as they get more pressure from their CFOs to demonstrate the value and return of every advertising dollar, one of the best places to do that is on our platform. We provide objective, transparent measurement.\n\nWe provide precision and relevance. We allow advertisers to optimize based on real-time performance, and we provide access to the world's most advanced data marketplace including many of the world's biggest retailers. CMOs and CFOs are carefully watching cost and spend at this moment. It is why we are particularly excited by the growth on our platform this quarter.\n\nThis moment is also a time when advertisers have clear goals, and our objective partnership is really important to them achieving those goals. We recently ran a campaign for Clarence, one of the world's largest multinational cosmetic companies. They wanted to reach career women with a specific new product in the U.K. They wanted to do it cost effectively with minimal waste with optimal precision.\n\nUsing our platform, they were able to launch a multichannel campaign, including mobile, CTV, digital out-of-home and audio. They were able to pivot based on channel performance and retarget based on engagement. As a result, they were able to drive significant new traffic to their website, 8% of whom purchased the product, driving an exponential sales increase, all as part of a highly decisioned campaign that was automatically optimized on the fly to maximize performance and minimize waste. In an environment with ROI scrutiny of every advertising dollar, this is exactly the kind of campaign optimization that CMOs are looking for.\n\nAnd as a result, they are increasingly gravitating to our platform. Nowhere is this more apparent than CTV, the second area I want to cover. Once again, CTV was our fastest-growing channel, and it has rapidly become our largest. For years now, we've been talking about how the English-speaking markets have been leading the adoption of CTV advertising.\n\nThe U.S. and Australia have been great leaders and case studies for the world, both benefiting from the fragmented and competitive nature of content in their markets, but now CTV adoption is going global. Perhaps the most bullish statement I'll make this year is that our CTV spend grew in the majority of our international markets faster than it did in the United States. I've said previously that the U.S.\n\nand Australia are leading the way on CTV and that markets like the U.K. and France are following fast, but that pace is picking up in all corners of the world, especially as advertisers look for more relevance and precision in their biggest campaign category. Let me give you a couple of quick examples. When Mercedes launched a new C class model in Australia this year, they wanted to lift brand awareness among the key demographics.\n\nWorking with us, they were able to deploy a CTV strategy that reached 1.5 million households with precision and which, ultimately, increased brand awareness 11% among their key targets. ViewSonic is a multinational electronics company headquartered in Taiwan. They wanted to launch a new monitor aimed at gamers in key markets such as India, the Philippines, Germany and U.K. Working with us, they launched a CTV campaign, which was constantly optimized via Koa on our platform, letting them iterate based on campaign performance and engagement.\n\nThey saw significant improvements in all aspects of the campaign performance from reach to cost effectiveness compared to industry benchmarks. They were also able to link thousands of new engagements on their product website directly to the campaign. Back in the U.S., Lexus wanted to reach a new generation of millennial buyers for their luxury cars, most of whom have abandoned linear TV and moved in mass to streaming platforms. They were able to target key audiences with little to no waste and effective frequency management.\n\nThey were able to reach 15 million potential new customers driving five times more website traffic than the previous year with an astonishing 67% improvement in purchase intent among key targets. Our success in CTV is multifaceted. On our platform, we have built the optimization tools that enable advertisers to drive these kinds of results with precision as part of an omnichannel strategy. But on the inventory side, we have developed very close working partnerships with pretty much every premium CTV provider worldwide.\n\nWhile much has been said about Netflix moving to advertising, and we are excited about what that opportunity means for our industry and our business, there are many leading content providers that are driving innovation in CTV. Not enough has been said in recent months about what is happening from the content creators who have long histories in advertising and what they're doing to continue to innovate. Disney will launch advertising on the Disney+ platform in December, and they are incredibly progressive in how they are enabling advertisers to leverage their own first-party data via UID2. We are very proud to be their partner.\n\nTransaction volume will grow over time, and their standards on ad load and the use of UID2 will put pressure on the rest of the industry to think about CTV in a way that maximizes advertiser value and optimizes the consumers' experience. Peacock is one of our longest-standing CTV partners. As with many broadcasters who begin the CTV journey, much of our work with them was initially in a fixed price context, testing the market. But I'm thrilled to report today the vast majority of Peacock inventory that flows through our system is fully decisioned and biddable.\n\nAnd as a result, CPMs have increased significantly, while advertisers are spending more and, of course, seeing more value. CTV providers that understand the benefits and gains of fully biddable and decisioned inventory will win over time. They will maximize revenue by helping advertisers drive precision and relevance. UID2 is rapidly emerging as a key new CTV identity currency as I predicted it would.\n\nLet's remember that cookies are not present in CTV. There's nothing about the role of UID2 in CTV that is a response to the deprecation of cookies. Rather, it is recognition among CTV leaders that they need a way to provide advertisers with relevance in a way that protects consumer privacy as part of omnichannel campaigns. One of the first CTV platforms to embrace UID2 was Fubo, and the results they've seen have been incredibly impressive.\n\nFubo itself has seen ad revenues on our platform increase 113% faster than impression growth. Advertising spend on Fubo on our platform has increased more than 60%, and CPMs are up significantly. And with UID2, they are also able to deliver more value to advertisers. One e-commerce retailer saw a 25% in conversion rate and a 14% improvement in return on ad spend.\n\nThere is a tremendous amount of transformation happening in our industry and on our platform. The adoption of UID2 by the infrastructure of the internet is transforming the open internet and where marketers put their very first dollar. In the coming quarters, we will talk more about all the amazing changes happening in identity, often driven by CTV. 2023 will likely have more market changes that create secular shifts in our direction with more data, more decisioning, better results, and the best CTV experience consumers could ever have.\n\nOne of the key factors in our progress with UID2 has been our success with the world's leading data aggregators such as AWS, Snowflake, Salesforce, Adobe, and many, many others. Put simply, these companies house the first-party data of the world's leading advertisers. With UID2, advertisers can transact on that data without it ever leaving home. Because of this progress, I predict that more than half of the data inventory flowing through our platform by early next year will be UID2 tagged with more and more of our publishers' inventory also UID-tagged.\n\nThat means the value of advertiser first-party data increases exponentially on our platform, more than 10x next year compared to this year. With this progress, the strategic value of UID2 in helping advertisers drive relevance in a privacy-centric manner becomes undeniable. While most of our advertisers are already transacting on UID2 on our platform in some way, I expect they will fully embrace it next year. Because we've done the hard work on the data and the inventory side, advertisers now have every incentive to fully unleash the first-party data in a way that will supercharge their campaigns.\n\nThey will finally be able to realize the value of their first-party data to model and understand where their next-generation and most loyal customers are and reach those customers with precision and, of course, do that more effectively than ever. This gives me tremendous confidence for 2023 and beyond. I'd like to close by just touching on our business here in Asia, as I've spent time with our teams here over the last few days. We are seeing great momentum across the region.\n\nWe have recently posted some of the biggest months ever in offices such as Melbourne and New Delhi as we have benefited from new JBPs and MSAs across the region. We have built strategic partnerships with major inventory players in all of our key markets here. As I said during Investor Day, most publishers I speak with complain that they do not believe that they are getting their fair share of spend today relative to the walled gardens. That's true here in Asia, too.\n\nI met with one of the largest publishers here, and they understand they need to maximize revenue on their digital content, but they need greater access to global advertiser demand. Many inventory partners in Asia are facing the same problem. As a result, they are looking to partner with The Trade Desk, a partner they can trust to be objective and transparent in delivering maximum advertiser value. On the demand side, Asia is witnessing the emergence of the largest middle-class population in history.\n\nIt is essential for brands to reach these consumers through the channels they use most. And in Asia, that means CTV or OTT or mobile and, of course, premium video on mobile. Because we made investments early across the Asia Pacific region and in many key channels such as mobile, OTT, and digital out-of-home, we are in a great position to build on those investments in the years ahead. To come back to where I started, in Asia and around the world, the biggest brands in the world increasingly appreciate the value of data-driven advertising on our platform. We have established trust with advertisers and their agencies that we can deliver growth for their business in any macroeconomic environment.\n\nMany of them are now trusting us with significant multiyear partnerships. This means we have very high client retention rates. It means we can innovate with our clients to deliver premium value. Our focus on profitability funds that innovation and ensures that we will remain at the bleeding edge of our industry and that we never have to compromise our beliefs.\n\nAs a result, we are one of the few high-growth technology companies that consistently generate strong adjusted EBITDA and free cash flow. While I don't often comment on competitors' performance, I do think it's worth noting again that in an environment where many of our competitors have contracted or grew in the single-digit range, we grew 31%. That shows that we are outperforming the market and that we're gaining share even in what many are calling a challenging macro environment. While we will never be immune from those macro challenges, we are confident that we will continue to outperform.\n\nI could not be more confident and excited about how we are positioned for 2023 and beyond. Our business has many growth drivers, as we've discussed today, and we will continue to innovate to lead the market. And I'm confident that the world's leading advertisers will continue to default to our platform as they seek to drive their own business growth via advertising. With that, I'll hand the call over to Blake, who will give you more color on the quarter. \n\nBlake Grayson -- Chief Financial Officer\n\nThank you, Jeff, and good morning, everyone. First, it was great to see so many of you at our Investor Day last month in New York City. We always appreciate the opportunity to dive deeper into the drivers of our business and discuss our strategy in more detail. As our performance in Q3 shows, we continue to execute extremely well in the current environment.\n\nWe continue to grab share and significantly outpace our peers. We, again, delivered year-over-year revenue growth well into the double digits while many companies in the ad-funded space have seen low single-digit or even negative year-over-year revenue growth. We've also managed our expenses efficiently, delivering strong adjusted EBITDA and cash flow. Once again, our results reflect the continued shift from advertisers toward data-driven advertising and the open internet as they continue to shift away from linear channels and walled gardens.\n\nRevenue in Q3 was $395 million, representing an increase of 31% year over year. While the macro environment has created some uncertainty, which we are not immune to, our platform continues to deliver value for advertisers, and we are building trust with our clients for the long term. During the quarter, growth was broad-based across channels and verticals. We saw continued strength from CTV, which again led our growth from a scale channel perspective.\n\nWe're seeing progress in our shopper marketing business as our customers deploy retail data in more and more of their campaigns. And we continue to see positive results as advertisers utilize Solimar to sharpen campaign goals and activate our industry-leading AI. Q3 was another example of our ability to grow top line while scaling our cost structure efficiently, helping to drive meaningfully positive EBITDA and cash flow. Third-quarter adjusted EBITDA was $163 million, representing a margin of 41%.\n\nI'm proud of our sustained efforts to consistently generate strong EBITDA while continuing to invest in the critical areas of our business that will prepare us for the tighter wave of opportunity ahead while still producing cash flow that helps fund our future growth. Our trailing 12-month free cash flow of nearly 500 million is up 53% from a year ago. While there will always be periods where we may lean into investment due to the opportunity, over the long term, the best business models in the world generate long-term growth, profits, and cash. I'm fortunate to be part of a team that considers all of these in our investment decisions.\n\nFrom a channel perspective, CTV, by a wide margin, led our growth again during the quarter. Exiting Q3, video, which includes CTV, represented a low 40s percentage share of our business and continues to grow rapidly as a percentage of our mix. Mobile represented a high 30s percentage share of spend during the quarter as growth was, again, solid across both in-app and mobile video. Display represented a low teens percent of our business, and audio represented around 5%.\n\nGeographically, North America represented about 90% of spend, and international represented about 10% of spend in Q3. Spend growth in North America was resilient as we continue to win new business and gain share. CTV across Southeast Asia and Europe was very strong during the quarter, growing faster than in any other region. While still small compared to CTV spend in North America, we're encouraged to see CTV in both Europe and Southeast Asia rapidly increase year over year relative to their overall spend.\n\nDespite an uncertain macro environment, particularly in Europe, we remain focused on the long-term investments that will position us for strength when conditions improve. In an uncertain environment like today, advertisers become more deliberate with their ad spend, scrutinizing the effectiveness of their ad budgets much more carefully than they have done previously. As we have shown during similar environments in the past, as advertisers become more deliberate and data-driven with their ad spend, The Trade Desk wins more budget. Every ad run on our platform is measurable, and we are as focused on driving the highest returns for every campaign as our clients are.\n\nAs we're starting to hear more publicly from the largest and most sophisticated advertisers in the world, they are beginning to prioritize programmatic decisioned advertising investments first because it delivers higher returns than they have seen in other channels. Add on top of that, our company's unbiased partnership with them and that we don't own inventory, we don't compete with our customers, and we offer an unrivaled data marketplace where they can inspect, measure, and enhance campaigns in ways that walled gardens either refuse to offer or merely cannot match, creates a durable advantage that we believe makes the future very bright for us and for our customers. In terms of the verticals that represent at least 1% of our spend, travel more than doubled compared with a year ago. Food and drink, automotive, and technology were also very strong.\n\nOur automotive vertical is seeing a bit of a resurgence as a result of winning new business with large automotive manufacturers and the easing of supply chain issues the industry has seen over the better part of the last two and a half years. Hobbies and interest and education were both below the average. Additionally, as expected, political was strong and represented a low single-digit percent of spend in Q3. We continue to believe there is still potential for share gain and improvement in most of our verticals.\n\nTurning now to expenses. Q3 operating expenses, excluding stock-based compensation, were 245 million, up 32% year over year. Operating expenses during the quarter were primarily driven by investments in our team, particularly in areas like sales and marketing, as we scale prudently to support long-term growth, as well as return-to-office expenses. Income tax was 15 million for the quarter.\n\nAdjusted net income was $129 million or $0.26 per fully diluted share. Net cash provided by operating activities was 137 million for Q3 and free cash flow was 112 million. DSOs exit in the quarter were 92 days, up five days from a year ago. DPOs were 74 days, up one day from a year ago.\n\nWe exited Q3 with a strong cash and liquidity position. Cash, cash equivalents and short-term investments ended the quarter at $1.3 billion. We have no debt on the balance sheet. Turning to our outlook for the fourth quarter.\n\nWe estimate Q4 revenue to be at least $490 million, which would represent growth of 24% on a year-over-year basis. In Q4, we anticipate U.S. political midterm election spend to about double compared with the prior quarter. We estimate adjusted EBITDA to be approximately 229 million in Q4.\n\nFrom a stock-based compensation perspective, we expect absolute stock-based compensation expense to decline year over year in Q4 due to the timing of the CEO performance award granted in Q4 of 2021. While uncertainty about the macro environment remains, we continue to feel confident in our ability to execute and gain share in the quarters and years ahead. Given the large and growing addressable market in front of us, we see significant opportunities to prudently invest in our business to innovate and to widen the distance between ourselves and our competition. In closing, we are extremely pleased with our strong performance in the third quarter.\n\nWe continue to demonstrate our ability to drive both profitable growth and achieve significant share gains with large growth drivers, including the secular shift to CTV, attracting more shopper marketing budgets, scaling our international operations to be ready when the macro environment improves, innovating the data marketplace, the U.S. midterm election cycle, as well as elevated pressure on walled gardens. We remain optimistic for the remainder of Q4 and into 2023. That concludes our prepared remarks.\n\nWith that, operator, let's open up the call for questions. \n\nOperator\n\nLadies and gentlemen, the floor is now open for questions. [Operator instructions] Please hold while we poll for questions. Your first question for today is coming from Shyam Patil at SIG. \n\nShyam Patil -- Susquehanna International Group -- Analyst\n\nHey, guys, nice job on execution. I had a couple of questions. Jeff, can you expand and talk a little bit more about what you're seeing with the macro and then, separately, just how you see the setup as we go into next year? And then, just as a quick follow-up, Blake, could you just talk a little bit more about the 4Q guide and just some of your assumptions there? Thank you, guys.\n\nJeff Green -- Founder and Chief Executive Officer\n\nThanks, Shyam. I appreciate the question. So, let me first start with the macro and talk about this year. So, I don't know that I have ever been more proud of our performance than what we just put up in Q3.\n\nAnd that's in large part because of the relative outperformance, you know, where most other stocks are either negative or reporting single-digit growth. We put up 31%, and we're doing that in an environment that is a little bit more uncertain. If there was an advertising mix, it would be at an all-time high. And, you know, it's hard to say whether that's because of macro headwinds or mostly macro uncertainty, but it would be high because of one of those themes in each case.\n\nBut because we're definitely in an environment regardless of where that's coming from, where advertisers have to do more with less, it means more that we're winning share in this environment. And I definitely believe that we're grabbing land. So, I take a lot of comfort in what Procter & Gamble said in their earnings report, which is that we are actively shifting our spend from linear to nontargeted TV into programmatic and digital that is a lot more precise. And so, when you look at just the overall macro environment, I just think we're just doing so incredibly well on a relative basis that it's hard not to be proud, it's hard not to look at what we've done and see grabbing land.\n\nBut when you turn our attention to 2023, and if you start to look at all the new inventory that's going to come into CTV, whether that's from Disney+ or digital inventory from Peacock or HBO or Netflix or Paramount+ or Fox or ESPN or Hulu or the fact that we reported in earnings that this year, 11 markets outside the United States outperformed in the United States in premium video or connected television, and then you look at the UID tailwinds that we have, we just surpassed 600 partners in UID and that we're activating data at an unprecedented level, we're going to go from a minority of our idea -- or I'm sorry, of our data on our platform being enabled by UID to the majority of our third-party data being enabled by the beginning of next year. So, we'll finish that work this year going from minority to majority. I do believe that in 2023, we'll have the best data marketplace that the ecosystem has ever had. I think we'll have the best first-party data onboarding that we've ever had.\n\nAnd that's not even talking about OpenPath, which we didn't really have time to talk about in our prepared remarks, which will be direct integrations with hundreds of the world's largest content owners and that will accelerate our growth in land grabbing around the world irrespective of the macro environment in 2023. And, of course, last but not least, with us partnering with over 80% of the largest retailers in the United States and, of course, partnering with many all over the world, all of those trends point to an incredible opportunity for us in 2023, that wouldn't be possible without the grabbing of land that we're doing right now. So, with that, I'll pass it over to Blake to just talk a little bit more about the second part of your question. \n\nBlake Grayson -- Chief Financial Officer\n\nHey, thanks, Shyam, for the question. So, your question on Q4, just to start off on Q3, again, fundamentally great quarter, actually pretty steady, too, which was great to see 31% revenue growth off a relatively hard comp last year of 39%. And, you know, political has ramped up for us as well. So, like you've already seen standout performance versus peers who are growing at much smaller or negative rates.\n\nYou know, again, CTV led the way, still opportunity there. Shopper marketing is ramping up well for us, too. The Solimar adoption is exciting. We've got the momentum on UID as well.\n\nAnd so, just grabbing share from company [Inaudible] and you've heard us talk about these JVPs as well. That's also been ramping and has been strong. And so, as you think about, as when we think about going into Q4 in our setup, you know, again, relative to the rest of the industry in Q4, we're growing significantly faster, which, in my mind, just confirms, you know, we're grabbing share. Advertisers are being more deliberate.\n\nYou know, I just personally believe we're in a better position now than we were coming out of COVID. As a chief financial officer, or CFO, I definitely appreciate the uncertainty that so many of my peers are facing right now, right? Like the best CFOs are actively working to rationalize the investments that they're making. And they're prioritizing the ones that have proven, you know, measurable returns. And in that environment, at The Trade Desk, we gained share because companies are now prioritizing programmatic as the first place to invest that first dollar.\n\nYou know, so, while you can obviously dial programmatic up and down quickly, it's doing really well for us. And to me, that just shows the power and the value of this model. Now, specifically with regards to Q4, a couple of thoughts. Not only is our Q4 sequential growth well into the double digits as many ad-funded companies are flat or negative, you know, we're actually forecasting accelerating growth on a year-over-year basis in Q4.\n\nAnd, you know, I recognize that there's a political impact in there. But when I just step back a bit and look at a year-over-year acceleration in Q4 in this environment, to me, that's a standout performance for us, and it gives us a lot of optimism about our future and the momentum that we've got. And I hope that helps. Thanks, Shyam.\n\nNext question, Holly.\n\nOperator\n\nYour next question is coming from Youssef Squali at Truist Securities. \n\nYoussef Squali -- Truist Securities -- Analyst\n\nGreat. Thank you very much. I have two questions. First, maybe, Blake, can you talk about the -- how you look at the expense structure for 2023, maybe talk about the puts and takes, growth versus the need to invest more.\n\nDo you expect margins to improve relative to where you are for -- or will you end up in 2022? And, Jeff, maybe going back to connected TV, very impressive kind of both numbers and color commentary. Can you maybe speak to the competitive positioning that you guys have relative to other CTV players? And do you believe that you are actually gaining share or losing share relative to other players that arguably are also benefiting from growth in CTV next year? Thank you.\n\nJeff Green -- Founder and Chief Executive Officer\n\nBlake, you take the first, and I'll take the second, and then, Tim, if you don't mind, adding color after I deal on CTV. \n\nBlake Grayson -- Chief Financial Officer\n\nSure. Youssef, thanks for the question. So, with regards to thinking about expense structure, you know, in 2023 and such, I really just like stepping back a bit to, you know, remind everyone that's the business model in the situation we're in highly desirable, right? We've got a situation where we're driving high top-line growth. We've got high adjusted EBITDA growth with strong margins.\n\nAnd we've got not only strong free cash flow generation but consistent free cash flow generation. So, having all of those working together, which they are, it gives us an opportunity and ability to be deliberate with the choices that we make. I'm just also super proud of our ability to stay disciplined with our investments regardless of the operating environment. I -- you know, there's a lot of companies out there that may have more resources than us that are pausing or even cutting their resources because they potentially invested too aggressively.\n\nAnd we didn't get ahead of ourselves the last couple of years I think, maybe like some of these companies did, and that's paid off for us. You know, we have the ability to stay the course and we deliver it about our investments, and that includes hiring. You know, as we think about 2023 specifically, should we see any significant changes in the situation, we definitely have levers available to make changes if we need to. You saw us do that in 2020 during COVID.\n\nYou know, we can adapt. But still, the expense structure of the company today is better than it was pre-pandemic. But overall though, and I've said this on a number of calls, we're always looking for ways to invest and drive growth that we think pays off for the long run. For 2023 specifically, I would say a couple of things.\n\nYou know, we do expect return-to-office expenses, like travel and live events, to return to pre-COVID levels. And the other thing to keep in mind is I would expect seasonality of our expenses next year to be a bit more like 2016 to 2019 than they were in 2020, 2021. And, you know, just for example, we have our large company event that will finally move back to its regular timing in Q1, it was held in Q2 of this year. You know, that's just a great opportunity to bring our team together, especially after what's gone on in the past few years, whether we're solidifying our culture, reframing our strategy versus the opportunity we've got.\n\nAnd, also, just highlighting, again, the discipline perspective we take as a company about driving profitable growth. You know, so, looking into 2023, I think we're in a great position to drive more scale and efficiency and free cash flow. And, you know, we have so many opportunity areas to focus on. I'm really excited about that.\n\nAnd then, Jeff. \n\nJeff Green -- Founder and Chief Executive Officer\n\nYeah. I'll start on CTV and then, Tim, if you want to speak to it as well. So, I really think there's two parts to talk about on the CTV question. But first, is just talk about the category a little bit.\n\nAnd then also to just talk about why we win specifically inside the category. So, of course, right now, at The Trade Desk, we're living a secular tailwind that I don't know that we've ever seen before, and I don't know that we'll ever see again, and that is going to continue into 2023, largely because of the amount of inventory that is coming online. But, also, as you look across the open internet, and whether that's inside of display or native or audio or any other channel, because CTV is leading the way in forging the future of identity, CTV is not just leading in our business and not just the most interesting thing happening in programmatic, but it's the most interesting thing happening in ad-funded media. And so, as a result, CTV is the first -- is quickly becoming the place where people spend their very first dollar.\n\nYou know, I was not surprised at all to see our partner, Disney+, report 12 million new subscribers. And, of course, Netflix added a couple of million themselves on just the promise of an ad-funded option coming soon. So, there's more inventory coming online. Programmatic, it will just continue to drive CTV.\n\nAnd I do believe that, very soon, CTV will be the most data-driven channel. And that to me is one of the things to really just focus on in terms of why we're winning. It's the inside of CTV. So, -- you know, why we are winning above everyone else.\n\nSo, in order to be competitive, you do have to be omnichannel. So, you can't just be focused on CTV because you take the data and the learnings from all other channels and then apply those to CTV, where CTV is a top-of-the-funnel activity, where you're typically creating awareness. And then all the other channels are follow-ups, if you will, to that really effective moving picture and sound that happens inside of CTV. And so, in order to be most effective, you have to be holistic.\n\nSo, you have to be omnichannel, but you also have to be global and then very importantly, you have to be objective, which means you can't compete with any of the content owners, which is one of the things that is really a problem for most of the walled gardens, especially Google, which is that, of course, they have their own media in YouTube. And so, content creators are not eager to part with somebody -- or to partner with somebody that they compete with in their very -- in the core of their business. So, by being objective and not competing with them by being global, by being omnichannel and then, you know, there's something that we say all the time to every content owner on the internet, and that is that you have to have an authentication strategy, and you have to have an identity strategy. And we're able to go to the content owners and partner with them on both of those things.\n\nAnd you see this with Disney. Disney is doing extremely well. We've been very vocal. They have been very vocal about our partnership on UID.\n\nIt is a part of their authentication and identity strategy. That is what makes personalized ads possible. That's what makes high CPMs possible. That's what makes low ad loads possible.\n\nSo, we become a really critical partner for them, while not competing with them because we're objective. You put all that together, and that's the reason we're winning. But I'm sure, Tim, you can say more about this. \n\nTim Sims -- Chief Revenue Officer\n\nYeah. Youssef, thanks for the question. And as I look out, you know, next year and kind of why I think we're differentiated and in a position to win, it's a little bit of what Jeff said. So, you've got a lot more inventory coming online.\n\nSo, as Jeff pointed out, we've got Disney+ and Netflix, they get a lot of the word count in the ecosystem right now. But let's not forget, HBO Max, Paramount, NBCU, Fox, the rest of Disney, Hulu, ESPN, ABC, etc. are continuing to lean into programmatic. And the reason that they lean into us is if you think about it from their perspective, and they look back at the ecosystem of people who do what we do, a lot of those companies are competing with them.\n\nSo, they lean in heavily with us and they partner with us in a number of different ways, including on identity. So, UID2, through our partnership with Disney, I think, is going to be a major catalyst for the CTV category. As a result, that inventory is going to have much richer decisioning going into next year across the entire category. So, when I think about 2023, there's this like perfect collision of addressability and scale in the premium content space that we've never seen before.\n\nAnd I think that's going to be a huge benefit to The Trade Desk because it's mostly to date in this CTV story. And I think in 2023, it's going to be a programmatic CTV story. And so, I'm really excited for that in 2023 because I think all of these things combining that addressability and that scale is going to create an environment for CTV to be the most data-driven channel in programmatic next year. And I'm really excited for that.\n\nAnd as a result, I think CTV is going to very quickly become the first dollar spent in digital media, and I think The Trade Desk is well positioned going into next year.\n\nBlake Grayson -- Chief Financial Officer\n\nThank you, Youssef. Next question, Holly.\n\nOperator\n\nYour next question for today is coming from Laura Martin with Needham. \n\nLaura Martin -- Needham and Company -- Analyst\n\nHey, Jeff. Just following up on your comments about ID on connected television. The Amagi data shows that 80% of viewing on connected television is shared, which does seem to undermine some of the targeting benefits that we had on individual devices, like smartphones and tablets. That's my first question.\n\nAnd then, my second is China. You're sitting in Singapore, and you're noticeably silent on China. So, could you give us an update on what's going on with China and your business these days? Thank you.\n\nJeff Green -- Founder and Chief Executive Officer\n\nFantastic. Thanks, Laura. Really appreciate the question. So, when it comes to shared viewing or the impact that that has on CPMs or does it pose a threat to the ecosystem or is it a problem for CTV, let me just first sort of answer that emphatically by saying it's not a problem for the ecosystem, you know, whether you frame it as is CTV worth it? The answer is yes.\n\nDoes it have a frequency capping problem? The answer is no. The bottom line is, when we're considering targeting or customizing ads, there is an individual graph, there's a household graph. Both of those get -- are considered when we're making the placement of ads, and shared viewing doesn't necessarily mean that it's worth any less. And in fact, what we're competing with is an environment in linear or broadcast television that is almost always shared viewing, but it's not measurable.\n\nSo, finally, we have the ability to measure when it's being shared and when it's not. And of course, a lot of premium video is on personalized devices. And I've been reminded of that again and again this week as I'm here in Asia and reminded how much premium video is consumed on mobile devices. So, household and individual graphs are both considered, but when you compare the sort of spray and pray of broadcast or traditional television to the efficacy, the targeting, the identity-driven lower ad load with content that is more premium, you put all of that together, the impact on digital is exponentially more valuable than a linear broadcast, and the efficacy has gone up way more than the cost.\n\nAnd as that phenomenon continues to unfold in 2023 that Tim was just describing really well, which is that it's becoming a programmatic story where there's more inventory, and we can select more and more from the sort of wider selection of ads, the personalization, the customization, the efficacy is only going to continue to go up. So, it's absolutely worth it. The shared viewing, I don't even view as an issue. I don't spend time thinking about it.\n\nSo, as it relates to China, China is, of course, one of the largest markets in the world, and we are constantly keeping our eye on the fact that while as a media market, it's about half the size of the United States. It is growing at twice the pace. As you recall, last year, China was our fastest-growing office in the world. This year, that hasn't been true, but that's largely just because of macroeconomic headwinds and geopolitical issues.\n\nSo, we have been quiet, in large part because of those geopolitical issues and because there has been some slowdown. If the geopolitical issues weren't enough, there's also COVID lockdown that has affected them in a very significant way. But we've been, quarter over quarter, up over 100% in this environment. Shanghai is no longer our smallest office, which it was just 18 months ago.\n\nAnd we just -- we continue to believe that while the English-speaking world has led much of CTV, the Chinese-speaking world is the second most important as it relates to the premium video play and that we continue to look at China and all the Chinese-speaking nations of the world as a very important battleground for the future of global television and premium video. So, still excited and bullish just a bunch of things that make a fair amount of uncertainty. Thanks, Laura. Appreciate the question. \n\nBlake Grayson -- Chief Financial Officer\n\nNext question, Holly.\n\nOperator\n\nYour next question is coming from Justin Patterson at KeyBanc. \n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nGreat. Thank you very much. Two, if I can. Jeff, as you exit the year and have these data initiatives and OpenPath kicking in the year, how should we think about the competitive landscape and how that looks in 2023 versus what we've observed in the past? If I look at some recent commentary by Procter & Gamble, it seems like there's a lot more programmatic budget and relationships up for grabs heading into next year.\n\nAnd then for Blake, I appreciate your color on the Q4 guide. Could you please put a finer point on some of the trends you observed quarter to date and how we should think about growth over the rest of the quarter? Thank you.\n\nJeff Green -- Founder and Chief Executive Officer\n\nYeah. So, I think you're right in that there's more and more budget that's going into programmatic. I think the commentary that we've heard from Procter & Gamble is indicative of that. You know, as you've heard us say before, the supply chains of the open internet, but really the supply chains of the entire ad-funded internet have become a little bit murky and, you know, as often happens when markets mature, become just much more complicated.\n\nSo, it becomes more and more important for us to be obsessing about supply chains or supply pads. You know, as I've said before that I think one way to characterize the success of Amazon, it is that they've had an executive team that has just obsessed about the supply chain and just making certain that they're getting things as efficiently as possible so that they can deliver to their consumers the best product as fast as possible for the best possible price. We've applied that same sort of obsession to the media supply chain, which in some ways is even more complicated. And we've said, as often as possible, we want to make certain that no one in the middle is taking more in fees or tax than they're adding in value.\n\nAnd we do believe that that happens a fair amount of time because of complication and because of sort of draconian tactics of some of the biggest tech players in the world. Our way of combating that is to release products, like OpenPath, where we plug in directly with the biggest publishers in the world. We've had a number of conversations with content creators, whether that's in CTV or in mobile apps or in traditional web development, where they've said they don't feel like anyone is representing them the way they would like to and they would like to do their own yield management and plug in with us directly. That creates a more efficient supply chain, while us maintaining our role on the buy side as well as our objectivity.\n\nSo, when you couple that with all the data initiatives going into 2023, and, you know, I said in the prepared remarks that I believe because of Unified ID data, especially first-party data will be 10 times more valuable in 2023 than it's ever been historically. And that's largely just because of the math of UID and the scale of UID and not having to sync like we did in cookies. Not only is the internet getting an upgrade because we're going from an opt-out internet to an opt-in internet, but we're also getting rid of some of the clunkyness that cookies had, which makes a data-driven internet just so much more effective. And of course, it's better for consumers when it's opt-in.\n\nYou put all that together, we have a more effective supply chain. While budgets are up for grabs, we think that we're more likely to get the first dollar than anyone else. And what has happened over most of the history of The Trade Desk is that we got the leftovers from search and social and the walled gardens. And what's starting to happen now is we're getting the very first dollar, and that's happening more and more.\n\nWe expect that to continue as a secular tailwind of CTV continues. So, I appreciate the question. \n\nBlake Grayson -- Chief Financial Officer\n\nAnd then to follow Jeff on your question on the Q4 trend, you know, one way maybe to think about it is -- it's a little bit of a tale of two cities like, and you've heard us say this before like or a K-shaped recovery, if you will, for certain verticals. Some areas like travel and auto are outperforming, and they're making up for lost time. Some areas are more challenged. You've heard us talk about Europe but -- you know, as we've said that before.\n\nBut, you know, specific to Europe, as we've said, we've seen incredible CTV growth there, which is amazing in light of the macro challenges. So, it makes me super optimistic, you know, for the future for us there. And then, the automotive growth, especially -- it's been especially exciting to see some gains there. We've won new business and then some more existing -- from existing customers after a period of, you know, volatility over the past two-or-so years.\n\nAnd so, I think that -- and then even if you talk about CPG companies, you got some that are doing incredibly well and then some that still have some supply chain challenges as well. So, I think that the breadth of the advertisers and the verticals that we represent bodes super well for us and like there's still areas of opportunity for us to gain share there, too. Thanks, Justin.\n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nThanks.\n\nOperator\n\nYour next question for today is coming from Tom White at D.A. Davidson. \n\nTom White -- D.A. Davidson -- Analyst\n\nGood, thanks. Given the elections here yesterday, I thought I'd ask a question on political. Jeff, any big takeaways around political ad spend this cycle? Any learnings that we should kind of take away that you're taking away as to the future of political ad spend on CTV and, I guess, just digital broadly? Thanks.\n\nJeff Green -- Founder and Chief Executive Officer\n\nYou bet. So, one thing that's happened in the past is that we've seen them sort of focus on social and other parts of political. But what we've definitely seen this time is that CTV is the preferred channel for political advertisers, and it's playing a larger role in every election cycle. You know, one thing that is just really important for me to note is that as there's been more and more mistrust of specific tech platforms in the political environment, we are really proud of the work that we've done to focus on providing a better democratic process for both sides of the aisle and making certain that our platform is objective and independent so that we can power both Democrats and Republicans and anybody else for that matter.\n\nAnd I think our team has done a phenomenal job over, really, the last decade in winning trust and providing reassurance to both sides that we're going to provide them with an objective platform that's going to make it possible for them to do the very best and sort of let the process do its thing. It's our job to run a better process not to advocate for specific candidates or to get in the middle of politics more specifically. And as a result of creating that arm's length relationship, we, once again, believe we've run a better process and been a key contributor to running a healthy election. We expect that to grow in 2024 as we move into the next presidential cycle.\n\nBut once again, CTV plays a very significant role, and we think it will play a bigger role in every election going forward. And we're really excited to see the election over election growth and expect that to continue into the future. So, I appreciate the question. \n\nTom White -- D.A. Davidson -- Analyst\n\nThanks.\n\nBlake Grayson -- Chief Financial Officer\n\nThanks, Tom.\n\nOperator\n\nYour next question is coming from Brian Fitzgerald at Wells Fargo. \n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nThanks. Jeff, we want to know if you could talk about your decisioning intensity in CTV maybe versus other channels, particularly in the context of private marketplace deals and things of that ilk. Do you do as much heavy lifting there versus other channels? And do you get pushed back on pricing and any differences in the intensity there and also in CPMs? \n\nJeff Green -- Founder and Chief Executive Officer\n\nYeah. I appreciate the question, Brian. So, you know, we've been asked some form of this question over time in various ways. And it's essentially to say, do we add less value in CTV? Or should we be charging less? So, it's just two different ways of asking that question.\n\nAnd I would argue that we add more value in CTV than we do in any other channel. And also the value that we're adding is going up over time. So, the first part of that is the reason why we're adding more value is because the stakes are higher. If you -- in the stock market, if you buy stocks at random or you buy them all in ETFs, they tend to go up over time.\n\nBut if you buy ads at random, you'll get your ass kicked every single time, you have to select very carefully. And in the world of CTV, when you're buying very highly expensive or high-cost impressions, the stakes are higher. You have to make certain that you use data to buy the right ones, you have to get reach and frequency right. And I would argue the only platform in the world that manages reach and frequency well on CTV is The Trade Desk.\n\nSo, we add more value. And as time goes on, when you add more impressions, there's more opportunity to outperform and select more carefully. So, while there have been a series of PMPs or ways of buying and limited decisioning of methodologies, those have gone down over time. And those are typically training wheels or on-ramps for advertisers that over time are replaced with just high decisioning.\n\nAnd that's where all of our biggest advertisers are heading. That's where our product has gone. And we think, over time, that we just continue to add more value for essentially the same cost as we do in everything else, with our take rate having remained the same, pretty much our entire existence as a publicly traded company. So, I think it's something that has been important for us to clarify.\n\nAnd so, I really appreciate the question, Brian. \n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nThanks, Jeff.\n\nBlake Grayson -- Chief Financial Officer\n\nNext queue, Holly.\n\nOperator\n\nYour next question for today is coming from Jason Helfstein with Oppenheimer. \n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nThanks. Jeff, just a UID follow-up. We've heard concerns that publishers are being slow to adopt UID. What can you do to speed up adoption? And how are you thinking about this? Do you agree? You disagree? Thanks.\n\nJeff Green -- Founder and Chief Executive Officer\n\nYou bet. So, you know, I'm constantly reminded that if you sat me down a year ago and said, \"Jeff, right up a dream list of adopters,\" I don't think I could have fictionalized or made up a list that's more impressive than those that we've actually added, AWS, Saleforce, Snowflake, Adobe. You heard us say a year ago that we needed to add the infrastructure of the internet and those and hundreds of others represent that infrastructure with now approaching 600 partners. And that doesn't even underscore the entire infrastructure of the data ecosystem of the internet, names like Experian or InfoSum or so many others.\n\nSo, with all of those coming online and then you add the CTV players, companies like Disney, who have adopted it, and it will be just really critical next year that all CTV players are leveraging UID in order to get the personalization and the high CPMs that they all desperately need to compete. When you put all that together, I actually don't have any idea where that assertion is coming from that publishers are going slow. The only way that I could possibly make sense of that, it's just that some of them, it takes a little bit of time to prioritize and actually implement. But in terms of commitment or signing or prioritizing, it's there across the board.\n\nAnd we have so much momentum on the issue that I honestly, a year ago, wouldn't have thought it's possible for us to have the momentum that we have now. And I believe it's just critical for companies, especially content owners, to be leveraging that in order to do well. And you'll see us in 2023 push really hard to enable advertisers to bring their first-party data to bear. And I do think that, that will represent a very strong rebuttal to the value propositions of walled gardens and the leverage of first-party data and their ecosystems because here, they'll get to put their first-party data to work and then measure relative performance, learn from it, take the learnings with them so that they can continue to improve their marketing and not just outsource advertising or marketing to walled gardens, which has historically been the only option that they've had.\n\nSo, UID plays a really critical role in the future of the open internet, and it's doing its job. \n\nBlake Grayson -- Chief Financial Officer\n\nThanks, Jason. Let's take one more question, Holly.\n\nOperator\n\nYour final question for today is coming from Michael Morris at Guggenheim. \n\nMichael Morris -- Guggenheim Partners -- Analyst\n\nThank you. Good morning, guys. I have two topics I'd like to ask about. One about the joint business plan momentum and one about Asia.\n\nSo, on the first topic of the JVPs, I'd love to hear how -- if there's some way you could quantify or help us understand how much more valuable a partnership through a JVP is as compared to sort of, you know, your run-rate business or somebody, a partner who's not involved in one of those? How much value does it add? And also how penetrated is the market at this point for those? How much more runway do you feel you have with respect to the kind of addressable market for partners that are of the size that it makes sense for. So, that's the first topic. And then the second just on Asia. Jeff, you did spend a lot of time talking about the opportunity there.\n\nThe Asia Pac market historically has been a pretty tough market for Western companies as they compete with local players. So, I'd love to hear a little bit about, you know, why you think you can be successful where maybe some companies in the past have not? Thank you.\n\nJeff Green -- Founder and Chief Executive Officer\n\nYou bet. Thank you. I'm going to have Tim take the first part of the question on the JVPs, and then I'll add some color and talk about Asia. \n\nTim Sims -- Chief Revenue Officer\n\nYeah. Michael, thanks for the question on the JVPs. I'll try to cover everything that you mentioned there. So, first, starting with what's the difference between a JVP and a typical engagement.\n\nOne of the major differences in the JVPs is that these tend to be multiyear agreements between The Trade Desk and a brand or agency. And they tend to set kind of a partnership framework that often includes milestones for that partnership over that multiyear agreement, which is typically a longer period of time than a standard MSA that we would sign with a client. So, within that framework, typically the way that these work is that the advertiser, we sit down and we set goals for ourselves around things like how do we move more spend into the platform, how do we think about, you know, adjusting their investment mix moving it toward more data-driven advertising, how do we think about using platform features that they may be underutilizing. It's a really great framework to structure how we build a stronger partnership with that brand or agency over a longer period of time.\n\nAnd one of the incredible benefits of that is it creates a lot of stickiness and engagement with our partners over that period of time because we're constantly checking in on achievement against those milestones. And I think the way that we look at those as just these longer-term engagements is it really creates a lot of a deeper conversation with our partners so that we can really figure out how we're structuring these that are going to be the best interest of their business and how we can of jointly agree on what we're going to try to achieve together over a multiyear period. So, in the end, all that leads to a much more interesting and dynamic conversation and discussion over time. And we're really excited about the momentum that we have right now, and we're expecting to continue to build on that into the future with more JVPs with more clients. \n\nJeff Green -- Founder and Chief Executive Officer\n\nThanks, Tim. Well, said, I don't have anything to add on the JVPs. I'm excited to weigh in on Asia, though, because I really appreciate your question. And, of course, we're also all sitting here in Singapore and nearing our 10-year anniversary of being here in the Asia market where we started here in Singapore.\n\nSo, we have a saying in our company that we are not an American company. We're a global company that happens to be based in the United States. And can we be successful in Asia? My response is we already are. Eleven markets in CTV or premium video grew faster than the United States for us.\n\nSo, when I say 11 markets, I'm not -- I'm not talking about it in general. I'm talking about The Trade Desk's markets. Our spend grew faster in 11 markets for premium video outside the United States than it did inside the United States, the fastest region for growth around the world, Southeast Asia. It grew faster than Australia, grew faster than North Asia, grew faster than Europe.\n\nIt grew faster than North or South America. And that's in large part because we are -- just like in every other market, creating alternatives, especially UGC, where YouTube has a very dominant position in many of the markets here. But, also, you're seeing from the content creators that, historically, they've had sort of a regional benefit where there's licensing that has prevented U.S. companies from competing with them in their markets.\n\nBut one of the reasons why you've seen Australia, a close rival, to leading in terms of size or percentage of market moving to CTV with the U.S., those two leading the way, is because with English language content that no longer having regional barriers, but English content is competing all over the world. And the same thing is happening with Chinese content and all others. So, what you're seeing is that the content owners are no longer viewing their next-door neighbor in sort of broadcast as their biggest competitors, but instead looking at companies like Disney and Netflix as their biggest competitors around the world. So, they're all looking at the ad-funded options that those companies are creating around the world and saying that we quickly have to follow in order to compete.\n\nAnd so, as a result, we're getting partnerships all over the world. We're setting up partnerships. That is the reason our executive team is here in Asia is because it's not lost on us, but most of the GDP growth for the next 10 years is going to come out of Asia. And that in order for us to capture our fair share of that trillion-dollar TAM, we have to be competitive in Asia as well as in other regions of the world.\n\nWe're already doing that. And we've been doing that in this market despite things like the strong dollar and economic headwinds and some geopolitical issues, but we continue to do that because of strong partnership and a global mindset. And, of course, we represent most of the largest brand in the world. And whether you're talking about Procter & Gamble or Coca-Cola or McDonald's, these brands advertise all over the world, and it's not lost on them that GDP growth is going to come out of Asia.\n\nIt's not lost on them that the fastest-growing middle class in the world is here in Asia. So, you put all of that together, it's a market that we're already winning in and will continue to do so. We've over invested. If you look at our employee count versus our revenue, of course, we are early, not late.\n\nAnd that's a good thing, not a bad thing. Thank you. \n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChris Toth -- Vice President, Investor Relations\n\nJeff Green -- Founder and Chief Executive Officer\n\nBlake Grayson -- Chief Financial Officer\n\nShyam Patil -- Susquehanna International Group -- Analyst\n\nYoussef Squali -- Truist Securities -- Analyst\n\nTim Sims -- Chief Revenue Officer\n\nLaura Martin -- Needham and Company -- Analyst\n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nTom White -- D.A. Davidson -- Analyst\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nMichael Morris -- Guggenheim Partners -- Analyst\n\nMore TTD analysis\n\nAll earnings call transcripts"
}