{
  "companyName": "McGrath RentCorp",
  "companyTicker": "MGRC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/mcgrath-rentcorp-mgrc-q3-2022-earnings-call-transc/",
  "content": "McGrath RentCorp (MGRC -0.52%)\nQ3 2022 Earnings Call\nOct 27, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. Welcome to the McGrath RentCorp third-quarter 2022 earnings call. At this time, all conference participants are in a listen-only mode. Later, we will conduct a question-and-answer session.\n\n[Operator instructions] This conference call is being recorded today, Thursday, October 27, 2022. Before we begin, note that the matters the company's management will be discussing today that are not statements of historical facts are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding our full-year 2022 financial outlook, as well as statements relating to the company's expectations, strategies, prospects, or targets. These forward-looking statements are not guarantees of future performance and involve significant risks and uncertainties that could cause our actual results to differ materially from those projected. Important factors that could cause actual results to differ materially from the company's expectations are disclosed under Risk Factors in the company's Form 10-Q and other SEC filings.\n\nForward-looking statements are made only as of the date hereof. Except as otherwise required by law, we assume no obligation to update any forward-looking statements. In addition to the press release issued today, the company also filed with the SEC the earnings release on Form 8-K and its Form 10-Q for the quarter ending September 30th, 2022. Speaking today will be Joe Hanna, chief executive officer; and Keith Pratt, chief financial officer.\n\nI will now turn the call over to Mr. Hanna. Go ahead, sir.\n\nJoe Hanna -- Chief Executive Officer\n\nThank you, Gretchen. Good afternoon, and thank you, everyone, for joining us on our McGrath earnings call today. I hope you are all doing well. Keith and I will look forward to your questions after we each highlight aspects of McGrath's progress in the third quarter during our prepared remarks.\n\nWe were very pleased with our third-quarter results, which reflected strength in all of our business units. Total company rental revenues increased by 15%, and sales revenues increased by 20%. The third quarter continued our strong performance year to date and reflects effective execution of our strategic priorities, as well as favorable market conditions. Turning to each of our business units.\n\nMobile Modular, once again, had a very impressive quarter. Rental revenues grew by 17%, with noteworthy increased performance from our education segment, where we are seeing recovery post pandemic and as school districts continue modernization projects in all of our regions. Our strong presence in growth markets where student population is increasing also drove rentals as districts cannot accommodate students fast enough in permanent facilities. Education rentals, which account for a third of our business mix, grew by 9%, which was the largest increase since the beginning of the pandemic in the first quarter of 2020.\n\nCommercial rentals also increased a healthy 20%, driven by continued investment in many different end-market requirements. We excel at providing complexes, which are multi-floor units typically customized to specific configurations that are needed by large construction contractors, and demand was robust for those products. Examples include data centers, municipal building refurbishments, and industrial expansion projects. We again achieved what I'd describe as the trifecta in our modular division, as we did in the second quarter, and that is improvement in utilization and pricing while also adding new equipment to grow the fleet.\n\nI cannot stress enough the significance of this. Turning those dials to a positive outcome is always a challenge, and success equates to effective management of the fleet, pricing strategy, and smart deployment of capital. We continually strive for positive gains in both price and utilization. Overly aggressive actions to increase price can cause the utilization to drop.\n\nOverly aggressive actions to increase utilization can cause pricing to decline, neither of which would be constructive. So, we try to be very thoughtful in execution and to maintain a strong focus on return on capital from our fleet investments. We finished the third quarter at over 81% utilization, a level our Modular division has not achieved since 2008. At the same time, pricing on deliveries in the quarter were up by 11%.\n\nOn the sales front, revenues grew 10% as we benefited from strong used equipment sales. For our Portable Storage business, we delivered 38% rental revenue growth and saw strength in demand in all of our markets. We had a nice balance of delivering growth in both pricing and volume. Construction and industrial customers and subcontractors who support both of these verticals contributed to the robust realized demand.\n\nGround-level offices continue to be a bright spot for our Portable Storage business as they are a high-financial-return product in the Portable Storage fleet and also represent a high-growth opportunity. We are able to efficiently produce most of these units in our modular production centers around the country with consistent, high-quality standards. At TRS-RenTelco, rental revenues grew 9%, reflecting favorable market conditions. Our billing rates for general-purpose equipment are at historic highs.\n\nInvestment by major firms in R&D projects continued in the quarter, led by strength in aerospace and defense. The drive for technology and more bandwidth continued to help fuel our communications rentals for 5G-related work. Both wired and wireless equipment rentals were very healthy. We were very pleased with the performance of the business.\n\nAt Adler, rental revenues grew by 18%, continuing the trend of strong growth in the prior quarter and year to date. Rental performance in all regions and market verticals increased in the quarter. Utilization has improved considerably as we have been filling customer orders from units we already own and can deploy quickly without spending capital to buy new fleet. Additionally, pricing continues to improve as the business is steadily regaining momentum.\n\nAdler's demonstrated improved operating leverage in the third quarter contributed nicely to overall division and company performance. I'd like to now turn to higher-level macro comments about the demand picture, as well as further strategic execution and progress with our Modular initiatives. Given the uncertain macroeconomic outlook, I've been working closely with my leadership team to monitor demand trends and identify any signs of weakness. Currently, the demand metrics we track remain very healthy across the business.\n\nI also gather field intelligence from our front-line sales managers to get a current sense of what our customers are saying about projects, momentum, and outlook. In my recent conversations with every one of our sales managers in the Modular division, the customer and commercial intelligence they shared was very positive. I am pleased to say project activity remains very healthy. Many customers appear more adept at operating in an inflationary environment and are pricing jobs to reflect higher cost and longer time frames.\n\nWe are fortunate to have operating locations in desirable areas to live across the country, and that dynamic is an advantage. We are already booking projects for 2023, and this activity is on par with expectations. So, we are not currently seeing any signs of broad-based slowdowns. I'd like to turn next to our Modular initiatives, which continue to gain traction.\n\nWe have three areas of focus, as you know, since we have been communicating these now for several quarters. First is Mobile Modular Plus, through which we provide furniture and fixtures inside the building. Next are site-related services, which are services we provide outside the building, such as walkways, electrical and plumbing connections, overhead covers, and other outdoor features. And last but not least are our custom modular solutions, with sales of modular buildings for larger and more custom projects.\n\nWhile currently small, all three of these initiatives have grown at double-digit rates in 2022 and represent significant long-term revenue potential. We are still in the early innings of growing these initiatives within our Modular business, and I'm very excited about our progress, as is our Modular leadership. And looking at McGrath as a whole, I would also like to highlight that during the third quarter, we updated our corporate logo and tag line. Our new logo reflects the contemporary McGrath that is strategically focused on growing our Modular business.\n\nIt is also a symbol and acknowledgment of our total company's long-term momentum, as evidenced by 31 years of dividend growth, a rare distinction among publicly listed companies and unique among our competitive peers. The tag line, which says, \"Enabling our customers to do great things,\" reflects what we do for our customers. Our modular classrooms and buildings that provide space for children to learn or commercial construction teams to meet, our electronic test equipment that makes a satellite functional, or our tanks and boxes that are quickly delivered to come to the aid of a customer to contain environmental waste are all true enablers. We are proud of the role we play and strive to be the best in the business in the many ways in which we touch our customers.\n\nAll of our successes as a growing company over the years in the third quarter, year to date, and looking ahead could not happen without the care and dedication that our teams across the company show to our customers and each other every day. I would like to express my sincere thank you to every one of our team members for showing up at your best each and every day and for delivering a very strong third-quarter and year-to-date results. On the heels of this strong third-quarter and year-to-date performance, we are increasing our full-year financial outlook. Now, let me turn the call over to Keith.\n\nKeith Pratt -- Chief Financial Officer\n\nThank you, Joe, and good afternoon, everyone. As Joe highlighted upfront, we delivered excellent results in the third quarter with continued positive performance across the board. Our results reflect broad-based organic strength across all of our core rental businesses. Looking at overall corporate results for the third quarter.\n\nTotal revenues increased 16% to $200.5 million. The revenue increase was primarily from improved rental operations, along with higher sales revenues with Mobile Modular, TRS-RenTelco, and Adler Tanks, each growing rental revenues year over year, reflecting sustained momentum and healthy business conditions. Third-quarter adjusted EBITDA increased 13% to $74.7 million, and consolidated adjusted EBITDA margin was 37%. Breaking down the operating performance by rental division compared to the third quarter of 2021, Mobile Modular had an impressive quarter.\n\nThis quarter was the first opportunity we had to see the full comparable organic growth generated by our larger modular business as the acquisitions of design space and kitchens to go were completed in the first half of last year. Mobile Modular total revenues increased $15.4 million or 14% to $125.8 million. There were increases across all revenue streams, including 17% higher rental revenues, 12% higher rental-related services revenues, and 10% higher sales revenues. We saw broad-based strength across our commercial, education, and Portable Storage customer bases.\n\nEducation rental revenues increased 9%, representing our strongest growth since the first quarter of 2020 and demonstrating post-pandemic recovery in this important customer base. Sales revenues increased $2.6 million to $28.9 million, primarily from increased used equipment sales. We addressed strong demand conditions with disciplined fleet management and achieved average fleet utilization of 80.1%, which I will reemphasize is a level we have not seen achieved by Modulars since 2008. This 80.1% is up significantly from 76.5% a year ago, and we ended the quarter even higher at 81.2% utilization.\n\nThis substantial utilization achievement was accomplished while growing our fleet and increasing average rental rates. The average fleet size for the quarter increased by $55.7 million or 6%, and average equipment on rent increased by $78.9 million or 11% as we successfully improved utilization. The total fleet average monthly rental rate for the quarter was 2.79%, which was 5% higher than a year ago and reflects continued healthy pricing conditions. Higher rental revenues were partly offset by 36% higher inventory center costs and 3% higher depreciation expense, resulting in rental margins of 56%, compared to 59% a year ago.\n\nThe higher inventory center costs reflect the higher business activity levels as we prepared equipment to meet strong order activity levels, as well as some inflation pressures for materials and labor costs. As we experienced some rental margin pressure in the quarter, it is important to note that expenses to prepare equipment are realized in the period incurred, but offsetting price increases that are included in rental revenues are realized over the term of the lease. At TRS-RenTelco, total revenues increased $3.5 million or 10% to $38.5 million. We saw increases in both rental and sales revenues, with rental revenues increasing $2.6 million and sales revenues increasing $0.7 million.\n\nRental revenues for the quarter increased 9%. We saw healthy demand for both general-purpose equipment and communications rentals, which increased 9% and 6%, respectively. The average monthly rental rate for the quarter was 4.16%, up 3% compared to a year ago. This higher average rental rate, coupled with 5% higher average equipment on rent, reflects good demand and pricing for general-purpose and communications equipment rentals.\n\nAverage utilization for the quarter was 65.3%, compared to 66.9% a year ago, and rental margins were 44%, up from 42% in the previous year. Sales revenues increased 16% year over year to $5.5 million, with gross profit increasing 12% to $3.4 million. At Adler Tank Rentals, total revenues increased $3.9 million or 18% to $26.2 million on higher rental and rental-related services revenues. Rental revenues for the quarter increased 18%.\n\nWe continue to see demand improvement, which was broad-based across our five geographic regions and six industry verticals and reflects further recovery from pandemic lows in Adler's markets. The average monthly rental rates increased 5% for the quarter to 3.46%, reflecting improving pricing environment. Average utilization for the third quarter increased to 54.9% from 48.1% and rental margins improved to 57%, compared to 51% a year ago, reflecting healthy demand conditions and strong operating leverage. Business conditions were strong throughout the quarter with ending utilization at 58.3%.\n\nThis ending utilization has not been achieved since well before the pandemic and was last achieved in 2018. The remainder of my third-quarter comments will be on a total company basis. Selling and administrative expenses increased $4.2 million or 11% to $44.1 million. The primary driver of the increase was $2.6 million higher employee salaries and benefit costs, as well as higher marketing and administrative costs.\n\nInterest expense was $4.2 million, an increase of $1 million, the result of higher average interest rates, partly offset by 8% lower average debt levels. The third-quarter provision for income taxes was based on an effective tax rate of 25.3%, compared to 28.7% a year earlier. The reduced rent this year was primarily due to increased business levels in the lower-tax-rate states. Given the recent increases in interest rates, along with our higher rental equipment capital spending for growth, which incrementally increases total debt, we now expect full-year interest expense to be approximately $15 million to $15.5 million.\n\nTurning to our year-to-date cash flow highlights. Net cash provided by operating activities was $133.3 million, a decrease of $3 million as higher net income was offset by lower deferred income taxes and other balance sheet changes. Rental equipment purchases were $130.4 million, compared to $90.4 million in the prior year, reflecting increased demand and our corresponding increased investment for organic growth in Modular and Portable Storage fleet. Healthy cash generation allowed us to pay $33.2 million in shareholder dividends and pay down our credit facilities by $7 million.\n\nAt quarter-end, we had net borrowings of $419.5 million comprised of $160 million notes outstanding and $259.5 million under our credit facility. The ratio of funded debt to the last 12 months actual adjusted EBITDA was 1.55 to one. Finally, we are raising the McGrath full-year 2022 financial outlook. The positive rental and sale demand trends across each of our business segments continue to be encouraging.\n\nFor the full year, we currently expect total revenue between $720 million and $735 million, adjusted EBITDA between $274 million and $280 million; and gross rental equipment capital expenditures between $168 million and $174 million. That concludes our prepared remarks. Gretchen, you may now open the lines for questions.\n\nOperator\n\nAt this time, the floor is now open. [Operator instructions] Our first question comes from Scott Schneeberger from Oppenheimer.\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nThank you very much. Good afternoon, guys. I'll start in the Mobile Modular segment, very high achieved utilization, and that's great. You mentioned that you grew fleet and fleet on rent, good, very good to see.\n\nBut you're getting high in utilization. Are there any supply chain constraints that are still an issue? Did you get everything you wanted and needed this full season for fleet? And then a follow-up on that. Thanks.\n\nJoe Hanna -- Chief Executive Officer\n\nHi, Scott. Sure, I can answer that. I would say short answer is yes. I mean, we were able to fulfill our customer orders.\n\nOne of the good things that we're seeing not only in turning our used fleet, but we have a pretty good pipeline into the supply chain into the manufacturing base. And we increased our new equipment that we put on rent for the quarter by $18.9 million. So, it was a robust quarter for us to get used equipment turned and new equipment, and we've been able to fulfill orders and really haven't had to turn a whole lot of orders away or been unable to fulfill them. So, overall, firing well on all cylinders.\n\nKeith Pratt -- Chief Financial Officer\n\nAnd, Scott, if I could just add, I think our teams have done a really good job from an execution point of view. These supply chain issues have been around now for a number of quarters. And our teams have been creative and resourceful in looking at new avenues for supply, particularly on the container side of the business where the supply has been quite tight for quite some time. So, the sort of achievements of growing the fleet and increasing the utilization are a result of that really good focus on execution.\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nOK. Thanks. And then, Joe, you were talking about not pushing too hard on price, so you get the right utilization. It sounds like you're happy striking the balance.\n\nIt sounds like pricing was good, but it sounds like maybe you have opportunity that you're not necessarily taking. Can you just talk about your approach to price? You obviously are running this high utilization and winning business. So, just is there more upside available on pricing? And particularly in an inflationary environment, are you happy with the level you're achieving relative to cost inflation? Thanks.\n\nJoe Hanna -- Chief Executive Officer\n\nYes. The answer is yes, we are happy. And any time that we have the opportunity to increase price, we're doing it. And so, the good thing is we have pretty sophisticated tools that really share on a real-time basis what our close ratios are.\n\nSo, we're able to make those adjustments in our operating profile pretty rapidly. And any time we can increase price, we do it. The environment is good for doing that right now, and that's something that's definitely a focus with the sales team. So, I think, as I said in the prepared remarks, achieving that balance is important to us.\n\nAnd we want to see both of those things improve, utilization and pricing. And so, wherever we can do both of them, we're very happy to do that.\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nOK. Thanks. And I think you said something about orders looking out and into 2023, you're happy they're pacing as you had expected. What comprises those? Are you seeing infrastructure build funding for that and projects for that starting? Is it energy-based? Is it sizable manufacturing where you can put out modulars and portables at big projects? Just curious what you're seeing out on the horizon and the magnitude of how strong it is.\n\nIt sounds like it's consistent with what you expect, not seeing deterioration yet. Maybe you can just address the visibility you have, how far out that is would be helpful. Thanks.\n\nJoe Hanna -- Chief Executive Officer\n\nSure. Scott, you actually hit a lot of those topics that we're seeing increased business at. And I would say, we don't have visibility too far into 2022 -- or I'm sorry, 2023. But what we do see are significant projects.\n\nAnd I would say that there are numerous very large projects that we become involved with that require these complexes that I talked about in my remarks. And those are typically associated with projects that last one, two, three years and which provide a very, very good rental stream. So, we see activity in those areas right now, and it's as expected, and we're very happy with that. And it's very broad-based.\n\nIt could be government work. It could be private industry that are doing expansions in their facilities. And so, it could be municipalities, like I said, airport expansions and renovations, all those things. One thing we haven't seen too much yet is money from the infrastructure bill that was passed, and I recently heard some commentary that not very many projects have been funded out of that infrastructure bill yet.\n\nIt's been -- the number has been relatively small. And so, we're hoping to take advantage of that. And we believe that should definitely be improving as we go into the next year.\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nOK. Thanks for that. Real quick, just because I like to touch on the other segments as well. Could you tell us a little bit into the 5G penetration now, TRS, and how that's shaping up? Thanks.\n\nJoe Hanna -- Chief Executive Officer\n\nSure. There's two aspects of this bandwidth that these clients are seeking. One is wired and that is all the infrastructure that goes up to these towers, the bandwidth in fiber optic cable, and things like that. And so, we've been seeing and are continuing to see healthy demand in that part of our communications fleet.\n\nAnd then the other in terms of the tower work that's being done, there's other tools and other products that we have in our fleet that are designed to test cellphone tower signals and things like that, and we're seeing healthy demand there, too. So, I would say it's in both of those aspects of our wired and wireless communications fleet that have been very good, and that's all tied to 5G. And so, we've been very pleased with that.\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nThanks. And then lastly, and I'll turn it over, could you speak to Adler's six end markets that you segment? Just any weakness, particular strengths of each one individually?\n\nJoe Hanna -- Chief Executive Officer\n\nSure. You know, they were all up as we had shared. And I would say that two of them were up more than others and one was up significantly, and that was our Environmental Services segment, and that's environmental cleanups, spills, plant cleanup projects that might be at a petrochem plant or something like that. And that was up considerably in the quarter.\n\nAnd right behind that was construction, our construction work, and that's all do watering and things like that that you'll see on a construction site. So, overall, pleased that they were all up and those two, I would say, were the highlights for the quarter.\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nOK, great. Thanks very much, guys.\n\nJoe Hanna -- Chief Executive Officer\n\nYep.\n\nOperator\n\nOur next question comes from Marc Riddick from Sidoti.\n\nMarc Riddick -- Sidoti and Company -- Analyst\n\nHey. Good afternoon.\n\nJoe Hanna -- Chief Executive Officer\n\nHey, Marc.\n\nMarc Riddick -- Sidoti and Company -- Analyst\n\nI wanted to start within Mobile Modular. If we could talk a little bit about the rental services growth, because the profitability -- the pace of the profitability certainly outpaced the revenue growth, which was pretty good as well. So, I just hope you talk a little bit about those services. And we've talked over the years about the driver shortages and the like, but certainly, given the profitability growth there versus revenue, it certainly would indicate that you're getting some pricing there, and there's a lot of activity there.\n\nKeith Pratt -- Chief Financial Officer\n\nSure, Marc, I'd be happy to help you with that one. And in short, it's been a focus area for us. You're absolutely right, we've been working on margins, working on refining our pricing in that area, making sure that we're adjusting pricing to reflect some of the cost pressures for fuel and for drivers. And our teams have really put a lot of work into that area over the course of this year, and we're starting to see the impact of that work with nice improvement in the margins.\n\nSo, an organized program, something we identified early as a focus area. In addition, particularly on the Portable Storage deliveries, as we've got more density in a lot of our key markets, the economics of making deliveries and pickups have been improving, and that's another ongoing focus area for us. So, these are all execution issues and really good progress by the teams.\n\nMarc Riddick -- Sidoti and Company -- Analyst\n\nAnd since we're touching on Portable Storage, where are we ballpark as far as percentage of revenue for total company? Are we still sort of in that high single-digit area?\n\nKeith Pratt -- Chief Financial Officer\n\nYeah. Portable Storage represented 11% of McGrath's total revenues.\n\nMarc Riddick -- Sidoti and Company -- Analyst\n\nOK. Great. And then shifting over to -- we'll come back to TRS because it's impossible not to jump over to Adler, given what we've seen there. Talking about the growth and the verticals that you mentioned within Adler that are performing really well.\n\nCan we talk a little bit about the pace of that utilization growth especially with the commentary as to where you ended on utilization with Adler is obviously very encouraging, especially given where we've been?\n\nJoe Hanna -- Chief Executive Officer\n\nSure. I mean, utilization has just improved as we've deployed more equipment. And I think we've been real clear about our strategy in past calls, and that is we haven't been making new fleet investments. So, when conditions improve, demand improves and we can ship that equipment right out of our fleet and from equipment that's in the yard, that's a good thing for us, and that's exactly what we did in the quarter.\n\nSo, that's why you see that improvement in utilization like we did.\n\nKeith Pratt -- Chief Financial Officer\n\nAnd I'd just remind you, Marc, as we said, not only was utilization up, but pricing was up as well, and we've got really good operating leverage. Operating profit almost doubled in that segment in the third quarter.\n\nMarc Riddick -- Sidoti and Company -- Analyst\n\nGreat. And then I wanted to shift back to the education area because granted, I mean, you talked about the strength there and prior costs. I was wondering if you could sort of just talk about the execution of education for the quarter, and then maybe as far as what you're looking at profitability-wise within education vis-a-vis maybe last year? Because I guess there's greater -- so I guess I would imagine there's greater certainty in this year as opposed to last in dealing with those customers. Maybe talk a little bit about what your experiences are and maybe what you think was achieved during the quarter.\n\nJoe Hanna -- Chief Executive Officer\n\nYeah. I would say, first of all -- and Keith can follow up if you'd like to if I miss something here. But I would say the funding environment has been really good, and that's what drives favorable conditions with that part of our market focus that we have. And I would say, across the country, that's been in pretty good shape.\n\nYou combine that with the fact that, again, schools get older and older each year that passes, and maintenance just doesn't keep up. And so, that demand for modernization continues to be there, and we see that in every one of the markets that we serve. And then in other markets where growth is quite high in terms of student population, I mean, that really drives those long-term growth rentals that we have, too. So, I mean, we're set up to be able to serve both of those needs that we see with school districts.\n\nAnd our teams are quite good at being able to support customers in either one of those two applications.\n\nKeith Pratt -- Chief Financial Officer\n\nYeah. I think Joe hit all the highlights, Marc. The reason we pointed out the 9% growth in Education was if you look back over the last two years with the impact of the pandemic, Education was a part of the business that was relatively flat. We didn't lose much ground, but we didn't gain much ground over the last six or so quarters as we lived through the very tough time with the pandemic for our education customers.\n\nSo, we're hoping this is more of a return to normal. As Joe said, good demand levels, and really pleased with the evidence in the third quarter of a bounce back in this important customer base.\n\nMarc Riddick -- Sidoti and Company -- Analyst\n\nGreat. And then I wanted to touch a little bit within TRS-RenTelco. Can you talk a little bit about sort of how the revenue mix shook out during the quarter? I mean, I think you did mention as far as 5G, but I mean, just sort of make a bigger picture as far as the general equipment versus kind of what you might see there? And are we seeing a little bit of a shift that might be beneficial from a revenue mix and margin perspective? Thanks.\n\nKeith Pratt -- Chief Financial Officer\n\nYeah. No dramatic shift. I mean, roughly about a third of the business is communications related and about two-thirds general purpose equipment related. So, that mix has not shifted dramatically.\n\nAnd again, the good thing about that business is we're constantly looking at the equipment that we own, making adjustments, selling some, investing in new, really to address the market opportunities. So, our team does an incredible job monitoring market demand, very nimble in making adjustments with our fleet. And both segments, the good news is now several quarters in a row, both segments are very healthy. Both segments are growing, and they deliver good returns for the company.\n\nMarc Riddick -- Sidoti and Company -- Analyst\n\nGreat. Thank you very much.\n\nJoe Hanna -- Chief Executive Officer\n\nThanks, Marc.\n\nOperator\n\nLadies and gentlemen, that appears to be the last question. Let me now turn the call back over to Mr. Hanna for any closing remarks.\n\nJoe Hanna -- Chief Executive Officer\n\nI'd like to thank everyone again for joining us on the call today and for your continuing interest in McGrath and our company's growth and success. We wish you a good evening and look forward to speaking with you again in late February to review our calendar year-end results.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJoe Hanna -- Chief Executive Officer\n\nKeith Pratt -- Chief Financial Officer\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nMarc Riddick -- Sidoti and Company -- Analyst\n\nMore MGRC analysis\n\nAll earnings call transcripts"
}