{
  "companyName": "IVERIC bio, Inc.",
  "companyTicker": "ISEE",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/iveric-bio-inc-isee-q3-2022-earnings-call-transcri/",
  "content": "IVERIC bio, Inc. (ISEE 2.20%)\nQ3 2022 Earnings Call\nNov 03, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the IVERIC third quarter 2022 earnings conference call. All participants will be in listen-only mode. [Operator instructions]. After today's presentation, there will be an opportunity to ask questions.\n\n[Operator instructions] Please note today's event is being recorded. I would now like to turn the conference over to Kathy Galante, senior vice president, investor relations. Please go ahead.\n\nKathy Galante -- Senior Vice President, Investor Relations\n\nGood morning, and welcome to IVERIC Bio's conference call. Representing IVERIC Bio today are Glenn Sblendorio, chief executive officer; Dr. Pravin Dugel, president; Keith Westby, chief operating officer; David Carroll, chief financial officer; Dr. Dhaval Desai, chief development officer; Chris Simms, chief commercial officer; and Tony Gibney, chief business and strategy officer.\n\nI would like to remind you that today we will be making statements relating to our IVERIC Bio's future expectations regarding operational, financial and research and development matters. These statements constitute forward-looking statements for the purposes of the safe harbor provision under the Private Securities Litigation Reform Act of 1995. These statements cover many events and matters that are subject to various risks that could cause actual results to differ materially from those expressed or implied by any forward-looking statements. I refer you to our SEC filings and in particular to the risk factors included in our quarterly report on Form 10-Q filed on July 26, 2022, for a detailed description of the risk factors affecting our business that could cause actual results or events to differ materially from the forward-looking statements that we make.\n\nIn addition, any forward-looking statements represent our views only as of today and should not be relied upon as representing our views as of any subsequent date. While we may elect to update these forward-looking statements at some point in the future, we disclaim any obligation to do so as except required by law. I would now like to turn the call over to Glenn.\n\nGlenn Sblendorio -- Chief Executive Officer\n\nWell, thank you, Kathy, and good morning, everyone, and thank you for joining us for our third-quarter conference call. During the third quarter, we were thrilled to announce positive efficacy and favorable safety results from GATHER2, our second Phase 3 clinical trial of avacincaptad pegol, or ACP, also known as Zimura, for the treatment of geographic atrophy. We're proud to have achieved something that has never been done before in GA, deliver two Phase 3 studies that met their prespecified primary endpoint at 12 months of slowing GA progression. Our key focus now is to make ACP commercially available to physicians and their patients with GA as expeditiously as possible, subject to regulatory review and approval.\n\nThe positive results from GATHER1, our Phase 3 clinical trial of ACP for the treatment of GA and GATHER2, as well as our Special Protocol Assessment, or SPA, with the FDA, provide the basis for our new drug application. As a reminder, we received written agreement from the FDA under an SPA for the overall design of GATHER2 in July of 2021. The SPA process is a procedure by which the FDA provides a clinical trial sponsor with an official evaluation and written guidance on the design of a proposed protocol intended to form the basis for an NDA. The earlier completed GATHER1 clinical trial allowed us to get a head start on assembling the NDA prior to receiving the GATHER2 results.\n\nImportantly, we are ahead of schedule in preparing our NDA for ACP for the treatment of GA and therefore, are moving up our submission timeline to the end of this year. We look forward to continuing to engage with the FDA throughout the review process. We're also planning to submit a marketing authorization application or an MAA, the European Medicines Agency in 2023, subject to feedback from planned interactions with regulatory authorities in Europe. We're also delighted that GATHER2 efficacy and safety results for ACP were presented in two oral presentations as part of the Retina Subspecialty Day at the American Academy of Ophthalmology Annual Meeting on September 30, 2022, in Chicago.\n\nWe appreciated the opportunity to share the results of GATHER2 with eye care specialists from around the world at this highly respected medical meeting. Additionally, this week, GATHER1 and GATHER2 data will be presented at the Retina Society in Pasadena, California, and we will highlight the observed efficacy data from both studies. Pravin is going to talk about this in more detail in just a moment. Looking ahead, we're excited about the possibility to expand ACP into earlier stages of AMD.\n\nWe received favorable feedback from the FDA on our development plans for intermediate AMD. We are more determined than ever to evaluate ACP for this important patient population. We look forward to continuing our productive and collaborative discussions with the FDA and updating you further as we clarify our strategy. We continue to invest in additional life cycle initiatives for ACP to expand the patient population and to continue to evaluate multiple technologies for ACP.\n\nDuring the third quarter, we secured a term loan credit facility providing us with access to $250 million in absolute of debt financing with Hercules and Silicon Valley Bank. This financing further strengthens our balance sheet and provides financial flexibility as we continue to build our U.S. launch readiness plan and prepare for the potential commercialization of ACP. In July, we borrowed $50 million at closing.\n\nWith the positive GATHER2 results, we believe we have satisfied the first performance milestone under the facility, which allows us access to an additional $50 million tranche from the facility, which we plan to borrow before the end of the year. Well, again, thank you for your support, and I will now turn the call over to Pravin.\n\nPravin Dugel -- President\n\nThank you, Glenn, and good morning, everyone. As Glenn stated, ACP, our complement C5 inhibitor is the only investigational therapy to have two positive Phase 3 studies in GA with high statistical significance at the 12-month primary endpoint and a favorable safety profile. We believe that the reduction in GA progression that we have seen in GATHER1 and GATHER2 is clinically meaningful. We look forward to submitting a package to the FDA by the end of this year with GATHER1 and GATHER2 that provides consistent efficacy and safety profiles.\n\nIn GATHER1, a post-hoc analysis showed that the reduction in the mean rate of GA growth or slope analysis over 12 months was 27.7% with a descriptive p-value of 0.0063 for the ACP two-milligram group as compared to the corresponding sham group using the square root transformation and 35.4% with a descriptive p-value of $0.0050 without using square root transformation, which we referred to as the observed GA area. In GATHER2, ACP also met its prespecified primary efficacy endpoint of reducing the mean rate of growth slope analysis in GA area over 12 months compared to sham. The reduction in the mean rate of GA growth over 12 months was statistically significant at 14.3% with a p-value of $0.0064 for ACP two-milligram group compared to the sham group using the square root transformation and 17.7% with a p-value of 0.0039 using the observed GA area. In addition to the slope analysis in GATHER2, we also performed a point analysis on the mean rate of change in GA area, which you may recall was the prespecified primary endpoint analysis in GATHER1.\n\nThe results for the 12-month point analysis were consistent with the slope analysis across both trials. This data was also presented during AAO. Importantly, in GATHER1 and GATHER2 we observed a reduction in the change NGA area for the ACP group as compared to sham early in the trial, which continued to increase over 12 months. This observation suggests that therapeutic benefit of ACP may occur early and continue to increase over time.\n\nWe are thrilled with the consistency throughout GATHER1 and GATHER2 efficacy results. ACP's favorable safety profile and other potential key differentiating factor was also maintained throughout the GATHER1 and GATHER2 clinical trials. In both GATHER1 and GATHER2 through month 12, there were zero ACP-related events of endophthalmitis, zero ACP-related intraocular inflammation events, zero vasculitis, and zero ACP-related ischemic optic neuropathy events. The most frequently reported ocular adverse events were related to the injection procedure, including transient intraocular pressure.\n\nIn GATHER1, the incidence of choroidal neovascularization or CND rates through month 12 or 6% or 9% in the ACP two-milligram group and three or 2.7% in the corresponding sham group. Exudative macular neovascularization or MNV rates were 4% or 6% in the nonexudative macro neovascularization or NV were 2% or 3% in the ACP Group. In GATHER2, the incidence of cordless vascularization or CMV rates through month 12 were 15 or 6.7% in the ACBI milligram group and nine or 4.1% with sham group. EMV rates were 11 or 4.9% in the ACP two-milligram group and seven or 3.2% in the sham group.\n\nThere was one or 0.5% case of nonexudative MNV and three or 1.3% cases of pericapillary CMV in the ACP two-milligram group and no cases of nonexudative MNV and two or 0.9% cases of pericapillary CMV in the sham group. While the FDA has not requested the CNV cases be reported using a nontraditional recently defined terms of exudative versus nonexudative, we provide this distinction of cases for both GATHER1 and GATHER2. The definition of exudation has been detailed by Core, the reading center of the Cleveland Clinic, and can be found in our current report on Form 8-K filed with the SEC on April 4, 2022. Additionally, we're encouraged that we saw a positive trend in mean change in best corrected visual acuity, one of the prespecified supportive endpoints consistent in both GATHER1 and GATHER2.\n\nRemember, in GA, we consider BCVA to be primarily a measure of safety. For mean change in low Lumina's best corrected visual acuity, we did not see the same trend in GATHER2. We believe we have a solid complete filing package with two clinical trials: GATHER1 and GATHER2 that each separately and independently met their prespecified primary endpoint with a high degree of statistical significance and a favorable safety profile. We believe this clinical data package meets the requirements for an NDA submission.\n\nWe recently initiated an open-label extension or OLE trial for patients who completed their month 24 visit in the GATHER2 trial with the aim of providing patients access to ACP and collecting additional safety data. We plan to treat patients with ACP for 18 months or until potential regulatory approval of ACP in the applicable region, whichever is earlier. GA is a debilitating disease for which there are currently no approved treatments. We believe ACP has the potential to be life-changing for patients with GA.\n\nTurning to our HtrA1 inhibitor. We plan to conduct additional preclinical studies to optimize formulation, dosage, and delivery of IC-500. As a result, we do not expect to submit an investigational new drug application for IC-500 mid-next year as we had previously planned. We remain committed to this program, and we'll provide additional information as it becomes available.\n\nWe thank you for your time and support and look forward to updating you on our progress going forward. I will now turn the call over to Dave.\n\nDave Carroll -- Chief Financial Officer\n\nThank you, Pravin, and good morning, everyone. I would like to highlight a few items from our press release of this morning and provide some guidance on our expected year-end cash balance and our expected cash runway. For the quarter, our net loss totaled $42.4 million or $0.35 per share, compared to a net loss of $24.6 million or $0.23 per share for Q3 2021. This increase in net loss was driven by increases in both R&D and G&A expenses.\n\nR&D expenses increased primarily due to the continued progress of the GATHER2 trial, increased manufacturing activities for ACP, and increases in personnel costs, including stock-based compensation associated with additional R&D staffing. G&A expenses increased primarily due to increases in personnel costs, including stock-based compensation associated with staffing for commercial launch preparation for ACP. Turning to our expected year-end cash balance and cash runway. As of September 30, we had cash of approximately $321 million, which reflects the initial $50 million borrowing from our term loan facility with Hercules and SVB.\n\nWe estimate that our year-end cash will range between $265 million and $275 million. This estimate does not include any new borrowings from our debt facility, including the $50 million we plan to borrow during the fourth quarter of this year. We estimate that our cash and committed loan facilities will be sufficient to fund our planned capital expenditures, debt service obligations, and operating expenses through at least mid-2024. These estimates are based on our current business plan, which includes the continuation of our ongoing clinical development programs for ACP and GA and Stargard including the recently initiated open-label extension trial, evaluating ACP for intermediate AMD, preparation, and submission of an NDA and MAA for ACP in GA, continuing preparations for potential commercialization of ACP NGA in the U.S., pursuing DeltaTech sustained-release delivery technology and exploring additional sustained delivery technologies for ACP and the advancement of our IC-500 development program as currently planned.\n\nThese estimates do not include any potential new borrowings under the term loan facility with Hercules and SVP, including the $50 million that we plan to borrow in the fourth quarter this year. Also excluded from these estimates are any potential approval or sales milestones payable to the Arcamex Corporation. Any potential expenses for the actual commercial launch of ACP such as sales force expenses and any additional expenditures related to potentially studying ACP in indications outside of GA, Stargard, or intermediate AMD or resulting from the potential in-licensing or acquisition of additional product candidates or technologies or any associated development that we may pursue. Thank you for your time, and I'll turn the call back over to Glenn.\n\nGlenn Sblendorio -- Chief Executive Officer\n\nWell, thanks, Dave. And just to summarize a few key takeaways for the quarter. First, the positive results from GATHER2 provides us with two Phase 3 trials that met their primary endpoint as a basis to file the NDA. Second, we've moved up the NDA submission date to the end of this year.\n\nThird, we received favorable feedback from the FDA on intermediate AMD development. And as we talked about more to come as we continue our discussions with the FDA. Fourth, we will continue to present the GATHER1 GATHER2 data at major medical meetings with the next presentation at Retina Society this week, where we will highlight the observed data for G1 or GATHER1 and GATHER2 as Pravin just discussed. And finally, as Dave talked about, we secured access to up to $250 million of nondilutive debt to strengthen our balance sheet.\n\nSo, quite a good quarter for us. And at this point, I'd like to turn the call over to the operator so that we can open up the line for questions.\n\nOperator\n\nThank you. [Operator instructions] Today's first question comes from Ken Cacciatore with Cowen and Company. Please go ahead.\n\nKen Cacciatore -- Cowen and Company -- Analyst\n\nCongratulations, team, on all the progress. Great to hear about the accelerated filing. I was just wondering on GATHER2 results. Pravin, you went through great details about that really nice safety profile.\n\nCan you just talk about why we may be seeing a differentiation in your formulation in terms of safety? And then also on GATHER1 and GATHER2, you touched briefly on the -- we're starting to see a little bit of a separation on BCVA. And I know Dr. Chambers talk more about lesion growth than needing a functional endpoint, which maybe you could comment on as well coming out of AAO. But are you able, if you had more time to maybe identify any subgroup of patients or anything new as you analyze that data that you might want to discuss in more detail? And then lastly, and I'll get back into the queue.\n\nJust on your extended-release formulation. Can you discuss maybe when we might hear any of the earliest data or decisions on what we might be moving forward? Thanks so much.\n\nGlenn Sblendorio -- Chief Executive Officer\n\nPravin, go ahead. I think there's three questions there, and I'll jump in as appropriate, but I think Ken wants to hear from you, at least on one and two.\n\nPravin Dugel -- President\n\nGreat. Thank you so much for being here, and thank you for your question. So, the first part regarding the safety. And what I would say is it's not just the safety, it's also the efficacy.\n\nI think what we're seeing is the consistency of results that we see in both GATHER1 and GATHER2, I mean, I just want to highlight that. Regardless of how we look at the safety, how we look at the efficacy, how we look at the subgroup analysis in GATHER1, you'll see this remarkable consistency, both in GATHER1 and GATHER2 -- and you asked specifically about the safety profile. Yes, we're very, very happy with the safety profile. Again, very consistent in GATHER1 and GATHER2 as I highlighted, zeroes for any drug-related adverse events, both in GATHER1 and GATHER2.\n\nThe reason for that, Ken, I believe, and this is my opinion, is really two. One is the biologic part and the other is the CMC part. From a biologic point of view, we have always maintained that inhibiting C5 and keeping the C3 loop alive is very important in terms of down-regulating inflammation and potential infection from pathogens, and we believe we see that in both GATHER1 and in GATHER2. So, that's the biologic explanation, and there's good preclinical science to support that.\n\nFrom a manufacturing point of view, remember what we have is an RNA aptamer. So, that means that the entire process of scaling up is synthetic. There is no biologic intermediary. There is no e-coli or -- so as you know, in a lot of the assets that we've seen, these biologic intermediaries are where foreign antigens are introduced, and we bypassed that entirely by having a purely synthetic process.\n\nSo, I believe that it's really both reasons that accounts for this consistent safety profile. Your question regarding visual acuity, we've looked at the trends in visual acuity in GATHER1 at month 12, as well as month 18, and we've looked at the visual acuity trend and GATHER2 at month 12. And the trends are positive, meaning that the visual acuity trend is positive in both -- in all three. So, it's three out of three.\n\nAnd we want to remind everyone that visual acuity really is a safety measure. And we're very happy, again, consistent with your previous question regarding safety that the visual acuity trends are in the proper direction. Regarding the extended-release, as you know, we have a collaboration that's ongoing with DeltaTech. We are very happy with the progress of that.\n\nWe have not detailed any further guidance as to when milestones may be reached where we continue to report that we're very pleased with the progress. We've also stated that we are investing heavily in terms of sustained delivery because we believe that this asset is perfectly suited for sustained delivery. And we've also publicly announced that we will be looking at multiple sustained delivery opportunities, and we continue to do so. Back to you, Glenn.\n\nGlenn Sblendorio -- Chief Executive Officer\n\nOperator, next question.\n\nOperator\n\nThank you. And our next question today comes from Greg Harrison of Bank of America. Please go ahead.\n\nGreg Harrison -- Bank of America Merrill Lynch -- Analyst\n\nHey, good morning. Thanks for taking the question. Definitely great to see the filing timeline moves up. So, the question is what remains to be done in preparation of the MAA filing? And maybe you could talk about your expectations for the EMA's requirements for endpoint relative to what the FDA has asked for, especially in terms of functional benefit or any others?\n\nGlenn Sblendorio -- Chief Executive Officer\n\nYes, Greg. Thank you. It's Glenn. Thanks for the question.\n\nSo, with EMEA, and we've been consistent on this, I think the first step in that discussion will be to complete the NDA. I mean, once we have the NDA done, we believe we have the data set that would form the same information that goes into the MAA. The next step, which is an important one and we have not yet met with them is to meet with the regulators in Europe. Talk about the package.\n\nThis will be -- and I think that one of the key points that Pravin raised today, this is the first time that the EMEA will see two Phase 3 trial that have met their primary endpoint. So, we think there's a discussion to be had there. We also believe, and as I think it's been a discussion point that there's a need for functional data by the European regulators. We think we have a data package that could satisfy them, but we can't confirm that until we meet with them.\n\nBut we're very excited about talking to them about our data, what our data means, the safety profile. Once we have that discussion, that will define the timeline for an MAA. So, that's our current plans.\n\nGreg Harrison -- Bank of America Merrill Lynch -- Analyst\n\nGot it. That's helpful. And if I can sneak one more in. Could you characterize the feedback that you received from FDA on the intermediate AMD program? I think the prior guidance was that the trial would start this quarter.\n\nSo, is that not the case anymore?\n\nGlenn Sblendorio -- Chief Executive Officer\n\nSo, that's why we wanted -- we put out there that we've had very favorable interactions with them. And the second part of that is that we continue those decisions with them really to further define the strategy. But what we have discussed with them thus far has been very favorable. That's the reason we're mentioning it.\n\nTo go beyond that at this point, we don't have all the details that we could be that specific. We need further conversation with them, but we believe there's a path forward on intermediate AMD. So, as we said in the conversation before more to come on that.\n\nGreg Harrison -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks for taking the questions, and congrats again on all the progress.\n\nGlenn Sblendorio -- Chief Executive Officer\n\nThanks, Greg.\n\nOperator\n\nOur next question today comes from Colleen Kusy with Baird. Please go ahead.\n\nColleen Kusy -- Baird -- Analyst\n\nHi, good morning. Congrats on the progress, and thanks for taking your questions. So, can you just talk to what were some of the factors that contributed to shortening of the timelines for the NDA? And what are the remaining gating factors before filing? And then can you just clarify your expected timelines to approval?\n\nGlenn Sblendorio -- Chief Executive Officer\n\nYeah. So, thank you for the question. Great question. So, we originally, as we had the data, we had to put a stake in the ground for the NDA and we saw it before the end of the first quarter.\n\nAs we -- and as we always said, the team was working on GATHER1 data populating the NDA. As we continue to go through GATHER2 and looked at the data, it's quite good. And the team has been- because it's good and because we believe it's straightforward, the team has been able to accelerate their timeline. So, it's really that as we go through the data, it's cooperating.\n\nGATHER1, clearly having GATHER1 definitely helped. As we also said, coming off the data, you kind of overwhelmed when you first turn the data card as to what's there. We now understand it. We know how it needs to be put into the package.\n\nWe put tremendous resource behind coming out of the data, as the No. 1 priority was to get the NDA filed. So, all those factors have contributed to us revising our guidance to get this NDA before the end of the year. So, I hope that's helpful, and the team continues to work real hard on it.\n\nSo, the second part as to when, let's get the NDA in. Everybody knows the timelines. We do have fast track. There's defined timelines for fast-track approval.\n\nBut I think the first thing is to get a date in the fourth quarter where the NDA is complete, which will start the clock, and then we can update the timing.\n\nColleen Kusy -- Baird -- Analyst\n\nOK. Great. That's helpful. Thank you.\n\nAnd then I know it might be early for the open-label extension study, but any comment on the rate of patients converting from GATHER2 to the open-label extension? And then can you just clarify -- I think on clinical trials like of it, it only shows the monthly dosing for Zimura in the open-label extension. Can you just clarify what the dosing in that study is, please?\n\nGlenn Sblendorio -- Chief Executive Officer\n\nSure. PravIn, you want to take that one?\n\nPravin Dugel -- President\n\nSure. Colleen, we haven't detailed the open-label extension publicly as yet. That has just started. And yes, we -- as you recall, we will be dosing monthly.\n\nColleen Kusy -- Baird -- Analyst\n\nOK. And any reason -- so every other month, patients will be converted to monthly. Is that right?\n\nPravin Dugel -- President\n\nThey will continue as is. Yes, that is correct.\n\nColleen Kusy -- Baird -- Analyst\n\nOK. Thank you. Thanks for taking my questions.\n\nOperator\n\nThank you. And our next question today comes from Annabel Samimy with Stifel. Please go ahead.\n\nAnnabel Samimy -- Stifel Financial Corp. -- Analyst\n\nHi. Thanks for taking my question. Congratulations on the progress. So, I know this question has been asked many times.\n\nBut given the results that you've seen now in G2 and maybe some of the observations you made about large lesion sizes versus smaller lesion sizes. Do you think you still have a strong argument for a broad label? What's the rationale that you can give FDA to argue for that? I guess that's the first question. The second question I have is, but I know the messaging for patients to convince them of the treatment will be that if you go on treatment, you'll be able to drive for another five years or work for another 10 years. I know that's still somewhat intangible for them given it so far out.\n\nDoes the physician community have more objective tools yet to monitor how these patients are improving within a standard vision to keep them, I guess, motivated to continue on treatment? And then I guess the third question I have is in intermediate AMD. I guess given that there's a debate around how to convince patients to treat already here at the GA stage. What type of opportunity do you expect for intermediate AMD versus just straight GA?\n\nGlenn Sblendorio -- Chief Executive Officer\n\nAnnabel, good morning, and thank you for the three questions. Pravin, I'll turn this one to you.\n\nPravin Dugel -- President\n\nYes. Thank you, Glenn and Annabel. Good morning. Three very important questions.\n\nRegarding labeling, Annabel, as you know, it's premature at this point to have had any labeling discussions with the FDA. So, I want to make sure I mentioned that we have not entered any labeling discussions. Our expectations and hope are that we will have a broad label that is -- that require -- that is consistent with monthly injections. Let me take each one of them individually.\n\nAs we have seen in GATHER1, and we have not done this with GATHER2 as yet, the vast majority of the patients were within what is really defined as the clinical phobia, which is within 500 microns of the center point. We've presented that in several meetings. In fact, if patients were one micron, literally one micron away from the center point, those patients would be eligible. There are many patients in clinical practice who have parafoveal fixation and their center point may be involved, but there's a little island photoreceptor cells that allows them to navigate, not bump into chairs, not burn their hands on stoves, etc.\n\nSo, we believe that we would be eligible for a broad label and that those patients wouldn't be denied access to a safe and effective drug because of one micron. Now as far as monthly application is concerned, we want to have monthly injections on our label. As you know, my colleagues don't really treat according to the label. You can see this from the anti-VEGF experience, for instance, most of us treat with a treatment extend regimen.\n\nAnd there is no anti-VEGF that has treatment extend on the label. So, the label is really there for reimbursement purposes. So, logically, it makes sense that you would want to have the maximum usage on the label so that any less would still be reimbursed. So, again, our expectation is that we'll have a broad label that says a monthly application.\n\nAnd again, I want to say that we have not entered into any formal labeling discussions with the FDA. As far as your second question in terms of function is concerned, you've identified a very important topic there, Annabel, which is that we really don't have a good measure of function at all. In fact, as we may have discussed earlier, visual acuity is not a good measure of visual function. At the end of the day, rarely are we going to dark tunnel with a bright light at the end.\n\nOur day consists of contrast sensitivity changes, color changes, minimum pops, or things like that. So, there really is no great function test -- we see this as an opportunity to expand the patient experience into an entirely new dimension. This has been done, for instance, in glaucoma with vision duty tests and so forth. And we are investing heavily in terms of expanding the patient experience.\n\nFor now, what I can tell you is the patients know there are lots of patients out there who may have a visual acuity of 2020 but will not be able to work -- will not be able to live a normal life because visual function changes. And you can imagine that if you had a spot on the side of your vision and you couldn't finish reading a sentence, it'd be very difficult for anybody to work and have a normal functional life. So, regardless of the visual acuity results, there is a visual function deficit, which will allow patients to come in. This happens all the time in other diseases as well, such as diabetes, for instance, such as molecular degeneration where visual acuity may be 2020, but because of the visual function deficit, patients are in desperate need of help.\n\nIn regards to intermediate AMD, I think your question was what are our plans going forward? As Glenn said, we've had very favorable discussions with the FDA. There's signs to back up the fact that intermediate AMD is driven by complement activation. And again, I go back to what I said regarding the functional benefits that one can potentially have even with intermediate macular degeneration. Intermediate macular generation is a very broad range.\n\nThere are patients with intermediate macular degeneration that have large -- that have serious fluid where patients experience minimal fops, changes in color, vision, etc. And those patients, I believe, would benefit greatly from Zimura as is with version 1. The last thing that I would say is, remember, what we have here is a safe and effective drug for the first time with two positive Phase 3 results. This is version 1 of Zimura.\n\nWe're investing heavily in version 2, which is the sustained delivery opportunities that we see. And we believe that this is just the very beginning of opening up a new door in the treatment of the largest cause of blindness in this country. Back to you, Glenn.\n\nAnnabel Samimy -- Stifel Financial Corp. -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And our next question today comes from Mike Ulz with Morgan Stanley. Please go ahead.\n\nMike Ulz -- Morgan Stanley -- Analyst\n\nYep. Good morning, and thanks for taking the question. Maybe I can just ask a follow-up on intermediate AMD. I know you're planning to have further discussions with the FDA to sort of fine-tune the potential trial design here, but just curious if you can share some of the primary endpoints you might be considering and what maybe some of the secondary endpoints are as well.\n\nThanks.\n\nGlenn Sblendorio -- Chief Executive Officer\n\nYeah, Mike, thanks for the question. And as we said before, these discussions are on a critical point. And we do need to have further discussions with them to come back to you with some specificity. So, I apologize, we're not being more specific today, but that's as far as we could go.\n\nI do just want to emphasize that we believe there's a path forward based on our discussions thus far and more to come on that. But we can't be that specific at this point. but we hope to be specific in the near future. So, sorry for punting that one.\n\nBut in order to get an adequate answer, we do need to continue the collaboration and dialogue with FDA.\n\nMike Ulz -- Morgan Stanley -- Analyst\n\nYeah, no problem. Thank you.\n\nOperator\n\nLadies and gentlemen, our next question today comes from Ellie Merle with UBS. Please go ahead.\n\nEllie Merle -- UBS -- Analyst\n\nHey, guys. Thanks so much for taking the question. Just your thoughts in terms of the recent NGM data, just any key learnings in terms of the biology of complement, or any read-through in terms of how you compare the different modalities for GA? And then just in terms of thinking about labeling, I know a lot of discussion around monthly versus every other month, but into the Appellate PDUFA and the potential label, are there certain things that -- and also in your discussions and your filings, are there certain considerations that we could see in the label such as potential for perhaps even multiple like -- or only every other month or just monthly and then in yours, do you see a potential to have every other month just given it's studied even though I know there's a preference for only monthly? And anything you're thinking about to keep an eye out for in terms of safety as well in terms of the labels. Thanks.\n\nGlenn Sblendorio -- Chief Executive Officer\n\nEllie, good morning, and thank you for the questions. I think there were three there, but I'll let Pravin start.\n\nPravin Dugel -- President\n\nEllie, good morning, and thank you. I think that the questions are coming in triplets now. So, I guess what I would say regarding the competitor's data, Ellie, is that it's our preference really not to comment on competitors' data. I think there's more data to be presented by NGM in the Retina Society Conference, which is going on right now.\n\nIn fact, I believe their talks are today. So, in general, we'd prefer, as you will understand, not to comment on competitors' data. In terms of the labeling, again, I go back to what I said earlier to Annabel's question, which is that our preference really is to have every month on the label, and we expect every month in a broad label -- what I will tell you is if you look at what my colleagues do, they will find what is appropriate for patients given the biomarkers for response. And what I mean by that is my expectation personally is that the treatment of macular degeneration, dry macular generation is really going to be the ultimate and personalized medicine.\n\nI think what you'll find is that we will have some information regarding baseline biomarkers that will determine response. Some patients, as you might imagine, will respond better. Some may not respond as well. Some patients may be prone to develop neovascularization, others may not.\n\nAnd I think we'll see some biomarkers that will suggest those kind of responses. And I think what my colleagues will do is treat accordingly based on those biomarkers. The next step would have obviously be genetic biomarkers and then perhaps layered on top of that would be AI. So, I think what you'll see really in the next five years or so is the ultimate and personalized medicine in the treatment of dry macular degeneration.\n\nThis is just the beginning. But ultimately, going back to your question, what we would want for obvious reasons for logistic reimbursement region reasons is the flexibility. So, we really would want every month on the label. Again, I want to say one more time that we are -- have not entered into any formal discussions regarding labeling with the FDA.\n\nBack to you, Glenn.\n\nOperator\n\nThank you. Ladies and gentlemen, our next question today comes from Eddie Hickman at Guggenheim Securities. Please go ahead.\n\nEddie Hickman -- Guggenheim Securities -- Analyst\n\nThanks. Good morning, guys, and congrats on all the progress. Just a few from me. Do you anticipate sharing any additional GATHER2 data, whether it's slope or functional visual measures or even additional safety data over time, like at 18 months or longer? And would that plan change if your EMA interactions end up requiring functional endpoints? Would it be worth reporting 18-month data? And then regarding the SPA agreement, can you just provide some additional details on those discussions that you had with the agency on the design and statistical plan? Do those -- does any of those assumptions change over the course of GATHER2 before you read out the data? Or was that the plan that sort of you agreed with the FDA? Thank you.\n\nGlenn Sblendorio -- Chief Executive Officer\n\nGood morning, Eddie, and thank you. And as for additional data, we continue to emphasize the data from GATHER1 and GATHER2 in the medical meetings. I think you'll see it in the Pasadena meeting, the Retina Society. We will present observed data that has been presented before.\n\nBut I think as we further get an understanding of what we have here, these presentations will highlight the full data set that we actually presented in the press release on the initial date. So, I think it's emphasis on the data set that we've put out there so far. We put quite a lot of safety data out there. We reinforce that again.\n\nSo, I think you'll continue to see presentations that reinforce the full data set that we outlined when we first disclosed the data. The important thing is now that I think we've had good discussions around GATHER2 is to really present both trials together. And I think you'll see that in future presentations, including the one at Retina Society, you're going to see both GATHER1 and GATHER2. I think it's very important that we talk about the totality of the two trials with a focus over the last 30, 30-plus days has really been on GATHER2.\n\nSo, you'll see the totality. And I think that will provide further insights on the favorable safety profile, as well as the efficacy. The second question, PravIn, do you want to take that?\n\nPravin Dugel -- President\n\nSure, I'll be happy to. Eddie good morning and thank you for the question. -- Remember, we have a prespecified statistical analysis plan, which was reviewed by the FDA as part of our SPAR agreement. And that plan had an endpoint at month 12 and month 24.\n\nNow we have absolutely no plans at all to look at the month 18 data. And I realize that others have done that after missing their primary endpoint at month 12. But remember, we hit our primary endpoint with two studies. So, there is really no reason whatsoever to compromise the integrity of the study by opening it up at month 18.\n\nSo, we have no plans to do so. Our SPA agreement is as clear as it can be, and I'll refer you back to a press release in July of a couple of years ago. And you'll see the SPA agreement very transparently and nothing has changed at all. In regards to further analysis of GATHER2, I'm not sure what more there is to show with safety.\n\nThere are zeros all over. And as I said earlier on, zero plus zero plus zero is zero. So, we'll continue to show safety analyses, but nothing is going to change other than the zeroes. The efficacy analyses you will also see.\n\nBut unfortunately, you're not going to see it at the pace that you or I want because remember, we're really focused entirely on the NDA submission at this time. All our resources are geared toward submitting the NDA as efficiently and with the highest quality possible. Thank you.\n\nEddie Hickman -- Guggenheim Securities -- Analyst\n\nJust a quick follow-up. Do you plan -- what about blinded safety data from like the open-label extension or the second year of GATHER2 or even the ongoing Stargardt trial? Is that something that you're seeing? And can you confirm that the safety continues in further treatment?\n\nPravin Dugel -- President\n\nSo, we're mapped, as you know, in the Stargardt trial, Eddie, we have not -- we remain masked. And we certainly don't want to compromise the integrity of that trial. But as you know, in these large trials, there is a data safety monitoring committee that meets on a regular basis. And if there are any safety concerns, it is the responsibility of the Data Safety Monitoring Committee to alert the sponsor.\n\nThat has not happened historically at all with Zimura in any of the trials. And there's been no change whatsoever in the Stargardt trial.\n\nEddie Hickman -- Guggenheim Securities -- Analyst\n\nGreat. Thanks. Congrats again.\n\nOperator\n\nThank you. Our next question today comes from Chris Howerton at Jefferies. Please go ahead.\n\nKambiz Yazdi -- Jefferies -- Analyst\n\nGood morning. This is Kambiz on for Chris. A couple of questions for me. What is the main difference between BCBA and LLBCBA? And what could have accounted for the differences in trends seen between those measures at 12 months and GATHER2? And I guess my third question would be for a year or two of GATHER2, you have both monthly and every other month arms.\n\nIf every other month is successful, would you want to submit an SNDA to get that on the label? Or could you provide some sort of literature decisions to help in their prescribing practices? Thank you very much.\n\nGlenn Sblendorio -- Chief Executive Officer\n\nPravin, go ahead, please.\n\nPravin Dugel -- President\n\nKambiz, good morning, and thank you for the question. So, it's a great question regarding vacate visual acuity and low aluminum best corrected visual acuity. There is some preliminary evidence that in low luminous visual acuity may be more sensitive in terms of photoreceptor cell dysfunction than in bright light. And thus, there have been some data suggesting that the sensitivity in low-aluminum visual acuity for photoreceptor cells that are not healthy, maybe greater.\n\nHowever, it's very difficult to do those tests. The luminous has to be completely controlled. It's not something that we're used to doing regularly. There's a great deal of variability.\n\nSo, quite honestly, it's not surprising to see a great deal of variability in these functional tests that we're not used to doing on a regular basis. We do a regular vision of Q on every patient that comes in, but low luminisal acuities really very rarely done. I don't know that it's ever done in clinical practice as a routine, but it is done in some clinical trials, and thus, the variability. In terms of GATHER2, Year 2, it really would be premature to discuss the results and the potential impact on the labeling.\n\nAs I said earlier on, our desire at this point is to have a broad label that has monthly on the label. Thanks for the question.\n\nKambiz Yazdi -- Jefferies -- Analyst\n\nThank you so much.\n\nOperator\n\nThank you. And our next question comes from David Nierengarten with Wedbush Securities. Please go ahead.\n\nDavid Nierengarten -- Wedbush Securities -- Analyst\n\nHey, thanks for taking my question. I just had one on commercial preparations. Just how are you thinking about discussing capacity with ophthalmologists? Do you think they have the ability to accommodate adding more shots to their schedule, things like that? And then a follow-up to that, do you plan -- or how are you thinking about strategies to get new patients versus maybe patients who switch from another therapy that might be approved shortly on to your Zimura?\n\nGlenn Sblendorio -- Chief Executive Officer\n\nYes, David, thank you for the question. And we do have Chris on today, but I think I'll take it. If I miss anything, Chris can add to it. On the capacity issue, I know that's been a theme that's been discussed recently in the investment community, and Chris is doing a lot of market research.\n\nAnd also, as you know, we're engaging customers now in an appropriate way, talking about things like capacity, new therapies, etc. And I think the community will be ready for this. I think they're excited to have a treatment. They will adapt accordingly.\n\nWe've seen something, and I was very fortunate to experience when the first anti-VEGF were launched. And people talk about capacities then and the retinal doctors adapted very well. So, there's different data points that have come out and they may struggle with capacity. Our data and the contingent market research.\n\nAnd part of our job in getting the market ready is to be sure that these offices can meet the patient flow. A big part of the issue for doctors seeing GA patients as they have no treatments. So, now with the treatment, we believe they'll adapt accordingly, and we don't see that as an issue. And we will share as we generate market research that supports that.\n\nOn the second question, just remind me, David, second question.\n\nDavid Nierengarten -- Wedbush Securities -- Analyst\n\nIf you have different strategies or thoughts on the proportion of the patients who might switch from an approved therapy.\n\nGlenn Sblendorio -- Chief Executive Officer\n\nAnd also, I think we also asked about how do we get these patients. We're also looking at not only the retinal practices but where these patients may be are they seeing optometrists and haven't been referred or to see an ophthalmologist and haven't been referred. And I think that's going to be a key part of the commercial plan is to unlock where these patients are and get them in to see their retinal specialists. As Pravin said, another part of the strategy you hear is the education, not only for the docs but also for the patients to get them in earlier.\n\nWe believe that earlier treatment will have better outcomes, more to come on that, and we need to put more data behind that, but that's our belief. And so, that's where we are. And just a word about where Chris is. He's built his organization out, and we have not yet hired the field force.\n\nI think those type of discussions will come when the NDA is filed. We'll have a better timeline on potential approval dates. But we think we're in a very good position with our commercial team. And I will tell you, just like the leadership team, the people that we're hiring on the commercial team have extensive retina experience.\n\nSo, looking forward to discussing this more as time goes on.\n\nDavid Nierengarten -- Wedbush Securities -- Analyst\n\nThanks.\n\nOperator\n\nThank you. And ladies and gentlemen, this concludes our question-and-answer session. I'd like to turn the call back over to Glenn Sblendorio for any closing remarks.\n\nGlenn Sblendorio -- Chief Executive Officer\n\nWell, thank you, and thank you to everybody for listening today. A lot has happened in the third quarter, as I summarized before, and I expect the same execution intensity in the fourth quarter, and we look forward to continued dialogue. I appreciate the interest and continued support from all on this call today. Bye-bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKathy Galante -- Senior Vice President, Investor Relations\n\nGlenn Sblendorio -- Chief Executive Officer\n\nPravin Dugel -- President\n\nDave Carroll -- Chief Financial Officer\n\nKen Cacciatore -- Cowen and Company -- Analyst\n\nGreg Harrison -- Bank of America Merrill Lynch -- Analyst\n\nColleen Kusy -- Baird -- Analyst\n\nAnnabel Samimy -- Stifel Financial Corp. -- Analyst\n\nMike Ulz -- Morgan Stanley -- Analyst\n\nEllie Merle -- UBS -- Analyst\n\nEddie Hickman -- Guggenheim Securities -- Analyst\n\nKambiz Yazdi -- Jefferies -- Analyst\n\nDavid Nierengarten -- Wedbush Securities -- Analyst\n\nMore ISEE analysis\n\nAll earnings call transcripts"
}