{
  "companyName": "Jumia Technologies AG-ADR",
  "companyTicker": "JMIA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/17/jumia-technologies-ag-adr-jmia-q3-2022-earnings-ca/",
  "content": "Jumia Technologies AG-ADR (JMIA -3.89%)\nQ3 2022 Earnings Call\nNov 17, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen. Thank you for standing by. Welcome to Jumia's results conference call for the third quarter of 2022. [Operator instructions] After management's prepared remarks, there will be a question-and-answer session.\n\nI would now like to turn the call over to Safae Damir, head of investor relations for Jumia. Please go ahead.\n\nSafae Damir -- Head of Investor Relations\n\nThank you. Good morning, everyone. Thank you for joining us today for our third quarter 2022 earnings call. With us today are Francis Dufay, acting CEO of Jumia; and Antoine Maillet-Mezeray, executive vice president, finance and operations.\n\nAs previously announced, a new management board and acting CEO have been appointed while Jeremy Hodara and Sacha Poignonnec have stepped down from their co-CEO role. The supervisory board has appointed Francis and Antoine as members of the company's management board. Francis, our acting CEO, has been with the company since 2014 and has held multiple senior leadership roles, including CEO of Ivory Coast. He was recently executive vice president Africa, with responsibility for the group's e-commerce business across Africa.\n\nFrancis has a track record of successfully scaling e-commerce operations in Africa, with a strong focus on profitability. He has been based in Ivory Coast since 2014 and is an Ivorian national. He brings a deep understanding of our business and the markets that we operate in. Antoine, whom you know, was previously group CFO and has now been elevated to executive vice president, finance and operations.\n\nAntoine has been with Jumia for over six years and played a very important role in the organization. His expanded areas of responsibility will, no doubt, benefit from his expertise and deep knowledge of the business. Let me now cover the safe harbor. We would like to remind you that our discussions today will include forward-looking statements.\n\nActual results may differ materially from those indicated in the forward-looking statements. Moreover, these forward-looking statements may speak only to our expectations as of today. We undertake no obligation to publicly update or revise these statements. For a discussion of some of the risk factors that could cause actual results to differ from the forward-looking statements expressed today, please see the risk factors section of our annual report on Form 20-F as published on April 29, 2022, as well as our other submissions with the SEC.\n\nIn addition, on this call, we will refer to certain financial measures not reported in accordance with IFRS. You can find reconciliations of these non-IFRS financial measures with the corresponding IFRS financial measures in our earnings press release, which is available on our investor relations website. With that, I'll hand it over to Francis.\n\nFrancis Dufay -- Acting Chief Executive Officer\n\nThank you, Safae. Welcome, everyone, and thanks for joining us today. On this call, we will walk you through our Q3 performance and provide you with an overview of our strategy to take the business to profitability. While the results of the third quarter show some progress toward breakeven, we want to make even more meaningful progress and further reduce our cash utilization.\n\nAdjusted EBITDA loss reached its lowest level in five quarters at $45.5 million, down 13% year over year. Adjusted EBITDA loss as a percentage of GMV dropped below 20% at 18.9% of GMV. The reduction in adjusted EBITDA loss was driven by a strong increase in gross profit, which was up 29% year on year; and a significant reduction in sales and advertising expense, which was down 32% over the same period. This is very much in line with what had been communicated to the markets earlier this year, which is an acceleration in monetization, coupled with cost reduction.\n\nIf the results and progress I'm creating begs the question why we need to rewrite strategy to take the business to profitability. The answer is that we are confident that we can do much better across a number of areas, and this will help us make even more meaningful progress toward profitability. We want to drive sharper execution, which is even more critical in the context of a challenging macroeconomic environment. We have outlined on Page 6 the highlights of our strategy.\n\nHere, we recognize the strategic drivers of our path to profitability: usage growth, cost discipline, monetization, and the continued development of JumiaPay. And that's not a price, to restore stability, we need a larger scale, more revenue, and a much more efficient cost structure. However, this is all about the details of execution. What levers to pull to drive growth in a sustainable manner? Where to cut costs in a way that doesn't affect our long-term growth? And how to monetize while adding value to the sellers? And this, we believe, requires two things.\n\nOne is a deep knowledge of the market dynamics and operations on the ground in our markets. And two, obviously, focus and discipline. On the first point, the execution details of our strategy are well-rooted in deep knowledge of the operations and the market. We use the learnings from our 11 markets and many case studies of success to inform the strategy.\n\nThe execution of this strategy happens on the ground in Africa. That's why we have taken very swift action over the last week, significantly reducing our presence in Dubai and relocating most of the group leadership to Africa. On the second point, we need much more focus in terms of scope of projects and the activities that we undertake. We cannot be sharp in our execution if we are spreading ourselves too thin across too many projects.\n\nWe need to stop projects that bring limited value to the platform and focus on what matters. And again, to know which projects matter the most, we need to be on the ground with much closer feedback loops with the markets. So, before providing you with more details on strategy, I will pass it on to Antoine, who will walk you through the Q3 performance. Thank you.\n\nAntoine Maillet-Mezeray -- Chief Financial Officer\n\nThanks, Francis. Hello, everyone. I'll start with the operating performance and KPIs of e-commerce and JumiaPay before moving on to commentary on financial metrics. In terms of e-commerce dynamics, we sustained growth across all relevant usage KPIs despite more challenging macroenvironment.\n\nQuarterly active consumers reached 3.1 million, a 3% year on year, as we continue to acquire new consumers and grow the base of returning consumers. Orders reached 9.4 million, up 11% year on year, with sustained volume growth across product categories, with the exception of JumiaPay app digital services, where we scaled back marketing investments and incentives to support unit economics. The fastest growing category in all terms was food delivery, which continues to exhibit strong momentum with orders up 38% year on year. Food delivery remains a core aspect of our consumer value proposition, and we will continue driving its development across our largest markets and in Nigeria, in particular.\n\nGMV reached $240.7 million USD, up 1% year on year and up 14% on a constant currency basis. FX was a material headwind to GMV performance in the second quarter of 2022, with all local currencies depreciating against the USD. In particular, during the nine months period ending September 30, 2022, compared to the same period of 2021, Nigerian naira, Egyptian pound, and West African CFA depreciated by 5%, 14%, and 13%, respectively, against the dollar. In terms of category trends, we started to see a stabilization of the GMV category mix.\n\nPhones and electronics accounted for 36% of GMV in Q3 '22, in line with their contribution in Q3 '21. The fastest growing category in GMV terms was food delivery, up 25% year on year, supported by the strong volume growth in this category. While usage growth held up in Q3, we observed the softening of usage growth trends as we moved toward the end of the quarter due to a deteriorating macroenvironment. The combination of inflation in commodity and food prices, alongside a stronger dollar and weaker local currencies, is weighing on consumer spend and sentiment.\n\nIt also makes it more challenging for all our sellers to serve goods, particularly for those more exposed to imports. With that in mind, we took the decision to suspend the GMV growth guidance for the full year. We will come back to that at the end of this section. Let's now turn to JumiaPay operating metrics.\n\nTPV reached $66.6 million USD, up 3% year on year and 16% on constant currency basis. This was supported by the strong growth in both GMV and TPV on our food delivery platform. On-platform penetration of JumiaPay as a percentage of GMV remained stable at 28% in Q3 '22, versus 27% in Q3 '21 as we maintain a disciplined marketing approach to driving on-platform penetration. JumiaPay transactions reached 3 million in Q3 '22, down 1% year on year, impacted by softer transactions performance in the JumiaPay app as we scale that marketing investment and promotional intensity in the app.\n\nOverall, 32% of orders placed on the Jumia platform in Q3 '22 were completed using JumiaPay, compared to 36% in Q3 '21. As JumiaPay penetration is almost 100% on the JumiaPay app, the reduced share of JumiaPay app in the transactions mix led to a decline in the overall JumiaPay transactions penetration as a percentage of orders. JumiaPay remains a core part of our platform, and we intend to continue driving its development, both on and off platform, in a very disciplined manner. Let's now move on to financials, starting with revenue.\n\nRevenue reached $50.5 million USD, up 18% year on year and up 33% on a constant currency basis. This was driven by strong momentum in market-based revenue, which was up 27% year on year and 41% on a constant currency basis. First-party revenue growth was softer, up 2% year on year and 17% on a constant currency basis as we undertook less business on the first-party basis compared to Q3 '21. We retain an opportunistic approach to our first-party activity.\n\nThe aim is to bridge gaps in assortment on our platform on an ad-hoc basis. We intend to enhance first-party business margins by improving the processes and systems in this business and reducing business complexities by scaling back the FMCG category in certain countries. Other revenue was up 53% year on year and 69% on a constant currency basis, partly due to the momentum of our logistics-as-a-service offering, which generated about $1 million USD of revenue during the quarter. Let's now unpack the growth dynamics of our marketplace revenue.\n\nMarketplace revenue reached $32.2 million USD in Q3 '22, posting its fastest year-on-year growth rate in nine quarters. Two-thirds of the marketplace revenue growth came from commissions, which reached an all-time high of $12.6 million USD, up 56% year on year, driven by commission take rate increases implemented over the past couple of quarters. Value-added services were the second largest source of market-based revenue at $8.4 million USD, up 32% year on year. This was a result of increased logistics revenue from local and international sellers due to increased pricing of services.\n\nOn the flip side, fulfillment revenue, which includes shipping fees charged to consumers, reached $7.9 million USD, down 11% year on year as a result of the selective deployment of next-day free delivery. We are currently making adjustments to the free shipping program, introducing higher minimum basket size and further restricting geographical scope to support our unit economics. Last but not least, marketing and advertising was our fastest-growing revenue streams, up 64% year on year, reaching $3.3 million USD. This was the result of our sustained effort to enhance the value proposition of our ad solutions for sellers and third-party advertisers.\n\nThe accelerating market-based revenue growth drove strong gross profit growth, which was up 29% year on year and 43% on a constant currency basis, reaching $33 million USD. And gross profit margin as a percentage of GMV reached an all-time high of 13.7%. Moving on to cost, starting with fulfillment expense, which reached $23.6 million USD, up 7% year on year and 22% on a constant currency basis. This was a result of volume growth, with orders up 11% during this period, but also inflationary pressure on fuel and wages.\n\nWhile we expect continued inflationary pressure and discuss line in the near term, we intend to improve fulfillment economics in the near term by driving skill efficiencies and enhancing productivity in our physical infrastructure. Sales and advertising expense was $16.4 million USD, down 32% year on year and 28% on a constant currency basis as we brought more discipline to our marketing investment. This led to an improvement of marketing efficiency ratios, with sales and the advertising expense per order decreasing by 38%, from $2.8 to $1.7 per order. Sales and advertising expense as a percentage of GMV decreased to 6.8%, which was a 325-basis-point improvement year on year.\n\nWhile this progress is encouraging, we intend to drive even further marketing efficiencies by improving the relevance and cost-efficient effectiveness of our marketing channels. Let's now turn to tech and G&A costs, starting with tech and content expense, which reached 13.6 million, up 44% year on year and 56% on a constant currency basis. This was mostly due to technology staff costs increases due to headcount increases completed in H2 last year. That said, we have been much more disciplined on the headcount front over the past few months.\n\nWe drove a decline in technology staff cost in the sequential basis, which explains the 5% decline in tech between the second and third quarters of this year. G&A, excluding share-based compensation, reached $28.3 million USD, up 12% year on year and 22% on a constant currency basis. This was mostly a result of staff cost increases on a year-on-year basis. That being said, the hiring freezes implemented earlier this year started paying off as the staff cost component of G&A, excluding share-based compensation, declined by over 6% on a sequential basis in Q3 '22.\n\nWe intend to drive even more staff cost savings and are implementing headcount reduction across a number of areas in business to create a leaner and more agile organization. To wrap up on cost, we have made good progress in the sales and advertising front and increased staff cost discipline is starting to pay off. That said, we do have room to take even more decisive action across cost lines to drive through their efficiencies, and we have a clear action plan to achieve that. Let's now move on to balance sheet and cash flow items.\n\nCapex in Q3 '22 was $3 million USD, mostly relating to logistics and technology equipment purchases. Net change in working cap at a notable impact of $13.1 million USD, largely as a result of a significant decrease in trade payables corresponding to the payment of Jumia anniversary campaign invoices during Q3 '22. Cash utilization for the quarter was 62.2 million, which is a 5% decline compared to Q2 '22. At the end of September '22, we had a liquidity position of $285 million USD, comprised of 104 million of cash and cash equivalents and $180 million USD of term deposits and other financial assets.\n\nI conclude my part with a review of our guidance. As mentioned earlier, in the light of the highly volatile and unpredictable macroenvironment, we have decided to suspend the full year 2022 GMV growth guidance, as well as gross profit guidance for H2 '22, which is linked to GMV. That said, we reiterate our guidance for all the other metrics that we guided on earlier this year. We continue to expect to spend between 35 million and 45 million in terms of advertising in H2 '22.\n\nThis implies sales and advertising expense of 19 million to 29 million in Q4 '22. For the full year 2022, we continue to expect an adjusted EBITDA loss of $200 million USD to $220 million USD. This implies adjusted EBITDA loss of 42 million to 62 million in Q4 '22. For the full year 2023, we expect adjusted EBITDA loss to be lower than for the full year 2022.\n\nWe will be providing quantitative guidance for that as part of our Q4 '22 earnings release. Lastly, we reiterate our capex guidance for the full year of 2022 of $10 million USD to $15 million USD. With that, I'll hand it over to Francis for an overview of our strategic plan.\n\nFrancis Dufay -- Acting Chief Executive Officer\n\nThanks, Antoine. We are committed to making meaningful progress toward profitabilities. We have a clear plan to get there and have already made significant management changes to ensure that we have the best teams to execute on this strategy. And we start with the first level of strategy, which is enhanced business focus.\n\nThis is an overarching principle of our strategy that will guide execution across all areas of the business. We intend to do less and better. We plan to allocate our resources and teams to projects that bring proven value to our platform and the broader ecosystem. This means that we will be pausing or stopping projects that do not meet those criteria.\n\nHere are some examples. First, we plan to discontinue Jumia Prime. Over the past couple of years, we tested the concept of a monthly subscription program offering free delivery to consumers. The results from this experiment in terms of consumer traction and stickiness fell short of all targets as the market is probably too early in terms of adoption curve.\n\nThat's why we're now stopping this initiative. This is an example of how we plan to draw reality conclusions in a timely manner from the experiments we do. We aim to assess within a reasonable time frame whether a pilot is successful or not and take action accordingly to avoid committing resources for too long to projects that do not work. In addition, we're suspending logistics-as-a-services to our e-commerce client in several countries.\n\nWe believe management efforts in many countries will be better invested in improving the logistics efficiency for the core e-commerce business. However, we will continue developing this activity in countries such as Nigeria, Morocco, and Ivory Coast, where the proof of concept for this service has already been established and where we are able to allocate the right resources. We are also scaling back our first-party grocery e-commerce in geographies where the category remains subscale in order to support our unit economics. Grocery can be a very relevant category for more advanced markets with sufficient [Inaudible] efficiency.\n\nIn smaller markets, it has added significant operational complexity without providing much upside in terms of consumer adoption and stickiness. The priority is to master the basics in the smaller markets, hence our decision to discontinue first-party grocery there. Those two examples of first-party grocery and logistics-as-a-service are representative of how we intend to drive execution in a more nuanced manner by geography. It is difficult to push projects uniformly across all markets given the differences in scale and development of our platform.\n\nWe need to do what's right for each market given stage of development, and sometimes this means just focusing on the basics. What I have just covered here is a non-exhaustive list of discontinued or amended projects that we'll be constantly reviewing to optimize our capital and resource allocation. Moving on to the second level of our strategy: driving sustainable long-term growth through enhanced e-commerce fundamentals. Historically, usage growth was mostly fueled by higher promotional intensity and marketing spend, which led to a deterioration of unit economics in phases of growth acceleration.\n\nWe are confident that we can simultaneously improve our economics and support long-term growth by working on the core e-commerce fundamentals. How will that translate in terms of action? Mastering the e-commerce basics of selection, price, and convenience across all geographies. One of our first priorities is to offer customers the best selection with sufficient stock at the best prices in each one of our core categories. We're at a very early stage of e-commerce development in Africa, and shifting relevant and sufficient supply online can sometimes be challenging.\n\nWe have a clear action plan to address that, with a focus on core categories. We mean by core categories the bread and butter categories of the platform. These are phones and consumer electronics, home appliances, fashion, and beauty. For these categories, we are developing stronger relationships with brands and local distributors to secure supply and get better prices.\n\nLast but not least, we have room to further improve customer experience and further embed a mindset of customer centricity within the organization. We plan to continue investing in our technology backbone, though in a more disciplined manner, to make our platform even easier to use and more engaging for customers. To conclude on the usage front, we are taking a fundamental-led approach to usage growth. Marketing and consumer incentives are very important, and there's a place for that in our strategy.\n\nBut marketing cannot compensate for gaps in fundamentals like product supply. We have to address these first. Let's now move on to cost discipline. We intend to take more decisive action on the cost front to drive efficiencies across the full cost structure.\n\nIt is, of course, easy to cut marketing and consumer incentives budgets. It is much harder to open the box on each and every cost line and ensure that we are operating at the best level of efficiency across each one. And this is what we plan to do. On the logistics side, for example, we intend to work on each of cost components.\n\nWe plan to optimize our freight and shipping costs by launching tight negotiations with our third-party partners to ensure we are getting the best prices on each logistic group. We are -- within our physical infrastructure, we intend to increase staff productivity by enhancing our processes while working on consumable costs, such as reducing the use of packaging. We will also take a more disciplined approach to product category development, scaling back in product categories with challenging fulfillment economics such as groceries that we just explained. On the marketing front, we intend to improve marketing efficiency by leveraging best practices from countries with the best efficiency ratios.\n\nWe have made some progress in improving marketing efficiency, bringing it down to $1.7 per order and 6.8% of GMV. That said, we have countries with much better marketing efficiency ratios, and there are important lessons to learn from these markets. With that in mind, we intend to focus our spend on the marketing channels that drive the best returns on investments. We will also put more focus on local marketing channels, including above-the-line education and activation initiatives.\n\nIt will allow us to shift a higher share of marketing expense into local currencies while adopting an approach tailored to our markets. With respect to technology, we plan to continue investing in our technology backbone, but we intend to do so with more discipline, prioritizing our development road map on products and features that deliver immediate benefits in terms of units for consumers and for sellers. Last but not least, G&A. We started seeing some progress from the hiring freeze implemented earlier this year with staff cost coming down by 6% in Q3 compared to Q2.\n\nWe intend to drive more staff cost savings and reduce headcount. We have taken steps to significantly reduce overhead expenses in Dubai with meaningful G&A savings for the group and long-term benefits from locating decision centers back to Africa. To conclude on the cost discipline topic, we intend to work with a very granular manner across the full cost structure and take very deliberate action to cut costs. Let's now turn to monetization, where we will continue to adhere to a balanced approach to drive growth across multiple revenue streams.\n\nWe have made good progress on monetization in Q3, with gross profit accelerating by 29% and gross profit as a percentage of GMV reaching an all-time high at 13.7%. However, we are being more cautious with the level of monetization pressure we apply on sellers as we also need to improve fundamentals of product assortment, supply, and prices. This means that in the near term, we do not intend to implement any meaningful take rate increases. On the other hand, we will continue developing services that bring value to our sellers and broader ecosystem participants such as advertising.\n\nTo conclude on monetization, we look at monetization very much as a byproduct of scale and are focused on driving growth and value for sellers in order to monetize. Let's now move on to JumiaPay. The development of JumiaPay on and off platform remains a priority for us. And here, again, the overarching principle of business focus and discipline applies.\n\nWe will work on making it a strong enabler for economic business, focusing on a more targeted number of products and ventures. We will retain the disciplined approach to driving on-platform payment penetration with disciplined marketing spend and consumer incentives. Lastly, we continue to be focused on expanding our off-platform payment processing solution in Nigeria and Egypt, where we have previously obtained the relevant licenses to do so. To conclude, the strategy that I've just outlined remains consistent with our calculus.\n\nThe important change is that it addresses, at the same time, profitability and growth with a greater sense of urgency and a concrete road map of decisive actions. I would like to emphasize that the current macro volatility does not affect, in any way, our very positive long-term outlook for Africa. Africa remains the last frontier for e-commerce in the world, with very attractive demographic and digitization dynamics. I have spent the last decade with Jumia developing e-commerce on the ground in Western Africa.\n\nI know firsthand the challenges of operating in our markets and successfully balancing growth and profitability. But I also know firsthand that we have great brands, a very strong platform, and incredibly talented and dedicated teams. I am very confident that we can build a large and profitable e-commerce platform in Africa. With that, we are ready to take your questions.\n\nOperator\n\nLadies and gentlemen, the floor is now open for questions. [Operator instructions] Your first question for today is coming from Aaron Kessler at Raymond James.\n\nAaron Kessler -- Raymond James -- Analyst\n\nGreat. Thanks for the questions. A couple of questions. First, just any way to size the GMV impact from scaling back some of these initiatives that you talked about? Second, I think you talked about kind of excessive commission rate increases in the release.\n\nCan you -- relevant more details around that? And it sounds like you're slowing that increase going forward, but any impact on GMV you felt in the quarter from the higher commission rates as well? Then I have a follow-up question.\n\nFrancis Dufay -- Acting Chief Executive Officer\n\nOK, let me answer the first two and I ask [Inaudible] on this. On GMV effect from scaling back a couple of initiatives, when we assess the initiative as a function of benefits versus costs and basically redoing business, we believe that we can scale back some initiatives without meaningfully harming our top line. We believe that refocusing, that having our teams focus on a shorter number of projects, depending on geographies, will enable them to deliver greater impact on other topics. That's basically the whole point of refocusing on basics.\n\nSo, we believe the total outcome for the business will be positive. When it comes to commissions increase, so our point here is very much that we need to create value for the vendors and all the sellers on the platform. What drives that is that vendors need to see the value and the benefit from working with Jumia. And we very much see monetization in the future as a byproduct of scale.\n\nSo, scaling with vendor, solving the pain points will enable us to monetize. That they create pressure needs to be monitored very carefully as one of our core pillar -- core groups now is focused on supply. We very much want to build supply -- strong supply on the set of core categories, and we don't want too high take rates to come in the way. So, this is why we plan to be relatively careful with this regard.\n\nAaron Kessler -- Raymond James -- Analyst\n\nOK. And finally, just in terms of operating expenses, where do you think are the biggest areas for leverage or cash flow reductions going forward? Is it G&A or something else?\n\nFrancis Dufay -- Acting Chief Executive Officer\n\nSo, I mean, as we said, we're really going down to whole P&L and we're opening the box on every type of cost that we have across the structure. So, we, of course, are looking at G&A, which is possibly one of the most short-term impacts. We are already redoing our central structural -- headquarters structure in Dubai with meaningful impact, and we plan to locate most of the leadership toward Africa and streamlining our governance and leadership structure across all countries. That's one.\n\nBut we also believe that we -- I mean, we're actually quite sure that we have meaningful impact to capture from logistics efficiency. You see that -- you see the evolution of costs that we posted this quarter. I would not say that we're super happy with the trend, and we believe that we can do better. We can capture a lot of efficiencies with many detailed measures across our business lines.\n\nOne very simple and basic example is our use of packaging material. This vary a lot across different countries, and we intend to plan many countries toward the best benchmark that we have. That was for logistics. We can also generate significant savings on [Inaudible] where we also have countries that show better practices that are rich and so we can learn from those countries to drive way greater efficiency.\n\nSo, we do really believe that we have efficiency and cost-cutting structure pretty much across the board, and we're confident that we can achieve that with the team and the plan that we have.\n\nAaron Kessler -- Raymond James -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nYour next question for today is coming from Catherine O'Neill at Citi.\n\nCatherine O'Neill -- Citi -- Analyst\n\nGreat. Thank you. I just want to ask you if you could comment in a bit more detail on one of the things you mentioned in the release about seeing softer usage trend toward the back of the third quarter, which you expect to persist in the fourth quarter. Could you maybe just provide a bit more detail on what you're seeing, if that varies by market, and how much you saw that sort of deteriorate as we went through the third quarter? The other thing I wanted to ask about was the product mix.\n\nI think you said you're moving away from FMCG. I may have misheard that. But you seem to be sort of emphasizing consumer electronics, fashion, beauty, etc. So, how should we think about the sort of take rate or margins if you're moving perhaps toward -- back toward consumer electronics, which tend to be sort of lower take rate? And then the one thing I want to talk about with the cash burn, so it looks like it was similar in 3Q and 2Q about 70 million each quarter.\n\nI just wondered if you could give us any sort of idea on when you think this should start to reduce -- when these initiatives start to kick in on the cash side?\n\nFrancis Dufay -- Acting Chief Executive Officer\n\nOK. So, let me -- hi, Catherine. Let me take the first two questions and then pass on to Antoine [Inaudible] Regarding soft usage trend that you mentioned, well, you see that in the quarterly reports. We see 1% GMV growth year on year over the quarter.\n\nSo, you can -- I mean, I guess everyone can draw their own conclusions about what softening means here. But obviously, we've been dealing with volatile and difficult macroeconomic context, significant local currency depreciation and volatility, which led particularly -- and this is a great example of how it can impact us. It led to many governments taking measures to protect their currencies and, for example, restricting imports, which directly impacted our ability to get supply on the platform. So, this is the kind of headwind that we'll have to fight again.\n\nAnd this is very much something that we see across all the markets. There are some differences, of course. Some markets are more affected by those kind of measures. But it's something that we see happening across Africa at the moment.\n\nHowever, we're very confident that our plan to focus on supply and distributors and increasing our relevance to the biggest and major suppliers in the markets can mitigate those impacts and is the right one in this complicated macroeconomic context. Then on your second question, when it comes to the mix of categories. So, as I mentioned, we're scaling back first-party grocery in some geographies, not all of them, by the way. We want to make sure that we keep pushing and we keep investing in that segment in selected geographies which makes sense.\n\nWe actually -- I mean, the fact that we want to be more reasonable and more focused in the new categories that we develop doesn't prevent us from doing the right things on the other categories. So, we're also developing high ROI categories such as consumer electronics, like I mentioned, and this does not conflict with our push on everyday categories such as health, beauty, and fashion, for example. Specifically on your question on take rates on those categories, the high [Inaudible] categories, indeed, we don't sell a phone or laptop or TV with the same margin at which -- that we would capture for, let's say, a pair of shoes. However, what matters to us is the whole equation with our logistic costs and our marketing costs.\n\nWe know for a fact that on the consumer electronic categories, our operating model works, and we can get very healthy for economics across all of our markets from those categories. So, we're very confident in the fact that we need to develop or build supply on these categories, and it does not conflict with our focus on everyday categories. Antoine, may I take -- let you take the question on cash.\n\nAntoine Maillet-Mezeray -- Chief Financial Officer\n\nYes, I'll take the third one. The cash burn is a function of three things: capex, working cap movement, and EBITDA. Regarding the capex, 2022 has been, so far, a year of investment, and we intend to decrease the capex investment in the coming quarters. On working cap, we have been, this quarter, impacted by payment of Jumia anniversary marketing invoices, which impacted significantly.\n\nAnd we must keep in mind that in the market we are operating in here in the current macro, trust with suppliers is very important, and we have consciously decided to be super sharp on payment terms engine from time to time to secure the product to pay in advance. This has to be conducted orchestral. Then the key driver to reduce cash burn is reducing the cost, and we're going to reduce EBITDA. At this stage, it's a bit too early to give more guidance, and we'll give you more information in the Q4 release.\n\nCatherine O'Neill -- Citi -- Analyst\n\nOK. Thank you.\n\nOperator\n\nYour next question for today is coming from Lamont Williams at Stifel.\n\nLamont Williams -- Stifel Financial Corp. -- Analyst\n\nHow you doing? Thanks for taking my questions. The first is on food delivery. It's been one of the fastest growing categories in the last couple quarters. Did you just talk about the unit economics for that category for food delivery overall? And then secondly, on the sales and marketing cost.\n\nHow are you thinking about the balance between what level you can have for marketing costs and still grow your active customer base at a pretty healthy rate? How do you think about where that balance is and kind of -- how well are they kind of an absolute expense rate [Inaudible] Thank you.\n\nFrancis Dufay -- Acting Chief Executive Officer\n\nAll right. So, for your first question on food delivery. So, that's our restaurant segment. So, as we mentioned, the trends are pretty good, plus 25% year on year GMV growth.\n\nAnd we're very happy with the dynamics that we see in the sector. This is very much a core part of our business, and we intend to keep on pushing in this segment, especially in a very successful geography like Nigeria. Anyway, you mentioned economics. This is a segment that we intend to manage with the same level of increased discipline, increased focus, and increased level of execution across the board.\n\nWe are open to stopping projects on a country-by-country basis if we believe they're not adding value, and we'll really apply the same principle that we are playing to the rest of the e-commerce business. On your second question toward the balance between marketing and growth, if I get it correctly. Very interestingly, we have many success cases in the group of countries that have been able to manage very, very -- I mean, very good level of efficiency in marketing spend while building up new categories and building growth for the whole business and a very healthy -- with a very healthy economy. So, we don't really see a balance between growing and spending in marketing.\n\nIt's more about doing the right thing, spending on the right channels with the right level of efficiency. Having said that, for Q4, we reiterate our guidance on marketing spend. And we -- of course, marketing spend remains a part of the strategy. And I may have missed your first question.\n\nLamont Williams -- Stifel Financial Corp. -- Analyst\n\nNo, actually, can I just follow up question on the assortment? You talked about there are some gaps in assortment and you kind of -- you're going to move back into consumer electronics. Are there any other categories where you might see some gaps in the assortment that you can give a little more detail on?\n\nFrancis Dufay -- Acting Chief Executive Officer\n\nVery good question. So, as we mentioned, we -- I mean, you know, it really -- we want to open the book country by country, geography by geography, which is what makes sense for the business. We need that kind of level of granularity. When you look at country by country, the overall -- I mean, the big picture is that our core categories are more or less the same across the board.\n\nAnd that's where we know that we have very good customer traction and we can have healthy economics, and we know it for a fact. That's electronics, including phones, TV, computing -- consumer appliance, home categories, fashion, and beauty. These are the bread and butter categories of Jumia economics, in general. And across those categories, we see that -- I mean, all countries are not on the same level of development, and we are trying to do the right decisions country by country, category by category, distributor by distributor, brand by brand to improve our assortment and get the supply.\n\nThese are really basic. We want to win at this stage. Of course, there are ways to go more, to go deeper, and to expand into new categories. I mean, I can give you an example.\n\nLast year, Ivory Coast did great progress on building the category of agricultural inputs, agricultural tools, and insurance. This is just an example. We're open to expanding into new categories. But really, at this stage, we just want to make sure we get the basics right.\n\nLamont Williams -- Stifel Financial Corp. -- Analyst\n\nOK, great. Thank you.\n\nOperator\n\nThere appear to be no further questions in queue. I would like to turn the floor back over to Francis for any closing comments.\n\nFrancis Dufay -- Acting Chief Executive Officer\n\nThank you. So, I would like to thank all of you for joining the call today. We will be very much looking forward to sharing with you more progress on our plan in three months. Thank you very much.\n\nOperator\n\nThank you. [Operator signoff]\n\nDuration: 0 minutes\n\nSafae Damir -- Head of Investor Relations\n\nFrancis Dufay -- Acting Chief Executive Officer\n\nAntoine Maillet-Mezeray -- Chief Financial Officer\n\nAaron Kessler -- Raymond James -- Analyst\n\nCatherine O'Neill -- Citi -- Analyst\n\nLamont Williams -- Stifel Financial Corp. -- Analyst\n\nMore JMIA analysis\n\nAll earnings call transcripts"
}