{
  "companyName": "Endeavor Group Holdings, Inc.",
  "companyTicker": "EDR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/endeavor-group-holdings-inc-edr-q2-2022-earnings-c/",
  "content": "Endeavor Group Holdings, Inc. (EDR 2.78%)\nQ2 2022 Earnings Call\nAug 11, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for your patience, and thank you for attending today's Endeavor second quarter 2022 earnings conference call. My name is Amber, and I will be your moderator for today's call. [Operator instructions] It is now my pleasure to hand the conference over to our host, James Marsh, SVP, head of investor relations. James, please proceed.\n\nJames Marsh -- Senior Vice President, Head of Investor Relations\n\nGood afternoon, and welcome to Endeavor's second quarter 2022 earnings call. A short while ago, we issued a press release, which you can view on our investor relations site, investor.endeavorco.com. A recording of this call will also be available via that site for at least 30 days. Today, you'll hear from Endeavor's CEO, Ariel Emanuel, and CFO, Jason Lublin, before we open for questions.\n\nThe purpose of this call is to provide you with information regarding our second quarter 2022 performance in addition to our financial outlook for the balance of the year. I do want to remind everyone that the information discussed will include forward-looking statements and/or projections that involve risks, uncertainties and assumptions, as well as described in the risk factors section of our filings with the Securities and Exchange Commission, including our 10-Qs and 10-K. If these risks or uncertainties ever materialize or any assumptions prove incorrect, our results may differ materially from those expressed or implied by such forward-looking statements and projections. Forward-looking statements speak only as of the date they are made, and we undertake no obligation to update them publicly in light of new information or future events, except as legally required.\n\nOur commentary today will also include non-GAAP financial measures, which we believe provide an additional tool for investors to use in evaluating ongoing operating results and trends. These measures should not be considered in isolation from or as a substitute for, financial information prepared in accordance with GAAP. Reconciliations between GAAP and non-GAAP metrics for the reported results can be found in our press release issued today. As well as in our reconciliations posted on our IR website.\n\nWith that, I'll turn it over to Ari.\n\nAri Emanuel -- Chief Executive Officer\n\nThanks, James. This quarter continues to showcase the fact that our company occupies an incredibly unique position within the sports and entertainment landscape. We're benefiting from various secular tailwinds ranging from sports rights to premium content to live events, and we're also built to withstand many of the challenges that other companies are constantly having to overcome. We have a highly diverse but highly complementary portfolio.\n\nWe have deep category expertise and a global scale across these secular trends. And as it relates to the content, we sit on the supply side of the equation, allowing us to benefit from growing demand no matter the end user. As a result of our unique position and our continued strong performance across our segments, second quarter revenue is up 18%, adjusted EBITDA up nearly 82% year over year. Given these results and our line of sight into the remainder of the year, we've raised our adjusted EBITDA guidance for '22.\n\nJason will walk you through the specifics what drove our second quarter performance. But first, I'll spend a few minutes on the secular trends we index against and how Endeavor stands to benefit due to the unique offering we built. First, as it relates to the growing value and demand for sports rights. There have never been more buyers or greater competition, whether that's Disney paying a high premium to retain F1 or Apple entering into a 10-year deal worth $2.5 billion for MLS.\n\nThe U.S. market for rights is at an all-time high. This benefits both our owned sports portfolio and the hundreds of sports properties we represent. We're also seeing strong rights demand internationally for both our represented and owned properties.\n\nOn the client side, we continue to broker lucrative deals like the one for CONMEBOL in Latin America and signed new clients, having recently struck a 12-year deal with the Rugby Football League to completely reimagine the sport. As for the UFC, the aggregate annual average value of our international deals continues to exceed 100% since we started tracking in the second quarter of last year. We previously shared that we would also be opportunistic and evaluating distribution strategies in certain international markets. Brazil is a home to one of UFC's largest fan base outside the U.S.\n\nand boast one of the largest percentage of athletes on the UFC roster. It's a market where prospects of going D2C and partnering with a free-to-air distributor, recently presented an opportunity too strong to pass up. Particularly, when you look at the fact that an estimated 96% of UFC fans in Brazil watch TV through streaming services. This week, we announced that we will launch Fight Pass Brazil in January, beyond the launch of that OTT platform, which will be powered by Endeavor Streaming, we're introducing free-to-air TV partnership with one of the largest TV networks in Brazil and a comprehensive digital partnership is in the works.\n\nFor the first time, we're owning the customer relationship in one of UFC's fastest-growing international market, enabling us to continuously evolve our offering to address what fans want most and to attract new fans. This creates yet another blueprint to consider as we look at all the options available across markets when rights come up for renewal. Beyond the media rights, we continue investing in adjacent businesses to enable us to completely surround live sports experiences. In particular, we're carving out a unique position for ourselves within the growing sports data and betting space, prime to capitalize on more states legalizing online betting and international territories reregulating.\n\nIMG ARENA continues to add official data rights to its sports betting client roster, the latest being MLS. And with the upcoming close of the OpenBet acquisition and IMG ARENA and OpenBet joining forces, we feel great about where this business is headed, both in the U.S. and internationally. As we recently announced, we also negotiated a $400 million reduction in OpenBet's purchase price, including $250 million in cash savings.\n\nGiven our enhanced cash position, we plan on paying down $250 million of debt. Now, turning to premium experiences and events, we purpose-built Endeavor for the experienced economy, identifying early on where the demand of the consumer were headed and carefully assembling the assets and capabilities necessary to capitalize. On the heels of the NFL flipping into on location ownership stake into Endeavor and on location becoming a wholly owned subsidiary of Endeavor. We recently combined our premium experiences and events businesses under singular leadership.\n\nThis will enable us to foster even greater collaboration between the two businesses and further strengthen our offering for both our clients and our owned properties. Across live events, more broadly, we saw strong sales from consumers from general emission to the most high-end experiential offerings. At UFC, we've seen 21 consecutive sellout since resuming live events with audiences coming out of the pandemic and an increasing number of fans are traveling to fights from out of state. On average, about 40% of fans in the quarter, nearly double pre-pandemic figures.\n\nIt's a great indicator of UFC's growing fandom and helpful to us as we look to secure more site fees in the future. Meanwhile, sales On Location's UFC fan experience at our pay-per-view events were up 300% quarter over quarter. At WME, Broadway, concerts, festivals and comedy tours, which has been slow to rebound, have resumed. We've already booked over 30,000 touring dates this year, putting us 85% of the way to our typical annual total.\n\nAnd our clients represent more than half of music festival headliners in the U.S. What is also become clear in the event space is that there is no replacement for great IP. We built a strong asset portfolio and have a thorough process of identifying new IP and evaluating its potential when dropped into the Endeavor flywheel. Today, we announced that we are expanding into a new event category with the acquisition of the premium collectible car auction and live events company, Barrett-Jackson.\n\nIt's prime for the experience economy, and there's no better company than Endeavor to create a one-of-a-kind experience for brands and consumers. We're looking to elevate the Barrett-Jackson brand across categories, including On Location experiences, content, marketing and partnerships. Finally, turning to premium content and the enduring value of top talent, we continue to benefit from our unique position as one of the largest talent suppliers. We see no slowdown in demand and spend for all forms of high-quality content.\n\nWe continue closing major multiyear and multifaceted deals for our content creators across the streaming spectrum like the significant deal for filmmakers Shane Black and Robert Downey Jr. to develop a slate of films and television projects for Amazon. Meanwhile, our clients' current projects continue to perform across platforms. Season four of Stranger Things became Netflix's biggest premier weekend.\n\nObi-Wan Kenobi became Disney+ most watched original series to date and Candy gave Hulu its best debut since 2021 season of The Handmaid's Tale. We also continue to broker major podcast deals and our clients' podcast continued topping charts whether that's David Goyer's Batman Unburied with Hasan Minhaj, hitting No. 1 on Spotify or Dick Wolf's Dark Woods reaching the top of the Apple fiction chart, leading to it now with being developed as a TV series. And lastly, the box office is delivering across genres and age groups from Marvel's Doctor Strange, Jurassic World, Elvis and Minions, all films featuring a significant WME client presence grossing over $2.5 billion worldwide.\n\nWhile we're certainly not immune to macroeconomic conditions, we feel great about the diverse collection of assets and capabilities that we've assembled and continue to grow, enabling us to constantly evolve with the industry and the consumer. Given this quarter's strong performance on line of sight through the end of the year and our confidence in our ability to continue driving value to our clients and our own properties, we've raised our adjusted EBITDA guidance for the fifth consecutive quarter and look forward to continuing to deliver strong results. With that, I'll turn it over to Jason.\n\nJason Lublin -- Chief Financial Officer\n\nThanks, Ari, and good afternoon, everyone. I'll start by walking you through our financial results for the second quarter. I'll also provide you some color on what we're seeing in each of our operating segments. All comparisons will be to the COVID impacted second quarter of 2021.\n\nFor the quarter ended June 30, 2022, we generated $1.313 billion in consolidated revenue, up $201 million or 18%. Adjusted EBITDA for the quarter was $306.4 million, up $138 million or 82%. Our Owned Sports Properties segment generated revenue of $331.9 million in the second quarter, up $73.1 million or 28%, while the segment's adjusted EBITDA was $161.3 million, up $29 million or nearly 22%. Our strong growth in this segment was primarily driven by an increase in media rights fees and live event, partnership and consumer products and licensing revenues at UFC, as well as higher revenues at PBR and the inclusion of Diamond Baseball Holdings.\n\nWe continue to have record-breaking UFC attendance at our live events. All four live events in the quarter sold out, and we set gate records at UFC 274 and 275 in Phoenix and Singapore. Additionally, our Austin Fight Night in June became our highest grossing U.S. Fight Night ever.\n\nTo date, UFC has had 21 consecutive sellout since restarting full capacity events following the pandemic. During the quarter, we also announced a new multiyear media rights deal for UFC with BT Sport in the U.K. and Ireland. As already mentioned, the increase in aggregate AAZ on our international deals has exceeded 100% since we started tracking in Q2 of last year, and we continue to explore new direct-to-consumer opportunities as we have with Fight Pass Brazil.\n\nEarlier this week, we announced the sale of Diamond Baseball Holdings to Silver Lake for approximately $280 million. We expect that deal to close in the fourth quarter. Now, turning to Events, Experiences & Rights. The segment reported revenue of $627.9 million in the quarter, up $99.2 million or 19% and adjusted EBITDA of $108.1 million, up $71.3 million or 194%.\n\nGrowth in this segment was primarily driven by the return of live events without restrictions, including music festivals, the Masters and NCAA Final 4, our acquisitions of Madrid Open and NCSA, as well as increased enrollment at the IMG Academy. Revenue was offset by the expiration of certain unprofitable previously disclosed media contracts. Finally, our Representation segment revenue was $358 million, an increase of $29.7 million or 9%, while adjusted EBITDA was $111.2 million, up $49.5 million or 80%. The prior year included $78 million of revenue from the restricted portion of Endeavor Content, which we sold in January of this year.\n\nPerformance in this segment was driven by our core talent agency business, which saw strong growth across the board, including an uptick within the music and comedy touring categories, as well as our 160over90 marketing business, where we saw increased spending from our corporate clients. We ended the quarter with $5.7 billion in debt and approximately $1.8 billion in cash. Recently, as a matter of financial prudence in a volatile interest rate environment, we increased the notional value of our fixed for floating rate swaps. The new swaps, along with the existing $1.5 billion of swaps already in place, bringing our aggregate fixed rate debt to $2.25 billion or approximately 40% of our total outstanding debt.\n\nBased on our enhanced cash position following the reduced OpenBet purchase price, as well as the expected proceeds from DBH, we intend to pay down $250 million of debt by the end of the third quarter. We remain on track to be below our sub-4x leverage target at year-end. Our Q2 conversion of adjusted EBITDA to free cash flow, defined as cash from operating activities less capex, was over 75%. We anticipate free cash flow conversion of approximately 40% for the year.\n\nWe remain committed to our long-term conversion target of 50% over the next 12 to 24 months. Moving to our updated 2022 outlook. We are raising our adjusted EBITDA guidance range to $1.13 billion to $1.17 billion, which is $1.15 billion at the midpoint, up $25 million from the midpoint of our prior range, representing year-over-year adjusted EBITDA growth of 31%. Our full year revenue guidance remains unchanged, primarily driven by the estimated foreign exchange impact of approximately $60 million.\n\nOur updated guidance for both revenue and adjusted EBITDA also incorporates the following considerations. The previously mentioned FX, which primarily impacts our EE&R segment, the disposition of Diamond Baseball Holdings, which we expect to close in the fourth quarter, the acquisition of Barrett-Jackson, which we expect will have a negative impact on 2022 due to the timing of their events, revised timing of OpenBet's close, which we now expect to end of the third quarter, resulting in reduced contribution to the full year, the shift of clients, sponsorship and event-related revenue and adjusted EBITDA, the increased investment in On Location to IoT initiatives driven by incremental technology and marketing spend and the impact of COVID restrictions in China, most notably the cancellation of the WGC-HSBC Golf events. Given our high degree of visibility into our revenue for the rest of the year, a significant portion of which is already contracted, we remain confident in our increased full year guidance. With that, I'll turn it over to James.\n\nJames Marsh -- Senior Vice President, Head of Investor Relations\n\nThanks, Jason, and thank you all for joining us today. [Operator instructions] With that, Amber, you can open the line for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Ben Swinburne with Morgan Stanley. Your line is now open.\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nThank you. Good afternoon. Hey, guys.  Ari, you already hit it, but I got to ask it anyway because we -- this is the end of earnings, we've been hearing it all months about slowing cash content spend, Disney last night, but going back to Netflix, Warner. Talk a little bit about the visibility you have in the pipeline? And I'm curious if the shift maybe back toward theatrical for movies, which is something that certainly Warner Brothers highlighted, it seems to be a trend if that impacts the outlook for the talent business, as you think about shifting distribution models, good or better or/and different?\n\nAri Emanuel -- Chief Executive Officer\n\nWell, I could have written that question. But if you look at all the players on the buy side, whether they be traditional players or from the linear side that have added, SVOD and now potentially AVOD, streaming services or the new streaming services, their strategy areas are going to keep on evolving. At one point, it was just taking all their movies and putting on their streaming services. Now, Amazon's bought MGM, they're going to go theatrical.\n\nEverybody shifting and changing. For us, it really doesn't matter. Also, it doesn't matter whether they're measuring their subs by the success, by subs, by revenue or any of the other metrics that you guys put forward to them. Our strategy has been consistent.\n\nThey need premium content and one on the supply side of the talent equation in that situation, they have to come through us. They're going to have -- this is going to change multiple times in this conversation. I would just say to you that our Representation business has been a double-digit grower for the last decade. I think we're in early days.\n\nThere's a lot of more shifting and changing going to happen. But from our perspective, we're positioned to benefit no matter how many platforms spend and the strategies they take over the course of the next few years. So we feel very good about where we sit. If they go to AVOD and they have to change their distribution deals with end users on the other side of it, they're going to have to come to us and change our deals.\n\nSo we're going to benefit there. And so, we're positioned to benefit no matter how the platform strategy has changed. I think they're all like the Warners, like the Disney, you see what's happening with movies that are released from Sony that are now on Netflix, they're performing better because they were theatrically released. So this is going to be a constant change.\n\nBut again, all I'd say to you is we're the largest player on the supply side of the equation, and we'll benefit from all of them. And the last thing I'd say is I didn't know if there was austerity at spending $30 billion on content. So we feel very good about our position on the supply side.\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nAnd can I just ask one follow-up, if James will let me on OpenBet. It's been a while since you announced the deal. Congratulations on getting the price knock down. But how has the business been performing? Have any sense for the expectations you laid out for us 10 months ago when you announced it, if the business is performing or if your strategy has evolved or how are you feeling about the outlook here?\n\nAri Emanuel -- Chief Executive Officer\n\nOur strategy is the same. The business is doing well. It was a timing issue that enabled us to renegotiate portions of the deal. We feel incredible about the business combining that with arena where we sit on that side of the business as the supply side, again, in that end of the distribution model.\n\nAnd the combination is the most important in the field right now. And with the combination of where we are with IMG ARENA, it gives us a lot of force in that space. So there's no change. Their business is performing incredible.\n\nIt's unbelievable. Freddie Longe from our side is incredible. So it's all going really -- it just was we had the ability to renegotiate the deal. We took advantage of it.\n\nBoth parties are happy with it, and we're going forward.\n\nJames Marsh -- Senior Vice President, Head of Investor Relations\n\nThank you. And next question, please.\n\nOperator\n\nThank you. Our next question comes from John Hodulik with UBS. Your line is now open.\n\nJohn Hodulik -- UBS -- Analyst\n\nGreat. John, thanks for the question, guys. Hey, guys. All right.\n\nCan we just drill down on the decision to go direct in Brazil, maybe the stage for us in terms of what the video market looked like in Brazil? Can you give us any more color on the sort of terms of the deal or your confidence in that you get the viewership and whether or not there's a sort of transition phase as you sort of build up the audience? And then lastly, whether this model could be used in other major markets for UFC?\n\nAri Emanuel -- Chief Executive Officer\n\nWell, listen, I would say the following. We're constantly evaluating our options by market to put ourselves in the best position for long-term success. As I stated, internationally, we started tracking in the second quarter of '21, the aggregate annual average value of our rights has exceeded 100% for those rights. In Brazil, specifically, listen, we identified a unique opportunity to own the customer relationship in the fast -- one of our fastest-growing international markets.\n\nIt's the second biggest sport in Brazil. There's an estimated 50 million UFC fans in Brazil. 96% of them, as we looked at it, are UFC fans and they watch TV via streaming services. And so, -- and more likely than not, the Brazil fans watching sports online compared to fans of most other sports.\n\nSo we're going to where the fans are. We launched Fight Pass free-to-air TV with a partnership with Band, one of the largest TV networks in the marketplace. We're going to announce the digital partnership there also in the ecosystem. I think really important just kind of in the flywheel of Endeavor.\n\nWe're powering this whole thing with Endeavor Streaming, which we built. And in Brazil, they spend more time on their smartphones than any other country and spent nearly 50% over the last few years. So it creates a huge kind of blueprint for us to consider as we look to options available across other territories depending on the negotiation. And then, games there, yes, internationally, if people don't want to pay what we think are the value of our property, we can go direct in any of those territories.\n\nBut this was a unique situation because it's such a big marketplace.\n\nJason Lublin -- Chief Financial Officer\n\nI would just add to that. From a price-to-value perspective, we think we're really pricing this product right in the market. It's going to be the first place where we're putting 100% of our live event content on a digital platform. Subscribers there will have access to all 42 live UFC events per year, and we'll have a more robust ecosystem than we do today with a free-to-air partner.\n\nWe're currently in negotiations for both a digital and telco partner. And regarding transition, we already do have a built-in base today on our current digital platform there that we think will have some conversion and some substantial conversion of that day one.\n\nJohn Hodulik -- UBS -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nThank you. Our next question comes from Stephen Laszczyk with Goldman Sachs. Your line is now open.\n\nStephen Laszczyk -- Goldman Sachs -- Analyst\n\nGreat. Thank you. Maybe just a strategic one On Location. Could you give us an update maybe on the progress you're making on building out some of the capabilities needed ahead of the Olympics in 2024 and perhaps the opportunities you see to scale the On Location platform once those capabilities are fully built out? Have you guys had any incremental conversations with potential partners or see any areas of the market that have been opened up to after signaling some of those intentions to increase your capabilities?\n\nAri Emanuel -- Chief Executive Officer\n\nSo I'll let Jason take this one.\n\nJason Lublin -- Chief Financial Officer\n\nSo we had previously talked about increased spend in the second half of the year in advance of the Olympics. We're going to make some further incremental spend over the Q3, Q4 period this year to enhance the profitability profile and further for Paris 2024. The spend will be increased in digital, as well as marketing. And one of the great things about what we're building here for On Location is the platform that we are building will have broader implications and be able to use by the broader On Location business post just the Olympics.\n\nSo it's going to be a great asset, not just for the Olympics and help us maximize revenue, but it will be a great asset remaining for the organization to use potential other partners down the road.\n\nJames Marsh -- Senior Vice President, Head of Investor Relations\n\nThank you. Thanks, Stephen. Can we have the next question, please?\n\nOperator\n\nThank you. Our next question comes from Kutgun Maral with RBC. Your line is now open.\n\nKutgun Maral -- RBC Capital Markets -- Analyst\n\nGreat. Thanks for taking the question. I just wanted to follow up on the Fight Pass Brazil news conversation. Shifting from pay TV to direct-to-consumer, I think, it makes perfect sense.\n\nBut I was hoping you could talk a bit about what the considerations were in terms of going at it alone as opposed to partnering with another stream service that's already in the market? And for example, again, partnering again with Disney in Brazil. And, I guess, second, as you approach the launch in January, what are the financial implications that we should consider? And how quickly do you expect this shift to be a net positive? And I'm sorry, just one last more -- one more on this. Ari, I think you characterized it as a blueprint to consider when evaluating and monetizing your UFC rights. I know that the UFC is the crown jewel in terms of the rights that you have, but do you envision a path to expanding this blueprint with other rights that you either have or managed?\n\nJames Marsh -- Senior Vice President, Head of Investor Relations\n\nSure. So why doesn't Ari jump in on the consideration of going alone, I'll have Jason jump back and talk about the financial implications, and then we'll talk about the blueprint.\n\nAri Emanuel -- Chief Executive Officer\n\nWell, all I'll say to you is on the Barker side, we have Band. Or we have Endeavor Streaming, so I don't need any other partners on the streaming side. We have an incredible technology here that does the WWE, NFL, still does the NBA. So that technology exists.\n\nI didn't need another partner. It's something that we've built already over a number of years. And it's a blueprint because from our perspective, as what's happening with global -- their linear business has imploded. If that happens internationally, we have the ability and we'll have the expertise to go direct in any territory.\n\nWe have a great marketing plan coming into January. So we feel very good about where -- and that market have a huge fan base and a huge fighter base. So --\n\nJames Marsh -- Senior Vice President, Head of Investor Relations\n\nAnd Jason, maybe you could just chime in.\n\nJason Lublin -- Chief Financial Officer\n\nYes. Look, what I would say is upfront Year 1, we would expect this to be neutral to marginally positive. But certainly, we expect this to be accretive over the long term. Otherwise, we wouldn't be making the decision to go this way in the market.\n\nJames Marsh -- Senior Vice President, Head of Investor Relations\n\nAny other questions there, Kutgun?\n\nKutgun Maral -- RBC Capital Markets -- Analyst\n\nNo. I guess, just a follow-up. I appreciate the answers. Just would you consider -- you already have the technology and the platform.\n\nAgain, maybe thinking about other rights that you either have or managed and expanding a little bit more meaningfully with streaming.\n\nAri Emanuel -- Chief Executive Officer\n\nWell, I would just -- are you talking about in that territory?\n\nKutgun Maral -- RBC Capital Markets -- Analyst\n\nMore broadly.\n\nAri Emanuel -- Chief Executive Officer\n\nIt's a case by case. I haven't really thought about it right now.\n\nJames Marsh -- Senior Vice President, Head of Investor Relations\n\nGreat. Thanks, Kutgun. Amber, can we have the next question, please?\n\nOperator\n\nThank you. Our next question comes from Jessica Reif Ehrlich with Bank of America. Your line is now open.\n\nJessica Reif Ehrlich -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thank you. Hi. I guess, this is a UFC question, but ESPN seems increasingly selective in what rights are willing to pay up for.\n\nWe've seen them walk away from IPL digital. And now it seems like they're walking away from Big Ten after four decades. Does this concern you? Or do you think it's more a sign that they're saving up for what is essential to them? And strategically, if you were to go to auction with the UFC in a couple of years, does it -- I mean, how do you think about the signing companies? If they are the highest bidder, is reach a concern?\n\nAri Emanuel -- Chief Executive Officer\n\nYes, no problem. So we have three years left on our current ESPN and we have a great relationship with ESPN. They've talked about how we have kind of helped them grow their direct-to-consumer business. On a general basis, if you just look at the ecosystem, it's over $1 billion for Thursday Night football from Amazon, as I mentioned in my opening remarks, Apple is now -- in baseball, they just did a $2.5 billion deal with MLS.\n\nThe EPL rights at NBC went for unbelievable number. Formula 1 went from $5 million to $85 million. They doubled the NHL rights at ESPN. We feel really good about the space and the value of sports in the ecosystem.\n\nBut our relationship could not be better between the Contender Series, The Ultimate Fighter, Fight Night, our pay-per-views. They've just put us on ABC. We feel really good about where we sit in that ecosystem and the relationship. So we're feeling very confident, but the whole ecosystem for sports rights is on the way up.\n\nJames Marsh -- Senior Vice President, Head of Investor Relations\n\nAnything else, Jessica?\n\nJessica Reif Ehrlich -- Bank of America Merrill Lynch -- Analyst\n\nNo, I was just wondering, like with the signing companies, is there any concern at all about reach? Or is it that money? Or just how do you think about that?\n\nAri Emanuel -- Chief Executive Officer\n\nI don't -- I'm not nervous about reach, like I wasn't nurses about reach with ESPN+. I'm really comfortable with it.\n\nJames Marsh -- Senior Vice President, Head of Investor Relations\n\nOK, great. Thanks, Jessica. Next question, please.\n\nOperator\n\nThank you. Our next question comes from Bryan Kraft with Deutsche Bank. Your line is now open.\n\nBryan Kraft -- Deutsche Bank -- Analyst\n\nThank you. Good afternoon. I just wanted to ask you, I guess, a high-level question. How should we think about your appetite for larger scale M&A in this environment? And is there much out there that's for sale right now that might be a fit? And just how would you think about funding M&A, given the rising rate environment, the higher cost of capital and your commitment to deleveraging the balance sheet?\n\nJames Marsh -- Senior Vice President, Head of Investor Relations\n\nI'll let Ari jump in on the strategic side, and then Jason will talk about the balance sheet.\n\nAri Emanuel -- Chief Executive Officer\n\nAs it relates to kind of M&A, we're opportunistic. We make sure that it goes through a rigorous process as it relates to what we can do on cost and how we can grow the business like we've always done, whether that be with Madrid now Barrett-Jackson. In the marketplace, there's a lot coming up, but it goes through its process. I don't identify now what the targets are, but we've been a very curious company in the past.\n\nIf we think something is an opportunity for long-term value, we'll pursue it. And we feel good about where we sit and when things come into our flywheel, how we can generate greater economic value to them. You want to talk about the balance sheet?\n\nJason Lublin -- Chief Financial Officer\n\nYes. Look, I mean, we think we have -- like we've said before, we're committed to get into sub-4x leverage. We expect to be there by the end of the year. Given our financial profile, the fact that we have a public equity, we certainly think there's many ways for us to go execute on large scale M&A being committed to making sure we're on a debt level and a ratio with that expectation revenue that we remain at for.\n\nBryan Kraft -- Deutsche Bank -- Analyst\n\nGreat. Thanks. Thank you. Next question.\n\nOperator\n\nThank you. Our next question comes from David Joyce with Barclays. Your line is now open.\n\nDavid Joyce -- Barclays -- Analyst\n\nHey, David. Thank you. I wanted to ask broadly if you could touch on the guidance a bit in terms of the cadence this year and then more granularly feeding into that. If you could help us understand the EE&R business in terms of how much of the revenue is -- comes from seasonal events like Mutua Madrid versus how much is recurring? And also on the representation side, how the streamer spending feeds into the seasonality of spending? So basically, if you could just help us understand the components that go into what the cadence of the guidance would be.\n\nJames Marsh -- Senior Vice President, Head of Investor Relations\n\nJason jump into the guidance drill down. We'll get into a little bit of cadence and then just so events case for the back of the year, EE&R.\n\nJason Lublin -- Chief Financial Officer\n\nYes. So look, what we continue the same, I would like to reiterate is that we think the right way to look at our guidance is on a full year annual basis. We raised our guidance from Q1 to Q2 by $25 million at the midpoint to 1.150 billion, which is up $55 million from the beginning of the year and represents at the midpoint of 1.150 billion, a 31% increase in EBITDA year over year. That being said, incorporated into our updated revenue and adjusted EBITDA ranges are among other things, the following.\n\nThe impact of foreign exchange primarily in our EE&R business segment, which is adverse to revenues as well, be it a much lower base to adjusted EBITDA. The shift in the timing of our OpenBet closing, which reduces its revenue and adjusted EBITDA contribution, the removal of Diamond Baseball Holdings revenue and adjusted EBITDA, assuming closing later this year. The inclusion of the recently announced Barrett-Jackson acquisition, the results which is loss making -- slightly loss-making for the balance of the year given the timing of the events. Some timing shifts of client sponsorship and event-related revenues associated with adjusted EBITDA.\n\nAs previously mentioned, an increase in Olympic spend to enhance the profitability profile even further for Paris of 2024. And lastly, the COVID impacted cancellation of HSBC Gulf event in China this year. So those are all things that are going into our revised forecast for the balance of the year.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJames Marsh -- Senior Vice President, Head of Investor Relations\n\nAri Emanuel -- Chief Executive Officer\n\nJason Lublin -- Chief Financial Officer\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nJohn Hodulik -- UBS -- Analyst\n\nStephen Laszczyk -- Goldman Sachs -- Analyst\n\nKutgun Maral -- RBC Capital Markets -- Analyst\n\nJessica Reif Ehrlich -- Bank of America Merrill Lynch -- Analyst\n\nBryan Kraft -- Deutsche Bank -- Analyst\n\nDavid Joyce -- Barclays -- Analyst\n\nMore EDR analysis\n\nAll earnings call transcripts"
}