{
  "companyName": "Hilton Grand Vacations Inc.",
  "companyTicker": "HGV",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/hilton-grand-vacations-inc-hgv-q2-2022-earnings-ca/",
  "content": "Hilton Grand Vacations Inc. (HGV 0.13%)\nQ2 2022 Earnings Call\nAug 09, 2022, 11:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to Hilton Grand Vacations second quarter 2022 earnings conference call. The telephone replay will be available for seven days following the call. [Operator instructions.] At this time, all patients have been placed in listen-only mode and the floor will be open for your questions following the presentation. [Operator instructions.] I would now like to turn the call over to Mr.\n\nMark Melnyk, senior vice president of investor relations, G&A and productivity. Please go ahead, sir.\n\nMark Melnyk -- Vice President, Investor Relations\n\nThank you, operator, and welcome to the Hilton Grand Vacations second quarter 2022 earnings call. As a reminder, our discussions this morning will include forward-looking statements. Actual results could differ materially from those indicated by these forward-looking statements, and these statements are effective only as of today. We undertake no obligation to publicly update or revise these statements.\n\nFor a discussion of some of the factors that could cause actual results to differ, please see the Risk Factors section of our 10-Q or any other applicable SEC filings. We will also be referring to certain non-GAAP financial measures. You can find definitions and components of such non-GAAP numbers, as well as reconciliations of non-GAAP and GAAP financial measures discussed today in our earnings press release and on our website at investors.hgv.com. Our reported results for all periods reflect accounting rules under ASC606, which we adopted in 2018.\n\nUnder ASC606, we're required to defer certain revenues and expenses related to sales made in the period when a project is under construction and then hold off on recognizing those revenues and expenses until the period when construction is completed. To help you make more meaningful period-to-period comparisons, you can find details of our current and historical deferrals and recognitions in Table T1 of our earnings release. For ease of comparability and to simplify our discussion today, our comments on adjusted EBITDA and our real estate results will refer to results excluding the net impact of construction-related deferrals and recognitions for all reporting periods. A complete accounting of our historical deferral and recognition activity can be found in Excel format on the Financial Reporting section of our investor relations website.\n\nIn a moment, Mark Wang, our president and chief executive officer, will provide highlights from the quarter in addition to an update of our current operations and company strategy. After Mark's comments, our chief financial officer, Dan Mathewes, will go through the financial details for the quarter. Mark and Dan will then make themselves available for your questions. With that, let me turn the call over to our president and CEO, Mark Wang.\n\nMark?\n\nMark Wang -- President and Chief Executive Officer\n\nGood morning, everyone, and welcome to our second quarter earnings call. I'm happy to report that we produced another set of strong results for the quarter with contract sales and margins well ahead of our pro forma combined 2019 numbers and EBITDA over 50% ahead of 2019. Our performance was consistent in each month of the quarter, which highlights both the compelling nature of our new offerings and the hard work that the integration teams have done. Our members and consumers remain very much in a travel mindset despite the risks posed by higher fuel prices and recent travel disruptions.\n\nWhile these macroeconomic forces may create risk to consumer spending, we continue to see high demand for vacation packages, particularly at our new resorts and recently rebranded Hilton Vacation Club properties. Our close rates remain near the record levels we saw last quarter, underscoring the value proposition of vacation ownership. We're deepening our relationship with Hilton with the addition of Hilton Vacation Club collection, allowing us to engage with a wider customer base of high-quality Hilton Honors members and which strengthen our business with the integration of Diamond, adding marketing scale, product flexibility and portfolio diversification that will help us to serve the travel preferences of our guests in every environment. Importantly, these factors continue to support solid trends in forward indicators today, giving us confidence in our outlook throughout the rest of the year.\n\nBefore I provide highlights for the quarter, let me start with an update on our strategy and integration progress. On our last call, we talked about our new HGV Max membership program. We're excited about the increased level of access and new benefits providing a streamlined way to engage our members. This is an important step in our journey to evolve what it means to be an HGV member and provide an even greater value proposition through membership.\n\nWe're meeting the expectations of today's travelers through enhanced benefits, simplicity, omnichannel engagement and focus on experiences. And our strong VPG sales performance confirmed these offerings are resonating with our members and guests. So today, I want to expand on two important capabilities that support these strong results, our Ultimate Access events platform and our virtual sales channel. HGV Ultimate Access is a collection of premier experiences exclusively for Hilton Grand Vacation members and guests, including our private concert series, access to sporting events, culinary experiences and more.\n\nWe believe these events deepen the relationship between our members and HGV brand because we've seen that engaging experiences inspire our members to create more memories, build relationships and enhance the overall travel and hospitality experience we offer. I'm really proud of how our teams have expanded on this events platform. And this year, we're on track to deliver a 15% participation rate for members we've offered this experience to with a goal of achieving over 25% in the coming years and growing from there. All properties are expected to participate in the program, and we're conducting successful events in major cities to maintain our owners connection to HGV even when they're not traveling or staying in one of our properties.\n\nWe're also seeing a high correlation between member VPG and Ultimate Access participation. As we expand, we're collecting a significant amount of data that will allow us to further sharpen our ability to engage with more members. Additionally, we're already running successful tests with prospects who are Hilton Honor members, expanding on our universe of potential customers. The other new capability where we've made significant progress is in virtual sales, diversifying how we reach our customer is a critical function, especially as we expand on our suite of products and experiences.\n\nIt's become an integral part of how we engage with our members and prospects as a way to drive incremental sales outside of our traditional sales channels. We're reengineering the approach across the marketing and sales process. For example, we now use AI to provide real-time support to our agents, drive consistency and adhere to our compliance standards. We're thinking about this channel as both additive and supportive of the strength of our sales centers, and we expect to drive over $50 million of contract sales to our virtual channels this year.\n\nTurning to our rebranding. We continue to make excellent progress. The vast majority of our sales network has now been rebranded and is selling HGV Max offering, and we expect this work to be materially completed by the end of the third quarter, which is ahead of schedule. Since our last call, we completed the rebranding of nine more sales centers, seven of which are in markets that are new to HGV.\n\nOn the property rebrand side, we added several additional properties to Hilton Club collection in Scottsdale, Lake Tahoe and Virginia Beach, bringing our total property rebrands to eight this year. And we're on track to deliver on our target of having one-third of our legacy Diamond room keys regranted by year-end. Along with rebranding our physical assets, we're also continuing to improve on the service standards at our resorts, ensuring we provide a high-quality and consistent guest experience across our portfolio that our HGV members and guests expect from us. We're also executing on our cost synergy capture.\n\nDan will get into more details, but we remain confident in our ability to realize the upsized $150 million of cost synergies that we laid out on our last call. So overall, I'm very pleased with the progress of our integration. Now, let me turn to our performance for the quarter. Contract sales were $617 million or 105% of 2019's pro forma combined sales.\n\nFirst, it's great to set a new milestone to move us past referencing 2019 as a prior peak. But we're also pleased with the quality of the growth we saw this quarter. We had broad-based improvements in tour flow recovery pace across all segments and geographies, led by the Mainland region and new buyer demand. And we maintained close rates within 60 basis points of the record close rates we produced last quarter.\n\nAs I mentioned earlier, we saw consistency in our sales with a steady cadence of growth in each month of the quarter, and I'm encouraged that our product continues to resonate with our tour guests despite negative macroeconomic news flow. Turning to our demand indicators. Occupancy for the quarter was 83% versus 75% in the first quarter and at the highest levels since the end of 2019. In another positive sign of returning to a more normal business cadence, we witnessed a very typical seasonal trend through Q2 with April stronger than May and June having the highest occupancy of the quarter.\n\nLooking out to the rest of the year, our owner arrivals continue to show solid trends through the fall. Our rental arrivals are showing a similar trend with particular strength in the fourth quarter. And in total, room nights on the books for the rest of the year are on par with where we were in 2019. We also continue to see exceptionally strong package sales demand, giving us visibility into our future new buyer tour flow.\n\nIn fact, despite converting some of our pipeline in Q2 to drive improvements in new buyer tours, we still grew our package pipeline for the quarter, which now is up to a half a million packages. So, it's a great indicator that travel demand continues to be robust in the face of economic headwinds and it should support our investment efforts to drive additional new buyer growth in the second half of the year. VPG of nearly $4,500 remains strong even as we saw some normalization of our owner new buyer mix. New buyers drove growth in our member base, which is now nearly 508,000.\n\nOur HCV NOG was 3.2% and Diamond added 1,400 net new members in the quarter. Those members fueled steady performance in our club and resort business, which alongside our financing business contributed nearly half of our EBITDA. Our rental business had strong growth in the quarter, fueled by higher travel volumes and continued strength in ADRs. The combination of those consistent segment results, along with our synergies and efficiency initiatives, produced EBITDA of $277 million with margins ahead of last quarter and well ahead of 2019.\n\nSo, overall, we had a solid quarter. We saw consistent improvement across the organization and a return to a more normal cadence of business. The strength of our offering helped us to deliver great results and gives me confidence that we're well positioned to withstand macroeconomic noise. We just added new high-quality inventory to HGV.\n\nWe have a very strong new buyer pipeline. We've diversified our portfolio with the addition of 92 Diamond resorts, and we have a loyal base of dedicated members who have prepaid for their future vacations. Last week marked the one-year anniversary of closing of the acquisition. I'm thrilled with the progress we've made to date, and I'm also proud of how hard our teams have worked to get us here.\n\nLooking forward, we're focused on making further progress ramping Hilton Vacation Club collection, HGV Max and our Ultimate Access program, all of which are strong catalysts for continued growth. With that, I'll turn it over to Dan to walk you through the numbers. Dan?\n\nDan Mathewes -- Chief Financial Officer\n\nThank you, Mark, and good morning, everyone. Before we start, note that our reported results for this quarter included $10 million of sales deferrals impacting reported revenue related to preopening sales of our Maui project. We also recorded an associated $6 million of deferred direct expenses from those sales, resulting in a net pro impact of $4 million. In my prepared remarks, I'll only refer to metrics, excluding the impact of deferrals, which more accurately reflects the cash flow dynamics of our financial performance during the period.\n\nLet's review the results for the quarter. Total revenue in the second quarter was $958 million, excluding the deferrals I mentioned. We saw a strong sequential growth in our real estate and rental business as trends continue to improve from Q1 levels, while our recurring finance and club businesses were in line with the first quarter's performance. Q2 reported adjusted EBITDA of $277 million was 51% ahead of our 2019 pro forma combined level.\n\nEBITDA margins of 29% were nearly 800 basis points better than pro forma in 2019 and a record for the second quarter performance. We continued to realize margin improvements from our synergy capture and efficiency initiatives, elevated VPGs and favorable buyer mix along with provision below our normalized rate. For the quarter, our cost synergy run rate is $140 million versus $120 million reported last quarter and our target of an annualized $150 million of cost synergies. We're really encouraged by the consistency of the results through the quarter, which underscores both the inherent synergies of the acquisition, as well as the attractiveness of our new product offerings.\n\nNow, let's talk through the segment detail. Within real estate, total contract sales were $617 million and have fully recovered 2019's pro forma combined levels, as Mark noted. Owners made up 70% of contract sales for the quarter compared to 73% for Q1. We saw a strong improvement in our new buyer tour flow and contract sales in the quarter with sequential growth from Q1 outpacing the growth that we saw in our owner metrics.\n\nWe're encouraged by the early results from the investment in new buyer channels that I mentioned last quarter, and we expect continued improvement into the second half, driving buyer mix toward our 60% owner sales target and embedding additional value into the enterprise through new buyer growth. VPG was nearly 4,500 for the quarter. While this is elevated from the post-acquisition levels we had in the second half of 2021, it was down from the historic record from Q1, owing largely to the mix shift toward new virus. We anticipate this trend will continue in the coming quarters as we see more results from our new buyer initiatives.\n\nAs Mark noted, close rates held the record levels we saw in Q1. Cost of product was 19% of net VOI sales, which was just under our low to mid-20% target range. Real estate sales and marketing expense of $213 million for the quarter was 35% of gross contract sales, 300 basis points lower than the first quarter ratio. Real estate profit was $187 million for the quarter, with margins of 40% at the highest level we've ever produced in our Real Estate segment.\n\nWe continue to expect that margins in the second half of the year will normalize from these levels due to our investment in new buyer channel and anticipated higher mix of new buyer sales, which carried lower margins than owner sales. In our financing business, second quarter segment profit was $42 million with margins of 66%. Combined gross receivables for the quarter were $2.4 billion or $1.7 billion net of allowance, and our interest income was $54 million. Our originated portfolio weighted average interest rate was 13.9%, while our acquired portfolio had a weighted average interest rate of 15.6% and includes an $11 million contra revenue for the amortization of a noncash premium associated with the portfolio of receivables that we acquired from Diamond during the acquisition.\n\nOur allowance for bad debt was $753 million on that $2.4 billion receivables balance. Of these amounts to the acquired Diamond portfolio, which used their underwriting standards, was $405 million on a portfolio balance of $855 million. Delinquencies remain at very low levels, reflecting continued strength of the consumer, which has benefited from stimulus and other government programs, rising home equity and ample access to credit. But consistent with our previous comments, we expect a normalization of credit trends into 2023.\n\nOur annualized default rate for our originated portfolio was 4.26%. Our provision for bad debt was $40 million or 9% of owned contract sales. This was up almost a full point from Q1's provision due to another quarter of seasoning being reflected in the Diamond receivables portfolio and our related credit modeling. But it remains lower than our target provision rate of the mid- to high teens owing to better-than-expected consumer performance, portfolio amortization, lower bankruptcies and lower impairments than anticipated.\n\nWe're also still seeing a higher mix of full cash transactions, which lowers our provision for bad debt. We continue to expect these trends to normalize and provision to begin working its way toward our mid- to high teens target. In our resort and club business, our consolidated member count was 508,000, looking at HGV's legacy business. NOG was 3.2% at the end of the quarter.\n\nDiamond also added 1,400 net new members during the quarter. Revenue was $124 million for the quarter, and segment profit was $87 million in the quarter with margins of 70%. Turning to rental and ancillary. Revenues were $171 million in the quarter, rental revenues were up 25% from Q1's level and built upon the strong uptick we saw in the latter half of Q1.\n\nSegment profit was $21 million, with margins of 12%. The strong improvement in margins from the first quarter was due to lower seasonal expense flows combined with sell-through of our new project inventory, which carries a headwind from developer maintenance fees. Bridging the gap between segment adjusted EBITDA and total adjusted EBITDA, corporate G&A was $36 million, license fees were $32 million and JV income was $4 million. Our adjusted free cash flow for the quarter was $103 million, which included inventory spending of $71 million and excludes acquisition-related costs of $37 million.\n\nOur conversion rate of EBITDA to free cash flow was 37% for the quarter. This was below our target range due solely to the timing of the payment for the next phase of our Sesoko project, along with the timing of repayments of our warehouse facility associated with the spring securitization. Year-to-date, our EBITDA to cash flow conversion rate is 52%, and we still feel confident with being well within our guidance of 50% to 60% for the year. During the quarter, we repurchased nearly two million shares of our common stock at an average price of $43.14.\n\nAt June 30, our remaining purchase authorization was $417 million of the approved $500 million repurchase plan. Turning to our outlook. We're maintaining our guidance for the year of $960 million to $990 million, which we raised last quarter. Owing to the strong results we produced this quarter, we feel comfortable with the upper half of this range.\n\nAnd as I mentioned, we expect conversion of adjusted EBITDA to free cash flow to fall well within the target range of 50% to 60%. At June 30, our liquidity position consisted of $374 million of unrestricted cash and $824 million of availability under our revolving credit facility. Our debt balance at quarter end was comprised of corporate debt of $2.8 billion and a nonrecourse debt balance of $1 billion. At quarter end, we had $874 million of remaining capacity in our warehouse facility, of which we had $242 million of notes available to securitize and another $225 million of mortgage notes we anticipate being eligible following certain customary milestones, such as first payment, deeding and recording.\n\nTurning to our credit metrics. At the end of Q2, the company's total net leverage on a pro forma TTM basis was 2.1 times, not giving effect to anticipated synergies. Including all anticipated synergies are leveraged at two on a pro forma TTM basis. We will now turn the call over to the operator, and we look forward to your questions.\n\nOperator?\n\nOperator\n\nThank you. We'll now be conducting a question-and-answer session. [Operator instructions.] And our first question comes from the line of Patrick Scholes with Truist Securities. Please proceed with your question.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nHi. Good morning, everyone.\n\nDan Mathewes -- Chief Financial Officer\n\nGood morning, Patrick.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nI see now you actually did some share repurchases in the quarter. Did those continue into 3Q?\n\nDan Mathewes -- Chief Financial Officer\n\nYes, just to touch base on capital allocation. As you recall, we've focused historically on organic growth and then secondarily on returning capital to shareholders. And then, obviously, looking at M&A transactions that are materially accretive to our shareholders is a third leg of the stool, so to speak. So, through the end of the quarter, we did commit to $83 million in share repurchases, cash going out of the door actually translated into $78 million just because of where the cash left our bank accounts.\n\nBut through July, we did continue. And we're right at about $120 million through July 31.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nOK.\n\nDan Mathewes -- Chief Financial Officer\n\nAnd when you think about capital allocation going forward, we do see returning capital to shareholders via that share repurchase plan as the primary use of capital as of today. So, I think last quarter, we talked about that $500 million being spread rather evenly across the two-year period, which was 62.5 quarters. So, we clearly exceeded that in the first quarter of it being available to us, and I would anticipate exceeding that mark going forward as well.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nOK. You've given some encouraging thoughts about the back half of the year. Anything you can speak to about how say, first half of 2023 is trending at this point?\n\nMark Wang -- President and Chief Executive Officer\n\nFirst half of 2023. Look, what I'd say, Patrick, is, look, we're watching the pace and position in all of our key metrics really well. I'd say room nights and positions on the books continue to look very strong, especially among our owners. And one of the advantages we have in this sector is that we have a further sideline around compared to lodging around our owners booking out.\n\nThey book on average 200 days out. So that's compared to 75 days out for typical rentals. So, we've got a really good guideline and owners continue to book up very well. I'd say on the recurring revenue side, things are holding up very well.\n\nNow, as far as 2023 goes, our expectations is our club and management fees will be collected at the beginning of the year, like they were this year. So, our expectation is that will hold up very well. I think in Dan's remarks, you mentioned delinquencies and defaults remain low on our portfolio. So that's good.\n\nAnd we're seeing owners upgrade at record levels. And especially with very strong interest in HGV Max. Our expectations is we're going to have about 75,000 new HCV Max members this year in total. So that rollout has gone really well.\n\nNew buyer continues to pick up. We had a 45% increase in tour flow from Q1 to Q2 and the back half of the year looks better in that regard than the first half from a growth standpoint. So that's kind of that mix shift that we're looking at that's going to put some pressure on VPG in our margins. But look, I think overall leisure travel looks really good.\n\nAnd our mainland contract sales were 120% of where they were in 2019. So, the Mainland business continues to look really strong. We're just still waiting for the Japanese to come back and where we're about 80% in APAC right now. But our expectations is hopefully by the middle of next year, we'll start seeing a more normal cadence with the Japanese.\n\nSo, all in all, feel good about where things are going.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nOK. Thank you. I'm all set.\n\nOperator\n\nThank you. Our next question is from the line of Brandt Montour with Barclays. Please proceed with your questions.\n\nBrandt Montour -- Barclays -- Analyst\n\nHey, good morning, everybody, and thanks for taking my question. So maybe just on the back of that, we can dig in a little bit more on the VPG in the quarter and the outlook and your comments were well understood. Your VPGs were down a tiny bit, sequentially a little bit year over year, and I get it's a mix shift. Maybe what would be helpful is just to break out sort of close rate trends near term between new and repeat, as well as between legacy HGV and Diamond?\n\nMark Wang -- President and Chief Executive Officer\n\nYes, Brandt. So actually, VPGs for Q2, while sequentially were down. They were still at 39% against 2019 versus Q1, which was up 35% against 2019. So, seasonality created some of that pressure downward on VPG.\n\nSo, look, we don't have a breakdown available to go through the legacy HGV and Diamond. But I would say across the board, owners are upgrading at record paces, at a record pace. I mentioned HGV Max, I think, has a substantial amount of value to our members. And so, we're seeing a lot of trading up and at significant levels.\n\nAnd so, we're really, really excited about what's going on there. I think in today's environment, this inflationary environment is creating -- it's enhancing or accentuating our value proposition as people are hedging the cost of their future vacations. So, I think today's environment is really helping us in that regard. As far as new buyers go, we're really pleased with what we're seeing on the new buyer side.\n\nImportantly, we've opened up a number of the markets to the Hilton customer base, and we booked over 32,000 packages to-date from Hilton customers going to the legacy Diamond locations, which are now being rebranded. So, all in all, great VPG performance and continued improvement in sequential tour flow.\n\nBrandt Montour -- Barclays -- Analyst\n\nOK. Great. And if I was to interpret that, as well as your reiteration of guidance for the back half of the year for the full year. Yes, it does seem like you're baking in some mix shift.\n\nThe question would be, I guess, do you think it's going to show up more in VPGs going a little bit softer sequentially? Or is it going to show up more in the sales and marketing line as a percentage of gross contract sales?\n\nDan Mathewes -- Chief Financial Officer\n\nBrandt, it's Dan. It's actually going to be a combination of both. You?re going to see compression on the VPG side due primarily to that mix. And then with the mix, new buyer tours are more costly.\n\nSo, what we would expect is a compression in the margin in the back half of the year, not material, but a couple of hundred basis points potentially. When you think about our guidance, we came out at the beginning of the year with a midpoint of $925 million. We upped that to $975 million at the midpoint, and that's where we sit today. So, it's really us taking in consideration the beat in Q1 and the beat in Q2.\n\nThat kind of gets you to the midpoint of $960 million to $990, that $975. And we feel, as you heard in my prepared comments, that we feel there's some modest upside to that that gets us comfortable saying $975 to $990 million in that ballpark. But just to walk you through our thought process there.\n\nBrandt Montour -- Barclays -- Analyst\n\nSuper helpful. Thanks so much, guys.\n\nOperator\n\nOur next question is from the line of David Katz with Jefferies. Please proceed with your question.\n\nDavid Katz -- Jefferies -- Analyst\n\nHi. Good morning. Thanks for taking my question. I'll apologize upfront for doubling back on some of the stuff you just talked about, but we've sort of had it come up a bunch this morning about looking into that back half of the year.\n\nAnd it is entirely a function of mix shift in margin that is sort of the driver of a beat and then keeping the back half of the year flattish. There's nothing in sort of loan loss or any other sort of one-off items in there? Just to make sure the issue is really beaten.\n\nMark Wang -- President and Chief Executive Officer\n\nNo problem. Outside of the VPG on the real estate side. The other thing that you do see in what we've anticipated, we've tried to reiterate this multiple times, but from a loan loss provision, we are well below historical averages for legacy HGV let alone the combined entity. We're sub-10% on that provision level.\n\nAnd we expect to be at some point in the mid-teens to high teens, and we expect that to ramp. Now, that will probably ramp over the next -- between call it, 12 and 18 months in that time frame. Part of that is driven by pure accounting reasons, right? For instance, we acquired Diamond's portfolio at the time of that opening balance sheet, we put a large reserve against those existing loans. So, we're not -- that provision does not hit our P&L today.\n\nAs we continue to sell Hilton Vacation Club and legacy Diamond product, obviously, that will start to impact the provision. And then, in addition to that, what we've seen over the last, I want to say, it's been three quarters now, is the lower propensity to borrow from, in particular, new buyers and to a certain extent, owners. We feel that that's driven by a lot of the government stimulus that has been ramping down from COVID. So as that continues to ramp down, we believe that propensity to borrow will increase.\n\nBut at the lower levels, you obviously have lower loans, which also lower your provision as a percent of owned contract sales. So those two dynamics will come into the back half of the year from a financing perspective. But that combined with real estate is really what it is. So effectively, David, the same story we've been saying for the last, I want to say, three quarters.\n\nDavid Katz -- Jefferies -- Analyst\n\nGot it. OK. I think that's it for me. I may jump back in the queue.\n\nThanks.\n\nMark Wang -- President and Chief Executive Officer\n\nOK. Thanks.\n\nOperator\n\nOur next question is from the line of Ben Chaiken with Credit Suisse. Please proceed with your question.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nHey, thanks for taking my question.  I guess for the -- you kind of gave some color on the, I think you had 32,000, packages for sold the Hilton Honors members. But I guess just stepping back a little bit, is the sales centers you have rebranded, can you talk about some of the early results of selling HGV Max? Like are you seeing this the product, but I guess also the sales centers resonate with the Diamond customers? I'm kind of talking about a diamond customer upgrading into the HGV Max portfolio. Then I have one or two others.\n\nMark Wang -- President and Chief Executive Officer\n\nYes. So yes, I'd say that we're seeing very positive results across the board from sales, both in HCV legacy and Diamond legacy or those that have been converted over. And so, one of the things, though, Ben, so we have not moved on doing a lot of cross-selling yet, and that's something we'll be doing down the road. Obviously, we've had a significant amount of change for the organization in propping all of this up and getting Max started up and all the technology.\n\nAnd so, we've kept our teams focused on what they've been doing best historically. And they both Deed and Trust are selling very well, and we're seeing a little bit of cross-selling and where we are allowing some of that cross-selling that happened. We're seeing very strong desire to upgrade into deeded product. And on the other side, we're seeing some really strong demand on the trust product in our HGV legacy sales centers, but we're only testing that in a few areas.\n\nUltimately, if you think about it, we went -- we moved everything into a single currency earlier in the year before we launched Max and so our points work great across both Deed and the Trust product right now. So, all in all, I think the product is resonating with each of our guests very well. And I think as we get further out into 2023, 2024, when we allow more cross-selling to occur, we think that will be another potential tailwind for us.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nGot you. And then, on the -- this may be a little bit hard to pinpoint. I think you mentioned 32,000 packages being sold to Hilton Honors members, primarily to the legacy Diamond product. Is there any way to think about just help us maybe like bracket like the time frame that's likely to be used over and then how to think about, I guess, like package conversion? I don't know if that's possible, but --\n\nMark Wang -- President and Chief Executive Officer\n\nYes. So anyway, so we saw just on the package side, the 32,000 we're into eight markets, right? So those are markets that have been rebranding. And typically, the travel time after you sell a package is around six months. And so, it's still very early on.\n\nSo, we haven't seen that many of those Hilton customers coming through the door yet. But we're very confident that the sales centers have been upgraded. The technology has been upgraded and is pretty much identical to what you're seeing at HGV legacy sales centers and the product that's been rebranded it's a bit of a step down in some cases, but still really meets that Hilton Vacation Club quality that we that we put out there. So, our expectations are that sales are going to go well to those customers.\n\nAnd as it relates to the pipeline, our package pipeline now sits at a record amount of $500,000. Activations continue to pick up. As I mentioned, we saw new buyer tour flow was about 45% in Q2 versus Q1. And all indications from what we can see is that momentum continues to pick up throughout the back half of the year, which is part of that mix shift that we've talked about earlier today.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nGot you. And then, one very quick one. I think you mentioned new owners were 70% of the mix versus 73% in 1Q. Just to be clear, is that sales dollars? Or is that transactions?\n\nMark Wang -- President and Chief Executive Officer\n\nYes, that's the sales dollars. So, if you think about where we are, HGV legacy is historically used to run around 50/50, and it was running more around 60/40 before the pandemic. That has come back pretty well. We're still running about 55/35.\n\nIt's legacy Diamond, when we acquired Diamond, they were running about 80/20. And the opportunity there is, again, those 32,000 packages. And as we sell additional packages every month and as we start propping up new marketing opportunities to drive new customers, new Hilton type customers, through those sales centers, that mix will shift. And our goal is to get back to 60/40 across the company.\n\nBut pleased with the NOG we had in HGV legacy. We're back up to 3.2%. And net, we gained about 1,400 new members through the Diamond legacy sales centers.\n\nDan Mathewes -- Chief Financial Officer\n\nAnd Ben, just for clarification, I think you said 70% new buyers. It's actually 70% owners just to make sure.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nYeah. Got it. Thank you very much.\n\nOperator\n\nThank you. Before we end, I'll turn the call back over to Mr. Mark Wang for any closing remarks. Mr.\n\nWang?\n\nMark Wang -- President and Chief Executive Officer\n\nAll right. Well, thanks, everyone, for joining us today. I want to give a special thanks to our team members for going above and beyond to meet our owners' needs by delivering outstanding vacation experiences. And I also want to thank our owners who make vacation a priority and then entrust us and allowing us to create memorable experiences for themselves and their families.\n\nSo have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMark Melnyk -- Vice President, Investor Relations\n\nMark Wang -- President and Chief Executive Officer\n\nDan Mathewes -- Chief Financial Officer\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nBrandt Montour -- Barclays -- Analyst\n\nDavid Katz -- Jefferies -- Analyst\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nMore HGV analysis\n\nAll earnings call transcripts"
}