{
  "companyName": "Lakeland Industries",
  "companyTicker": "LAKE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/11/lakeland-industries-lake-q2-2022-earnings-call-tra/",
  "content": "Lakeland Industries (LAKE 0.49%)\nQ2 2022 Earnings Call\nSep 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and welcome to the Lakeland Industries fiscal 2023 second quarter financial results conference call. [Operator instructions] During today's call, we may make statements relating to our goals and objectives for future operations, financial and business trends, business prospects, and management's expectations for a future performance that constitute forward-looking statements under federal securities laws. Any such forward-looking statements reflect management's expectations based upon currently available information and are not guarantees of future performance and involve certain risks and uncertainties that are more fully described in our SEC filings. Our actual results, performance, or achievements may differ materially from those expressed or implied by such forward-looking statements.\n\nWe undertake no obligation to update or revise any forward-looking statements to reflect events or developments after the date of this call. During today's call, we will discuss financial measures derived from our financial statements that are not determined in accordance with U.S. GAAP, including EBITDA, adjusted EBITDA, and EBITDA margin, and non-GAAP net income. A reconciliation of each of the non-GAAP measures discussed on this call to the most directly comparable GAAP measure is presented in our earnings release.\n\nAt this time, I would like to introduce you to your host for this call, Lakeland Industries' chief executive officer, Charlie Roberson. Mr. Roberson, the floor is yours.\n\nCharlie Roberson -- Chief Executive Officer\n\nThank you, operator. Good afternoon, and thank you all for joining. I'm joined today by Lakeland's chief operating and financial officer, Allen Dillard. As you saw in this afternoon's press release, Lakeland delivered another quarter of sequential improvement highlighted by quarter-over-quarter and year-over-year revenue growth and a gross margin of 41.3%.\n\nWe continue to execute on our strategic manufacturing and performance initiatives, which are designed to maintain our profitability profile as we continue to grow our revenue. Revenue for the second quarter was $28.2 million, up 3.3% sequentially driven by increased volumes and up 2.6% compared to the second quarter last year. Importantly, we had continued strong profitability with another quarter of gross margin above our long-term target threshold of 40%, which is further evidence that our profit margins are sustainable as we grow the business in the post-COVID era. While we're proud of our results, and milestones achieved during the quarter, we are not satisfied, recognizing that the developing macroeconomic headwinds held back our revenue growth potential despite our over performance relative to overall industry trends.\n\nOur sales performance continues to be impacted by weakening economic environment, supply chain disruptions, and labor shortages within the industrial segment. These economic challenges have been particularly painful in our European and Asian markets where rising energy costs and COVID lockdowns present significant headwinds that are likely to extend through at least the end of fiscal '23. While we remain focused and confident in our ability to deliver on our long-term financial targets. At this point, we believe we will be operating in a recession area environment in both of these markets in the near term.\n\nIn navigating these global market complexities, we believe it is prudent to respond to these cross currents by accelerating the implementation of our strategic sales and operating expense initiatives, bringing forward to focus on tightening certain general and administrative expenses to maintain the path we are on to achieve our long term operating margin goals. To that end, we are expediting the shift of human and technical assets from our disposable segment to our fire, high performance, and critical environment product lines. These market segments present the greatest opportunity for long-term sales growth and margin potential with the added benefit in the short-term that these markets are expected to provide a more stable and consistent growth environment. Allen will provide more information on this effort in his remarks.\n\nClearly, the pace of global industrial recovery has been slower than we originally anticipated at the beginning of the calendar year. The channel signs we have received tell us that U.S. distribution is still burdened with high inventory levels ranging from 60 to 90 days of excess. With that said and with the exception of the oil and gas sector, U.S.\n\nindustrial and manufacturing activity is still increasing albeit at reduced rates from July. There are also indications from our channel partners that China manufactured garment supply has been impacted by lockdowns or transportation issues stemming from lockdowns which are beginning to delay deliveries to the U.S. market. Concurrent with this development, we anticipate increased demand for disposable garments associated with regional flooding events across the U.S.\n\nOur current inventory levels place Lakeland in a solid position to respond to these longer lead times and capitalize on increased demand due to floods. Looking to the balance of the fiscal year, while economic conditions appear to be softening and may impact the industry and Lakeland further in the near term, I'm confident in our team's ability to deliver growth in our core markets. Additionally, and as Allen will describe in more detail, we continue to make progress on our various strategic initiatives, particularly the strengthening of our sales force and investment in manufacturing, which should only enhance our operational capabilities over the long run. I'll now pass the call to Allen to provide more insight into the company's operations and financial results.\n\nAllen?\n\nAllen Dillard -- Chief Financial Officer\n\nThanks, Charlie, and good afternoon, everyone. As Charlie highlighted in our second quarter results reflect the sustainable profitability profile of Lakeland as key financial metrics continue to make sequential progress in the post-pandemic era. On a consolidated basis for the second quarter of fiscal 2023, net sales were $28.2 million. Domestic sales were $13.4 million or 48% of total revenues and international sales were $14.8 million or 52% of total revenues.\n\nThis compares with domestic sales of $11.2 million or 41% of the total and international sales of $16.1 million or 59% of the total in the first quarter of fiscal 2023. While fiscal 2022 second quarter domestic sales were $11.3 million or 41% of total revenues and international sales were $16.2 million or 59% of total revenues. The geographic shift in our revenue for the quarter compared to the year-ago period reflected strong demand in the U.S. coupled with a softening environment in both Europe and Latin America.\n\nOn a consolidated basis, compared to fiscal 2022, currency fluctuations negatively impacted revenues by approximately $800,000. In terms of product mix for the quarter, we saw a positive shift from a margin standpoint as disposables represented 45% of total revenues for the period, compared to 55% in the year-ago quarter. The mix shift was driven by growth in our higher margin non-disposable products, particularly chemical, which reached 25% of total revenues for the quarter versus 20% in the year-ago period. As it relates to broader industry inventory levels, our channel data is showing decreasing stock levels across all domestic customers, signaling progress toward inventory normalization.\n\nWe are also seeing increased orders for direct containers from our larger customers, which is further evidence that our customers are shifting their orders to more reliable suppliers as supply chain headwinds have become more acute with the recent COVID-related lockdowns that have taken place in China, as well as with certain other global raw material suppliers. Importantly, Lakeland's proactive strategy to build both finished and raw material inventory has positioned us to navigate a complicated global supply chain environment while maintaining the ability to deliver finished goods to customers as needed. We expect overstock inventory levels in the distribution channel, which is predominantly made up of disposable products to continue to diminish over the next few quarters. Gross profit as a percentage of net sales was 41.3% for the fiscal 2023 second quarter, as compared to 40.5% for the fiscal 2023 first quarter and 46.8% a year ago.\n\nDuring the quarter, our gross margin benefited from an increase in U.S. direct container business from several of our larger customers, even as disposable revenues were decreased. We also began to realize the benefits of lower transportation cost. Lakeland reported operating profit of $1.8 million second quarter 2023, as compared to $1.4 million Q1 2023 and $4.1 million in the second quarter last year.\n\nAs a result, operating margins were 6.4% in the second quarter, up from 5.3% for Q1 2023 and down from 14.8% for the second quarter of last year. Operating income was negatively impacted by currency fluctuations primarily related to the Chinese yuan. Operating expenses also increased due to travel and trade show expenses above our normal run rate, certain administrative expenses such as rent and technology, and a bad debt provision. We opportunistically invest in our operations, but are mindful and aggressive in managing the controllable expenditures to ensure we are on a path to our targeted long-term operating margin goals.\n\nLakeland delivered non-GAAP net in com of $1.1 million or $0.15 per basic and $0.14 per diluted share during the quarter. This compares to $900,000 or $0.15 per basic share and $0.14 per diluted share for Q1 '23 and $3 million or $0.37 per basic and $0.36 per diluted share in the prior year period. As was disclosed in our 10-Q filing, during the quarter, Lakeland reassessed its long-term capital requirements for its Chinese operations due to an updated evaluation of our investment strategies, strategies prioritizing both flexibility and the balance of our capital resources across our global footprint. The board considered this assessment and approved a plan to repatriate approximately $20 million in cash currently held in China.\n\nAs a result of this planned repatriation, we recorded a $2 million discrete deferred tax provision and withholding taxes in the second quarter. While this had an impact on net income for the quarter, this action will allow significantly more flexibility as it relates to our future capital allocation plans. Capital expenditures for the three and six months ended July 31st, 2022 were $100,000 and $500,000 respectively. Year to date, our capital expenditures primarily relate to capital purchases for our manufacturing facilities in Mexico, Vietnam, and India, enhancement of our global IT infrastructure, and our new corporate headquarters office.\n\nWe expect capital expenditures to be approximately $3 million for the full fiscal year as we continue to make these investments in Mexico and Vietnam. Moving to the balance sheet. Working capital was $105.1 million at July 31st, 2022, compared to $108.6 million at January 31st, 2022. Our cash balance was $41.2 million at July 31st, compared to $52.7 million at the end of the fiscal year 2022.\n\nDuring the quarter, we added $7 million of inventory as part of our inventory management strategy we discussed last quarter, with most of the build representing raw materials. As Charlie already alluded to and I discussed earlier, supply chain challenges have persisted and our inventory program is intended to ensure we have access to an adequate supply of raw materials and have adequate finished stock available to decrease customer lead times, address surge demand such as the U.S. regional flooding events and free manufacturing capacity for developing product lines. While we are benefiting from declining transportation cost, lead times continue to be significant.\n\nAt this time, we have essentially reached our stocking goals and we expect to see inventory levels begin to flatten in the second half for this fiscal year. We continue to have no debt at the end of the quarter and we have up to $25 million available from bank credit facilities. During the fiscal 2023 second quarter, the company repurchased $2.7 million or just over 171,000 shares of common stock under its repurchase program. We now have approximately $2.7 million remaining under the current authorization as of July 31st, 2022.\n\nNow I'd like to provide an update on the progress made on our key strategic initiatives. During the second quarter, we finalized our plans for expanding our manufacturing operations in Mexico, began to build out of our cleanroom manufacturing facilities in Vietnam and continue to make progress on our developed technology deployments with a focus on sales operations in the quarter. Looking to the balance of the fiscal year, because of continued macroeconomic headwinds and the delayed recovery of some of our most important industrial markets, including oil and gas, our team has undertaken a rationalization and resource reallocation exercise in support of our strategy to focus on higher value of brand product lines. For example, we believe that COVID-19 has rapidly accelerated the commoditization of the disposables market segment.\n\nWith ongoing supply chain issues and increased cost for industrial inputs, disposable selection is no longer as important for purchasing managers as price. Given our long-term margin ambitions as well as our top-line goals and support of these objectives we are moving more aggressively to shift our product mix toward higher value, higher margin and less commoditized non-disposable products and specific markets. This continued shift away from disposables will free up additional resources to focus on high-value product lines that do not suffer from overstock distribution channels and are more recession resistant. In doing so, we believe we can minimize economic headwind to revenue growth in the second half of this fiscal year.\n\nWith that overview, I'd like to turn the call over to the operator to open the call for questions.\n\nOperator\n\nCertainly. [Operator instructions] Your first question is coming from Alex Fuhrman from Craig-Hallum. Your line is live.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nHey. Thanks, everyone for taking my question. Wanted to ask about how the stronger dollar is impacting demand? I know you mentioned a bunch of different economic headwinds that are starting to emerge. And I think you called out specifically some negative foreign currency translation impact in the second quarter.\n\nBut just from a bigger picture perspective, given that you have such a meaningful chunk of your business in emerging markets. Has that changed the demand conversation with a lot of your end users overseas? Are there particular products that I know you mentioned I guess disposables is becoming a little bit more cost competitive? Are there areas where demand is a little bit more inelastic where you're able to pass through higher pricing? Are there any particular markets or product lines that kind of get priced out given the stronger dollar? Just curious given that in a lot of the markets you operate, it's a pretty substantial currency shift.\n\nAllen Dillard -- Chief Financial Officer\n\nHey, Alex. This is Allen. I'll jump on the first part of that question and then Charlie has got some comments there. From a currency perspective, we haven't really seen that impact demand directly.\n\nFor the most part, we're priced in the local currency in those larger markets. We have some smaller markets where were U.S. dollar denominated on the sales front. So for the most part, we haven't seen that materially affect demand.\n\nI know Charlie's got some comments he would like to make.\n\nCharlie Roberson -- Chief Executive Officer\n\nWell, outside of the U.S. and Canada, our largest markets are Europe and China, where the currency is less of a headwind in their economic conditions, so that's the driver there. But the other point I'd like to make is the one thing that still matters more at least in North America than the price of the product is availability. And right now, we're in a good position to satisfy immediate demand given the current lead times that we're seeing from overseas.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nOK. That's really helpful. And then if I could ask about the strategy that you both talked about on the call here about really focusing more on the higher value predictable, higher margin items and moving away a little bit more from the disposables and given that disposables are such a big part of your business? I imagine this is going to take some time to kind of move the portfolio to where you want it to be. I mean, should we be thinking about the disposables part of your business may be kind of declining in the single-digits and the rest of your business may be growing single or low double-digits and you kind of tweak of the mix in that direction over the next couple of years or could it be a more substantial step function here?\n\nCharlie Roberson -- Chief Executive Officer\n\nAlex, I think that this is going to be a transition that takes place over years. The strategy is born of recognition that given our new profitability targets specifically our gross margin targets. To maintain that level of gross margin, there's a trade-off in revenue and the disposables market is where that trade-off is the most exacerbated. Consequently, that's the reason for our focus on the higher-end product lines.\n\nWe are not abandoning that market at all. What we're really talking about doing is dedicating fewer human assets to it so that we can focus them at the higher end where they can impact sales dollars more greatly than they can in the disposables market. The problem we get when they -- when we try to address or generate our revenue growth through disposables as there's a trade-off in margin that can very quickly given our leverage more than eat up the revenue growth. So that's the reason for the focus on higher margin products.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nOK. That's helpful. And then could you just kind of remind us a little bit, I think, for better or for worse, a lot of investors really associate your business with the disposables, I think especially given all of the business and the headlines around COVID and Ebola and bird flu, I think that's the segment of your business that people are most familiar with. Can you just kind of refresh our memory on the product lines that are higher margin that you're now going to be focusing on things like the high visibility line.\n\nCan you give us a little bit of a sense of what gives you confidence that there is strong demand there? Are these segments of the market that aren't being served as well as disposables, any insight you can shed on that would be very helpful.\n\nCharlie Roberson -- Chief Executive Officer\n\nWell, again, we're not abandoning disposables. In fact, one of our high-value product lines is a subset of disposables and that's the critical environment market, which is pharmaceutical cleanrooms and sterile applications. So we're not abandoning that altogether. What we're trying to do is reduce our dependence on that market or the percentage of our revenue that it's accountable for.\n\nThe reason we know that it will work is if you were listening to Allen's comments, we're already -- we've seen the impact just between Q1 and Q2 with a shift to higher value products does to our profitability, albeit I think we'll see a greater shift in the future or greater impact in the future, that didn't just happen overnight. This has been a strategy that we've been pursuing for over a year now, is starting to bear fruit. We've got two quarters Q1 and Q2 of this year that I would consider true post-COVID quarters. And what's become apparent is we do believe that disposables commoditization has been accelerated and given that price is going to be a bigger part of that market going forward and we want to reduce our dependence on that market and grow in higher value product lines.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nOK. That makes a lot of sense. Thank you very much.\n\nCharlie Roberson -- Chief Executive Officer\n\nYes, sir. Thank you.\n\nOperator\n\nThank you. [Operator instructions] Thank you. That concludes our Q&A session. I will now hand the conference back to Charlie Robertson for closing remarks.\n\nPlease go ahead.\n\nCharlie Roberson -- Chief Executive Officer\n\nThank you all for joining us on today's call. I'd also like to thank our Lakeland team members, our customers, our distribution partners, and many shareholders. We wish you a wonderful Q3 and look forward to sharing our success with you in the near future. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCharlie Roberson -- Chief Executive Officer\n\nAllen Dillard -- Chief Financial Officer\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nMore LAKE analysis\n\nAll earnings call transcripts"
}