{
  "companyName": "Grocery Outlet",
  "companyTicker": "GO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/grocery-outlet-go-q2-2022-earnings-call-transcript/",
  "content": "Grocery Outlet (GO -0.44%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to Grocery Outlet fiscal second quarter 2022 earnings results conference call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation. [Operator instructions] As a reminder, this conference is being recorded.\n\nI would now like to turn the conference over to your host, Arvind Bhatia, vice president, investor relations. Please go ahead, sir.\n\nArvind Bhatia -- Vice President, Investor Relations\n\nThank you. Good afternoon, and thank you for joining us on today's call to discuss Grocery Outlet's second quarter 2022 financial results. Joining me on today's call are Grocery Outlet's chief executive officer, Eric Lindberg; president, RJ Sheedy; and chief financial officer, Charles Bracher. Following our prepared remarks, we will open the call for questions.\n\nThis conference call is being webcast live, and a recording will be available via telephone playback for approximately two weeks. It will also be archived in the Investor Relations section of our website. Participants on this call will make forward-looking statements, including our outlook for fiscal 2022 and future performance. These forward-looking statements are subject to various risks and uncertainties that could cause our actual results to differ materially from these statements.\n\nA description of these factors can be found in this afternoon's press release, as well as in our periodic reports we file with the SEC, all of which may be found on our website at investors.groceryoutlet.com or on sec.gov. We undertake no obligation to revise or update any forward-looking statements or information. These statements are estimates only and not a guarantee of future performance. During the call, we will also reference certain non-GAAP financial information, including adjusted items.\n\nReconciliations of GAAP to non-GAAP measures, as well as the description, limitations, and rationale for using each measure, may be found in the supplemental financial tables included in this afternoon's press release and our SEC filings and the Investors tab for our website. With that, it is my pleasure to turn the call over to Eric.\n\nEric Lindberg -- Chief Executive Officer\n\nThanks, Arvind. Good afternoon, everyone, and thank you for joining us for our discussion of our second quarter results. We are extremely pleased to report another strong quarter as we continue to deliver deep values and unmatched WOW! shopping experiences for all our customers every day. As consumers grapple with unprecedented levels of inflation, our mission of providing access to affordable quality food and significant savings could not be more relevant.\n\nOur healthy inventory position, flexible sourcing and distribution model, and our strong IO execution are fueling the momentum in our business. In addition, we continue to make progress on our long-term initiatives to increase customer reach and offer greater convenience, including SKU expansion, e-commerce, and our forthcoming mobile app pilot. I want to thank the entire team for their dedication and contribution to our strong execution. Our IOs bring energy enthusiasm to our stores each and every day.\n\nAnd our buying team continues to do a fantastic job of leveraging their relationships to maintain a strong supply pipeline. As a result, we are very well positioned to serve our customers in this inflationary environment as they seek out ways to stretch their budgets. With respect to our second quarter, we grew top-line sales approximately 16%, driven by over 11% growth in comparable store sales, which was well ahead of our expectations. Our comp store sales increase was broad-based with growth in both traffic and basket, as well as strength across product categories and store vintages.\n\nWe were pleased with our gross margin performance at 31.1% as we continue to efficiently leverage our opportunistic buying model and supplier relationships to navigate ongoing cost increases, all while delivering industry-leading value. Solid sales and gross margin performance drove strong bottom-line results for the quarter. As I look forward, I'm excited that our third quarter is off to a strong start. We are increasing our full-year guidance to reflect outperformance in the second quarter, positive quarter-to-date trends, and continued reinvestment in our business.\n\nCharles will share the details surrounding our revised guidance with you momentarily. Next, let me provide you a quick update on our store expansion efforts. Our current vintage of new stores is off to an encouraging start with positive feedback from both operators and customers. During the second quarter, we opened seven new stores across all geographies.\n\nWe continue to develop the Mid-Atlantic market with year-to-date comps running above company average. Traffic is increasing as we build brand awareness and educate customers about our unique model. Based on the broad appeal of our value proposition and the portability of our new store model, we believe that the greater Mid-Atlantic market represents roughly 250 store opportunity on our way toward our long-term target of approximately 4,800 stores nationally. We remain focused on adding 28 net new stores across all of our markets this year and expect to resume 10% unit growth as we move into 2023.\n\nOne of the key pillars underpinning our current and future success is the strength of our entrepreneurial team of independent operators. We're always committed to providing a WOW! shopping experience for the customers, IOs are energized by recent momentum and sales growth. While they are nonetheless managing through their cost increases, we continue to support them with tools, technology, and best practices to help mitigate these pressures in their business. At the same time, we continue to recruit and develop aspiring operators in training, or AOTs, who will operate future stores.\n\nInbound interest remains high, and our current pipeline of AOTs is healthy. We remain committed to selecting high-quality candidates, providing them with rigorous in-store and platform-based training, and ensuring they have the requisite skills to prosper as operators. To that end, in May, we hosted our first ever AOT Culture Day, a forum designed to help AOTs connect with experienced local operators, grocery outlet partners, and each other. The energy throughout the day was palpable as operators shared their passion for the business, fielded questions from AOTs, and discussed what makes operating a Grocery Outlet so unique.\n\nThe event truly highlighted the importance of relationships and the collaborative approach that sets our model apart. We look forward to holding similar sessions in the future as we continue to recruit and develop talented new IOs. Turning to ESG. As you know, our mission of touching lives for the better is core to our values.\n\nReducing food waste and saving customers money, all while positively impacting local communities and providing IOs with an opportunity to own their own business have been key tenets of our model for decades. Epitomizing our mission is our annual Independence from Hunger Campaign. As part of this year's event, our IOs once again partnered with local food agencies to reduce food and security in their communities. Many of our operators went above and beyond to raise money for the cause.\n\nSome even jumped out of airplanes. Winning the award for Bravery, Alix and Aaron Crocker from our Lompoc store kicked off this year's campaign by skydiving from 15,000 feet. They later held a three-hour telephone on Facebook coordinating with 20 locally owned businesses and ultimately garnered over 10,000 individual donations for their town. I continue to be amazed by our IOs creativity and honored by their commitment to positively impact their communities.\n\nThis was the 12th year of the program, and collectively, we raised more than $2.5 million for over 400 local food agency partners, bringing the lifetime total to over $16 million. I want to take a moment to thank everyone who contributed to the campaign and congratulate the team for another successful year. On the governance front, we received strong support for our proposals at our Annual Meeting of Stockholders in June. Shareholders approved our proposal to eliminate supermajority voting provisions and declassify our board in 2026.\n\nWe believe these are important steps in our evolution as a public company and address feedback received from our major shareholders last year. Lastly, we continue to make progress on conducting a materiality assessment and gap analysis, and we expect to publish our first sustainability report next year. In closing, I'm thrilled with the momentum in the business and our focused execution. Our mission of touching lives for the better is unchanged, positioning our business well to serve customers as a search for value and look to offset the impact of rising costs.\n\nLooking forward, I'm extremely optimistic about our runway for growth ahead. We continue to strengthen our foundation, reinvest in our existing business, and build our new capabilities, which will drive future success. With that, I will turn the call over to RJ.\n\nRJ Sheedy -- President\n\nThanks, Eric. Our strong second quarter and year-to-date performance reflects focused execution by our team and a more favorable environment for our extreme value model. Inflation remains at elevated levels, and consumers are increasingly looking for ways to save. With our exceptionally low prices, strong product offering, and WOW! shopping experience, we are very well positioned to provide unmatched value to our customers.\n\nWe are maintaining healthy in-stock levels and product variety across our store base and our supply pipeline is robust. With ongoing supply chain challenges, unpredictable demand patterns, and high inflation, suppliers continue to navigate a dynamic environment. Our scale, long-standing relationships, and ability to move quickly and creatively make us the preferred partner for our suppliers' excess inventory. Let me share an example highlighting this.\n\nWe recently purchased 90,000 cases of biscuits and cinnamon rolls from a leading global packaged foods company. They needed to move through excess inventory, and we were the first partner they turned to for a solution. We acted quickly to purchase all available cases and, in turn, offered it to our customers at 75% savings. Our strong relationships and regular cadence of communication enable the strategic partnerships we have with this supplier plus many others.\n\nWe provide helpful solutions for our suppliers and incredible savings that delight our customers and set us apart from the competition. Next, I would like to share a quick update on our strategic initiatives. We advanced our SKU expansion strategy during the quarter as we added 150 new everyday items, resulting in a total of 600 additional SKUs since last year. Based on customer preferences and industry trends, we continue to prioritize growth categories such as NOSH, fresh, ethnic, and local.\n\nExpansion of our everyday assortment is adding convenience and value for our customers resulting in incremental sales from these new SKUs. And based on our most recent survey, we are pleased to see that customers are reporting even higher satisfaction with our expanded product selection. With respect to e-commerce, while it is still early, we are pleased with the progress and excited about the long-term potential of this channel. During the second quarter, we rolled out Instacart to all stores and launched pilots with DoorDash and Uber Eats.\n\nAnd just recently, following a successful pilot, we expanded DoorDash to nearly all stores. These partnerships are helping us capture incremental customers in a margin-neutral asset-light manner that benefits both Grocery Outlet and our operators. As we continue to broaden product availability through multiple platforms and increased flexibility and convenience, we expect our customer reach and engagement to grow. In terms of our personalization initiative, we are piloting our mobile app in Washington State in the coming weeks.\n\nThrough the app, customers will be able to see new trending and top items in stores on a real-time basis and access curated product recommendations based on their preferences. Extending the treasure hunt experience beyond the four walls of the store will ultimately drive higher trip frequency and share of wallet. Our overall marketing strategy remains focused on increasing brand awareness and driving traffic, and we continue to optimize our spend across digital, TV, and radio. We are also testing new media and targeted messaging to capitalize on the current environment where customers are particularly motivated to change behaviors in order to save money.\n\nOur independent operators continue to focus on grassroots efforts, utilizing our proprietary tools to deliver localized digital and social media marketing. We are encouraged by the trends we are seeing in our consumer surveys, including an increase in new customers shopping our stores and higher overall satisfaction from our tertiary customer segment. Core customers are shopping us more frequently and spending more money. We are also observing higher intent from both customers and noncustomers to shop us more in the future.\n\nConsumers are looking to save money, and we are well positioned to help as the industry's leading value provider. To conclude, we continue to leverage our flexible business model, talented IOs, and agile buying team to deliver incredible value to our customers. While we navigate this dynamic environment, we remain committed to making progress toward our strategic objectives, reinvesting in our business, and delivering consistent long-term profitable growth. Now, I will turn it over to Charles to provide a financial update.\n\nCharles Bracher -- Chief Financial Officer\n\nThanks, RJ, and good afternoon, everyone. I will begin with a discussion of our second quarter results, followed by comments regarding the third quarter and our revised guidance for the fiscal year. Our second quarter performance exceeded both our top-line and bottom-line expectations as we capped off a strong first half. Comparable store sales increased 11.2%, accelerating versus the prior quarter, driven by continued strength in average ticket and our positive traffic trend.\n\nNet sales increased 15.7% to $897.7 million, fueled by our strong comparable store performance, combined with the impact of 25 net new stores opened since the second quarter of last year. During the quarter, we opened seven new stores, including three in the Mid-Atlantic market, ending the quarter with 425 locations. Our new stores are off to a solid start, and we continue to see healthy growth in recent vintages. For the first half of the year, our comp sales increased 8.2%, contributing to net sales growth of 13.2% versus the prior year.\n\nWith respect to gross margin performance, we continue to leverage the flexibility of our model to mitigate the impact of higher costs, while at the same time delivering compelling savings to our customers. Second quarter gross margins of 31.1% improved approximately 40 basis points compared to the same period last year, reflecting a favorable purchasing environment and strong inventory management, which offset product and supply chain cost pressures. For the first half in total, our gross margin rate of 30.7% was roughly flat to the prior year. In terms of gross profit dollar growth, second quarter gross profit increased 17.5% versus the prior year.\n\nWith respect to expenses, SG&A increased 16.2% to $224.2 million compared to the second quarter of 2021. This increase was driven primarily by higher commission expense as strong gross profit performance was shared with IOs. SG&A growth also includes increased incentive compensation, reflecting year-over-year trends and higher store occupancy costs due to new store growth. As a percentage of sales, SG&A increased 10 basis points versus the prior year as higher incentive compensation expense offset leverage on fixed costs.\n\nD&A expense increased 10.8% versus the second quarter last year to $18.8 million. Stock-based compensation increased to $9.5 million, reflecting the impact of grants made in the past 12 months, as well as current expectations related to our performance-based share awards. Net interest expense of $3.9 million was flat versus last year as our $75 million principal paydown in April offset the impact of higher effective interest rates during the quarter. Compared to our normalized tax rate of approximately 28%, we incurred an effective tax rate of 7.7% during the quarter due to excess tax benefits related to the exercise and vesting of equity awards.\n\nAs a result of these factors, GAAP net income for the second quarter was $20.1 million or $0.20 per diluted share. Second quarter adjusted EBITDA increased 18.3% versus the prior year to $60.1 million, reflecting 6.7% of sales, driven by our strong top line and gross margin performance. Adjusted net income increased 23.6% to $28.9 million, and adjusted diluted earnings per share was $0.29 based on an average of 100.1 million diluted shares. During the quarter, we utilized excess cash to further optimize our balance sheet.\n\nDriven by strong internal cash flow, we prepaid $75 million in debt in April and ended the quarter with $84.3 million of cash. Inventory grew 7% from the first quarter to $318 million and remains healthy in terms of quantity, mix, and turnover. Our second quarter capex, net of tenant improvement allowances was $25.5 million, reflecting new store growth, continued investment in our existing fleet in ongoing technology and infrastructure investments. Next, I'd like to highlight our third quarter trends and update you on our full-year outlook.\n\nWith respect to top line, we are pleased with the continued momentum in the business and expect comp sales growth of approximately 10% for the third quarter. For the full year, we are raising our comp guidance to a range of 8% to 8.5%. In terms of unit expansion, we expect to open seven new stores during the quarter and continue to target 28 net new stores for the year. Based on our comp trends and new store openings, we expect third-quarter net sales of approximately $875 million, and we are raising our fiscal 2022 sales guidance to between $3.46 billion and $3.48 billion.\n\nMoving on to margins. We expect third-quarter gross margin of approximately 30.6% as we continue to navigate inflationary product and supply chain pressures. We likewise continue to target a 30.6% full-year gross margin, which includes the impact of lower seasonal fourth quarter margins. With respect to expenses, we expect commission expense will continue to be the largest contributor to our SG&A increase as strong gross profit dollar growth is shared with IOs.\n\nAnd while we are seeing leverage on our fixed costs, this is being offset by higher incentive compensation expense versus the prior year, as well as infrastructure reinvestments. Specifically, we are leaning in to reinvest in people and technology to strengthen our operating platform in areas that will drive future growth. Taking those factors into account, we expect second-half SG&A as a percentage of sales to be in line with first-half performance. With respect to adjusted EBITDA, we expect third quarter performance to be in line with first-half results at approximately 6.3% of sales.\n\nFor the full year, we are increasing our adjusted EBITDA guidance to a range of $218 million to $223 million. Further down the P&L, we continue to expect D&A of approximately $76 million in stock-based compensation of approximately $30 million for the year. We expect net interest expense of approximately $19 million, $1 million higher than our prior guidance due to the impact of rising interest rates on our variable cost debt. Additionally, we continue to forecast a normalized tax rate of 28% and average diluted shares outstanding of approximately 100 million for the year.\n\nTaking all these factors into account, we are raising our full-year adjusted EPS guidance to a range of $0.97 to $1 per diluted share. In closing, our solid financial performance is a testament to the strength of our value-oriented model and our talented team of IOs and employees. We are excited about the path ahead as we continue to strengthen our operating platform and make important investments to drive future growth. And with that, we can turn it back to the operator to begin the Q&A.\n\nOperator\n\nAt this time, we will be conducting a question-and-answer session. [Operator instructions] Our first question comes from Krisztina Katai with Deutsche Bank. Please proceed with your question.\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nHey, guys. Thank you for taking the question, and congratulations on a nice quarter. I guess I just wanted to talk about maybe the uptick that you saw in the second quarter. Maybe just talk about when customer traffic really started to pick up, as you did mention, also positive quarter-to-date trend so far, is the traffic momentum that you're seeing continuing? And are your merchants doing anything differently from a pricing or even a merchandising perspective to essentially enable the momentum to continue for the rest of the year?\n\nEric Lindberg -- Chief Executive Officer\n\nHey, Krisztina, it's Eric. Thanks for the question. Yeah. Look, I'd say a lot of the conditions, macro, the backdrop that we're seeing continue from Q1 into Q2 and Q3.\n\nBut I'll go through some of those, then we can bounce around a bit with Charles and RJ. But look, inflation remains at unprecedented levels and value certainly becomes very, very important to consumers, especially in some of the categories that we're seeing that are very high inflation like meat and produce. You can see from our comp performance in our traffic that a lot of that is passing through. Consumer behavior is definitely shifting based on the momentum and traffic we're seeing.\n\nWe're likely seeing some benefit of the customers shifting from, I'd say, more conventional, more expensive alternatives to the value model or to value shopping. Certainly, seeing some increases in new customers, as well as some return of some churn to customers, which is great news. I think lastly, I'd say just – you know, the trend of eating at home, I think, continues to build. Certainly, we've all experienced it eating out has become so expensive.\n\nI think that shift is certainly upon us.\n\nCharles Bracher -- Chief Financial Officer\n\nAnd, Krisztina, just to give you a bit -- this is Charles, to give you a bit more color with respect to the cadence throughout the quarter, we were really pleased with the consistency that we saw sort of month to month through the quarter. As we mentioned, both ticket and traffic contributed to the positive comp in the quarter. Relative to the first quarter, it was traffic that really improved. We saw that sequential improvement.\n\nSo, it was a larger contributor to comp in Q2 versus Q1. And then we're pleased that momentum is continued here into the third quarter, seeing continued healthy trends. We're balancing that with being mindful of the fact that it continues to be a very dynamic macro environment, but really, really happy with the results that we're seeing.\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nThat's great color. Thank you. And just as my follow-up, I wanted to ask about gross margins. Clearly, second quarter came in much better than expectations in your own guidance, but you did maintain the 30.6% for the full year.\n\nSo, maybe if you could talk about the dynamics that you expect, obviously, in the third and the fourth quarter? And are you seeing anything in the marketplace that would essentially not allow you to continue to manage margins well or even higher on a three-year basis, like we saw in the second quarter? Thank you.\n\nCharles Bracher -- Chief Financial Officer\n\nYeah. Just a bit more color around margin and likewise, another area where the team is just doing a great job continuing to manage, yes, cost increases, but value to the customer and really leveraging the flexibility of our model. Recall that we always speak to the fact that it's normal to see these quarter-to-quarter fluctuations because of the nature of our model. So, I'd describe Q2 performance as really consistent with that.\n\nIt was a slightly more favorable buying environment. The team did a great job managing inventory through the chain. But those cost pressures are real, and they continue to persist. So, that was the nature of our expectation, continuing to manage that 30.6% margin for Q3 and the full year.\n\nThe full-year guide includes the impact of what we typically see are lower seasonal margins in the fourth quarter of the year.\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nGreat. Thank you so much, and enjoy the rest of your summer.\n\nCharles Bracher -- Chief Financial Officer\n\nLikewise.\n\nOperator\n\nOur next question comes from Oliver Chen with Cowen and Company. Please proceed with your question.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThanks a lot. Great quarter. On the comp store sales guidance, it does imply the three-year stack decelerates. Just would love your thoughts on what you're seeing.\n\nAnd also, do you expect traffic to continue to be positive and also the dynamic with UPTs relative to inflation? And then a follow-up is just about the consumer environment that you're witnessing. It sounds like you have some reservations or you're planning around agility as the dynamics continue to evolve. But what are your thoughts about the nature of the consumer you're seeing and how you're prepared with your flexible and value-driven business model? Thanks.\n\nCharles Bracher -- Chief Financial Officer\n\nYeah. Oliver, it's Charles. Let me tackle the first part, and then I'll turn it over to Eric. But with respect to our thoughts on guidance and the implications in sort of the back half of the year, as I mentioned, feeling really good about what we are seeing in the business, but just trying to balance that against the reality of, again, very dynamic macro and consumer environment.\n\nLots of things at play that we're all well aware of across inflation, geopolitical, consumer jobs. It's really hard for us to say how each of those play out and the ultimate impact they have. So, our point of view is it's best to remain prudent as we think about the outlook. And so, again, while we're encouraged by the second quarter and the trends we're seeing, just being mindful of that reality.\n\nAs it relates to kind of ring and traffic assumptions in the back half of the year, ring, our expectation is it continues to be strong. Recall that for us, the inflation impact is a bit more muted because of our model, and we will start to lap in the fourth quarter, some of those higher-AUR that we started to see last year. Traffic, our expectation very much is it will continue to be a positive driver, particularly as customers continue to seek out value.\n\nEric Lindberg -- Chief Executive Officer\n\nHey, Oliver, Eric. I'll just tack on a bit here at the end. Yes, look, I'd say the environment is still somewhat uncertain. There's a lot we don't know.\n\nYes, we did raise guidance. We have increased overall expectations. We're really confident sort of looking forward into next year. But we just don't know from that uncertainty standpoint, how prolonged inflation will be, how high will it go, when will it start to peak and start to come back down? We really don't know what's the reaction that the consumer will ultimately have at that peak.\n\nSo, we're remaining sort of where we are on those expectations. I think we all know things are really expensive. The consumer is hurting or will be hurting as this lasts a little bit longer. And look, we think geo can offer some sort of safe harbor for those consumers, at least on sort of a third of their budget.\n\nSo, it's still uncertain, I guess, is the headline.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThank you very much. Best regards.\n\nCharles Bracher -- Chief Financial Officer\n\nThanks, Oliver.\n\nOperator\n\nOur next question comes from Robby Ohmes with Bank of America. Please proceed with your question.\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks for taking my question. Really, a follow-up on Oliver's question. Can you talk a little bit more about just the high inflation dynamic and how you guys are managing and also how the IOs are managing pricing? So, are -- the gross margin is very consistent.\n\nSo, are you just passing through all the higher costs to maintain that gross margin? Are your IOs able to price above normal versus what you would guide to because of the competitive environment with everything around them inflating? Maybe more color on exactly what's happening out there with the inflation would be great.\n\nRJ Sheedy -- President\n\nYeah, sure. Hey, Robby, it's RJ. I'll share some comments on that. So, first, let me say, inflation has certainly been a big part of managing the business this year.\n\nWe do expect it to remain elevated through the year, and we'll see how that plays out. Really proud of the team and how they've continued to navigate this. And all throughout, we've really been following the same strategy that we've talked about on prior calls. And we do believe we are uniquely positioned because of the model to mitigate inflationary challenges.\n\nSo, first, just as a reminder, on the buying side, we remain very flexible moving between suppliers. We're in and out of items. We're always managing value cost margin, how all those things come together. A more diversified supplier base has been really helpful in this regard.\n\nFrom a competitive pricing standpoint, competitor prices have been moving up. We are fast to follow. It's important for us to maintain consistent value deltas across the many metrics we track related to value. Basket savings of 40% remains healthy.\n\nSo, feel really good about that. And then just in general, we remain flexible in managing the assortment and pricing. Much of future inventory, you're looking three, four, five weeks out, we haven't purchased it yet or priced it. And so, that dynamic nature of the buying model is super helpful.\n\nIn regards to the operator side of the model and how that helps manage inflation, I would describe pricing and margin management as being more centrally managed. So, as we're negotiating deals, those are pricing items. We're doing a lot of that, all of it to start centrally. And then at the store level, operator has flexibility to manage pricing.\n\nThey've always had that. It helps them be as competitive as they can for local market competitive dynamic purposes. And it's a mix of, I would say, both changes down and changes up. And so, we are similarly aligned in wanting first and foremost, to deliver value, but then also to manage margin and understanding that every store is unique.\n\nOne of the powers of the model as we have this combination here with pricing like we do with other parts of the business where we're centralized, we have scale, but then also it's local, and it's specific to each store and each situation and with the eyes and the touch of the operator there for what's best for their customers.\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nThat's really helpful. Thanks, RJ.\n\nRJ Sheedy -- President\n\nYou bet.\n\nOperator\n\nOur next question comes from Jeremy Hamblin with Craig-Hallum. Please proceed with your question.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nThanks, and congrats on the really strong results. I wanted to come back to the buying environment. And you noted on a couple of occasions that the buying environment was particularly strong over the last few months. I wanted to get a sense of how that's evolving over the last month or two and reconcile that a little bit with your gross margin expectations.\n\nUnderstand the seasonality for Q4, but in terms of whether or not you're seeing kind of that environment where there was a lot of inventory available, is that starting to dry up just a little bit where there's still plenty of deals to be had, but maybe not quite as attractive in an environment as we were in, let's say, three, four, five months ago?\n\nRJ Sheedy -- President\n\nYeah. Hi, Jeremy. Thanks for the question. Yes, a few comments on that.\n\nFirst, we continue to be really encouraged by the pipeline of opportunistic product that we're seeing, I would say, the momentum from Q2 that we talk about here has carried over to the third quarter, so leading to healthy inventory positions broadly based. So, feel good about that. We have seen improvement through the year. Certainly, supply chain disruption has been -- is making it difficult -- increasingly difficult for suppliers to manage inventory.\n\nWe're encouraged in the broad-based nature of the deals and the list that we're seeing from suppliers. So, really no changes there in terms of breadth from what we've reported previously. I mentioned more specifically similar trends as we've seen in the past of forecasting challenges continue due to inconsistency and demand patterns, and I'd say, to some extent, have even increased. Suppliers are still investing in product innovation and capacity.\n\nSo, that is yielding surplus inventory. And there's just been a lot of adjustments to products and assortment, whether it's to meet consumer needs and behaviors as those have been changing. As Eric mentioned, some inflation-related packaging sizes, etc., others maybe more brand and marketing related as well. So, a number of trends that have been playing out increasingly this year that have led to continued healthiness in the pipeline of product.\n\nAll that said, and maybe getting to the second part of your question, we are still navigating plenty of supply chain, labor, transportation challenges. Those have been impacting item-specific availability and delivery. So, something we're keeping a close eye on. And then just in general, the environment is very dynamic, and there's just a lot going on.\n\nYou know, inflation, you already talked about cost increases are still there, and you know, those have not abated. And so, plenty for us to manage closely through the rest of the year. But overall, you know, feeling really good about inventory and future availability of supply.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nThanks. That's great color. And just a follow-up question. You noted some changes in your media spend, wanted to get a sense in terms of -- it looks like maybe a little uptick in your TV ad spend.\n\nI think you noted some strong growth better than average in our Mid-Atlantic market and feeling confident about the 250 units there over time. Just want to get a sense, are you seeing the uptick, the outperformance in that region? Is that kind of related to improved brand awareness? Any studies that you guys have done on that would be hopeful color. Thanks.\n\nRJ Sheedy -- President\n\nYeah, sure. Yeah, good question. So, first, let me say from a marketing standpoint, we continue to remain focused on delivering a consistent message of value and quality across the assortment. The objective here is to build brand awareness, drive traffic, repeat trips in addition to customer acquisition.\n\nI want to first say operators continue to do a great job with their local marketing efforts, how they connect with communities. The personal communication they have with customers and engagement within their community matters even more right now and continues to be a strong differentiator. And then we support that with brand marketing. We provide tools.\n\nWe continue to push on digital platforms, complemented by more traditional TV, radio, and print. With respect to investment levels, I would say we've always taken a more targeted approach to marketing, and we do make higher investments or more concentrated investments when we see better returns. We think this is a very attractive environment for us from a marketing standpoint. We're always testing new things, whether it's media that we're investing in geographies, assortment, maybe messaging-related.\n\nSo, just think about this continual test-and-learn cycle. We have found customers to be very responsive to value and quality messaging, right, consistent with how we've always messaged in light of the environment. And for us, the focus has really been on increasing that top-of-funnel awareness than driving trial from new customers, followed then by all the attributes of the model and continued marketing to build that loyal customer base and repeat visits. We do have a number of tests underway in markets, many markets, many different types of tests.\n\nAnd as we see returns from those, we'll look to adjust our marketing spend accordingly.\n\nOperator\n\nOur next question is with John Heinbockel with Guggenheim Partners. Please proceed with your question.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nHey, guys, I want to start with two initiatives I don't think you touched on yet tonight, right? So private brand and data analytics, where do we stand on both of those? And where will we kind of think about the bulk of that investment, right? Is that sort of a 2023 time frame that will be spread out over more years than that, at least the upfront build?\n\nRJ Sheedy -- President\n\nYeah. Hey, John, thanks for the question. Yes, in terms of private brand, let me just first say, really pleased with the progress that we've had in regards to SKU expansion, 600 items in the past year. We're seeing nice incremental sales.\n\nWe love the focus areas around NOSH, fresh, ethnic, and local. They've really gone, I think, a long way to help make the assortment even more relevant than it has been. So, really encouraged by that. Private label product development, this idea around introducing more unique destination items into the assortment is something we're really excited about.\n\nThere's more work to be done just in terms of building that muscle. Certainly, it's a capability that I would say, we've introduced some private label, some unique products, but we think the opportunity is still largely ahead of us. So, we're excited for that continued growth. We think it will further enhance the assortment.\n\nThink about it here in the coming years in terms of really building the capability and then before you're able to see a more meaningful representation in the assortment itself. And then in regards to data and analytics, we apply a lot of data and analytics to our business today, and it really lives throughout the organization. But it's another one that we're excited about as we look forward into the future, how can we do it even better? How can we make sure that the right data lives across the business in the right ways and throughout the entire supply chain? I'd mentioned the personalization app is just one real-time example of how new data into this business will help us make smarter decisions, and there are plenty of others as we think about the initiatives underway. So, I'm excited for what's to come with that initiative as well.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nAll right. And then maybe as a follow-up, high level, right, if you think about Mid-Atlantic versus, let's say, parts of California, maybe your puts and takes, right, density value -- consumer value orientation, competition, product availability on the East Coast, how would you compare and contrast? And do you think the -- is the opportunity in the broader Northeast, right, not just Mid-Atlantic, but say Boston to Virginia, that would seem to be at least on a par with California, if not bigger.\n\nEric Lindberg -- Chief Executive Officer\n\nYeah. You know, if you take the -- John, hey, it's Eric. Thanks for the question. If you take the geography and you overlay sort of San Francisco to Seattle and take that to the East Coast, there's a lot of similarities to the way we built the business last 20 or 30 years here.\n\nSo, yes, that's a point that you make. It's a good one. We look at it in terms of rooftop density, very appealing in the Mid-Atlantic. That's a check mark.\n\nWe look at product availability and the number of times that we've been asked to help with inventories over the years out of Carlisle, Pennsylvania, that's a checkmark. And then you look at the proximity of competition. I wouldn't say the Mid-Atlantic is super competitive compared to what we see perhaps if you were to compare to the Southwest or L.A. I think we already exist in some very, very competitive markets.\n\nSo, when we sort of run that across places we could expand, there's no mystery to why we chose the Mid-Atlantic. We looked at it as the best opportunity, a lot of stores around a small geography and circle from a distribution standpoint. And then what we really like is that we can go north, we can go west, or we can go south. And those are all viable opportunities.\n\nIt's just a matter of prioritization and really distribution capability where you decide to go next. But we continue to be very, very excited about it, like what we're seeing so far. Some of our top-performing stores are in that region this year, really starting to build that brand awareness that you heard RJ talk about from a marketing media mix. And look, I think it's – you know, we're doing what we said we were going to do, which is build the foundation and then start to layer in the stores.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nThank you.\n\nEric Lindberg -- Chief Executive Officer\n\nYou bet.\n\nOperator\n\n[Operator instructions] Our next question comes from Simeon Gutman with Morgan Stanley. Please proceed with your question.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nGood afternoon. I have two questions. My first is on the backdrop, and this was touched on several questions. Any signs that the pressure on the consumer is abating at all? Or the forces that they're facing, are those accelerating? And this is part of the first question.\n\nWithin -- if you look at the geometric stacks on a three-year, which is what we look at, you did accelerate 300 basis points versus the prior quarter. Did you say or can you say how much of that was incremental inflation versus incremental traffic?\n\nEric Lindberg -- Chief Executive Officer\n\nHey, Simeon, it's Eric. Look, I don't think we have a crystal ball on when the pressure on the consumer abates but we have never seen the assault on the consumer that we're seeing right now from energy to fuel to pricing, just inflation across the board. Stack on top of that, demand is creating just a massive imbalance of what's available and what they can get. Fortunately, labor has caught up with that.\n\nAnd I think we're starting to see some outstripping of wage gains with inflation, so that's not good. How long it lasts and how high it goes, I think, are the questions you really need to answer before you can say when the consumer taps out. But we've seen a little bit of trade down. I think you're seeing some trade from other more expensive to geo.\n\nWe're seeing a little bit inside of categories, things like in meat, from beef to chicken, but those are more anecdotal than data. So, I think it's anyone's guess how long this lasts. I think it's really going to equal how bad it gets for the consumer.\n\nCharles Bracher -- Chief Financial Officer\n\nAnd Simeon, it's Charles. To your question about the inflation impact on the three-year stacks, no, we didn't quantify it. But I think getting to the heart of your question, is we thought -- as we looked at Q1 to Q2 performance, it was -- AUR is pretty consistent in terms of the impact there. It was the uptick in traffic that was really the difference between the two quarters.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThat's helpful. My follow-up is on expenses or, I guess, incremental margins. So, you did mention that you're being conservative or prudent for the second half in terms of top line. And if you model out the top line with the second half, it looks like the incremental margins are a little below average.\n\nAnd I think we chalk that up to the SG&A. And Eric, you mentioned that earlier. Do you have any sense that this SG&A environment, when we get through the back half of this year, we look cleaner into the next year? I realize there isn't a crystal ball on the cost pressure side of it. But do we lap enough of it where we start to see this abatement, and then your incrementals can resume back to normal when we go to '23?\n\nCharles Bracher -- Chief Financial Officer\n\nYeah. Good question. I think we will lap the higher incentive compensation and get to a more normalized incentive comp run rate next year, particularly as you think about the year-over-year differences we're seeing this year in trends. As it relates to other inflationary pressures and when those abate, I think that's a little bit harder to tell.\n\nBut we do very much continue to orient over the long term back to the historical growth algorithm and have confidence in managing toward both consistent gross margins and bottom-line EBITDA margins over time.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Mark Carden with UBS. Please proceed with your question.\n\nMark Carden -- UBS -- Analyst\n\nGood afternoon. Thanks a lot for taking my questions. So, to start, some of the underlying commodity and other factors that have driven heavy inflation are starting to roll over. If there happens to be broad-based through deflation a few quarters out, will Grocery Outlet be any less impacted than others given its model? And then how much of an impact with lower gross profit dollars have on your independent operators? Thanks.\n\nCharles Bracher -- Chief Financial Officer\n\nHey, Mark, this is Charles. Let me take the first part of your question there. Just thinking about deflation potential in the future, and I would say back to the uniqueness of our model, it is quite resilient. It does -- we always talk about the fact that it mutes the impact of inflation on the way up and deflation on the way down.\n\nI think you can look back at our strong history of comps and margin stability across a number of cycles to see that. And so, for us, it's all about continuing to deliver value -- relative value for the consumer. And so, feel good about the model's ability to handle deflation if that comes about.\n\nMark Carden -- UBS -- Analyst\n\nGreat. That's helpful. And then over the past few quarters, you guys have noted some supply chain challenges impacting our ability to open as many stores as you may like to. Have you seen much relative improvement on that front when you think about 2023 and beyond?\n\nEric Lindberg -- Chief Executive Officer\n\nYeah. We've seen a bit. Look, I think we're basically positive that we're seeing some pullback on some of the challenges. I separate the issues into two buckets.\n\nOne, we don't really see a real estate site selection problem. It's more of an issue of actually getting the stores open. We've had a really good cadence in recent months of fuel visits and real estate approval meetings to get sites open for '23 and '24. So, the good news is that the sites are there.\n\nThe bad news is it's been very, very challenging to get things through, I'd say, the process. So, we do believe that over time, the next year or so, some of those headwinds will moderate. We think labor availability, the longer lead times and lease execution, the site permitting challenges will stabilize and get better. We've been very proactive in terms of what we can do to control or at least impact some of those things.\n\nWe've expanded the real estate team, and we've managed some of the delays by ordering fixtures far, far in advance just to get ready for it. So, I would say we don't have total control over the entire process, but what we do, we're doing, as well as we possibly can, and we're going to return to that 10% growth algorithm next year.\n\nMark Carden -- UBS -- Analyst\n\nGot it. Thanks so much. Good luck at that thing.\n\nOperator\n\nOur next question comes from Corey Tarlowe with Jefferies. Please proceed with your question.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nHi. Good afternoon. I believe you mentioned that the buying environment has been, I think, slightly more favorable than it has been in the past. Or just passing on an earlier question, would you be able to provide any color as to which categories maybe you're seeing more or less availability in as you look across the supply that you have available to you?\n\nRJ Sheedy -- President\n\nHi, Corey. Yeah. It's RJ. Yeah, nothing really category-specific.\n\nIt has been broad-based. We're seeing healthy list across really all the categories and down deeper into the assortment subcategories. So, feeling really good about both the amount, the volume as well as the breadth of the opportunistic supply opportunities that we're seeing from our supplier partners.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nUnderstood. And then just as a follow-up as it relates to expansion, you touched on how you've added, I believe it was close to 600 SKUs versus last year, and categories like NOSH, ethnic and local, do you have a plan as to how many more SKUs you intend to add into the assortment over the next, say, 12 months or so?\n\nRJ Sheedy -- President\n\nYeah. So, as we mentioned before, SKU expansion is something that we've done as just a regular course of business over a long period of time. So, I'd say we look to continue to add items. We still like these focus areas that we've been adding items in, so just those focus areas, we've seen really nice incremental sales from these items themselves and then the extension of that, of course, is what it represents to the basket and future shopping trips.\n\nSo, we just really like the balance that it provides and, in some cases, consistency where those items remain in the assortment for a long period of time. So, in terms of strategy going forward, we'll continue to follow the same approach, relying on data conversations with our supplier partners to strategically add items in some cases, smaller categories. And I'd point to a recent introduction test of some grab-and-go and HomeGoods meal replacement items as a recent example of that. But we'll continue to look for those opportunities and continue to evolve the assortment as we have for a long period of time.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nThat's great. Very helpful. Thank you for all the color and best of luck.\n\nRJ Sheedy -- President\n\nThanks, Corey.\n\nOperator\n\n[Operator instructions]\n\nEric Lindberg -- Chief Executive Officer\n\nOK. Thanks, everyone, for dialing in today. We look forward to catching up with you on the one-on-ones. Appreciate your attention, and we will talk to you soon.\n\nThanks so much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nArvind Bhatia -- Vice President, Investor Relations\n\nEric Lindberg -- Chief Executive Officer\n\nRJ Sheedy -- President\n\nCharles Bracher -- Chief Financial Officer\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nOliver Chen -- Cowen and Company -- Analyst\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nMark Carden -- UBS -- Analyst\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nMore GO analysis\n\nAll earnings call transcripts"
}