{
  "companyName": "Regions Financial",
  "companyTicker": "RF",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/21/regions-financial-rf-q3-2022-earnings-call-transcr/",
  "content": "Regions Financial (RF -0.28%)\nQ3 2022 Earnings Call\nOct 21, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Regions Financial Corporation's quarterly earnings call. My name is Christine, and I will be your operator for today's call. [Operator instructions] I will now turn the call over to Dana Nolan to begin.\n\nDana Nolan -- Executive Vice President, Head of Investor Relations\n\nThank you, Christine. Welcome to Regions' third quarter 2022 earnings call. John and David will provide high-level commentary regarding the quarter. Earnings documents, which include our forward-looking statements disclaimer and non-GAAP information, are available on the investor relations section of our website.\n\nThese disclosures cover our presentation materials, prepared comments, and Q&A. I will now turn the call over to John.\n\nJohn Turner -- President and Chief Executive Officer\n\nThank you, Dana, and good morning, everyone. We appreciate you joining our call today. Once again, Regions delivered another strong quarter, underscoring our commitment to generating consistent, sustainable long-term performance. We generated earnings of $404 million, resulting in earnings per share of $0.43.\n\nOur results include the resolution of a previously disclosed regulatory matter, the establishment of an incremental $20 million reserve for potential losses associated with Hurricane Ian, and a strategic sale of $1.2 billion of unsecured consumer loans. Excluding the regulatory matter and other adjusted items, we once again generated record adjusted pre-tax pre-provision income. This quarter's results reflect strong revenue growth driven by higher rates, robust loan growth, low deposit cost, and well-controlled operating expenses. Asset quality remains broadly stable, with credit metrics in line to slightly better than pre-pandemic levels.\n\nIn general, we feel good about the health of both our corporate and consumer customers. Many of our business customers have adopted operating models capable of thriving in uncertain operating environments and remain cautiously optimistic about opportunities to grow and expand their businesses. Consumers continue to maintain strong liquidity levels, and unemployment in our footprint remains at historical lows. This quarter's results are further evidence of the investments we made in talent, technology, and strategic acquisitions continue to pay off.\n\nAs expanded products, capabilities and expertise are helping us to meet customer needs and deepen relationships. Before wrapping up, I want to take a moment to speak about Hurricane Ian. This was an incredibly powerful storm, and communities in Florida and South Carolina all face difficult challenges as they began the recovery process. I'm extremely proud of the way our teams are responding to meet the needs of our customers, fellow associates, and communities affected.\n\nRegions has a long history of helping communities through difficult times and will continue to support the recovery efforts. In closing, we have a strong balance sheet that is well positioned to perform in any economic environment. We have a solid strategic plan, an outstanding team, and a proven track record of successful execution. While sentiment across both business and consumers remains generally positive, we will continue to monitor our portfolios for indicators of stress.\n\nWe have robust credit and interest rate risk management frameworks and a disciplined and dynamic approach to managing concentration risk, which has positioned us well to continue to deliver consistent, sustainable long-term performance. Now, David will provide some highlights regarding the quarter.\n\nDave Turner -- Chief Financial Officer\n\nThank you, John. Let's start with the balance sheet. Average loans grew 4% while ending loans grew 1% during the quarter Ending loans reflect the impact of the strategic sale of $1.2 billion of consumer loans on the last day of the quarter and represents another example of our disciplined approach to capital allocation. Average business loans increased 5%, reflecting high-quality, broad-based growth across all businesses and industries, specifically financial services, wholesale durables, transportation, information services, and multifamily.\n\nApproximately 70% of the growth again this quarter was driven by existing clients accessing and expanding their credit lines to rebuild inventories and expand their businesses. Commercial line utilization levels ended the quarter at approximately 43.1%, modestly lower versus the prior quarter. However, loan production remained strong with linked quarter commitments up $4.4 billion. Unfavorable capital market pricing continues to augment loan growth.\n\nHowever, we believe improved market conditions will eventually lead to clients refinancing off our balance sheet through the debt markets. Average consumer loans grew 3%, while ending loans declined 1%, driven primarily by the previously mentioned loan sale. Growth in average mortgage, credit card, and other consumer was offset by declines in other categories. Within other consumer, EnerBank loans, which are primarily prime and super prime, grew 14% compared to the prior quarter.\n\nWe expect full year 2022 average loan growth of approximately 9%. This assumes a slowing rate of growth compared to the third quarter. Let's turn to deposits. As expected, deposits continued to normalize in the quarter.\n\nAverage total consumer balances were modestly lower quarter over quarter, largely consistent with typical pre-pandemic seasonal effects. Despite inflationary pressures, consumer balances have remained relatively stable, supported by wage increases and prudent spending. Additionally, new customers and additional account acquisition remains healthy. Normalization has been more evident in average corporate and commercial deposits, which are down $2.9 billion quarter over quarter.\n\nHowever, overall liquidity managed by the corporate bank on and off balance sheet is relatively stable compared to year-end levels, reflecting the movement of some customer funds to off balance sheet treasury management options. The movement to these products and the remixing out of noninterest-bearing checking accounts into higher-yielding money market and savings accounts is as expected and is reflected in our overall deposit beta assumptions for this cycle. Ending balances have declined approximately $3.7 billion year to date, in line with our full year expectation for overall deposit reduction of between $5 billion and $10 billion. A rapidly rising rate environment is a significant competitive advantage for Regions, based on the combination of our legacy deposit base and the more resilient components of surge deposits.\n\nLet's shift to net interest income and margin. Reflecting our asset-sensitive profile, net interest income grew $154 million or 14% quarter over quarter, while reported net interest margin increased 47 basis points to 3.53%. Our adjusted margin was 3.68%, reflecting the combined effects of average cash balances of $14 billion and PPP. The cycle to date deposit beta remains low at 9%, contributing to higher-than-anticipated net interest income growth.\n\nWe expect full year deposit betas in the high teens. In addition to higher rates, growth in average loan balances provided further support for net interest income. Looking forward, while we do expect cash balances to continue to normalize, we do not anticipate accessing more expensive wholesale borrowing markets for multiple quarters. This, coupled with additional hedge maturities in the fourth quarter, provides further runway for margin expansion.\n\nTotal net interest income is projected to increase 7% to 9% in the fourth quarter and is now expected to be approximately 33% to 35% higher than the first quarter of 2022. Reported net interest margin is projected to surpass 3.80% in the fourth quarter. While we have purposefully retained leverage to higher interest rates during a period of low rates, our attention has shifted to normalizing our interest rate risk profile in today's uncertain environment. Through the first half of 2022, we added $15 billion of swaps and securities.\n\nThe swaps become effective in the latter half of 2023 and 2024 and generally have a term of three years. This represents approximately 75% of the total hedging amount expected this cycle. As previously disclosed, hedging already completed will support a 3.60% margin floor even if rates move back to below 1%. We made some modest tactical changes to our profile in the third quarter, primarily extending some of our current protection.\n\nWe still expect to execute an additional $5 billion of hedges that will balance market rate levels and risk to growth as we decide the appropriate time to finish the program. Now, let's take a look at fee revenue and expense. Adjusted noninterest income declined 5% from the prior quarter as the modest increase in wealth management was offset by declines in other categories. Service charges declined as impact of policy enhancements implemented in mid-June offset increases in other service charges, including treasury management.\n\nWe expect to implement a grace period feature sometime in 2023. Overdraft policy changes made to date are expected to result in full year service charges of approximately $630 million in 2022. In 2023, after including the impact of a grace period feature, full year service charges are expected to be approximately $550 million. Within capital markets, activity was negatively impacted by the delay of M&A deals and higher rates in real estate capital markets.\n\nResults also include a positive $21 million CVA and DVA adjustment. We expect capital markets to generate fourth quarter revenue in the to $90 million range, excluding the impact of CVA and DVA. Card and ATM fees declined quarter over quarter. Credit card income was negatively impacted by higher costs associated with the reward liability, while check card and ATM fees produced lower interchange due to a decline in both transaction volume and discretionary spending resulting from higher inflation.\n\nElevated interest rates and seasonally lower production drove mortgage income lower during the quarter but was partially offset by higher servicing income. Wealth management continues to perform well despite ongoing market volatility, and we expect this business to grow incrementally year over year. We also expect full year 2022 adjusted total revenue to be up 11% to 12%, driven primarily by growth in net interest income, partially offset by lower PPP-related revenue and the impact of overdraft policy changes. So, let's move on to noninterest expense.\n\nReported professional and legal expenses reflect a charge related to the resolution of a previously announced regulatory matter. We do anticipate $50 million of this charge will be mitigated by insurance reimbursement proceeds, which we expect to receive in the fourth quarter. Excluding this and other adjusted items, adjusted noninterest expenses increased 4% compared to the prior quarter. Salaries and benefits increased 3%, primarily due to an increase of 277 full-time equivalent associates, as well as one additional day in the quarter.\n\nThis increase was partially offset by lower variable base compensation and a decrease in payroll taxes. Over 70% of the increase in associate headcount are customer-facing within our three lines of business. We expect full year 2022 adjusted noninterest expenses to be up 4.5% to 5.5% compared to 2021. Importantly, this includes the full year impact of the acquisitions we completed in the fourth quarter of last year, as well as inflationary impacts.\n\nWith the changes in revenue and expense guidance, we expect to generate positive adjusted operating leverage of approximately 6% in 2022. Although the consumer loan sale and hurricane-specific reserve creates some volatility in certain credit metrics this quarter, underlying credit performance remains broadly stable. Reported annualized net charge-offs increased 29 basis points. However, excluding the impact of the consumer loan sale, adjusted net charge-offs were in line with our expectations at 19 basis points, a 2 basis-point increase over the prior quarter.\n\nWe are seeing some deterioration in certain commercial segments that contributed to a quarter-over-quarter increase in nonperforming loans, but it is important to note that we remain below pre-pandemic levels. Provision expense was $135 million this quarter. The increase relative to the second quarter was due primarily to another quarter of strong growth in loans and commitments, normalizing credit from historically low levels and a $20 million reserve build for potential losses associated with Hurricane Ian. These increases were partially offset by a net provision benefit of $31 million associated with the consumer loan sale.\n\nOur allowance for credit loss ratio is up 1 basis point to 1.63% of total loans, while the allowance as a percentage of nonperforming loans remained strong at 311%. Our year-to-date adjusted net charge-off ratio is 19 basis points, and we now expect our full year 2022 adjusted net charge-off ratio to remain approximately 20 basis points. We ended the quarter with a common equity Tier 1 ratio at an estimated 9.3%, reflecting solid capital generation through earnings, partially offset by continued strong loan growth. Given the uncertain economic outlook, we plan to manage capital levels to the mid to upper end of our 9.25% to 9.75% operating range over time.\n\nSo, in closing, we've delivered strong year-to-date performance despite volatile economic conditions. We will continue to be a source of stability to our customers and also being vigilant with respect to any indicators of potential market contraction. Pretax pre-provision income remained strong. Expenses are well controlled.\n\nCredit remains broadly stable, and capital and liquidity are solid. With that, we're happy to take your questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Ebrahim Poonawala with Bank of America Merrill Lynch. Please proceed with your question.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nGood morning.\n\nJohn Turner -- President and Chief Executive Officer\n\nGood morning, Ebrahim.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nGood morning, John. I guess maybe just to start out, I mean, obviously, revenue backdrop, NII looking pretty good heading into next year. Just give us a sense of how you're thinking about using some of these toward franchise investments, how we should think about expense growth going from here, both in terms of investments you're making, inflationary costs that you're seeing and just using a better revenue backdrop to actually invest in the franchise. Thanks.\n\nDave Turner -- Chief Financial Officer\n\nYeah, Ebrahim. This is David. So, as you saw, we made some -- quite a bit of investment last year in the fourth quarter through three nonbank acquisitions. We continue to look for opportunities in all three lines of business to continue to grow our franchise.\n\nWe have a lot of things going on. We have our new systems, we're going to be putting in over time. And we'll see cost increases related to that. But we have our continuous improvement program that we continue to leverage to keep our total expense growth under control.\n\nWe're not going to give you guidance for next year, but we do have a page in the deck that shows you what our compound annual growth rate has been very strong in managing and keeping our costs down. And we're going to continue to do that while making appropriate investments. We don't have anything specific. We're on the look for opportunities to help grow our three lines of business soon.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nAnd those, they were essentially tuck-in deals, be it fintech or fee kind of deals that you've done recently similar to those?\n\nDave Turner -- Chief Financial Officer\n\nThat's correct.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And just one quick question on -- I mean, obviously, your hedging strategy is well understood. As we think about in a world where rates overshoot expectations relative to the forward curve, is there any risk to a potential drag to the margin at least in the short run where Fed is not cutting, but we actually see rates going much higher than what the forward cost pricing is?\n\nDave Turner -- Chief Financial Officer\n\nWell, I think you have a couple of different things. Higher rates for our type of franchise is good for us. So, to the extent we overshoot 4.5%, 5% of Fed funds, we'll benefit from that. Clearly, if it stays up there longer, you end up having some incremental credit risk because if rates are that high, that means inflation continues to be higher than the Fed wants, and they have to keep going.\n\nSo, there could be some incremental credit risk until you get to settle down from a rate increase standpoint. The reason we haven't completed our hedging program and the reason we have $13 billion of cash is partially wanting to -- I don't want to use hedge again, but part of trying to figure out where rates might go. So, we have a bit of dry powder. That's about $5 billion that we have dry, not counting at 13 on the books to hedge, and we're looking for a better foothold.\n\nSo, we could be patient. Our NII is growing nicely without that. And I think in our material, we show you that we can protect a margin right now of 3.60 if rates were to go back to 1% or below. So, being patient, I think, is the right thing for us to be.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks for taking my questions.\n\nOperator\n\nOur next question comes from the line of John Pancari with Evercore ISI. Please proceed with your question.\n\nJohn Turner -- President and Chief Executive Officer\n\nGood morning, John.\n\nJohn Pancari -- Evercore ISI -- Analyst\n\nGood morning. Just on the credit front, if you could get with a little more detail on the low or consumer loan sale in terms of the actual types of credits that were sold. And any remaining sales expected on that front? And if so, how are you thinking about the loss content on any remaining transactions on that side?\n\nDave Turner -- Chief Financial Officer\n\nSure, John. This is David. So, we acquired EnerBank in the fourth quarter last year. It's an unsecured consumer portfolio.\n\nWe told you at that time, we could grow that portfolio double digits. That industry was about $175 billion industry. So, you're talking about $1.7 billion to $2 billion worth of production each year. But we also had this other unsecured consumer portfolio that we had built up over time that those loans were not being serviced by us or serviced by a third party.\n\nAnd we thought that the right thing to do from a capital allocation standpoint and a risk reduction standpoint would be to sell that portfolio as we continue to invest in growing our EnerBank book. As you can see in the slides, we had reserved about $94 million. We ended up taking charge-offs of $63 million. So, we had $31 million worth of provision benefit that's flowing through the financials this quarter.\n\nBut it was really a capital allocation risk reduction measure. And we don't anticipate at this time having anything else. We don't have any other unsecured portfolios like that -- that's not true. We do have a small, and it's a runoff.\n\nJohn Pancari -- Evercore ISI -- Analyst\n\nGot it. OK. All right. That's helpful.\n\nAnd then definitely also on credit, sorry. But the -- can you give us a little more detail around the decrease in NPAs. I know you mentioned some commercial segments. So, what commercial areas did you see that increase? Anything indicative of a trend you see there? And then I know you mentioned that you're seeing some normalization in credit that influence your provisioning.\n\nIn what areas are you seeing that normalization? And could that interpret into higher charge-off expectations for '23, even though I know you're at 20 bps for 2022?\n\nJohn Turner -- President and Chief Executive Officer\n\nYeah. John, this is John. So, we are seeing some stress in the office portfolio, particularly urban office, a reflection of some of the back-to-work changes that we're all seeing in the economy, consumer discretionary related kinds of businesses where consumers are choosing not to spend as freely as they had been. Some softness in not-for-profit healthcare related to rising labor costs and inflation, similarly in senior housing.\n\nAgain, we're seeing, I would say, some impacts from both labor and inflationary costs, and then some disruption in technology-related businesses. All that I'd characterize as the beginnings of what we would call normalization. We are at historically low levels in terms of credit quality. The best I've seen in my almost 40-year career.\n\nAnd so, we do expect credit metrics to begin to normalize in 2023 and beyond. Currently at 52 basis points of NPLs, still much better than pre-pandemic levels. The charge-offs, as you noted, 19 basis points for the quarter. We expect 20 for the year.\n\nWe'll firm up our guidance for 2023 in late November or January. But our current projection is net charge-offs in '23 will be somewhere between 25 basis points and 35 basis points as we begin to see a return to more normal levels, again, of credit quality.\n\nJohn Pancari -- Evercore ISI -- Analyst\n\nAll right. Thanks for taking my questions. Very helpful, John.\n\nJohn Turner -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Ken Usdin with Jefferies. Please proceed with your question.\n\nJohn Turner -- President and Chief Executive Officer\n\nGood morning, Ken.\n\nKen Usdin -- Jefferies -- Analyst\n\nHey, good morning, everyone. If I could just focus in on the fee side. I see you're continuing to reiterate your '23 service fees guidance of 550. And just kind of take, you know, through the recent settlement and the incremental changes that you're making and the confidence you have in continuing to reiterate that level of service fees for next year.\n\nThanks.\n\nJohn Turner -- President and Chief Executive Officer\n\nYes. Ken, thank you for the question. You know, I think what we're observing is customer patterns are very much what we expected when we made changes. So, you might recall that we changed our posting order.\n\nWe provided customers with alerts. We reduced the cap on daily overdraft fees. We eliminated charging for NSF. We eliminated charges for overdraft protection transfers.\n\nMost recently, we're giving customers access to their paycheck two days in advance. We also have implemented an overdraft protection line of credit to help customers. And in probably the second half of 2023, we'll also implement a grace period. All that is designed to help customers better manage their finances.\n\nAnd we're seeing a positive impact. It's not necessarily a trend, but I would say over the last quarter, we've seen about a 20% reduction in a number of customers who are overdrawing their account, which is, again, I think, a very positive thing. We've talked about historically how we've dealt with changes in fees. And I'd point to overdraft fees as an example.\n\nSince 2011, we've seen almost a 40% reduction in the collection of overdraft fees. And yet we overcame that and grew noninterest revenue over that same period of time of almost $500 million. So, we have a history of continuing to evolve and change our business to overcome losses in fee revenues. We're doing that through growth in capital markets, growth in treasury management, growth in wealth management, and in other parts of our business.\n\nAnd so, we feel good about the impact to customers and believe that we can manage the impact to our business.\n\nKen Usdin -- Jefferies -- Analyst\n\nGot it. OK. And second follow-up, you know, just in terms of wealth management really has bucked the market trend here, you know, continuing to increase in a really tough market. Can you just talk about is that new customer wins and business adds? And is that more than overcome the natural market challenges?\n\nJohn Turner -- President and Chief Executive Officer\n\nYeah, it's a combination of a number of things. One, we have a very strong retail investment services business that works very closely with our branch bankers. And in this environment, we see a lot of customers who are interested in acquiring annuities. So, we've seen nice growth in that source of fee revenue.\n\nOur institutional business is growing, and we've had some nice wins there. And then within wealth management, both opportunities to move new business, new customers. And we've additionally seen about 20% of our increase in fee revenue in the personal wealth management business as a result of customers moving money to us during this period of time where they're looking for more stability. Our approach to the business is as a fiduciary.\n\nAnd I think during uncertain and volatile times, customers are choosing to increase their level of business with us. So, all those things are contributing to growth in wealth fee income.\n\nKen Usdin -- Jefferies -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nOur next question comes from the line of Erika Najarian with UBS. Please proceed with your question.\n\nJohn Turner -- President and Chief Executive Officer\n\nGood morning, Erika.\n\nErika Najarian -- UBS -- Analyst\n\nGood morning. My first question is for David. David, you're implying an exit rate for NII of 1.375 billion in the midpoint of the range of your guide. And I'm wondering, you know, as we think about that as a jumping off point, you know, do you think that you can continue to grow that level of NII based on the forward curve in '23?\n\nDave Turner -- Chief Financial Officer\n\nYes. I mean I think we have -- as I mentioned earlier, we have some dry powder left. We still have $13 billion of cash. We don't have to access the wholesale market for several quarters based on our estimates.\n\nWe have still a little bit of hedging to do. We did some slight repositioning this past quarter to help continue to grow NII and our resulting margin and really taking advantage of what could be a much higher rate environment. I would tell you, our guidance is baked on a 75 basis-point increase in November, followed by 50 basis point and then 25 basis points. If I had to -- if we had to do it all over again, we probably have that a little bit higher.\n\nSo, I think we have some incremental opportunities to grow. And, you know, our loan growth has been nice. We have a very solid balance sheet. You know, we leverage our deposit franchise.\n\nAnd I think you can -- I think we're hitting a pretty good tailwind here, hopefully wrapping up the year strongly and really positioning '23 to be a pretty spectacular year as well. Again, we'll give you better guidance when we get to the earnings call in January.\n\nErika Najarian -- UBS -- Analyst\n\nGot it. And then as a follow-up, you know, as we think about deposit trends, clearly, the rate curve implies the terminal rate over 100 basis points greater than we last spoke in this type of earnings context. I'm wondering if you could give us a sense of, you know, how do you -- you've been very active with regards to managing some of the search deposits. How do you think about deposit growth from fourth quarter? Do you think most of the surge deposits and that impact would have been driven out of the bank? And additionally, with a 9% cumulative, you know, beta in the third quarter, how should we think about terminal beta within, you know, the new Fed fund, you know, rate -- growth rate that the forward curve is implying?\n\nDave Turner -- Chief Financial Officer\n\nYes. So, you know, we've been saying all along that we expected deposits to decline in the corporate space, in particular, the surge deposits of $5 billion to $10 billion. We're down about 4.5 since year-end -- since last year-end. And I think that we still expect that to happen.\n\nWe're holding on to more than we thought. And so perhaps that's a positive to us. You know, I think as you think about betas, so our beta last cycle was about 29%, right at 30%. We've been guiding that it's going to be higher.\n\nJust go around to the mid to upper 30s. You know, our Q into beta now is at 9. I think, linked quarter, we at 11. You know, this next quarter, you're going to see that move up a bit.\n\nWe expect about a 30% beta in the fourth quarter. It will take our cumulative to the mid-teens. And then in the first quarter, we're probably going to see even a higher beta than that, call it 50%, which will get our cumulative to about 25 at that time. So, I think you're going to just continue to see this hiccup a bit.\n\nBut we believe our beta as like last time will be lower than our peers, which is the value of our franchise, but call it, mid-30s to upper 30s.\n\nErika Najarian -- UBS -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Gerard Cassidy with RBC Capital Markets. Please proceed with your question.\n\nJohn Turner -- President and Chief Executive Officer\n\nGood morning, Gerard.\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nHi, guys. Can we follow up on the credit side of it again? I know your levels of credit delinquencies, and charge-offs are extremely low. But, John, when you were talking about some of the commercial stuff, can you share with us just how large the syndicated loan portfolios today, as well as the leverage portfolio? And are there any signs that syndicated portfolio is, you know, showing signs of more weakness in your just in footprint portfolio?\n\nJohn Turner -- President and Chief Executive Officer\n\nSure, Gerard. First of all, no would be the answer to the last question.\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nOK.\n\nJohn Turner -- President and Chief Executive Officer\n\nAnd the syndicated portfolio represents about 25% of our overall portfolio. Interestingly, we've had a 27% increase in investment-grade balances over the last 12 months. And so, the investment grade portion of our overall portfolio is about 40% today. Over the last three years or so, we've seen the probability of default come down by 19 basis points.\n\nAnd in other words, the quality of our book continues to improve, we believe. Our leverage book as defined as 3 by 4 is roughly $9.5 billion in total and. About 86% of that is in the shared national credit exposure. So, again, pretty high quality, we think, and we're not seeing any deterioration to speak of in that portfolio at all.\n\nDave Turner -- Chief Financial Officer\n\nGerard, this is David. We have a -- oftentimes, they don't get to the back of our deck. But on Page 25, we have a lot of what John was speaking to. And it really shows the -- quite a bit of improvement in terms of probability of default and the investment grade improvement.\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nGreat. Thank you. And then following up on deposits, obviously, as you pointed out, David, a few times on the call, the strength of the franchise is the deposits, which is true for, you know, most banks prior to quantitative easing, of course. But what's striking is your Slide 19 that those medium customer deposit balances just remain so healthy.\n\nHave you guys dug into it? Is it -- I think you may have referenced about maybe higher paychecks on the consumer side that's keeping balances up. But what are you guys sensing from why these balances just don't seem to be really falling off just yet?\n\nDave Turner -- Chief Financial Officer\n\nYeah, so, the consumer has been very resilient. In particular, this bucket that we have on that page, you know, they -- that group happened to -- that cohort happened to be the recipient of a lot of stimulus. They also were recipient of minimum wage increases. Our unemployment rate is below 4%.\n\nSo, these are people working, and they're being prudent where they're spending. And so, they just haven't -- they just have not spent more than they make. And I think it's attributable to what John just mentioned in terms of overdraft being down, too. I think people are being more cautious and careful in this period of time.\n\nAnd with inflation, you would expect this group to be hit more adversely, but they also disproportionately benefited. So, that's why you're seeing this -- you know, on the surface, it doesn't make sense to you, but that's what the data is telling us. And we've gotten pretty granular with this group, you know, account by account by account, which is where we got the information from.\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nAnd, David, this group you're referring to, is this -- would you say a FICO score group of high 600s to low 700s? Or is that about right?\n\nDave Turner -- Chief Financial Officer\n\nIt's not just lower income, lower FICOs. It has to do with how people manage their money. So, it's lower balances. So, this customer segment was under $1,000.\n\nThat could be people that have fine FICOs. They just spend about what they make. So, they don't have a lot in their account. So, it's not necessarily the lower FICO you're seeing.\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nOur next question comes from the line of Bill Carcache with Wolfe Research. Please proceed with your question.\n\nBill Carcache -- Wolfe Research -- Analyst\n\nThank you. Good morning, everyone.\n\nJohn Turner -- President and Chief Executive Officer\n\nHey, Bill.\n\nBill Carcache -- Wolfe Research -- Analyst\n\nFollowing up on your comments on Slide 19, does the data tell you that the Fed is going to have to do more? Or does your interpretation of this suggests rather that consumers and businesses are just in a better position to weather the downturn? Curious to hear sort of just your interpretation of Slide 19.\n\nDave Turner -- Chief Financial Officer\n\nThe Fed doing more in terms of raising rates and slowing inflation or stimulus or what -- from what context are you talking about?\n\nBill Carcache -- Wolfe Research -- Analyst\n\nYes, the Fed doing more in the sense that it's this high level of liquidity and capacity to spend that is, in and of itself, fueling inflation and perhaps, you know, that could lead the Fed to do more from that perspective.\n\nDave Turner -- Chief Financial Officer\n\nWell, we certainly think the Fed is getting after inflation. And as a result, we think their move is going to be pretty strong this next couple of moves at least. And -- but, you know, this customer segment is just -- they're just better -- some of our businesses, frankly, better prepared for whatever downturn or slowdown we might have. Our base case is not a recession, but we do think the probability of that has increased.\n\nAnd if the Fed moves at the pace we think, there's a strong likelihood that that can happen. But we think it will be fairly mild. But we do think that, you know, customer spend patterns are down. We saw that in our debit card transactions this quarter.\n\nQuarter over quarter, they were down. And so, we think people are already being prudent with that. The inflation that we're seeing is coming from labor in a very tight labor market. It's hard to get on top of that unless unemployment rate goes up some.\n\nSo, I think that's what will happen over time. And then, other inflations have been driven by commodities, which is really a supply imbalance right now versus demand. But with the Fed moving at the pace that they're moving is going to slow that down. It's going to bring demand back to supply.\n\nAnd I think you'll see us -- the expectation is you would see a slowdown from that standpoint.\n\nBill Carcache -- Wolfe Research -- Analyst\n\nThat's very helpful. And the expectation of a mild recession to the extent that we have one is consistent with your reasonable and supportable outlook on Slide 23. But just for sensitivity purposes, could you give a sense of what kind of impact taking the unemployment, say, to 5% -- the 5% level would have on the reserve rate, for example?\n\nDave Turner -- Chief Financial Officer\n\nYeah. I can give you some data points, but it's important to know that when you start picking on one particular item, there are a host of things that go into the calculation. So, what you're asking for is everything else being stable except for unemployment going to 5% or 6%. So, if you were to do -- and no other changes, no response from the bank, no anything, you would probably have a reserve that's 20% higher under a 6% unemployment.\n\nBut again, you start taking into account what employment means we're interest rates. And so, our NII is likely overwhelming whatever credit issues that we might bake in. So, it's a nice thing to think through, but there are just too many parts that kind of figure out what the net-net is. We think higher rates for Regions is still a net positive.\n\nBill Carcache -- Wolfe Research -- Analyst\n\nThat's very helpful. Thank you. And if I can, just for clarification, ask a final question on Slide 23. Sorry, just forgot what slide it was, but your overall commentary about protecting NIM in that the 3.6% range, I think it was Slide 20 --\n\nDave Turner -- Chief Financial Officer\n\nYeah.\n\nBill Carcache -- Wolfe Research -- Analyst\n\nIn 2023 and beyond. How far beyond '23 does the protection extend? And would that protection still hold in an extreme where rates, you know, fall to take it to an extreme where if ZIRP were to return, does the protection still -- is the protection still in place? Or is it only up to a certain level of Fed funds?\n\nDave Turner -- Chief Financial Officer\n\nWell, generally, when we put in hedges, they're about three years in duration. So, if you -- we're talking about the middle of '23 and '24 start, so, you're three years out from that. So, you're '26, '27 protection. And so, we will look to extend those.\n\nWe still have room to -- for more hedging. And it's dynamic. You know, we study this every single quarter. And we got a group that does it every day.\n\nAnd so, this is just a static position that we're showing you as of the date we produce it.\n\nBill Carcache -- Wolfe Research -- Analyst\n\nThat's very helpful. Thank you for taking my questions.\n\nOperator\n\nOur next question comes from the line of Stephen Scouten with Piper Sandler. Please proceed with your question.\n\nJohn Turner -- President and Chief Executive Officer\n\nGood morning.\n\nStephen Scouten -- Piper Sandler -- Analyst\n\nHey, good morning. I guess I wanted to ask, David, maybe to you first. What is it that makes you think these deposit betas will be higher this time around based on what you've seen so far? Is it really just a blending in of the surge deposits? Is it any sort of change in customer behavior? I just would think, with all your liquidity, they would actually be a little bit lower based on what we've seen so far.\n\nDave Turner -- Chief Financial Officer\n\nWell, I think, one, we're coming from a zero. And, you know, we did have a lot of surge deposits, $40 billion for the surge deposits. We think that that's going to -- you know, 1/3 of that's going to move out. We expected five to 10, hadn't happened yet.\n\nIf we've missed it, we've been probably a little bit more conservative. We much rather give you a mid-30s than a 29, where we ended the last cycle. But, you know, I think expectations would be for everybody, it should be a bit higher. You know, we're coming from a low and going to a higher rate environment that we saw last time as well.\n\nAnd so, we kind of peaked last time pretty quickly and then started to come back down in, I think, '19 it was. So, again, if we missed it, it's probably because we're a little conservative.\n\nStephen Scouten -- Piper Sandler -- Analyst\n\nOK. That's helpful. And then just you referenced the level of liquidity cash balances here a number of times that you still have. Securities have been down in the next couple -- for the last couple of quarters.\n\nObviously, we saw some of those service deposits out and you referenced no more borrowings. So, I'm just -- all those puts and takes there, I guess, how low could you see cash balances go? And do you think you'll have to continue to take securities lower to offset more of these potential outflows without borrowing?\n\nDave Turner -- Chief Financial Officer\n\nYeah, we generally would run with $1 billion to $2 billion of cash. We've got to have 13 to really take care of the surge deposits that we're going that we expect to run out. And we've been a little bit opportunistic with not deploying our cash and securities, but we didn't need to because we had good loan growth, and we had good hedging in protection. And so, our NII was growing nicely.\n\nThere was no reason for us to -- we could have generated more NII, but at the risk of, you know, missing an opportunity to invest that cash in a much better environment, which is what we're getting. So, I think being patient here is important. And we really want to use that cash to fund our loan growth. More importantly, that's our first order of business versus trying to put it in the securities book at this point.\n\nIf we see where we think rates may cap out, could we use our securities book for some incremental hedging? Yeah, we can do that. But think about it as -- we still have a lot of access to borrow from FHLB. You know, our total liability cost right now, 23 basis points is the lowest in the peer group, and we don't see where we need to access wholesale anytime soon.\n\nStephen Scouten -- Piper Sandler -- Analyst\n\nOK. That's great. Thanks for the time. Congrats on the NII right now.\n\nJohn Turner -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Matt O'Connor with Deutsche Bank. Please proceed with your question.\n\nMatt O'Connor -- Deutsche Bank -- Analyst\n\nActually, all of my questions have been answered. Thanks.\n\nDave Turner -- Chief Financial Officer\n\nAll right, Matt.\n\nOperator\n\nThank you. Our final question comes from the line of Michael Rose with Raymond James. Please proceed with your question.\n\nJohn Turner -- President and Chief Executive Officer\n\nHey, Michael.\n\nMichael Rose -- Raymond James -- Analyst\n\nHey, good morning. Thanks. Hi, good morning. Just two quick questions.\n\nYou know, just as it relates to Hurricane Ian, you know, I think around 12% of your deposits are within, you know, some of the counties that got kind of hit. Historically, you've seen some deposit inflows from aid and things like that. Is there any sort of expectation that you have for, you know, potential deposit inflows? And is it material?\n\nDave Turner -- Chief Financial Officer\n\nMichael, at this point, we don't -- there's still a lot of uncertainty this thing, Ian hit right here at the quarter end. We did our best estimate trying to figure out what the damage was going to be. But you're rightly to point out that oftentimes in these storms, there's a lot of money that comes into it, federal dollars, state dollars, and insurance money. But we haven't really contemplated any of that.\n\nAnd our deposit guidance does not reflect any additional deposits coming from those sources.\n\nMichael Rose -- Raymond James -- Analyst\n\nOK. Helpful. And then, maybe -- I'm sorry if I missed this, but -- so the range for capital markets was moved a little bit down. As we think about going into next year, we're -- obviously, the backdrop is softening to some degree.\n\nIs that kind of the new range that we should kind of expect in the kind of the near to intermediate term for that business?\n\nDave Turner -- Chief Financial Officer\n\nI wouldn't sign off on that just yet for next year. We'll give you better range when we get to the January earnings. That was really just more for this next quarter because of what we're seeing right now in particular with M&A and real estate capital markets. So, don't lock that in for 2023.\n\nMichael Rose -- Raymond James -- Analyst\n\nOK. I understand you're not going to give any sort of guidance, and I totally get it. What would be kind of the broader puts and takes in your eyes to, you know, be within the kind of the prior range or above it or below it, etc.?\n\nDave Turner -- Chief Financial Officer\n\nI think, if we can get M&A back on track to where it was, if we can get real estate capital markets to open up a bit, you just get more activity. The whole capital markets are kind of down right this minute. We're going to continue to add some bolt-on acquisitions or at least looking for opportunities. We had a couple that we added this past year.\n\nAnd so, we're going to do some things to see if we can't help augment the pressure that we're feeling from the lack of having, again, M&A and real estate capital markets.\n\nJohn Turner -- President and Chief Executive Officer\n\nSo, just to be clear, we're not contemplating acquisitions in the quarter.\n\nDave Turner -- Chief Financial Officer\n\nYeah, no, no.\n\nJohn Turner -- President and Chief Executive Officer\n\nTo his question.\n\nMichael Rose -- Raymond James -- Analyst\n\nUnderstood. I appreciate the details. Thank you, guys.\n\nDave Turner -- Chief Financial Officer\n\nOK. Thank you.\n\nJohn Turner -- President and Chief Executive Officer\n\nOK. Well, that was the last question. Thank you all for your interest in our company. Appreciate you participating today.\n\nHave a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDana Nolan -- Executive Vice President, Head of Investor Relations\n\nJohn Turner -- President and Chief Executive Officer\n\nDave Turner -- Chief Financial Officer\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nJohn Pancari -- Evercore ISI -- Analyst\n\nKen Usdin -- Jefferies -- Analyst\n\nErika Najarian -- UBS -- Analyst\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nBill Carcache -- Wolfe Research -- Analyst\n\nStephen Scouten -- Piper Sandler -- Analyst\n\nMatt O'Connor -- Deutsche Bank -- Analyst\n\nMichael Rose -- Raymond James -- Analyst\n\nMore RF analysis\n\nAll earnings call transcripts"
}