{
  "companyName": "Red Robin Gourmet Burgers",
  "companyTicker": "RRGB",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/red-robin-gourmet-burgers-rrgb-q2-2022-earnings-ca/",
  "content": "Red Robin Gourmet Burgers (RRGB -0.36%)\nQ2 2022 Earnings Call\nAug 10, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, everyone, and welcome to the Red Robin Gourmet Burgers, Inc. second quarter 2022 earnings call. Please note that today's call is being recorded. During today's conference call, management will be making forward-looking statements about the company's business outlook and expectations.\n\nThese forward-looking statements and all other statements that are not historical facts may reflect management's beliefs and predictions as of today, and therefore, are subject to risks and uncertainties as described in the safe harbor discussion found in the company's SEC filings. During today's conference call, management will also discuss non-GAAP financial measures. These non-GAAP measures are not prepared in accordance with generally accepted accounting principles but are intended to illustrate an alternative measure of the company's operating performance that may be useful. A reconciliation of non-GAAP financial measures to the most directly comparable GAAP measures can be found in the earnings release.\n\nThe company has posted its fiscal second quarter 2022 earnings release on its website at ir.redrobin.com. I would like to turn the call over to Red Robin's CEO, Mr. Paul Murphy. Thank you, sir.\n\nPlease go ahead.\n\nPaul Murphy -- Chief Executive Officer\n\nHello. Thank you for joining us. With me here today is Lynn Schweinfurth, our chief financial officer. After I provide some general commentary on the business and an update on our initiatives, Lynn will review our fiscal second quarter results in detail, along with some revisions to our financial outlook.\n\nAs the headlines have become increasingly negative, as it relates to consumer confidence, general inflation and the likelihood of a recession, casual dine-in traffic has been trending downward. Still, when we evaluate our sales and traffic trends relative to our peers in the same markets, we are outperforming the casual dine-in segment. We attribute this outperformance to our high-low strategic approach to value, including higher priced, innovative, limited time offers and more compelling promotions, including our $10 Gourmet Meal Deal, which we launched in late June. These promotions are complemented by everyday value that include affordable prices, generous portions and signature Bottomless sides and drinks.\n\nOur guest satisfaction scores for both dine-in and off-premises are improving, which we attribute to our back to basics operational execution, improved staffing and declining turnover, which are enabling us to better serve our guests. Our digital platforms are also helping to support our business in ways that were simply not possible even just a year or two ago. We have increased our marketing versus 2021. However, we still remain below 2019 levels.\n\nOur marketing is mainly digital, and therefore, more targeted and cost effective. And it's driving record levels of engagement through guest segmentation, automated offers and push notifications. We are also supporting the current limited time offer and value message, while conveying that Red Robin is all about making moments of connection for friends and family across a diverse and multi-generational demographic. While commodities in general have plateaued, they have done so at a higher level than we had anticipated.\n\nThe biggest unknowns with commodities are the weather conditions for the remainder of the grain growing season and whether demand will fall as a result of the macroeconomic backdrop. Lynn will expound about both of these topics in her remarks. Now let's briefly discuss recent and current sales trends. Comparable restaurant revenue for the second fiscal quarter rose 4.1% compared to 2019 and rose 6.7% compared to 2021.\n\nFor our eight period ending August 7, which is the first period in our third fiscal quarter, preliminary comparable restaurant revenue rose 3.1% compared to 2019 and rose 4% compared to 2021. In our efforts to be the employer of choice within our industry, we have prioritized hiring and retaining team members. Because we know that when appropriately staffed, we provide our guests with the quality experience that they deserve. This in-turn leads to greater guest satisfaction and team member engagement, higher throughput, higher frequency and ultimately higher sales.\n\nThe progress we have made in driving greater app inflow, hiring and retention continued into Q2. However, there is still more work to be done. When comparing our progress on overall staffing levels to our hourly team members, we have improved from 82% of our target at the end of Q1 to over 91% at the end of Q2, with the continued goal of getting to 95%. And similar to last quarter, we were essentially fully staffed at our GM position, which can only lead to further restaurant staffing improvement because these two things are highly correlated.\n\nThis is being driven by significantly improved turnover for the trailing three periods. In the big picture, we have a focused action plan to address a few key areas. Starting with connection conversations between restaurant leaders and team members to not only help refine and improve our team member experience, and run great shifts, but also provide quality training with a focus on back to the basics execution. We are also offering more competitive wages at the local level and far greater scheduling flexibility, including the implementation of the HotSchedules platform, which is in process.\n\nWe believe the combination of these items will lead to higher job satisfaction, while optimizing the guest experience, as we seek an ongoing two way conversation to understand, refine and further improve. In terms of our value and promotional focus, we have broadened the breadth and depth of our messaging to Red Robin Royalty members, and made our efforts more compelling, driving record engagement levels and higher frequency of visits. The components of our high-low value strategy include keeping the menu fresh and exciting for guests through our successful premium limited time offers. These higher priced LTOs drive PPA, incremental margin and attachment.\n\nDuring the second quarter, we featured the Whiskey River Backyard barbecue menu lineup, which included our Smokehouse Brisket Burger, Pineapple Upside-Down Cake Milkshake and Tequila Sunset Cocktail. This is our third consecutive LTO promotion to hit record sales levels. Our newest LTO launched in mid-July brings steakhouse flavors to our restaurants with the steakhouse summer menu, and continues our recent success of developing unique, innovative items that have guests saying Yum! Items include a new Savory Steakhouse Burger, Loaded Baked Potato Fries, two alcoholic beverage choices and a Pumpkin Spice Milkshake. In addition to these premium LTOs, we are also promoting other compelling value offers that are strengthening their value perception and driving outperformance versus our peers in terms of sales and traffic as measured by Black Box Intelligence and net value sentiment on social media channels.\n\nIn late June, we introduced a limited time $10 Gourmet Meal Deal, which includes a gourmet burger, Bottomless steak fries, and a Bottomless beverage from a select menu. This deal is attracting guests to our brand to enjoy dining out with their families and friends again. We are also testing other value programs around specific day parts, such as Happy Hour that will roll out to the majority of our system in a few weeks. We will also be testing lunch specials in the coming weeks.\n\nCatering as well ahead of our plans and above 2019 levels, as businesses are resuming larger occasions, and we are ready to meet their needs. We continue to lean in on the sales channel, which we believe can continue to grow in a meaningful way in the years ahead. Turning to our foundation, we are continuing to hone multiple growth platforms designed to drive consistent and profitable dine-in and off premises growth. Let's first talk about Donatos pizza, a product that continues to exceed our expectations.\n\nWe are particularly encouraged by the incremental Donatos sales generated in the second quarter, as we increased marketing support with declining supply chain issues. There were approximately 200 restaurants serving Donatos at the beginning of the year, and there will be approximately 50 restaurants added in 2022. The remaining 150 restaurants will be implemented over the course of 2023, when we complete our rollout schedule. Sales for Donatos pizza were approximately $6.2 million during the quarter itself, with a sales mix of approximately 60% dine-in, and 40% off-premises.\n\nRestaurants serving Donatos outperformed restaurants without Donatos by 8.4 percentage points in terms of comparable restaurant revenues versus 2019 in the second quarter. This is well ahead of the same measurement we shared for the first quarter, which was 5% plus or a sequential increase of more than 3 percentage points. Additionally, guest checks that include Donatos pizza are on average more than $10 higher than those that do not include pizza. By the end of 2024, we expect Donatos to generate annual company pizza sales of at least $60 million and profitability of at least $25 million.\n\nOur integrated and seamless digital ecosystem, which includes a new website experience, mobile app, and an enhanced loyalty program, represents a key strategy for our brand, and is driving frequency, traffic, and check. We are currently standing at more than 650,000 app downloads, up from over 400,000 as of the end of our first quarter, bolstered by added marketing support in Q2. Notably, both our website and app are generating increased conversion as well. Off-premises digital channels have become the vast majority of our off-premises business, representing 83% of total off-premises sales in the second quarter.\n\nThe integration of our Red Robin Royalty platform into our app and online ordering experience has also improved our communication with guests. And we are leveraging technology to drive frequency. Royalty membership continues to grow. It is now at 10.7 million as of the end of the quarter.\n\nWe are seeing record levels of loyalty engagement driven by improved segmentation and target marketing. This has features in the automated and personalized messaging based upon purchase history. We are also conducting smarter campaigns and beginning to drive elevated engagement via push notifications. We are making ongoing improvements to these digital assets and recently introduced automated and push notifications along with Apple and Google Pay options.\n\nWe are also continuing to enhance the ordering experience, reducing clicks and offering a more intuitive royalty integration. Additionally, we will be piloting an online waitlist in late 2022. Next, let's discuss new restaurant development. A Red Robin franchisee recently opened a new restaurant in West Wichita, Kansas, and we will open a new company restaurant no later than early next year.\n\nWe are expecting to pursue modest new restaurant growth with an infill strategy in established markets going forward, based on an ongoing track record of successful restaurant openings. The new restaurant we opened late last year in Seattle is currently on track to deliver 2022 sales between $4 million and $5 million. This demonstrates the initial success associated with our new prototype. This year, we are also continuing to implement floor plan modifications to improve off-premises execution in our highest volume restaurants, and pilot a restaurant refresh program to update our restaurants in the years to come.\n\nFinally, as this is my last conference call as CEO of Red Robin, I want to say how much I've enjoyed getting to know our analysts and investors over the past few years. When I joined the company back in October 2019, it was my intention to serve for three years to quickly improve operating execution and overall performance, and then pass the baton to the next leader. Of course, I certainly could not have predicted that we were just about to enter one of the most tumultuous eras in the history of this industry and of course, our own lifetimes. Still, I am proud of the work that we have done in navigating through the pandemic, growing off-premises sales, implementing an enhanced service model, securing a new five-year credit agreement and positioning the brand for the future with focused initiatives around people, the guest experience, food quality and innovation, a digital ecosystem, and the rollout of Donatos.\n\nWe recently held our Restaurant General Manager Conference and I walked away with energy and optimism. The team is engaged, passionate, and focused on our operational priorities. I have no doubt that G.J. Hart will be a fantastic Chief Executive Officer, and I will ensure a seamless changeover in leadership by staying on an advisory role through the first quarter of next year.\n\nLet me now turn the call over to Lynn to review our Q2 results.\n\nLynn Schweinfurth -- Chief Financial Officer\n\nThank you, Paul. As Paul outlined, our industry is facing headwinds in a volatile macroeconomic environment. However, given our financial results associated with our strategic initiatives, we believe we are well-positioned to create long-term value for our shareholders. Turning to second quarter results.\n\nWe grew comparable restaurant revenues by 6.7% compared to 2021 in the second quarter, surpassing the casual dine-in segment in both sales and traffic as measured by Black Box Intelligence. Compared to 2019, our second quarter comparable restaurant revenues increased 4.1%, marking the second consecutive full quarter of positive comparable restaurant revenues versus pre-pandemic sales. Versus 2021, we experienced a softening of sales in the last two fiscal periods of our second quarter that ended in mid-July. However, as Paul shared, we have seen our sales increase in our eight fiscal period that ended August 7th or the first period of our third quarter to approximately 4%.\n\nWe attribute this improvement to our high-low value strategy that is building traction and outperforming the casual dine-in segment. We delivered our ninth consecutive quarter of off-premises sales dollars at more than double pre-pandemic levels, demonstrating the sustainability of our higher off-premises sales channel since 2019. As a percentage of total off-premises sales, third-party delivery represented 54.3%, to-go represented 35.3%, catering represented 6.3% and Red Robin delivery represented 4.1%. Full year net cash provided by operating activities was $36.4 million, while cash used in investing activities was $15.6 million and cash provided by financing activities was $15.5 million.\n\nDuring the second quarter, we received federal cash tax refunds of approximately $12.7 million, which included $0.5 million of interest. We ended the quarter with liquidity of approximately $75.3 million including cash and cash equivalents and available borrowing capacity under our revolving line of credit. Our ongoing focus includes effectively managing our bottom-line, dedicating free cash flow over the next several quarters to reinvest in our restaurants and infrastructure, while maintaining flexibility to pursue strategic initiatives that will generate profitable sales growth going forward, including adding Donatos to the balance of our system, ongoing investments in restaurant technology and our digital ecosystem, and new restaurant development. Now turning to some of the specifics related to the second fiscal quarter.\n\nQ2 2022 comparable restaurant revenues increased 6.7%, driven by a 9.6% increase in average guest check and a 2.9% decrease in guest traffic. The increase in average guest check represented a 6% increase in pricing, 3.7% increase in menu mix, and a 0.1% decrease from higher discounts. Second quarter total company revenue increased 6.2% to $294.1 million, up $17.1 million from a year ago, driven by increased pricing and favorable menu mix shifts, partially offset by declining category traffic. Restaurant level operating profit as a percentage of restaurant revenue was 13.6%, a decrease of 2.1 percentage points compared to 2021, primarily due to the following: Restaurant revenue increased by $16.5 million, primarily driven by increased pricing and favorable menu mix shift, partially offset by declining category traffic.\n\nCost of goods sold increased by 240 basis points, primarily driven by commodity inflation, partially offset by pricing and rebates. Commodity inflation was approximately 19% in Q2. Labor costs decreased by 120 basis points, primarily driven by sales leverage and lower group insurance and management incentive compensation costs, partially offset by wage rate inflation. Wage rate inflation was approximately 7.5% in Q2.\n\nOther operating expenses increased by 80 basis points, primarily driven by increases in maintenance costs, utilities and third-party commissions, partially offset by lower hiring costs and sales leverage. And occupancy costs increased by 10 basis points, primarily driven by higher insurance costs partially offset by sales leverage. General and administrative costs were $18.7 million, an increase versus the prior year of $1 million, primarily driven by increased stock-based compensation expense, merit increases, and higher manager-in-training costs partially offset by lower incentive compensation costs. Selling expenses were $13.4 million, an increase versus the prior year of $2.7 million, driven by increased marketing spend with improved staffing and ability to consistently execute.\n\nDuring the quarter, we recognized other charges of $8.1 million, including $8.7 million related to the impairment of long-lived assets primarily related to six restaurant locations, $0.9 million related to restaurant closures, $0.1 million related to executive transition, and $0.1 million for COVID-19 related costs, partially offset by a net reduction of $1.8 million related to litigation contingencies. Second quarter adjusted EBITDA was $11.9 million, as compared to adjusted EBITDA $19 million in Q2 2021. Q2 adjusted loss per diluted share was $0.75, as compared to adjusted loss per diluted share of $0.22 in Q2 2021. At quarter end, our outstanding principal balance under our credit agreement was $199.5 million, and letters of credit outstanding were $8.4 million.\n\nEffective pricing was 6% for the quarter, as we continue to strategically increase prices to mitigate inflation, while retaining a strong value proposition. In addition, we took incremental price of more than 2% in early Q3. As a result of cumulative price increases along with normalization of costs, we expect margins to improve in future quarters to get back to 2019 levels, and we intend to make significant progress in 2023. The company continues to face commodity inflation pressures, but we did experience an easing in supply chain disruptions in the second quarter, though they have not been eliminated.\n\nWe continue to diversify our suppliers to manage these disruptions and lessen their impact on our operations. We are also proactively managing lead times related to other equipment purchases, including our implementation of Donatos. In addition, a new distribution contract kicks in at the beginning of the fourth quarter this year, which is factored into our commodity inflation expectations. As a result, we are expecting cost of sales as a percent of restaurant sales to increase sequentially in the fourth quarter from the third quarter.\n\nDue to the volatile macroeconomic environment, softening industry sales trends and higher commodity costs, we have updated our guidance for 2022 as provided in our earnings release that we published today. A sincere thank you to our entire Red Robin team, we have made meaningful progress in staffing our restaurants, which will drive improved financial and operating performance. Restaurant traffic continues to outperform the casual dine-in segment. We are also executing strategic growth initiatives that will provide platforms for incremental profitability in the years to come, including Donatos, digital, menu quality and innovation, a differentiated team member value proposition and new restaurant development.\n\nLastly, on behalf of Red Robin, I'd like to thank Paul for his considerable contributions to the brand over the last few years. Under his leadership and guidance, we are not only able to get through the pandemic, but Red Robin is well-positioned to thrive in the years to come. Paul, it has been a great pleasure working with and learning from you. With that, I will turn the call over to Paul.\n\nPaul Murphy -- Chief Executive Officer\n\nThank you, Lynn, for your kind words. I too have enjoyed working with you. Even as I transition to an advisory role on my path to retirement, my confidence in Red Robin's bright future does not waiver. This is because connecting family, friends and fun through memorable moments over great food, which is our brand promise, is enduring.\n\nAnd this company has strategic initiatives to drive market share, frequency, while adapting to any changes in consumer behavior. We believe we are better positioned to weather an economic downturn than many competitors, due to our value-based propositions, including Bottomless and relatively low average check of approximately $16. This has been in the credible team to work alongside in pursuit of top line growth, profitability, and long-term shareholder value. Their passion for Red Robin and commitment to quality results are something that I'll miss on a daily basis.\n\nSo let me thank them one last time for all they have done and do on our behalf. And with that, let us now open the call for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question today is coming from Alex Slagle of Jefferies. Please go ahead.\n\nAlex Slagle -- Jefferies -- Analyst\n\nThanks. Hey, Paul, congrats on the upcoming retirement. I know you'll be around for a little bit, so happy about that.\n\nPaul Murphy -- Chief Executive Officer\n\nYeah. Thanks, Alex. I will be and I think it's going to be a very effective transition with G.J. and look forward to working with him the next couple months and getting us on a strong path forward.\n\nSo -- but I'm sure I'll see you around somewhere.\n\nAlex Slagle -- Jefferies -- Analyst\n\nFor sure. For sure. Hope you get some time off. But I guess with the transition and you hand over the reins to G.J., I mean, what's at the very top of your to-do list that you want to accomplish both just to ensure a smooth transition into '23, but also to finish up or see through specific initiatives that are especially important to you?\n\nPaul Murphy -- Chief Executive Officer\n\nAlex, I think it's a couple of things. He's been on -- certainly G.J. is familiar with the company, he's been on the board the last three years. Obviously, very successful in -- at Texas Roadhouse and at CPK and at Torchy's.\n\nWe've already been spending time together talking about the business, the impact that Donatos has been having on it, where we sit from a staffing perspective, taking a look at how are we going to manage the capital spend as we get into 2023 versus we do have a lot of levers that can move the business forward, whether it's Donatos, whether it's the digital guest journey in the whole digital ecosystem. So I think it's really the two of us working together on where are his views on the strategic thinking? How does that influence the budget for 2023? And then on our end, are continuing to work hard on 2022. As I look at the second quarter and it was a bit disappointing I won't lie about that, we saw the same softening through the quarter that a lot of other brands did. I think the couple of things that we have done in reaction to that is, commodity certainly plateaued at a higher rate than we had forecasted.\n\nSo we originally were going to do a pricing move in Q4, we accelerated that and moved it up into very early Q3, but obviously it could not influence the second quarter. We also quickly recognized in P-6 that things were softening in the third week of P-7, we put out the $10 Gourmet Meal Deal to certainly influence the business. And it has worked well for us. Our value perceptions, our value sentiment have really grown over that time.\n\nI think it had a nice influence on P-8 getting out of the gate into Q3 and is continuing into P-9. And we're going to roll out Happy Hour here in a couple of weeks across system to further influence that. So when I look at Q2, the miss was a bit of a softening on the top-line but more importantly at the commodity level. And we've done the things that we need to do to influence really the operating margins as we get into Q3 and more specifically into Q4.\n\nSo, certainly not backing off 2022 at all. I think we have done the things that address the misses that we had in Q2. But in the meantime, obviously, G.J. starts September 6, we'll work side by side to not only be addressing that, but set him up for success as we go into 2023.\n\nAlex Slagle -- Jefferies -- Analyst\n\nOK. That's helpful. Could you break down the monthly same-store sales? And if you have it, how the relative gap versus the peer benchmark track through the quarter?\n\nLynn Schweinfurth -- Chief Financial Officer\n\nYeah. Alex, in P-5, in comparison to 2021, we generated 11.6% in P-5, 7% in P-6, 1.7% in P-7; and then in P-8, as Paul mentioned, we came in at about 4%. And then in terms of the gap to the competition, it ranged between 3% and 5% during the second quarter. And then from a traffic perspective, we actually had a positive gap to Black Box for the quarter of 1.6%.\n\nAlex Slagle -- Jefferies -- Analyst\n\nOK. And did the gap hold generally through the quarter? Or did you feel more pressure toward the end or any takeaways there?\n\nLynn Schweinfurth -- Chief Financial Officer\n\nIt went down a little bit, but it held pretty steady for the quarter.\n\nAlex Slagle -- Jefferies -- Analyst\n\nOK. Do you happen to have those comps by month versus '19?\n\nLynn Schweinfurth -- Chief Financial Officer\n\nI do. I do. So for P-5 we were up 7.3%, which I believe we shared on the last conference call. And then in P-6 we were up 1% and in P-7, 3.9%.\n\nNow between P-6 and P-7, there was some calendar shifts around, I believe Father's Day that negatively impacted P-6 and positively impacted P-7. So there was a little bit of noise there. And then we came in at about 3% in P-8.\n\nAlex Slagle -- Jefferies -- Analyst\n\nGot it. OK. And on the reduction of the guidance -- the EBITDA guidance, is it -- I guess how much of that is commodities and if there are other pieces? I mean, is it incremental labor pressures or some sales caution baked in there?\n\nLynn Schweinfurth -- Chief Financial Officer\n\nYeah. It's primarily commodities and sales caution and the related flow-through associated with that sales caution.\n\nPaul Murphy -- Chief Executive Officer\n\nYeah. Alex, we've taken a conservative approach to taking a look at basically using the run rates and that we've seen and trying to take in account that there's still volatility in the macro environment and not trying to get too far over our skis. But I think as Lynn said, we're pleased to see the rebound that we've been seeing in P-8 from a sales perspective. And the ability to go ahead and take some price and move that up much earlier into Q3 should be a help to us.\n\nAlex Slagle -- Jefferies -- Analyst\n\nMakes sense. I'll pass it along. Thanks.\n\nOperator\n\nThank you. The next question is coming from Todd Brooks of The Benchmark Company. Please go ahead.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nHey, thanks. And Paul, best of luck in your future travels here. Hope you enjoy it, and it's as fulfilling as these last three years. I'm sure it were for you so.\n\nPaul Murphy -- Chief Executive Officer\n\nWell, thank you, Todd. Appreciate it.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nFew quick questions, just kind of jumping on what Alex was just exploring. If we look at the commodity thinking for the balance of the year, and Lynn, you made a comment at the end of your prepared remarks talking about a distributor shift that kicks-in in Q4, and that you're expecting COGS to be up sequentially. Can you kind of give us a map of how you see COGS tracking kind of Q3 and Q4 so that we can size what that -- whatever the uptick would be to the distributor but if you're expecting any improvement in kind of Q3 from Q2 levels?\n\nLynn Schweinfurth -- Chief Financial Officer\n\nYes. I would say in terms of Q3, we do expect improvement and certainly part of that improvement is the 2 percentage points in price we took at the beginning of the third quarter. And then it will tick-up in the fourth quarter to result in mid double-digit inflation for the full year.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nOK. OK. Great. That's helpful.\n\nAnd then you talked about the basket. I think, you said it was up what? Was 19% in the quarter? Do I have that number, right? The commodity basket.\n\nLynn Schweinfurth -- Chief Financial Officer\n\nThat's correct. 19% for the second quarter. That was up a little bit from the first quarter, and then will sequentially decline in the third quarter, then again decline in the fourth quarter as we start to lap over some of the inflation we experienced last year.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nOK. OK. That's helpful. Thanks.\n\nAnd then, Paul, can you talk to kind of the slowdown that you saw in kind of heading out of P-6 into P-7, was it purely traffic driven customers that were still showing up to the restaurant? Were they still building checks in the same way and behaving the same way? Where did you see and how was the slowdown manifesting itself?\n\nPaul Murphy -- Chief Executive Officer\n\nIt was mainly traffic-driven, and Todd, that's why we switched bar a little bit from the QSR playbook. Our LTOs were still performing well, which has been a driver of check, but we thought that as we saw traffic slowing, we needed to. Frankly, address the value part because we thought that consumers were feeling pinched from the inflation. And that's why at the back end of P-7 we rolled out the $10 Gourmet Meal Deal, which so far has performed well for us.\n\nAnd we think it's a strong high-low strategy that showcases the value of Red Robin. And we're certainly seeing it in the numbers in terms of the value perceptions of the Red Robin brand have definitely moved forward versus the industry. And quite honestly, we're outpacing the industry right now. And as I mentioned, it was a little late in Q2, it only was -- it was two weeks left in the quarter.\n\nIt was really a reaction to kind of mid to mid P-6 into P-7, what we saw as a real softening of sales.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nOK. Great. And then the $10 offer, how's it mixing relative to your expectations?\n\nPaul Murphy -- Chief Executive Officer\n\nIt's actually a little bit higher than expectations, but it's also an offer that still has a strong, gross margin on it. We're not giving away the farm, so we're pleased with what it's doing to that, but also its ability to be a fairly strong gross margin player for us even at a $10 offer.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nOK. Great. And then the two potential additional value promotions behind it. It sounds like Happy Hours teed up to come.\n\nAnd then you mentioned something potentially at lunch as well.\n\nPaul Murphy -- Chief Executive Officer\n\nHappy Hour will be rolled out this month. And then lunch specials, you'll see a little further into the fall.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nOK. And then the same type of margin neutrality type of -- if you're migrating people to more of these value-based platforms, you're still fine with it from a Bottomless standpoint?\n\nPaul Murphy -- Chief Executive Officer\n\nI mean, one way to think about it. I mean we don't have certainly the strongest liquor mix out there in the casual dining space. So, even at a Happy Hour increasing the liquor sales should help us overall from a margin standpoint. So we're looking forward to that because we think it can continue to strengthen not only the value perception of the brand, but can strengthen the margin profile of the brand.\n\nLynn Schweinfurth -- Chief Financial Officer\n\nYeah. And Todd, I would just add, we also have the high end of the high-low strategy where we're giving guests every excuse to order our premium priced products so we can balance the promotions that we're doing.\n\nPaul Murphy -- Chief Executive Officer\n\nWe do see when people come in and order the $10 Gourmet Meal Deal, that a lot of them they do their own add on. It really is about, as Lynn mentioned, given the consumer choice of how they want to spend their money.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nOK. Great. And then just a final, quick one, I know targeting 50 Donatos rolled out this year. Where are we in that process? And is it kind of equally weighted across the year? Or is there back half loaded element to this year's rollouts?\n\nLynn Schweinfurth -- Chief Financial Officer\n\nYeah, it's roughly half and half, Q2 and Q3, and we should be primarily or essentially completed by the end of Q3.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nThat's great. Thanks, Lynn, and good luck, Paul.\n\nPaul Murphy -- Chief Executive Officer\n\nThank you, Todd.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPaul Murphy -- Chief Executive Officer\n\nLynn Schweinfurth -- Chief Financial Officer\n\nAlex Slagle -- Jefferies -- Analyst\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nMore RRGB analysis\n\nAll earnings call transcripts"
}