{
  "companyName": "Sportradar Group AG",
  "companyTicker": "SRAD",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/17/sportradar-group-ag-srad-q2-2022-earnings-call-tra/",
  "content": "Sportradar Group AG (SRAD 4.84%)\nQ2 2022 Earnings Call\nAug 17, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Sportradar second quarter 2022 earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Christin Armacost, Manager, investor relations.\n\nPlease go ahead.\n\nChristin Armacost -- Investor Relations Manager\n\nThank you. Good morning, everyone, and thank you for joining us for Sportradar's earnings call for the second quarter of 2022. Before we begin, I would like to point out that the slides we will reference during this presentation can be accessed via the webcast on our website at investors.sportradar.com. These slides will be posted on our website at the conclusion of this call.\n\nA replay of today's call will be available via phone and on our website. After our prepared remarks, we will open the call to questions from investors. To be fair to everyone, please limit yourself to one question plus one follow up. Please note that some of the information you'll hear during our discussion today will consist of forward-looking statements, including, without limitation, those regarding revenue and future business outlook.\n\nThese statements involve risks and uncertainties that may cause actual results or trends to differ materially from our forecast. For more information, please refer to the risk factors discussed in our annual report on Form 20-F and the Form 6-K furnished with the SEC today along with the associated earnings release. We assume no obligation to update any forward-looking statements or information, which speak as of their respective date. Also during today's call, we will present both IFRS and non-IFRS financial measures.\n\nAdditional disclosures regarding these non-IFRS measures, including reconciliation of IFRS to non-IFRS measures, are included in the earnings release, supplemental slides and our filings with the SEC. Each of which is posted to our investor relations website. Joining me today are Carsten Koerl, chief executive officer; and Alex Gersh, chief financial officer. And now I would like to turn the discussion over to Carsten Koerl.\n\nCarsten Koerl -- Chief Executive Officer\n\nThank you, Christine, and thank you to all of you for joining us today. We are pleased with our strong results in the second quarter, highlighted by a 23% revenue growth, which we believe showcases the power of our business model. The Sportradar team has delivered excellent results through the first half of the year even in the face of a global adversity. We remain confident about our vision, the quality of our execution and our multiyear growth strategy.\n\nOn basis of our strong results year to date and the visibility of our business, we are increasing our revenue guidance for the year-to-year range from 24% to 27% growth. That comes from 18% to 25% previously. As you know, we are the leading global sports technology company focused on the sports betting ecosystem globally, enabling immersive experience for sports fans. The combination of our unique experience platform, network and technology, along with the worldwide sport rights we have acquired over the past 20 years history, we have combined and built a business that we believe will deliver long-term shareholder value through: First, consistent strong revenue growth; next, growing profitability with business leverage and margin expansion over time; third, exceptional operational execution by a senior management team with a proven track record to deliver outstanding results; and last but not least, strong free cash flow and disciplined capital allocation.\n\nThe highlights for the quarter 2. Speaking of capital, in July, we paid down 200 million euros of our 435 million euro debts outstanding. Post the repayment, our cash position remains solid, with over 500 million and over 600 million euros in available liquidity. We believe that our business model can achieve the 55% to 60% free cash flow conversion targets over the long term.\n\nRevenue in the second quarter increased by 23% compared with the second quarter 2021, driven by the strong growth in the U.S., our managed betting services, and our global ads business. As you will recall, our revenue is a combination of subscription-based and revenue share products. Subscription revenue accounts for around about 70% of our total, and it is a stable source for growth for us. The rest, our revenue sharing solutions, include some of the fastest-growing opportunities, such as the betting footprint in the U.S., our MBS segment and the advertising solution.\n\nOur success can be seen in the net retention rate or NRR, which is one of our most important client metrics. NRR for the second quarter was 115% and has been above 100% for the past two years. Total customer attrition in 2021 was less than 1%. The rest of the world business, accounting to over 80% of revenue, continues to grow double-digit for us.\n\nLast quarter, we highlighted our managed betting services, that includes managed trading services and the managed sport book services. Our MBS revenue increased 65% year over year. We estimate we handle over 8 billion euros in transactions in the first half of the year alone and remain on track to handle between 17 billion to 20 billion of transactions in 2022. This would make us one of the top five bookmakers in the world, including DraftKings and FanDuel as a comparison.\n\nI'd also like to highlight our ads business, growing nearly 40% year over year. We continue to demonstrate our largest betting operators that we can offer more efficient customer acquisition, retention and lower cost per customer, which is the CPA, then competing solutions by over 50%. We also announced a joint venture with Ringier in this quarter, one of the biggest media houses in Europe, to bring immersive experience for sports fans in Africa. Leveraging Ringier's media platform, Pulse, we now have the ability to reach millions of African sport fans with an integrated 360-degree solutions from a risk management, interactive sports service and marketing tools to connect with over 30 million existing African medium profiles.\n\nThis will mark a milestone and create a blueprint for future activities and partnerships with other large media operators in interesting betting jurisdictions around the globe. Now to the U.S. business, that grew 66% in quarter 2. As you will recall, we have been investing in the U.S.\n\nsince 2014, which we believe provides us a clear first-mover advantage in the States, building on our demonstrated success in other parts of the world. We have built an ecosystem of leagues, betting operators and media customers second to none. Sportradar data and proprietary platform products support 70% of the in-play net gaming revenue in the U.S. Sportsbooks have over 275 digital media and broadcasting customers and cover over 90 sports every day in the year.\n\nTotally, the U.S. business accounts for approximately 15% of our revenue. And while the EBITDA margin is negative, it continues to improve each quarter. The U.S.\n\nbusiness has delivered a 57% revenue CAGR between 2019 and 2021, driven by growth of online sports betting, acquiring key data rights from professional leagues and the proliferation of sports data used in the media. We see core industry growth across 3 key components: first, increase in the legislation of sports betting across the country; second, our ability to successfully negotiate long-term profitable deals and deliver more value from the customer relationship over time; and third, upselling services and products, which enable our customers to create more value and gain efficiency. Live betting services are key components for this strategy. Importantly, we have also invested in deepening our relationship with the leagues through prudent sport rights acquisition paired with actionable plans, which should drive future profitability over the life of the contract Our adjusted EBITDA loss margin profile has narrowed substantially, pointing us to a clear path to profitability in this region.\n\nAs proof, in 2019, we had more than 100% negative adjusted EBITDA margin in the United States, which narrowed to a 32% loss in 2021, further down to an adjusted EBITDA loss of 19% in this quarter. This performance improvement is ahead of our expectation and bodes well with our long-term plan of building an attractive profitable U.S. business. This operating leverage we are seeing is a balance of accelerating revenues, streamlining the organization and cost optimization.\n\nFor example, we have reorganized our U.S. sales team under one experienced sales leader and created enterprise and emerging accounts teams to better serve our customers and the market. Just this month, we made changes to our product and operation team, bringing us closer to our customers. These changes will net a more efficient and coordinated team, leading to a strong foundation in the future.\n\nOur customer optimization has focused on products and pricing strategies, allowing us to be more efficient in what we sell to our customers. In fact, we have recently engaged with some of our larger betting operator customers to develop a value-based pricing, which has been received very well. Last in our focus on profitability, acquiring sport rights, which we believe is a differentiating strength of the company. We have excellent visibility into our sport right costs over the next two to 3 years.\n\nAnd also, we continue to expect rights to grow over time. We fully expect to grow our revenues faster. Overall, given the strong revenue growth, market positioning and the increased level of cost discipline, we now expect to achieve profitability in the U.S. at least 12 months ahead of the original 2025 target date.\n\nLast, I want to announce that after having led us through the IPO process and the first 3 quarters as a public listed company, our chief financial officer, Alex Gersh, has decided that he and his family want to move back to the United States. He will be leaving Sportradar at the end of September to accept another position. I appreciate Alex many contributions to Sportradar and invite you to join me in wishing him well as he embarks on the next chapter. We have launched a search for a new CFO and have named Ulrik Harmut as interim CFO.\n\nUlrik, who has been with the company since 2013, has served as Chief Strategy Officer since 2020 and has been a member of my management team, overseeing corporate development activities, including M&A, strategic partnerships and ventures. I'm confident in Ulrik's leadership and support of Sportradar growth and contribution of the execution on the financial priorities. With that, let me turn the call over to Alex to talk about the financial results.\n\nAlex Gersh -- Chief Financial Officer\n\nThanks, Carsten, and good morning, everyone. First, let me thank Carsten for the opportunities to work at Sportradar. It's been very, very exciting two years. And while I'm relocating back to the U.S.\n\nand taking on a new challenge, I have no doubt that Sportradar will continue to go from strength to strength in its business. Now just a -- we'll start with the financial numbers. As Carsten already stated, we had strong revenue growth across all the segments in the second quarter. Revenue in the second quarter of 2022 increased 23% to 177 million versus the second quarter of 2021.\n\nGrowth was strong across all of the segments, with once again the highest growth coming from the U.S., where we grew 66%. Our revenue outperformance came despite losing approximately 5 million euros from business in Russia due to the conflict with Ukraine. We reported adjusted EBITDA of 28 million for the second quarter, down 13% year over year. primarily due to continued impact of Russia-Ukraine conflict, investment in our technology and product, and some impact of new sport rights contracts.\n\nAs is always the case, new sport right contracts profitability will improve as we accelerate the sales process. Our unlevered cash flow conversion increased to 157%, due in large part to favorable FX transaction from our cash balances. Our cash and equivalent exiting the quarter were 760 million euros, with total liquidity available of 826 million euros. As Carsten mentioned, in July, we paid down 200 million of our senior secured term loan, and I will go into more details later on it.\n\nNow for the segments. rest of the world betting. Our rest of the world betting revenue grew 21% in the quarter to 96 million, representing 54% of our total revenue. Growth was primarily driven by an uptick in our higher value ad offerings, including managed betting services, or MBS, and live ad services.\n\nMore specifically, MBS revenue grew 65% year over year to 33 million due to increased record turnover, while live data and ads grew 3% to 43 million due to upselling content to our existing clients. In addition, we saw increased content sales from our synergy acquisition acquired in the same quarter last year. Rest of the world betting adjusted EBITDA decreased 8% to 43 million. The associated adjusted EBITDA margin declined to 45% versus 59% in the prior period.\n\nAs I have mentioned previously, in the second quarter of 2022, we saw the impact of the Russia-Ukraine conflict. We continued investment in product and technology, which is mainly headcount, in order to drive future growth and acquire new sports rights. As I have said previously, and is almost always the case, the margin on new sports rights improves over time as we accelerate the sales process for those products. Rest of the World audiovisual segment grew 9% year over year to 40 million euros.\n\nThis growth was primarily driven by new customers and traction with our Synergy acquisition, offset by loss of revenue from Russian customers. Rest of the World Audiovisual adjusted EBITDA increased 22% to 13 million. Segment adjusted EBITDA margin increased to 33% from 29%, primarily due to higher personnel costs, partially offset with lower sports rights costs. Turning to the United States, which continues to be our highest growth segment.\n\nRevenue grew 66% year over year to 29 million. We spent time on this earlier in the call so I will simply summarize. We saw over 60% growth in betting, over 90% growth in audiovisual, over 90% growth in our sports solution, driven in large part by last year's Synergy acquisition. Ads and sports media grew at approximately 50% each.\n\nSecond quarter U.S. adjusted EBITDA was negative at 5.5 million, a sequential decrease of about 1 million. U.S. adjusted EBITDA margin was negative 19% versus a negative 27% last year, driven by operating leverage.\n\nAs we highlighted earlier, we remain confident in the continued progression toward profitability sometimes before 2025 at this point. Now, a few words on the cost. Personnel costs for the quarter increased by 18 million to 64 million, in line with our expectations, as we continue to hire and acquire in areas of product and technology to further our growth goals. Purchased services and licenses in the second quarter of 2022 increased by 11 million to 43 million compared with the second quarter of 2021, primarily resulting from increased cost of content creation in processing and in line with the revenue growth.\n\nThis really relates to growth in our cloud hosting capabilities and ads business. Last, total sports rights costs increased by 14 million euros to 49 million in the second quarter of 2022. Growth was driven by new 2022 rights as well as return to normalized schedule for sports, such as the NBA. Liquidity.\n\nOur liquidity and cash generation, of course, remained strong, and in fact, is strengthening. As we previously discussed, we continue to evaluate the best use of our cash and capital structure. Continued revenue growth and our strong liquidity position enabled the company to prepay a portion of the outstanding term loan facility B in the amount of 200 million euros in July 2022. Even after that prepayment, our available liquidity stands at 639 million euros.\n\nWe are confident that the strong and improving cash flow generation will allow us to invest in the business and take advantage of market opportunities as they arise. Our adjusted free cash flow increased to 36 million in the quarter, up from 13 million last quarter and from negative last year. Our unlevered cash flow conversion increased 257% from a negative 7% last year. Approximately 31 million was attributable to favorable FX gains on our cash as the euro weakened significantly during the quarter.\n\nWe maintain our medium-term unlevered cash free -- unlevered free cash flow conversion target range of 55% to 60%. As a reminder, we currently pay interest on our debt semiannually in the second and the fourth quarter of the fiscal year. And now just to summarize the guidance. Let me update it, and Carsten already mentioned it.\n\nFor the full year of 2022, we are raising our expected revenue outlook to a range of 695 million to 715 million or 24% to 27% growth rate from a prior range of 665 million to 700 million or a growth rate of 18% to 25%. Because we do not anticipate any improvement in the Russia-Ukraine consult this year, we are maintaining our adjusted EBITDA in the range of 123 million to 133 million euros, representing a year-on-year increase of between 21% to 30%. The result implies an adjusted EBITDA margin for 2022 of between 17% and 19%. Thank you, all.\n\nAnd I will turn it now back to Carsten for some additional remarks.\n\nCarsten Koerl -- Chief Executive Officer\n\nThank you, Alex. And in closing, I want to remind everyone of our key priorities. We continue to invest in our business, with a focus on our core betting products. And we expand our portfolio and products through internal development and opportunistic accretive acquisitions.\n\nAnd we will be prudent stewards of managing your capital, balancing risk and opportunities, all in the name of long-term shareholder value creation. With that, I can turn it over to the operator for opening up for Q&A.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from David Karnovsky with J.P. Morgan. Your line is open.\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nThank you. Carsten, just to follow up on the commentary to achieve U.S. profitability a year early. Wondering if you could unpack that a bit.\n\nAnd what are the specific revenue or cost buckets? Where you see Sportradar outperforming your prior expectation?\n\nCarsten Koerl -- Chief Executive Officer\n\nYeah. Hello, David. Thanks for the question. So first, if you simply follow the quarters, 2021 third quarter, we had been negative 34%; fourth quarter last year, negative 33%; first quarter this year, 25%; now second quarter, 19%.\n\nSo I think we clearly see here a trend of the operating leverage. If we are looking to the segments, undoubtfully, it's sports betting and ads product. Ads is growing with 40%. And from a sports betting perspective, we continue to see more states coming up, which is naturally good for us.\n\nThat's the first thing. And the second, which we mentioned many times, is live betting. Live betting is key for us. So the margin is significantly higher or whatever is related to live, and we are profiting from this.\n\nLooking now to our participation here, thanks to our first-mover advantage, we have a 70% market share. If it comes to the profits, what the operators generate with live betting. And from there, as you know, we get the revenues. So does that answer the question, David?\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nYes, very much. And then, Carsten, you set out a lot of data, excellent data about consumer betting habits. Just wondering if there's any insight you can share on the consumer as we've seen kind of economic slowdowns across a lot of the regions you operate in.\n\nCarsten Koerl -- Chief Executive Officer\n\nWe see absolutely not a slowdown. So I get this question many times. Yes, there are some small markets, mainly retail markets, where the operators have some problems in the big markets. And online, this is more than overcompensated.\n\nIf I'm looking now to the results of our clients, and as you might have followed a lot of published results, you see the same kind of tendency and trends. So this industry is resilient to an economic downturn. In case of a downturn, we even see more requests for sports betting in many of the markets. So all overall, if we look on this, we see no impacts, and in some markets, even a slight positive impact from more betting activities.\n\nOperator\n\nThank you. We have a question from Ryan Sigdahl with Craig-Hallum. Your line is open.\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nGood day, Carsten. Alex, good luck on your next venture. I want to dig into guidance first. So does the current range contemplate potential impacts for the rest of the year from Ukraine and Russia? Or is that outside the range, like I think it was the previous couple of times you gave guidance?\n\nCarsten Koerl -- Chief Executive Officer\n\nNo.\n\nAlex Gersh -- Chief Financial Officer\n\nIt contemplates. Sorry. It contemplates.\n\nCarsten Koerl -- Chief Executive Officer\n\nGo ahead.\n\nAlex Gersh -- Chief Financial Officer\n\nIt contemplates the current downside.\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nAnd just to be clear, considering the previous guidance, it was outside that range, just given the wider potential outcomes and now we're further along in the year. Is that right?\n\nAlex Gersh -- Chief Financial Officer\n\nThat's right. So all of the negative -- everything that we expect to come out of Ukraine and Russia negative is in these numbers.\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nGreat. Then for my follow-up, just EBITDA margin flat year over year. Obviously, Ukraine-Russia impacting that among the other things you mentioned. But as we sit here today and you think about kind of your headcount, the infrastructure, technology spend, etc.\n\nDo you think you had a reasonable place that we can see that resume higher starting next year and going forward?\n\nCarsten Koerl -- Chief Executive Officer\n\nWell, look, we said that we are continuing to invest visibly. But we are growing our team. We are investing in technology. But all in the way that we totally understand, we have to deliver within the guidance or even be better.\n\nSo that's the best what I can answer you on this. We are looking very carefully on our efficiency. We are looking very carefully in which kind of unit and product we invest. The U.S.\n\nis key for us from this perspective. So whatever happens, there is a very strong growing market. But we have also other growing segments like our trading services or the managed platform services, where we, of course, invest.\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nHelpful. Thanks, Carsten. Good luck, Alex.\n\nAlex Gersh -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nWe have a question from Bernie McTernan with Needham & Company. Your line is open.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nGreat. Thank you for taking the question. Maybe just to follow-up on the U.S. Interested if there's any thoughts on how the new MBA contract could impact the trajectory of EBITDA profitability from here.\n\nCarsten Koerl -- Chief Executive Officer\n\nYou know that the MBA contract, the old MBA contract is still valid for the next season. And after that, we are kicking in with the extension. And we -- like I mentioned in my script, we changed into a value-based pricing model. And we are -- as we speak, in discussions with the big operators, and they're looking very good.\n\nAnd I think we can announce something in one of the next quarters here to give you more transparency. But we are working on this piece to create value for our clients, and of course, for us.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nThat's great. I appreciate that. And then just wanted to dive in on Slide 7, where you guys say you deliver 70% of in-play NGR in the U.S. I think that's a higher share of your just U.S.\n\nhandle. So if I'm right on that, but why would you have a higher market share of in-play? Is there anything special that you guys are doing, do you think, to drive outsized market share in-play versus regular?\n\nCarsten Koerl -- Chief Executive Officer\n\nWe have. No, we are delivering our service to 98% of the sportsbook in the United States. So there might be some very, very small casinos which are not getting any services from us. So from this perspective, we more or less cover the complete market.\n\nBut the interesting one in live is, of course, it's a segment where we have the strongest focus on. It's the highest profitability for us. And these numbers are coming from our clients. So if we look to our clients and to our revenue share, this is how we compile this number.\n\nAnd it comes simply from our first-mover advantage. We started here in 2014. And with that first-mover advantage, we have been able to build a client relation which includes, for example, a preferred supplier clause. So in case that there are more suppliers with the same data, which is not official data, then the bookmaker has to choose us because we have that existing contract.\n\nIt gives us a better starting position in that very important segment. I hope that makes the numbers a bit more clear.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nThat's great. Thanks, Carsten.\n\nOperator\n\nWe have a question from Robin Farley with UBS. Your line is open.\n\nRobin Farley -- UBS -- Analyst\n\nGreat. Thanks. Just to circle back and put a finer point on your guidance. And at one point, you talked about that potentially having 13 million euro of disruption from Russia-Ukraine, and now you're saying that that's not going to impact.\n\nJust to clarify, is that due to less disruption? Or is it the same amount of disruption, but the rest of your business is coming in higher than you thought and offsetting that? Thanks.\n\nAlex Gersh -- Chief Financial Officer\n\nHi, Robin. Sorry.\n\nCarsten Koerl -- Chief Executive Officer\n\nNo, no. Alex, please go ahead.\n\nAlex Gersh -- Chief Financial Officer\n\nSo it's the second one. It's what Carsten just said. We have a very significant growth in ads. We have very significant growth across other parts of the business.\n\nAnd while it's not as high margin as the Russian revenue is, which is effectively 100% margin, right? That's the reason why we are maintaining our guidance and have included all of the negative impact of Russia into the current guidance.\n\nRobin Farley -- UBS -- Analyst\n\nOK.\n\nCarsten Koerl -- Chief Executive Officer\n\nSo if I might round it up, Robin, we -- fully aware, we need to perform no matter what happens in the world, no matter what kind of excellent impact is there. This company has to manage it, keep the guidance and delivered the results. That's what we're fully committed to. And Alex said it rightly.\n\nWe could mitigate this with the other things which Alex mentioned, and there are a couple of more things which are in there. But all the negative impact is already in that numbers which are in the guidance. And we are fully committed to hold the guidance and deliver this.\n\nRobin Farley -- UBS -- Analyst\n\nGreat. Thank you. And then just one quick clarification. On the -- can you talk about how much of the revenue growth was from the Synergy acquisition versus organic? Thanks.\n\nCarsten Koerl -- Chief Executive Officer\n\nAlex, can you take on this?\n\nAlex Gersh -- Chief Financial Officer\n\nWell, the Synergy acquisition sits in a number of different places. So it's quite difficult to separate it in such a specific way. I can tell you that in the U.S., for instance, our Sports Solutions business, which effectively is Synergy, has grown very significantly from about 5 million last quarter to about 8 million or so quarter -- Q2 of 2022 to about 8 million in quarter -- of the quarter '21 to about 8 million in Q2 of 2022. But then there is also growth in other parts of the business that comes from Synergy.\n\nWe talked about AV and even there are some in betting the rest of the world, but it's much harder to -- it's a cross-sell kind of a business and it's much harder to indicate specifically.\n\nRobin Farley -- UBS -- Analyst\n\nBut I mean, of your total revenue growth, how much of that was Synergy's? You just looked at it in aggregate, not even needing to look at the different buckets.\n\nAlex Gersh -- Chief Financial Officer\n\nI can't. That's what I'm saying. So there is a cross-sell from the Synergy business to other units. And I don't have the number that adds all of that together, right? So that's my -- the biggest part is in the U.S., and I've given it to you.\n\nBut I can't give you the other stuff. What we're doing with Synergy is we bought it. And now we're cross-selling their products to our huge customer base, successfully cross-selling those products, but it's very difficult for me to break those pieces out.\n\nRobin Farley -- UBS -- Analyst\n\nOK. Understood. Thank you.\n\nOperator\n\nWe have a question from Steven Pizzella with Deutsche Bank. Your line is open.\n\nSteve Pizzella -- Deutsche Bank -- Analyst\n\nGood morning, guys. Just wanted to follow up on the U.S. business. It looks like U.S.\n\nrevenues are settling in at approximately one and a half to 2% of U.S. sports betting CAGR according to our math. I guess, one, do you think that's a good way to look at it given, I believe, a large part of the revenue is from other revenue? And two, where do you think that can get to? Can you reach 4% to 5%?\n\nCarsten Koerl -- Chief Executive Officer\n\nHi, Steven. So no, I think it's not a good way to look into it because you would look only into data distribution. And I hope we made it clear that we are not a data-only distributor for the U.S. media and betting.\n\nWe are trying to start with the data and then upsell with probability products which, we call live bots. Then we are going into the trading services, and we are going into the platform services. And we are cross-selling this AD and DASH product. And that all comes with a significantly higher margin share.\n\nAnd that explains you the journey where it goes into the direction to the numbers that you mentioned. But with the pure data upsell, that would be not possible. So you need to deliver value to the client, additional value and that comes from these additional products.\n\nSteve Pizzella -- Deutsche Bank -- Analyst\n\nOK, great. Thanks. Appreciate.\n\nOperator\n\nWe have a question from Michael Graham with Canaccord Genuity. Your line is open.\n\nMichael Graham -- Canaccord Genuity -- Analyst\n\nThank you. I just wanted to ask a deeper question about your ads business. You said in the slides that ads grew over 70%. And I believe you mentioned a 40% growth number in your prepared remarks.\n\nWas that for the U.S.? And then maybe just clarify that. And then can you talk about how complete you think your ads solution is and just sort of what is the potential for that business going forward?\n\nCarsten Koerl -- Chief Executive Officer\n\nWell, if we're looking now into the future, we see a continuous growth year over year from 40% to 45%. That's for the next years. And what we built it with ads is, by ourselves, a programmatic advertising engine with DSP and SSP self-developed players. You can buy some of those pieces from companies in the market and try then to modify the algorithms by yourself and build the engine.\n\nWe have decided many years ago to build this by ourselves, and we think it's a strength that we can control this. What we added now to the programmatic is things like paid social, off-line campaigning. And all those elements together are building then now the ads business. So that has changed during the year.\n\nWe added now the paid social. And that has also an impact because paid social is traditionally a product where you have less margin. But the gross net -- or gross revenue is the same. So 40% to 45%.\n\nAnd we see that this is continuing over the next years. Currently, and I think that was the second part of your question, we are focusing very much on the United States with ads, because here, we see the highest demand. We see very high acquisition costs for the operators to recruit new punters. So that is a perfect market environment to have an optimized channel.\n\nAnd whatever we do with that is significantly cheaper than broadcast or working with the big medias. Therefore, we are continuing to focus here.\n\nAlex Gersh -- Chief Financial Officer\n\nIf I could just add -- sorry, I'll just add. So the way -- so the ads business in the U.S. grew 50%, right? But the total ads business globally grew about 40%. So it grew a little bit less in Europe, but in the U.S., it's growing at 50%.\n\nMichael Graham -- Canaccord Genuity -- Analyst\n\nOK, thank you. And then as a quick follow-up to that, do you have any kind of comment about the competitive landscape among the operators in the U.S.? Given sort of your lens through the ads business, do you think that competitive intensity is increasing or not?\n\nCarsten Koerl -- Chief Executive Officer\n\nWell, you got for me the growth expectation. Would somebody who is expecting a 40% to 45% growth going 3 years forward see a strong increase in the competitive landscape? I would say that would make you a little bit more conservative with that growth rate. I think it's a very specialized segment. I think we have a very specialized solution for this.\n\nYes, there is competition. But we expect that strong growth. So that means we expect that we can provide very competitive solutions.\n\nMichael Graham -- Canaccord Genuity -- Analyst\n\nThanks a lot.\n\nOperator\n\nWe have a question from Shaun Kelley with Bank of America. Your line is open.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thank you for taking my question. I just want to go back to the revenue outlook for a moment. I think we've talked a lot about the EBITDA outlook and decomposing that.\n\nBut just as we think about what you're seeing on the core revenue trends that gave you the confidence to be able to increase guidance, can you just help us break down a little bit more specifically? Was that more out of the U.S. where we are seeing continued super solid growth or is it healthier trends in just rest of world? Where exactly kind of would you define that increase? I know it's pretty strong across the board.\n\nCarsten Koerl -- Chief Executive Officer\n\nLook, the rest of the world betting is the most important segment for us. And here, we are growing more than 20% in the quarter, and we continuing seen the growth. That comes from upselling clients. I spoke about the NRR with 115%.\n\nWe nearly losing no client, less than 1% churn. So we can upsell some of the scalable products. Live sport is a sample for this. And we are increasing to see clients moving into our trading services and the platform services, which is, of course, very good for us.\n\nIt's a higher-margin product and it is driving the growth. Looking to our audiovisual segment, that's traditionally something which is not growing that fast. So we are around about 10%. And that is kind of a thing where you're going to need to calculate and being a prudent steward of the capital of our investors, how much rights -- audiovisual rights do we put in that segment that we're optimizing the portfolio here, and then we can drive the growth in there, but it's a question of profitability.\n\nSo you will see in this segment not the growth like in the rest of the world betting, but pretty stable and satisfying. And then we are coming to the U.S., where we see strong growth trend, a CAGR of, I think, 59% for the last four years, which I gave you, is demonstrating this. We're not seeing this slowing down. We see that more states are coming online with betting.\n\nAnd we see also a lot of requests for media companies that we can upsell here. So that's the mix. Strong growth driver, a strong growing market in the United States. Now 15% of our total revenue, increasing strongly, very, very stable, high-growth betting business, main driver, the trading services and the platform services from a growth perspective and then very stable audiovisual growing business.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nThank you. And then as a follow-up. It was a volatile FX period, probably more volatile than I've seen in any number of years over the second quarter. And obviously, it had an impact on just cash and accounting a little bit.\n\nBut can you just outline how this impacts Sportradar's business? Broadly speaking, are there anomalies or things that happen? Or are most costs in market relative to currency? I mean, it doesn't look like it had a material drag, at least as reported in euros, as it relates to reported results. But just how does it play through the financials and the consumer side for Sportradar?\n\nCarsten Koerl -- Chief Executive Officer\n\nAlex, a perfect question for the CFO.\n\nAlex Gersh -- Chief Financial Officer\n\nYeah, so you're right. It's not -- so obviously, we disclosed the cash, right? We are a euro company. So this is all gain to us as the dollar continues to strengthen. And obviously, we disclosed the cash.\n\nAnd that's very clear that our U.S. dollar cash revalue is now significantly higher. But in terms of dollar cash in terms of euros. In terms of the actual business, the impact on revenue is really material, a couple of million at best.\n\nAnd there is zero impact on the EBITDA because of the balance of -- in our revenue and cost in U.S. dollars as it translates. So at this point, there is no impact really of any -- in terms of the P&L, other than the cash valuation at all. And I guess as we obviously become bigger and bigger in the U.S.\n\nin terms of revenue over time, the impact would become bigger if the volatility continues. But at this point, and certainly toward the end -- for the end of this -- for the balance of the year, I don't see any material impact on -- of FX on the revenue or on the EBITDA.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you. And our last question comes from David Katz with Jefferies. Your line is open.\n\nUnknown speaker\n\nHi. This is Cassandra asking on behalf of David. Well, first, thank you for taking my question. Carsten, could you expand a little bit more on the U.S.\n\nlive betting today? Can you tell us what is the penetration today? And where do you see it longer term?\n\nCarsten Koerl -- Chief Executive Officer\n\nYes. So that's the same and hello, Cassandra. That's the same what I said in one of the last quarterlies. We see that there are -- some sports are picking up better on live.\n\nBasketball is such a sample. Very difficult to give you here at the moment, the current board parts from operator to operator, a bit different. But that say that a ballpark, 35%, 30% to 35%, that's a proportion from all bets received. So still, it's a minority.\n\nhere are sports which are a little bit less. For live betting, NASCAR might be such a sample, or NFL. But it all shows into direction. Everything is growing strongly in the live betting segment.\n\nIt's simply much more fun and much more enjoyable if you watch the event and if you can place the bet. You are much more connected and you have this emotional element. And that's what is driving all of us via sport fans. And it's emotional.\n\nAnd betting is much more emotional if you do it in play. In our core markets, in Europe, but also in Africa, in Latin America and in Asia, there is a very, very clear trend into live betting. In the saturated markets, we see 70% to 80% of all the accepted bets are live. And we expect the U.S.\n\nto have the same trends. It takes a time. And it's only a question, what do we think, how long will it take, that the U.S. has adapted to the worldwide level of live betting bridges, in the range of 70% to 80% of all bets are live.\n\nBut undoubtfully, this trend has started. And then you can't reverse it, which is good and which is very rational because both is emotional. And during that emotion, if you place a bet, that's so much more enjoyable.\n\nUnknown speaker\n\nGreat. And if I may follow up. I feel like single game or Singampall has become pretty popular in the U.S., and whether the company is today offering products or pricing on parlays like that? Or will look into developing this kind of offering?\n\nCarsten Koerl -- Chief Executive Officer\n\nYes. Well, this is only a part of the betting engine. And with our platform services, we are offering this. Even with our trading services, we are offering calculators for parlays and for integrating bonus or buyback programs.\n\nIf you have a parlay, and if two of your picks are already winning and you have a cert, you can buy back the bet. And there are algorithms to do this, and we have those things. So I think it's a very normal trend. So you want to go with a $1 bet, and you want to win $1,000 with a $1.\n\nSo combine a parlay with high multiples, and you're getting there. So that's something which we've seen in many places, very popular. And I'm happy to see that this is also picking up in the U.S. That moves the way from the traditional Vegas punter with $10,000 in his pocket going on only one specific over under into more the entertainment factor which we are promoting a lot.\n\nUnknown speaker\n\nGot it. Thank you very much.\n\nCarsten Koerl -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. And there's no other questions in the queue. I'd like to turn the call back to Carsten Koerl for closing remarks.\n\nCarsten Koerl -- Chief Executive Officer\n\nSo thanks to everyone for joining the call today. I want to reiterate our ability to meet and exceed the revenue expectation despite the ongoing challenges we face from the Russian-Ukraine conflict and the general economic unease. With our cash flow and the capital in a stronger position today, we will continue to look to opportunities for growth and eye toward smaller accretive acquisitions. And we will relentlessly drive leverage into our business model, especially in the U.S.\n\nI want to personally thank our Sportradar team for their persistent commitment day in, day out to serve our customers and build our businesses. I couldn't be prouder of what we have built over the past 20 years. I remain incredibly confident in our prospectus for the future. Thank you for joining the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChristin Armacost -- Investor Relations Manager\n\nCarsten Koerl -- Chief Executive Officer\n\nAlex Gersh -- Chief Financial Officer\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nBernie McTernan -- Needham and Company -- Analyst\n\nRobin Farley -- UBS -- Analyst\n\nSteve Pizzella -- Deutsche Bank -- Analyst\n\nMichael Graham -- Canaccord Genuity -- Analyst\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nUnknown speaker\n\nMore SRAD analysis\n\nAll earnings call transcripts"
}