{
  "companyName": "Brookfield Renewable Partners L.P.",
  "companyTicker": "BEP",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/brookfield-renewable-partners-lp-bep-q3-2022-earni/",
  "content": "Brookfield Renewable Partners L.P. (BEP -0.51%)\nQ3 2022 Earnings Call\nNov 04, 2022, 8:30 a.m. ET\n\nOperator\n\nHello, and thank you for standing by. Welcome to the BEP third quarter 2022 results conference call and webcast. [Operator instructions] It is now my pleasure to introduce CEO, Connor Teskey.\n\nConnor Teskey -- Chief Executive Officer\n\nThank you, operator. Good morning, everyone, and thank you for joining us on our third quarter 2022 conference call. Before we begin, we would like to remind you that a copy of our news release, investor supplement, and letter to unitholders can be found on our website. We also want to remind you that we may make forward-looking statements on this call.\n\nThese statements are subject to known and unknown risks, and future results may differ materially. For more information, you are encouraged to review our regulatory filings available on SEDAR, EDGAR, and on our website. On today's call, we will provide an update on the business and some of our recent growth initiatives. Esper Nemi, our vice president in our investments team in North America, will discuss the growth of our renewables development business in the United States.\n\nI will then provide an overview of our recently announced acquisition of Westinghouse and why it will finish off the call discussing our operating results and financial position. Following our remarks, we look forward to taking your questions. We had a great quarter, demonstrating both through our strong financial results and the execution of several large-scale growth initiatives. We generated funds from operations of 243 million or $0.38 per unit, a 15% increase from the same period last year, as well as we advanced our key commercial priorities and development activities.\n\nWe continue to believe that our business is uniquely positioned, providing investors with one of the most attractive value propositions in the sector. We feel this way for a number of reasons. First, our business is supported by a highly diversified global platform of clean energy assets, providing deep operating knowledge and visibility and the flexibility to deliver decarbonization solutions for our customers around the world. Second, our cash flows are contracted long term and inflation-linked, meaning we will remain resilient throughout all economic environments.\n\nThird, our robust liquidity, strong balance sheet, and access to deep and varied sources of capital provide us the ability to execute on some of the largest and most attractive decarbonization investment opportunities. And lastly, we have a differentiated growth capability with over 100 dedicated investment professionals around the world looking to deploy capital at attractive risk-adjusted returns while delivering on our 12% to 15% return target. In this regard, we had a record quarter, as we closed our secured investments of up to $6 billion of capital or 1.5 billion net to Brookfield Renewable across various transactions in regions. This includes the continued growth of our leading U.S.\n\nrenewables development business for which we will turn the call over to Esper to discuss.\n\nEsper Nemi -- Vice President, Investments\n\nThank you, Connor. And good morning, everyone. As Conor mentioned, our U.S. business continues to see significant growth.\n\nFollowing the close of our recently announced acquisitions, our development pipeline in the country will send out over 60,000 megawatts and is well diversified across wind, utility scale solar, distributed generation, and energy storage. The significant pipeline alongside existing scale operating business means that we are owners and operators of one of the largest, diversified, clean power businesses in the country. Recently, we announced the acquisition of Scout Clean Energy and Standard Solar, both of which will be highly complementary to our existing business. Scout Clean Energy is one of the largest utility scale fully integrated renewable development platforms in the US.\n\nacross wind, solar, and storage. We purchased the business for 1 billion, with the potential to invest an additional 350 million to support the business' development activities. In aggregate, this is 270 million net to Brookfield Renewable. Scout has a sizable existing portfolio of over 800 megawatts of operating wind assets and an attractive pipeline of over 22,000 megawatts of wind, solar, and storage projects across 24 states.\n\nThis includes almost 2,500 megawatts of under construction and event stage projects, with high visibility for commercialization and nearly 5,000 additional megawatts to have valuable interconnection key positions. There's a strong management team in place with significant renewable power experience and a proven track record of successfully developing and financing over 20 gigawatts of clean energy assets. This team will be a great compliment to our capabilities and will benefit significantly from being a part of our business, especially our commercial and procurement capabilities. Standard Solar is a leading integrated distributed generation developer in the U.S.\n\nWe announced the signing of this investment last quarter, and we have now closed the acquisition for consideration of 540 million, with the potential to invest an additional 160 million to support the business' growth initiatives, or 140 million in total net to Brookfield Renewable. Standard Solar is a market-leading owner and operator of commercial and community distributor solar with end-to-end development capabilities and a strong track record of delivering high-quality assets. The business has approximately 500 megawatts of operating and under-construction contracted assets and an almost 2,000 megawatt identified pipeline. There's an experienced management team in place with a proven ability to execute on significant growth opportunities across several high-value solar markets in the U.S.\n\nthat are highly complementary to existing business. Finally, it is important to emphasize that when we underwrote these investments, as well as Urban Grid, our utility scale solar development platform that we acquired in the first quarter, we do not factor in the impacts of the inflation reductions. However, with Inflation Reduction Act firmly enacted, it will provide meaningful upside to our sector and, in particular, these development platforms. These investments will benefit from the extension of tax credits for wind and solar projects, as well as the expansion of tax credits that include storage, which can meaningfully accelerate and increase the buildout of the high-quality development pipelines within these businesses.\n\nThank you for your time today. With that, I'll turn the call back over to Connor to discuss our investment in Westinghouse.\n\nConnor Teskey -- Chief Executive Officer\n\nThanks, Esper. Any credible net-zero plan must include a meaningful and growing amount of nuclear power generation. Not only that, the same industry tailwinds of decarbonization, electrification, and energy security are a benefit to nuclear power generation, the same way that they are to wind, solar, and hydro. Last month, we reached a definitive agreement to acquire Westinghouse alongside our strategic partner Cameco, one of the largest global suppliers of uranium fuel for nuclear power generation.\n\nWestinghouse is a global leader in providing critical products and services to the nuclear power industry. The transaction represents a very attractive risk-adjusted return proposition as the business is underpinned by highly durable cash flows, with approximately 85% of revenues coming from long-term inflation-linked contracted, or highly recurring services, and a business that comes with nearly a 100% customer retention rate. Westinghouse acts as a service provider, and, therefore, it does not take on any commodity, construction, or significant fixed-price contract risk, nor does it have any exposure to nuclear liabilities as it operates in countries where those liabilities for nuclear accidents lies with the plant operators. The total equity invested for the transaction will be approximately 4.5 billion or 750 million net to Brookfield Renewable, where we, along with our institutional partners, will own 51% of the company, and Cameco will own the remaining 49%.\n\nOur investment in Westinghouse is an attractive entry point into nuclear power generation, which we believe, along with hydro, to be one of the key technologies facilitating the rapid buildout of intermittent renewables. Wind and solar must be complemented by clean, dispatchable baseload power generation. As the owner of one of the largest hydro businesses globally, we have visibility to the increasing value of clean, reliable, and economic sources of power to the grid. Westinghouse is exceedingly well-positioned to benefit from these secular trends.\n\nIt is the leading original equipment manufacturer and scale provider of mission-critical technologies, products, and services to half the global nuclear power generation fleet. Westinghouse serves as a key enabler of the energy transition around the world, providing products and services essential to both the continued operation and growth of the global nuclear fleet. Given the need for clean, dispatchable energy, as well as its compelling economic proposition, we believe that nuclear power is posed for significant growth. And as long as nuclear power exists, Westinghouse will perform well.\n\nWestinghouse is well-positioned to benefit from the significant volume of plant extensions that have been announced, 50 gigawatts and growing, and the more than 60 gigawatts of new build reactors expected between 2020 and 2040 across more than 20 countries around the world. Recently, the Polish government announced that it had chosen Westinghouse to support a first project of three units with an option for another three using Westinghouse's AP1000 nuclear reactor technology. This was a key step toward the country achieving its decarbonization targets and greater energy independence. Lastly, there are multidecade growth opportunities in the rollout of next-generation advanced nuclear technology, such as Westinghouse's eVinci micro-reactor technology, which can play a growing role in an increasingly decentralized and decarbonized energy system.\n\nWith that, we will turn the call over to Wyatt to discuss our operating results and financial position.\n\nWyatt Hartley -- Chief Financial Officer\n\nThank you, Conor. As mentioned in earlier remarks, we had strong results in the quarter as our operations benefited from strong global power prices and continued growth, both through development and acquisitions. Our balance sheet is in excellent shape, with our credit rating recently affirmed at BBB+ with a stable outlook. We remain resilient to the rise in interest rates globally with over 90% of our borrowings being project-level, nonrecourse debt with an average remaining term of 12 years, no material near-term maturities, and only 3% exposure to floating rate debt.\n\nIn increasingly volatile markets, our access to diverse pools of capital becomes even more differentiated. We have over $3.5 billion of available liquidity, giving us significant financial flexibility during periods of capital scarcity. During the quarter, we secured over $3.7 billion of nonrecourse financings across the business that will close this year, resulting in over $400 million in our financing proceeds to us. As both Connor and Esper illustrated, we had an impressive quarter for growth and are confident we can maintain this pace of deployment going forward.\n\nImportantly, we are very well-positioned to fund this growth. As I mentioned, we have access to deep and varied sources of capital, which is increasingly valuable in the current market. A significant portion of our recent growth is already funded or is structured to have capital deployed over a prolonged period and in almost all cases better option. Further, we intend to more actively take advantage of the strong bids we are seeing for a number of our mature assets where we have successfully executed our business plan.\n\nRecycling proceeds from mature assets into new growth opportunities remains one of the most value accretive levers within our business. We also have initiated capital recycling activities that in total, when closed, expect to generate approximately $830 million of total proceeds. We have also launched numerous sales processes for some of our mature assets in select markets, which are garnering significant interest at very attractive valuations, providing significant visibility to our capital recycling program for the coming quarters. In closing, we believe the future opportunities for investing in clean power and the energy transition will be even greater than they are today.\n\nAnd our scale track record and global capabilities position us as a partner of choice in decarbonization. On behalf of the board and management, we thank all our unitholders and shareholders for their ongoing support. That concludes our formal remarks for today's call. Thank you for joining us this morning.\n\nAnd with that, I'll pass it back to our operator for questions.\n\nOperator\n\n[Operator instructions] And our first question comes from the line of Robert Hope with Scotiabank.\n\nRob Hope -- Scotiabank -- Analyst\n\nGood morning, everyone. Just the first question on the development pipeline. You've been quite successful year to date on, you know, expanding that pipeline. However, with 10,000 megawatts potentially entering service here in the next couple of years, you know, that could meaningfully drive down that pipeline.\n\nYou know, it does seem like there's a little bit of a gold rush for development companies right now. How do you envision, you know, longer term replacing this development pipeline?\n\nConnor Teskey -- Chief Executive Officer\n\nThanks, Rob. Maybe a couple of comments there. First and foremost, it's absolutely true that over the past 12 months, we've made a number of acquisitions of businesses that come with large in-place development pipelines. And that has dramatically increased our businesses' total development capacity to approximately 100,000 megawatts.\n\nBut what's important to recognize is when we buy those businesses, we're not buying static operations. They come with management teams that have incredible greenfield development capabilities, such that they can continue to organically grow those development pipelines themselves. And I would, perhaps, take a slightly different view. I would expect that, while we do intend to build well north of 10 gigawatts of that pipeline out over the next three years, I would expect, three years from now, when we look to the next three years, we'll be looking to build far more than 10 gigawatts out in that period as well.\n\nSo, we expect to see that pipeline continue to be pulled forward and to continue to grow, given the development capabilities we have within our business. And no doubt some of that support for things like -- some of the support that comes from policies, such as the IRA, are significantly going to help that dynamic. The other comment I would make is just around our success, particularly in the United States, around acquiring development platforms. If you go back 12 to 18 months, there were a lot of development businesses sold in the United States.\n\nAnd candidly, we looked at almost all of them. And we put a lot of work into them, and we bid at what we thought were attractive returns. And we weren't very competitive in 2021. And then 2022, we've used the same investment discipline, and we've been successful on bidding on a number of those acquisitions.\n\nAnd I do think that demonstrates, perhaps, what is happening in the market where less-sophisticated investors that maybe don't have the access to capital that we do in more uncertain markets and maybe investors that aren't as quite well-positioned to manage through things like supply chain disruptions or bring power marketing capabilities to bear, haven't had the ability to acquire for value in 2022 like we have.\n\nRob Hope -- Scotiabank -- Analyst\n\nAppreciate that. Thank you. And then, maybe the second question is just on your other growth initiatives. So, it does feel like the net is being cast a little bit wider into the transition, you know, arena, that being said, on a, looks like, a disciplined manner.\n\nWhen you're evaluating these new opportunities, Westinghouse look like, you know, will characterize it as long-duration cash flows. But maybe the next phase of growth, the pure play recycling business, what are kind of the key tenants of risk return, contract creation, and asset investment are you looking for?\n\nConnor Teskey -- Chief Executive Officer\n\nRob, great question. And you're absolutely right. Part of the reason why we love Westinghouse is it's a large-scale operating business directly tied to the clean energy transition that, if you look at the underlying cash flows, they actually have a lot of parallels to the wind and solar and hydro businesses that we've been investing in for decades. But you're also correct that a smaller but growing part of our business is more of the energy transition and sustainable solution initiatives.\n\nAnd what we look for when we expand into those asset classes are really three things. One, there needs to be a clear decarbonization objective. And the acquisition needs to be motivated by the ability to offer something to our customers that we don't offer them today. Secondly.\n\nThe approach we've taken when investing in those businesses, so far, is to make very small initial upfront investments that have a strong level of downside protection, but allow us to, one, partner with a leader in the space and, two, put us in the priority position to invest more capital at our discretion if those asset classes in sustainable solutions grow in the future. Whether it's the recycling business or some of the carbon capture investments we've made, these are small downside-protected upfront investments where we have the right to deploy more capital if we see opportunities to build out those sustainable solutions when they're backed by long-term contracts, the same way we approach wind and solar. The last point I would make is while we have made a number of investments in this space in recent quarters, it is important to recognize that we do still feel the single largest growth opportunity for our business is in the buildout and acquisition of traditional renewable power asset classes. And that's really been demonstrated by the activity we've seen in the United States over the last 12 months.\n\nRob Hope -- Scotiabank -- Analyst\n\nI do appreciate that.\n\nOperator\n\nThank you. And our next question comes from the line of Sean Steuart with TD Securities.\n\nSean Steuart -- TD Securities -- Analyst\n\nThank you. Good morning, everyone. I want to follow up on the accelerating capital recycling initiatives of mature assets to bolster the liquidity position and crystallize return. Can you give us additional comments on any focus with respect to technology or region, what you're concentrating on, where you see the better relative opportunities right now?\n\nConnor Teskey -- Chief Executive Officer\n\nCertainly. Perhaps, the simplest answer is we see the greatest opportunity largely in the sale of wind and solar assets. We certainly have a very rapidly growing platform. And whether it's through M&A or through organic development, we're constantly adding more of those assets to our platform, which provides us tremendous flexibility to recycle those assets where we've executed our business plan, and they're more mature within our portfolio.\n\nThe other characterization we would make is, when we look at some of the assets that were receiving inbounds or interest for that are prime candidates for capital recycling, there is a nice mix right now of mature operating assets. But we're also getting interest in portfolios that includes some of our development pipeline or under-construction assets. And the point that we would reemphasize is, whether we're selling an operating asset or selling a portfolio that still has some development and organic growth runway, we're only going to look to sell assets where we've completed our business plan and the initial operating objectives that we set out to do when we acquired the business. Perhaps, a last comment, We do expect to be recycling capital on a global basis.\n\nIn the near term, we largely see most of the opportunities within the Americas. And we would expect some of our capital recycling to be focused there in the next, call it, six to nine months. But we're also seeing opportunities in other parts of the world.\n\nSean Steuart -- TD Securities -- Analyst\n\nOK. Thanks for that, Connor. And on the M&A opportunity set, you focused more recently on private opportunities. Can you give any updated broader thoughts on valuation trends for private opportunities versus public opportunities, given the extent of volatility in the latter group? Any particular focus that you're concentrating on?\n\nConnor Teskey -- Chief Executive Officer\n\nDefinitely. Great question. So, no doubt, there -- the opportunity set in the public market space for us around potential M&A is higher today than it was six months ago, or it was 12 months ago. So, we're actively monitoring that space.\n\nBut the point you've highlighted also illustrates another dynamic that we're seeing, which is, in recent quarters, we've acquired a number of platforms for value that had a development focus where we thought we could really enhance growth and drive value with our procurement capabilities and our power marketing capabilities. And that's led to a more recent focus on development. I think what we're seeing, given the more uncertain and slightly more volatile public markets and capital markets, is we are seeing more opportunities to buy operating assets in the current environment than, perhaps, we've seen in the last six or nine months. And that's just a very natural ebb and flow of our business.\n\nAnd it would be great to see more opportunities in that space going forward.\n\nSean Steuart -- TD Securities -- Analyst\n\nThat's useful context. Thanks very much, Connor. That's all I have.\n\nOperator\n\nThank you. And our next question comes from the line of Rupert Merer with National Bank. \n\nRupert Merer -- National Bank Financial -- Analyst\n\nHey, good morning, everyone. On the development activity, you're looking to build out 10 gigawatts over the next three years. Can you comment on how the supply chain interconnection queues and offtakes are evolving to support those growth targets?\n\nConnor Teskey -- Chief Executive Officer\n\nCertainly. So, great question, Rupert. And this is something that's been topical for a number of quarters now. And we will remain consistent.\n\nManaging through supply chain disruptions, we are not immune to that. It is something that has impacted the entire industry. But the way we would classify it for our business is it is something we have had to dedicate increased resources and increased focus to manage through. But we feel we've managed through it very successfully.\n\nAnd any disruptions have not had a material impact on our business, either in terms of capex costs or in terms of the timeline on delivering projects. We're quite proud to state that we've not walked away from any projects during this period of supply chain disruptions. However, perhaps, this quarter, there is a more positive spin that we are beginning to see a light at the end of the tunnel around the ability to more easily procure capex in many markets around the world. There is more capacity coming online.\n\nSome of the logistical issues around shipping those components around the world do appear to be easing, and, therefore, we feel we've done a great job managing up to this point. But we do expect 2023 to be better than 2022. And that's a nice upside for our business. Another, perhaps, short answer to your question, we don't see supply chain disruptions that's a risk to delivery on that, you know, 10,000-plus megawatts that we expect to bring online.\n\nRupert Merer -- National Bank Financial -- Analyst\n\nAnd with the competitive environment, do you see adequate access to interconnection and a fair price and optics as well?\n\nConnor Teskey -- Chief Executive Officer\n\nIt's a great question and we're glad you asked it. Interconnection is something that we feel -- an interconnection queue position is something that we feel has been dramatically undervalued within our sector for years. And when we make investments, particularly on the development side, we always take into account where are those development projects in terms of their lifecycle. Do they have land secured? Do they have permits secured? And do they have interconnection grids secured? And this is something we've taken into account whenever we've made an investment in development platforms.\n\nI'll actually give an example from earlier this year, Urban Grid. We bought this business, and we cleared the market, and we were thrilled to make that acquisition. And one of the underappreciated benefits of that business is it had a very strong interconnection queue position in the high value market of PJM. And already in our early stages of ownership of that business, we've seen the ability to capitalize on that highly valuable and highly scarce interconnection position.\n\nSo, to answer your question, yes, we think interconnection is a very important component of the value of a development project, and it's something that's increasingly coming into focus across our industry today. But we feel quite proud that it's something we've been focused on for a number of years now across all the development acquisitions we've made.\n\nRupert Merer -- National Bank Financial -- Analyst\n\nGreat. Thanks, Connor. I'll leave it there.\n\nOperator\n\nThank you. And our next question comes from the line of David Quezada with Raymond James.\n\nDavid Quezada -- Raymond James -- Analyst\n\nThanks. Good morning, everyone. My first question, maybe just a kind of a broader question around your renewable deployment strategy in Europe. I think it was a couple of quarters ago, you talked about, you know, accelerating investment in places like Germany.\n\nJust curious what you've seen recently in terms of, you know, advancement of projects there and momentum you're seeing in that market today.\n\nConnor Teskey -- Chief Executive Officer\n\nCertainly. One dynamic we are seeing in Europe, and this will come as a shock to no one, is the increased importance and heightened focus on energy security. And well, right now, the delivery of gas dominates a lot of the headlines as it pertains to European power markets. Something that is happening in a very, very large way is European regions and European authorities are working very hard to accelerate the permitting across Europe to allow for the more rapid buildout of renewables.\n\nRenewables really are the long-term solution to low-cost energy and energy security and net-zero, which is probably the three highest priorities in Europe right now. Where we're seeing that most actively across three of our European businesses is in Cenovus, our solar developer in Germany, where we've accelerated the buildout of our development pipeline; within X-Elio, which is a large global solar development platform with a significant presence in Europe that is seeing an acceleration of its buildout in Spain; and also within Polenergia, that is pulling forward some of its wind and solar buildout in the country. So, we're seeing it very much within our operating businesses, and we're taking that into account as we review new growth opportunities and M&A opportunities as well.\n\nDavid Quezada -- Raymond James -- Analyst\n\nExcellent. Thanks for that color, Connor. Appreciate it. Maybe just one more for me on the Westinghouse acquisition.\n\nI'm just curious what kind of timeline and, I guess, a magnitude of opportunity you see with the micro-reactor technology. And do you have any thoughts around, you know, which jurisdictions would initially make sense for that technology?\n\nConnor Teskey -- Chief Executive Officer\n\nCertainly. So, one of the reasons we love Westinghouse is no matter where nuclear grows, Westinghouse is poised to benefit. If the growth comes from upgrades or life extensions of existing power generation plants, Westinghouse is well-positioned to benefit from that. If the growth comes from new buildout of large-scale nuclear reactors, Westinghouse is exceedingly well=positioned to benefit from that as the supplier of engineering and products to those buildouts.\n\nAnd then, more in the future, as we see more advanced stage nuclear technology focused on SMRs and micro reactors, Westinghouse has the leading micro-reactor technology. And we view them as being in the pole position to capture that market as costs come down and as demand for that technology grows as well. I would highlight that we view that last bucket as being slightly deferred to the other two, maybe three to five years away. But that doesn't mean we aren't tremendously excited about it and excited about Westinghouse's pole position in that space.\n\nOne parallel that I would draw is, as Westinghouse moves to more smaller-scale reactors and potentially micro reactors to service that growing demand, it really lends itself to a lot of the same capabilities that we have within our renewables business, providing power plants that can be contracted directly to an end customer that needs clean energy in a certain region around the world. It has many of the same decentralizations and customer-focused dynamics that are distributed generation business, which is obviously something where we've seen lots of upside and lots of growth in recent years.\n\nDavid Quezada -- Raymond James -- Analyst\n\nExcellent. Thanks for that, Connor. I'll turn it over.\n\nOperator\n\nThank you. Our next question comes from the line of William Grippin with UBS.\n\nWilliam Grippin -- UBS -- Analyst\n\nAll right, great. Thank you very much. So, just my first question, you touched on this earlier, but I was hoping you could provide maybe a bit more color on the investment in the U.S. recycling business.\n\nYou know, what made that an investment there attractive to Brookfield? And then, maybe you could discuss the timing of that transaction, just given the recent sharp decline in recycled commodity values that we've seen.\n\nConnor Teskey -- Chief Executive Officer\n\nCertainly. So, maybe just to take a step back on that investment in particular, why we like it is it has many similar dynamics to development of wind and solar. Obviously, there's a clear decarbonization angle. But really, what the opportunity there is not dissimilar to when we buy a renewables developer.\n\nThis business has an existing asset base, but a very large development pipeline of modular recycling facilities -- material recycling facility, sorry, that they have the potential to build out. Now they will only build out those facilities if they can secure a long-term contract that really derisk the construction and the long-term cash flows of those assets once we build them out. So, once again, a very direct parallel to the investment profile that we're familiar with. And then, secondly, the point that we would reiterate is simply around our ability to increasingly serve our customers' decarbonization needs.\n\nOne thing that we are very, very happy with is the value proposition we have in the United States right now that, quite frankly, for our customers, we think it's tough to match. Whether it's on green energy, now, we can provide green power across any asset type, wind, solar, hydro, or DG, in any region. If it's a customer that has emissions that are tough to abate that want to look to reduce emissions through the use of carbon capture, we can give them that. If it's a customer that has needs for raw materials, and they want to focus on recycled materials as opposed to virgin materials, we now have an avenue to do that as well.\n\nSo, as we think about these new asset classes, it's really about servicing our customers, while executing on the same risk-adjusted return and investment profile that's been very familiar to our business for a number of years.\n\nWilliam Grippin -- UBS -- Analyst\n\nI appreciate that. And just last one for me. I mean, could you speak, you know, broadly to what you're seeing in terms of asset prices for traditional operating renewable energy projects? And have valuations started to come down just to reflect the higher rate environment that we're in?\n\nConnor Teskey -- Chief Executive Officer\n\nWe'll provide a very balanced answer on this. Evaluations have yet to come down for private market transactions. But let's be clear. We fully expect that they will at some point.\n\nYou know, rates can't continue to rise, and valuations stay, you know, cemented where they've been for the last couple of years. So, we're certainly taking that into account. But to date, you know, there's been a number of very recent high-profile transactions in the renewable space. And I think it would be very tough to make an argument that valuations have come down yet.\n\nThe other point that we would highlight is when we think of where we buy or build versus where we think we can sell, that development margin or that operating improvement margin, we haven't seen that shrink. So, even if power or interest rates cause, let's say, the price of long-term contracted operating assets decline a little bit, maybe returns going up a little bit, we are seeing development returns go up a proportionate amount as well. So, we're still capturing the same amount of development margin or improvement margin, which means capital recycling continues to be a very value-accretive way to grow our business.\n\nWilliam Grippin -- UBS -- Analyst\n\nAll right. I appreciate you taking my questions. Thanks very much.\n\nOperator\n\nThank you. And I'm showing no further questions. So, with that, I'll hand the call back over to CEO, Connor Teskey, for any closing remarks.\n\nConnor Teskey -- Chief Executive Officer\n\nGreat. Well, thank you, everyone, for dialing in to today's call. We, as always, appreciate your interest and support of Brookfield Renewable. And we look forward to updating you with our year-end results after the end of Q4.\n\nHave a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nConnor Teskey -- Chief Executive Officer\n\nEsper Nemi -- Vice President, Investments\n\nWyatt Hartley -- Chief Financial Officer\n\nRob Hope -- Scotiabank -- Analyst\n\nSean Steuart -- TD Securities -- Analyst\n\nRupert Merer -- National Bank Financial -- Analyst\n\nDavid Quezada -- Raymond James -- Analyst\n\nWilliam Grippin -- UBS -- Analyst\n\nMore BEP analysis\n\nAll earnings call transcripts"
}