{
  "companyName": "AbCellera Biologics Inc.",
  "companyTicker": "ABCL",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/abcellera-biologics-inc-abcl-q2-2022-earnings-call/",
  "content": "AbCellera Biologics Inc. (ABCL 0.80%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to AbCellera's second quarter 2022 business update and conference call. My name is Lydia, and I'll facilitate the audio portion of today's interactive broadcast. [Operator instructions] At this time, I'd like to turn the call over to Tryn Stimart, AbCellara's chief legal and compliance officer.\n\nTryn Stimart -- Chief Legal and Compliance Officer\n\nThank you. Good afternoon, and welcome to AbCellera's second quarter 2022 business update. We're pleased to have you with us today where we will discuss the results announced in our press release issued after the market closed today, which you can find on our investor relations website. With me on the call are Dr.\n\nCarl Hansen, AbCellera's chief executive officer and president; and Andrew Booth, AbCellar's chief financial officer. The webcast portion of this call contains a slide presentation that we will refer to during the call. If you are following along on the phone and wish to access the slide portion of this presentation, you may do so on the investor relations section of our website. For those who have accessed the streaming portion of the webcast, please be aware that there may be a delay and that you will not be able to post questions via the web.\n\nThe presentation here today may contain forward-looking statements pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Any forward-looking statements are based on management's current expectations and are subject to certain risks and uncertainties. Please review our SEC filings for risk factors that could impact our future performance. Our presentation and SEC filings are available on our investor relations website.\n\nNote that all dollars referred to during our call today are U.S. dollars. Now, I am pleased to turn the call over to Carl Hansen.\n\nCarl Hansen -- Chief Executive Officer and President\n\nThanks, Tryn, and thanks, everyone, for joining us today. It's my pleasure to provide an update on our business for the second quarter of 2022. AbCellera is on rock solid footing. Despite what has been a challenging time for biotech, we believe the current market environment is a strong tailwind for our business.\n\nWe ended the quarter with over $1 billion in cash, cash equivalents and marketable securities, and we are fully funded to continue executing on our strategy and building our business. In contrast, the current environment pose serious challenges, there will be competitors, and we, therefore, expect to extend our competitive advantage. At the same time, well-managed biotech companies must continue to drive innovation, while also prioritizing efficiency and capital preservation. This dynamic reinforces the value of our business model, which empowers them to leverage outside expertise, save time, reduce fixed costs and improve their chances of success.\n\nFinally, rationalization across the industry is likely to result in a consolidation of talent, which will benefit companies that are positioned for growth. We have continued to attract top tier talent, including new CMC and GMP leaders, and we expect to leverage this trend, as we continue to scale our operations and capabilities. AbCellera's purpose is to be a catalyst for the industry by developing technologies that make drug development faster, more efficient and more accessible. There are three foundational steps in drug development.\n\nProduct ideation is the basic biological research that identifies the target and defines the properties required for a therapeutic. Once this is done, the next step is to create therapeutic products. This step of product creation is arguably one of the most complex, regulated and technologically intensive in any sector, and this is also the step that is most critical to get right. And that is because in drug development, unlike any other industry, by far the most time and most money is spent on the third step, which is product testing and validation.\n\nThis involves clinical trials that typically take seven years to 10 years and incur costs in the range of $1 billion. Once the process begins, you're committed. Therefore, if you're going to embark on such an investment of time and capital. It is imperative that you get it right from the start.\n\nWe believe product creation is also the step in drug development that has been most neglected and that this is the place, where our technology can drive the most value. Our long-term strategy is to build a competitive advantage in antibody product creation and to use this advantage to amass a diversified portfolio of stakes in next-generation antibody products. Our business model and investments create significant value in three ways: by making drug development faster by doing things that haven't been done before and by leveling the playing field for partners and expanding the ecosystem of innovators. For example, we believe bringing an antibody treatment for those who need it one year faster than the current industry standard could increase the value of an improved treatment by more than $200 million in net present value.\n\nMoreover, being the first to market could result in larger market share in billions of dollars in additional therapy sales. Similarly, we estimate that opening up new target space and modalities has the potential to unlock market segments that together represent more than $100 billion in opportunity. And finally, removing the need to reinvent the wheel, lowers the barrier to entry and can help small companies compete more effectively. For innovative biotech companies committed to doing drug development at the highest level, this could save them more than a year and tens of millions of dollars at the earliest stages.\n\nAs an example, this quarter, we signed a number of new deals to unlock breakthrough science by collaborating with premier venture capital firms, Versant Ventures and Atlas Ventures. Both of these teams have proven track records in identifying exceptional science and then translating those breakthroughs into exciting and impactful company. We provide these early stage companies with the ability to start discovery immediately and advance programs without having to build the underlying capabilities, teams and infrastructure. This allows them to focus on their innovative science, operate with enhanced capital efficiency and increase the probability of finding an optimal therapeutic candidate.\n\nIn turn, AbCellera benefits from these partnerships by connecting with the very best science, fueling the growth of our diverse portfolio of stakes in next-generation antibody therapy. We also believe we can use our technology advantage to do things that have not been done before. Specifically, I'm excited to update you on our progress in building a panel of CD3 binding antibodies for next-generation T cell engagers, an effort that we first announced in November of last year. As a quick reminder, T cell engagers are bispecific antibodies that guide the immune system to recognize and kill cancer cells by binding both T cells and tumor cells at the same time.\n\nCD3 is a large protein complex found on the surface of T cells and is recognized as a difficult target. As a result, there's only a small number of CD3-targeting antibodies available, which limits the ability to fine-tune T cell activation. Building optimal T cell engagers requires access to a panel of CD3 antibodies that have a broad range of binding properties and the ability to bind to a wide variety of site on the CD3 complex. Using our technology, we believe we have built the industry's largest panel of diverse, high quality and fully human CD3 antibodies that is currently available.\n\nWe presented our data at AACR earlier this year. As an update to this, we have new data showing that our CD3 panel includes more than 200 unique antibodies that bind broadly across multiple sites on the CD3 complex. Our panel also exhibits a broad range of binding affinities, spanning almost three orders of magnitude. As a first demonstration of this panel, we paired different CD3 antibodies with an antibody directed against a model tumor antigen GFR, creating bispecific antibodies for testing.\n\nThese proof-of-concept bispecifics showed that they induced a wide range of T cell activation. And importantly, we identified bispecifics that effectively kill tumor cells with either no or very low cytokine release, suggesting these molecules could overcome key hurdles in the clinic. These data indicate that our CD3 panel is capable of constructing antibodies with a wide range of functional activities, which is exactly what is needed to build tunable, optimized therapeutic T cell engagers. As the next step, we are actively working to demonstrate the application of our platform with a number of different tumor targeting arms, where we are optimizing both arms of the bispecific.\n\nTo date, we've initiated discovery against two well-known tumor antigens, and we anticipate starting work on two or three more before the end of the year. We will be sharing data from these programs, as they become available and believe that doing this work on real-world problems with high commercial potential is critical both to the development and validation of our T cell engager platform. While the primary objective of this work is technology development, the byproduct of these efforts could be bispecific antibodies with the potential to be advanced as best-in-class cancer therapies. This potential for asset generation, as a benefit of technology development is also present in our work in unlocking difficult target classes, including GPCRs and ion channels.\n\nIn either case, for T cell engagers or for difficult targets, our intention is to partner any resulting assets for clinical and commercial development. For that reason, we refer to them as pre-partnered programs, and we will share more information on these as they mature. I would like to highlight that we have previously had assets derived from our technology development efforts. Specifically, our work on platform development for rapid pandemic response is what resulted in the COVID-19 antibodies, which we subsequently partnered with Eli Lilly.\n\nIn this case, we have spent two years developing our technology specifically for pandemic response prior to the emergence of the COVID-19 pandemic, and we initiated our work before entering into a partnership with Eli Lilly. Bamlanivimab was the first antibody to be authorized by the FDA, and bebtelovimab continues to be used to combat the virus remains effective against all known variants of concern and is still the most potent COVID-19 antibody treatment available. The value of assets that can be generated through technology development efforts is illustrated by the 2.5 million doses that have been delivered to patients thus far, saving tens of thousands of lives. In summary, AbCellera is ideally positioned to stay on course and to deliver value for patients, for our partners and for our shareholders.\n\nAnd with that, I'll hand it over to Andrew Booth, our CFO, to provide an overview of our second quarter 2022 financials. Andrew?\n\nAndrew Booth -- Chief Financial Officer\n\nThanks, Carl. I'm pleased to highlight the progress we've made in our key business metrics, beginning with program starts. We started four new programs in the second quarter of 2022, taking us to a cumulative number of 88 program starts. As we've stated previously, we expect the number of starts in the quarter to be somewhat irregular, and we expect the strong underlying number of starts to continue.\n\nThis holds true for the last year. We started 28 programs in the 12 months ended June 30, 2022, compared to 12 programs in the trailing 12 months ended June 30, 2021. For clarity, the program starts reported here do not include the discovery efforts initiated by AbCellera that may lead to the pre-partnered programs that Carl mentioned earlier in the call. We ended the quarter with six new programs under contract, all of which were with two new partners.\n\nThat's a 19% increase in programs under contract as compared to the end of Q2, 2021. With our total of 164 programs under contract, we continue to have a strong book of work. In addition, we entered into a collaboration with Versant Ventures to discover therapeutic antibodies for multiple targets selected by Versant's portfolio of biotech companies. This collaboration builds on previous work between Versant and AbCellera, which has already enabled three of the firm's stealth stage company.\n\nOur business development focus continues to be on high quality programs that are a complement to our existing partnerships and where AbCellera has a strong economic position. Consistent with these objectives, we believe that the partnerships that we've entered into in this last quarter are excellent additions to our portfolio. As we've previously indicated, the total number of programs under contract is a leading indicator of the longer-term trajectory expected for program start. As of June 30, 2022, we continue to report six molecules in the clinic.\n\nFor our molecules at a commercial stage, a U.S. government purchase order for 150,000 doses of bebtelovimab was received and partially fulfilled by our partner, Eli Lilly, during June of 2022. This contributed meaningfully to our Q2 results. In addition, Lilly recently announced that they will begin commercial sales of bebtelovimab to states, hospitals and other healthcare providers starting this month.\n\nWe would expect this arrangement to enable the use of the -- use of bebtelovimab in the future. According to U.S. HHS data, bebtelovimab has recently been administered at an average rate of approximately 4,000 doses per day within the United States. As we've stated in the past, we view the growing list of molecules in the clinic as specific examples of our near and midterm potential revenue from downstream milestone fees and royalty payments in the longer term.\n\nWe expect to see continued strong growth on these key drivers of the business and of shareholder value in the years ahead. Turning to revenue. Our revenue in the quarter was $46 million. Revenues were driven in large part by the $33 million of royalties we earned from shipments of bebtelovimab at the end of the quarter.\n\nResearch fees connected to our work on many programs with a wide range of partners in Q2, 2022 were approximately $13 million, a meaningful increase from the same quarter last year, reflecting the strength of our core discovery activities. Licensing fees were minimal this quarter, and we earned no new milestone payments. Looking ahead to the remainder of 2022, we expect continued strength in research fees and the majority of total 2022 revenue to be derived from royalties on COVID antibodies. Lilly sold and shipped over 670,000 doses of bebtelovimab to the U.S.\n\ngovernment in the first half of 2022. We expect this to reach 750,000 doses cumulatively in Q3 given the current confirmed orders by the U.S. government. The new arrangement of commercial sales by Lilly of bebtelovimab to state hospitals and other healthcare providers starting this month is expected to result in additional royalties to AbCellera, and we will be watching that closely as usage normalizes in the coming months and quarters.\n\nAs a reminder, under our agreement with Lilly, we are entitled to receive royalties in the mid-teens to mid-20s on sales of bebtelovimab. We continue to view COVID royalties, as a non-dilutive source of funding to support our investments in capacity and platform capability building, including investments into forward integration. Turning to our operating expenses. Our research and development expenses for the second quarter were approximately $27 million, a $12 million increase over the previous year.\n\nThe overall increase reflects the ongoing investments into R&D, which will continue to grow as we expand our R&D team's capabilities and capacity. This allows us to deliver our partnered programs, as well as to enhance our capabilities organically. Of note, approximately two-thirds of our R&D efforts are directed at enhancing capabilities and about one-third relates to partner program execution. In sales and marketing, expenses for the quarter were approximately $3 million compared to $1 million in Q2, 2021.\n\nGeneral and administration expenses for the quarter were approximately $14 million compared to approximately $11 million in Q2 of 2021. The increase is largely driven by the need to support the growing business. We are reporting a net loss of approximately $7 million for Q2, 2022 compared to a loss of approximately $2 million in Q2, 2021. In terms of earnings per share, this works out to a loss of $0.02 per share on a basic and diluted basis for the quarter.\n\nThis result reflects the recognition of royalties on bebtelovimab, mostly offsetting our ongoing investments to expand and enhance our discovery platform and to grow our diversified portfolio of long-term stakes in the next generation of antibody drugs, while running discovery efforts for our partners. Looking at cash flow, operating activities for the first six months of 2022 contributed $373 million to cash. This notably includes the collection of the accrued accounts receivable balance from royalties earned in the last quarter of 2021 and the first quarter of 2022. On the investing activity side, the first half of the year shows a total investments of $54 million, largely related to investments in property, plant and equipment, as we continue to build our facility, including those supporting our investments in forward integration into translational sciences, CMC and GMP manufacturing.\n\nAs a part of our treasury strategy, we continue to keep approximately $230 million invested in short-term marketable securities. As a result, we finished the quarter with over $1 billion of unrestricted cash, equivalents and marketable securities. In summary, we remain in an increasingly strong liquidity position that allows us to execute on our strategy, including making material investments to build capacity, capabilities and expand the platform. We believe that we have sufficient liquidity for well beyond the next three years, while making these investments.\n\nAnd with that, we'll be happy to take your questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question today comes from Tiago Fauth of Credit Suisse. Your line is open. Please go ahead.\n\nTiago Fauth -- Credit Suisse -- Analyst\n\nGreat. Thanks for the question and congrats on all the progress. So just wanted to know little bit more detail on the Versant Ventures deal. It's very interesting again, the value proposition for early stage innovators not having to build out some capacities.\n\nIt's a little bit more obvious and accepted. But I think that's a community relative to potential value add to larger biopharmaceutical companies. So any way you can give more context how that transaction came about? I mean talking about a portfolio of companies, different modalities potentially. So is this something that you can actually replicate across other venture capital firms.\n\nIs this something that is worth pursuing more aggressively perhaps at this stage of the existence? So curious about your thoughts there. Thank you.\n\nCarl Hansen -- Chief Executive Officer and President\n\nThanks, Tiago, for the question. Carl Hansen here. Let me start by saying this is a segment of the market that we have been excited about for some time. And I think as per your comments, we see a huge opportunity to use investments in technology centrally along with a partnering business model to allow for the best ideas and the best science to compete on a level playing field and not be held back because of the capital requirements or the operational friction in moving a molecule from an idea through to something that can actually be used in the clinic and hopefully get forward to help treat patients.\n\nIf you'll indulge me an analogy that I like a lot, if you think about the semiconductor industry, where we're at a point now where two innovators with a good idea in a garage can very quickly move that forward and advance it and bring it to the marketplace. And they're able to do that because they can leverage a huge amount of infrastructure that is the foundation on which they can build their innovation. So they focus only on what is unique and essential to their business. The current state of biotech is not like that.\n\nIn biotech, if you have an idea, you need to get right down to the ground level and start to put in place the labs and hire the people, and you're doing that ultimately to bring a single asset forward. And that is incredibly wasteful and it actually holds back innovation to the detriment of those innovators of investors of the biotech community and ultimately, patients. So we think we can solve that by a combination of investments in technology and the business model. Now a challenge with this is that if you look at the number of opportunities, there are a huge number of ideas out there and innovators and scientists and being able to efficiently connect with the very best and have them supported by experienced entrepreneurs and venture capital firms that can bring the people and the operations and the capital to turn those into viable businesses is a very important thing.\n\nSo this engagement with two top tier firms with Versant and with Atlas is very much about that. It's a win-win interaction, where we help them to be more competitive to people that are looking for venture capital investment. We help them to get their ideas off the start line faster and more efficiently. And in turn, we benefit by connecting with science that's already been vetted and with teams that know how to build companies that ultimately create value and bring molecules to the clinic.\n\nTiago Fauth -- Credit Suisse -- Analyst\n\nThat makes sense. Thanks for taking the question.\n\nOperator\n\nNext in the queue today, we have a question from Gaurav Goparaju of Berenberg Capital Markets. Please go ahead.\n\nUnknown speaker -- Berenberg Capital Markets -- Analyst\n\nThis is Ronald. I'm asking from the desk of Gaurav. I just had a few questions regarding the royalties from the COVID antibody, as they're reaching their government in, do you know -- can you tell us like what the next thing is on your radar in terms of pipeline commercialization? And do you know -- are you having an internal calculation of what your commercial royalties will be outside of just the percentage that you have?\n\nAndrew Booth -- Chief Financial Officer\n\nYeah. Hey, Ronald, it's Andrew here. Thanks for the question. Actually, you may have seen a couple of weeks ago, Lilly announced just before their earnings that moving from the U.S.\n\ngovernment purchase orders of bebtelovimab, they are now selling bebtelovimab directly to states in order to make sure that, that product can get through to patients that are needing the COVID antibodies in those states. So we'll no longer be going through the government purchase order mechanism. And I think we'd see this very positively as a way for the supply chain to kind of simplify and maybe be a little bit more the standard way of delivering those products and supply chain to patients that Lilly is familiar with. So I think that is a positive move in terms of getting bebtelovimab, which is the last man standing in terms of its effectiveness against COVID ultimately to the patients that are in need.\n\nUnknown speaker -- Berenberg Capital Markets -- Analyst\n\nOK, thank you for that. Just one last question. You're sitting on -- you had over $1 billion in cash, cash equivalents, marketable securities. Do you have any short-term plans for that?\n\nAndrew Booth -- Chief Financial Officer\n\nYeah, I would say we have long-term plans for the $1 billion we have in cash. And it's not lost of us, of course, the great position we're in to have such a strong balance sheet, especially as we are investing heavily in the capability building of the Company and of the platform. As we've seen in the past, we have consistently been great stewards of capital in growing that investment. And we saw doubling typically our investment in R&D and in sales and marketing year over year.\n\nAnd Q2 was much the same, growing almost 100% over the same period in 2021. In addition, of course, we have very ambitious plans with our investment in the vertical integration through translational sciences, CMC and GMP manufacturing. So that is -- those are the investments in the short -- the immediate and mid and long term that we are pursuing in order to put that capital to work.\n\nUnknown speaker -- Berenberg Capital Markets -- Analyst\n\nAwesome. Thank you so much, and congratulations on a great quarter. Thank you for taking my question.\n\nCarl Hansen -- Chief Executive Officer and President\n\nThanks, Ronald.\n\nOperator\n\nThe next question comes from Puneet Souda of SVB Securities. Your line is open.\n\nPuneet Souda -- SVB Leerink -- Analyst\n\nYeah. Hi, Carl, Andrew. Thanks for taking the question. So a couple from my end.\n\nJust wanted to understand the first a bit about the pre-partner programs. Andrew, maybe you can -- can you qualify maybe an expense for these -- for pre-partner programs and sort of what sort of investment that they require? And maybe just give us a -- give us a sense of what -- despite the early days, what sort of investment that you expect here? And duration of that? And then how broad are these pre-partner programs are going to be across sort of the different therapeutic categories or whatnot? And then ultimately, this is something that is routinely done by your clients, not necessarily AbCellera. So just wondering what is the long-term objective here? Is this something that you would want to develop a molecule or a drug that you would want to develop yourself?\n\nAndrew Booth -- Chief Financial Officer\n\nYeah. Hey, Puneet, good to hear from you. I'll take the first part of that question regarding the expense, and then I'll pass it over to Carl to talk about the breadth of the -- what we'll be working on. So of course, as Carl mentioned in his remarks, the emphasis here is on technology development, and those are the efforts that we're spending in our R&D.\n\nI did mention that two-thirds of our efforts and our expense in R&D is on capability and platform building and that these sort of pre-partnered assets are the benefits that result from having to work on real things to make sure that your technology development is actually achieving ultimately the goals that you're aiming to prove out in terms of speed of being able to find antibodies, being able to find antibodies that previously had been intractable and also making those investments to prevent smaller companies from having to rebuild the wheel and be more competitive. So in terms of the added expense, I think those expenditures in R&D are already included in kind of our base business model, and that's just a -- this benefit of having assets pop out of those investments are just something that we are benefiting from these investments. And in terms of the breadth and depth of that, I'll let Carl comment on that.\n\nCarl Hansen -- Chief Executive Officer and President\n\nSure. Yes, so maybe I'll just back up to a higher level here and revisit what is the strategy, and where we see the pre-partner programs coming from. So we have set out to be the Company that invest in technologies that allow for us to do discovery at greater speed and higher quality at greater scale that's been done before. And another very important dimension is to push back the frontier of what's possible and open up new opportunities for new modalities and new target classes.\n\nSo in order to do that, that means that we are launching on to technology development efforts, where we're trying to solve big, hard problems to have the potential not to bring one asset forward, but to open up entire classes. So right now, the two areas that we're focused on are in T cell engagers, where if we can demonstrate, and we believe we're on track to do that, that the combination of OrthoMab and CD3 can generate quickly T cell engagers with better properties, more suited for therapeutic development. There are dozens of potential targets that can be connected with. Similarly, on the difficult target space ion channels and GPCRs, if you went to Google and you did a quick search, you would quickly come up with dozens of targets that have the potential to be first-in-class blockbuster therapies that address severe and unmet medical needs.\n\nSo that's what the big prize is. Now when you're working on that, you need to work on real problems, and as we make progress against the technology hurdles, you will have, through that work, develop assets that are valuable and that need to be brought forward into development. Our strategy is to be focused on the technology and the capability building and then to do that by partnering before those costs get large with companies that are better positioned, frankly by clinical development and commercial development. So I know when that happens, that everyone will be focused on the assets and they'll be very excited about that.\n\nFor us, what's most exciting is that once you've done it once, it's likely you're going to be able to do it again and again and again. So the three things that we really want to get out of this is, first, open up these new therapeutic opportunities. Second, prove to people, again, and we have done this before, that our investments in technology are having an ROI and allowing us to succeed, where others have failed. And third, of course, bring forward assets that I believe our partners will be excited to take on, and they will see it as though we have opened up opportunities and anticipated needs.\n\nPuneet Souda -- SVB Leerink -- Analyst\n\nGot it. That's super helpful. And in terms of the metrics around these pre-partner programs and the data releases, how should we think about that? And then maybe just on the bispecific data, what conferences sort of you're targeting there? And then just I have one more follow-up.\n\nCarl Hansen -- Chief Executive Officer and President\n\nSure. So in terms of data release and metrics, so we're currently not included in anything related to pre-partnered programs or this technology development effort in program starts. We -- one of the advantages of doing this work is that we will have the data, and we're not nearly as constrained as we normally are in terms of confidentiality in sharing this with the public and having people have a sense of what is possible with the platform. So as these programs advance and they get to the point, where we believe we've made a meaningful advance toward the end goal of actually developing the therapeutic, then we will bring those forward on quarterly calls, at scientific presentations, wherever -- or perhaps in publications, wherever it's appropriate.\n\nIt's difficult -- I know you're going to ask me, it's difficult to predict the timing of that because these are difficult problems we're trying to solve. That said, we're excited by the progress we're making, both on the T cell front and on the difficult targets. And we are hopeful that we'll have all things -- if things line up well, we'll have meaningful results to share within the next 12 months or so. In terms of the T cell engager work, we are looking to present this at some conferences in the relatively near future.\n\nThus far, we don't have confirmation. So I'll have to wait before I can share that detail with you.\n\nPuneet Souda -- SVB Leerink -- Analyst\n\nOK. And then last one, if I could. If you don't mind, if I could just squeeze in one last one around. We get a lot of questions from investors around small biotech exposure that the companies have.\n\nObviously, you have a number of VC projects and early stage projects. Can you maybe just give us a sense of what's the exposure here for contracts? Or what's the exposure for small early stage biotech that you have versus the larger biopharma within your contract -- total contracts. Obviously, you have a number of VC projects ongoing, too. So it seems like that could -- that number could increase.\n\nThanks so much.\n\nCarl Hansen -- Chief Executive Officer and President\n\nSure. Yes. I'm pretty I'm happy to answer that. I think on a previous call, I don't remember which one, we did present some details of our portfolio in terms of programs under contract.\n\nWithin that presentation, there was a breakdown in terms of deals with biotech or with partners, we would characterize as large pharma. Roughly a quarter to a third of programs under contract are with the large integrated pharma companies, which, of course, means, let's say, 60% to 75% are with biotech companies. That pool of biotech companies spans the gamut from companies that are right out of the gate. Companies like the ones we are working with already with these Venture Capital Groups, but up to more mature publicly traded small mid-cap biotech companies.\n\nIncidentally, that breakdown is largely in line with what we believe to be the distribution of program starts across the sector. And the same could be said about indication. So we seem to have a portfolio that is broadly reflecting the sector. Thus far, we don't see a trend of it tipping, but of course, that could change over time.\n\nPuneet Souda -- SVB Leerink -- Analyst\n\nThanks for taking the questions.\n\nOperator\n\nOur next question comes from Stephen Willey of Stifel. Your line is open. Please go ahead.\n\nStephen Willey -- Stifel Financial Corp. -- Analyst\n\nYeah. Good afternoon. Thanks for taking the questions and congrats on the progress. Maybe just following up on the bispecific side.\n\nMaybe just curious if you can speak to whether or not these two known tumor antigens that you've initiated work on? Are these geared toward hematological or solid tumors? And I guess, if the latter, do you feel like valency is also going to be kind of incorporated into the interrogative process here to try to minimize CRS and maybe improve safety tolerability and just off-target exposure?\n\nCarl Hansen -- Chief Executive Officer and President\n\nThanks, Steve. Carl here. I'm happy to take that. So the first two programs we've initiated are not directed toward hematology, they are toward solid tumors.\n\nWe see that as the big challenge and the big prize. And honestly, where the biggest unmet need is right now. In terms of thinking about valency, we are using the OrthoMab platform. This is a platform that allows us to use our CD3 panel and binders on the tumor antigens in a variety of different formats, including one by one, it looks like an IgG, two by one, two by two.\n\nSo we are investigating that. That said, we also believe and we've got evidence thus far from the characterization we've done that a lot of the effects that you are -- that you are alluding to, can be achieved if you've got the right binder, the right affinity, the right epitope. So we would see format as one of the ways that you can change the functional properties of the bispecific, but it's not the only one. And given the breadth of CD3 and the flexibility of the platform, we've got a lot of options at our disposal to look at.\n\nStephen Willey -- Stifel Financial Corp. -- Analyst\n\nOK, that's helpful. And I'm not sure what you can say regarding this transition of bebtelovimab from government purchasing to more of a Lilly led distribution channel. But do we know anything about kind of where they currently are with manufacturing capacity? And just whether or not they've indicated whether to you or I guess in any public forum, as to whether or not they intend to keep manufacturing here and kind of the on mode.\n\nAndrew Booth -- Chief Financial Officer\n\nYeah. Hey, Steve, it's Andrew here. So we don't have a lot of extra details about this. This is probably much better a question for Lilly.\n\nWhat we can point people toward, and I mentioned it in my prepared remarks is the HHS data that we see, which gets updated on a weekly basis, over the last number of weeks, quite consistently has been averaging doses administrative of 4,000 doses per day. So we would imagine that, that would continue, but we -- that's the public data that we have to work from. So I think from a manufacturing standpoint, we don't have any insight, but I would point to the fact that due to bebtelovimab's potency, it's quite a low dose that is required. So the manufacturing effort is not too onerous, which I think it's still 175 milligrams per dose.\n\nSo hopefully, that would mean that the manufacturing capacity that they have would stretch a long way in terms of benefiting a lot of patients out there, who are still contracting COVID, as you know.\n\nStephen Willey -- Stifel Financial Corp. -- Analyst\n\nUnderstood. Thanks for taking the question.\n\nOperator\n\nOur next question comes from Gary Nachman of BMO Capital Markets. Your line is open.\n\nGary Nachman -- BMO Capital Markets -- Analyst\n\nGreat. Thanks. Good afternoon. So the six new programs under contract with two new partners, Atlas and one undisclosed, and then also the Versant deal.\n\nJust talk about the economics with those new partnerships if these are higher value arrangements. I'm assuming they are and how you set them up? And I'm curious if there are a lot more VC deals out there to come. How big is that universe for you?\n\nAndrew Booth -- Chief Financial Officer\n\nYeah. Hey, Gary, good to hear from you. So yes, the six programs under contract, well, with Atlas and then undisclosed partner, but as you point out, with Versant another eight programs that was in the press release and as well in the prepared remarks. I think that we don't disclose, of course, the economic terms of any of our partnerships.\n\nSo I think the last time and what we will do, I think, consistently on an annualized basis is kind of in aggregate, show what the terms are from the previous year, and we did that most recently in our 10-K. We do see we're adding quite a bit of value, and we're being quite judicious about the programs we are bringing out under contract. And I think thus far in 2022, we're behaving quite consistent to our previous strategy of how we've articulated that. I do think that there is a good market to go to where our offering will be quite attractive to these venture capital funds.\n\nAnd I think Carl may have a few more words to say about how attractive and the prospects we see there.\n\nCarl Hansen -- Chief Executive Officer and President\n\nYes. Hi, Gary. Carl here. First, maybe just a comment on sort of the big picture.\n\nIf you look over the last decade or perhaps a bit more, one of the things that has become very apparent is that the large majority of new programs or new therapeutics are actually originating in biotech. So biotech is a rich source of innovation. One of the reasons is that it is distributed, there's lots of ideas, lots of things that are being attempted. The other side of that is that our research shows that if you looked at the total number of therapeutic antibody starts administered in any given year, roughly 50% of that comes from relatively small biotech companies.\n\nSo that's a big part of the market. Of course, it's important that you're able to find the best programs and also assemble the teams around it, and that's why this engagement with Versant and Atlas and other like firms. I think there's potential. There is synergistic and has the potential to really create some value, not just for us for the investors and for the companies.\n\nThe last thing I'll say is that starting companies in the antibody space historically has a goal to do. And one of the reasons is that the complexity of doing the discovery of characterizing of doing the development work and ultimately manufacturing, a therapeutic antibody presents a very formidable hurdle for a new company. Internally, we've done some analysis, and you can quickly convince yourself that when you have to rebuild all of that, even if it is a good idea, could mean that it would stand up to the same probabilities of success that have traditionally been seeing in the industry, it may not be a viable investment opportunity. When instead, you take that idea and you connect it with infrastructure and capability and expertise that is already in place, you shorten the time lines and you reduce the capital needs and you make that opportunity now a viable investment.\n\nSo from that perspective, it is our hope and it is our belief that this type of deal can actually expand the universe of companies and ideas that people have been and hopefully make it through to be therapeutics.\n\nGary Nachman -- BMO Capital Markets -- Analyst\n\nOK, great. It's helpful. And then, Carl, just on the six molecules in the clinic, anything more you can say on those that the types of studies being run therapeutic areas, when we might see some clinical data? Any sense on that? And then I have one more?\n\nCarl Hansen -- Chief Executive Officer and President\n\nNo, Gary. Obviously, the molecules that are in the clinic are under -- are being driven by our partners. And so we would -- we refer you to them to get updates and when you expect to have the results from various trials. Many of these are still quite early.\n\nSo I think we're a ways off before they get to the pivotal trial.\n\nGary Nachman -- BMO Capital Markets -- Analyst\n\nOK. And then Andrew, I appreciate your comments before just on bebtelovimab and Lilly strategy. But I mean, should we assume -- it's obviously hard for us to model this going forward as it is for you right now, we could look at the average number of doses per day. But assuming also, there'll be a pricing benefit when they go through the commercial channel, is that a reasonable assumption?\n\nAndrew Booth -- Chief Financial Officer\n\nYeah, I think as you point out, Gary, it's tough for us to model as well. So trust me, we're quite sympathetic to that. We view it, of course, as upside and non-dilutive funding to allow us to continue our investment as we, I think, have said quite consistently. On the pricing, previously, the government purchase orders were at about $1,800 a dose for the -- for bebtelovimab.\n\nWe noticed in the recent release that the new pricing is at $2,100 a dose for how doses are going out under this new commercial arrangement through -- with Eli Lilly selling directly to states. So that's just another data point that we've also seen in the publicly available information.\n\nGary Nachman -- BMO Capital Markets -- Analyst\n\nOK, that's very helpful. Thank you.\n\nOperator\n\nOur next question today comes from Do Kim of Piper Sandler. Please go ahead.\n\nDo Kim -- Piper Sandler -- Analyst\n\nHi. Thanks for taking my question. So I just want to go back to Carl's comment on the current biotech market environment, having potential tailwinds to AbCellera. But as you look at your partnered programs that are past discovery and in preclinical studies, have you observed any slowdown or pause in development of these programs by the partner.\n\nWe're seeing small-cap biotech looking to cut cost or reduce cost, having to just slow down the development of preclinical programs. I'm just wondering if you're seeing the same.\n\nCarl Hansen -- Chief Executive Officer and President\n\nHi, Do. Carl here. With the caveat that, of course, we're relatively early in this current market. I'd say that we haven't seen any indication of that whatsoever.\n\nAnd I don't think that I really anticipate that for a few reasons. One is, by and large, we have managed to partner with very high quality firms. And even in a bear market, the high quality firms are going to be able to access capital and make sure that they are moving their programs forward. For the smaller companies, biotech, the last thing that you compromise is the one asset that you're moving forward.\n\nSo people prioritize these. And thus far, we've seen no indication that's going to be an issue. Of course, even if that does happen, and as a general comment, if there are smaller companies that are moving forward with assets that are promising, but the companies are required for some reason to slow down operations, it's typical that those will be picked up by larger companies in the space. And so in biotech, good, high quality assets ultimately find their way to the bigger companies that are well positioned to do the late stage trials in the commercial development.\n\nDo Kim -- Piper Sandler -- Analyst\n\nGreat. That's helpful. And a question on the VC partnerships? I know you can't say much about the deal economics, but was getting equity in the start-up companies, the VC-backed biotechs ever are on the table. Is this something that you guys look for? I imagine that it could be a potential option for these start-ups with just low starting capital?\n\nCarl Hansen -- Chief Executive Officer and President\n\nWe have done some deals in the past with early stage companies, where we do have an equity position. We haven't disclosed all of the -- all the terms associated with these particular deals. But I feel safe to say it's not an equity-based deal. It's more like our standard discovery agreement.\n\nAnd that doesn't mean that, that we might not be open to that in some special cases, but it's not our line of business to be building equity positions. We're much more focused on building a portfolio of royalty positions and stakes in the actual molecules.\n\nDo Kim -- Piper Sandler -- Analyst\n\nOK, thank you. Thanks for taking my questions. \n\nOperator\n\n[Operator instructions] Our next question comes from Antonia Borovina of Bloom Burton. Please go ahead.\n\nAntonia Borovina -- Bloom Burton -- Analyst\n\nHi. Good afternoon. My first question is just related to your program starts, and I know that you mentioned before that those can be lumpy and quite variable from quarter to quarter, but the last two quarters, they have been a bit lighter than we were anticipating. So I just want to clarify that, that's just a timing thing and that there weren't any delays or capacity constraints that impacted the number of programs you could start in the second quarter? And also whether you're anticipating an acceleration in program starts in the second half of the year?\n\nAndrew Booth -- Chief Financial Officer\n\nHey, Antonia. It's Andrew here. Good question. Certainly, the reason that we indicate and the reason I presented in my prepared remarks, the trailing 12 months is because as you point out, this is expected to be somewhat irregular or lumpy.\n\nWe have not had any issues related to our capacity in terms of addressing program starts whatsoever. So I think we are seeing great benefits from our increases in investments on the capacity and capabilities of the team. Remember as well on that -- in that same -- along that same theme, every program that we do -- we tend to take on more and more work as we add capabilities on behalf of our partners. We also reflect that in our -- where we see that in the capability and capacity that we're building.\n\nWe're -- this is not indicative of a slowdown, I think, I would say, for the second quarter, but we do expect the irregularity of this and why we will probably continue to state it on a trailing 12-month basis rather than on a trailing six months or certainly a quarter over quarter.\n\nAntonia Borovina -- Bloom Burton -- Analyst\n\nOK, thanks. And then if I could just one follow-up. I wanted to clarify regarding your BiTE platform. Have you made this platform available to potential partners yet? Or have you primarily focused on proving it out with your pre-partnered program?\n\nCarl Hansen -- Chief Executive Officer and President\n\nCarl here. I'll take that one. So I think you're referring to our bispecific T cell engager platform, which is related to BiTEs, but it's not a BiTE platform. I just wanted to make sure we're clear on that.\n\nSo we have -- we launched this in November. That was starting from ground zero. To date, we have built up the CD3 panel. We have conducted a series, I'd say, a comprehensive set of experiments to characterize that panel and believe it is best in world in many dimensions, including diversity and cross-reactivity functional properties.\n\nWhat we need to do now is to prove that out against a series of antigens that are of commercial interest and that people are -- will recognize as creating value. So we're doing that internally. At the same time, we have been engaging in business development discussions with a variety of groups to start to access that panel. I'd say those discussions are going very well, and we've seen a great deal of interest.\n\nI've actually been surprised by a lot of interest. But we're still working through those. And it's not -- we don't have a time line for when we might be engaging on having other people access that platform just yet.\n\nOperator\n\nWe have no further questions in the queue. So I'll hand the call back over to Carl Hansen for closing remarks.\n\nCarl Hansen -- Chief Executive Officer and President\n\nGreat. Thank you, everyone, for joining us today. It's been an exciting time for AbCellera, and we look forward to providing further updates on future calls.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTryn Stimart -- Chief Legal and Compliance Officer\n\nCarl Hansen -- Chief Executive Officer and President\n\nAndrew Booth -- Chief Financial Officer\n\nTiago Fauth -- Credit Suisse -- Analyst\n\nUnknown speaker -- Berenberg Capital Markets -- Analyst\n\nPuneet Souda -- SVB Leerink -- Analyst\n\nStephen Willey -- Stifel Financial Corp. -- Analyst\n\nGary Nachman -- BMO Capital Markets -- Analyst\n\nDo Kim -- Piper Sandler -- Analyst\n\nAntonia Borovina -- Bloom Burton -- Analyst\n\nMore ABCL analysis\n\nAll earnings call transcripts"
}