{
  "companyName": "Lam Research",
  "companyTicker": "LRCX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/19/lam-research-lrcx-q3-2022-earnings-call-transcript/",
  "content": "Lam Research (LRCX -0.07%)\nQ3 2022 Earnings Call\nOct 19, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and welcome to the Lam Research September 2022 quarter earnings conference call. At this time, I would like to turn the conference over to Ms. Tina Correia. Please go ahead, ma'am.\n\nTina Correia -- Corporate Vice President, Corporate Finance and Investor RelationsP\n\nThank you, operator, and good afternoon, everyone. Welcome to the Lam Research quarterly earnings conference call. With me today are Tim Archer, president and chief executive officer; and Doug Bettinger, executive vice president and chief financial officer. During today's call, we will share our overview on the business environment, and we'll review our financial results for the September 2022 quarter and our outlook for the December 2022 quarter.\n\nA press release detailing our financial results was distributed a little after 1:00 p.m. Pacific Time this afternoon. The release can also be found on the Investor Relations section of the company's website, along with the presentation slides that accompany today's call. Today's presentation and Q&A include forward-looking statements that are subject to risks and uncertainties reflected in the risk factors disclosed in our SEC public filings.\n\nPlease see accompanying slides in the presentation for additional information. Today's discussion of our financial results will be presented on a non-GAAP financial basis, unless otherwise specified. A detailed reconciliation between GAAP and non-GAAP results can be found in the accompanying slides in the presentation. This call is scheduled to last until 3:00 p.m.\n\nPacific Time. A replay of this call will be made available later this afternoon on our website. And with that, I'll hand the call over to Tim.\n\nTim Archer -- President and Chief Executive Officer\n\nThank you, Tina, and thank you to everyone joining the call today. Our September quarter results reflect continued strong execution by Lam, with revenues topping $5 billion for the first time in the company's history. Gross margins came in at the higher end of guidance and operating margin and earnings per share both exceeded the guidance range. As you can see from our press release today, we also expect solid performance in the December quarter despite the challenging environment.\n\nRecently, the United States government announced new export regulations for U.S. semiconductor technology sold in China, including wafer fabrication equipment and related parts and services. We have taken the necessary steps to ensure full compliance with the rules and have ceased shipments and support as required. Our financial guidance issued today for the December quarter includes the impact of these changes.\n\nFor calendar year 2023, we estimate the total revenue impact from these restrictions to be in the range of $2 billion to $2.5 billion. Turning to the broader demand picture. We see wafer fabrication equipment spending in calendar year 2022 in the low $90 billion range. This outlook includes the impact of new China-related restrictions and lower demand partially offset by improving supply chain conditions.\n\nAs some of our customers have indicated recently, there has been a rapid deterioration in demand fundamentals, particularly within the Memory segments. Customers are adjusting investment plans into next year to bring channel inventories down to more normalized levels. As a result, we see memory bit shipments tracking below end demand for the next few quarters. In our normal cadence, we would provide our first view of 2023 WFE on our January earnings call.\n\nHowever, given the current environment, today, we are providing our preliminary estimate for calendar year 2023. Inclusive of the China restrictions, we expect next year's WFE to be down more than 20% with Memory investments accounting for a large portion of that decline. We will provide more detailed color on our outlook in our next earnings call. But for now, we believe that customer actions to reduce memory bit supply growth will create a favorable setup for memory mix to increase as a percent of overall WFE beyond 2023.\n\nAs these cyclical adjustments play out, the structural factors supporting a long-term WFE growth remain unchanged. These include expanding semiconductor content in end devices, rising device complexity and larger die sizes. These factors create tremendous opportunity for Lam as they require greater etch and deposition intensity to enable higher performance and more scalable device architectures, including the transition to 3D structures. To ensure we are best positioned to win long term, we are focused on three key strategies: first, continue to demonstrate our commitment to customer success by ensuring that the rapidly growing installed base of Lam tools at our customers is operating at maximum efficiency; second, be a trusted R&D partner for our customers by sustaining our investment in the technology development that is most critical to their long-term device scaling road maps; and third, accelerate innovation and deepen our customer and supply chain partnerships by fully leveraging Lam's recently expanded global R&D and manufacturing infrastructure.\n\nOur installed base is now approaching 80,000 chambers in the field. This is over 30% higher than in the 2019 memory-related pullback in WFE. Lam's growing installed base continues to drive strong performance in our CSBG business, which hit another record in the September quarter with approximately $1.9 billion in revenue. While we won't hit new records every quarter, our installed base has become ever more important to our business model, particularly in WFE spending downturns.\n\nDuring such times, customers can continue to advance their technology while optimizing capital efficiency through upgrades to their existing tools. We are also engaging with customers to find other efficiencies, including yield enhancement. An example of the opportunity this creates can be seen in our Coronus product line. Lam's Coronus double etch process is employed by customers to help prevent process-related defects, which can impair cost per bit scaling.\n\nAs a result, we have seen a steady increase in the number of bevel edge passes used at each successive NAND technology node. Another opportunity to help drive efficiency can be found in the enormous volume of equipment and process data being generated from our large and growing installed base. Together with customers, we are using key learnings to deliver services and upgrades that positively impact our customers' operations. For example, we recently deployed Equipment Intelligence Services to support new equipment installation at a large memory manufacturer.\n\nUsing these capabilities, we were able to shorten the time to release tools to production by more than 20%. While the near-term demand dynamics warrant an increased focus on operational efficiencies, the strong pull for technology advancement from our customers and the growth opportunity it creates for Lam continues. We made solid progress in the September quarter with key technology wins across multiple customers. For example, our ability to deposit critical films to lower device capacitance and improved lithography overlay performance led to wins for these layers at a leading DRAM customer.\n\nFor both applications, we leverage learning from our 3D NAND leadership position, as well as ecosystem partnerships to bring innovative and cost-effective solutions to our DRAM customers. In foundry logic, we secured multiple new ALD application wins at a key customer by delivering purpose modifications and film characteristics required for building and integrating gate-all-around structures. Whether it's our focus on operational efficiency or our collaboration on advanced technology, we believe our long-term success will be rooted in an R&D and manufacturing infrastructure close to our customers, close to our ecosystem partners and with access to world-class talent. Consequently, over the past two years, we have made strategic investments to expand our global footprint, including the addition of a manufacturing facility in Malaysia, an R&D lab in Korea and just last month, the opening of Lam's India Center for Engineering in Bengaluru.\n\nThis center is a valuable addition to our global Lam network, specializing in the design and testing of hardware and software used across our product lines. So overall, I am pleased with how we are continuing to strengthen our foundation in technology, manufacturing and service. This foundation puts us in a very good position to both navigate the current cyclical dynamics and emerge stronger as we look to capture the exciting opportunities we see over time in the semiconductor industry. Thank you again for joining today.\n\nAnd I'll now turn the call over to Doug.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nExcellent. Thanks, Tim. Good afternoon, everyone, and thank you for joining our call today. Lam delivered solid results in the September quarter with record levels of performance across multiple metrics, including revenue, operating income and earnings per share.\n\nThe September financials reflect our focus on operational excellence and our ability to deliver and meet the needs of our customers in a dynamic industry environment. Revenue in the September quarter crossed the $5 billion mark for the first time in our history, coming in at approximately $5.1 billion. We continue to ramp output levels, delivering nearly 10% revenue growth over the prior quarter. Supply chain issues have begun to ease somewhat.\n\nThey have not gone away completely, however. We continue to deal with certain inflationary pressures, as well as output constraints. Deferred revenue was $2.8 billion and grew in the September quarter by approximately $550 million. This growth was primarily due to customer cash and advanced deposits followed by the timing of shipments on outstanding orders.\n\nWith macro conditions weakening and wafer fab equipment spending declining, I expect deferred revenue and backlog levels will come down as we exit the December quarter. I'll provide more information regarding our December guidance and focus for calendar year 2023 later in my scripted remarks. Let me now turn to the segment details for the September quarter. Memory represented 52% of systems revenue, which was slightly down from the prior quarter level of 54%.\n\nIncluded in Memory, the NAND segment represented 39% of systems revenue compared to 40% in the prior quarter. We see capacity adds and conversions occurring by NAND customers mainly for 192-layer class devices. The DRAM segment concentration was consistent with the prior quarter coming in at 13% of system revenues compared to 14% in the June quarter. The DRAM investments were primarily for 1Z and 1-alpha node conversions.\n\nFoundry reinvestments were respectable in the September quarter, comprising 34% of our system revenues, reaching a record level from a dollar standpoint. The increase in the quarter from the June quarter concentration of 26% as a result of the continued strength in investments for both the leading and mature node devices across a myriad of customers. These investments are supporting areas such as AI, IoT, cloud, automotive and 5G. The Logic and Other segment contributed 14% of systems revenue in the September quarter compared with 20% in the prior quarter.\n\nI'll remind you that we had record results in this segment in the June quarter, and we continue to have positive momentum in the Logic segment. Our customer base here is investing in microprocessors, image sensors, as well as advanced packaging solutions. I'll now turn to the regional composition of our total revenue. The China region came in at 30% of the total, relatively flat with the prior quarter level of 31%.\n\nThe China September revenue was more concentrated toward the domestic Chinese customer base. And as Tim discussed, we now have additional restrictions for certain domestic Chinese customers and expect the revenue in this region will be significantly lower as we go into next year. The Taiwan region increased to a concentration of 22% in September versus 19% in the June quarter. Korea decreased to 17% of our total revenue from 24% in prior quarter.\n\nI expect these two regions to continue to be strong for us based on the plans of our customers in those regions. The customer support business group results were strong in the September quarter. Revenue here reached a record of nearly $1.9 billion, which was up 16% from the June quarter and 37% higher than the September quarter in calendar 2021. All parts of the CSBG business delivered good performance in the quarter.\n\nNotably, the Reliant and spares product line revenues were at record levels. Reliant was the biggest contributor to the sequential growth in September. As we've noted in the past, CSBG revenues will fluctuate on a quarterly basis. While the macro setup creates the likelihood of a decline in trailing edge demand, the strength of our installed base and value-added services provide a platform to offset potentially softer specialty WFE spending.\n\nWe do believe, nonetheless, that the specialty segment will weather next year relatively better than WFE in total. Moving to gross margin. The September quarter came in at 46% at the high end of our guided range and an increase from June's gross margin of 45.2%. We benefited from higher output levels, as well as favorable customer and product mix.\n\nWe do continue to have cost pressures in freight and logistics, as well as in certain raw material areas like semiconductors. I see headwinds coming in our December quarter related to customer mix, which I'll talk to when I address our guidance. Operating expenses for the September quarter were $647 million, up from the prior quarter amount of $635 million. The increase in spending was in R&D, which comprised nearly 68% of our spending, which was a high water concentration level for the company.\n\nWe're focused on supporting our customers' manufacturing plans for both the short and long term and investing with those objectives in mind. We're committed to managing spending next year as we see a decline in calendar year 2023 wafer fab equipment spending, which will obviously negatively impact our revenue levels. The September operating margin was 33.3% and was over the guidance range due to the higher levels of revenue and improved gross margin. Our non-GAAP tax rate for the quarter was 13.8%, slightly higher than expected due to the geographic mix of income, coupled with the impact of the required U.S.\n\nR&D capitalization rules. Our estimate for the December 2022 quarter and for 2023 is for the tax rate to be in the low to mid-teens level. Please note, this estimate does not reflect the impact of any potential U.S. and global tax policy changes being considered.\n\nThe minimum tax provisions of the Inflation Reduction Act are not effective for us until the second half of calendar year 2023, which is our 2024 fiscal year. We do not expect any meaningful impact to our tax rate related to this policy change, however. And also, as a reminder, as we've discussed in the past, you should expect the tax rate to fluctuate from quarter to quarter. Other income and expense came in for the quarter at $30 million in expense.\n\nThis was an expected decrease, compared with the $87 million of expense in the June quarter. I'll just remind you that we incurred a loss related to market declines in one of our venture investments last quarter. We have now liquidated that position. Other expense in the September quarter was a little bit better than we expected, mainly because of higher interest rates on an increasing cash balance and slightly favorable foreign exchange impacts.\n\nThe OI&E P&L line item is subject to market-related fluctuations that will cause some level of volatility to the items such as foreign exchange, as well as impacts from the equity markets. From a capital return perspective, we allocated approximately $105 million to share repurchases during the September quarter. The cash was deployed in open market repurchases. The ASR from the June quarter also continued to execute in the September quarter.\n\nWe paid $206 million in dividends during the quarter. And just to remind you, we continue to target returning 75% to 100% of our free cash flow as our long-term capital return plan. September quarter diluted earnings per share came in at $10.42, which was above our guided range because of the strong revenue and improved profitability performance that I spoke about. Diluted share count was 137 million shares, which was lower than the June quarter and was in line with September quarter expectations.\n\nLet me now pivot to the balance sheet. Cash and short-term investments, including restricted cash, totaled $4.6 billion, which was up from the prior quarter level of $3.9 billion. We generated solid cash from operations in the September quarter of $1.2 billion, which was partially offset by the share repurchases and dividend payments. Inventory turns were consistent with the prior quarter level, coming in at 2.5 times.\n\nDays sales outstanding was 82 days, which was a slight decrease from the 85 days in the June quarter. Noncash expenses for the September quarter included approximately $71 million for equity comp, $64 million for depreciation and $12 million for amortization. Capital expenditures for the September quarter were $140 million, a little bit higher than June, which was $126 million. Capital expenditures are supporting growth in manufacturing facilities in the United States and Malaysia.\n\nAdditionally, we're investing in research and development infrastructure in California and Oregon, as well as our new technology centers in Korea and India. We ended the September quarter with approximately 18,700 regular full-time employees, which is an increase of approximately 1,000 people from the prior quarter. We had headcount growth primarily in the factory and field organizations and some in R&D to address higher output levels, to manage the supply chain constraints and to support customer deliveries and installations. We've decided to slow down hiring to only critical positions as we assess the business trajectory going into 2023.\n\nOverall, we're executing well in the short term while we plan to prudently manage the business for a down WFE year in calendar year 2023. I'll remind you that we know how to manage this business during a down cycle. Our operating model has been constructed and tested for many years in different business environments. With that backdrop, I'll provide our non-GAAP guidance for the December 2022 quarter.\n\nWe are expecting revenue of $5.1 billion, plus or minus $300 million. This includes our current estimate of the impact of new regulations on our ability to supply products and services to certain customers in China. This revenue guidance would have been decently higher if not for these new regulations. Gross margin of 44.5%, plus or minus 1 percentage point.\n\nThis is down from the September quarter, primarily due to customer mix. We have lost more profitable business from the China region. Operating margins of 31.5%, plus or minus 1 percentage point; and finally, earnings per share of $10 even, plus or minus $0.75 based on a share count of approximately 136 million shares. So let me just wrap it up.\n\nThroughout 2022, we've demonstrated the ability to deliver record financial performance and profitable growth. It's been a year of volatile supply chain constraints, inflationary pressures and regulatory changes. We're confident we're prepared for the challenges we see in the industry in calendar 2023, and we built a solid foundation for continued success, evidenced in our technology leadership and robust installed base. Operator, that concludes my prepared remarks.\n\nTim and I would now like to open up the call for questions.\n\nOperator\n\nThank you, sir. [Operator instructions] We will take the first question on the queue from Timothy Arcuri. Your line is open. Please go ahead.\n\nJason Park -- UBS -- Analyst\n\nHi. Thanks a lot. This is Jason on for Tim from UBS. I just have a couple of questions.\n\nSo my first question is on your December guidance. You just guided the deferred revenue to come down. So I was just curious whether you can quantify for us how much of excess deferred revenue you're realizing and contemplating into your December guide. Then I have a follow-up.\n\nThanks.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nYeah, I'm not sure I completely heard you. I think you asked what we think deferred revenue in December is going to do. And all I'm going to tell you is I expect it to go down. I'm not going to quantify it for you.\n\nJason Park -- UBS -- Analyst\n\nGot it. Thanks a lot. Yeah. So my second question is on the gross margin for the same quarter.\n\nCould you please quantify how much of a headwind you're still facing in December for things like elevated freight costs and Malaysia facility? When can we expect the gross margin to normalize eventually? Thank you.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nYeah. No, I'm not going to quantify that for you either. It's still a headwind. Otherwise, I wouldn't have put it in the scripted remarks.\n\nAs we go into next year, and I think supply gets caught up with demand in terms of some of the supply challenges we're having, I expect some of the inflationary headwinds there to mitigate. I expect the same thing in freight and whatnot. So I'm not going to put a number on it, but I do expect that that will get better as we go into next year.\n\nJason Park -- UBS -- Analyst\n\nThanks a lot.\n\nOperator\n\nWe will take the next question from Harlan Sur from J.P. Morgan. Your line is open. Please go ahead.\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nHi. Good afternoon. Thanks for taking my question. Given your commentary on the $2 billion, $2.5 billion impact next year from the export controls in China, it looks like near term, you are offsetting some of that with your significant deferred revenue and order backlog with some of your non-China customers.\n\nBut I guess my question is, could you quantify of the $2 billion, $2.5 billion impact, what percentage is systems and what percentage is services? And then I have a follow-up question.\n\nTim Archer -- President and Chief Executive Officer\n\nYeah, Harlan. I guess we wanted to give some sizing for that in 2023 since we knew there will be questions that we're not going to break out the difference right now. That's inclusive of both systems and spares and service for those customers in China that are impacted by the restrictions. I think that we talked a little bit about improving supply chain conditions.\n\nAnd so where possible, we talked about December, including some impact of, of course, China restrictions, offset partially by supply chain easing, offset as well by some decreases in other customers due to the demand elements that we talked about. So we're not prepared to break each of those items out, but we're doing the best we can to essentially meet customer demand requirements where we can as early as we can.\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nI appreciate that. And then my follow-up, the team only just started recently breaking out services of your CSBG business. Obviously, it's becoming a more ratable base, multiyear service contract focused business, a lot richer in terms of value-added services and solutions. I think you guys put in your presentation like chamber shipments are up significantly over the past three years.\n\nSo in thinking about a weaker WFE environment next year, like if you look back over the last three or four WFE downturns, has Lam services business remained stable or grown through most of those downturns? And would you expect a similar profile in a weaker WFE environment next year?\n\nTim Archer -- President and Chief Executive Officer\n\nWell, Harlan, in my comments, I specifically said it's a very important part of our business model, especially during WFE downturns. It's also been a very deliberate strategy of Lam. I think if you've attended the last couple of investor conferences, we've talked about an intention to increase revenue capture per chamber. And so I mentioned that just in the time from the last WFE downturn in 2019, so now we've managed to grow the installed base in chamber count by more than 30%.\n\nAt the same time, we've also increased the breadth of our portfolio of the services that both in terms of the types of equipment intelligence services, the spares, the upgrades that has also meaningfully improved our opportunity for each of those chambers that's in the installed base. So each element of the spares of CSBG, whether it's spares, upgrade services, Reliant probably moves a little bit different through each of the kind of WFE up cycles or down cycles. But generally, spares, as we've said, holds up pretty well as most customers continue to run all of the tools that they've got installed. Upgrades sometimes can actually do a little bit better as customers have a little bit more time in a downturn to make the improvements that they want to make so that they come out of those downturns stronger with their installed base.\n\nAnd then services, especially with our expanding offerings around equipment intelligence sources, I talked about efficiency, productivity. Those are all things that they're important to customers at all times, but they're really important to customers as they're thinking about squeezing everything they can out of the installed base they have and being able to then maybe delay additional capital purchases or expenditures for just a bit longer. So I would say that we see CSBG as a very important part of stabilizing the company's performance through cycles.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nYeah, Harlan, the only thing I would point out incrementally, yeah, the only incremental thing I'd point out and incremental to what Tim said is I've been talking about how strong Reliant has been the last several quarters. And in fact, last quarter, it was the biggest sequential grower in CSBG. And as we look into 2023, we're not going to parse all the different components of WFE. But I know there's some people out there that think specialty segment of WFE will soften next year, and that would impact the Reliant along with that, offset by the things that Tim talked about.\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nNo. Great insight. Thank you.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nThanks, Harlan.\n\nOperator\n\nWe will take the next question from C.J. Muse from Evercore. Your line is open. Please go ahead.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nYeah, thank you for taking the question. I guess first question relates to deferred revenues. So when you gave us your early view for 2023 WFE, how are you kind of reflecting deferred revenues for you, as well as the rest of the industry in that more than down 20%? And as part of that, should we be thinking about your deferred revenues getting close to zero exiting calendar '23?\n\nTim Archer -- President and Chief Executive Officer\n\nYeah. Let me take a start at that first, and then I'll let Doug add in. Obviously, our -- we've contemplated that. Always, when we're talking about the -- what we think the industry is able to do from a ship perspective and ultimately from a revenue perspective.\n\nBut -- so that number next year, kind of think about it as a little bit of a like-for-like to this year. But I believe that we will see ultimately the year play out in a way that deferred revenues do come down as supply chain continues to ease. And there is a normal level though. I'll let Doug speak to that, what that normal level of preferred is that we'd expect.\n\nSo it won't come to zero, but we will see a meaningful portion of that deferred revenue that really represents the systems that we've been unable to satisfy this year as that plays out next year as we have ramped our capacity, supply chain capacity is caught up, and therefore, we get caught up on deliveries and revenue recognition. So Doug, I don't know if you have something further.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nYeah. I mean, C.J., you know that deferred revenue is never a zero number because we always have these cash and advanced payments, volume purchase agreement credits, a whole bunch of different things, spares and service credits that are there. If you look pre the supply chain challenges we had, a normalized level of deferred revenue would be somewhere between $500 million and $1 billion. It bounces around.\n\nIt's lumpy sometimes. But that is kind of the normalized level that I think about, and it's elevated right now because of the backordered stuff and the incomplete tools that we're shipping. It will come down in December, and then it will come down more as we go through 2023 is our outlook right now.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nVery helpful. And as my follow-up, you've grown your headcount by 30-plus percent over the last kind of five quarters. And I guess curious, as you contemplate the coming kind of correction, how are you thinking about headcount? How are you thinking about opex and operating leverage?\n\nTim Archer -- President and Chief Executive Officer\n\nWell, I think that -- obviously, as Doug mentioned in his comments, it's not our first downturn. And the reality is we had -- really had no choice but to expand the company as we tried to meet what was really unprecedented demand over the last couple of quarters -- or a couple of years. And that -- no choice in doing that. And as you see, not only did we add headcount, they also expanded our facilities.\n\nObviously, as you move through cycles, you then look at the resources that are required to meet the business level in the year and going forward and beyond. But I made a couple of comments. One, we think it's incredibly important that we sustain technology development through any cycle. Our customers expect for us to be continuing to advance the products and the technologies they're going to need on the other side of the demand cycle.\n\nTwo, I talked about some very strategic investments that we've made to expand our global footprint to put us closer to where some of our key customers are to create capabilities closer to ecosystem partners and our supply chain. And we think those investments are incredibly important to the long-term business model of the company. And so we'll be sure that in however we're thinking about the resources in the company that we sustain those types of investments as well because it's not only how you act through the downturn, it's how prepared you are for the next upturn and what performance you can deliver in that cycle as well. So those things are all under consideration now, and it's also why we gave you some look ahead to 2023 to give you a sense of how we're thinking about how this business is going to have to be run through the near term.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nVery helpful. Thank you.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nThanks, C.J.\n\nOperator\n\nThe next question from Stacy Rasgon from Bernstein Research. Your line is open. Please go ahead.\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nHi, guys. Thanks for taking my question. For my first question, you've -- obviously, you've got backlog and deferred carrying you through December, but you've got calendar '23, you're guiding WFE down, if I do the math, like somewhere in the ballpark of $70 billion. How do I think about the transition from where we're running right now to that environment? Like can you give us any color, even qualitatively just on like for March quarter? Does March quarter sort of -- are you sort of at that run rate of where you expect WFE to be next quarter? Like what does that transition look like?\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nYeah, Stacy, I mean we gave you color beyond what we would normally do at this point in the year, and I'm not going to do any more than we've already provided. That's the best we're going to be able to do for you right now.\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nAll right. I guess I'll take that. For my follow-up, if I look at the WFE guidance for next year, again, down 20% or more from the low 90s, puts at about $70 billion. You said it includes the China sanctions.\n\nWould it have been higher without those China sanctions? Are you assuming that some of that China capacity gets redeployed to other players? Like what is that -- what do those puts and takes look like?\n\nTim Archer -- President and Chief Executive Officer\n\nNo, that makes an assumption and the vast majority of that China WFE just comes out of WFE. And I don't -- if your question is, could somebody else spend what those customers were going to spend to put the same equipment or capacity in place. Our view right now, I mean, is that that probably wouldn't take place in 2023.\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nYeah. I guess what I'm asking is if it wasn't for the Chinese sanctions, would you be looking for WFE at like $80 billion or $75 billion instead of the $70 billion where it seems to be coming out?\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nYeah. It would have been a little bit higher, Stacy. Yeah, it would have been a little bit higher.\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nGot it. OK. Thank you, guys.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nThank you.\n\nOperator\n\nWe'll take the next question from Krish Sankar. Your line is open. Please go ahead.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nYeah, hi. Thanks for taking my question. The first one, thanks for the color on CSBG. I'm just kind of curious, you shipped a lot of tools this year.\n\nMost of them are under one-year warranty. So they won't necessarily contribute to CSBG revenues. And WFE is down 20% or higher, and the customer utilization rates come down. Is there a way to think about what utilization rate below which CSBG revenues don't grow?\n\nTim Archer -- President and Chief Executive Officer\n\nWell, I think it's a tough question because as I -- that's why I pointed out, there's really four components of CSBG and not all of them are completely utilization driven. But just to your comment about the number of tools we've shipped. I mean, over the last two years, as we mentioned, or since 2019, up 30%, a significant expansion in chamber count. So therefore, our opportunity has grown.\n\nThere are some components of CSBG and the spare space around consumables that actually start kind of on customer usage. And so that one-year delay it doesn't quite exist for every part of CSBG spending. But I don't think we've done the calculation of where UT would have to come down -- utilization would have to come down in order for certain elements not to grow. I think we anticipate that, again, customers are going to be motivated to run the tools to a great extent for the tools that they already have installed.\n\nAnd again, you'll see probably heightened interest in upgrades versus new capacity additions, which is also beneficial for not only our CSBG business, but Lam's capture rate per dollar of investment spend. So again, just CSBG being an important part of our business. Pointing out, Doug also commented some elements like Reliant are subject to kind of overall macro environment, and we just have to watch that as we move through next year.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nGot it. Got it. Tim, that's very helpful. And then as a follow-up, it seems like the first time your foundry revenues crossed $1 billion in a quarter.\n\nAnd you mentioned about some ALD wins for gate-all-around, etc. So I'm curious how much of the foundry strength is care gains versus just underlying cyclical strength from the foundry purchasing?\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nA little bit of both, Krish, frankly. Obviously, I think you understand, like I'm sure everybody on the call does, foundry investment is pretty strong this year. So that's a part of it. But there's incremental positions that we've won.\n\nTim, every earnings call, talks about some of those. So -- and he talked about a couple of just now.\n\nTim Archer -- President and Chief Executive Officer\n\nYeah, Krish, I'm usually trying to focus on how we're doing versus what are some of the longer-term inflections that we've highlighted. When you think about foundry logic where we've been focused, it's ALD, which clearly, we've made significant progress. It's areas like the EUV patterning module, which includes hard masks and the ability to etch very fine pitch features with incredibly uniformity across the wafer and wafer-to-wafer, tool-to-tool, chamber-to-chamber. And that's -- so I've been -- usually, I'm talking about a little bit further ahead, but that gives you some sense of the momentum of the company that's independent of the cycle.\n\nIt's really -- those are positions we're winning and when the customers buy, those become big opportunities for the company.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nGot it. Thanks. And thanks, guys.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nThanks, Krish.\n\nOperator\n\nNext question from Joe Moore from Morgan Stanley. Your line is open. Please go ahead.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nGreat. Thank you. In terms of the business that's impacted by the export controls, you said $2 billion to $2.5 billion for next year. Can you talk about what that is kind of like on a run rate basis? Or just -- I'm trying to get a sense of, is that $2 billion to $2.5 billion, was that projecting some growth relative to where the numbers have been? I'm just trying to understand how much the negative impact is versus the trailing numbers.\n\nTim Archer -- President and Chief Executive Officer\n\nYeah, that's a good question. I mean obviously, we're giving a '23 a little earlier that we probably have a great look at '23. But in that number, $2 billion to $2.5 billion, we did anticipate some growth in '23 over 2022. So we won't say how much, but it's incorporated some growth from the run rate we see today.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nOK. Thank you. And then within the service, the spares in particular, part of that business, I assume you'll be impacted in your ability to ship spares going forward as well. Should we think about those customers being similar in size to their overall capital spending? Or have they been sort of purchasing spares ahead of this? And could they be outsized exposure within your services business because of that?\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nYeah. No, Joe, there's not an enormous amount of it. There's been a little bit of inventory. I think the entire customer base built up with some of the supply chain constraints this year, including the local Chinese customers, but it's not like a crazy amount.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nGreat. Thank you very much.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nThanks, Joe.\n\nTim Archer -- President and Chief Executive Officer\n\nThanks.\n\nOperator\n\nNext question from Toshiya Hari from Goldman Sachs. Your line is open. Please go ahead.\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nGreat. Thank you so much. I was hoping, Doug, you could help us think about your systems revenue into '23 vis-a-vis how you're thinking about WFE. Obviously, you're over-indexed to Memory where you guys expect the bulk of the decline to come in '23.\n\nYou've been really successful in China and chunk of that is coming out. On the positive side, you seem to have really strong momentum in both logic and foundry. So net-net, is it fair to assume you guys can kind of perform in line with WFE? Or do you think '23 is going to be a relatively challenging year just given your mix?\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nYeah. I think in many ways, Toshiya, you answered your own question. Yes, we're a little bit over-indexed in Memory. We're very strong in terms of share there, and that's going to be down more than overall WFE next year, but that's also offset by the strength of our CSBG business, which I believe to be the highest quality installed base business in the industry.\n\nSo that's going to benefit us. If you really want to kind of see what it might look like, go back and look at '19, where you had a similar profile where Memory was quite soft and foundry logic was pretty good. And we weathered that period pretty well.\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nThat's helpful. Thank you. And then as my follow-up, a question on gross margin. So you're guiding December down 150 basis points.\n\nAnd Doug, you spoke to customer mix. One of your competitors, they've talked about inventory write-downs and costs associated with repurposing tools. Curious if anything like that is negatively impacting your December quarter guide. And I guess more importantly, how should we think about March and beyond with volume declining, do gross margins decline further from here? Or do you think there's enough offsets in pricing and hopefully freight and semiconductor pricing that could help you on the upside? Thank you.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nYeah. Let me unpack a little bit, Toshi. No, I don't really think we're going to have a meaningful inventory exposure. So no, there isn't anything from that.\n\nWe believe we're going to be able to meaningfully rework any inventory we had that might have been targeted for those specific customers we can no longer ship to. And I don't think, as I sit here today, that's a material number. So the softness, sequential softness in December gross margin is because we lost some very profitable customers in the China region, and that's going to persist, obviously. So that was kind of the first question.\n\nUnpacking next year. I mean, the way I think about it, first, I think you know, as everybody on the call does, this isn't really a fixed cost business. It's highly variable. And so as volumes vary, a lot of cost of goods sold varies.\n\nYou've seen that from us over the years. So that hasn't changed. The model here hasn't changed. As we go into next year, the benefit, I think we'll see in gross margin is, I believe we'll see mitigation on some of these inflationary pressures.\n\nI think supply gets back caught up with demand in terms of our supply base in areas like semiconductor. I believe freight gets better next year. To what magnitude, I'm not positive, but I think that gets better. And then we ramp supply chain in Malaysia.\n\nSo we're flying things shorter distances and whatnot. And so we're going to see the benefit of that offset then by we've just lost some very profitable customers. And yes, volume will be down. There is a little bit of fixed cost in the factory and field that we're going to have to deal with.\n\nSo I'm not going to quantify it for you, but those are the puts and takes.\n\nTim Archer -- President and Chief Executive Officer\n\nAnd the only thing I would add is that a lot of our actions -- again, I spoke to some of the repositioning. I mean, effectively, your question is about next year, but we're really thinking about, again, long-term trajectory for profitability of the company, which both Doug and I have said over time, we want to drive it meaningfully higher. And so Doug mentioned and I mentioned the investment in Malaysia. We talked about the engineering activities in India, talked about the technology lab in Korea.\n\nAll of these things are designed to make us faster and more efficient in our operations over the long term. And so how much of that shows up next year and kind of how -- what the effect is, we're going to see how next year plays out. We're going to be focused on it. As Doug said, if we go back and look at 2019, we did pretty well in these periods.\n\nBut really, what we're trying to message is that the investments we've made over the last couple of years, taking advantage of this very strong growth period in the company really sets us up for the remainder of this decade to really drive the strategy of the company toward, again, speed, mission and efficiency and delivery of our products and services.\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nThanks, guys.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nYup. Thank you.\n\nOperator\n\nNext question from Vivek Arya, Bank of America. Your line is open. Please go ahead.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nThanks for taking my question. For the first one, I'm curious, Tim, when do you see your ex China memory customers getting to some level of supply demand equilibrium? Is it sometime in Q1, Q2, Q3? Just what's your sense of how much inventory do they have? And how much time would it take for them to clear it out so that your orders can resume?\n\nTim Archer -- President and Chief Executive Officer\n\nYeah. Well, now we're starting to talk a lot more about 2023. And so again, we incorporated our view there into the 2023 guidance. I think we'd like to wait until we get a little bit closer to the year to be able to speak to that.\n\nIt's customers are taking action. And I think that you're hearing from customers about some pretty aggressive action to try to bring those inventories and the supply demand better into balance. I don't really want to speak for them, but I think that as I commented, I think as we exit 2023, we're going to be set up in a pretty good place for memory spending as a percent of total WFE to actually rise from that point. How it plays out through 2023, I'll let you know our view as we get a little bit closer.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nAnd Vivek, maybe just an observation from me. I mean, these cycles have similar time frames associated with them, almost just walk back in history and look at it. With the caveat, though, I think as we came through all the supply chain challenges this time, maybe a little more entry got built up when I look at things in the industry, so it might be a little bit longer than typical. But these things are pretty consistent on a historical basis.\n\nSo you just go look at history, you'll have the answer to your question.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nAll right. And for my follow-up, I'm just trying to reconcile the more optimistic comments about growth made by your lithography peer this morning who is expecting to grow next year with your comments that WFE could decline over 20%. So if the little part of the wallet is going to grow, does it mean that the part that applies to you declines a lot more than 20%? I'm just trying to reconcile such a big difference in how two important players are thinking about next year.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nYeah, hard for me to tell you what another company is saying, especially because it was just this morning, and I haven't really been able -- Tim and I haven't really been able to look at what they said. But I think you understand, you don't just buy one tool just for the fun of it. If you can't buy all the process tools to complete the manufacturing line, it makes no sense, right? And so if you bought a litho tool, you eventually etch step and everything else to complete the wafer. So I can't help you reconcile what they said because I haven't actually been able to go study it, but I think you understand what I just commented on.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nUnderstood. Thank you, Doug.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nThanks, Vivek.\n\nOperator\n\nNext question from Blayne Curtis, Barclays. Your line is open. Please go ahead.\n\nBlayne Curtis -- Barclays -- Analyst\n\nHey, guys. Thanks for taking my question. I just want to ask you on the restrictions. I mean I guess, just optically looking at it, it seems like you're taking out the domestic memory vendors, and I know there's very little leading-edge logic.\n\nI'm just kind of curious, there was at least some debate as to whether the multinationals, whether you could still ship to their Chinese facilities. I know there was some licenses maybe for services. But just kind of curious if you could just quantify your understanding of the restrictions and what you're taking out and whether it includes multinationals and if you can still ship to facilities that may make leading-edge foundry processes even if the equipment is not being used for.\n\nTim Archer -- President and Chief Executive Officer\n\nA bunch of questions there. First of all, maybe the simplest is, we've taken out the -- obviously, the shipments that were destined for applications or customers that are restricted, which primarily means right now, domestic Chinese customers that are manufacturing restricted technologies, which in NAND and DRAM have certain specifications and in foundry logic, others. The multinationals, as you noted, were given an authorization to receive shipments and service. And so our business there effectively remains unchanged as a result of that.\n\nAnd so we are continuing to include that in our outlook for 2023. To your point about a facility, it's our understanding that a facility that would have mixed use would likely fall under the restricted category. And so therefore, if a customer were to want to manufacture and take shipments and receive support for restricted -- for unrestricted technology, you would have to be in a facility that was clearly not also doing restricted activities. And I think that that's something that's we work through by our customers.\n\nWe've contemplated all of those, as well as what we believe will happen in China in that $2 billion to $2.5 billion estimate. And so that's our view right now of the restrictions and how they affect customers in our business.\n\nBlayne Curtis -- Barclays -- Analyst\n\nThanks. And then just on December, I was a little confused. The impact you laid out is $500-plus million per quarter that you can't ship to. Your sales are kind of flat.\n\nSo I'm just kind of curious, are you making it up with other customers? Just kind of curious how fungible is equipment that you thought you're going to be shipping to Chinese memory whether it needs to -- can be repurposed in the quarter and you're doing that, and that's why you're not seeing the impact or whether you're expecting to ship to some higher level, and we just didn't know that, and that's why the sales are flat.\n\nTim Archer -- President and Chief Executive Officer\n\nWell, I think that as you heard Doug say, the December guide would have been decently higher if the China restrictions have not been put in place. So I think that answers the question. There was a comment about -- that we made about -- perhaps we made up a little bit because of easing supply chain conditions, but that would have happened independent. So in any case, December would have been higher had the Chinese restrictions not been put in place.\n\nBlayne Curtis -- Barclays -- Analyst\n\nOK. Thanks.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nYup. Thanks, Blayne.\n\nOperator\n\nNext question from Joe Quatrochi, Wells Fargo. Your line is open.\n\nJoe Quatrochi -- Wells Fargo Securities -- Analyst\n\nYeah. Thanks for taking my question. I just wanted to go back on the expectation that deferred revenue declines in December quarter. Is there any part of that that's related to the export restrictions where customers that are now restricted had tools that were incomplete that are now, I don't know, more or less stranded?\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nNo, Joe, there's not -- we cannot ship anything to those restricted customers.\n\nJoe Quatrochi -- Wells Fargo Securities -- Analyst\n\nBut tools, I guess, that were previously shipped that are just incomplete like they were shipped last quarter or two quarters ago?\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nIf that situation existed, and I'm not saying it did or didn't, we can't ship anything to them.\n\nJoe Quatrochi -- Wells Fargo Securities -- Analyst\n\nGot it. OK. And then just trying to think about bit shipments in the cycle relative to prior cycles, how do you think about your customers' willingness to hold more inventory on their own balance sheets this cycle relative to prior cycles? Does that change the way you think about maybe like the snapback in terms of like bit supply growth?\n\nTim Archer -- President and Chief Executive Officer\n\nYeah, it's a good question, definitely one that's better relative to their tolerance of holding that inventory. I think everybody's view of inventory probably changed a little bit as a result of shortages and the ability to respond to what over last two years, we've seen is relatively sharp changes in demand. But I really can't answer for them about their willingness to hold more inventory. I think we're going back and as Doug said, looking at kind of historical behavior in these kinds of downturns, what we're experienced with, and that's how we kind of like project out what we think will likely happen.\n\nJoe Quatrochi -- Wells Fargo Securities -- Analyst\n\nGot it. OK. Thank you.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nYup. Thanks, Joe.\n\nTina Correia -- Corporate Vice President, Corporate Finance and Investor RelationsP\n\nOperator, we have time for one more question, please.\n\nOperator\n\nUnderstood. We have the last one from Quinn Bolton, Needham & Co. Your line is open. Please go ahead.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nThanks for squeezing me in. Tim, there's some confusion or misinterpretation of the market, it seems like on the license requirements for U.S. citizens in China. I'm wondering if you can just clarify does the support license requirements affect just the same set of customers as the equipment license? Or is there a broader impact on U.S.\n\ncitizens operating in China?\n\nTim Archer -- President and Chief Executive Officer\n\nOn U.S. citizens operating in China, I'm not -- I mean, there is a restriction on U.S. citizens as defined by the government via providing support for the development of restricted technologies.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nRight. But is that just sort of the same set of customers that require export licenses on the equipment side? So the advanced NAND, the DRAM, 16-nanometer and below? Or is there a broader set of customers you cannot support under the export control?\n\nTim Archer -- President and Chief Executive Officer\n\nNo. I believe it is the same step that spelled out. Fundamentally, customers that are either on a restricted list or producing restricted technologies are those that are affected.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nGot it. Thanks for the clarification. And just quickly, you said you're going to manage opex next year. Kind of wondering if you might be able to provide any sort of qualitative color.\n\nIs that sort of -- you expect it to look similar to what happened back in 2018, 2019 in a downturn? Or would you look to be more aggressive and try to manage opex more in line with the decline you see in WFE in calendar '23?\n\nTim Archer -- President and Chief Executive Officer\n\nWe'll give you that guidance in the January earnings call. I think what we're just trying to signal is that we're well aware of what we believe is coming next year and therefore, we'll take the appropriate actions. As we see fit, as I mentioned, to manage the company through the downturn, but also be ready for what we believe is a robust future for the company and the industry.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nGreat. Thank you.\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nThanks, Quinn.\n\nTina Correia -- Corporate Vice President, Corporate Finance and Investor RelationsP\n\nOK, operator, that will conclude our call. I'd like to thank everyone for joining us today. Have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTina Correia -- Corporate Vice President, Corporate Finance and Investor RelationsP\n\nTim Archer -- President and Chief Executive Officer\n\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\n\nJason Park -- UBS -- Analyst\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nBlayne Curtis -- Barclays -- Analyst\n\nJoe Quatrochi -- Wells Fargo Securities -- Analyst\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nMore LRCX analysis\n\nAll earnings call transcripts"
}