{
  "companyName": "Home Point Capital Inc.",
  "companyTicker": "HMPT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/home-point-capital-inc-hmpt-q2-2022-earnings-call/",
  "content": "Home Point Capital Inc. (HMPT -2.49%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Home Point Capital second quarter 2020 financial results conference call. [Operator instructions] As a reminder, this conference call is being recorded. At this time, I'd like to turn the conference over to Lesley Alli, chief investor and industry relations officer. Thank you.\n\nYou may begin.\n\nLesley Alli -- Chief Investor and Industry Relations Officer\n\nThank you, operator. Welcome to Home Point's second quarter 2022 earnings call. Joining me this morning are Willie Newman, president and chief executive officer; and Mark Elbaum, chief financial officer. During our prepared remarks, we will be referring to a slide presentation, which is available in the events section of the Home Point investor relations website.\n\nBefore we begin, I'd like to remind you this call may include forward-looking statements, which do not guarantee future events or performance. Please refer to Home Point's most recent SEC filings, including the company's annual report on Form 10-K, which was filed on March 17, 2022, for factors which could cause actual results to differ materially from these statements. We may be discussing certain non-GAAP measures on this call, which management believes are relevant in assessing the financial performance of the business. These non-GAAP measures are reconciled to the nearest GAAP figures in Home Point's earnings release, which is available on the company's website.\n\nNow, I'd like to turn the call over to Willie Newman, president and chief executive officer.\n\nWillie Newman -- President and Chief Executive Officer\n\nThanks, Lesley, and good morning, everyone. During our prepared remarks, I'm going to discuss the factors that contributed to an extremely challenging environment in the mortgage industry during the second quarter of 2022. I'll also discuss how we continue to strategically position Home Point for long-term sustainability and success through our focus on the channel that is best for consumers and loan originators, wholesale. After that, Mark will provide more details on our results for the second quarter as well as some initial insight into the third quarter.\n\nWe'll then open the call to take your questions. The market volatility and competitive pressures the industry faced in the first quarter intensified in the second quarter. This is greatly larger, more systemic challenge for the entire industry as excess capacity becomes more of a drag on expenses and ultimately, profitability. The overall mortgage market was down over 40% year over year in the first half of 2022.\n\nAnd during the month of June, mortgage applications for new home purchases were down 12% year over year, standing at the lowest level since April 2020, according to the Mortgage Bankers Association. The second quarter share of refinancing was also the lowest it had been in the past six quarters, at 24% of overall origination volume. At Home Point, our financial performance was impacted by several nonrecurring items driven by volatility in the financial markets. Operationally, we continue to make progress on cost as well as improving our liquidity and leverage position through the divestitures of nonstrategic assets and business lines.\n\nHowever, the revenue opportunity continues to be challenged, both in production and margin levels. Mark will provide more detail on our financial results. Looking forward, competitor actions have added to the challenges of a down origination cycle, resulting in historical lows in market level margins. Our response to this strategy continues to evolve, but the primary components remain consistent, while our costs, focus on liquidity and position for wholesale channel growth.\n\nFocusing on the growth dimension of wholesale, the migration from retail to broker is accelerating. In 2021, 6,353 loan originators migrated from retail to broker or 529 per month. Year-to-date 2022, the average is over 800 with July being the highest month so far as 1,022 loan originators migrated from retail to broker. In addition, interest in converting from retailer brokerage is skyrocketing.\n\nWith interest at these dramatically heightened levels, we are very bullish on the growth prospects in wholesale. While there's no question that the current competitive environment is a contributing factor to dramatically increased interest, the fundamentals are what will drive sustainable growth in wholesale. Previously, we have described our in-depth analysis of Select HOME Data from 2020 that showed that brokers working with Home Point and other wholesale lenders providing an over $8,000 lifetime benefit to consumers and loans originated through the wholesale channel. We have updated the analysis based on recently released data from 2021, which shows that brokers have increased their cost advantage to consumers to over $9,400.\n\nThe data also showed a continuation of brokers being substantially more effective at reaching into minority communities. This data demonstrates it of the advantages provided by mortgage brokers. This advantage is fueled by one primary driver, choice. Mortgage brokers have choices and retail officers do not.\n\nThis creates alignment between the broker and the consumer and the competition forces Home Point and other lenders to put their best foot forward in price, product and service delivery. The result is that consumers win. At helpline, we are very well positioned to benefit from the accelerating migration from retail to broker. We have broad access to brokerages and our loan originators throughout the country with more than 8,700 brokerages approved as Home Point Partners.\n\nThat equates to over 43,000 loan originators across all 50 states. The largest distributed retail network has 4,000 loan originators. In the second quarter, we transacted with nearly 3,600 brokerages and more than 8,100 loan originators. There is a tremendous amount of upside opportunity for increased broker activation within our current network of partners, while loan the growth opportunity in the channel.\n\nWith our sole focus on the channel that provides the greatest benefit to consumers and loan originators, we are optimistic about our long-term prospects. In the interim, we will remain highly focused on taking the actions required to navigate through the most challenging mortgage market in years. With that, I'd like to turn the call over to Mark.\n\nMark Elbaum -- Chief Financial Officer\n\nThanks, Willie, and good morning, everyone. We've included in the presentation and earnings release are standard period-over-period financial results. I'm going to focus my discussion on a handful of key metrics. We'll be happy to answer any questions you have regarding the financial results following our prepared remarks.\n\nHome Point generated quarterly funded origination volume of $9.3 billion in the second quarter of 2022. Last quarter, we began reporting on partner activation as represented by the number of brokerages locking alone. As Willie noted, in the second quarter of 2022, we had 3,573 active brokerages up 10% from the prior year. Certain nonrecurring expenses impacted our financial performance in a few key areas during the second quarter.\n\nThe credit markets deteriorated during the quarter, which resulted in a material charge to our inventory held for sale outside of agency execution as well as our repurchase reserves. In addition, our investment in Longbridge, which is in the process of being sold, had a material adjustment in valuation based on the same credit market conditions. Finally, regarding our MSR sales activities, the timing of which pools were marked compared to when the trades executed impacted GAAP accounting figures. In the Originations segment, gain on sale margin attributable to the channels before giving effect to the impact of capital markets and other activity, was 60 basis points in the second quarter of 2022 versus 74 basis points in the second quarter of 2021 and 61 basis points in the first quarter of 2022.\n\nbottom-line margins for the quarter were 42 basis points, largely due to increased expenses related to the inventory of sales outside of agency execution, as I just described. The widening of credit spreads resulted in charges of $38 million in the quarter. We have continued to be aggressive in our efforts to reduce costs. Total expenses of $119 million in the second quarter of 2022 improved 40% versus the second quarter of 2021 and improved 13% from the first quarter of 2022.\n\nThis was primarily driven by a 17% quarter-over-quarter reduction in expenses in the Originations segment. Additionally, we executed cost management initiatives in the second quarter that are expected to provide savings of $31 million on an annualized basis. We have also strategically resized our warehouse providers, which we expect to reduce our cost of funds relative to underlying indices. The transition of our in-house servicing platform to ServiceMac has almost completed and will be finalized in the third quarter.\n\nThis move will convert a fixed cost into a lower variable cost and enhance our ability to manage the MSR asset. During the second quarter, we maintained a strong liquidity position and continue to take actions to divest from non-core operations and assets to enhance that position as well as advancing the consolidation of our platforms and operations. Additionally, we completed another sale of select MSRs for a total purchase price of approximately $257 million as well as the sale of certain assets within our delegated correspondent channel. In order to further reduce leverage during the second quarter, we bought back $50 million of senior secured debt.\n\nAs a result, we recognized a gain of $9 million on early extinguishment of debt. We will continue to monitor our overall position and look for opportunities to reduce long-term debt with the financial benefit. The Home Point Capital board of directors also has suspended the quarterly dividend at this time due to the current challenging environment in order to preserve cash flow and shareholder value. Before I finish my prepared remarks, I would like to briefly discuss our forward action plan and financial outlook.\n\nAs we look at the third quarter of 2022, we expect the competitive pressure on margins that have existed in the first half of the year to continue. In addition, overall mortgage origination volumes for the second half of the year will continue to be challenged, and the share of refinancing is expected to be low in an elevated interest rate environment. As such, we anticipate the need to take further cost reduction and liquidity actions. We will continue to optimize our operational efficiency and further reduce costs while focusing on our simplified wholesale-focused model.\n\nAdditionally, we will monitor the MSR market for opportunities to additionally enhance our leverage and liquidity positions. We believe that our sole focus on the channel that most benefits the consumer, coupled with continual enhancements to the partner experience, will provide the opportunity to create long-term value even in a reduced volume environment. That concludes our prepared remarks for this morning. We are now ready to turn the call back to the operator to take your questions.\n\nOperator?\n\nOperator\n\nThank you, sir. [Operator instructions] We have our first question from the line of Doug Harter with Credit Suisse. Please go ahead.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nThanks. Just hoping you could give a little more color on your response to kind of the 3Q competitive pressures? I guess, how you would balance kind of being more aggressive on price versus trying to get more volume versus trading off volume and trying to hold the line on margin more so?\n\nWillie Newman -- President and Chief Executive Officer\n\nHey, Doug. Good morning. As we said during the prepared remarks, it's really evolving day-to-day. And our bias right now is toward more margin, less volume versus more volume, less margin.\n\nThat said, obviously, there's the volume opportunity on a macro basis is relatively limited. So what I would say, though, further is that like we're not afraid of getting smaller as an organization. We've proven the ability to grow rapidly as the cycle improves. We obviously believe the wholesale is the right channel to be in all the data points to that.\n\nSo it does evolve literally day-to-day, but at this point, we're biased more toward margin, less toward production.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nGot it. And as you mentioned, one of the key aspects of the -- for the broker is choice. Can you just give any insight as to kind of how your conversations are going with brokers and kind of how they view the importance of multiple partners versus kind of being with kind of the largest?\n\nWillie Newman -- President and Chief Executive Officer\n\nSure. Generally, I like to be more data-driven than anecdotal, so this is a lot of anecdotal information. But when we have conversations with our partners, there is a desire to do business with Home Point in particular, but more generally, to make sure that they have multiple options to choose from, it really is the kind of baseline value prop that brokers provide, and it really is what aligns brokers with consumers because ultimately, consumers get a better deal as we've proven out through the Home Point data. So at certain points in time, obviously, competitive pressures or pricing elements may be such that it somewhat forces those -- our partners to go in a different direction.\n\nBut we believe that there's widespread interest in continuing to do business with Home Point, and we do believe as margins whenever they do start to normalize more, that will be the beneficiary of that based on the reach we have, and the network we have.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. We have next question from the line of Rick Shane with J.P. Morgan. Please go ahead.\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nThanks guys for taking my question this morning. First of all, as we look at the P&L, I think two things stand out as we think about trying to return to profitability. One is that when we look at the gain on sale, the loss on sale this quarter was $15.7 million. It's about a third of your revenue in the channel basically going back to inefficient hedges and reps and warranty provisions.\n\nHow do you narrow that? And then can you put that in the context of -- on a contribution margin basis, the company lost $58 million this quarter, $15.7 million of that was from other loss on sale. You've talked about $33 million of annualized savings. So let's just say another 10-ish or less, but let's just say, $10 million of quarterly savings. So net, there's about $25 million of noise that can come out or expenses that can come out.\n\nBut that only cuts the contribution loss in half. How do you get back to profitability if the industry is going to face volume headwinds?\n\nWillie Newman -- President and Chief Executive Officer\n\nMark, do you want to start with that?\n\nMark Elbaum -- Chief Financial Officer\n\nYeah, thanks for the question. So we should decompose that $15.7 million for a minute. This quarter was, unfortunately, a quarter with the rapid increase in rates or mark and additional reserves required for rep and warrants and repurchase was about $38 million, and that's all embedded in that $15.7 million. That $38 million typically in a in an average quarter is going to run one to two a month, call it, $5 million per quarter.\n\nSo that's escalated by about $33 million this quarter. If you normalize for that, we would have been actually positive on our hedge results. So that is unique to this quarter, and it's mostly attributed to the rapid rise in rates and the impact it would have on the value of those types of loans. So that's that topic.\n\nAs Willie said, we're not afraid to get smaller. We're going to need to get smaller. We were built for a certain scale and that's a little bit of what we're dealing with right now is that the level of volume is not where it needs to be. So we are going to have to get smaller.\n\nWe're going to have to get more cost out. And I wouldn't think of the current margin environment being the normalized margin environment, it's going to be higher than that, but I also wouldn't think we're going to be burdened as much by those capital market type of activities going forward.\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nGot it. So I guess let's dive in a little bit deeper on that hedge then. I guess I'm confused what causes that inefficiency because presumably the rate movements, assuming you're choosing the right instruments, the rate movement should be captured -- should even capture the volatility? Is it a function of your fallout adjusted lock volume because so much pull-through with rates moving that you're just simply under hedged. Help us understand where that disconnect is because it's a pretty big differential.\n\nMark Elbaum -- Chief Financial Officer\n\nYeah. So again, we were actually positive in our capital markets activities this month if you normalize out for the for the onetime charge related to the rep and warrant provisions? I'm not sure...\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nOK. So it was -- I'm sorry. So it was all repping. I misunderstood that.\n\nOK, that's helpful.\n\nMark Elbaum -- Chief Financial Officer\n\nYeah. Make sure I'm clear $15.7 million was what you see there. Of that amount, $38 million of it was related to this mark-to-market activity that I mentioned.\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nGot it. And are you getting a higher percentage of early payment defaults. Is that why the rep and warranty expense is going up?\n\nMark Elbaum -- Chief Financial Officer\n\nNo. Most of it, in fact, is clean and actually performing, which is great news. It's doc defects, things like that, that would cause things to get kicked out. that activity is escalated a little bit because we're doing more whole loan sales and other types of things.\n\nBut it's pretty minor defects. The issue with that is more so these are loans that were originated some time ago when we were looking at a 3% mortgage market. Now you're looking at current coupon of 5% to 6%. So when you try to repurchase and then resell those loans, you end up taking a pretty substantial discount on it.\n\nWillie Newman -- President and Chief Executive Officer\n\nYeah. So let me step in. So there really are three components that I'll kind of unfortunately came together in the second quarter. One is, as Mark mentioned, it's really mostly a look back when you're looking at these loans that have some form of defect and/or repurchase.\n\nAnd those loans were originated in a different rate environment. Second, our credit spreads and credit spreads did widen out during the second quarter. We've seen stability in those spreads since the second quarter. And then the third is kind of the volume and the volume is somewhat influenced by your prior originations.\n\nAnd Rick, as you know in 2021, it was kind of our peak originations year. And so as we migrate -- and the repurchases lag back to that the prior origination year, give or take. So as we migrate through that, and we're already migrated to the peak, then we would expect a lower frequency as well.\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. Hey Willie, I'd love to talk a little bit about market share in the broker channel. So your -- you guys have defined the market is about 16,000 brokers.\n\nYou've said your target is to have about half of the brokers on your system and then get about 30% market share or have 30% of those brokers be -- 30% of brokers be active on your system. It looks to me like your -- the number of brokers signed up is on target, but that your share of active brokers is closer to 21% or 22% versus 30%. And going back to the prior question, in an environment where there's such competition for broker business, how do you move the dial there? Because that seems to be the other place there's a disconnect between aspiration and reality?\n\nWillie Newman -- President and Chief Executive Officer\n\nNo, Rick, it's a really good question. I mean obviously, that share gets buffered a bit by pricing actions, etc. So really kind of when you look at it as a little bit more of a long-term indicator as opposed to what happens kind of, I'll say, month-to-month or especially when competitor actions are as they are in the current environment. I think one of the things that -- everyone's kind of talking about margins these days, but I think quietly, what we've done kind of behind the scenes is that if you look at our NPS score in July, it's 84 -- just under 84 -- if you look at our app to clear to close or a cycle time, it's 18 days, and it's been consistently -- 18 business days and it's been consistently there.\n\nOur purchase mix now is over 80%. So we've been laying the foundation for a as things get back to normal from a competitive standpoint that we're going to be able to compete very effectively from a service delivery perspective and we think over time, that's what will increase share.\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nGot it. OK, thank you very much.\n\nOperator\n\nThank you. We have next question from the line of Mihir Bhatia with Bank of America. Please go ahead.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nGood morning, and thank you for taking my question. I apologize. I do want to go back to the gain on sale margin just in the quarter and what the noise in it may be a little bit. And maybe just to understand like the look back and the repurchase that's going on, is that on non-QM executions you had done in the past? I guess how much of this is still out there potentially continuing like in the third quarter and fourth quarter? Will you -- like as you mentioned, a lot of these policies were issued previously and then now you're being having to buy them back.\n\nI'm just trying to understand what's going on there because I think you also mentioned there was like the credit spreads move in the non-agency you had to take a mark on your non-agency. So maybe you can help me clarify that a little bit?\n\nWillie Newman -- President and Chief Executive Officer\n\nMark, do you want to start?\n\nMark Elbaum -- Chief Financial Officer\n\nSure. So this is not non-QM. We haven't engaged in non-QM activity. So this would still be our core Fannie, Freddie, Ginnie type of products.\n\nSo that's number one. Number two, in terms of the escalation, it's a lot more to do with the volume levels. Remember, about a year ago, we were doing substantially more volume than we're doing today. So if we were doing the same level of volume today as we were doing then, it wouldn't seem like a big number.\n\nSo there's -- the stuff that's being repurchased now, the rate of it is not much different than it's been before, but it's off of a larger denominator. And then the third element of it is just the value of those loans are less because of the rapid increase in rates and the credit spread widening. In terms of my expectation going forward, we took the charge this period, reflecting where the market is now. To the extent the market recovers, there might even be a pickup there, but we feel like we've marked it to where the current observable marks are right now.\n\nSo the risk there, I suppose, is if rates continue to rise or credit spreads continue to widen, that could create a risk in terms of that value, but that could also go in our favor.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nOK. Understood. And then the -- maybe on the -- just wanted to clarify, the assets held for sale on your balance sheet. I think that's your long bridge stake.\n\nI thought in your Q, you had mentioned you expected that sale to close in 2Q. Is that just delayed? Is that -- I guess, what's the update on that process?\n\nWillie Newman -- President and Chief Executive Officer\n\nYes. So we're still working with the regulators in a couple of different states to get things done. So we do expect that will close in the third quarter, but we're still working with regulators.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nOK. And then just finally, on your -- in terms of your capital allocation, I just wanted to -- in terms of totally appreciate your prioritizing liquidity here. with and understand the suspension of dividend given the dynamic. You did buy back some shares.\n\nI was curious, did you repurchase any debt during the quarter? And just how are you thinking about that it looks like you did buy back shares. But like just how are you thinking about that? Are you here in terms of just balancing the need to preserve cash versus how attractive your stock can be and certainly your debt is yielding pretty high yields?\n\nWillie Newman -- President and Chief Executive Officer\n\nYes. Mark, do you want to take that?\n\nMark Elbaum -- Chief Financial Officer\n\nSure. So we did, in fact, repurchase debt during the second quarter, we repurchased about $50 million worth of debt. And at a discount to your point. So we recognized about a $9 million gain on early extinguishment of debt.\n\nWe felt comfortable doing that because our capital needs are frankly less on a lower margin or lower volume environment. So with that, the capital allocation policy of the company continues to be support, first and foremost, the business; and then secondly, we'll look at opportunities to optimize the balance sheet. With lower volume we felt that we had capital available to us to take advantage of where the debt is trading at this point. And so we'll continue to balance that and look at that.\n\nBut the highest priority will make sure, it will be making sure we have sufficient liquidity to manage the business.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And then just my last question, maybe just turning to the outlook from here. I understand you're not giving guidance, but maybe at least tell us how July has trended? Has there -- have you seen an impact on market margins? And I understand you're focusing your business on margin, which can affect volume. But like what was July, like did you all have -- because of -- given the competitors big price announcements out there, did you see a big shop, I don't know, a decline in volume as you focus on margin? Or less of an effect than you would have thought? Just maybe any updates you can provide us just as we think about the back half of the year?\n\nWillie Newman -- President and Chief Executive Officer\n\nMark, do you want to take that?\n\nMark Elbaum -- Chief Financial Officer\n\nSure. So -- and we certainly did see an impact from this end. And a lot of that impact is what Willie was referring to in terms of our need to continue to evolve and adapt. But yes, certainly, a big move was made in the marketplace, and it did impact our margins and volumes.\n\nSo where we finished the second quarter, where we showed about 64 basis points of wholesale top-line margin, it was significantly lower than that in July. And looking at that, we recognize that we need to focus more on margin and getting margin back to a good place and then letting volume be with what we feel is a normalized level of volume in this type of market environment and then manage our costs accordingly. So the short answer to your question is, yes, we were certainly impacted in July and that's the pivot that we need to make here in the third quarter.\n\nWillie Newman -- President and Chief Executive Officer\n\nYeah. To give a little more granularity. So we were in the 30s in July. And what I mentioned about really kind of dynamically reviewing it is we expect to push up from there.\n\nThere will be some sort of impact on volume, which is why we're choosing that guidance on volume at this point because we want to give ourselves the strategic flexibility to be able to manage this very dynamically.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nThank you. Thank you for taking my questions.\n\nOperator\n\nThank you. [Operator instructions] We have a next question from the line of James Faucette with Morgan Stanley. Please go ahead.\n\nUnknown speaker\n\nThanks. This is Sandy Bi on for James. On cost cutting, any specific areas where your efforts have been most focused headcount or otherwise? And just within that, what inning do you feel like you're in just as you execute on these cuts and work toward a more normalized cost base?\n\nWillie Newman -- President and Chief Executive Officer\n\nSure, I'll start. So it really has been across the organization. As Mark mentioned, our corporate infrastructure was built for initially -- originally built for multichannel large-scale servicing platform embedded type of a business. And as you know, we've divested most of -- the other business -- all the other businesses other than wholesale at this point as well as consolidating our servicing platform into ServiceMax.\n\nSo a big area of focus has been corporate from a business standpoint. I think probably there's really two components to it. One is continually refining our productivity models based on the technology advances we've made as well as process improvements. And then secondly, it's just simply calibrating to the potential volume that we see out there.\n\nSo it really has been very broad-based and will continue to be. As far as inning goes, I think we're pretty close to where we would need to be organizationally at least from a timing standpoint, the amount of the adjustment that we have to make is still to be determined. But we expect by the end of the year to be the right size as an organization for whatever the market presents to us.\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nGot it. OK. And one follow-up here. updates on strategy, particularly regarding MSR sales that we should be aware of? I know you talked on capital allocation, I think that's relatively straightforward.\n\nBut any changes in terms of thought process around trade-offs between, obviously, retaining MSRs versus selling them, particularly as the market goes through consolidation?\n\nWillie Newman -- President and Chief Executive Officer\n\nMark, do you want to take that?\n\nMark Elbaum -- Chief Financial Officer\n\nSure. So we did execute some MSR sales here in the second quarter, and we'll continue to look at the MSR market, our liquidity needs. The default is always to retain MSR and that's what we do, and then we'll opportunistically look to sell. Right now, our leverage is in a reasonably good place at 1.2 times, and we have sufficient liquidity at over $600 million of liquidity.\n\nSo as we sit here right now, we're comfortable with where we are, but we will continue to look at the market. We'll look at opportunities to sell, and that part of our strategy really hasn't changed. So there may be future sales of MSR just depending on the marketplace, the opportunity and our liquidity position.\n\nUnknown speaker\n\nPerfect. OK, thank you, guys.\n\nOperator\n\nThank you. We have next question from the line of Kevin Barker with Piper Sandler. Please go ahead.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nGood morning. I understand you the dynamic nature of cutting expenses in this environment. But can you give us -- maybe quantify a little bit how much expense decline could happen here in the third quarter just on a run rate basis? Given you exited the correspondent channel, you've also made like a long bridge and there's a few other initiatives that have put in place. So if we think about a run rate going in the third quarter and then into the fourth quarter.\n\nHow much of a decline should we expect as we go through the back half of this year?\n\nWillie Newman -- President and Chief Executive Officer\n\nMark, do you want to take that?\n\nMark Elbaum -- Chief Financial Officer\n\nSure. So we took actions already in the second quarter that should on an annualized basis results in about a $31 million a year save just in salaries and benefits alone. So call that $8 million a quarter, and that's what's already been executed. As Willie mentioned, we're continuing to evolve that strategy further in the third quarter.\n\nThese things don't happen instantaneously. So I think you're going to see more of you'll see the change more so in the fourth quarter than you'll see it in the third quarter, but actions will have to be taken in the third quarter to affect that we're not really prepared to give guidance in terms of what those numbers are going to be. As Willie said, it's evolving. There's a lot of things we need to look at in terms of infrastructure as well as headcount.\n\nAnd so that process is underway.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nSo from an infrastructure standpoint, do you feel like you've gotten to a point where you've simplified the operating businesses to where you want to be longer term. And now it's more just purely execution.\n\nMark Elbaum -- Chief Financial Officer\n\nYes, I think...\n\nWillie Newman -- President and Chief Executive Officer\n\nGo ahead, Willie.\n\nYes, I think so. I mean I think strategically, we are positioned where we want to be at this point. And obviously, the long bridge sales still out there. But operating wise, we've divested of what we intended divesting of.\n\nWe've consolidated what we intend and consolidating there's still some infrastructure elements that we need to look at from an overhead perspective, Kevin. But as Mark mentioned, that's kind of evolving as we speak. So but strategically, I think we're positioned in a position. We're positioned in the channel that has great provides the greatest benefit to consumers and loan originators.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nThank you, Willie. Thank you, Mark.\n\nOperator\n\nThank you. We have next question from the line of Steve Delaney with JMP Securities. Please go ahead.\n\nSteven Delaney -- JMP Securities -- Analyst\n\nThanks. Good morning, Willie and Mark. How are you? Will the comments about the unusual second quarter charge $38 million, and you indicated that $33 million of that should be abnormal. So about $0.24 a share and excluding that charge, your results would have come in fairly close to the consensus, which I think was negative $0.05.\n\nCould you just point us to the key factors that focusing on the $33 million number? What are the factors in the marketplace that would drive a partial recovery of some of that charge? Thank you.\n\nWillie Newman -- President and Chief Executive Officer\n\nYeah, I'll start. It's Steve. So yeah, I think Mark had mentioned it, but there's kind of a couple of things, credit spread. There's really two things.\n\nCredit spreads and rates down. So if rates go down, we should see some -- some balancing out of the discount associated with the difference between prior rates and current rates that we had experienced in the second quarter. And second, our credit spreads, as I had mentioned, it started to stabilize, at least in the segments that are germane to these -- this loan type -- or this type of asset. So those would be the two factors.\n\nSteven Delaney -- JMP Securities -- Analyst\n\nOK. And these charges were made against specific loan inventory. Is that correct? Or were they building operating reserves like on reps and warranties and that type of thing?\n\nWillie Newman -- President and Chief Executive Officer\n\nMark, do you want to grab that?\n\nMark Elbaum -- Chief Financial Officer\n\nSure. Yes, it was a little bit of both. So we have balances on our balance sheet right now. And so those would take a mark-to-market, and then you take a reserve for risk of future repurchases and.\n\nYou have to consider that those will take higher losses, too, so.\n\nSteven Delaney -- JMP Securities -- Analyst\n\nOK. Thanks for the comment.\n\nOperator\n\nThank you. We have next question from the line of Jay McCanless with Wedbush Securities. Please go ahead.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nSorry about that. So the first question on the competitive dynamic. In addition to, I guess, one competitor being aggressive on price, you also had another competitor that's going to leave wholesale. I guess does that open up any opportunities for Home Point? And I appreciate the color on what you said on July.\n\nI'm assuming those trends continued into August, if you could provide some color on that as well?\n\nWillie Newman -- President and Chief Executive Officer\n\nYeah. Sure, Jay. So I think certainly, a competitor leaving may open things up. I think it's a very competitive market with a number of strong participants.\n\nSo I think one more or less is not going to make a huge difference, but I think it is indicative that being scaled in multiple channels of origination is really challenging. So having the level of investment that's required to be in retail to be in wholesale to be in direct and you combine all those, I think it's really challenging. So for those that are multichannel, I think it makes it very challenging strategically to participate compared to our level of focus on that, the one channel in particular. As I mentioned on the competitive dynamic in August, we're really toggling between volume and margin, and we are biased toward more margins.\n\nSo that's what we would expect to happen. But like I said, it's literally a day-to-day exercise at this point.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nThat's great. Thanks for taking our question.\n\nOperator\n\nThank you. Ladies and gentlemen, we have reached the end of the question-and-answer session. And I'd like to turn the call back over to Lesley Alli for closing remarks. Over to you.\n\nLesley Alli -- Chief Investor and Industry Relations Officer\n\nThanks, operator, and thank you, everyone, for joining us this morning for our quarterly earnings call. Please feel free to contact me if you have any questions, and we look forward to speaking with you again next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLesley Alli -- Chief Investor and Industry Relations Officer\n\nWillie Newman -- President and Chief Executive Officer\n\nMark Elbaum -- Chief Financial Officer\n\nDoug Harter -- Credit Suisse -- Analyst\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nUnknown speaker\n\nKevin Barker -- Piper Sandler -- Analyst\n\nSteven Delaney -- JMP Securities -- Analyst\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nMore HMPT analysis\n\nAll earnings call transcripts"
}