{
  "companyName": "AbbVie",
  "companyTicker": "ABBV",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/28/abbvie-abbv-q3-2022-earnings-call-transcript/",
  "content": "AbbVie (ABBV -0.58%)\nQ3 2022 Earnings Call\nOct 28, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning, and thank you for standing by. Welcome to the AbbVie's third quarter 2022 earnings conference call. [Operator instructions] I would now like to introduce Ms. Liz Shea, vice president, head of investor relations.\n\nLiz Shea -- Vice President, Investor Relations\n\nGood morning, and thanks for joining us. Also on the call with me today are Rick Gonzalez, chairman of the board and chief executive officer; Rob Michael, vice chairman and president; Jeff Stewart, executive vice president, chief commercial officer; and Tom Hudson, senior vice president, R&D and chief scientific officer. Joining us for the Q&A portion of the call are Carrie Strom, senior vice president and president, global allergan aesthetics; Scott Reents, senior vice president and chief financial officer; Neil Gallagher, vice president, development and chief medical officer; and Roopal Thakkar, vice president, global regulatory affairs. Before we get started, I will note that some statements we make today may be considered forward-looking statements for purposes of the Private Securities Litigation Reform Act of 1995.\n\nAbbVie cautions that these forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from those indicated in the forward-looking statements. Additional information about these risks and uncertainties is included in our SEC filings. AbbVie undertakes no obligation to update these forward-looking statements except as required by law. On today's conference call, non-GAAP financial measures will be used to help investors understand AbbVie's business performance.\n\nThese non-GAAP financial measures are reconciled with comparable GAAP financial measures in our earnings release and regulatory filings from today, which can be found on our website. Following our prepared remarks, we'll take your questions. So with that, I'll now turn the call over to Rick.\n\nRick Gonzalez -- Chairman and Chief Executive Officer\n\nThank you, Liz. Good morning, everyone, and thank you for joining us today. I'll briefly comment on our overall performance then Jeff, Tom and Rob will review our third quarter business highlights, pipeline progress and financial results in more detail. AbbVie continues to perform very well, a testament to the strength of our broad, diversified portfolio.\n\nI'm especially pleased with the performance of our immunology assets, Skyrizi and Rinvoq. We delivered adjusted earnings per share of $3.66, exceeding our expectations. Total net revenues of $14.8 billion were up 5.4% on an operational basis, in line with our expectations. Immunology once again demonstrated impressive results with Skyrizi and Rinvoq now on pace to deliver more than $7.5 billion in combined sales this year, well ahead of our initial expectations.\n\nThis performance is especially encouraging, recognizing that we're in the early launch phase for both assets in IBD and PSA, as well as Rinvoq in atopic dermatitis. Skyrizi and Rinvoq have established outstanding launch trajectories across existing and new indications, giving us a high degree of confidence in the collective potential of these two assets to ultimately exceed the peak revenues achieved by Humira, achieving the strategic objective we had for replacing Humira. We also saw a continued strong double-digit operational sales growth from several additional key products, including Botox Cosmetic, Vraylar, Venclexta and Botox Therapeutic. This strong momentum is helping us offset some of the interim economic pressure we now see in our Aesthetics portfolio.\n\nBased on these results, we remain confident in the outlook of our business and are reaffirming the midpoint of our full year 2022 EPS guidance at $13.86, which represents strong double-digit growth. As many of you are aware, we have a leading consumer-facing aesthetics portfolio, which is largely cash pay. We have been monitoring the global economic situation. Based on all the data we have been observing, especially in the U.S.\n\nwith both the consumer confidence index and real personal consumption expenditures trending down and continued high inflation, these factors are putting pressure on consumers' discretionary spending. This metric correlates with a slowdown in treatment procedures that we're seeing across the aesthetics markets, impacting the growth rates for toxins, fillers and body contouring. While our U.S. aesthetics market share remains stable across both toxins and fillers, we now believe it's prudent to adjust our full year aesthetics forecast to reflect the moderating market growth over the near to medium term, which is expected to predominantly impact Juvederm, as well as our body contouring portfolio products, which represent higher price points for consumers.\n\nWhile it's difficult to predict the duration of these economic dynamics, we expect these conditions to persist into 2023. As consumer confidence improves, we would once again expect the market growth to accelerate. Our aesthetics portfolio experienced a rapid and sustained recovery following the 2008-2009 recession, so we anticipate any impact will be transient. Over the long-term, the aesthetics business continues to be an extremely attractive, underpenetrated market with significant growth potential.\n\nThe current market dynamics do not change our long-term guidance for aesthetics and we remain confident in our ability to achieve total sales of more than $9 billion in 2029. I also want to provide a brief update on the outlook for 2023. With regards to the status of contracting for Humira, our intent has always been to maintain broad formulary access so that we can compete effectively with forthcoming biosimilars. We are making very good progress consistent with this objective, and are currently projecting formulary access for at least 80% of all U.S.\n\ncovered lives. We expect this percentage to increase further as we conclude additional contract discussions between now and the end of the year. As a result, we anticipate strong access for U.S. Humira throughout 2023, and project biosimilars will share access as they become available.\n\nWe will provide sales guidance for Humira on our fourth quarter call. While we're not issuing 2023 guidance today, it is important to note that when we issue our EPS outlook, we expect the lower end of the range to represent for earnings. So while it's possible 2023 could outperform our guidance regardless of the shape of the erosion curve, we don't anticipate 2024 earnings will be lower than the initial 2023 EPS guidance given the momentum and growth from another year of our ex-Humira portfolio, which is expected to more than offset any incremental Humira erosion in 2024. We know that many investors have an interest in the timing of AbbVie's trough earnings, whether that would be 2023 or 2024.\n\nThe guidance range will provide and give investors additional clarity regarding our expectations for the company's core EPS. In summary, we continue to deliver strong results and see numerous opportunities for our diverse portfolio to drive long-term growth. To that end, as noted in our news release, today we're announcing a 5% increase in our quarterly cash dividend from $1.41 per share to $1.48 per share, beginning with the dividend payable in February 2023. Since our inception, we have grown our quarterly dividend by 270%.\n\nWith that, I'll turn the call over to Jeff for additional comments on our commercial highlights. Jeff?\n\nJeff Stewart -- Executive Vice President, Chief Commercial Officer\n\nThank you, Rick. We once again demonstrated strong and balanced growth across our therapeutic portfolio this quarter. I'll start with Immunology, where we are well-positioned for sustained leadership in this extremely attractive market. Total Immunology revenues were more than $7.6 billion, up 16.4% on an operational basis.\n\nWe remain very excited about the long-term potential for Skyrizi and Rinvoq which are already having a significant impact on AbbVie's growth and performance, contributing approximately $2.1 billion in combined sales this quarter, representing nearly 15% of total company net revenues. Skyrizi continues to exceed our expectations. Global revenues were $1.4 billion, up 12% on a sequential basis. In psoriasis, Skyrizi is capturing nearly one out of every two new and switching patients in the U.S.\n\nbiologic market, with our leading total prescription share increasing to approximately 27%. We have also achieved total market share leadership in a dozen key international markets, including Japan, Canada and France. Psoriatic arthritis is ramping very nicely, with an expected global sales contribution of approximately $500 million just this year. Our PSA performance is especially strong in the U.S.\n\nDermatology segment, where we have already achieved 10% total market share. Lastly, our launch of Skyrizi for Crohn's disease in the U.S. is progressing very well. Early prescription trends, as well as feedback from gastroenterologists has been overwhelmingly positive, especially given Skyrizi's convenient dosing and strong clinical profile.\n\nImportantly, commercial access for Skyrizi Crohn's is now equal to psoriasis and PSA with sales in this indication expected to ramp significantly over the next several quarters. Given the momentum we are seeing across the indications; we will be raising our full year sales guidance once again for Skyrizi. Turning now to Rinvoq, which delivered global sales of $695 million, demonstrating more than 17% sequential growth, we continue to see positive momentum in RA, with total market share increasing to more than 6% in both the U.S. and across key international geographies.\n\nGlobal prescriptions are also ramping nicely in PSA ankylosing spondylitis and non-radiographic axial SpA, a testament to the strong clinical profile Rinvoq has demonstrated across the broader rheumatology segment. Rinvoq is now the only JAK inhibitor with global approval for all four major room indications. In atopic dermatitis, we continue to see strong demand for Rinvoq, particularly in the second-line setting. U.S.\n\nin-play market share is tracking in line with our expectations and we were making excellent progress internationally, with in-place share ranging now from approximately 20% to 35% across our major markets. AD remains a highly underpenetrated market globally and an attractive long-term growth opportunity for Rinvoq. Lastly, in ulcerative colitis, we are very excited by the early prescription trends in the U.S. In the second line plus setting, Rinvoq is already achieving the second highest in-place share, which is now approaching 20% in just a few months' post launch.\n\nPhysicians have been pleased with Rinvoq's high rates of endoscopic healing, as well as the speed of onset. With over 70% of bioexperience UC patients currently on or having used TNF therapy, the second line plus opportunity for Rinvoq in UC is substantial. This strong adoption in UC among gastroenterologists is also encouraging for Rinvoq's potential in Crohn's disease as well. We are on track for U.S.\n\nand EMA regulatory decisions in the first half of 2023. Global Humira sales were approximately $5.6 billion, up 3.9% on an operational basis with 7.4% growth in the U.S., partially offset by international performance where revenues were down 16.8% operationally due to biosimilar competition. Turning now to hematologic oncology, where total revenues were $1.65 billion, down 9.9% on an operational basis. Imbruvica global revenues were approximately $1.1 billion, down 17.4%.\n\nThe U.S. performance continues to be impacted by an incrementally challenging CLL market, with new patient starts down approximately 20% relative to pre-COVID levels. Given the U.S. CLL market has been consistently lower than our expectation in the past several quarters, we are now reducing our view of the total size of the addressable patient population for this indication going forward.\n\nWe also anticipate further share erosion following the recent unfavorable change to the NCCN guideline preference for Imbruvica in CLL, as well as increasing existing and new competition. These market and shared dynamics are expected to have a flow through impact on Imbruvica's 2023 performance. Venclexta global sales were $550 million up 11.3% on an operational basis. Continued share gains across both approved indications are being partially offset by a softer CLL market in the U.S.\n\nand a higher foreign exchange impact on international revenues. As a result, we will be adjusting our full year sales guidance for Venclexta. Longer term, we anticipate our oncology portfolio will return a growth driven by several promising new products and indications such as epcoritamab for DLBCL, and follicular lymphoma, Venclexta new indications for multiple myeloma and high-risk MDs; navitoclax for myelofibrosis; and Teliso-V for nonsquamous non-small-cell lung cancer. We are beginning launch preparedness activities for several of these important opportunities and look forward to bringing new treatment options to patients.\n\nIn neuroscience revenues were nearly $1.7 billion, up 8.3% on an operational basis. Vraylar once again delivered strong growth. Sales of 554 million were up 20.2% on an operational basis reflecting continued market share momentum. We continue to anticipate the regulatory approval and the commercial launch of Vraylar as an adjunctive treatment for major depressive disorder this quarter, which would make Vraylar the only antipsychotic, as a dual partial agonist approved to treat the most common forms of depression, both bipolar I, and adjunctive, and DD.\n\nWithin migraine, our market leading oral CGRP portfolio contribute $222 million in combined sales this quarter. Ubrelvy prescriptions increased high single digits sequentially while total revenues were unfavorably impacted by a one-time prior period accrual adjustment of $40 million related to patient access program costs. Excluding this one-time adjustment, Ubrelvy sales were up more than 20% versus the prior year. Qulipta revenues nearly doubled sequentially as we continue to make very good progress with commercial access.\n\nPotential label expansion in the U.S. as a preventative treatment in patients with chronic migraine and new therapy approvals in Europe represent additional opportunities to support Qulipta's strong momentum. Botox Therapeutic is also performing very well with total sales of $699 million, up 10% on an operational basis. In chronic migraine, which accounts for roughly 45% of our therapeutic sales, Botox remains a foundational preventative treatment, and the clear branded leader for existing, as well as new patient starts.\n\nLastly, our launch preparations are underway for ABBV-951, a potentially transformative next-generation therapy for advanced Parkinson's. We anticipate approval in the first half of next year and believe ABBV-951 has the potential to achieve peak sales in excess of $1 billion. So overall, I'm very pleased with the momentum across the therapeutic portfolio, which is demonstrating strong revenue growth. And with that, I'll turn the call over to Tom for additional comments on our R&D programs.\n\nTom?\n\nTom Hudson -- Senior Vice President, Research and Development and Chief Scientific Officer\n\nThank you, Jeff. In the area of immunology, we had several important regulatory milestones since our last earnings call, receiving FDA approval for Rinvoq in non-radiographic axial SpA and positive CHMP opinion for Skyrizi in Crohn's disease. These developments demonstrate the continued progress we are making with a global indication expansion of our next-generation immunology assets. In the quarter, we also saw longer term data from our phase 2 study for Rinvoq in systemic lupus, where strong responses and flare reductions continued through 48 weeks of treatment.\n\nBased on these results, we plan to advance Rinvoq development in this indication and will be discussing our phase 3 program with regulatory agencies in the coming months. Now, I would like to provide a few updates on our earlier stage immunology pipeline. We recently began a phase 2 study in ulcerative colitis for our RIPK1 inhibitor, ABBV-668. This small molecule inhibitor is designed to address chronic inflammatory diseases by preventing necroptosis and reducing TLR4-driven inflammation.\n\nThis could be a differentiated approach that has a potential to provide significantly improved efficacy to patients suffering from ulcerative colitis. We look forward to providing updates as data mature. Turning now to ABBV-154, our anti-TNF steroid conjugate, which is being evaluated in multiple indications. We recently completed the primary analysis for the phase 2 dose-ranging study in RA patients.\n\nThe hypothesis for this program was that by delivering the steroid directly to the site of inflammation, you could drive higher rates of efficacy with limited or no effects of systemic steroid exposure. In this study, all doses of ABBV-154 met the primary endpoint of ACR50, as well as the majority of secondary endpoints at week 12. At the medium and high doses, ABBV-154 delivered ACR scores that are similar to Rinvoq or slightly better, which validates the platform's ability to drive high levels of efficacy. The safety profile for ABBV-154 was generally consistent with the safety profile for adalimumab.\n\nAs part of our safety assessment in this study, we analyze metabolic parameters including cortisol levels. The data showed minor decreases in cortisol levels at the higher exposures, which are consistent with evidence of systemic steroid effects. Given the number of effective therapies available in RA and a more limited use of steroids in these patients, we do not plan to move forward in development for the RA indication. However, we continue to believe ABBV-154 has the potential to provide a benefit in other diseases such as PMR and Crohn's disease, where steroid use is part of the typical treatment paradigm.\n\nOur exploratory phase 2 studies in these two indications are ongoing and we expect to see data from the PMR study in 2023 and from the Crohn's study in 2024. Also in the area of immunology, we recently made the decision to stop the clinical studies and discontinue development for ABBV-157, our RORyt inverse agonist. This decision was made due to new findings observed in our preclinical chronic toxicology study. Moving now to our oncology portfolio where we continue to make excellent progress across all stages of our pipeline.\n\nWe recently submitted our regulatory application in Europe and our partner, Genmab, submitted an application in the U.S. for epcoritamab in relapse-refractory large B-cell lymphoma. We're seeking accelerated approval based on the positive phase 2 study results for epcoritamab in this indication where we saw very deep and durable responses in these highly refractory patients. We expect decisions in both U.S.\n\nand Europe in 2023. We are also nearing completion of the registrational studies for two additional key programs in our heme/onc portfolio; Venclexta in multiple myeloma; and navitoclax in myelofibrosis. We remain on track to see results from the phase 3 CANOVA trial in relapsed/refractory multiple myeloma patients with a t(11;14) mutation near the end of this year. Following the event-driven data readout, we anticipate submitting our regulatory applications in the first half of next year.\n\nFor navitoclax, we remain on track to see data in the first half of next year from both the phase 2 REFINE and the phase 3 TRANSFORM-1 trials. Results from both studies will be included in our regulatory submissions, which we expect in the second half of 2023. Moving to neuroscience where we have applications under active review for several key assets. We anticipate a decision from the FDA in December for Vraylar as an adjunctive treatment for major depressive disorder.\n\nWe believe Vraylar has a potential to be an important new therapy in this patient population and we look forward to bringing this new treatment option to patients. We also expect a decision from the FDA in the first half of next year for a ABBV-951, our innovative, subcutaneous level levodopa/carbidopa delivery system for treatment of advanced Parkinson's disease. And in the area of migraine, we have regulatory applications under review in both the U.S. and Europe for Qulipta as a preventive treatment for patients with chronic migraine with decisions expected in the first half of next year.\n\nIf approved, this would be another differentiating future for Qulipta as it would be the only oral CGRP approved for prevention in patients with chronic migraine. This is a common and debilitating disease that significantly impacts quality of life, and we look forward to making this new oral treatment option available to patients once approved. And in eye care, our partner REGENXBIO recently announced positive interim data from the phase 2, AAV8 dose escalation trial for RGX-314 using in-office, suprachoroidal delivery for the treatment of wet AMD. RGX-314 continues to be well tolerated with no drug-related serious adverse events, and a meaningful reduction in treatment burden was observed at six months across all dose levels.\n\nTwo pivotal trials evaluating RGX-314 for wet AMD using subretinal delivery are active and enrolling patients. So in summary, we've continued to make significant progress advancing our programs this year and we look forward to many more important pipeline milestones in the remainder of this year and into 2023. With that, I'll turn the call over to Rob for additional comments on our third quarter performance and financial outlook. Rob?\n\nRob Michael -- Executive Vice President, Chief Financial Officer\n\nThank you, Tom. AbbVie's third quarter results demonstrate the strength of our broad portfolio. The continued robust performance from Skyrizi and Rinvoq are helping offset the impact from higher inflation and the stronger U.S. dollar.\n\nWe reported adjusted earnings per share of $3.66, which is $0.11 above our guidance midpoint. These results include a $0.02 unfavorable impact from acquired IPR&D expense. Total net revenues were $14.8 billion, in line with our guidance and up 5.4% on an operational basis, excluding a 2.1% unfavorable impact from foreign exchange. The adjusted operating margin ratio was 53.4% of sales.\n\nThis includes adjusted gross margin of 85.4% of sales, adjusted R&D investment of 10.8% of sales, acquired IPR&D expense of 0.3% of sales, and adjusted SG&A expense up 20.9% of sales. Net interest expense was $497 million, and the adjusted tax rate was 12.9%. Turning to our financial outlook. We are narrowing our full year adjusted earnings per share guidance to between $13.84 and $13.88.\n\nThis earnings per share guidance does not include an estimate for acquired IPR&D expense that may be incurred beyond the third quarter. We now expect net revenues of approximately $58.2 billion, reflecting growth of 5.5% on an operational basis. At current rates, we expect foreign exchange to have a 1.9% unfavorable impact on full year sales growth. Included in this guidance are the following updated assumptions.\n\nWe now expect Skyrizi global sales of approximately $5.1 billion, an increase of $300 million due to strong market share performance. For Venclexta, we now expect global revenue of approximately $2 billion, based on a lower market outlook in CLL and unfavorable foreign exchange. For Aesthetics, we now expect global revenue of approximately $5.3 billion, given the impact of higher inflation on near-term market growth and due to unfavorable foreign exchange. Moving to P&L, we now expect adjusted gross margin of approximately 85% of sales and forecast an adjusted operating margin ratio of approximately 52% of sales.\n\nTurning to the fourth quarter, we anticipate net revenues of approximately $15.2 billion. At current rates, we expect foreign exchange to have a 2.5% unfavorable impact on sales growth. We expect adjusted earnings per share between $3.65 and $3.69. This guidance does not include acquired IPR&D expense that may be incurred in the quarter.\n\nFinally, AbbVie's strong business performance continues to support our capital allocation priorities. We generated $17 billion of free cash flow in the first nine months of the year, and our cash balance at the end of September was $11.8 billion. Underscoring our confidence in AbbVie's long-term outlook, today we announced a 5% increase in our quarterly cash dividend, beginning with the dividend payable in February 2023. And we remain on track to achieve $30 billion of cumulative debt paydown by the end of this year, bringing our net leverage ratio to 1.8 times.\n\nIn closing, AbbVie's strong performance allows us to reaffirm earnings expectations in the face of economic pressure. And with our diverse portfolio, we continue to be well-positioned to deliver long-term growth. With that, I'll turn the call back over to Liz.\n\nLiz Shea -- Vice President, Investor Relations\n\nThanks, Rob. We will now open the call for questions. [Operator instructions] Operator, we will take the first question.\n\nOperator\n\nThank you. Our first question is from Chris Schott from J.P. Morgan.\n\nChris Schott -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks so much. Just my question is really centered around Humira. And I know you -- appreciate some of the access commentary you made at beginning of the call, but are there any surprises so far in these discussions as we think about where either rebates or prices settling out for Humira? And I'm really sure I was trying to get my hands around, I think previously, you've commented you expected U.S.\n\nHumira erosion to be down roughly 45%, plus or minus 10%. And I just was wondering if that range holds given what you know today about the negotiations? And if I could just do a quick follow -- second question, immunology. There was a European JAK update out this morning, and I just was wondering any impact you expect to the Rinvoq franchise for that? Just maybe some context about how relevant, I guess, Europe was as part of the mix? And does that label update kind of impact your outlook at all? Thanks so much.\n\nRick Gonzalez -- Chairman and Chief Executive Officer\n\nOK, Chris, this is Rick. I'll cover part of that question, and then I'll have Jeff fill in on any additional commentary around the contracting. I think first, if we talk about the 45%, plus or minus 10%, that is the range that we gave. We're obviously working on doing the final forecasting for 2023.\n\nAs we've said in the past, there are two major components, which will play into that forecast. One is how are the biosimilars priced, that will certainly have some impact. We won't know that until we actually get into the market and start to see some of that activity. But the other big component is obviously our coverage, our access coverage for Humira and the position that Humira has on those formularies.\n\nI would say that negotiating by Jeff's team is going very well. As I mentioned in my comments, we're at about 80% of all covered lives now, and I would expect that to rise to a level that's above 90% as we move toward the end of the year. Once we have a final number there, it will allow us to do the final modeling for 2023, and that's at the point where we'll be able to refine that 45% plus or minus 10%. I'd tell you it's going on track.\n\nI would say there's no surprises, and I'd say I feel good about how the negotiations are going with all the major managed care organizations and PBMs. Jeff, anything you'd add there?\n\nJeff Stewart -- Executive Vice President, Chief Commercial Officer\n\nNo. Just to confirm, Rick, that no real surprises in terms of where we've been. And as we've communicated before, our principles of co-existing over time with one or more biosimilars seems to be the way that the market will play out. And certainly, like we saw in Europe that we had the principle of -- for patient continuity to concede pricing to maintain that patient access.\n\nSo Chris, no major surprises that we've seen so far.\n\nRick Gonzalez -- Chairman and Chief Executive Officer\n\nAnd then do you want to talk about PRAC? Maybe you and Roopal, can talk about PRAC.\n\nJeff Stewart -- Executive Vice President, Chief Commercial Officer\n\nMaybe, Roopal, you could address the procedure and where we are in the procedure, and I'll cover the commercial.\n\nRoopal Thakkar -- Vice President, Regulatory Affairs\n\nYeah. Thanks, Jeff. I'll give some context. So the next step here after PRAC would be moving to the CHMP here in November, and then the European Commission should finalize this.\n\nWe expect December or January. So PRAC completed their review, and what we see in the labeling is an update in warnings, and this is related to outcomes of the oral surveillance study. And in particular, in Section 4.4, which is the warnings, there's a list of subgroups that were found to be at risk based on analysis from oral surveillance. For example, patients greater than equal to the age of 65, those that are at risk for cardiac events, smokers, for example.\n\nAnd in these patients, the use of JAK inhibitors would be after a consideration of other therapies, if I'm paraphrasing, if no suitable alternatives. So this is consistent with the practice of medicine. It provides specific guidance, and we would say pragmatic at this stage.\n\nJeff Stewart -- Executive Vice President, Chief Commercial Officer\n\nYeah. And Chris, to that point, I mean, this is largely consistent with what we see from oral surveillance and the Xeljanz label, which is widely sort of understood by the European physicians. And so to cut to the quick, we don't anticipate a material impact as this continues through the process.\n\nLiz Shea -- Vice President, Investor Relations\n\nThanks, Chris. Operator, next question please.\n\nOperator\n\nThank you. Our next question is from Tim Anderson from Wolfe Research.\n\nTim Anderson -- Wolfe Research -- Analyst\n\nThank you. I was under the impression that we get more granularity on Humira erosion this quarter, and you're saying that's really going to come in Q4. So, I'm wondering did I kind of not hear it right before, or has something changed? And then second question is just on contracting in general, my understanding is that payer contracts, really not rock solid. They can be reopened when there's a change in the marketplace on things like pricing, in this case of biosimilars.\n\nSo, when we do kind of get whatever next level of guidance we get from you, isn't that going to continue to remain fluid? Because market dynamics won't all play out as of January, we'll get to mid next year, you'll get more entrants, you'll know pricing better and that sort of thing? Thank you.\n\nRick Gonzalez -- Chairman and Chief Executive Officer\n\nYeah, Tim, this is Rick. I'll cover that one. So, I think we've talked a number of times on these calls about what we project in the third quarter call, and I believe what we said is that we would ultimately provide you an update on where we were in the process. And so that's what we attempted to do.\n\nI can't give you a number for 2023 until I know what the total access is, and not all those contracts are done yet. They're proceeding well, so I feel good about that. But until we actually know that the contract is solid and we know what that access looks like, we can't give you an accurate projection. And I understand the desire by the investment community.\n\nI understand what that number is, but I think you probably also understand that we want to give you the most accurate number that we can give you, and we don't want to give you a number that's not accurate. And so it is going to require us until we get to the fourth quarter call to provide that for you. You are correct, in a sense, about the way you describe how these contracts work. They can be reopened at some point in time.\n\nI wouldn't say that's all that common usually, and in particular, I'd say around this kind of a situation, you're going to anticipate what you think is going to happen in the second half of the year and try to position the contract in a way that it can ultimately deal with those changes going forward. But you are correct to say that they could reopen a contract if they chose to do that. There are various kinds of contracts that we use. In some cases, there are penalties or repercussions that would have to come into consideration if a contract got reopened at some point in time.\n\nThey're not all like that, but many are like that. So it varies. And I'd say generally speaking, your concept is valid. But I would say it's probably a little less fluid than the way you necessarily described it, particularly in this environment where we know there will be a number of biosimilars coming in.\n\nSo you anticipate that we've built the contracts around that set of assumptions. Jeff, anything you'd add?\n\nJeff Stewart -- Executive Vice President, Chief Commercial Officer\n\nNo, I think, Tim, Rick described it in the right way. While there are typically, there are typically out clauses based on timing or other dynamics. I think one of the considerations is obviously, as we've highlighted before. Most of the biosimilars are going to be coming in the second half of the year.\n\nSo to some degree, that actually limits if it was a rare case. And they typically are rare where a contract is blown up or renegotiated in the middle of the year. That length of time that's left in 2023 for some of those payers to let's take a negative action puts some natural constraint on them in terms of when they would time that out. But Rick highlighted it very nicely in terms of the dynamics.\n\nLiz Shea -- Vice President, Investor Relations\n\nThanks, Tim. Operator, next question please.\n\nOperator\n\nThank you. And our next question comes from Mohit Bansal from Wells Fargo.\n\nMohit Bansal -- Wells Fargo Securities -- Analyst\n\nGreat, thanks for taking my question. And maybe one more question on the contracting side. Could you help us understand if the pricing part of the contracts is something that you have a good handle on at this point? And then a follow-up question is that how do you think about the cadence of BD activity once you hit the mark of less than two times leveraged by end of the year? Thank you.\n\nRick Gonzalez -- Chairman and Chief Executive Officer\n\nJeff, do you want to cover that?\n\nJeff Stewart -- Executive Vice President, Chief Commercial Officer\n\nYeah, so look, in terms of what Rick had highlighted in terms of our confidence in projecting the 80%. Obviously, there's a couple components to that. So we have -- while all the contracts aren't fully complete with the ones that we've done. We've done some significant modeling work to understand if we're retaining the ability to stay on the formulary.\n\nWe would model our volume like how much would we retain versus would go to one or more biosimilars. That's something that we can understand. And we have made base case, both first half and second half pricing assumptions based on those contracts. Now what's been highlighted in the last couple of questions is there's still uncertainty on the rest of the contracts that are yet to been secured and also a bid on that second half price dynamic.\n\nSo those are the elements that are going to give us more confidence as we go to the fourth quarter call to give everyone a secure number for next year.\n\nRick Gonzalez -- Chairman and Chief Executive Officer\n\nThis is Rick. I'll cover your business development question. I think if I step back and I look at where are we today. We have been for the last several years operating with an approach of roughly $2 billion to add incremental pieces to the business.\n\nWe've effectively used that over the last several years to be able to build some additional, particularly, I'd say early stage pipeline assets to the company. We're continuing on that same approach right now. Now having said that, we obviously have paid down debt very rapidly. We will be in a position where if we chose to do something, we could do something.\n\nI'd say if I look at the business today and I look at how it's performing around the expectations that we had for the business going forward, I would say there's no need for us to be able to do anything in that area. And I'd go back to the original premise of what we described to the investment community of what we believed would happen when biosimilars entered the U.S. market for Humira. What we said was that we believe the bulk of the erosion would occur in 2023, some additional erosion in 2024, in 2025 and beyond.\n\nWe would return to significant growth. We'd be able to deliver high single digit growth from that point forward through the end of the decade. That's what we said. Everything I know about the business today would suggest to me that we are able to do just that.\n\nAnd we're confident that we're able to do that with the portfolio we have and the late-stage pipeline and additional indications that we have coming forward. Having said that, I can also tell you that, over the last 10 years, we've demonstrated to ourselves and hopefully to you that we can acquire businesses and assets and we can integrate those and we can successfully drive those. And so if we found something that we thought was very important to add to the business, we certainly have the financial wherewithal and this business has tremendous cash flow. We could do that.\n\nI can tell you we don't see that right now. So I wouldn't assume that. And the other thing I'd point out is, as an example, the most important thing, and I know everyone is focused on what that erosion curve is going to look like, including us, to be honest, but -- and I know why. But probably the single most important thing for us going forward to hit what I described to you a moment ago is that underlying non Humira business growing at a rate that it can drive those expectations.\n\nAnd that's key and I'd say there's two factors that are most important around that. The first is that Skyrizi and Rinvoq grow fast enough that they can more than offset that they can essentially grow through all of the erosion that occurs on Humira and deliver incremental performance of above and beyond that. And I feel highly confident in that. I mean, when you can look at the trajectories of those assets now in the early phase we're in right now in IBD and PSA.\n\nI would say, I have a very high level of confidence that they will perform at that level or well above that level. Then the second thing is all the other growth assets they have to be growing fast enough that they can get us to be able to grow at that rate that I described. And if you take this quarter as an example, and you look at the business without Humira, the underlying growth is about 6.5%. And remember that 6.5% is absorbing the economic impact we see in the aesthetics business and the market and competitive dynamics that we see in Imbruvica.\n\nSo that's -- that tells you that underlying growth is pretty strong. And so I think those are the important things that investors have to focus on. And the erosion curve is certainly one of those. And I'm sensitive to the fact that you want to know when you're going to hit trough earnings, and I recognize that.\n\nAnd that's why we wanted to provide you some assurance of what that trough earnings is going to look like.\n\nLiz Shea -- Vice President, Investor Relations\n\nThanks, Mohit. Operator, next question, please.\n\nOperator\n\nThank you. Our next question comes from Terence Flynn from Morgan Stanley.\n\nTerence Flynn -- Morgan Stanley -- Analyst\n\nHi, thanks for taking the questions. Maybe two for me. Rick, I appreciate your comments on 2023 and the aesthetics business. No, you don't want to give guidance.\n\nBut I guess at a high level, do you think you can grow that franchise next year versus this year? And then on epcoritamab, congratulations on the filing there. Just wondering what you're expecting regarding the requirement for inpatient administration. J&J recently got approval of their bispecific and myeloma and looks like there's a requirement there for inpatient administration of the drug during the step up period. So just wondering how we should think about inpatient versus outpatient dosing of epco? Thank you.\n\nRick Gonzalez -- Chairman and Chief Executive Officer\n\nOK, excellent. Thanks, Terence. I'll cover the first one. So if I look at the aesthetics business, we're clearly seeing this economic pressure in the U.S.\n\nAnd I would expect that we will see that to continue into 2023. Certainly, it's difficult to predict what will happen in the U.S., will it get worse? Will we go into a recession? Will it stay about the same? I'd say, we're looking at this extremely carefully. But good news right now I would say is that the factors that we're looking at that seem to be driving this consumer confidence and behavior the most in the U.S., appeared to have stabilized at the levels that they're at. And so I would say that's a positive thing.\n\nNow it's fluid because obviously if the economic situation got worse in the U.S., my guess is they would trend down again. And so -- but at least it appears right now that they've stabilized and maybe even ticked up just a little bit, moved in a positive direction just a little bit. I think it's very difficult to predict. Here's what I would assume.\n\nI would assume that a significant part of 2023 we will have an impact on it. Now also recognize that we saw this phenomena as we said in the last call start in May. We weren't sure at the time whether it was the summer season starting a month early or it was the economic impact, because we had been watching the indicators and they trend down several months ahead of that. But we didn't see an impact until the month of May.\n\nSo the point is, when we hit May and beyond, we're going to be lapping the impact. So the negative impact will be softened on the business. So we'll return to better growth rates no matter what just mathematically, right. So -- but I think the best prediction we can have is it's going to have an impact in a good part of 2023.\n\nI think it's the best way for us to think about it. Now again, the rest of the business has an opportunity to be able to offset that as we saw in this quarter.\n\nRob Michael -- Executive Vice President, Chief Financial Officer\n\nAnd this is Rob. I would just add that if you think about more long term. If you think about what happened in '08 and '09, the business declined high single digits and then we saw, after that very robust growth in the mid-teen to the next decade. So given that penetration rates are still very low today.\n\nThere's clearly ample opportunity to grow this market. I think once you get on the other side of the economic impact which we expect to be transient. We still expect as business to deliver long-term growth as Rick highlighted earlier, we're still on track for that. Long-term high single digit growth getting to greater than $9 billion by 2029.\n\nSo we'll have to navigate, obviously, the short-term economic impact. But we still have tremendous confidence in the long-term outlook for aesthetics.\n\nRick Gonzalez -- Chairman and Chief Executive Officer\n\nEpco?\n\nNeil Gallagher -- Vice President, Development and Chief Medical Officer\n\nHey, this is Neil Gallagher. I will take the epco question. So the first thing I just want to caution, put a word of caution before I answer your question directly around inpatient stay, which is that the patient population that our competitors studied with the BCMA, CD3 is quite different in terms of overall benefit risk. So the indication that was granted was in fifth line plus multiple myeloma, which is very heavily pretreated and frail population.\n\nSo to extrapolate any interpretation of benefit risk from that population into the relapsed/refractory DLBCL population that we have studied and filed for with epcoritamab would not be valid, so just a word of caution there. That said, the study that we have filed had required for a 24-hour patient stay overnight -- one overnight stay. However, in subsequent studies we are aiming to remove that requirements so patients would not require -- be required to remain overnight. And we do believe because of the emergent and stable overall benefit risk for epcoritamab, a couple of things that we believe that it has the potential to be best-in-class, and we also believe that our strategy to remove overnight stays is a very valid one and reasonable one to pursue.\n\nHope that answered your question.\n\nLiz Shea -- Vice President, Investor Relations\n\nThanks Terence. Operator, next question please.\n\nOperator\n\nThank you. Our next question is from Andrew Baum from Citigroup Global.\n\nAndrew Baum -- Citi -- Analyst\n\nThank you. A couple of questions please. First on in Imbruvica, I'm assuming that Imbruvica is going to be included in the top 10 CMS lists for price negotiation under Medicare next year. Assuming that's correct what do you think about the impact on net pricing from Imbruvica.\n\nDo you anticipate pricing -- net pricing coming under pressure prior to 2026, given the contracting that's expecting to take place among your competitors to secure favorable positions given their catastrophic coverage burden on PBMs post the IRA implementation? So is the impact going to get brought forward for the class including for Imbruvica before you actually get the price cut coming? And then then seconds with epcoritamab, there's been some interesting data on the importance of profound B-cell depletion in lupus using CAR T assets, as CD20 bispecific could get to a similar level. I'm wondering whether you have interest in pivoting epcoritamab and exploring it in refractory lupus as one of your competitors already is particularly given you have a subcu administration, which obviously has some advantages? Thank you.\n\nJeff Stewart -- Executive Vice President, Chief Commercial Officer\n\nYeah. Hi Andrew, it's Jeff. I'll take your first question. So when we -- obviously we're still studying very carefully the IRA and we're also discussing directly with CMS not just through pharma, but our own company in terms of how they're going to basically select the different drugs that will be negotiated.\n\nThat's a little bit unclear at this point. It's not unreasonable based on the size of Imbruvica to suspect it will be one of the earlier drugs that could potentially be negotiated, so just to clear that. In terms of what may take place before that potential negotiation in 2026, I would expect to see some modest changes in rebate. We see very small levels at this point now but we do have a third competitor coming.\n\nSo that would be something that we would continue to plan for as we move into that potential event.\n\nTom Hudson -- Senior Vice President, Research and Development and Chief Scientific Officer\n\nYeah. This is Tom. Maybe I'll answer the lupus question. First, I'll say it's actually was very exciting to see that paper showing that B-cell depletion can actually put patients with very severe lupus in remission.\n\nIt's a very small study. Some five patients, but everyone's looking at this as a -- even with a surprise because we used to think we had to affect many mechanisms themselves in lupus. So that was one of the reasons it's so difficult. I used to be part of a lupus clinic in Montreal, so I know the challenges with patients.\n\nSo what we're looking at right now is we're asking yes, the answer to your question is can we use our existing assets and collaborations to see if we can do B-cell depletion, for as a treatment for lupus? The answer is yes. And the type of questions we're asking ourselves is, do we have to have as deeper depletion as we have with in heme malignancies? Nobody knows the answer. That might be important because if you have to have a very deep depletion it might be restricted more to more of the severe patients and again that would be an advantage. But if we want to go to all lupus patients because not all lupus patients are, are flaring all the time.\n\nThe majority have a normal life. Go to the clinic once a year and just see their physicians when they have flares. So going to a very deep regimen for B-cell depletion might be deemed to too severe. So the questions is yes we're looking at it and trying to figure out what's the right regimen and how to approach that in lupus is very exciting questions, which we're obviously looking into.\n\nLiz Shea -- Vice President, Investor Relations\n\nThanks Andrew. Operator, next question please.\n\nOperator\n\nThank you. Our next question comes from Steve Scala from Cowen.\n\nSteve Scala -- Cowen and Company -- Analyst\n\nThank you. What is your level of confidence in a positive outcome for Vraylar in MDD at the end of the year? I imagine the review is well along, so you probably have good visibility. So for instance our labeling discussions underway, is the sales force being trained, etc. This is a very large opportunity that does not seem to be a point of external focus as far as I could tell.\n\nSo I'm wondering what you could tell us about how things are going. Thank you.\n\nRoopal Thakkar -- Vice President, Regulatory Affairs\n\nHi, it's Roopal. Thanks for the question. Maybe I'll go and then Jeff can talk about the opportunity. You're correct, the review is proceeding per our expectations.\n\nWe have two positive studies in the space. I mean, recall, we also have the same endpoint -- the depression endpoint that's read out in three other bipolar depression studies that are already within label. So there's quite a bit of evidence that's already been generated, that's in front of the agency now. So I would say it's proceeding well and we still anticipate a decision by year end.\n\nAnd I'll pass it to Jeff.\n\nJeff Stewart -- Executive Vice President, Chief Commercial Officer\n\nYeah. Steve, and just in terms of your salesforce question, I mean, we are very encouraged and excited about this potential approval. I mean, obviously we continue to gain share week-by-week sequentially for our base indication -- the bipolar indications. And we know that based on the profile that we have with Vraylar.\n\nSo very, very strong efficacy -- proven efficacy of a very good tolerability profile for an antipsychotic, no material weight gain, low metabolic effects, and I think importantly maybe not as appreciated it's -- there's no titration. You have a very simple starting dose of 1.5 milligrams. So as we do our research, we see that that profile is very strong as this potential add-on therapy and depression. In the last decade there's been only one drug that's been approved for this indication and that's Rexulti, and we think that's a branded drug, obviously, and we think we can compete very, very well.\n\nSo we have a big existing sales force and infrastructure. We are gearing up in terms of training. We have the established relationships across the big primary care doctors, as well as the psychiatrist. So we are -- we agree with your approach.\n\nThat's a meaningful commercial opportunity that could evolve very quickly here once we get the approval.\n\nLiz Shea -- Vice President, Investor Relations\n\nThanks, Steve. Operator, next question please.\n\nOperator\n\nThank you. Our next question is from Gary Nachman from BMO Capital Markets.\n\nGary Nachman -- BMO Capital Markets -- Analyst\n\nThanks. Good morning. First could you just provide some more color on how much of a benefit you're seeing for Skyrizi and Rinvoq and IBD? As you've been spending more time with the GIs, and have your outlooks changed on a potential there as major contributors to the long-term growth for those franchises? So where are both of those being used in the treatment paradigms for the respective indications in Crohn's and ulcerative colitis? So that's one. And then secondly, just opex came in much lower than we expected, so you seem to be getting better operating leverage than what you originally guided.\n\nAre there areas where you've scaled back in spending, whether in Aesthetics or heme/onc if there's pressures there? And how will you be thinking about that into the Humira LOE next year? So how much additional flexibility might you have on the spending side? Thanks.\n\nRick Gonzalez -- Chairman and Chief Executive Officer\n\nJeff?\n\nJeff Stewart -- Executive Vice President, Chief Commercial Officer\n\nYeah. I'll take the IBD question. I think we've mentioned before that the IBD has been a very important part of our long range plan and when we gave the 2025 guidance, it looks relatively small because they're just ramping now. I would say that as AbbVie we are very, very encouraged.\n\nAs I mentioned in my prepared remarks on the launch, and maybe I'll start with what we're hearing from the gastroenterologists. I think first is they, they look at both assets and the global guidelines, the impressions and the clinical approach that we hear from the top leaders and also the community gastros is this idea over, I have to start to think about endoscopic healing, higher basically rates of efficacy and more significant clarity on what it's doing in the bowel versus just symptoms. And that seems straightforward, but we see the market moving very, very fast there in terms of understanding and that's what we can deliver, whether it's the Skyrizi data on the endoscopic healing rates with a very, very convenient and strong safety profile, or similar on the Rinvoq side in second line in the U.S. second line for patients that aren't doing well in UC.\n\nSo we see rapid adoption already as I mentioned, that in the Rinvoq in the United States will be a second line plus based on the label. And we see very, very fast adoption. I'll give you some color on it. Xeljanz had been approved and is approved in UC in the United States, but basically it had very low adoption.\n\nWe're seeing now in the community that 70% of the prescriptions are coming from physicians that have never written a JAK before. So it shows you that the clinical profile of Rinvoq in terms of its speed and the depth of the response is being viewed very, very well. So not only is that encouraging for Rinvoq, you see as I mentioned we're going to have the approval for Crohn's for Rinvoq in later lines next year as well. Skyrizi continues to surprise us to the upside, as you've heard from the call today.\n\nThis is viewed increasingly as the preferred frontline drug coming straight out of the gate for Crohn's in the U.S. And the qualitative data that we're starting to see, and we are seeing some quantitative data that looks very strong, too, is that this is viewed as a already as a best-in-class product for Crohn's, which is a very, very substantial market. So we are very encouraged. We continue to say that the IBD is probably underappreciated, and we'll continue to give updates as these launches progress.\n\nRob Michael -- Executive Vice President, Chief Financial Officer\n\nSo Gary, this is Rob. I'll take your question on opex. If you look at the benefit we're seeing, about half of it is actually coming from the stronger U.S. dollar, so it's more of an FX impact.\n\nThe other half is spend productivity. We always look for opportunities to drive more productivity in our spend. It's not so much about scaling back in parts of the business, we always look for ways to spend better, buy better. And ultimately, that helps us.\n\nIn many cases also, over the long-term, redeploy that investment to drive growth. If you think about '23, I've said, given that 46% to 47% operating margin directional input. I've also said we're not going to cut back investment. We'll obviously be prudent given that you will see a decline in gross margins next year, but we're not going to be cutting back investment because we expect to return to growth quickly.\n\nSo you'll see us not necessarily cut back, but certainly put more behind this business to drive that long-term growth that we expect to be industry-leading over the long term.\n\nLiz Shea -- Vice President, Investor Relations\n\nThanks, Gary. Operator, next question please.\n\nOperator\n\nAnd our next question comes from Colin Bristow from UBS.\n\nColin Bristow -- UBS -- Analyst\n\nHey, good morning. Thanks for taking the questions. So first on CF, you recently posted an updated clinical trials for your new C2 corrector-based regimen. I just wondered if you could walk us through what gives you confidence that this has a higher probability of success versus your last deterioration? And then second one for Rick, I just wanted to touch base on your succession plan.\n\nIt's been an increasingly sort of important or a frequent topic with investors. You've been the architect of AbbVie's success inception, and so just wanted to confirm specifically how long you expect to stay in the seat? And then how should we think about the time lines around the process of identifying your successor? Thank you.\n\nTom Hudson -- Senior Vice President, Research and Development and Chief Scientific Officer\n\nWell, this is Tom, I'll answer the CF question. Again, this is very challenging to actually make that abnormal CF protein get to the membrane and act as a chloride channel, and it takes three different drugs to make it effectively to get it to the cell membrane and open up in the right way. And so we all felt that we had intakes, we call them Corrector 1, Corrector 2 and Potentiator, these three different compounds. We always see good results with double our C1 corrector.\n\nWe think it's best-in-class. Our potentiator is very good. What we had difficulty is to get a good C2 corrector, and what I presented earlier this year was that it wasn't good enough. But what we've done since then, we will continue to look at better ones and we came out with a differentiated product, 576, which is structurally different and the data supports higher safety margin, higher exposures, good PK.\n\nHopefully, a single pill. And then we'd be able to get to this -- to be able to have this triplet which is really important to be competitive. So again, our doublet, the data we had was very strong. But we need that third piece, and that third piece seems to be coming along really well.\n\nThat's what you really saw on the website at ct.gov is moving to evaluate this triple combo with our new C2 corrector.\n\nRick Gonzalez -- Chairman and Chief Executive Officer\n\nAnd this is Rick on the succession question. I'd say that, we obviously have a very experienced board, and we've had an active approach on succession going back to about 2016, 2017. And that process has proceeded extremely well in developing internal candidates to ultimately assume the role when I do retire. I can tell you that there are no plans at all for me to retire in 2023.\n\nThe most important thing to me and to the board is to make sure that the business is performing exactly as we expect going forward, and we're not going to make any transition until we've gone through the biosimilar event, and we're confident in the performance of the overall business. That would be the appropriate time once we're confident to make a transition at that point. We've also had discussions with the board of what that transition would look like. And assuming it's an internal candidate, the transition will essentially work where we will name a new CEO.\n\nAnd at that point, I will assume the role of executive chair for a period of time thereafter. So I think we have a well-thought-out succession approach. I feel very comfortable with the approach, I feel comfortable with the work we're doing to develop the internal candidates. And I think the transition when it occurs, I think, will go smoothly and be successful.\n\nSo hopefully, that answers your question.\n\nLiz Shea -- Vice President, Investor Relations\n\nThanks, Colin. Operator, next question please.\n\nOperator\n\nThank you. Our next question comes from Chris Shibutani from Goldman Sachs.\n\nLiz Shea -- Vice President, Investor Relations\n\nChris, are you there? We can't hear you.\n\nOperator\n\nPlease check your mute feature, Chris?\n\nChris Shibutani -- Goldman Sachs -- Analyst\n\nYes, apologies. Two questions, if I may. On Rinvoq, you had previously commented that you were seeing some use in the first-line setting. Can you update us at all with any color there? Secondly, for Skyrizi, obviously, a very attractive market and an opportunity in Crohn's disease.\n\nCan you show us how you're thinking about the potential impact given the LOE in 2023 of a major branded players, STELARA? Thank you.\n\nJeff Stewart -- Executive Vice President, Chief Commercial Officer\n\nChris, it's Jeff. Just to clarify in terms of your Rinvoq question, was there a specific question related to a certain indication on the front line? Or I'm not sure I fully appreciate that one.\n\nChris Shibutani -- Goldman Sachs -- Analyst\n\nYes, no. In AD.\n\nJeff Stewart -- Executive Vice President, Chief Commercial Officer\n\nIn AD, OK, right. So yes, we do see frontline use across the globe and even in the U.S. And what we're seeing is now, as I mentioned in my remarks, we're seeing in-line in-play share, which is in the high mid-teens right now in the U.S., and it's higher in the international markets. So there seems to be, as we look to the research and we look to our market -- end market performance, there's really two segments of dermatologists.\n\nThere's very cautious dermatologists that are slow to adopt JAKs, and typically, they'll start in the later line, a second line plus. There is an emerging cohort of a significant group of dermatologists as well that basically are looking at the underlying high efficacy parameters, so basically like the EZ90 skin clearance and almost no discernible itch for the product. They typically are starting to use more and more in the frontline. So the overall balance is leaning toward the second line, but we do see increasing frontline utilization based on the profile of the drug in atopic dermatitis.\n\nIn terms of the Skyrizi for Crohn's, we think we're very, very well-positioned for a couple of reasons. One is the overall profile of the medicine is really exceptional, as I've highlighted, and we're going to see very, very rapid adoption both in the U.S. and the external market. In addition, we have anticipated the STELARA LOE.\n\nWe see that we have an ongoing head-to-head trial versus STELARA to make sure that we can continue to differentiate with direct data that will come over the next year or so, so we're anticipating that. And we think we're going to have a good setup to maintain the early momentum that we're seeing with Skyrizi.\n\nLiz Shea -- Vice President, Investor Relations\n\nThanks, Chris. Operator, next question please.\n\nOperator\n\nThank you. Our next question is from Geoff Meacham from Bank of America.\n\nGeoff Meacham -- Bank of America Merrill Lynch -- Analyst\n\nHey guys. Thanks so much for taking the question. I just have one quick one. Rick, lots of questions on Humira for next year, but I wanted to ask at a high level environment beyond that.\n\nI know there are formal treatment guidelines in I&I, but what's the risk that payers mandate cycling through one or more biosimilars? And what's the risk of the pricing environment doesn't really recover in '24 and beyond? Just obviously thinking about the Skyrizi and Rinvoq franchises over the long term. Thank you.\n\nRick Gonzalez -- Chairman and Chief Executive Officer\n\nSo I'm actually going to have Jeff walk you through that. He's probably the closest to that environment.\n\nJeff Stewart -- Executive Vice President, Chief Commercial Officer\n\nYeah, so thank you for the question. I mean, one of the things that we see certainly in the near term is that the formularies in I&I are actually expanding. So many years ago, you might have six or seven preferred agents. The payers are now requesting sometimes up to 11 or 12 preferred agents, so you're seeing an expansive nature in the short term.\n\nNow as you go forward, maybe middle of the decade or later where you have more and more biosimilars, could the U.S. environment move toward sort of a step through? I mean, it's possible. But we have, again, as I mentioned in my last statement, we have anticipated that with the right types of data, the trials. We have five head-to-head studies in Skyrizi in psoriasis, we have more coming in Crohn's.\n\nAnd so we think that basically, we have a data-driven approach that's going to continue to allow us to significantly differentiate our products. The other dynamic that we watch very carefully, and we talked about this during the Immunology Investor Day, is the lines of therapy as there's more and more high efficacy products that get introduced, continue to expand. So in the middle of the decade or longer, the second plus and the third line markets are going to be very, very significant at that point. So when we put all of that into the calculus we feel again, we have a pretty set up for the middle of the decade and longer.\n\nRick Gonzalez -- Chairman and Chief Executive Officer\n\nAnd this is Rick. I agree with everything Jeff said. The one thing I would add that as you think about even under a scenario where if we did get to some kind of a step at it, you have to go back and remember that most of these mechanisms, most patients fail, and they fail at a relatively high level and over a relatively short period of time. So even if you had to rotate through you're going to get to second line relatively quickly, and recycling somebody back through another TNF typically doesn't work very well for those patients.\n\nAnd I'd say the domain now with the kind of agents that we have in the market now and the level of remission that they can create, the demand among physicians is much higher to get patients into remission as rapidly as they possibly can. And so I think all those dynamics tell us that this model should continue to work over the long-haul.\n\nLiz Shea -- Vice President, Investor Relations\n\nThanks, Geoff. I believe we have taken all the questions in the queue, so that concludes today's conference call. If you'd like to listen to a replay of the call, please visit our website at investors.abbvie.com. Thanks again for joining us.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLiz Shea -- Vice President, Investor Relations\n\nRick Gonzalez -- Chairman and Chief Executive Officer\n\nJeff Stewart -- Executive Vice President, Chief Commercial Officer\n\nTom Hudson -- Senior Vice President, Research and Development and Chief Scientific Officer\n\nRob Michael -- Executive Vice President, Chief Financial Officer\n\nChris Schott -- JPMorgan Chase and Company -- Analyst\n\nRoopal Thakkar -- Vice President, Regulatory Affairs\n\nTim Anderson -- Wolfe Research -- Analyst\n\nMohit Bansal -- Wells Fargo Securities -- Analyst\n\nTerence Flynn -- Morgan Stanley -- Analyst\n\nNeil Gallagher -- Vice President, Development and Chief Medical Officer\n\nAndrew Baum -- Citi -- Analyst\n\nSteve Scala -- Cowen and Company -- Analyst\n\nGary Nachman -- BMO Capital Markets -- Analyst\n\nColin Bristow -- UBS -- Analyst\n\nChris Shibutani -- Goldman Sachs -- Analyst\n\nGeoff Meacham -- Bank of America Merrill Lynch -- Analyst\n\nMore ABBV analysis\n\nAll earnings call transcripts"
}