{
  "companyName": "Snap Inc.",
  "companyTicker": "SNAP",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/20/snap-inc-snap-q3-2022-earnings-call-transcript/",
  "content": "Snap Inc. (SNAP 1.59%)\nQ3 2022 Earnings Call\nOct 20, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, everyone, and welcome to Snap Inc.'s third-quarter 2022 earnings conference call. At this time, participants are in a listen-only mode. I would now like to turn the call over to David Ometer, head of investor relations.\n\nDavid Ometer -- Head of Investor Relations\n\nThank you, and good afternoon, everyone. Welcome to Snap's third-quarter 2022 earnings conference call. With us today are Evan Spiegel, chief executive officer and co-founder; Jerry Hunter, chief operating officer; and Derek Andersen, chief financial officer. Please refer to our Investor Relations website at investor.snap.com to find today's press release, slides, investor letter, and investor presentation.\n\nThis conference call includes forward-looking statements, which are based on our assumptions as of today. Actual results may differ materially from those expressed in these forward-looking statements, and we make no obligation to update our disclosures. For more information about factors that may cause actual results to differ materially from forward-looking statements, please refer to the press release we issued today, as well as risks described in our most recent Form 10-Q, particularly in the section titled Risk Factors. Today's call will include both GAAP and non-GAAP measures.\n\nReconciliations between the two can be found in today's press release. Please note that when we discuss all of our expenses, it will exclude stock-based compensation and related payroll taxes, as well as depreciation and amortization, and nonrecurring charges. Please refer to our filings with the SEC to understand how we calculate any of the metrics discussed on today's call. With that, I'd like to turn the call over to Evan.\n\nEvan Spiegel -- Co-Founder and Chief Executive Officer\n\nHi, everyone, and thank you all for joining us. While our business continued to face significant headwinds this quarter, we took action to further focus our business on our three strategic priorities of growing our community and deepening their engagement with our products, reaccelerating and diversifying our revenue growth, and investing in augmented reality. We believe that we can be successful in this new operating environment, but we must rigorously prioritize our investments and continue to delight our community with our products while driving success for our advertising partners. Growing our community and engagement is one of our most important inputs to long-term success because it increases our overall revenue opportunity and strengthens our network effects.\n\nOur team remains focused on expanding our product offering and deepening engagement with our global community, which increased 19% year over year to reach 363 million daily active users. Our revenue grew 6% year over year to $1.13 billion, and we generated adjusted EBITDA of $73 million and free cash flow of $18 million. We are focused on increasing our share of wallet as growth in the overall digital advertising segment slows by working to increase the return on advertising spend delivered by our direct response advertising platform as we believe these are the most defensible advertising budgets in a challenged economic environment. To achieve this, we are investing in driving scalable, lower funnel performance for our advertising partners and making improvements to our ad platform and Auction Dynamics so that we can continue to deliver strong returns on advertising spend.\n\nOur camera has evolved into a leading platform for augmented reality. Our AR products and services are already driving a major impact at scale today as Snapchatters use our services to shop, play, learn, explore, and entertain themselves. This quarter, we announced several new valuable partnerships, innovative AR experiences, and new AR features and capabilities in Lens Studio. Over 250 million people engage with augmented reality on Snapchat every day.\n\nAccelerating our lead in augmented reality helps us build a durable competitive advantage that comes from investing over the long term, building sophisticated technical tools and capabilities, and growing a platform that is increasingly differentiated and difficult to replicate. This momentum and the creative energy of the Snapchat community makes us incredibly excited about the future of augmented reality. As part of our reprioritization efforts, we have reorganized our team to better meet the challenges of the current environment and to make as much progress as possible as quickly as possible in the areas of our business that we are able to control. In particular, there is a significant opportunity to improve coordination and prioritization across our engineering, sales, and product teams.\n\nIn an effort to realize this opportunity, we promoted Jerry Hunter to Chief Operating Officer. Jerry leads our monetization efforts across our three operating regions, EMEA, APAC, and Americas, as well as our engineering, growth, partnerships and content, AR, and enterprise and SMB teams. Jerry has repeatedly demonstrated operational rigor at scale, leading our business through several challenging transitions, including the build-out of our advertising platform, the rebuild of our Android product, our infrastructure optimizations, and most recently, significant investments in our platform integrity team. With that, I'm excited to introduce Jerry.\n\nJerry Hunter -- Chief Operating Officer\n\nThanks, Evan, and thank you, everybody, for joining our call. I see significant opportunities for our business in the years ahead. As a business, our primary focus is on driving lower funnel performance and improving yield of our inventory for advertising partners. We're working to improve optimization against lower-funnel objectives to drive more conversions and innovating on our advertising formats in order to make them more native and engaging.\n\nImproving our product and technical performance of our advertising platform requires tight collaboration and teamwork across sales, product, and engineering. Our renewed focus will be on creating alignment across our teams to ensure that feedback from clients helps inform our product road map and that each of our teams is more directly accountable for advertiser success. After years of rapid growth in the size of our team, we're focused on driving productivity in our sales organization and improving our go-to-market with more clarity about the role that Snapchat plays in the lives of our community and how we can help businesses grow. We will listen to our clients, clearly understand their challenges and opportunities, and demonstrate how Snapchat can play a meaningful role in driving their success.\n\nWe're also working hard to deliver new revenue-generating opportunities, including spotlight, augmented reality advertising, and our Snapchat+ subscription service. We're expanding our advertising test within Spotlight in Q4, especially as we see many opportunities to introduce advertising formats that align well with this new content viewing experience. With hundreds of millions of people using AR every day, we have a huge opportunity to help businesses reach their customers with immersive and engaging augmented reality experiences. Snapchat+ represents an exciting opportunity to diversify our revenue streams outside of advertising.\n\nAnd we have a direct ability to increase subscribers with new product features and by driving awareness of our subscription offering. I couldn't be more excited to be here at Snap, and I look forward to sharing more about our plans for 2022 and beyond. Thank you. And with that, we can begin our Q&A.\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] In the interest of time, we ask that you please limit yourself to one question after your initial question is asked. Your line will be muted at this time.\n\nWe will pause momentarily to assemble our roster. The first question comes from the line of Eric Sheridan with Goldman Sachs.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks so much for taking the question. Maybe I'll do a two-parter if I can. I think, first, Evan, what people still want to hear is sort of looking back over the last four, five quarters as Apple made the policy changes they did and the industry has been in this sort of transformative mode over the last 12-plus months, what have been some of the key learnings of where you found the infrastructure and the ad product maybe less well-positioned in terms of what's happened from an industry shift standpoint? And turning to the forward timetable, you've obviously laid out an investment plan to sort of reposition the ad product for the long term. Can we get a better sense of like where you are in the process of repositioning the ad platform for the medium to long term? And how should we be thinking about what the pathway is in terms of headwinds versus tailwinds from a monetization standpoint? Thanks.\n\nEvan Spiegel -- Co-Founder and Chief Executive Officer\n\nThanks, Eric. Yeah. So, you know, at a high level, we're focused on building our business for the long term. And that means that we really put our community at the center of everything that we do, and we innovate to offer products that add value to people's lives, empowering them to express themselves within the moment, learn about the world and have fun together.\n\nAnd that long-term perspective is really what informs our strategy as we think about navigating this difficult macro environment that has impacted our advertising business over the past few quarters. So, we made the decision to reprioritize and focus our investments on our three strategic priorities: growing our community and their engagement, reaccelerating and diversifying our revenue, and investing in augmented reality. And these changes should allow us to drive continued growth in our community while delivering free cash flow even with low levels of revenue growth. And that gives us a lot more flexibility to focus on the long term in an environment where the cost of capital has increased quite dramatically.\n\nThere's a lot of opportunity to generate incremental revenue across our platform, whether that's our AR platform, Spotlight, or the Map. We've also been growing our Snapchat+ subscription service, which is another way that we deliver value to our community and allows us to monetize the high levels of engagement that we have across our service. Operationally, our advertising business has become a lot more technically complex over the past few years as advertisers are working to better measure and optimize their campaigns. That means that we need to drive increased coordination across our sales, engineering, and product teams, which is one of the reasons I'm so excited to have Jerry leading these teams as our COO.\n\nI've already observed a significant change in the way that our teams are working together, and I'm really pleased to see the focus on our advertising customers driving everything that they do. I mean, tactically, really, that means working to make conversions on our platform more observable and easier to measure, whether that's more on platform or click-through conversions, improvements to our first-party tooling, third-party tooling and partnerships, ad format improvements, ML, and optimization improvements, and of course, continuing to grow our inventory. We saw about an 8% increase in impressions year over year in the quarter, which is really a function of daily active users and engagements. And then as we're looking to the future, we've really tried to make sure that all of our investments are lined up against those three strategic priorities that I mentioned, community growth, revenue growth, and AR.\n\nAnd that's really how we're going to be working through this challenging environment.\n\nOperator\n\nThe next question comes from the line of Brian Nowak with Morgan Stanley.\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nGreat. Thanks for taking my questions. I have two maybe. Jerry, let me ask you a couple.\n\nSo, just can you give us some examples of one or two of the most important steps that you see yourself focusing on to really improve the performance-driven business and how quickly that business can ramp within the overall mix, this blocking and tackling? Then the second one, with U.S. time spent down 5% and really the core Snap Stories seem to be weathering decline. How do you think about sort of differentiating the pitch to advertisers and even users as your engagement is increasingly driven by short-form video and long-form video? Thanks.\n\nJerry Hunter -- Chief Operating Officer\n\nThanks for the question, Brian. I'm excited about the opportunities we have for our business. Advertising has become more technical as signals and measurement continue to evolve. Actually, I have three things I want to tell you about.\n\nFirst is building up the connective tissue between sales, engineering, and product. That includes feedback mechanisms in the product from sales and customers and better go-to-market planning that ensures customer success in our platform. Two is continuing to strengthen our DR business, which we know is more defensible, both in good and challenging times. We'll do this by continuing to drive our first-party measurement, and we're seeing strong adoption by our top advertisers, making our systems work better with third-party measurement systems like Google Analytics and continuing to improve personalization and optimization.\n\nAnd the third thing is bringing top talent to our three president roles for the Americas, APAC, and EMEA. One of them Harris is going to join us next week. This will ensure that we're improving our focus on customers in every region and getting closer to the customers' needs. I think these priorities will set Snap up to be successful in this current environment.\n\nEvan Spiegel -- Co-Founder and Chief Executive Officer\n\nYes, I can speak a little bit to content trends that we're seeing in the U.S. and more broadly. So, at a very high level, both in the U.S. and globally, viewership is up.\n\nAnd so, that means that our overall opportunity is expanding if we can continue to increase folks' depth of engagement. And that's really important, of course, for advertisers who really value the reach that we provide. Looking more specifically at Stories, what we're finding is that while people continue to engage at really high levels with Stories from their close friends or private stories, especially from people that are really important to them, that depth of story engagement you get to your 200th friend or something like that, at some point, content on Spotlight or Discover is maybe more engaging or more interesting. And so, what we're trying to do is help people transition from that friend story content that really drives that healthy top-of-funnel and viewership to content in Spotlight and Discover.\n\nAnd both of those are growing nicely. Spotlight, of course, is growing very rapidly year over year, and we're excited about that. I think as it pertains to advertisers, as I mentioned, they're really looking for reach but they're also looking for performance, especially in this period of time, which is why we focus so heavily on evolving our direct response business and making sure that we're really delivering return on ad spend for our partners. I think there are going to be some unique opportunities with things like Spotlight, for example, where smaller advertisers can experiment with content, submitting content to Spotlight, seeing how it performs.\n\nAnd then if they get some traction there and get feedback from our community, they may want to turn into a direct response advertising unit and manage that through our ad platform. So, I do think some of the content investments we're making provide new and unique opportunities for advertisers, but really, especially in this environment, the focus is going to be on reach and performance.\n\nOperator\n\nThe next question is from the line of Rich Greenfield with LightShed Partners.\n\nRich Greenfield -- LightShed Partners -- Analyst\n\nHi. Thanks for taking the question. I want this one specifically for Evan. I guess it's pretty obvious that you're a sticky utility for photo-based messaging, especially among sort of your core demos.\n\nBut you're clearly losing engagement time spent to TikTok and maybe even other camera apps that have come on to the scene like BeReal impacting sort of overall time spent per user per day than in turn monetization. Curious on the -- I guess the most important question for you, especially on the product side is how? Like how do you get people to spend more time on Snapchat and especially more monetizable time spent on Snapchat? And like what is the plan for that in '23 because I think that's what investors are going to really be anchored on as they think about your stock over the next year.\n\nEvan Spiegel -- Co-Founder and Chief Executive Officer\n\nThanks, Rich. Yeah. So, you know, at a high level, as you pointed out, Snapchat provides an extremely valuable utility in terms of visual messaging but also across our service with things like the Map or our AR platform, and of course, content, as you also mentioned. And so, we've really worked hard to diversify engagement across our products.\n\nAnd our application opens to the camera, so we've got a real strength in visual communication and augmented reality that remains under-monetized, which is why we've really focused on accelerating our revenue growth in augmented reality so that it's more commensurate with the engagement that we're seeing there. And we believe that the differentiated nature of our service is what's contributing to the daily active user growth which grew 19% year over year to 363 million daily active users. In terms of the content specifically, I think there's a lot of headroom, of course, to continue to grow content engagement. As I mentioned, viewership has expanded, and we're continuing to see a lot of demand for content and Spotlight, which is growing nicely and on our Discover platform.\n\nI think we can do a better job helping people transition from friend stories or private stories into those types of content. And relative to other services where people are spending a lot of time watching content, we believe we have a lot of headroom to increase content engagement, so working to improve content diversity and personalization to realize that opportunity. Overall, of course, impressions grew 8% year over year. So, we are seeing some progress there.\n\nOperator\n\nThe next question is from the line of Mark Shmulik with AllianceBernstein. Please proceed.\n\nMark Shmulik -- AllianceBernstein -- Analyst\n\nYes. Thanks for taking the questions. A couple if I may. First for Evan.\n\nI know with the leak memo, there was kind of the numbers out there on internal expectations for 2023. And color you can share just how that's changed, given this is a fast-evolving macro market and a lot of changes with kind of new executives like Jerry on board and kind of the plans in place there. And then secondly, Jerry, I just kind of think about kind of new levers of monetization. And I know we're talking about kind of Spotlight ads coming on board here in the fourth quarter.\n\nAny color you can share in just kind of the road map of what else is there to kind of really reaccelerate revenue growth? I kind of look at stats like Samsung phones, 2.5 billion snaps. And so, just how do we think about the Camera Kit and AR Kit being monetized as well? Thanks.\n\nEvan Spiegel -- Co-Founder and Chief Executive Officer\n\nThanks, Mark. Yeah. So, that was an internal memo that we weren't intending to share publicly, and as such, had a number of aspirational goals really designed to rally the team, especially at a time when we're restructuring and refocusing our business, it's really important for our team to see the enormous opportunity that we have in front of us, whether that's reaccelerating our revenue growth by improving our direct response business, better monetizing the enormous amount of AR engagement that we see, obviously, in our camera, and continuing to grow and build on Snapchat+. So, we certainly see a lot of opportunity there, and the goal is really, as we look to 2023, inspiring our team.\n\nI remember some really challenging times in the past when expectations were really, really low. And internally, we tried to really inspire our team and that's what helped us deliver a 50% year-over-year revenue growth on average the last five years or so. So, I think especially in really challenging times, when we've taken the necessary steps to make sure our business can be successful over the long term, inspiring the team is critically important. But those goals are internal and aspirational.\n\nJerry Hunter -- Chief Operating Officer\n\nI'll take the second part of that question. In addition to the work on AR and accelerating the business that Evan touched on, I just want to give you a sense of how we're refocusing and realigning sales engineering and product teams around the customer. So, let me give you an example of a program we started a couple of months back called the Reference Customer Program. The idea is to find customers that we want to ensure getting the most from our platform.\n\nWe brought several SWAT teams together, a SWAT team that included folks from the account team, the engineering team, and product teams to review every aspect of how the advertiser was using the platform. And we found that through this, we were able to help improve their implementation, better utilize features that are already in the platform, in a couple of cases, did a little bit of feature integration work. In all those cases, the customers had higher ROI than expected and they were happy with their results. Now, we're in the process of rolling these successes out to other customers who might have similar opportunities.\n\nAnd I think that that's just a product of this -- of bringing the teams together. So, I think there's a lot of opportunity for us to just bring things together and take advantage of what we've already got out there and have it implemented in a better way.\n\nOperator\n\nThe next question comes from Ross Sandler with Barclays.\n\nRoss Sandler -- Barclays -- Analyst\n\nHey, guys, I just wanted to throw the macro question out. So, it sounds like it's mostly brand advertising that was weak in 3Q, and it seems like that's the area that's forecasted to really drop off as we kind of go forward here in 4Q. So, could you just maybe elaborate a little bit on what you're seeing? We can obviously see what's going on with the macro broadly, but specifically to like rest of this quarter, what commitments you're looking at that would cause those growth rates to kind of dip into the negative? And then related to one of the prior questions, you're growing your DAUs almost 20% and impressions 8%. So, it seems like we've just got a demand problem here, not a supply problem.\n\nCan you just talk to that a little bit? Thank you.\n\nDerek Andersen -- Chief Financial Officer\n\nHey there. It's Derek speaking. Thanks for the question. One, yes, in Q3, the deceleration in revenue growth was really observed across both our direct response and the brand advertising business, with the direct response advertising growing modestly faster than the overall business, while the brand-oriented advertising business declined slightly year over year in the quarter.\n\nAnd then in Q4, as we look forward, we expect the brand business to play a bigger role in the diesel that we anticipate to occur as we move through the quarter. And that being due to the fact that, number one, the growth rates were very high in the prior year, but also, it's a bigger portion of the business in Q4. I think stepping back, we've seen revenue growth move around over the last several months but within a relatively tight range. So, we grew about 13% in Q2, but we saw that decelerate as we moved through the quarter.\n\nAnd this led us to sharing, when we reported last quarter, that the growth was approximately flat in the early portion of that quarter. By the end of August, when we shared AK about the restructuring, the quarter-to-date revenue had improved to about 8%, and so that implied things accelerated a bit. With the full quarter number at 6% this quarter, obviously, things slowed down into about the low single digits in September. And then we've seen things move up a bit in the beginning of this quarter with the early weeks being at about 9%.\n\nAnd so, if you sort of take that together, what we're seeing is the growth rate has moved around month to month and accelerated or decelerated a couple of times. But we've largely been range-bound here between flat and the low teens as we continue to navigate this really difficult operating environment. And I think the thing I'd share here that's really important is something we've talked about several times in recent quarters, which is that it's incredibly fast and easy for advertisers to turn digital performance advertising on and off as they seek to calibrate their investments and their own growth in their business. And that's part of what we're seeing here with the start-stop on the growth rates in the accel and decel that we've experienced.\n\nSo, as we're navigating this, it's incredibly important that we stay focused on the inputs that we control. And you heard a lot about that from Evan and Jerry earlier around the investments we're making to grow the community, the investments to improve the DR business and of course, things like Snapchat+, which are helping to diversify the top-line growth and, of course, the future of AR. And then to your other question, in terms of supply versus demand, we continue to believe we have a significant room to grow our advertising business. And so, I do believe that as you've seen the macro challenges compound on some of the platform changes we saw last year, certainly, we've been demand-challenged, and we continue to see a lot of opportunity to grow, grow our business with impressions as you see in the most recent quarter with those impressions growing but also through eCPMs as we can continue to get better at our direct response business, including optimization, personalization and ranking, which Jerry talked about a lot earlier.\n\nSo, I agree with you on that point. Hopefully, all of that provides a little bit of context for your question.\n\nOperator\n\nThe next question is from the line of Lloyd Walmsley with UBS.\n\nLloyd Walmsley -- UBS -- Analyst\n\nThanks. First one is just you talked about expanding Spotlight test this quarter. You just talked about being kind of just demand-constrained. So, curious how you guys think it plays out if we think about adding inventory from spotlight, reducing eCPM.\n\nHow responsive is the community to moving budget over as that ad load ramp since CPMs come down? How easy is it for advertisers to shift that creative and see ROI in the spotlight format? And then second one if I can. You talked about taking $450 million out of the cost base. I think it was kind of an exit 2Q annualized number. Can you just talk about what kind of growth we should expect on that new cost base in terms of either headcount inflation or other cost growth on this new base heading into '23? Thanks.\n\nDerek Andersen -- Chief Financial Officer\n\nIt's Derek speaking. Thanks for the question. So, in terms of the first one around monetizing Spotlight, as we look into Q4, we will expand our advertising tests within spotlight. But in addition, businesses already have several mechanisms to test and learn directly within Spotlight, so businesses are able to submit content to Spotlight, see how it performs within our community, receive direct feedback from our user base and then use those learnings to inform their campaigns.\n\nWe believe that this is a good example of how Spotlight offers an exciting new way for brands to experiment with their video creative and learn how to make content that inspires the community. We're also working on new tools that will enable businesses to easily promote their most engaging Spotlight content, drive conversations and then measure their success with ad managers. So, at a high level, we're really excited about the potential for Spotlight. But we also have a lot of room, as I just mentioned, to grow our advertising business regardless of how and when we ramp Spotlight ad load, sorry.\n\nSo, we're ramping our testing judiciously there to make sure that we maximize the long-term value.\n\nOperator\n\nThe next question is from the line of Mark Mahaney with Evercore.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nOK. Thanks. Two questions, please. First is, as you try to -- thoughts on Scan 4.0 when that comes out sometime this quarter.\n\nDo you think your thoughts on whether that will help you or not? At the same time, I think you've been trying to recover signal. You've been doing a series of things to try to improve ad attribution, ad targeting. Just where are you on that? And then you talked about ROI in the shareholder letter. Can you just quantify, like for people running campaigns, consistently running campaigns, how impaired is the ROI versus where it was kind of a year ago and the path to getting that back to levels that you had at that time? Thanks a lot.\n\nJerry Hunter -- Chief Operating Officer\n\nThis is Jerry. Let me talk about that first one on Scan 4.0. To take a step back here, we think it's critical. Measurement is critical.\n\nThat's why we've invested so heavily in first- and third-party measurement. And Scan 4.0 is important, the coming changes are definitely need improvements to help advertisers achieve their business goals. And better campaign attribution and more granular reporting should give us even more headroom for improvement. For the ROI part of the question, we are constantly evolving the best way we serve our advertisers.\n\nWe're continuing to update and improve our first-party measurement solutions, which are seeing continued adoption of our top advertisers. And they're seeing success on our platform as a result. We're also continuing to prove the way that third-party measurement systems like Google Analytics are reflecting conversions in our systems, and we're seeing positive results there, too. We're also driving our direct response ads to better convert right on our platform.\n\nThat improvement is happening through more experimentation with ML and integrating data from our privacy-protecting first-party measurement solutions so that our ranking and personalization are more effective. And I just -- I want to come back to the fact that this ad space is more technical, and it's just as important as the rest of these to talk about that integration between sales, engineering, and product teams and the processes that ensure that our advertising partners are achieving success by cross-functional process, tighter lines of communication and faster responsiveness to their opportunities and challenges.\n\nOperator\n\nOur last question comes from the line of Brent Thill with Jefferies.\n\nBrent Thill -- Jefferies -- Analyst\n\nThanks. Just on the brand side. I think many are curious kind of why brand will suffer so hard going into a seasonally strong period. Is this more macro-related? Is it -- given some of the restructuring, is that having some impact? And I guess, Evan, if you can also follow up on that.\n\nI know you -- there's been a lot of change. When do you expect that to kind of stabilize and that to flow through the system and you feel that you're on the right foundation from this restructuring activity?\n\nDerek Andersen -- Chief Financial Officer\n\nIt's Derek speaking. I'll take the first part of that and then hand it up to Evan. I think first, just stepping back for context on Q4. Even flattish year-over-year revenue growth is about a 15% step-up on a quarter-over-quarter basis.\n\nSo, we are expecting revenue to grow seasonally at a pretty good clip. So, the issue that we're seeing here is that if you look back to a year ago, we grew at over 40% year over year in the prior year. And many of the really significant macro impacts that we've seen over the course of this year weren't impacting the business nearly as much as they were a year ago. So, for example, the persistent inflation we've seen this year, but the ramp in the Fed rate cycle, as well as the onset of the war in Ukraine, that really had an impact on growth rates as we moved in Q2.\n\nAnd so, while we're still expecting really pretty robust 15% approximately quarter-over-quarter growth in Q4, the comp to the prior year and the fact that the macro impacts have built up and compounded on each other over the course of this year is really making the back half of this quarter, number one, a little bit more difficult from a visibility point of view. And certainly, with the performance that we saw from the brand portion of the advertising business in Q3 gives the -- sort of informs our expectation of the decel to move through the rest of the quarter. So, hopefully, that gives you a little more context on that side of things. I'll turn it over to Evan for the second portion there.\n\nEvan Spiegel -- Co-Founder and Chief Executive Officer\n\nThanks, Brent, for the question. Yeah. I mean, you know, these sorts of changes in restructurings are always challenging. And I'm really just grateful to the team and really proud of how quickly they've worked to adapt and really make sure we're focused on our key priorities.\n\nI think it's going to take a little bit of time. We certainly have regained some momentum and focus, but the process is still concluding in certain countries where regulations require that those processes take a little bit longer. So, I wouldn't say that we're complete there. I think one thing I'm watching specifically is on the sales side.\n\nWe've got these president roles. Ronan Harris is joining a bit later this month as our president of EMEA. We will also have an APAC president and an Americas president, and we'll be putting folks into those roles as soon as we can. And in addition to that, we're also thinking about how to better organize our sales teams to go to market in a way that best serves our customers.\n\nAnd we're sort of thinking about Q1 as the timeline for that. So, we're certainly not done with this process because we see more opportunity to streamline and improve the way we serve our advertising partners. I know that's something Jerry is thinking a lot about. But overall, if you just look at how the team has managed through this period of time, I'm really proud of the work they're doing and the progress we're making.\n\nOperator\n\nThis concludes our question-and-answer session, as well as Snap Inc.'s third-quarter 2022 earnings conference call. [Operator signoff]\n\nDuration: 0 minutes\n\nDavid Ometer -- Head of Investor Relations\n\nEvan Spiegel -- Co-Founder and Chief Executive Officer\n\nJerry Hunter -- Chief Operating Officer\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nRich Greenfield -- LightShed Partners -- Analyst\n\nMark Shmulik -- AllianceBernstein -- Analyst\n\nRoss Sandler -- Barclays -- Analyst\n\nDerek Andersen -- Chief Financial Officer\n\nLloyd Walmsley -- UBS -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nMore SNAP analysis\n\nAll earnings call transcripts"
}