{
  "companyName": "Novocure",
  "companyTicker": "NVCR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/novocure-nvcr-q3-2022-earnings-call-transcript/",
  "content": "Novocure (NVCR 2.62%)\nQ3 2022 Earnings Call\nOct 27, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the NovoCure Q3 2022 earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to Ingrid Goldberg. \n\nIngrid Goldberg -- Vice President of Finance and Investor Relations\n\nGood morning, everyone, and thank you for joining us to review NovoCure's third-quarter 2022 performance. I'm joined on the phone by our Executive chairman, Bill Doyle; our CEO, Asaf Danziger; and our CFO, Ashley Cordova. Other members of our executive leadership team are also on the call and available for Q&A. For your reference, slides accompanying this earnings release can be found on our website, www.novocure.com under quarterly reports on our Investor Relations page.\n\nBefore we start, I would like to remind you that our discussions during this conference call will include forward-looking statements, and actual results could differ materially from those projected in these statements. These statements involve a number of risks and uncertainties, some of which are beyond our control and are described from time to time in our SEC filings. We do not intend to update publicly any forward-looking statements, except as required by law. Where appropriate, we refer to non-GAAP financial measures to evaluate our business, specifically adjusted EBITDA, a measure of earnings before interest, taxes, depreciation, amortization, and share-based compensation.\n\nWe believe adjusted EBITDA is an important metric as it removes the impact of earnings attributable to our capital structure, tax rate, and material noncash items, and best reflects the financial value generated by our business. Reconciliations of non-GAAP to GAAP financial measures are included in our press release, earnings slides, and in our Form 8-K filed with the SEC today. These materials can also be accessed from our Investor Relations page on our website. Following our prepared remarks today, we will open the line for your questions.\n\nI will now turn the call over to our Executive Chairman, Bill Doyle.\n\nBill Doyle -- Executive Chairman\n\nThank you, Ingrid. And good morning, everyone. At NovoCure, our mission is to extend survival in some of the most aggressive forms of cancer through the development and commercialization of our life-extending therapy, Tumor Treating Fields. In the third quarter, we consistently executed across our business in service of our mission.\n\nOur team is diligently working to reach additional patients in our current markets, expand into new markets, enhance our Tumor Treating Fields delivery systems, and treat patients in new indications throughout the body. We made significant advancements in our clinical and product development programs, and we are eagerly awaiting data readouts from multiple pivotal trials starting in the first quarter of 2023. Our GBM business remains the core driver of our financial stability and enables us to invest aggressively in a variety of clinical and product development initiatives, as well as commercial programs designed to increase adoption. In the third quarter, we generated $131 million in net revenues and $22 million in cash flow from operations.\n\nThe U.S. market is our largest revenue contributor in which currently approximately 40% of newly diagnosed GBM patients receive a prescription for Optune. We believe there is room to drive greater adoption of Optune in newly diagnosed GBM given the best-in-class outcomes demonstrated by our EF-14 randomized clinical study, a growing body of basic and translational science from leading academic research centers, and ongoing confirmation from real-world evidence analyses throughout the globe. There are 3 key publications that we would like to highlight this quarter.\n\nFirst, a manuscript by Dr. Shadi Shams and Chirag Patel of MD Anderson Cancer Center, which has been accepted for publication in the Journal of Molecular Cell Biology, reviews the multiple distinct mechanisms of action of TTFields. This paper is a comprehensive review of TTFields in a high-impact journal and highlights the fast-growing body of scientific research converging to demonstrate the effects of TTFields on cancer growth. The paper validates the multiple ways that TTFields can disrupt critical cellular processes, supports TTFields as a potential backbone therapy for other modalities, and adds to our arsenal of independent support to be used for broader education and awareness.\n\nSecond, Dr. Chun Chen published real-world evidence from one of the most reputable hospitals in Shanghai Huashan Hospital in the Journal of Clinical Medicine. Dr. Chen's analysis reproduced the results of the pivotal EF-14 study and confirms Optune's efficacy in the largest group of patients treated with TTFields in China to date.\n\nDr. Chen reports a statistically significant 45% improvement in median overall survival with a p-value of less than 0.001 when comparing TTFields plus temozolomide to temozolomide alone. Third, real-world evidence from Dr. Matt Ballo, at the West Cancer Center was published in Neuro-Oncology Advances, underlining the benefits of TTFields and demonstrate that greater TTFields exposure correlates to improve overall survival regardless of subgroup are treatment factors.\n\nPublications like these serve to strengthen the underpinnings of research supporting the use of our therapy and provide additional educational resources for practitioners as they learn more about TTFields. Next, I would like to highlight the leadership changes we announced last month and the creation of a new U.S. Central Nervous System Cancers franchise. Frank Leonard, who most recently served as our Chief Development Officer, will lead this new organization as franchise president.\n\nFrank has succeeded in a number of leadership roles during his 12-year tenure at NovoCure, and we believe Frank will drive impactful results in this new role. The new U.S. Central Nervous System Cancers franchise combined sales, marketing, and medical leadership under one umbrella and strengthens our focus on driving adoption of TTFields for newly diagnosed GBM in our largest and most important market. It is important to remember that Optune is still a new therapy to many physicians.\n\nThe onus is on NovoCure to provide the educational resources needed for prescribing physicians to fully understand the many benefits of TTFields therapy for their patients. With the creation of the U.S. CNS franchise, we have streamlined decision-making and improved coordination across our U.S. teams with the ultimate goal of increased Optune adoption in GBM.\n\nContinuing the theme of greater TTFields awareness and education, in August, we introduced a new marketing campaign designed to drive awareness and interest in TTFields in the broader oncology community beyond neuro-oncology. The campaign emphasizes the versatility of the TTFields modality, its multi-mechanistic capabilities, and ability to expand the treatment possibilities for patients. The campaign explained the TTFields or electric fields that exert physical forces to kill cancer cells via a variety of mechanisms, including the disruption of mitosis, interference with cell motility and migration, activation of antitumor immunity, and downregulation of genes important for DNA damage repair. One facet of this campaign is the creation of a new Tumor Treating Fields website, which serves as a central educational resource to learn more about our therapy.\n\nThe website is now live at www.tumortreatingfieldstherapy.com. I would encourage all of you to explore this resource. Before I turn the call over to Asaf, I'd like to reiterate my excitement for the upcoming pivotal trial readouts. For the last 10 years, NovoCure's primary focus has been treating patients with glioblastoma.\n\nThe top-line readouts from both the pivotal LUNAR and INNOVATE-3 studies next year should be transformational for our company and potentially enable tens of thousands of patients to utilize our therapy for treatment of non-small cell lung cancer and ovarian cancer. We look forward to sharing data from these studies with you as soon as possible. With that, I'll turn the call over to Asaf to discuss our clinical and product development updates.\n\nAsaf Danziger -- Chief Executive Officer\n\nThank you. I would like to echo Bill's anticipation for the upcoming pivotal readouts, 2023 will be a very exciting year. As a reminder, we currently have 4 Phase III pivotal studies approaching completion. The first readout will be the LUNAR study evaluating the use of TTFields together with docetaxel or physicians' choice checkpoint inhibitor for the treatment of Stage IV non-small cell lung cancer following platinum failure.\n\nWe completed enrollment in this study in the fourth quarter of 2021, which started a 12-month follow-up period. We plan to announce top-line results from both the primary and powered secondary endpoints early next quarter. The next Phase III data readout will be from the INNOVATE-3 pivotal trial. INNOVATE-3 is studying the efficacy of TTFields together with paclitaxel for the treatment of platinum-resistant ovarian cancer.\n\nOvarian cancer is deadly, especially once a patient has become resistant to platinum-based therapy. Enrollment in INNOVATE-3 was completed in October 2021, which started the 18-month follow-up period. Top-line results are expected in the second half of 2023. Our next top-line data release will be from our METIS study evaluating TTFields as a monotherapy for the treatment of brain metastases from non-small cell lung cancer.\n\nTreatment of brain metastases is a significant unmet need. Brain metastases often go untreated due to the diminished blood-brain barrier permeability of many cancer drugs. METIS continues to enroll well, and we have this ability to final patient enrollment, but we will need an additional quarter to reach this milestone. Given the 12-month follow-up period for METIS, we now expect top-line results in Q1 of 2024.\n\nThe final readout from our current slate of Phase III pivotal trials is the PANOVA-3 study evaluating the use of TTFields together with nab-paclitaxel and gemcitabine in locally advanced pancreatic cancer. The 5-year survival rate for patients with pancreatic cancer is only 10%. We are hopeful that TTFields can play a part in extending survival for this patient population. PANOVA-3 remains on track for top-line results in 2024.\n\nIn addition to our clinical pipeline, we are also exploring avenues to increase the TTFields dose delivered to patients, as well as improved patient experience through product development. TTFields dose is defined as the amount of energy delivered to the tissue, and one of the key levers for increased dose is TTFields intensity. Today, we are excited to share the data from our EF-33 pilot study. As a reminder, EF-33 is our first study to evaluate the safety and preliminary efficacy often higher intensity array design in 25 patients with recurrent GBM as compared to our historical control.\n\nAmong those who used Optune as directed with higher-intensity arrays for at least 1 month, median progression-free survival was 4.5 months versus 2.2 months in our EF-11 trial. Further, notwithstanding the increased TTFields intensity, EF-33 patients reported no TTFields-related toxicity. EF-33 is an important step in our ongoing product enhancement efforts and supports a much faster development cycle by accelerating the clinical testing of the innovations delivered by our product development teams. Building upon our goal to enhance patient experience and TTFields intensity, we are introducing the flex array.\n\nAs a reminder, the flex array utilizes new materials, which are lighter and more flexible than those used in our current arrays. Flex arrays also have the potential to deliver higher and more consistent TTFields intensities to the target regions without increasing it. Preclinical research in the Red Journal has shown that increased field intensity and greater time on therapy lead to higher cancer cell kill rate. We believe the flex arrays have the potential to meaningfully improve patient comfort and improve the efficacy of our therapy.\n\nWe are on track to treat our first patients with flex arrays in Europe later this year pending regulatory approval. We look forward to updating you on this release as well as our plans for broader distribution. Before I hand the call over to Ashley, I would like to thank all of my NovoCure colleagues for their continued dedication to our mission. 2023 will be transformational for NovoCure.\n\nAs soon we may have the opportunity to treat thousands of additional patients, I know you will rise to the challenge as you have many times before. With that, I will turn the call over to Ashley to review our financial performance.\n\nAshley Cordova -- Chief Financial Officer\n\nThank you, Asaf. The third quarter of 2022 was another period of consistent commercial execution as the profit from our GBM business continue to finance ongoing investment in clinical development and commercial expansion. Net revenues in the third quarter were $131 million with $22 million in cash flow from operations. We ended the period with 3,420 patients on therapy.\n\nThere were several notable headwinds this quarter that impacted net revenues, including the volume of cash collections from aged claims in the U.S., the ongoing impact of German coverage update, and FX pressure from both the weakening Japanese yen and euro. With respect to aged claims in the U.S., we continue to pursue previously denied claims. However, the accessible collections will largely be exhausted this year, and the remaining outstanding aged claims will take more time and effort to collect. As we look ahead to 2023, we expect our net revenues to more closely reflect the core drivers: active patients on therapy times the net revenue earned per active patients times 12 months.\n\nGross margin for the third quarter was 77%. Impact to our gross margin from inflationary pressures have been minimal to date, and we are working with the suppliers to optimize our cost of revenue. SG&A expenses for the third quarter totaled $74 million, an increase of 16% year over year. We are investing aggressively in our commercial capabilities with multiple future growth levers in mind.\n\nThese include investments in pre-commercial groundwork for potential launches across multiple cancer indications and the expansion of our international footprint. We invested $52 million in research and development in the third quarter, an increase of 8% from the third quarter of 2021. One of the hallmarks of our therapy is the broad applicability and combinability with numerous treatment modalities and pharmacological agents. We will continue to invest to explore using our therapy in new cancer indications and in novel combinations, as well as in product development initiatives designed to improve the efficacy and experience for our patients.\n\nOur net loss for the third quarter was $0.25 per share or $27 million. Adjusted EBITDA was $4 million, and we finished the period with $970 million in cash and short-term investments on the balance sheet. This cash reserve enables us to pursue a number of avenues for growth with maximum flexibility. I'd like to close today by highlighting one of our Optune users.\n\nIn July 2021, Jovan Caneten was preparing for a backpacking trip when she found herself unable to read or comprehend text messages. After consulting with physicians and undergoing a battery of scans, she was diagnosed with GBM. Jovan first underwent debulking surgery at the Mayo Clinic and then began using Optune. In the year since our diagnosis, Jovan's disease has not progressed, and she continues to maintain an active lifestyle while using TTFields.\n\nThis past summer, Jovan biked more than 100 miles to the Mayo Clinic for her most recent MRI. We take our mission very seriously at NovoCure to extend survival in some of the most aggressive forms of cancer. Extending survival means allowing patients like Jovan the time and ability to continue pursuing their passion, whether that's a long bike ride, watching a football game with her husband, or getting lunch with her dad. We're proud to play our part in Jovan's life.\n\nAnd with that, we'll open the call to questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Greg Fraser with Truist. Your line is now open.\n\nGreg Fraser -- Truist Securities -- Analyst\n\nGood morning, folks, and thanks for taking the questions. I wanted to ask about Germany. When do you expect reimbursement to return to a more normalized level? And how do we think about normalized in terms of net revenue per patient per month?\n\nAshley Cordova -- Chief Financial Officer\n\nGreg, this is Ashley. Thanks for the question and for joining the call today. As a reminder, in the second quarter, we disclosed that we had received formal DME listing in Germany and contracted pricing with all of the large payers. You asked specifically what we should expect in the long term.\n\nI'll say our price in Germany is in line with our global ASP, so that's what you should expect us to ramp back up to. But we continue to face headwinds to our German net revenues for patients who started prior to defined coverage and for whom we are no longer being paid. That's consistent with that last quarter, but we expect to continue to see an impact for the next five quarters or so through the end of 2023. Separately, we reviewed our AR balance this quarter to reflect the updated coverage criteria, and that was an additional headwind one time in the quarter.\n\nIf we summarize it all, as we mentioned last quarter, so it's short-term pain for long-term gain as we now have formal DME listing and established reimbursement pathway in Germany, and pricing in Europe in line with our global pricing ASC. \n\nGreg Fraser -- Truist Securities -- Analyst\n\nGot it. Can you talk a bit more about what you're seeing in Japan in terms of demand? Prescription volume there has been trending down over the last few quarters. Is there something driving that trend? \n\nPritesh Shah -- Chief Commercial Officer\n\nYes. This is Pritesh. I'll take that question. Thank you for asking the question.\n\nOur business in Japan is strong and growing, and we're very pleased to see the active patient trends over quarter -- quarter-over-quarter grow there. Through better physician education, we have transitioned to a model where we are receiving prescriptions for patients that are actually able to start, so we want to improve our ability to impact patients that can actually receive the therapy. And any variability that you see in the prescription is just noise, and I would continue to look at active patients as a measure of our growth in Japan. \n\nGreg Fraser -- Truist Securities -- Analyst\n\nGot it. So the fill rate has gone up essentially versus what it used to be? \n\nPritesh Shah -- Chief Commercial Officer\n\nYes. Absolutely.\n\nGreg Fraser -- Truist Securities -- Analyst\n\nGot it. OK. And can you also talk about expectations for the ramp in France once you finalize reimbursement? Is it fair to look at the experience in Germany? Or do you expect faster adoption given the adoption is more established now? \n\nPritesh Shah -- Chief Commercial Officer\n\nYes. Thank you again for that question. So in France, just as a reminder, we're in the process of securing reimbursement, and it's too early for us to determine what the ramp-up will be. We're doing everything we can, applying all of our learnings from Germany and other markets to educate the marketplace, prepare our teams to make sure that as soon as we get the green light, we can start helping patients in France. \n\nGreg Fraser -- Truist Securities -- Analyst\n\nOne more quick one, and I'll get back in the queue. But do you already have patients on treatment now in France that will become paying patients after you secure reimbursement?\n\nPritesh Shah -- Chief Commercial Officer\n\nYes. So we have patients today that we're treating in France. Those are through clinical trials. Those are the TRIDENT trial that we have ongoing in France.\n\nWe don't have any commercial patients outside of that in France today. \n\nGreg Fraser -- Truist Securities -- Analyst\n\nThank you.\n\nOperator\n\nPlease stand by for our next question. Our next question comes from Jason Wittes with Loop Capital. Your line is now open.\n\nJason Wittes -- Loop Capital Markets -- Analyst\n\nHi. Thanks for taking the questions. First off, you're beefing up your infrastructure for GBM sales in the U.S., your 40%. Should we anticipate that you're going to see some meaningful move on that 40% penetration number next year with these changes? Or is this going to be a more gradual slope? \n\nBill Doyle -- Executive Chairman\n\nYes. Good morning, Jason. This is Bill. I'll start off here.\n\nSo as you point out, and I'll just level set for everyone, the U.S. is our largest and most important market. We have -- we receive approximately 40% prescriptions, meaning we have approximately 40% penetration in newly diagnosed GBM. We've got Tier 1 recommendation per the NCC and guidelines.\n\nWe've established essentially universal pricing and reimbursement for patients in the U.S., and it really is the core driver of our profitable business that's funding all the other activities that we've discussed. So that's the -- that's sort of the big picture. We believe there are significant opportunities to increase that 40%. First and foremost is penetration at the academic centers.\n\nThis is where the ISTs that we've discussed previously as well as the TTF, the new Tumor Treating Fields campaign, that we discussed in the script, and also the power of the academic papers that are now coming from independent researchers that are validating the EF-14 clinical trial, all those are important for our growth. And then again, we have now streamlined our organization to really focus on driving this. And with that, I'd like to ask Frank Leonard, who's on the call and as our new franchise president. Frank, maybe you could just give a little bit of background in your thoughts in terms of how we're going to drive growth in the U.S. \n\nFrank Leonard -- President, U.S. Central Nervous System Cancers\n\nThank you, Bill. Yes, we're excited to launch the new CNS franchise. It's a new organization that combines sales, marketing, medical leadership, as well as our patient support functions in a single operating unit in the U.S. I think first and foremost, the creation of the unit ensures that we do maintain the focus on increasing the number of GBM patients receiving Optune while allowing the rest of the organization to prepare for the future.\n\nWe're really, within this new organization, focused on two key operational changes. First, we want to streamline the decision-making related to the U.S. GBM business to ensure we can get faster implementation of changes that support our prescribers and our patients. Second, we also want to build an organization that can prioritize the strategic objective for growth while decentralizing the tactics and the execution to the teams that are closest to our customers.\n\nI'll also mention just lastly that I want to highlight that we just returned from the ASTRO conference in San Antonio. And as a reminder, ASTRO is the largest conference focused on radiation oncology, and our radiation oncology prescribers are some of our most engaged and confident customers. With over 7,500 attendees at the conference, we had 4 days of significant customer engagement face-to-face, which we still believe is the best way to engage our customer. And my main takeaway from ASTRO is that the radiation oncology community understands the long-term potential for Tumor Treating Fields both in GBM and in the other solid tumors we're studying.\n\nSo we had an excited customer base that was eager to talk to us, both about applications in GBM as well as aware of the fact that there's upcoming data releases that will be meaningful. Thank you, Bill.\n\nBill Doyle -- Executive Chairman\n\nAgain, maybe to summarize, we have a very strong foundation in GBM. It is among our highest priorities to grow in GBM and, hence, the reorganization to provide that focus. We have significant evidence that continues to build. And while I wish there were a magic bullet that I could fire and would drive immediate growth, I think this growth will build over time, but we're committed to getting the therapy to these patients. \n\nJason Wittes -- Loop Capital Markets -- Analyst\n\nOK. I appreciate all that color. If I could just ask one other question then. On high intensity to raise, the 25-patient pilot study was pretty impressive.\n\nIt looks like you doubled progression-free survival. In terms of -- it sounds like it will be out officially in Europe this year from your comments. Can you make any -- give us any guidance in terms of how things play out in the U.S. in terms of what the regulatory pathway might be for that?\n\nBill Doyle -- Executive Chairman\n\nYeah. Sure. So again, our focus has been on building -- first of all, developing the array, then building the manufacturing infrastructure to supply the array. We made the decision to launch in Europe first, which we expect to occur this year.\n\nWe'll announce that when we do have the first patients on these arrays, and then we'll start the regulatory process in the U.S. next year.\n\nAshley Cordova -- Chief Financial Officer\n\nAnd Jason, just for the avoidance of doubt, the EF-33 data is on our 14-disc array flex. It's another kind of leap from generation. of high-intensity array that is lighter and more flexible.\n\nBill Doyle -- Executive Chairman\n\nYeah. Ashley, that's a great point. So we started the first trial with an early design that delivered the high intensities, and we tested those on some of the sickest patients. Again, these were recurrent GBM patients.\n\nAnd as you point out, we were delighted to see the improvement in overall survival in these patients. We were also delighted to see that there was no toxicity. And for this initial trial, that was -- those were both important endpoints. And again, I'm just repeating what Ashley said, the flex is another step forward that not only delivers the high intensity but is a much more comfortable, lighter, easier-to-use array, and so we're as excited as can be about this launch.\n\nJason Wittes -- Loop Capital Markets -- Analyst\n\nGreat. Thanks for the info. I'll jump back in queue.\n\nOperator\n\nPlease stand by for our next question. Our next question comes from Emily Bodnar with H.C. Wainright. Your line is now open.\n\nEmily Bodnar -- H.C. Wainwright and Company -- Analyst\n\nHi. Good morning. Thanks for taking the question. I'm curious how much of a larger sales force would you need to bring TTFields to market for lung cancer.\n\nAre you looking to build like a completely new sales force for that? Or do you think there's some synergy with your ongoing sales force in GBM and mesothelioma? And then could you maybe provide some background on the METIS trial and what's kind of driving the slower enrollment there? Thank you.\n\nBill Doyle -- Executive Chairman\n\nSure. So we'll take this in 2 parts. But we alluded to this in the remarks, but we are making very large investments in the organization for the future. And I'd like Prakash to describe some of those activities.\n\nPritesh Shah -- Chief Commercial Officer\n\nYes. Thank you, Bill. I appreciate the question. And I'll start off with answering your question first, how large of an investment are we going to be making in the sales organization so -- and will it be a dedicated sales team.\n\nAnd I think one of the key takeaways from what we shared, and Frank just talked about with the CNS infrastructure, is that we're excited about the focus on GBM while we work on how to structure and how to resource the opportunity in the future. So it's too early for us to say that we will have a sales force just of lung cancer or just of ovarian cancer. What we're excited about is taking this journey of helping more patients. And what we're doing on this front, No.\n\n1 is to ensure the broader medical oncology community is aware of Tumor Treating Fields, and this is the work that Bill described in the prepared remarks related to the launch of the Tumor Treating Fields therapy website and the work we're doing on education related to the mechanism of action. The second step we're taking here is to understand the marketplace as we await the data, working on the patient journey, ensuring we understand how decisions are made, how TTFields will insert into the decision-making framework. And then the last step on this front is to make sure that we're preparing the organization for these milestones that will come forward. So a lot happening on the planning front.\n\nAs we await the data, once we see the data and have a chance to digest the data, we'll have more opportunities to think about what are the right plans and where do we make sure that we can make some decisions off of that. \n\nBill Doyle -- Executive Chairman\n\nAnd Emily, with respect to your question on METIS, METIS has been enrolling consistently. We're right near the end. We have line of sight. It's just going to cross over into the next quarter.\n\nNothing more than that. \n\nEmily Bodnar -- H.C. Wainwright and Company -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nPlease stand by for our next question. Our next question comes from Jason Bednar with Piper Sandler. \n\nJason Bednar -- Piper Sandler -- Analyst\n\nHi there. Thanks for taking the questions. Maybe I'll pick a few here first on LUNAR with a couple of clarifying questions. First, it looks like the early language was removed from the press release early Q1, but I thought I heard you reference that early point for the top-line data during the prepared remarks.\n\nSo just clarifying the timing there is unchanged. We're still thinking about early '23, as in like some time in like maybe mid-January. And then I think you noted we'll see primary. And secondary endpoints on LUNAR, just wondering if you can discuss whether we'll see any hazard ratios when you report those items.\n\nAnd then finally, can you discuss what kind of preparations you're making today just with respect to like submission materials to the FDA and international agencies, as well as feed your planning with payers to have those conversations start as soon as possible once you do have that data fully in hand and cleaned? Thanks.\n\nBill Doyle -- Executive Chairman\n\nSure. So first and foremost, let me just underline there's no change with respect to the report timing, so no need to read any tea leaves there. Secondly, as we've said before, our first announcement in January, you should expect to be consistent with other announcements from other companies in oncology. We plan to make sure everyone understands whether or not we've hit the primary and the secondary endpoints.\n\nWe do not expect to provide detail that will compromise our ability to either publish or present the data in the first opportunity that we have in a major medical conference. And then with respect to preparation, I would say that our regulatory capacity is one of our tremendous strengths at NovoCure. It's among our strongest core capabilities, and we are doing everything that is possible to do to prepare. This will be a PMA supplement.\n\nIt will go in three subcategories. There's a manufacturing supplement, there is a preclinical supplement, and then there's the data package. All of that is being prepared and worked on so that it can be filed at the first opportunity.\n\nJason Bednar -- Piper Sandler -- Analyst\n\nOK. Just another question I want to come back to, Bill, you said PMA supplement. I've been under the assumption this is going to be a full PMA. Has something shifted? Or...\n\nBill Doyle -- Executive Chairman\n\nMy mistake, and good catch. I'm thinking PMA supplements because we're so busy doing other PMA supplements, but this is a full new PMA.\n\nJason Bednar -- Piper Sandler -- Analyst\n\nOK. OK. Thanks. And then Ashley, are you willing at all to provide some view on pricing or revenue per patient in some of your markets? I guess I know the original discussion was to reference for us on the street to reference year-end revenue per patient levels.\n\nBut I mean, I think we all can see like what FX is doing across your P&L and changes in Germany that just make year-end '21 that just really tough to use. Is there anything you're willing to reference today as we think about modeling revenue per patient in future quarters and years across your respective markets? Thank you.\n\nAshley Cordova -- Chief Financial Officer\n\nYeah. No, I appreciate it. It's actually a good question. So notwithstanding all of the puts and takes, year-end 2021 still is a pretty good reference.\n\nSo when we roll up to that kind of ASP that you see there, that's what I would recommend you use. As you noted, there will be puts and takes. And what we've seen throughout 2023 is tailwind from aged claims in the U.S. that's benefiting that price when you roll it in the model, but that's being offset by the transition that we're seeing in Germany, and I would say those are netting to essentially the same place.\n\nJapan, of course, also had some FX impact. But that price is stable. So if you look at actually those trends over time, you're seeing the impact of FX. So I would still recommend you look to that Q4 exit ASP as a good number to model looking -- moving forward with some puts and takes in each region. \n\nJason Bednar -- Piper Sandler -- Analyst\n\nThe year-end '21 global revenue per patient is still how you suggest modeling forward for '23 and beyond?\n\nAshley Cordova -- Chief Financial Officer\n\nYes.\n\nJason Bednar -- Piper Sandler -- Analyst\n\nOkay. All right. Thank you. Very helpful.\n\nOperator\n\nPlease stand by for our next question. [Operator instructions] Our next question comes from Vijay Kumar with Evercore. your line is now open. \n\nVijay Kumar -- Evercore ISI -- Analyst\n\nHey, guys. Thanks for taking my question. Ashley, maybe my first one is for you. Did you quantify what the CMS contribution was within the Q? And just based on what you're seeing right now, should we expect revenue growth in fiscal '23?\n\nAshley Cordova -- Chief Financial Officer\n\nYes, Vijay, thanks for the question. So I mean we've never broken down a detailed quantification, but what we have seen is a benefit throughout 2023 and 2022 from aged claims in the U.S. That's around $10 million a quarter if you want a round number that I would look. We did have a headwind in the third quarter where that was down versus Q2.\n\nAnd if you look at consistent activation trends, you can see that drop in our net revenue in the U.S., and that is largely the impact of the aged claims decrease in the U.S. It is true that as we look to next year, we expect those aged claims to become more difficult to get. We've kind of largely captured the low-hanging fruit there. And so as you look forward, we would recommend you take our active patient cell therapy, multiply it by that ASP that we just discussed with Jason, and times that by 12, and that will give you a good estimate. \n\nVijay Kumar -- Evercore ISI -- Analyst\n\nI guess is it the back payments a headwind for '23? So could total revenues be declining in '23?\n\nAshley Cordova -- Chief Financial Officer\n\nYes. No, that aged claims in the U.S. will be a headwind in 2023. We want you to anchor to that ASP that we just referenced.\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nUnderstood. And a couple of questions on LUNAR. Given this is a PMA, there were some trial design changes. Do you expect that there could be an FDA AdCom for this trial? \n\nBill Doyle -- Executive Chairman\n\nSo we never know whether or not the FDA will decide that they want an AdCom. I don't think it has anything to do with trial design. I think it will have to do with the data, and the results, and what the FDA chooses to do. I think the fact that Tumor Treating Fields is now established in GBM and is an established modality, and of course, the safety is well established, I think this is a therapy that's much better understood at the FDA and in the community.\n\nRecall, they did have an AdCom for our very first approval in recurrent GBM, but they did not require an AdCom for our second submission in newly diagnosed. \n\nVijay Kumar -- Evercore ISI -- Analyst\n\nYeah. That's helpful, Bill. And then maybe my last one on -- listen the trial now [Audio gap] the LUNAR trial specifically, we're looking at 12 months of follow-up, right? Does that mean the median overall survival in this trial is less than 12 months? Or maybe just put the 12 months into context because I know there was a data maturity. The trial started enrolling a while ago.\n\nWhat does the 12-month signify?\n\nBill Doyle -- Executive Chairman\n\nAgain, Vijay, that's 12 months from the last patient in. It's not an average 12-month follow-up, so I don't think there's any issue with respect to this follow-up time. \n\nVijay Kumar -- Evercore ISI -- Analyst\n\nUnderstood. Thanks, guys.\n\nBill Doyle -- Executive Chairman\n\nThank you.\n\nOperator\n\nAt this time, there are no other questions in the queue. I would now like to turn the conference back to Bill Doyle for closing remarks.\n\nBill Doyle -- Executive Chairman\n\nSo I'd like to thank everyone for joining the call this morning and your continued interest in NovoCure. Q3 was another quarter of consistent execution across NovoCure. The fundamentals of our GBM business are strong, and the underlying evidence confirming the benefits of Tumor Treating Fields therapy continues to strengthen. January marks the beginning of a year that will feature readouts from multiple pivotal trials, potentially enabling us to treat tens of thousands of new patients in the coming years.\n\n2023 will be transformational, and we look forward to updating you on our progress. So thanks again. Thanks again.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nIngrid Goldberg -- Vice President of Finance and Investor Relations\n\nBill Doyle -- Executive Chairman\n\nAsaf Danziger -- Chief Executive Officer\n\nAshley Cordova -- Chief Financial Officer\n\nGreg Fraser -- Truist Securities -- Analyst\n\nPritesh Shah -- Chief Commercial Officer\n\nJason Wittes -- Loop Capital Markets -- Analyst\n\nFrank Leonard -- President, U.S. Central Nervous System Cancers\n\nEmily Bodnar -- H.C. Wainwright and Company -- Analyst\n\nJason Bednar -- Piper Sandler -- Analyst\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nMore NVCR analysis\n\nAll earnings call transcripts"
}