{
  "companyName": "Cronos Group Inc.",
  "companyTicker": "CRON",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/cronos-group-inc-cron-q2-2022-earnings-call-transc/",
  "content": "Cronos Group Inc. (CRON)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning. My name is Stacey, and I will be your conference operator today. I would now like to welcome everyone to Cronos Group's 2022 second quarter earnings conference call. Today's call is being recorded.\n\nAt this time, I would like to turn the call over to Shayne Laidlaw, investor relations. Shayne, you have the floor.\n\nShayne Laidlaw -- Investor Relations\n\nThank you, Stacey and thank you for joining us today to review Cronos's 2022 second quarter financial and business performance. Today, I'm joined by our chairman, president, and CEO, Mike Gorenstein, and our CFO, Bob Madore. Cronos issued a news release announcing our financial results this morning, which is filed on our EDGAR and SEDAR profile. This information as well as the prepared remarks will also be posted on our website under investor relations.\n\nBefore I turn the call over to Mike, let me remind you that we may make forward-looking statements and refer to non-GAAP financial measures during this call. These forward-looking statements are based on management's current expectations and assumptions that are subject to risks and uncertainties that could cause actual results to differ materially from those projected in the forward-looking statements. Factors that could cause actual results to differ materially from expectations are detailed in our earnings materials and our SEC filings that are available on our website, by which any forward-looking statements made during this call are qualified in their entirety. Information about non-GAAP financial measures, including reconciliations to U.S.\n\nGAAP, can also be found in the earnings materials that are available on our website. We will now make prepared remarks, and then we will move into a question-and-answer session. With that, I'll pass it over to Cronos chairman, president, and CEO, Mike Gorenstein.\n\nMike Gorenstein -- Executive Chairman\n\nThank you, Shayne and good morning, everyone. I want to start by reviewing the progress we've made toward our strategic realignment initiatives since our last call. We've continued to work hard to set Cronos up for the future and to prepare our company in the short term as we move through a more volatile macroeconomic environment and uncertain timing regarding regulatory change throughout our current markets and those in which we may look to operate in the future. With a substantial portion of our Canadian manufacturing moving to GrowCo, the wind down of the Peace Naturals Campus is going as planned and we're on track to fully cease operations at the facility by the end of the year.\n\nThis changeover has been efficient and we're grateful to our employees and partners for ensuring a smooth transition of our operations. The buildout of our own space at GrowCo is progressing well and downstream processing equipment will be up and running in the coming weeks. We continue to be pleased with the cultivation operations at GrowCo and look forward to having this joint venture become a primary supplier of our products in Canada. The cost savings we expect to realize in GrowCo are intended to aid the margin profile of our products overtime, which is a critical strategic goal for us.\n\nThis quarter, GrowCo reported preliminary unadded revenue of approximately $5.2 million to non-Cronos customers and in the year-to-date period, GrowCo has achieved profitability. As a reminder, we are a lender to GrowCo and its principles. GrowCo began to repay its current $79 million senior secured loan in the first quarter. These loan receivables, combined with our balance sheet of approximately $945 million in cash and short-term investments, set us up well to invest in new market that they open.\n\nBalance sheet management through economic uncertainty is paramount and our desire to maintain a significant industry-leading cash balance ahead of potential global strategic growth opportunities as guided many of our decisions year-to-date. In the second quarter, we implemented additional changes in the U.S. business as we continue to assess the best way to position our existing infrastructure to win in the U.S. and other markets globally with the borderless products we are creating today.\n\nIn the coming months, to limit operating expenses, while maintaining a foothold in the U.S., you'll see us pivot the Lord Jones brand away from the wholesale beauty category and lean into adult-use product format. This will allow us to preserve the Lord Jones brand equity that should enable us to launch THC products and other cannabinoid products beyond CBD in the future. In addition, we decided to focus our energy on the direct-to-consumer channel over wholesale opportunities. With the switch to a DTC focus, we are striving for a higher gross margin profile and can reduce our SG&A further.\n\nWe are focused on creating borderless products and brands that can easily be adapted to emerging cannabis markets, as they become commercially viable opportunities. The pivot in our U.S. business further drives us toward our singular focus of creating adult-use cannabinoid products. Globally, we continue to be on track to deliver $20 million to $25 million of identified savings across operating expense categories in 2022, primarily driven by savings across sales and marketing, G&A and R&D.\n\nWhile rightsizing our cost structure to strengthen our overall business, we still continue to make significant progress with expanding our borderless product portfolio in Canada under the Spinach brand and its sub-brands SOURZ and FEELZ. In the second quarter of 2022, according to high-fire data, Spinach held an approximate 18.6% market share in the gummies category. Furthermore, three out of four SOURZ ranked in the top 10 for market share in Canada in Q2. And all 5 of our gummy products across SOURZ and FEELZ that were available in the market in Q2 were in the top 15.\n\nLast week, to further build on our category leadership, we launched a gummy featuring CBN under the Spinach FEELZ brand Deep Dreamz Blackberry Pomegranate featuring 10 milligrams of THC and 5 milligrams of CBN per pack. We intend to bring our success and learnings in the gummy category to the base category as well. Following the switch to offering on brand format earlier this year, our Spinach base and FEELS cultured CBGVA product lineups are doing well in market. In July, we launched another rare cannabinoid product featuring CBN the Spinach FEELZ Blackberry Kush, THC-CBN1-brand vape, which provides a Mellon dreamy high.\n\nIn June, in partnership with Ginkgo, we achieved the productivity target for THCV cannabinoid believed to reduce the appetite enhancing property of THC. Spinach FEELZ is our platform designed to deliver unique and enhanced experiences made possible through proprietary blends of rare cannabinoids. We are excited about the possibilities that THCV is expected to give us and look forward to getting THCV products in the market in the future to complement our growing portfolio of rare cannabinoid offerings. As a reminder, last quarter, we announced a bolstering of our flower portfolio to meet the increasing demand for the 28-gram format.\n\nWith the launch of Strain Pacific 28 Gram offerings, Wedding Cake, and Tangerine Twist, we now have three flower SKUs in the top 10 for market share as of June 22, according to high-fire. Let me take a moment to discuss Cronos retail sales performance in the Canadian market. All the following numbers will be referencing retail sales for the second quarter of 2022, provided by high-fire. Cronos grew retail dollar sales by 69% year over year, while the broader Canadian market grew by just 23%.\n\nDifferentiated gains for Cronos were driven by a 36% growth in flower versus no market growth and 271% growth in vape versus the market growth of 34%. We didn't offer edibles for the vast majority of second quarter in 2021. And now we have 14.3% market share in the broader edibles category and 18.6% market share in the gummies category, maintaining our strong number two position in gummies. While we lagged market growth in pre-rolls, growing 9% versus market growth of 62%, we have a plan to improve this trajectory through SKU architecture and innovation.\n\nDespite challenges in the Canadian market, we continue to be focused on building profitable market share, utilizing our growing portfolio of cordless products. Moving to our results in Israel. Coming off a record first quarter for the team, this quarter, we celebrated the second anniversary of our PEACE NATURALS brand launch. In the second quarter, we recorded $7.2 million in revenue of branded product sales, up 212% year over year.\n\nAnd as of June 30, we have sold more branded products than we did in all of 2021, incredible growth in just one year. Similar to macro environment and other markets during early growth phases, Israel not without its challenges. As we know well, regulations, especially in cannabis, can change rapidly. There are two regulatory challenges that the Israeli market is currently facing.\n\nA pause in cannabis imports and the slowdown in patient permit authorization by the ACAR. While we believe the positive imports will be resolved over the coming months, we feel well equipped to manage a prolonged pause given our domestic cultivation and third-party supply relationships in Israel. We believe the slowdown in patient permit authorization led to an increase in competitive discounting. Recently released patient permit data for July showed evidence of a recovery in patient growth, growing slightly over 2% sequentially from June.\n\nWe expect these regulatory issues will be resolved over the coming months, and our business will return to strong growth. We're investing for the long term in the Israeli market and plan to expand on our leadership position. Our products continue to be sold in nearly all pharmacies offering medical cannabis, and we maintained our top three market share status in the quarter. As this market evolves, our continued focus on product quality and innovation will differentiate us and drive more consistent patient and consumer loyalty with our brand, PEACE NATURALS.\n\nMoving to Australia, where we have an approximate 10% stake in Cronos Australia, the team is executing at a high level in the early stages of the market development. Cronos Australia reported a preliminary 2022 revenue range of AUD 66 million to AUD 68 million, and an EBITDA range of AUD 10 million to AUD 11 million. Australia's cannabis market growth has picked up pace and is estimated to have a market size of $400 million by the end of year 2022, up from $230 million in calendar year 2021. We are pleased with the team's progress in this growing market.\n\nTurning to appointments within the organization, I am pleased to announce that Arye Weigensberg was appointed SVP, head of research and development after serving in an interim capacity since November of 2021. Arye has been with Cronos since 2019, and has played a foundational role in our innovation program. Prior to serving as interim Head of R&D, Arye was the General Manager and Vice President of Research and Technology at Cronos Research Lab. And before that, Arye was the CEO of Altria Israel and Altria Research and Development Hub.\n\nI'm confident Arye will drive Cronos' research and innovation initiatives forward as we look to the future and further develop our borderless product portfolio. Lastly, it's been a while since we could speak to momentum in Washington, D.C. regarding cannabis reform. Although we remain conservative in our thinking, we are pleased with progress moving in the right direction.\n\nWe continue to see a wave of legalization in various forms, state-by-state across the U.S., further building the support for legalization at the federal level. We continue to participate directly in various industry associations, and through our employee pack to drive the initiative forward. Outside of direct participation through our government affairs initiatives, we also have an option agreement with PharmaCann, one of the country's largest cannabis companies. We are pleased with their progress following the merger with LivWell Health and are confident in their go-forward strategy as a combined company.\n\nOutside of North America, we are also seeing growing interest in cannabis legalization, leading to more potential market opportunities. Although most of these efforts are in the early stages, we are assembling a portfolio of borderless products with strategic infrastructure and partnerships globally, combined with an industry-leading balance sheet to execute when the time comes. With that, I would like to pass it to Bob to take you through our financials.\n\nBob Madore -- Chief Financial Officer\n\nThanks, Mike, and good morning, everyone. The company reported consolidated net revenues in the second quarter of 2022 of $23.1 million, a 48% increase from the second quarter of 2021. Revenue growth year over year was primarily driven by an increase in net revenue in the Rest of the World segment driven by growth in the Israeli medical market and the Canadian adult-use market. Consolidated gross profit for the second quarter of 2022 was $4.1 million, representing a $19.9 million improvement from the second quarter of 2021.\n\nThe gross margin was positive 18%, up from negative 101% last year. The improvement versus prior year was primarily driven by the absence of inventory write-downs in the current period and increased gross profit in the ROW segment, which I'll get into a little more shortly. Consolidated adjusted EBITDA for the second quarter of 2022 was negative $18.8 million, representing a $31 million improvement from the second quarter of 2021. The improvement versus prior year was primarily driven by an improvement in the gross profit and a decrease in sales and marketing expenses, R&D expenses and general and administrative expenses, as a result of the company's strategic realignment initiative.\n\nTurning to our reporting segments. In the Rest of the World segment, we reported net revenue in the second quarter of 2022 of $21.6 million, a 61% increase from the second quarter of 2021. Revenue growth year over year was primarily driven by increased sales in the Israeli medical market, which was up 212% year over year, driven primarily by the flower category and increased sales in the Canada adult-use market, which was up 35% year over year. The growth in Canada was led by the cannabis extracts product category, which received the boost via the introduction of our gummies platform as well as the introduction of one-gram vapes.\n\nGross profit for the Rest of World segment for the second quarter of 2022 was $4.3 million, representing a $20.8 million improvement from the second quarter of 2021. The gross margin was positive 20%, up from a negative 123% last year. The improvement versus prior year was primarily driven by the absence of inventory write-downs as previously mentioned, increased cannabis flower revenue, the introduction of additional cannabis extract categories that carry a higher gross profit and gross margin than other product categories. And lastly, lower cannabis biomass costs.\n\nThis was partially offset by lower fixed cost absorption due to the timing of the wind-down activities associated with the exit of the Peace Naturals Campus. Although, we don't typically address sequential changes, given the realignment initiatives, we're working through. I think it's this quarter, warrants kind of breaking it down a little more. The fluctuation in margin from Q1 '22 to Q2 '22, was really largely driven by the timing in which we decided to cease our cultivation at Peace Naturals campus, and it led to lower fixed cost absorption.\n\nWhile we experienced really good favorability on both product margin mix, talking a lot about increases in extract sales. And biomass purchasing cost reductions year over year. The strategic realignment is intended to create a more consistent and higher gross margin for the business going forward. And we still expect that to be the case moving into the balance of this year and beyond.\n\nAdjusted EBITDA in the Rest of the World segment for the second quarter of 2022 was negative $9 million, representing a $23.6 million improvement from the second quarter of 2021. The improvement versus prior year was primarily driven by an improvement in gross profit and a decrease in general and administrative expenses. Now turning to the U.S. segment.\n\nWe reported net revenue in the second quarter of 2022 of $1.5 million, a 34% decrease from the second quarter of 2021. The decrease year over year was primarily driven by a reduction in volume as a result of a decrease in promotional spend and SKU rationalization efforts as the company implements its realignment of the US business, as Mike shed light on in his earlier comments. Gross profit for the U.S. segment for the second quarter of 2022 was negative $202,000 representing an $846,000 decline from the second quarter 2021.\n\nThe gross margin was negative 14%, down from a positive 29% last year. The decline year over year was primarily due to lower sales volumes and increased inventory reserves, driven by the realignment activities. Adjusted EBITDA in the US segment in the second quarter of 2022 was negative $3.9 million, representing a $6.8 million improvement from the second quarter of 2021. The improvement versus prior year was primarily driven by a decrease in sales and marketing expenses.\n\nTurning to our balance sheet. The company ended the quarter with approximately $945 million in cash and short-term investments. Capital expenditures for the quarter were $1.9 million, down approximately 10% year over year, primarily driven by decreased spending on property, plant and equipment in the ROW segment. We remain committed to deploying capital in a disciplined manner and only in ways that align with our strategic priorities.\n\nWith that, I'll turn it back to Mike.\n\nMike Gorenstein -- Executive Chairman\n\nThanks, Bob. Our strategic realignment puts our brands and products at the focal point by centralizing functions under common leadership, which has already resulted in cost savings and quicker decision-making. As we navigate this ever-changing environment, we know our cash must be mindfully spent and protected. We understand that the quarters that lie ahead for us may have their ups and downs, but I want to thank our dedicated employees who have worked very hard and continue to bring their passion for the industry and for Cronos to work with them every day.\n\nWe're all rowing in the same direction with a keen focus on product innovation, revenue growth, gross profit improvement and mindfully reducing operating expenses. With that, I'll open the line for questions.\n\nOperator\n\nThank you. [Operator instructions] The first question is coming from John Zarana, I'm sorry, Zamparo from CIBC Capital Markets. John, go ahead with your question.\n\nJohn Zamparo -- CIBC World Markets -- Analyst\n\nThank you. Good morning. I wanted to start on THCV, and this has been on your radar for some time, so it's encouraging to see the progress you've achieved. Can you talk about where you are in the past of getting product to market? And what have you learned from your experience with other cultured cannabinoids so far that can help you in this?\n\nMike Gorenstein -- Executive Chairman\n\nSure. Thanks, John. I think there's two things to think about here. The first is making sure that we get everything right from a product and the other is which provinces and when we're able to sell in.\n\nI think you'll see new products launch in the coming months. I don't want to give any specific dates as we try to avoid doing that with any new product launches. But similar to what you saw with CVG, you would expect similar rollout as far as what type of products they go in. But I will say THCV has been one we're extremely excited about.\n\nI do think that the opportunities with every incremental rare cannabinoid we have, they grow because they're synergistic. It won't just be two cannabinoids that we can start combining multiples. So I think from that perspective, there is more opportunity, and it's a really impactful cannabinoid that the entire team is very excited about.\n\nJohn Zamparo -- CIBC World Markets -- Analyst\n\nOK. That's helpful. Thanks. And then my follow-up is on the M&A side.\n\nI appreciate the commentary that you do want to be cautious and you want to preserve cash, but valuations in the sector continue to compress, especially in the U.S., I wonder how you feel about acquisition opportunities at the moment. Has your view changed at all and what you're looking for just based on the changing dynamics of the space, particularly valuations lately? Thanks.\n\nMike Gorenstein -- Executive Chairman\n\nSure. Thanks. Yeah. View has not changed as far as what we're looking for.\n\nWe still believe that in the long-term, this is an industry that will be about branded products. I think actually one of the things you're seeing, it's not just the macro environment that's changing valuations, but also price compression and often lack of differentiation. So we do see that there may be opportunities. But again, we would be looking more at how a company is able to differentiate with the brand, how durable do we think that their performance is as markets get more mature and more competitive versus just simply infrastructure and revenue.\n\nJohn Zamparo -- CIBC World Markets -- Analyst\n\nUnderstood. Thank you very much.\n\nOperator\n\nOur next question is coming from Michael Freeman with Raymond James. Michael, go ahead with your questions.\n\nMichael Freeman -- Raymond James -- Analyst\n\nHi, Mike. Hey, Bob. Hey, Shayne. Congratulations on the quarter and congratulations on the progress with your realignment plan.\n\nMy first question is on Israel. I mean we saw another quarter of impressive revenue. I wonder if you could shed some more light on how you expect this pause on imports to impact your – the quarters going forward. We recognize you have domestic operations and some other ways to buoy performance there, but I wonder how – if you could just shed more light on this.\n\nMike Gorenstein -- Executive Chairman\n\nSure. Thanks. Great question. We feel we've got for the next few quarters we don't have any issues with inventory.\n\nAnd if we were to see, if there was something that would prolong and import pause beyond what we expect. We have other options we can setup to ramp-up our capacity relationships in Israel. We think the one other thing that actually might be helpful is, given the, I'd say, a lot of products that came from a little bit excessive amounts of imports, I do think that it might reduce the amount of competitive discounting – and when you couple that with what we expect to be resuming patient growth, I think you'll start to see some unclogging. But we're very mindful in making sure that we have enough redundancy in our – pop-in.\n\nMichael Freeman -- Raymond James -- Analyst\n\nAll right. Thank you. That's very helpful. And as a follow-up question, following up on John's question on THCV.\n\nWe saw -- we were very happy to see that passed on through Ginkgo this quarter. And we given our coverage of Ginkgo are focused on biosynthesis process. We noted that a similar course biosynthesis pathway is used to get from sort of CBD family of modules to the THC family, we sort of positive that you may have Ginkgo and you may have the capability to produce THCV given capability that was exhibited in producing THCV here. If that were the case, would that be something that's interesting to Cronos economically, given the availability of THCV – THC today in the markets globally?\n\nMike Gorenstein -- Executive Chairman\n\nSo I think – that's a great question. I think when we had looked at it in prioritization, part of what we did intentionally was to prioritize the rare cannabinoids, just given that there is enough THC and CBD, I think the value for us in being able to use Canada to develop the borderless products and get them out. It's really about making sure that we have the actual product in market tested tweaks, so that as other markets open up. We're ready to go.\n\nSo regardless of the, I'd say, financial viability of it from just the logistics of getting the Cronos fermentation set up and ready to do the runs of production for different products. For us, it makes sense to prioritize the rare cannabinoids first. Once that's done and up and running, though, we still do intend to have THC and CBD as part of the eight cannabinoids that we had in our deal since the start\n\nMichael Freeman -- Raymond James -- Analyst\n\nOK. Thank you very much. I'll jump back in the queue.\n\nMike Gorenstein -- Executive Chairman\n\nDo we have another question on the line?\n\nOperator\n\nWe have Andrew Carter with Stifel on the line. Andrew, go ahead with your question.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nYes. Thanks. Good morning. First question I wanted to ask is about the Spinach flower performance in Canada.\n\nYou did highlight the bags out there, but kind of looking at it, we use headset data. Your 28-gram bag is sequentially is up 202%. And your eight-ounce was down 35%. So I guess first thing I'd ask is, are you at the right price points on the eight-ounce, is the 28-gram bag cannibalizing it.\n\nAnd I guess I'm really surprised to see the focus here on the 28-gram bag. Can that be profitable on an incremental basis, a lot of other LPs have gone this route, it had diminished your returns? That's my first question.\n\nMike Gorenstein -- Executive Chairman\n\nSure. So look, I think when we look overall at flower, we've still been able to outpace the market year over year, having grown 36% versus flat. And I think the reality we're seeing is that the market is -- you're seeing a big shift from smaller pack sizes to 28-gram. Now I think a lot of the 28-gram bags you've seen have been just by their nature, very focused on value.\n\nBut we have seen there is still demand for Spinach and the tier that we're in at 28-gram. So we are doing that while maintaining our brand and price positioning. But certainly, there is some amount of cannibalization. And I think that we had to make the choice of if that's where consumers are shifting, we want to be able to deliver to our consumers what they're looking for.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nAnd can that be profitable avenue of growth to 28-gram bag?\n\nMike Gorenstein -- Executive Chairman\n\nYes, I think so, especially when you look at vis-a-vis cost absorption on packaging and that our -- with our realignment moving to GrowCo, having better cost structure for flower overall.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nSecond question I wanted to ask in terms of the shift in focus in the U.S., the more kind of adult focus. That's going to be pretty -- I mean, well, not the beauty was doing well, but that's going to be a pretty narrow kind of focus on a market. I guess, can that segment on its own with just the market opportunities in hand be a profitable segment, or is there like an annual kind of loss or burn you're willing to endure in that segment just to kind of keep that alive and keep a toehold into any kind of future positive regulatory developments? Thanks.\n\nMike Gorenstein -- Executive Chairman\n\nSure. No. We certainly believe that it can be a profitable segment, and that's why you're seeing the focus. We're really looking at what flows through to the bottom line.\n\nI think as you're pointing out, if you look at revenue and look at bottom line and not all revenue is created equal. We see a much better margin profile with DTC than in wholesale beauty. And I'd also note that when we talk about the adult-use product formats, CBD is one cannabinoid that fits in there, but there's still other cannabinoids you're seeing us develop different rare cannabinoids, and for us it's about the product format that will eventually be able to fit what the consumer wants with our full suite of cannabinoids. So I'd say this quarter is a little bit of shrinking and getting a little bit more flexible and agile so that we can grow longer-term with so then that's more aligned with our focus.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nThanks. I'll pass it on.\n\nOperator\n\nOur next call -- our next question is coming from Andrew Bond with Jefferies. Andrew, go ahead with your question.\n\nAndrew Bond -- Jefferies -- Analyst\n\nThank you. Good morning, all. This is Andrew on the line for Owen Bennett. Thanks for taking our questions.\n\nSo first one for me is on international. I appreciate the color you gave on Israel and kind of some of the regulatory headwinds and price competition you're seeing. But moving outside of Israel, we also know you've had a position in Germany, a market where we've had some encouraging updates in recent weeks. So first one maybe for you, Mike.\n\nCan you remind us just kind of how you're positioned in the Germany market and any update on your strategic outlook there? That would be great. Thanks.\n\nMike Gorenstein -- Executive Chairman\n\nSure. So we have a distribution partnership with Pohl-Boskamp in Germany, largely flower sales and there's a lot of movement right now Germany-wise and I think a lot of discussion, our outlook is it can be – it can be a very good market. It's a market where we are certainly focused on. I don't know that, that's next six to 12 months.\n\nWe will be ready when we think there's movement, but it's looking like it's probably a little over a year away. Our best estimate now is 2024. And I think that some things need to be sorted out as far as dynamics. But our view is that ultimately in any market, especially in adult use market, having the best branded product portfolio is what's going to lead to success.\n\nAnd we feel that continuing to preserve our balance sheet flexibility allows us to move in and get the right infrastructure to support our -- getting our products out in the market. And so in parallel continuing to develop sours and field, our vape line and pre-rolls is what's going to lead to us winning an terminate.\n\nAndrew Bond -- Jefferies -- Analyst\n\nGreat. Very helpful color, Mike. Thank you. And just as a quick follow-up, a housekeeping item on gross margins maybe for you, Bob.\n\nIs there a way you could characterize or help quantify the impact to margins from the under absorption of fixed cost from the ceased production at Peace Naturals? Just want to get a sense of maybe what underlying gross margins could be, given some of the favorable items you called out around positive mix and reduction in purchasing costs? Thank you.\n\nBob Madore -- Chief Financial Officer\n\nYes. That's a great question, Andrew. Just strip out the depreciation change, resulting from our activities and the realignment and moving out of Stainer, if you look at gross margin, excluding the depreciation change, the margin rates in Q1 versus Q2 are pretty comparable at the end of the day. They're probably 3 percentage points different.\n\nAnd part of it is really in Q2 related to the U.S. segment and our realignment repositioning, some inventory reserves and other things we took. But it's pretty -- it's a very comparable margin rate Q1 versus Q2 and a significant improvement versus prior year. So hopefully, that answers your question, if you eliminate the noise around depreciation or absorption – under absorption of fixed costs.\n\nAndrew Bond -- Jefferies -- Analyst\n\nVery good. Thank you. Very helpful color. I will pass it on.\n\nOperator\n\nOur next question comes from Vivien Azer with Cowen. Vivien, please go ahead with your question.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nHi. Thank you. Good morning. I was hoping to follow up on some of the U.S.\n\ncommentary, please Mike, in terms of the repositioning of Lord Jones to adult-use form factors. How are you thinking about preserving and then ultimately enhancing brand equity, when that was such a topical static business? And what do you mean by adult-ease form factors specifically? Thanks.\n\nMike Gorenstein -- Executive Chairman\n\nSure. Thanks, Vivien. It's a great question. I think you remember the Lord Jones brand, I think from back in its call like THC days, but to me, Lord Jones always actually a gum drop brand first, that was the original hero SKU, and I think that's what it became known for.\n\nAnd what I want to make sure is that we get back to being well known with cannabis consumers and I think that it's very difficult to sort of start bearing to beauty and cannabis at the same time. So making sure that we're on the form factor that even if it's not Delta 9 THC today, right, it can pivot in the future. So, we just launched CBN in Canada. So certainly, you can see that we're moving the other form factor -- or sorry, other cannabinoids in the same form factors.\n\nAnd I think that cannabis consumers do go and look at other cannabinoids that aren't just THC.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nPerfect. Thank you. And then on Israel, encouraging that you called out a sequential improvement in the patient adds. But where do you think that market stands in terms of total population penetration rates? Thanks.\n\nMike Gorenstein -- Executive Chairman\n\nSure. Look, that's a great question. I think it's still very, very early. There were some issues with the doctors that had historically been prescribing that we have not been able to prescribe over the last few months.\n\nWe understand there to be quite a bit of pent-up demand. And we think that, that number of patients today could depending on how the regulatory environment goes could easily double or triple, if we were to have something that sort of smooth open a little bit. So I don't think that we've come anywhere close to penetrating the population there. I think that -- you've got the highest consumption in Israel of any country in the world.\n\nSo having 116,000 patients is really just scratching the surface.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nYeah. Understood. But like when you think about kind of that opportunity that doubling or tripling, how do you think about benchmarking it? Does it look like Florida? Does it look like in Oklahoma? Is that even appropriate? Thanks.\n\nMike Gorenstein -- Executive Chairman\n\nSure. I'd say Ford is a unique market. And so it's kind of hard to compare there. One of the things that's really difficult when you think about Israel, should the illicit market is so different than it is in North America.\n\nSo it's a little bit more captive. Oklahoma is -- there's a lot of interesting dynamics around Oklahoma as well. I look at it as Colorado when it starts to near completion, but I also do think that it will be a pretty lucrative medical market, probably going to be hard to find a comp. When you think about population size, when you think about consumption and general attitude toward cannabis, I do think it's long-term and a little bit like Colorado.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nThat's helpful. Thank you.\n\nOperator\n\nOur next question is coming from Shaun McGeough from Canaccord Genuity. Shaun, go ahead with your question.\n\nShaun McGeough -- Canaccord Genuity -- Analyst\n\nGood morning and thank you for taking my questions. The first one is on the Ginkgo Bioworks relationship. So I just wanted to get an understanding for the for the export potential as it relates to the cultured cannabinoid products coming out of that relationship. Just any sort of anecdotes that you could give on what kind of hurdles would need to be overcome to export those products? And how that may differ from the current process for exporting THC-based products?\n\nMike Gorenstein -- Executive Chairman\n\nThanks. Yes. It's a great question. Certainly depends on the country.\n\nA lot of the countries do have programs that mirror Canada. And if the language mirrors Canada, there's not going to be any issues, there are some markets, and I think a lot of the newer markets you see that are still flower or primarily flower only markets, so until that opens up, it's really more of an opportunity to export flower. Each market is very different, but expectation is as markets mature, you're going to see, you're going to see us be able to provide a data set to have it treated the same as other cannabinoids. So to me, the biggest issue is getting different types of extracts and derivative products open up.\n\nShaun McGeough -- Canaccord Genuity -- Analyst\n\nOK. Thank you. And then just pivoting, I wanted to take a deeper look into just the scale of your partnership with Geocann and the rollout of the – I don't know, if I'm pronouncing it right, VESIsorb delivery technology. Are there plans to leverage that technology across your entire product platform, including your THC offerings, or does it just only cover CBD based products, so essentially, would you be transitioning your current portfolio edibles and other derivatives to use that technology? And if so, could you just speak to any of the considerations or investments needed from Cronos standpoint to do this? And if there's any benefits to that?\n\nMike Gorenstein -- Executive Chairman\n\nSure. I think, today, the only product that we've announced that will have the technology in it is in the Gel Capsules in the U.S. But what I will say is, when we think about our product portfolio and think about what consumers want, there's always been sort of a matrix. So on the one hand, we talk about the product format that's – the different types of edibles like, like the gummy platform, vapes, pre-rolls and on the other hand, we talk about effects.\n\nAnd usually, you hear us talk about what that means as far as what are the actual cannabinoid formulas we have. So is it THCV, is it CBC, is it THC, but part of the effects in addition to those cannabinoids is also timing. So what type of a multiplication using onset, offset. So it's something that is – has been factored in and we've done consumer research.\n\nIt's something that we do think, there is a lot of demand for consumers, and it's something that we think can be very, very positive for the portfolio. But I wouldn't think of it as a cutover there. Just to give you an example on edibles, there are a lot of people that have become accustomed to waiting for the onset with edibles and there's a ritual, there's comfort and they like that. There are other people who wish it with faster.\n\nSo it really depends on what the product is, how we would formulate and what we would do. But I would expect a lot more innovation from us to come, and there's certainly been a lot of work done there for what we do with onset and offset.\n\nShaun McGeough -- Canaccord Genuity -- Analyst\n\nAppreciate the color there. I'll pass it on.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nShayne Laidlaw -- Investor Relations\n\nMike Gorenstein -- Executive Chairman\n\nBob Madore -- Chief Financial Officer\n\nJohn Zamparo -- CIBC World Markets -- Analyst\n\nMichael Freeman -- Raymond James -- Analyst\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nAndrew Bond -- Jefferies -- Analyst\n\nVivien Azer -- Cowen and Company -- Analyst\n\nShaun McGeough -- Canaccord Genuity -- Analyst\n\nMore CRON analysis\n\nAll earnings call transcripts"
}