{
  "companyName": "1-800-Flowers.com",
  "companyTicker": "FLWS",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/1-800-flowerscom-flws-q1-2023-earnings-call-transc/",
  "content": "1-800-Flowers.com (FLWS 0.21%)\nQ1 2023 Earnings Call\nNov 03, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the 1-800-FLOWERS.COM, Inc. 2023 first quarter results conference call. [Operator instructions] I would now like to turn the conference over to Andy Milevoj, senior vice president of investor relations. Please go ahead.\n\nAndy Milevoj -- Senior Vice President of Investor Relations\n\nGood morning, and thank you for joining us on 1-800-FLOWERS.COM's fiscal 2023 first quarter earnings call. For those of you who have not received a copy of our press release issued this morning, the release can be accessed at the investor section of our corporate website at www.1800flowersinc.com. We will begin today's call with brief formal remarks, and then we will open the call to your questions. Joining us today are Chris McCann, CEO; Tom Hartnett, president; and Bill Shea, CFO.\n\nBefore we begin, I need to remind everyone that some of the statements we will make on today's call may be forward-looking within the meaning of the Private Securities Litigation Reform Act of 1995. These statements involve risks and uncertainties that could cause actual results to differ materially from those expressed or implied in the applicable statements. For a detailed description of these risks and uncertainties, please refer to our press release issued this morning, as well as our SEC filings, including the company's Form 10-K and Form 10-Q reports. In addition, we will discuss certain supplemental financial measures that were not prepared in accordance with generally accepted accounting principles.\n\nReconciliations of these non-GAAP financial measures to the most directly comparable GAAP measures can be found in the tables accompanying the company's press release issued this morning. The company expressly disclaims any intent or obligation to update any of the forward-looking statements made in today's call, any recordings of today's call, the press release issued earlier today, or in any of its SEC filings, except as maybe otherwise stated by the company. And now, I'll turn the call over to Chris McCann.\n\nChris McCann -- Chief Executive Officer\n\nThank you, everyone, and good morning. Before I begin my formal remarks on the quarter, I wanted to take this opportunity to congratulate Joe Pititto on his upcoming retirement this December and to thank him for his more than two decades of tireless commitment to our company during a period of our company's tremendous growth and transformation. Joe has been a tremendous asset to our company, and his drive and passion for telling our growth story have been invaluable to us. We wish Joe all the best upon his retirement.\n\nAnd good luck, Joseph. I also wanted to take this opportunity to introduce Andy Milevoj, who joined our company as SVP of investor relations in September. So, thank you again, Joe, and welcome, Andy. And now, let's review our results.\n\nAs we noted in this morning's press release, our first quarter results were slightly better than our expectations. Overall, consumer behavior continues to reflect the significant inflationary pressures in the macro economy that are affecting both discretionary and nondiscretionary spending. This reflects a continuation of the trends that we saw beginning last December. Our first quarter revenues declined 1.9% as we saw consumers purchasing fewer everyday gifts.\n\nWe experienced softness in our consumer floral and gift business, which was somewhat offset by the growth of our gourmet foods and gift baskets business. By adding value and choice to our higher price point gift baskets, we encourage customers to trade up in assortments, and we strategically managed pricing. This resulted in an increase in average order value in our gourmet food and gift basket business. We were also encouraged by the year-over-year rebound in our wholesale business.\n\nBy getting ahead of the supply chain challenges from last year, our team was able to build and deliver gift assortments to our wholesale customers earlier than a year ago. This enabled our wholesale business to increase market share. During the quarter, we added more than 775,000 new customers, and existing customers represented 70% of total revenue. Now, let's turn to what we see ahead.\n\nAs we look forward to the holiday season and the balance of our fiscal year, we are cautiously optimistic that consumers will continue to spend on the major gift-giving holiday occasions, but we anticipate that they will remain cautious in their spending otherwise. During last year's holiday season, consumers were urged to shop much earlier in the period in response to supply chain constraints, which led to an unprecedented pull forward of business. This year, we expect that consumers will shop later in the holiday and that it will be promotional. We are already seeing an extremely competitive and promotional environment with many companies promoting Black Friday-like events in early October.\n\nAnd in contrast to a year ago, when most retailers struggled to get inventory on containers and through shipping ports, today, many companies are flush with excess inventory and are being highly promotional to sell through that inventory. Not surprisingly, as we look at our customer base, customers in the lower-income tier appear to be most affected. As consumers continue to respond to these macro pressures, our platform provides us the ability to offer customers a wide range of attractive price points for gifts to help them build better relationships in their lives. This includes our good-better-best offerings from 1-800-FLOWERS, our attractive entry price points from the Personalization Mall, and adding additional value offerings at Harry & David.\n\nRecognizing a strong consumer response to our bundled offerings, we've launched additional bundles this year that combine some of our best products, like our famous Royal Riviera pears and Cheryl's holiday cookie collection. We are pairing our award-winning Harry & David wines with flowers from 1-800-FLOWERS, cookies from Cheryl's Cookies, and wild-caught seafood from Vital Choice. At our Personalization Mall, following the success of our Easter bundles, we've developed food products to bundle with our personalized Halloween trick-or-treat bags and Christmas mailbox tunes. Additionally, we're always looking to expand our reach into new categories where we have identified customer trends.\n\nOne of our goals, as we grow our Better For You selections, is to have more options available for a wide variety of customers with dietary preferences or restrictions, such as our expanded organic and gluten-free selections. This includes our new line of Cheryl's vegan cookies. From a marketing perspective, our efforts are focused on developing and growing our multi-category customer cohort to increase purchase frequency and define our company as the preferred destination for all of our customers gifting needs. As could be expected, net sales per customer are our highest among our multi-category customers, followed by our Celebrations Passport numbers.\n\nWe're utilizing innovative social and mobile technology to engage with our customers, including the use of video and engage in creative content. And we have expanded our content and influencer partnerships. As a result of these efforts, we are much better positioned to engage with our customers and be top of mind for the holiday season. This also enables us to reduce our reliance on more expensive forms of advertising and allocate more of our marketing dollars to the other areas of the funnel that provide a higher return on investment.\n\nSpeaking of cost-containment efforts, in addition to reducing our marketing spend on a daily basis, we also expect ocean freight and commodity costs to decline throughout the year. In fact, ocean freight rates are already significantly lower today than they were during the second half of fiscal '22. We have also taken strategic actions to partially offset our labor and shipping cost. First, we increased the automation of our distribution facilities in Medford, Oregon; Cleveland, Ohio; and more recently Atlanta, Georgia, which increases throughput at those facilities while reducing our reliance on seasonal labor.\n\nSecond, as part of our efforts to optimize logistics, we've also strategically reduced shipping zones by shipping products to facilities that are closer to recipient, enabling us to use a lower-cost shipping method without impacting the speed at which we can deliver those smiles. We have also strategically built inventories of nonperishable items to get ahead of the global supply chain disruptions, ensuring that we have the products that are needed for the holiday season. As we sell through that inventory this fiscal year, we expect free cash flow to improve more than $135 million this year compared with last year, benefiting in large part from the working capital reduction, as well as lower capital expenditures. While the current macro environment remains uncertain, I'm extremely proud of our team's efforts to address and influence the areas within our control.\n\nAs we look ahead, our entire organization is focused on executing our key strategic priorities that position us as a leading gift-giving e-commerce platform. We have made significant strides in transitioning our company and our all-star family of brands into a platform that is focused on inspiring our customer community to give more, connect more, and build more and better relationships. We have proven our ability to identify, execute, and integrate accretive acquisitions that benefit from being on our platform, which drives accelerated revenue growth and enhanced profit contributions from those businesses. And in turn, we have created a highly scalable platform that enables solid top- and bottom-line long-term growth and expanding market share positions.\n\nWe expect our margins to begin to improve in the second half of this year and even more so next year. As these costs continue to decline, and our margins return to the historical levels over the next few years, we expect to see a substantial increase in EBITDA. Looking beyond the current horizon, we are confident that we are positioned to emerge a bigger, better, and stronger company and, in turn, build shareholder value over the long term. Now, let me turn the call over to Bill to give his review of some of the key financial metrics for the quarter.\n\nBill?\n\nBill Shea -- Chief Financial Officer\n\nThank you, Chris. As Chris noted, our first quarter performance was slightly better than our expectations. Revenues declined 1.9% as consumers continue to adapt to this inflationary environment. Comparing our first quarter results to the year-ago period, it is important to remember that we faced a difficult margin comparison as the year-ago results had not yet been affected by the global supply chain challenges and the surge in shipping, commodity cost, labor, and fuel, which began to escalate and impact our fiscal second quarter last year.\n\nAs we head into our fiscal second quarter, we expect our margins will begin to stabilize and then improve during the second half of the fiscal year. This expectation reflects the lower year-over-year ocean freight costs we are already seeing, commodity costs coming off their highs, more stable labor market, as well as the initiatives that we have implemented that Chris highlighted. These initiatives include the increased automation of our warehouses to offset higher labor rates and our logistics optimization initiatives that have enabled us to partially offset higher shipping rates, while maintaining delivery speed to customers. As we have described in the past, in response to the unprecedented supply chain disruption a year ago and to ensure that we had the appropriate inventory on hand for the current fiscal year, we made the strategic decision to invest in working capital and increase our inventories of nonperishable items.\n\nAs the global supply chain has improved and as we sell through that inventory this year, we expect to bring inventories down and generate more than 75 million in free cash flow in the current year, representing an improvement of more than 135 million as compared to a year ago. Longer term, benefiting from the strategic initiatives, we believe that we are well-positioned to gradually improve our gross margins and leverage the significant top line of the past few years to drive bottom-line results. Now, let's review our key metrics for the first quarter. All comparisons will be to the prior year unless otherwise stated.\n\nTotal net revenues declined 1.9% to 303.6 million as compared to revenues of 29.4 million in the prior year. Excluding contributions from Vital Choice and Alice's Table, which we acquired in October and December of 2021, respectively, total revenue for the quarter declined 3.6%. Gross profit margin for the quarter declined 720 basis points from 40.6% to 33.4%, primarily reflecting significantly increased year-over-year costs for labor, shipping, and commodities. Operating expenses were 47% of total sales as compared to 47.1% in the prior-year period, reflecting lower marketing costs, partially offset by higher depreciation associated with automation and technology projects.\n\nAs a result, our first quarter adjusted EBITDA loss was 28 million compared with an adjusted EBITDA loss of 5.3 million a year ago. Net loss was 33.7 million, or $0.52 per share, compared with a net loss of 13.2 million, or $0.20 per share, and adjusted net loss of 12.9 million, or $0.20 per share, in the prior-year period. Regarding our segment results. Gourmet food and gift basket segment revenues grew 11% to 108.2 million compared with 97.5 million in the prior year.\n\nRevenue benefited from the inclusion of Vital Choice and improved wholesale sales. The segment's gross profit margin declined to 23.2% from 35%, primarily reflecting increased labor, commodities, and transportation costs, charges associated with perishable inventory write-offs, as well as product mix, reflecting the sharp sales increase in the lower-margin wholesale channel. The segment's contribution margin was a loss of 18.7 million compared to a loss of 7.7 million a year ago. In our consumer floral and gifts segment, revenue decreased 10.5% to 162.2 million from 181.2 million a year ago as consumers pulled back on everyday gift-giving occasions.\n\nGross profit margin decreased to 38.2% compared with 41.9% in the prior-year period, primarily due to increased transportation and commodity costs. Segment contribution margin was 10.8 million compared with 19.2 million in the prior year. In our BloomNet segment, revenue for the quarter increased 8.2% to 33.4 million due to an increase in our wholesale channel. Gross profit margin decreased to 43.4% compared to 50% in the prior-year period, primarily due to product mix and higher shipping costs.\n\nAnd segment contribution margin was 9.5 million compared with 10.9 million in the prior-year period. Turning to our balance sheet, our cash and investment position was 9.4 million at the end of the first quarter, seasonally low, as we prepare for the holiday period. Inventory was 342.6 million compared with inventory of 282.4 million at the end of last year's first quarter as a result of the factors we discussed. In terms of debt, we had 158 million in term debt and borrowings of 140 million under our revolving credit facility in preparation for the upcoming holiday season.\n\nBorrowings under the revolver will be fully paid during the fiscal second quarter. Guidance for fiscal 2023. While the highly unpredictable nature of the current macro economy make it difficult to forecast in this environment, we wanted to share our current outlook for the balance of the year. After growing revenue 77% over the last two fiscal years, we expect revenues to decline in the mid single-digit range in fiscal 2023 and lower consumer confidence and cautious spending behavior.\n\nWe expect to mitigate the impact of the revenue decline on our earnings through our strategic pricing programs, our moderation of cost inputs, and the investments we have and continue to make in our business platform. Based on these items, we do expect to gradually improve gross margins and bottom-line results during the latter half of the current fiscal year. Our guidance also assumes the restoration of 100% bonus payout in fiscal 2023 compared with the limited payout in fiscal 2022. Based on these assumptions, we expect adjusted EBITDA to be in the range of 75 million to 80 million.\n\nAdditionally, we expect free cash flow to exceed 75 million. I will now turn the call back to Chris.\n\nChris McCann -- Chief Executive Officer\n\nThank you, Bill. To recap our performance for this quarter, our results was slightly better than our expectations. However, consumers continue to be challenged by inflationary pressures. We believe that the macro environment will remain challenged through the remainder of the fiscal year and are proactively addressing these trends with strategic pricing and compelling high value bundle assortments that appeal to a wide variety of customers.\n\nOur core customer remains loyal, and we continue to deepen our relationship with them through our innovative marketing and engagement efforts. We believe, as we enter this holiday season, we are well-positioned to engage with our customers and drive sales with our cross-category and cross-branded merchandise programs. As we look forward, we know that the macro economy remains uncertain, but we have been diligently focused on reducing costs throughout our business. We have reduced our labor requirements by improving efficiency in our facilities, partially mitigating shipping costs by optimizing logistics, and strategically building inventory to avoid supply chain issues, particularly for this holiday season.\n\nAs a result, we are confident that, over time, we will see our costs decline further, particularly shipping in commodities. And we expect to see our margins normalize back to historical levels over time. We are proud of what we've built, which is a strong, unique e-commerce business platform supported by a very experienced team. Over the past 10 years, we've tripled our business through organic growth and strategic acquisitions.\n\nToday, we have emerged out of the pandemic a bigger, better, and stronger company, providing an all-star family of brands; an advanced technology stack; strong manufacturing, distribution and logistics capabilities; an extensive digital marketing experience; and an expanded customer file and loyalty program. We believe our future is bright and that we will grow our business and improve our profitability and build solid shareholder value over the long term. And now, I'd like to open the call for questions.\n\nOperator\n\n[Operator instructions] And our first question will come from Michael Kupinski with NOBLE Capital Markets. Please go ahead.\n\nChris McCann -- Chief Executive Officer\n\nMichael? We can't hear Michael.\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nWell, first of all, I wanted to say, Joe, congratulations on your retirement. I've greatly enjoyed working with you over the years. You're going to be greatly missed. So, please keep in touch.\n\nI got a couple of questions here. Can you give me the number in terms of what was the contribution from Vital Choice in the quarter? And if you could just give me the same-store revenue for the gourmet food and gift.\n\nChris McCann -- Chief Executive Officer\n\nSure, Michael. I'll ask Bill to provide that. So, Vital's small. But what --\n\nBill Shea -- Chief Financial Officer\n\nYeah. So, basically, Vital Choice, we really don't break down, you know, individual brands. But because Vital Choice, it's the first year, you know, we kind of gave the, you know, with our guidance what the revenue, you know, kind of with and without the -- compute it anyway. But basically around $5 million or so, you know, in the quarter.\n\nYou know, again, it's a small acquisition. It did about 25 million or so annually prior on the, you know, the last year, prior to the -- our acquisition.\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nGotcha. And I understand that there are four suppliers that have decided not to plant, given the price of energy prices. I was wondering if you've noticed any issues with your suppliers for Flowers. Or any disruptions, given issues with energy prices, that sort of thing? If you can just talk a little bit about that.\n\nChris McCann -- Chief Executive Officer\n\nTom, did you want to take that?\n\nTom Hartnett -- President\n\nThis is Tom Hartnett. We have not seen any disruption with our suppliers. We've had our, you know, supplier relationships for decades and very stable. And we haven't seen any challenges at all with floral supply.\n\nChris McCann -- Chief Executive Officer\n\nYeah, Michael, I would add, you know, even last year when there was a little bit of challenge, we were fine because of the relationships that Tom referenced and all. But even overall, we have -- we're not aware of any issues in the floral supply chain side of things.\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nGotcha. I appreciate that. And then, can you talk a little bit about -- you've mentioned 75 million of free cash flow. Can you talk a little bit about capital allocation at this point, what your thoughts are?\n\nChris McCann -- Chief Executive Officer\n\nYeah, I guess as we look at capital allocation in business, you know, really haven't changed much. I mean it's -- first and foremost, we look to invest in our business to use the capital that we're raising to invest in the business. We've done that over time. So, I think we've done it very well through strategic acquisitions and how we integrate those, allocate the capital appropriate for integration, as well as the cost of the acquisition itself.\n\nThen, you see us doing things like we've done in the last year or two in adding automation into the facilities where we can, really automating some of our distribution centers and gaining traction there. And then, we'll always be looking to see what other opportunities are there for us to return shareholder value, you know, to return value to the shareholders. You know, stock repurchase, we've been doing that to basically mitigate share creep over the past couple of years, and I think that will continue.\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nGotcha. And just on the wholesale business in gourmet food, I know that business has kind of been pretty wide fluctuations year over year, given whether or not, you know, the product has been in, you know, soon enough into the marketplace and whether or not there's been demand for that type of product. Can you just kind of give us a sense of what your thoughts are in terms of wholesale business this year versus last year, maybe the years before, and whether or not -- and how you see that business shaping up this year versus some of those periods in the past?\n\nBill Shea -- Chief Financial Officer\n\nYeah. And, you know, just a reminder, you know, Michael, wholesale is still a relatively small piece of our overall business. It represents only around, you know, 5%, a little over 5% of our overall, you know, revenues. But we have a good book of business, you know, with wholesale this year.\n\nYou know, we had that going into, you know, had that going into the year. You saw some of that benefit of Q1 in that, you know, the challenges of the global supply chain that we had a year ago, you know, kind of deferred all wholesale into the second quarter and a little bit into the third quarter. This year, we were able to ship some of that in Q1 this year. But we have a strong book of business on wholesale.\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nGreat. I'll let others ask question. Thank you so much.\n\nChris McCann -- Chief Executive Officer\n\nThank you, Michael.\n\nOperator\n\nOur next question will come from Anthony Lebiedzinski with Sidoti and Company. Please go ahead.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nYes. Good morning, and thank you for taking the questions. And likewise, Joe, it's been certainly a pleasure to work with you for a long time and the best of luck in your pending retirement here. So, I guess, you know, first, just in terms of the bonus payout headwind, Bill, maybe can you quantify that? How much do you think that that will be for the year?\n\nBill Shea -- Chief Financial Officer\n\nYeah. So, a year ago, you know, basically, executives got zero bonuses. And we did limited payouts to, you know, nonexecutives. This year, we obviously hope to, you know, pay bonuses at 100%.\n\nThat's why we had a $12 million year over year impact. And, you know, it's only if we perform.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nOf course. Right. Right. OK.\n\nAnd was any of that accrued in the first quarter or not yet?\n\nBill Shea -- Chief Financial Officer\n\nNo, we accrue it on straight-line basis. And so, you know, we're looking at --\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nOK.\n\nBill Shea -- Chief Financial Officer\n\nYou know, right now.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nGot it. OK. Perfect. OK.\n\nAnd then, did you guys quantify how much the wholesale revenue -- I may have missed this, but the wholesale revenue was up in the first quarter here. If you did, I apologize for missing that. But if you could just talk about wholesale.\n\nBill Shea -- Chief Financial Officer\n\nWe did. But it was -- you know, it was the driving force of the, you know, of the growth in the gourmet food and gift basket, 11% growth in the -- you know, that was -- you know, primarily due to wholesale.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nOK. Got it. OK. And then, in terms of the automation efforts, you guys have done a lot there in terms of upgrading your infrastructure.\n\nIs there more to do there or -- in terms of those efforts? Should we expect additional automation initiatives?\n\nChris McCann -- Chief Executive Officer\n\nSure. There's always additional automation initiatives that we'll be looking at, Anthony. But, Bill, you put a good expectation together on that over the next year or two, right?\n\nBill Shea -- Chief Financial Officer\n\nYeah. So. We completed the, you know, the automation of the Atlanta facility, you know, this first quarter, slightly into the second, you know, the second quarter here. And overall, we're taking our capex down around 20 million.\n\nSo, you know, the last couple of years, we had, you know, 55 million, then we had 66 million last year. And this year, we're going to be more in the mid-40. So, the big efforts on automation are behind us. Now, as we grow into the future, there's always going to be needs for, you know, for further automation.\n\nBut we're at a good spot right now.\n\nChris McCann -- Chief Executive Officer\n\nAnd again, we continue to look to automate the customer contact center and how we're doing that utilization of AI technologies, IVR, voice recognition technologies, etc. So, we'll continue that type of automation as well.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nGot it. OK. And then, you know, lastly, in terms of passport membership and just overall behavior, are you still seeing passport members spending, you know, more than twice as much as the nonmembers?\n\nTom Hartnett -- President\n\nYeah, this is Tom. We are continue to see passport members, you know, purchasing at two to three times the amount of nonpassport members. We're happy with the membership growth we saw in the quarter. I think we grew over, you know, beginning of the year.\n\nAnd on an everyday basis, we're seeing, you know, 18% to 20% of our revenue coming from our passport customers. So, you know, good stuff there.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nGot it. All right. Well, thank you, and best of luck.\n\nTom Hartnett -- President\n\nThank you, Anthony.\n\nOperator\n\n[Operator instructions] Our next question will come from Alex Fuhrman with Craig-Hallum Capital Group. Please go ahead.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nHey, guys. Thanks very much for taking my question. I wanted to ask about the big push that you saw last year really across the industry to get orders in early. Given a lot of anticipated supply chain problems, you know, have you seen any sort of repeat of that behavior? Just wondering how you think about that.\n\nI'm sure that must be a challenge from a forecasting standpoint, given that a lot of orders that might have already come in last year are probably going to be trickling in here over the next couple of weeks.\n\nChris McCann -- Chief Executive Officer\n\nSure thing. Thank you, Alex. I'll start with that answer a little bit, turn it to Bill and Tom. I think if we look at, you know, coming out of Q1, you know, again, we're pleased that we exceeded the expectations that we had going into Q1.\n\nAnd keep in mind, Q1 is, you know, where -- as we've been stating, where we've seen softness from the consumer has been in those everyday occasions. And that's all Q1 is. There are no holiday occasions. So, we're cautiously optimistic as we move forward into the holiday season.\n\nWhat we saw last year, business being pushed forward, we're not seeing as much of that this year. And we're expecting business to come in more like -- closer to the holiday, more like, you know, consumer behavior from the pre-pandemic -- pre -- excuse me, pre-pandemic point of time. So, we're expecting that to shift a little bit later. But I think we're in a really good position, what we see from our customer file, what we see from the products that we've added to the position.\n\nI think we're in really good position to handle that, especially with the automation that we're just talking about. Bill or Tom, do you want to add any color to that?\n\nBill Shea -- Chief Financial Officer\n\nNo, I think just, you know, the investments that we made in inventory. We have the inventory a year ago. There were challenges with the global supply chain. So, that created operational challenges from a labor perspective.\n\nYou know, we've seen a moderation of labor rate. And access to labor is much more available this year than it was a year ago. Plus, as Chris mentioned, you know, the automation efforts had just, you know, needing less, you know, less seasonal labor. So, we're in a very good position operationally to execute this holiday season.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nGreat. That's really good to hear. And then if I could just touch on the $75 million of free cash flow. I think last quarter, you were saying, you know, something better than breakeven.\n\nSo, obviously a huge jump. I don't know if maybe you were just being a little bit conservative before. But is the decline in freight and labor, I mean, is that really the bulk of where that free cash flow is coming from over the past couple of months?\n\nBill Shea -- Chief Financial Officer\n\nI think with respect to, you know, last quarter we really didn't give annual guidance, right? So, we were -- you know, we just were giving kind of the message that, \"Hey, it's going to be positive. We are coming off a year where we made a big investment in working capital.\" And that's what created the negative cash flow last year. And we just wanted to make sure the message got out that cash flow would be positive. Now that we've, you know, shifted, we were a little further along.\n\nYou know, we got a little more visibility into some of the macro trends. We wanted to give, you know, annual guidance and state really where we believe at this point in time where, you know, where the year will turn out from both the top- and bottom-line perspective and where our cash flow. The big driver of the cash flow and the 135 million, you know, is, you know, related to kind of the working capital swings where it was an investment last year. And this year, we will be taking inventory down year over year.\n\nThe global supply chain, you know, has improved as we sell through this inventory. We're not going to have to keep it at these type of levels. But certainly, the overall guidance with, you know, with EBITDA being between, you know, 75 million and 80 million. You saw where Q1 was, right? You know that was the quarter where, you know, we took the big -- where we took the big hit.\n\nSo, our guidance implies that we're, you know, we're relatively flat from EBITDA, year-over-year basis, you know, going forward. And the consumer is still top. So, you know, top line is going to be a challenge. You know, we have it, you know, guided at that, you know, down, you know, mid-single digits.\n\nSo, we've got to get it back on, you know, from a margin perspective and from an opex perspective. And certainly, you know, some of those -- so freight coming down, labor stabilizing, while helping to, you know, improve our gross margins. And that's why we're -- you know, we've kind of stated that we think, you know, we believe gross margins stabilize in Q2 and then actually improving in the second half of the year.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nOK. That that's really helpful. Thank you. And a big congratulations to Joe.\n\nChris McCann -- Chief Executive Officer\n\nThank you, Alex.\n\nOperator\n\nOur next question will come from Dan Kurnos with The Benchmark Company. Please go ahead.\n\nDan Kurnos -- The Benchmark Company -- Analyst\n\nGreat. Thanks. Good morning. Joe, best suspenders by far across all of the industry.\n\nI wish you the best in your retirements. Obviously, it's been a pleasure working with you all these years. You were [Inaudible] in the industry. Chris, you know, I don't want to frame it this way, but I just -- what gives you the confidence in kind of the return to more normal spending patterns? Because every single e-comm and advertising company we've seen suggests that there's going to be some kind of spending cut after the election.\n\nAnd I get that, you know, there are mixed signals across the space. But, you know, Amazon, regardless of the maybe overinflated outlook we all have for them, having early prime days, obviously, is the signal that they think the holiday season is shifting forward again. And we've seen, you know, other things out there suggesting that there's probably as much as five to 10 points for the season shifting into the front half. So, is it around, like, orders, order volume indication? Like, what kind of helps inform the way that you're thinking about the consumer, specifically, spending patterns heading into this holiday period?\n\nChris McCann -- Chief Executive Officer\n\nSure, Dan. You know, it's a couple of things there. So, thanks for the question, first of all, and great comments on Joe. So, as we look forward, I think, you know, again, we're cautiously optimistic as we look forward.\n\nClearly, as consumers continue to respond to the broader economic pressures, our platform provides us the ability to have a wide range of price points. And that's why even, you know, what we're seeing was we see weakness, more weakness in the lower tier end of our customer file. But, yeah, we need to make sure we have a wide range of products to satisfy that customer. Why we're seeing the bundles that we talk about take off with our higher-end customers and helping to drive AOV higher is working for us.\n\nI think you're right. We're seeing mixed signals of -- you know, we're seeing Amazon, you know, certainly, with all these Black Friday events that we're seeing already. So, we've seen promotional activity try to move business earlier. We don't see that happening to the extent that it has -- certainly, to the extent that it happened last year.\n\nWe see, you know, UPS and others talking about business coming closer to the holiday. Other retailers that we talk with have seen similar trends. But really, what gives us the confidence, again, is the platform, the good-better-best offerings that we have, the health of our customer file, the operation operating more efficiently, seeing what we -- the benefits of the investments that we made that Bill just spoke about on the automation front. And again, the fact of what we've seen really since last year is the consumer weakness that we're experiencing is in those everyday occasions.\n\nWe saw the consumer come back at Valentine's Day last year. We saw the consumer come back on Mother's Day last year. We saw it just this quarter really with a, you know, decent Halloween business. And we're seeing the customers responding to Halloween.\n\nSo, all of those factors, our capabilities plus our read on the market, gives us confidence that we can see the consumer take care of what they need to take care of with their gift-giving needs this holiday season.\n\nBill Shea -- Chief Financial Officer\n\nAnd I think, Dan, you know, also, if you remember back to a year ago, you know, every media story was about the global supply chain challenges and that inventory may not be on the shelf, you know, for Christmas. So, we kind of, you know, force the consumer to buy, you know, to buy early. And we saw very strong, you know, October and November sales last year. And then, we saw it drop off, you know, in December.\n\nYou know, this year is just the opposite, you know, scenario. Everybody -- you know, it is a promotional environment out there, but everybody has inventory. And there's no talk of not -- of inventory not being on the shelf at Christmas time. So, the consumer can wait to try and get that best deal, but the consumer can wait and buy late.\n\nAnd that was the trend we saw, basically, you know, for years leading up to last year because of the global supply chain challenges that push it forward.\n\nDan Kurnos -- The Benchmark Company -- Analyst\n\nGot it. Yeah, that's helpful. I mean, hopefully the consumer doesn't wait until Q1 when they can get really great deals. But I think the other question is, Chris, you made -- I think I assume you guys are trying to highlight this.\n\nYou made a lot more positive commentary just around the margin trajectory in general and into the future. I think you guys got the message that that's sort of a concern. And you guys have given some good color around sort of the near-term or 12 month-plus trajectory, which is really helpful. I guess just to sort of nitpick on your comment or highlight your comment, Chris, just to say, getting back to, you know, historical margin levels, given everything that you're seeing in the market now, I mean, are we still aiming -- over time, it was sort of like 10% loss was kind of the goal.\n\nWith everything that you put in place and sort of getting a better handle on what you think happens with the labor market and everything else, is that still the target? Is there upside from some of the automation and sort of incremental efficiencies, say for -- you know, not to say that, you know, high single does anything to see that. Is that more a realistic target over, say, the medium term, just given everything that's going on the marketplace?\n\nChris McCann -- Chief Executive Officer\n\nSure. I think that -- you know, clearly, that is our objective. And I think I didn't think it as achievable as we look at, you know, some of the reductions in the, you know, starting with the gross margin. Right? Getting the gross margin back to where it needs to be as we're starting to see some of the input costs on shipping freight and, you know, commodities, etc., start to show some signs of recovery.\n\nCertainly, in the shipping environment, we're seeing that. In addition to that, as we look to continue to improve our operating efficiencies, that helps us get to the gross margin or to the net margin that we're looking to get to as well. So, I think we have all confidence that, you know, in time, we'll get back to the historical levels that we've been at.\n\nBill Shea -- Chief Financial Officer\n\nYeah, Dan, if you look at, you know, any year in the last 10 years, up until last year, you know, you would see our gross margins are, you know, in that 42%, you know, range. You know, last year, obviously, you know, we were down 500 basis points on it. But, you know, no matter -- we've bought and sold companies over the years, but we've always been pretty consistent with that gross margins and that, you know, that 42% range. So, again, over the longer term and, you know, the consumer is, you know, is a challenge in this macro environment.\n\nIt's, you know, certainly a challenge. But over the longer term, you know, we expect to get back to historical margin spend there. We can get the gross margins back up to those levels. There's no reason we can't get the EBITDA margins back up.\n\nDan Kurnos -- The Benchmark Company -- Analyst\n\nOK. I appreciate all the color, guys. Thanks very much. And again, best of luck, Joe.\n\nChris McCann -- Chief Executive Officer\n\nThank you, Dan.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Chris McCann for any closing remarks.\n\nChris McCann -- Chief Executive Officer\n\nSo, I'd just like to thank everyone for their time this morning. And clearly, as you see, our business is performing well, and we're well-positioned for the upcoming holiday season. Holiday season, you know, starts with Thanksgiving. And I urge all of you -- you know, giving is a gift.\n\nSo, I urge all of you to make sure you're taking care of and thanking the appropriate people in your life for this Thanksgiving season. And certainly, we know a few brands that can help you and a platform that can help you do that. So, thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAndy Milevoj -- Senior Vice President of Investor Relations\n\nChris McCann -- Chief Executive Officer\n\nBill Shea -- Chief Financial Officer\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nTom Hartnett -- President\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nDan Kurnos -- The Benchmark Company -- Analyst\n\nMore FLWS analysis\n\nAll earnings call transcripts"
}