{
  "companyName": "Alaska Air Group",
  "companyTicker": "ALK",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/20/alaska-air-group-alk-q3-2022-earnings-call-transcr/",
  "content": "Alaska Air Group (ALK 0.30%)\nQ3 2022 Earnings Call\nOct 20, 2022, 11:30 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen, and welcome to the Alaska Air Group 2022 third quarter earnings call. [Operator instructions] Today's call is being recorded and will be accessible for future playback at alaskaair.com. [Operator instructions]. I would now like to turn the call over to Alaska Air Group's vice president of finance, Emily Halverson.\n\nEmily Halverson -- Vice President, Finance\n\nThank you, operator, and good morning. Thank you for joining us for our third quarter 2022 earnings call. This morning, we issued our earnings release, which is available at investor.alaskaair.com. On today's call, you'll hear updates from Ben, Andrew, and Shane.\n\nSeveral others of our management team are also on the line to answer your questions during the Q&A portion of the call. This morning, Air Group reported third quarter GAAP net income of $40 million. Excluding special items and mark-to-market fuel hedge adjustments, Air Group reported adjusted net income of $325 million. As a reminder, our comments today will include forward-looking statements about future performance, which may differ materially from our actual results.\n\nInformation on risk factors that could affect our business can be found in our SEC filings. We'll also refer to certain non-GAAP financial measures such as adjusted earnings and unit costs, excluding fuel. And as usual, we have provided a reconciliation between the most directly comparable GAAP and non-GAAP measures in today's earnings release. Over to you, Ben.\n\nBen Minicucci -- Chief Operating Officer\n\nThanks, Emily, and good morning, everyone. Today, we released our third quarter results, closing out the busiest travel period since the pandemic began. Demand was resilient, planes were full, our people were busy and our results were strong. Our 15.6% pre-tax margin is likely to top the industry and came within two points of our 2019 margin despite the impact and the exceptionally high fuel prices and multiple new labor contracts.\n\nWe ran the best operation this summer, leading the industry with the No. 1 DOT on-time performance from June through September. Our $2.8 billion in revenue marked the highest quarterly revenue ever recorded in our history. Our unit revenue was up 27% versus 2019, which we also believe is best in the industry and underscores that our commercial initiatives are delivering.\n\nAnd last but not least, we ratified three major labor contracts becoming the first major airline to reach a deal with our mainline pilot group. Our leadership team have been very deliberate about our priorities this year and setting ourselves up for continued success. We are seeing results as we focus on moving rapidly to a single fleet, delivering operational excellence, securing labor contracts and configuring our business for profitable growth. Our financial results are strong and our underlying business model is resilient.\n\nTo put it simply, we are poised to continue to outperform and are excited about what the future holds. Now, let me give you a quick update on our top priorities. Our fleet transition is progressing well, and we are closing in on getting back to a single fleet. All A320 and Q400 aircraft will be out of the fleet by January of 2023, and the 10 A321 will follow by the end of 2023.\n\nToday, we have 35 MAX aircraft that are 25% more fuel efficient per seat than the smaller A320s they are replacing. We expect to have 78 MAX aircraft by end of next year, representing over 30% of our mainline fleet. As we focus on reconfiguring our business back to a single fleet, transition training for nearly 500 of our pilots will continue through May of next year. After which we expect to begin to ramp toward a $75 million single fleet savings we outlined at investor day.\n\nOur operation is also back on track. This summer, we returned to delivering a reliable operation with a completion rate over 99% each month of the quarter despite flying record high load factors throughout the summer. Horizon has also posted fantastic operating results with the No. 1 completion rate in the industry at 99.5%.\n\nAnd importantly, our guests have noticed with our guest satisfaction score improving and exceeding our target for the quarter. We locked in three major labor deals, a huge milestone for us that has been a primary focus of ours for several months. Following the ratification of a contract extension with IAM in September, we are excited to reach ratified deals with both our Horizon and Alaska pilots as well. Securing a new contract with our Horizon pilots provides us a strong foundation for our efforts in attracting, retaining and building a robust pilot pipeline.\n\nAlso Monday of this week, our Alaska mainline pilots represented by ALPA, ratified a new three-year agreement that recognizes that their contributions to our success and the market for pilots in the industry. We are excited for the stability and alignment. This brings our organization and will prioritize getting our upcoming labor agreements done as well. We have a lot to be positive about here at Air Group.\n\nWe are delivering on our goals and demand remains strong. We also realized there are challenges our industry is facing, including an uncertain economic backdrop, and a structural step-up in wages. Going forward, we are uniquely positioned to offset this pressure by leveraging initiatives we already have in place. One of the most impactful will be harnessing the structural efficiencies that come with our return to single fleet, a tailwind that will be unique to Alaska.\n\nThis includes increasing productivity as we eliminate cross-training events more efficient scheduling by moving to our preferential bank system for our mainline pilots and cost-effective growth through up-gauging. We are not immune to the challenges of the industry but remain committed to keeping our cost advantage relative to our competitors as we move forward. We are fortunate to be on solid footing as we look to finish out the year and build on our performance into 2023. Our priorities not only this year but throughout the pandemic have centered on preparing our airline for profitable growth, and we have taken strategic steps to bolster our competitive advantages.\n\nAs these initiatives continue to fully ramp up, they will support our results both in the near and long term. Near term, this is already evident in our unit revenue outperformance and the fact that we are still tracking to deliver a 6% to 9% full year adjusted pre-tax margin unchanged despite now including the impact from our new labor deal. And longer term, the foundational strength of our balance sheet, coupled with our commercial road map and commitment to operational excellence will continue to support strong financial performance. To close, I am excited to see all of our hard work begin to come to fruition and for the opportunity that we have ahead of us over the coming quarters and years.\n\nLastly, before I hand things over to Andrew, I want to thank all of our Air Group employees for a great summer and everything that they do. Running a safe, reliable operation is critical to our success on all fronts and serving our guests, connecting our communities and delivering on our financial performance and our success would not be possible without their tremendous effort and the care they continue to show day in and day out. And with that, I'll turn it over to Andrew.\n\nAndrew Harrison -- Executive Vice President, Chief Commercial Officer\n\nWell, thanks, Ben, and good morning, everyone. My comments today will focus primarily on our third quarter results, along with fourth quarter guidance. In the third quarter, we achieved our highest recorded revenue in our history $2.8 billion. This revenue performance, up 18% versus 2019 on 7% less capacity, resulted in very strong unit revenue performance.\n\nUnit revenues were up 27% versus 2019, a sequential improvement versus an already exceptional second quarter despite yields having peaked from the levels seen back in June and July. Load factors also remained strong, exceeding 2019 levels every month of the quarter and coming in at 86.5% for the full quarter. Our network and revenue teams did a fantastic job partnering together to maximize revenue performance, which was also fueled by revenues generated from the commercial teams initiatives. These factors, coupled with capacity constraints across the industry during a period of elevated demand has translated into a strong pricing environment.\n\nMoving to product categories. Our premium products continue to show strength as they have all year. First Class and Premium Class revenue were both up approximately 28% versus 2019. Paid load factors continue to exceed 2019 levels with first-class up four points and premium class up nine points, both on higher average fares.\n\nThe strong cash flow generation from our loyalty program has also continued throughout the year. Cash remuneration from the bank was up 37% versus the third quarter of 2019 and while total loyalty revenues finished the quarter up 34% year over three recently voted the No. 1 Best Airline Rewards Program by US News & World Report. We believe our credit card and our loyalty program offer exceptional value to our guests and a continued source of growth for our business.\n\nThese strong results were included in our product and loyalty initiatives this year. We are tracking ahead of plan and are set to recognize approximately $135 million in incremental revenue on our long-term goal of $195 million. This initiative is of the key reasons for our unit revenue outperformance. Turning to corporate travel trends.\n\nAfter taking a step up earlier this year, business travel volumes have remained around 75% to 80% recovered from 2019 levels, while revenue was approximately 10 points better than this given the yield environment. Notwithstanding a slower recovery of corporate demand across the West Coast, we believe our business recovery is in line with the majors, underscoring the improved business offering we have versus pre-COVID. Additionally, while some of our corporate partners have been slower to return to travel, we believe we are benefiting from employees at these companies taking more personal and hybrid travel as they move around and work remotely. I fully expect that we can restore 100% of business revenue.\n\nYear-to-date, we've improved our share gap from 2019 levels through our corporate distribution channels because of the increased opportunities we have from working with Amex, GBT and joint contracting with American. And finally, our One World and international partnerships have continued their positive momentum from what we shared last quarter, sustaining a high single-digit contribution to our total coupon revenue for the quarter. As we sit today, international and business travel have not fully recovered, which we believe only offers more revenue upside from these partnerships. It will take a few more quarters to get a more complete sense for the impact, but there is no doubt that the strength of these partnerships is real and that this is an accretive revenue source for our business going forward.\n\nLooking ahead to guidance for the fourth quarter, we expect total revenue to be up 12% to 15% on capacity that is down 7% to 10% versus 2019. By a wide margin, our go-forward capacity will be most constrained in the fourth quarter as we retire 45 aircraft across our mainline and regional fleet by the end of January and execute training events in preparation for 2023 growth starting in the first quarter. This guidance implies fourth quarter unit revenue performance of approximately 24% versus 2019. As we look to the fourth quarter, bookings remain healthy as guests continue to book holiday travel.\n\nAs has been the case throughout the summer, we are booking solidly ahead of 2019 load factors through the end of the year and are on track to fly a record load factor for the fourth quarter. We are currently holding yields at approximately 20% higher versus the Q4 of 2019. On the network side, we will continue to focus on deepening the spokes of our system as we fully restore our capacity to 2019 levels by spring and grow from there. As we look at our network, the competitive backdrop is still favorable as the West Coast remains the least recovered with competitive capacity down over 20% versus 2019.\n\nAs we move into 2023, we are looking forward to taking more MAX deliveries to up-gauge and grow efficiently in some of our strongest and capacity-constrained markets such as Seattle. And to wrap up, we remain in a remarkable demand environment, and we look forward to closing out a strong year of revenue performance. We've configured our business for incremental improvement and are already seeing the benefits from joining One World, our partnership with American and our new credit card deal. More importantly, the commercial drivers we have in place are poised to unlock in even greater way as we move into 2023.\n\nAnd I look forward to sharing more details during our year-end call. Our $400 million of commercial initiatives is proven and tangible, and we will continue to support our revenue performance over the coming quarters and years. And with that, I'll pass it over to Shane.\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nThanks, Andrew, and good morning, everyone. Our $325 million adjusted net profit this quarter reflects both the strong demand backdrop we are experiencing and the strength of Alaska's business model. We are encouraged by the return to operational stability and reliability this quarter, and we are also encouraged by the absence of the extreme COVID-related volatility that had challenged us for more than two years. Our results largely landed within previously guided ranges with no major disruptions causing significant and unanticipated revisions, which seems like a small thing, but it's actually quite refreshing.\n\nNot only did we deliver a very strong quarter operationally and financially. But as Ben mentioned, we ratified three key labor deals as well. Completing these deals is an important step in ensuring we have contracts that recognize the contributions of our people and also allow us to fully focus on running a great operation, taking care of guests and pursuing our growth and financial performance road maps. I'll briefly walk through highlights of our third quarter performance before discussing costs and labor contracts that are incorporated in our results and our fourth quarter guidance.\n\nOn the back of the continued strong demand environment, we generated $174 million in cash flow from operations during the third quarter, bringing our year-to-date operating cash flow to $1.4 billion. Total liquidity, inclusive of on-hand cash and undrawn lines of credit remains at a healthy $3.6 billion, providing us two times the cash we need to run our business and ample funds to pay for our Boeing aircraft deliveries over the next year. Our balance sheet remains strong with debt to cap at 49%. Debt payments during the quarter were approximately $100 million and remaining payments for the year are $50 million.\n\nAnd as you know, shareholder restrictions associated with our cares funding also officially rolled off at the end of September. With our strong operational and financial performance and solid balance sheet, we look forward to discussing potential shareholder returns with our board next month. Turning to costs, CASMex increased 19.3% in the third quarter versus 2019, 30 basis points above our guidance range. As a reminder, our practice is not to include new contract impacts in our guidance until ratified.\n\nOur new labor agreements added $35 million of cost that were not in our original guidance. And excluding these, our CASMex would have been up 16.8%, which would have been below the midpoint of our guidance range. Other transient cost drivers in the quarter include $30 million associated with issuing each of our employees 90,000 mileage plan miles in recognition of all of their extraordinary work during the pandemic and our 90th anniversary as an airline and approximately $15 million in costs associated with carrying higher staffing complements relative to our flying that we believe will need in the future. These two items represent a three-point impact to CASMex in the quarter.\n\nTurning to fourth quarter guidance and our longer-term thinking into 2023, let me begin by saying that our Q4 capacity remains artificially constrained as we focus on transition training our pilots to meet our deadline for retiring Q400s and A320s in January. We'll have both the added cost of these training events and have fewer pilots available to fly in revenue service during the quarter and into the first quarter of next year. We expect fourth quarter capacity to be down 7% to 10% versus 2019, approximately two points sequentially worse versus the third quarter, where we were down 6.7%. We still expect full year capacity to be down 8% to 9% versus 2019.\n\nOur absolute costs will increase from the third to fourth quarter, entirely driven by our new labor agreements and expected strong payouts for our performance-based pay program, as we continue to expect to meet a number of our strategic and financial goals, including being among the top margin producers for the full year. We expect CASMex to be up 20% to 23% in the quarter, approximately four points of this are structural costs related to our new labor agreements. Two points are related to anticipated strong PBP program payouts and lower capacity and higher staffing complements or an approximate four-point headwind during the quarter. Turning to fuel.\n\nWhile oil prices have moderated some over the quarter, they remain elevated and crack spreads continue to be both elevated and volatile. We expect fuel price per gallon to be $3.50 to $3.70 for the fourth quarter. Our hedging program is expected to provide a significant benefit this year of around $170 million. For the full year, we now expect CASMex to be up 19% to 20%.\n\nHowever, we are reiterating our full year adjusted pre-tax margin guide of 6% to 9%, and we continue to expect to close the year with a month of the top pre-tax results industrywide. Last quarter, we outlined that we were prioritizing securing labor deals and returning to a reliable operation above other considerations as those are foundational to the long-term success and financial performance of the company. They are also the foundation of being able to deliver higher levels of productivity and cost leverage going forward. Having solidified our operational reliability, our focus will now shift to leveraging growth in 2023 to reduce unit costs across Air Group.\n\nWhile there will be some continued productivity and capacity drag from fleet transitions in the first half of the year, our business plan for next year will include a return to our 2019 size during the first half of 2023 and will also include a reduction in unit costs year over year. While we won't share specifics on 2023 guidance until our Q4 call, we are very much looking forward to leveraging the benefits of single fleet at Alaskan Horizon, higher levels of aircraft utilization and the significant benefits of updating from A320s to 737-9s and ultimately, 737-10s. These are all consistent with the road map we shared at investor day back in March and along with our commercial road map that is already producing and has further upside from here, I believe we are well positioned for continued improvement in our business in 2023 and beyond. And with that, let's go to your questions.\n\nOperator\n\n[Operator instructions] And our first question comes from Mike Linenberg from Deutsche Bank. Please go ahead, Mike.\n\nMike Linenberg -- Deutsche Bank -- Analyst\n\nHey. Good morning, everyone. Can you kind of give us an update now that you have both of your pilot contracts done, and this is to you, Ben, what you have seen on the attrition side? Has it completely sort of done a $180 million? And where are you with respect to having an appropriate number of both check airmen and trainers. You did mention that there's going to be a lot of training as pilots move off of the Q400s and A320s, are you ready as we enter into the new year?\n\nBen Minicucci -- Chief Operating Officer\n\nHey, Mike. Good morning. Yes, what we're really pleased with both contracts on both the regional side and the mainline side. And these are really great deals for us on the attraction retention side of the business.\n\nIn terms of what we're seeing for attrition, it's a little early to tell, but early indications are, we are seeing some benefit on both the regional and mainline side. So I think this is really pivotal for us. It's going to really help us long term in terms of growth plans. In terms of Check Airmen, in terms of the training output, we have -- we've seen a lot of improvement since the spring.\n\nWe're producing about 65 pilots out of the schoolhouse a month with the goal being 100. We're increasing the number of check garment to help us improve that throughput, but we are on track right now to deliver our pilots, the pilots we need per month on both the regional and the mainline side, and we're pretty confident on executing that plan going forward. Anything, Joe, you want to add, or?  Mike, you can go ahead if you have a follow-up.\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nYeah, do you have a follow-up, Mike?\n\nOperator\n\nI'm sorry, Mike. We took them out. We thought he was done. Mike, if you wanted to ask another question queue up again.\n\nIn the meantime, our next question comes from Duane Pfennigwerth from Evercore ISI. Please go ahead, Duane.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nHey. Thanks a lot. Appreciate it. There was a lot in there in terms of guidance points.\n\nCan you just refresh us on what you said about the first half and kind of the rate of capacity recovery in the first half? Is it sort of comprehensively a first half back to 100%? Or is that something like you'd hit in 2Q?\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nYeah. Thanks, Duane. I think it's likely to be sort of in the middle of the first half of the year. I'm not -- we're still finalizing our Jan Feb plans.\n\nBut we'll be back to 2019 size confidently sometime in the latter half of first quarter or early second quarter. With the transition training, it will be a little bit sort of choppy in terms of how the capacity comes back online. But we're excited to get there, and we've got a lot of aircraft coming in the first half of the year that can then take us ultimately above the 2019 size, and we feel like there's demand for it through the second half of the year. Thanks, Shane.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nAnd on that delivery stream, can you just walk us through what you expect next year and your line of sight or confidence on those deliveries just given the environment? Appreciate you taking the question.\n\nNate Pieper -- Senior Vice President, Fleet, Finance and Alliances, and Treasurer\n\nHey, Duane. It's Nate Pieper. We've got 35 MAX airplanes now. And we think by the end of next year, we're projecting to have 78, Boeing obviously is five miles down the road, and we meet with them weekly to understand delivery constraints, etc., we're confident that they're going to deliver and give us the airplane capacity we need to hit our targets.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nThank you.\n\nBen Minicucci -- Chief Operating Officer\n\nThanks, Nate.\n\nOperator\n\nOur next question comes from Savi Syth from Raymond James. Please go ahead, Savi.\n\nSavi Syth -- Raymond James -- Analyst\n\nHey. Good morning. Thanks. Just a follow-up on some of the pilot training and cost and the elevated staffing costs.\n\nJust how much of a drag is that still in 1Q? I'm guessing the pilot training costs will kind of drop off after kind of the 1Q or early 2Q. I'm just kind of curious how much of -- what size of a drop-off there will be? And then kind of the elevated staffing, when do you see that moderating back to kind of historical levels?\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nYeah. Hey, thanks, Savi. Good morning. It's about -- just to put context around it.\n\nFor Q4, the overstaffing and transition training is about one and a half points of our Q4 year-over-year CASM or year over three CASM guide. It's likely to be similar-ish in Q1, and then it will start to taper and be completely gone by the end of Q2.\n\nSavi Syth -- Raymond James -- Analyst\n\nBoth costs will be gone?\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nCorrect. Correct. Yes.\n\nSavi Syth -- Raymond James -- Analyst\n\nOK. Got it. And then, just a follow-up with the -- on the Boeing deliveries and things of that. Just any kind of revised thoughts on capex? I know the capex came down a little bit here in 2022 can view on 2023, '24 capex and the financing of that.\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nYeah. I'll have Emily sort of update. One thing I would just say, and it's intuitive, and I know you're hearing it from everybody, but not only on aircraft, on every capital item we're buying things are shifting to the right. I think supply chains everywhere are elongated still.\n\nNew SIMs are taking a little bit longer. GSE equipment is taking longer. So things what we plan to buy. It just seems like they're taking longer to get in right now, but Emily can give you some more on the totals.\n\nEmily Halverson -- Vice President, Finance\n\nYeah. I think Shane covered it pretty well. You saw that our guide for 2022 came down about $100 million. You should expect most of that to shift into 2023.\n\nAnd when we give our full year 2023 guide, we'll refresh you guys from the numbers we gave you at investor day, which we had originally said was around $2 billion for 2023. So I expect that to go up a little bit.\n\nSavi Syth -- Raymond James -- Analyst\n\nAnd is the financing, Emily, is that debt or cash or any thoughts on the financing side?\n\nNate Pieper -- Senior Vice President, Fleet, Finance and Alliances, and Treasurer\n\nSavi, it's Nat. It will all be cash. We still continue to hold more than two times the amount of liquidity we need to run the airline. So best thing we can possibly do is pay cash for airplanes.\n\nSavi Syth -- Raymond James -- Analyst\n\nMakes sense. All right. Thank you.\n\nNate Pieper -- Senior Vice President, Fleet, Finance and Alliances, and Treasurer\n\nThanks, Savi.\n\nOperator\n\nOur next question comes from Andrew Didora from Bank of America. Please go ahead, Andrew.\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nHey. Good morning, everyone. Shane, a lot to unpack on the CASM front in 4Q and for the year. Just stepping back when we think of 2022 CASM up 19% versus 2019.\n\nCan you kind of break out for us of that up '19? Like what are the kind of the onetime items that you feel like will not repeat as we move into 2023? And how much of your CASM this year is just from not having your network fully restored? Just trying to get a good run rate potential for 2023 unit costs.\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nYeah. No, I appreciate the question, Andrew. No. 1, I just want to remind folks that in terms of the updated cost guide, the only thing that's changed for full year for us is the new labor deals.\n\nEverything else is tracking exactly as we expected it to. And then, Andrew, you hit on it, the biggest drag to CASM or headwind for us this year is not producing the ASMs that we had wanted to originally. We made a very deliberate -- obviously, in Q1, we were all impacted by COVID waves and the entire industry had to take capacity out. We had a big snowstorm here in Seattle that drug into January.\n\n. But we made a deliberate decision to pull down the schedule by six, seven, eight points during the summer and to hold it lower during Q4, as well as we prioritize operational stability and now that we're stable, we've got terrific completion rates. We've got great on-time performance. We feel really good about our staffing complement levels and our ability to fill new classes across every role in the company. We're ready to get much more growth-minded and begin to leverage sort of the goodness that comes with growing and getting back to productivity next year.\n\nAs one data point, I think we're still 10 points below our historical norm for productivity. I don't know that we'll get all of that back next year, but we're going to make a big sort of -- we'll get a big chunk of that back coming next year. So that's really the biggest thing. Everything else -- the only structural real change is the labor deals.\n\nI think we're unique right now, having been the first to get the mainline pilot deal done. I suspect we won't be unique for very long. And so, that is something that the entire industry will ultimately have to do. And on a relative basis, we'll be in a really good position versus everybody as we have been historically.\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And just a second question for Ben or Andrew. I think look, having the scale that you have in your hubs in the Pacific Northwest, you really, I think, really solid driver of your overall margin performance. I know you'll never get to the share in LAX or SFO that you have in Seattle and Portland.\n\nBut, I guess, how long do you think it will take to build out those geographies as I think -- as you build up there, your margin should see a tailwind as you scale up there over time. Any thoughts on kind of the time frame of those California markets?\n\nAndrew Harrison -- Executive Vice President, Chief Commercial Officer\n\nYeah. Thanks, Andrew. I think how I would answer that is that as we move into next year and we give better guidance on our growth, we are returning more growth back to California. I think we feel really good about where we are, the markets we serve.\n\nAnd as we've shared all along, it's about frequency and depths of those markets. It's about unlocking global connections with both our OneWorld partners and with American. And I think we have a head of California Neil Thwaites down there. I meet with him every month.\n\nAnd I'm really excited about the focus and the discipline that we have down there where traditionally as the Pacific Northwest Company, we focus a lot up here. So overall, I don't think you're going to see a material change overall in the scheme of things. But what we do, do down there, I fully expect to get better and stronger over the next few years.\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nBen Minicucci -- Chief Operating Officer\n\nThanks, Andrew.\n\nOperator\n\nOur next question comes from Dan McKenzie from Seaport Global. Please go ahead, Dan.\n\nDan McKenzie -- Seaport Global Securities -- Analyst\n\nHey. Good morning. Thanks, guys. Shane, 2023 capacity is choppy as it comes back online, just going back to, I think, an earlier comment, does that tie to a choppy earnings recovery from here? And I guess related to this, we are seeing some of your peers lay out pretty big earnings goals in 2023.\n\nAnd setting aside the 11% to 13% pre-tax margin goal, what's your conviction that you can at least improve on your 2022 pre-tax margin as we move into next year?\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nYeah. Thanks, Dan. I don't think it portends a choppy earnings recovery. A lot of the sort of choppiness will be the base comp, like on a year-over-year basis, we've just had so much unexpected schedule pull down this year.\n\nAnd by the way, next year, we're going to comp to 2022. And so, I think it will be fine. I don't think the earnings trajectory necessarily will follow the return of capacity trajectory, really confident we can improve our margins next year. Really strong demand backdrop.\n\nI think the commercial team is doing a really good job of participating in that backdrop and currently outperforming the industry. And then, we've got a lot of things that we need to go do on the cost side to take advantage of the strategic decisions we made around single fleet and getting back to historical norms on productivity. And so, I think if the -- absent a major economic pullback, I think we feel really good about our ability to get improved margins next year.\n\nDan McKenzie -- Seaport Global Securities -- Analyst\n\nTerrific. Andrew, second question here. I guess, turning to you, $400 million in revenue initiatives outlined at the investor day, so loyalty network alliances, fleet up-gauging. What percent of the revenue from -- what is the percent of revenue from premium products today, say, versus discounted leisure And how can we think about that premium revenue target as we move into 2023, given the fleet transformation?\n\nAndrew Harrison -- Executive Vice President, Chief Commercial Officer\n\nYeah. I think off the top of my head, I think both premium and first all-in coupon and upsells are $1 billion-plus businesses each just to give you a rough size of magnitude. I think our challenge is always, given the strong demand, we believe and we continue to believe the importance of taking care of our leads and upgrades. But we're also recognizing there is opportunity to continue to get more out of our premium products.\n\nWe're opening up new distribution channels. And most importantly, as we up-gauge our fleet and we get 25-plus percent increase in first-class seats, from the transition, we still see significant upsides. We're looking at some other things, which I won't go into today. But overall, my expectation is we continue to show good things in the premium product space.\n\nDan McKenzie -- Seaport Global Securities -- Analyst\n\nThanks for the time you guys.\n\nAndrew Harrison -- Executive Vice President, Chief Commercial Officer\n\nThanks, Dan.\n\nOperator\n\nOur next question comes from Scott Group from Wolfe Research. Please go ahead, Scott.\n\nScott Group -- Wolfe Research -- Analyst\n\nHey, thanks. Good afternoon, I guess, now. Can you just clarify the -- do we have the full impact of these -- of the pilot deal in Q4 costs? Or is it from the date of ratification? And then I just -- you made a comment that the only change is with CASM is this new pilot deal. But I thought you said it's -- there's a four-point headwind from the pilot deal in the fourth quarter, but the full year CASM guidance coming up three points.\n\nSo it feels like it's more than just labor. Maybe just -- I'm not sure I'm following.\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nYeah, sure. Thanks, Scott. Yeah, and I would say labor deals, not just the mainline pilot deal is what we've been sort of speaking to. Those are fully baked into the fourth quarter ratably -- so that four-point headwind is the structural sort of number that we're going to go forward with at this point.\n\nNo, I think in terms of the full year CASMex guide, the real change between prior guidance and current guidance is the labor deals being incorporated. As you know, we don't guide to labor deals as we're negotiating. And so, we closed three this quarter. And that's what we had to bring through our full year CASMex guide.\n\nThere was one other category that went up a bit, and it is our performance-based pay. Because we do expect to be on the better end of many of our financial targets that we took a larger as well.\n\nScott Group -- Wolfe Research -- Analyst\n\nAnd then so when we think about next year, we'll have, I guess, the more quarters of labor will have capacity up, which should help maybe some of the inefficient go away. When you add it all up, would you think that CASM x is up or down '23 versus '22?\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nYeah. No, it will be down. As I said in my script, our business plan will be to have a reduction in CASMex in '23 versus '22?\n\nScott Group -- Wolfe Research -- Analyst\n\nOK, great. Thank you, guys.\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nThanks, Scott.\n\nOperator\n\nOur next question comes from Jamie Baker from J.P. Morgan. Please go ahead, Jamie.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nHey. Good morning. So Shane, following up on that last question, the pilot impact in the fourth quarter. So there's a look back to September 1 on wages and then the $33,000 and $22,000 bonuses for Captain and first officers, respectively.\n\nSo that's in the guide. You're not going to take that as a one-timer in the fourth quarter. Is that correct?\n\nNate Pieper -- Senior Vice President, Fleet, Finance and Alliances, and Treasurer\n\nSo the look back to September 1 is in the third quarter result that was recorded through the P&L the ratification bonus sort of lump sum payments, those were special in the quarter as well, not they're in the adjusted -- they're not in the adjusted number.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nYeah. OK, got it. So the fourth quarter guide is clean of that. And then, second, and it's a question on preferential bidding system.\n\nAnd I really hate asking stupid questions. But here we go. Why does it take until April of 2024 to go live? I mean, isn't it just like Software?\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nYeah. Yeah. And it may be before that. So that your exhaustive reader of our agreement, Jamie.\n\nThat is the outside drop dead date. We have to go live by that. We have to negotiate a time line and just agree with our union counterparts, what the last day we would go live. Our hope is to do it much sooner.\n\nI know, Ben, would like to do it much sooner. There's only -- the real drivers, there's only a couple of providers for these systems and they have other demand on them as well, so you have to get in line. And then, Jamie, you just try to avoid the peak season. So there's only a handful of months in a year that you actually want to go live.\n\nYou don't want to be doing it in December, you don't want it to be doing it in peak summer. So that's why these end up taking a little bit longer than everybody would suspect they should.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nOK. I haven't thought about the peak season aspect. Do you expect -- final question, apologies. When it does go live, do you think it's something we would be able to identify on a -- well on a margin basis.\n\nBut on an ex fuel CASM basis, I'm sure it matters to you guys, and I'm sure that was a win. I'm just wondering if it rises to the level of materiality for those of us modeling the company.\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nYeah. I think it's something you'll probably have to ask a detailed question of us to give specific number when we get there, but it's not going to be inconsequential and I'm sure you'll hear us at least speak to the benefit of it once it's live, and we're starting to see the benefit. It really cleans up the transitions month-to-month and sort of the conflict drops, as you know. And that can be a significant benefit, both for pilots and for the company on a productivity basis.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nOK. I appreciate it. Thank you very much, everybody.\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nThanks, Jamie.\n\nOperator\n\nOur next question comes from Brandon Oglenski from Barclays. Please go ahead, Brandon.\n\nBrandon Oglenski -- Barclays -- Analyst\n\nHey. Good afternoon and good morning, everyone. Thanks for the question. Can we go back to your analyst meeting targets.\n\nYou said pre-tax margin, 11% to 13% long-term and above industry peers. Can you guys just remind us, I'm assuming that inflation is coming in a little bit higher than that. So assuming it's still relevant, what are some of the favorable commercial offsets that you guys are envisioning here?\n\nAndrew Harrison -- Executive Vice President, Chief Commercial Officer\n\nYeah. I think as we've talked about all along on the $400 million, of course, inflation has its impact certainly on credit cards, for instance, I mean, we get paid for every swipe, and those swipes are up 7% just inflation alone, give or take. I think what I would say, commercially and Shane and been a hit on it, is what I'm most excited about is that as we worked really hard to reconfigure this business, airplanes, labor that we're going to set ourselves up next year to really operate this airline like a Swiss watch. And I can tell you the revenue goodness that comes from that, the efficiencies that come from that and all the good things that come from that versus what we struggled with this year is really going to come into being.\n\nWe're going to give you an update on as we continue to look at our initiatives, but overall, I think outside of that, operating this airline efficiently is going to be huge.\n\nBrandon Oglenski -- Barclays -- Analyst\n\nOK. I appreciate that, Andrew. And I guess along those lines, you guys did talk about earning above your cost of capital. Obviously, that has moved higher this year.\n\nHow do you think about the long-term growth of the business been? Is it right to still target 4% to 8%, especially with the higher cost base and higher cost capital as well?\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nYeah. Ben can jump in on this. I think, Brandon, we're sort of fortunate I think the equity valuation we'll have to see over time what the cost of equity is. On the debt side, we still have a very, very low cost of capital.\n\nAnd because of our cash position, we don't need to access capital markets anytime soon. So I think on the debt side, we feel incredibly sound in terms of the ability to finance ourselves going forward. You know our balance sheet story if anybody should and can be investing, it's us. And I think there's still a lot of like demand that we feel like we could be taking in our core markets that are highly accretive in terms of returns above cost of capital, but Ben can speak to the longer-term sort of plan.\n\nBen Minicucci -- Chief Operating Officer\n\nYeah. I think our long-term plan is still to grow until 2025. We have a great order book from Boeing, which we plan to execute. So I think exactly what Shane said.\n\nI think we're on track for that and feel good about the long-term growth.\n\nBrandon Oglenski -- Barclays -- Analyst\n\nThanks, guys.\n\nOperator\n\nOur next question comes from Conor Cunningham from Melius Research. Please go ahead, Conor.\n\nConor Cunningham -- Melius Research -- Analyst\n\nHey, everyone. Thank you. Just in 2Q, you talked a fair bit about the alliance initiatives and I don't think I heard much about that this quarter. And I would just assume that from Oneworld in particular, you would see a huge benefit given like international is coming back in a major way.\n\nSo if you could just kind of update us where you're at with that.\n\nNate Pieper -- Senior Vice President, Fleet, Finance and Alliances, and Treasurer\n\nConor, thanks for the question. It's Nath Pieper. I think -- you go back to why Alaska joined Oneworld and why we were so eager to do that. And sure, it's to participate in international flows and be able to offer our guests the ability to carry their loyalty benefits, carry their status in our mileage program and get any place on the globe that they wanted to go, either on our airplanes or on somebody else's.\n\nAnd so, as international traffic has come back, Europe, especially we're seeing real tangible benefits from that. Year over year, we're up 40% from a contribution perspective from these partnerships. And I think the second benefit to it, which is harder to see in the P&L is really keeping our most important guests within the Alaska family, whether it's on our airplanes domestically or it's using their Oneworld partners that have their loyalty status, we're not losing those passengers, our most important guests, to our critical competitors here in the Pacific Northwest anymore because we've got a global network that we can sell and market as our own.\n\nConor Cunningham -- Melius Research -- Analyst\n\nGreat. And then, just on the cost structure, I mean a lot of noise going on. I'm not trying to get the labor stuff. But when I think about Alaska historically, it's always about really highly productive employees.\n\nThe world is different now. The productivity has probably changed in the last. So I'm just curious on how you get back to high productivity levels that you had historically. Like to me, is it really just a function of capacity? Or is there something else at play there?\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nYeah. Connor, thanks. A couple of things that I think were unique to COVID and transient and time will tell us if there's a new normal or not. But one as we were reramping, we were having to hire larger volumes than we've ever had and get those folks through training, that is all a sort of relative drag to our normal staffing posture.\n\nAnd then, we had incredibly high attrition, which every airline has seen and every industry has really seen. And so, those two things, I think, stabilize over time for the economy and for us, we're in a much more stable place today. And I think you go back to the sort of more normalized training, a complement in terms of overall staffing as we get through 2023 and beyond. And then, as I had mentioned sort of in my script, we carried -- we didn't reduce our staffing levels at all even though we took six or seven or eight points out of the system for the second half of the year.\n\nSo we've got the people we need to do a lot of this growth next year. There's still a lot of hiring that has to happen because of attrition -- but we're in a really good place. Whereas last year, we were trying to hire just in time to meet the new capacity. And then, we get hit with the COVID wave and people would be sick and absent and we couldn't operate.\n\nAnd so, we, like others in the industry have totally done a 180 on that. We're now carrying more people than we need and it's time to go get the growth in the ASMs and the air and enjoy the productivity benefit from that. I don't know if we'll get back to pre-2019 productivity. I don't know if there's like a new normal of absenteeism, but we're going to be much better than we are today as we get into next year and beyond.\n\nBen Minicucci -- Chief Operating Officer\n\nBut I just want to add, Conor, like this company has a low-cost mindset. We're building budgets now that we're going to build productivity targets into the budgets. And we just -- we're setting the company up for 2023. I mean the labor deals -- we got five labor deals done this year.\n\nWe're getting the single fleet done and behind us where there's a capacity drag on us. But heading into 2023, this company is going to go back to where we were in terms of this low cost, high productivity, low overhead mindset.\n\nConor Cunningham -- Melius Research -- Analyst\n\nAppreciate it. Thank you.\n\nBen Minicucci -- Chief Operating Officer\n\nThanks, Conor.\n\nOperator\n\nOur next question comes from Helane Becker from Cowen & Company. Please go ahead, Helane.\n\nHelane Becker -- Cowen and Company -- Analyst\n\nThanks very much, Operator. Hi everybody. So as you think about the record revenue that you're reporting and your guidance for the fourth quarter and maybe how you're thinking about 23%. How are you thinking about where revenue can go over the next few years? Like do you have a new target for where you think you can see that number.\n\nAndrew Harrison -- Executive Vice President, Chief Commercial Officer\n\nYeah, Helane, I think I've said on previous calls, I think we can learn a lot about revenue as much as we thought we did. We learned a lot more during COVID. And I think my team specifically I think just the way our network and RM team works together is at a different place. I think on the corporate side, we're in a different place.\n\nI think, on the alliances and partnerships. We're in a different place. We're working a lot on the distribution. And again, we are very, very focused on initiatives and generating more revenue I think our natural, we're going to be a growth airline.\n\nThat's what we do, and we're going to be well positioned to do that, both on the capacity side, but I still believe -- as I personally look at all of this, that there is upside on our products, our types of products and especially, I don't think we fully untapped the loyalty and the card growth. And I think there's a lot of goodness there. So all these things we know going forward that there will be a step change in costs on an absolute basis, mostly because of labor, and we're going to go get that on the revenue side.\n\nBen Minicucci -- Chief Operating Officer\n\nAnd Helane, what I'll add is, regardless of what the revenue environment does, and I do think it will change for the better. We still need to focus on what we've done so well for two decades is a highly efficient, low-cost operation highly productive. Those things benefit you in a good revenue environment or a not-so-good revenue environment. So those are things that we're getting back to and Andrew, of course, everything Andy said makes sense.\n\nSo...\n\nHelane Becker -- Cowen and Company -- Analyst\n\nOK. That's --\n\nBen Minicucci -- Chief Operating Officer\n\nOh, you have another question?\n\nHelane Becker -- Cowen and Company -- Analyst\n\nNo, I'm good. Thank you.\n\nBen Minicucci -- Chief Operating Officer\n\nOK. Thanks, Helane.\n\nOperator\n\nAnd our last question comes from Chris Stathoulopoulos from Susquehanna Financial Group. Please go ahead, Chris.\n\nChris Stathoulopoulos -- Susquehanna International Group -- Analyst\n\nGood afternoon. Thanks for taking my question.  So I just want to -- the 6% to 9% pre-tax margin guide with the new pilot contract or these three new deals. So could you help us square that versus the moving pieces of the four to eight ASM guide? And also, any -- it sounds like you're fairly confident around the order book. But if there are delays, how does that change the mix that you outlined last year on the 70% frequencies, 5% stage? Or perhaps more importantly, the 10% new markets.\n\nAre you just planning right now with these new deals at 6% to 9% for some level of sustained momentum in yields or the benefit of the operating leverage you referenced as your utilization returns in the first half of next year?\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nYeah. Thanks Chris. I'd make sure I try to answer each of those. On the delivery stream.\n\nI'll tell you when we do give you guys guidance on capacity for next year, it will be appropriately buffered for what Boeing believes they can deliver versus what we may plan for them to deliver. And so, we'll build upside in if they actually hit the delivery dates they're telling us, that would be a benefit to us and would give us the ability to add some incremental ASMs. We're not going to overstress the system and assume every delivery comes on the exact day, even though we know that they're trying hard to do that. So we'll be really confident in our ability to operate the schedule that we tell you guys we're going to next year.\n\nI think it's both. I think primarily, we look to get the cost structure moving in the right direction, get costs going back down, which will be a big sort of tailwind to margin. And yes, I think right now, we do expect the revenue environment to be different than pre-COVID for a period of time. I think, structurally, there's relative to the size of GDP or demand, I think supply continues to be constrained and our teams continue to do a good job understanding the revenue environment and getting appropriate yields and pricing in it.\n\nSo I think both are going to help drive us. But really, we were sort of talking to you guys at investor day prior to a lot of this inflation stuff coming in. And we knew that labor was going to reset. We knew where we were in the market.\n\nWe had a sense of where it was going. And when we laid out our long term targets, we specifically put together a strategy on both the cost and the commercial side to make sure we could get into those ranges long term. So nothing has changed for us from that perspective. We're going to deliver what we told you guys at investor day and get to these margin targets.\n\nChris Stathoulopoulos -- Susquehanna International Group -- Analyst\n\nOK. And just a follow-up here. The four points on the structural labor side, is that just the base rate piece. I think you said that the ratification bonus and look back for September in 3Q and then Part b, should we assume that we would see elevated PBP accruals into -- or for full year 2023.\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nYeah. The four points represents all the labor deals we've done to date. And just as a reminder, in 3Q, the wage rate increase back to September 1 for our mainline pilot deal is in opex, the sort of lump sum bonuses in special. What was the second part of the question? Too soon to tell.\n\nI mean I think we have a strong commitment to being one of the best margin producers in the industry, and we believe if we do that, our employees should benefit through the PBP -- PBP program. We do think it drives a lot of alignment. I think that's been proven out over a number of years, and it's appropriate to recognize folks when they're working hard and achieving. But the board sets those goals, they do that and sort of as we get through the end of the year, so it's too early to know where we'll come out on that for next year.\n\nMy strong inclination is the goals will be a little tougher next year than they were this year, and we'll have to work harder to get to them.\n\nEmily Halverson -- Vice President, Finance\n\nThank you, everyone. That marks the end of our third quarter earnings call.\n\nBen Minicucci -- Chief Operating Officer\n\nThanks, everybody.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEmily Halverson -- Vice President, Finance\n\nBen Minicucci -- Chief Operating Officer\n\nAndrew Harrison -- Executive Vice President, Chief Commercial Officer\n\nShane Tackett -- Chief Financial Officer and Executive Vice President, Finance\n\nMike Linenberg -- Deutsche Bank -- Analyst\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nNate Pieper -- Senior Vice President, Fleet, Finance and Alliances, and Treasurer\n\nSavi Syth -- Raymond James -- Analyst\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nDan McKenzie -- Seaport Global Securities -- Analyst\n\nScott Group -- Wolfe Research -- Analyst\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nBrandon Oglenski -- Barclays -- Analyst\n\nConor Cunningham -- Melius Research -- Analyst\n\nHelane Becker -- Cowen and Company -- Analyst\n\nChris Stathoulopoulos -- Susquehanna International Group -- Analyst\n\nMore ALK analysis\n\nAll earnings call transcripts"
}