{
  "companyName": "Hawaiian Holdings",
  "companyTicker": "HA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/hawaiian-holdings-ha-q3-2022-earnings-call-transcr/",
  "content": "Hawaiian Holdings (HA 1.99%)\nQ3 2022 Earnings Call\nOct 25, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to Hawaiian Holdings third quarter 2022 financial results earnings call. At this time, all participants are in a listen-only mode. A brief question-and-answer session will follow the formal presentation [Operator instructions]. As a reminder, this conference is being recorded.\n\nIt is now my pleasure to introduce your host, Marcy, managing director of investor relations. Thank you. You may begin.\n\nUnknown speaker\n\nThank you, Maria. Hello, everyone and welcome to Hawaiian Holdings third quarter 2022 results conference call. Here with me in Honolulu are Peter Ingram, president and chief executive officer; Brent Overbeek, chief revenue officer; and Shannon Okinaka, chief financial officer. We also have several other members of our management team in attendance for the Q&A.\n\nPeter will provide an overview of our performance, Brent will discuss revenue and Shannon will discuss cost and the balance sheet. At the end of the prepared remarks, we will open the call up for questions. By now, everyone should have access to the press release that went out at about 4 o'clock Eastern Time today. If you have not received the release, it is available on the investor relations page of our website, hawaiianairlines.com.\n\nDuring our call today, we will refer at times to adjusted or non-GAAP numbers and metrics. A detailed reconciliation of GAAP to non-GAAP numbers and metrics can be found at the end of today's press release posted on the investor relations page of our website. As a reminder, the following prepared remarks contain forward-looking statements, including statements about our future plans and potential future financial and operating performance. Management may also make additional forward-looking statements in response to your questions.\n\nThese statements are subject to risks and uncertainties, and do not guarantee future performance and therefore, undue reliance should not be placed upon them. We refer you to Hawaiian Holdings' recent filings with the SEC for a more detailed discussion of the factors that could cause actual results to differ materially from those projected in any forward-looking statements. These include our most recent annual report filed on Form 10-K, as well as subsequent reports filed on Forms 10-Q and 8-K. I will now turn the call over to Peter.\n\nPeter Ingram -- President and Chief Executive Officer\n\nHello Marcy, and welcome to the team. Hello, everyone and thank you for joining us today. Demand for travel to, from and within Hawaii remains strong. Leisure travel has led the global recovery and I expect this to continue.\n\nI know the markets are focused on an uncertain economic outlook but demand across our network is showing no signs of weakness as consumers continue to place a high priority on leisure travel. Operationally, we had a solid summer relative to some of the challenges elsewhere in the industry. But relative to our own high standards, we are not yet where we want to be. On the positive side, our completion rate from Memorial Day to Labor Day was 99.9%.\n\nOn time performance was under a bit more pressure however, exacerbated by some changes to air traffic arrival protocols here in Honolulu and more recently runway construction work that is pressuring the on time performance of our Neighbor Island flights. These factors have dampened our operational performance in October but our ops team is working hard to overcome these challenges. Demand for travel between Hawaii and the US Mainland has been fully recovered for some time, and the peak summer period did not disappoint at all. Brent will take you through the details later in the call.\n\nOutside of Japan, we have also seen a strong recovery on our international routes, overcoming the strength of the US dollar and demonstrating that the robust desire for leisure travel is not a uniquely American phenomenon. Sydney, in particular, has seen notable demand strength. While Japan demand is not all the way back, we have seen some positive and important developments in recent weeks. Specifically on October 11th, Japan removed most of the pandemic travel restrictions, which have artificially suppressed demand, including most importantly, testing requirements for international arrivals and the hard cap on the number of international arriving passengers.\n\nWe anticipate a solid recovery in Japan Hawaii travel in the coming months. But mindful of the cautious nature of the Japanese public and the continuing weakness of the Japanese yen relative to the US dollar, we are choosing to add capacity back gradually. Brent will take you through the details of our scheduled recovery plans and what we are seeing in terms of demand recovery since the removal of travel restrictions has been announced. Let me now turn to developments across our Neighbor Island network.\n\nAs a reminder, prior to the pandemic, our Neighbor Island routes accounted for a little over 20% of our passenger revenue. A substantial contribution albeit is smaller than our North American international flying. But the percentage revenue contribution from these routes understates their importance to our business. The origin of our company, almost 93 years ago, was flying between the islands of Hawaii, and we have been the primary provider of inter-island transportation ever since.\n\nIn addition to serving as the inter-island highway system for the state, these operations provide essential connection capacity for our long haul flights, enabling our North America and international operations to function at the scale we provide despite limited connecting capacity outside of Hawaii. Over the past nine decades, we have absorbed competitive challenges on various fronts and throughout we have prevailed in large part due to our singular focus on serving the needs of Hawaii travelers better than any competitor. During the third quarter, our most recent competitor added capacity and initiated unusually aggressive pricing, promising to have last seat availability of $39 fares through the end of the year. These $39 fares include federal taxes, which means that the company receives $26.05 from each ticket sold.\n\nThese fares, even if 100% of seats are occupied, did not cover the cost of operations. I'll defer from speculating on the strategic logic of this initiative, because ultimately, this is irrelevant. What is relevant to us is how we respond and compete. Let me lay out some fundamental facts.\n\nOur cost structure on Neighbor Island routes is similar to Southwest. We operate smaller 128 seat Boeing 717 aircrafts that are uniquely well suited to short haul operations. Southwest operates larger 175 seat 737 MAX 8 aircraft designed to serve longer stage lengths. Based on our analysis, Southwest has a small cost advantage on a per seat basis due to the larger aircraft size.\n\nOn a per operation basis, our costs are measurably lower. When comparing revenue production, the results are not even close. During the second quarter, based on the latest available DOT statistics, we generated a revenue premium of 129% over our competitor on a per available seat mile basis. Our passenger revenue per operation, even with aircraft that have 27% fewer seats, was 73% higher.\n\nPart of this revenue premium is derived from sources of revenue that are available to Hawaiian, but that our competitor cannot access. Connecting revenue from our long haul network provides RASM accretive traffic to our Neighbor Island flights. Codeshare and interline revenue from other North America and international airlines are available to us, but not our competitor. We have a premium cabin.\n\nWe have extra comfort seats. $39 main cabin fares cannot close this gap. Confronted with these facts, and in light of the importance of our Neighbor Island operations to other parts of the network, the answer to how we're going to respond is simple. We're going to stand our ground and compete, and we are going to compete aggressively.\n\nWe have made $39 fares available on our Neighbor Island flights through the remainder of the year. Not every seat on every flight, but these fares are broadly available. HawaiianMiles members will receive double miles on Neighbor Island flights through the end of the year to reward our loyal customers. Our HawaiianMiles credit card holders now receive two bags free on every flight.\n\nWe are adding flights to meet the demand for travel. I'm going to be asked to speculate on how the current situation evolves in the months ahead. The simple answer is that I do not know. What I do know is that the appropriate response to this challenge is to compete.\n\nSo we will lean in. For so long as these deeply discounted fares persist, we will see lower returns from our Neighbor Island routes. Exactly how long this will last is difficult to predict at this time. But for now, it will be a headwind to the recovery of our bottom line.\n\nShifting gears, let me touch on last week's announcement of our agreement with Amazon. If you didn't hear our investor call last Friday, the recording is available on the investor relations page of our website. Our team is excited by the opportunity that this new initiative will provide to further diversify our revenue and add a new avenue for growth in the coming years. Work is well underway to prepare for our first A330-300 freighter in the second half of 2023.\n\nMore than ever we are operating in a dynamic environment. As we put the pandemic in the rearview mirror, we must now deal with inflationary pressure and an uncertain economic outlook. But there is a great deal to feel positive about. Leisure travel demand is incredibly resilient.\n\nWe've seen this proven in the wake of the pandemic just as we did amid the global financial crisis a decade and a half ago. Most of our markets are fully recovered and the geographies that are lagging are positioned to move forward. Our competitive position is strong in every corner of our network. In the core of our network, we outcompete the largest airlines in the world.\n\nAnd above all else, we continue to have the best team in the business that has overcome the adversities of the last few years and continues to deliver the outstanding service and hospitality that is our hallmark. I am encouraged by our progress, but not satisfied with where we are. What I am sure about is that we are on the right path. With that, let me turn the call over to Brent to discuss our results and commercial outlook in more detail.\n\nBrent Overbeek -- Chief Revenue Officer\n\nThank you, Peter, and Aloha everyone. Overall, our third quarter revenue performance came in as expected. Concerns about inflation or recession do not appear to have impacted consumer demand in the quarter. Passenger revenue was down just 4.5% from 2019.\n\nWe operated 113% of our domestic capacity and just 52% of our international capacity compared to 2019. Yields in the third quarter on our US Mainland to Hawaii routes were 9% higher than the third quarter of 2019. Our revenue management team using our new revenue management system did a fantastic job of improving yield for these markets. Well, it's only been six months since we cut over to our new RM system, the team is adapting well, the technology is clearly superior and we have more that we can do in this space going forward.\n\nIn the Neighbor Island selling fares introduced in the market are clearly below historical levels and below any of the markets served by the big four US carriers. But it is stimulating demand and confirming our conviction that consumers favor our product. As Peter mentioned, we're contending with a $39 fare throughout the end of the year, but we are managing yields above that base level where it makes sense to do so. Further evidence that Hawaiian being the preferred product in the market.\n\nLow fares at some of our Neighbor Island route's up 10 plus load factor points versus 2019, especially in markets that have a high percentage of local traffic. Underscoring this strictly in state travel, guests with local ZIP codes exceeded 2019 levels in September despite a smaller schedule. The recovery continued to be strong for our international markets, excluding Japan. Obviously the policies of Japanese government continue to dampen that market throughout the third quarter.\n\nIn our markets outside of Japan, however, average fares for the quarter were up 31% compared to 2019, which drove a ticket PRASM improvement of 25% of the strong fare performance, all despite the strength of the US dollar. Sydney, in particular, had a resounding recovery with PRASM improvement of over 50% versus 2019. An ongoing theme, our premium products continue to perform very well. We saw continued strong demand for our front cabin with North America premium cabin PRASM up 34% compared to 2019 for the quarter.\n\nExtra comfort revenue remain strong and the sale of preferred seats, which we introduced this past spring, continues to meet or exceed our expectations. Total ancillary revenue, including seats, bags, cargo and other products continues to perform very well. Our co-branded credit card program achieved another record quarter with revenue up 15% versus 2019. Net retail sales were up 13% and new accounts were up 18% versus 2019, both records for the program.\n\nAcquisition and spend remain strong, showing no signs of weakening. The cargo team delivered its highest third quarter revenue ever, up over 62% compared to the third quarter of 2019. Yields remain strong, up 73% compared to the third quarter of 2019 with the strongest demand from the Asia Pacific region. Looking forward, we are pleased by both domestic and international bookings and are expecting a continuation of strong demand for travel to Hawaii.\n\nFor the fourth quarter, we anticipate overall revenue to be up about 3.5% from 2019. Breaking this down further by geography, in North America, we continue to see strong demand and anticipate our load factor will exceed fourth quarter 2019 levels. We anticipate our fourth quarter PRASM for North America to be about 18% higher than the same quarter 2019, which includes a mid-single digit tailwind from the spoilage revisions Shannon referenced last quarter. The calendar works against us this year with an early Thanksgiving and Christmas on the Sunday.\n\nNevertheless, we are positioned for a strong finish to the year in this region. We expect to fly at similar schedule to the third quarter at about 9% more flying than our fourth quarter 2019 schedule. And while industry capacity to Hawaii is still elevated relative to 2019, we are continuing to see moderation through the fall and into the winter. We remain well positioned and based on the latest the data from the DOT, we continue to materially outperform our competitors on PRASM in North America.\n\nThis demonstrates the strength of our North America network, our focus on the Hawaii premium leisure traveler, our award winning service and our optimally configured aircraft. In the Neighbor Island, we expect to fly about 80% of our 2019 capacity in the fourth quarter, and we are competing well and continue to maintain a share of local traffic well in excess of our seats here, earning a sizable load factor premium, as well as meaningful yield premium compared to our competitor. However, the deeply discounted fares will pressure industry PRASM. Internationally, Sydney is continuing to build nicely through the end of the year.\n\nAuckland and Incheon are building a bit more slowly but their clear signs of recovery has taken hold in those markets, and fares are holding up very well. As Peter mentioned, the cap on daily arrivals to Japan was lifted on October 11. And we've seen a positive inflection in demand following the announcement, but intend to take a measured approach to restoring capacity to pre-pandemic levels. Japan-Hawaii traffic typically has an extended booking curve, and certain prominent travel retailers continue to focus on domestic leisure travel, taking advantage of government incentives.\n\nOur current plan is to restore capacity throughout the next couple of quarters with a full Japan schedule in place by the second quarter of 2023. Thus, our capacity Japan will likely align with the broader industry capacity plans. Moving to our capacity outlook. We anticipate our overall capacity for the fourth quarter to be down approximately 5.5% from 2019 levels, bringing our full year capacity down approximately 9.2% from 2019, which is slightly lower than we forecasted last quarter, reflecting the adjustments to our Japan schedule.\n\nTo summarize, we continue to see strong demand and we expect our fourth quarter load factor to be close to 2019 levels, premium cabin PRASM improvements to continue to accelerate to historical highs and extra comfort revenue to exceed 2019 levels. Internationally, with travel restrictions removed in all of our destinations, we expect demand will continue to build. We have the right products for our markets, a strong brand, an exceptional team and a winning formula for success. And with that, I'll turn the call over to Shannon.\n\nShannon Okinaka -- Chief Financial Officer\n\nThanks, Brent and thanks everyone for joining us today. First, we filed an 8-K yesterday, disclosing that we'll be restating the first and second quarters GAAP results. This is due to an adjustment to reclassify approximately $19.4 million in unrealized losses from other comprehensive income to the income statement. As these losses are unrealized, this change will have no impact on adjusted results.\n\nNow, let me provide an update on the balance sheet. Our balance sheet remains healthy and we have ample liquidity. We closed the quarter with $1.7 billion in total liquidity inclusive of cash, short term investments and our undrawn revolver. Adjusted net debt was $1 billion, which continues to be near 2019 levels.\n\nAs I mentioned last quarter, high fuel prices and uncertain economy and lower internal and fare all point to maintaining strong liquidity for the coming quarters. Turning to the P&L. We finished the quarter with an adjusted EBITDA of $47.9 million. These results were as expected with higher fuel costs and a challenging internal and fare environment, offset by the strong North America and international demand environment that Brent discussed.\n\nOn the cost side, our third quarter non-fuel costs, excluding nonrecurring items totaled $512 million with unit costs, excluding fuel and special items up 10% compared to 2019, which was consistent with our expectations. Fuel costs rose in the third quarter to $3.54 per gallon, up approximately 1.2% from our July guidance. For the fourth quarter, we expect our unit costs excluding fuel and special items to be up about 14% compared to the fourth quarter of 2019 on a capacity decrease of 5.5%. As with previous quarters, this quarter's biggest drivers are market driven increases, primarily in wage rates and airport rents.\n\nWe're also incurring costs to prepare for future growth, including pilot training and other start-up costs related to our new cargo flying for Amazon, as well as the future induction of the 787s. While these costs present near term headwinds, they are investments which lay the foundation for substantial future benefits. Additionally, we continue to invest heavily in technology, the benefits of which will be realized in increased revenue and labor productivity. For the full year, we continue to expect unit costs, excluding fuel and special items to be up approximately 13% compared to 2019 on a capacity decrease of about 9%.\n\nWe also expect our fourth quarter adjusted EBITDA to be approximately $15 million. Our capital expenditure forecast for 2022 is approximately $130 million, which is a little higher than our previous guidance due to an increase in technology spend. About $17 million of the remaining capex is related to pre delivery payments for our 787s, some or all of which has the possibility of moving into 2023. We continue to partner with Boeing to determine a final delivery schedule.\n\nWe've also updated guidance on our full year fuel price and consumption and our tax rate in the 8-K that was released today. As we look out into the remainder of 2022, we're confident that we are well along the road to recovery, and our focus is on the long term success of our business. To ensure our delivery of outstanding service and hospitality, we remain committed to invest not only in our daily operations in areas such as training, light operations and safety and security, but also for our future as we grow and become a modern airline with a more diversified business. In addition to running a solid passenger business, we're excited to begin our new venture with Amazon as we take advantage of our core strengths, operating a solid airline and delivering authentic Hawaiian hospitality.\n\nAnd with that, we can open up the call for questions.\n\nOperator\n\nThank you. We will now be conducting a question-and-answer session [Operator instructions]. Our first question comes from Mike Linenberg with Deutsche Bank. Please proceed with your question.\n\nMike Linenberg -- Deutsche Bank -- Analyst\n\nHey, good morning, everyone. Shannon, I just want to go back to, you talked about the cost guide and you talked about pressures, start-up costs tied to Amazon, pilot training tied to the 787? Are some of those, are they either going to be capitalized or expenses incurred, or are you going to call them out as special items when they hit the P&L? How are they going to be treated? I'm just curious as we think about the CASM trajectory over the next year or two?\n\nShannon Okinaka -- Chief Financial Officer\n\nYes. Thanks, Mike. As far as some of our Amazon accounting, we haven't quite got to the final determination for some of the start-up costs. So I think I can provide you more information on that in January, as far as how we'll treat the Amazon start-up costs.\n\nSo I think for now, especially with things like pilot training, it's kind of hard to piece out what level of pilot training is specifically for Amazon or 787, or our own passenger growth. So that's going to be a little bit hard for me to quantify next year, I think, we'll just have to build that into our cost guidance as we as we move forward.\n\nMike Linenberg -- Deutsche Bank -- Analyst\n\nOK. great. And then, Peter, listening to your commentary about inter-island competition and some of the comments, the follow-up comments by Brent, you sort of list through each of the key elements there, where the competitor maybe, either -- I mean, you know, that market better than anybody, like you said, you've been serving it for 90 years, pricing below cost, pricing at a loss, potentially. You start checking off the boxes there and it looks like that we may have a case here of predatory pricing here.\n\nIs that where we're going here? And I know the Justice Department is -- seems like they're a lot more focused on where they think there's potential harm they seem to be looking at everything. Is that what maybe going on here, because as best as you can tell when you look at the numbers and the fares, and you have access, we all have access, you can get that data better than anybody. It doesn't look like the competitor there is actually pricing to generate any sort of profit, is that -- is my sort of thinking right or where are you on this?\n\nPeter Ingram -- President and Chief Executive Officer\n\nI'll leave the legal questions to someone else, Mike. But what I will say is fares of $26.05 do not cover the total cost of operations, as I said in my prepared remarks.\n\nMike Linenberg -- Deutsche Bank -- Analyst\n\nOK, Fair enough. Thanks. Thanks for taking my questions.\n\nOperator\n\nOur next question comes from Chris Stathoulopoulos with Susquehanna. Please proceed with your question.\n\nChris Stathoulopoulos -- Susquehanna International Group -- Analyst\n\nGood afternoon. So, Peter, are we to assume, with your decision to stand and compete on the inter-island competition, that perhaps summer all these flights are operating at a cash loss? And I know, you said that you don't want to speculate, I want this competitors end game might be. But is there perhaps some lower yielding traffic here that you would perhaps be willing to walk away from should this persist longer than expected? Thanks.\n\nPeter Ingram -- President and Chief Executive Officer\n\nSo let me start and see if Brent or Shannon has anything to add. There are certainly some of the operating costs that are noncash, most notable one, obviously, is depreciation and some of the aircraft ownership. And in our case, our aircraft are already substantially depreciated. And the cost of ownership is very low on our fleet.\n\nMost of the costs are cash. I would say it is the case, though, that there's a lot of things that are sometimes challenging to attribute to a specific flight in the way we look at the cost structure. But what I would say about the price structure that's in there right now, if you look at how the pricing is elsewhere in the country and markets under 250 miles, you won't see pricing in the local market anywhere close to what we're seeing here. So it's highly unusual and I don't think sustainable for the long term.\n\nIn terms of whether we would walk away from some low yielding traffic, I think that's -- and Brent may have something to add to this. But I think some of that is difficult to do, because people see the fares all the time, some of our best regular corporate accounts have access to $39 fares and in a different environment, those yields on that traffic might be different. But I don't think we have any intention of walking away from those sorts of customers that are important just in the current environment when you've got such pervasive low fares, they are going to permeate the entire revenue structure.\n\nBrent Overbeek -- Chief Revenue Officer\n\nYes, I think as Peter mentioned, we are aggressively competing for traffic. We think that is the right long term answer to do in terms of protecting our customer base. But we are managing up on those windows where there are opportunities to sell up. And so whether they be holidays, whether it'd be key business times, there are some pockets where we can manage that.\n\nBut we feel overall we need to compete aggressively and defend our market and give customers choice that they've shown they clearly prefer us.\n\nChris Stathoulopoulos -- Susquehanna International Group -- Analyst\n\nAnd then Shannon or Peter, given what you're seeing with respect to this inter-island competition, the removal of travel restrictions and any start-up costs from Amazon. How are you thinking about capacity and CASM ex for next year? Thank you.\n\nShannon Okinaka -- Chief Financial Officer\n\nSo we're not prepared yet to give CASM ex guidance for the full year. But if we think about our costs and in generally two or three buckets, some of our just business as usual costs have gone up and that's where we're talking about those market increases like labor, fuel is going to do what fuel is going to do, we're going to see that across the industry. But to the point we've been making, we do have a bunch of investment costs. And it includes things outside of Amazon and 787s, we are investing in a new PSS, that's going to continue in 2023.\n\nWe're still as we ramp up our ASMs in the first half of the year, we're still below 2019 levels of ASM, which also pressures unit costs. But at this point, we think it's really important for us to continue investing in the business for the future growth, because we know those ASMs will come back.\n\nPeter Ingram -- President and Chief Executive Officer\n\nAnd just to add to that, on the capacity outlook for next year. When Shannon's referring to ASMs being below 19, it is really in the early part of the year as we're ramping and up. Our expectation and you can see it reflected in the schedule update that's out there now for Japan recovery is a schedule that we expect to fly at this point, which is different than some of the schedule add over the last two years as things have been very dynamic. And we would expect as we get beyond that ramp that we do have capacity up above where it was in 2019, probably for the full year, it's somewhere in the low to mid-single digits level.\n\nChris Stathoulopoulos -- Susquehanna International Group -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question comes from Andrew Didora with Bank of America. Please proceed with your question.\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nHey, good afternoon, everyone. Peter, you went through all the inter-island dynamics very thoroughly. You've spoke about the slow ramp in Japan, but you're also seeing pretty decent sequential revenue improvement 3Q to 4Q. Just wondering where are you seeing much of this offsetting strength coming from, is it good holiday? Just curious where you're seeing that strength.\n\nThanks.\n\nPeter Ingram -- President and Chief Executive Officer\n\nYes. Thank, Andrew. Really North America has a nice sequential improvement. While the calendar is working against us a little bit in the latter part of the quarter, the front part of the quarter looks really, really strong in North America.\n\nAnd so we're encouraged with what we're seeing in terms of average fare improvement really in both cabins. And so that is, we've seen that coming out of the summer and that continues to accelerate into really into October, November and December. While the calendar is working against, it still looks like it'll be a pretty good month. So some improvement clearly in Japan as it comes off from the depths of where it was at but really I would say North America is powering a disproportionate amount of that and again, more on the average fare side and a little bit on the load factor side.\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And Peter, I apologize, I wasn't able to be on the call on Friday. But when we think about kind of this Amazon deal, should we really think about this as a cost plus contract, so that the margins on this look relatively low versus the actual revenues brought in. And just curious, just in terms of the revenue that you will book, does this include a lot of the pass through items, such as fuel and certain maintenance items or am I wrong on that thought process?\n\nPeter Ingram -- President and Chief Executive Officer\n\nWe will -- on the how we're going to account for those pass through items, which you know the most significant of which is fuel. I think that's one of the things we're going to be sorting out now that we have a broader population of people that we're allowed to talk to about this. But those items are clearly pass through. The bulk of the revenue that we think of as at risk revenue is going to be in the form of a per block our operated revenue that we book and a per departure revenue that we book.\n\nAnd it's up to us to make sure that that revenue exceeds the costs that we incur, primarily from the crew and maintenance of those aircraft, the biggest sort of elements of the cost structure. So it is -- in that sense, it is -- there's an element of costs plus but those, the per block hour and the per departure rate is established in the contract that we've negotiated with Amazon. There is a mechanism for adjustment over time based on particular drivers. But our ability to generate the margin is really going to be a function of how we manage our costs below that.\n\nAnd frankly, our success is not only hinging on that but it's our ability to satisfy our customer by operating absolutely reliably on a very consistent basis.\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Dan McKenzie with Seaport Global. Please proceed with your question.\n\nDan McKenzie -- Seaport Global Securities -- Analyst\n\nHey, good morning. Thanks guys. Peter, over the years, you seem to have always found a way to backfill lost revenue. So if anyone can pull a rabbit out of a hat, it's you given the network wins over the past decade.\n\nAnd so I guess as we think about backfilling the loss revenue, given the new competitive dynamic, Amazon seems to be a start once up and running later next year. But on the partner side, going back to the JAL JV that failed to win antitrust immunity. Does it make sense to revisit other international opportunities that are out there or how should we think about other tricks that could be up your sleeve to backfill some of this lost revenue?\n\nPeter Ingram -- President and Chief Executive Officer\n\nOn the international side, I think the biggest opportunity is to get to a full recovery of Japan. And while we are planning to approach that methodically over the coming months, we do think that the historical importance of Japan travel to Hawaii should not be understated, and really is the largest international opportunity. We're going to continue to look for other places that our service would be in demand. I think Brent and the network planning team have a variety of things in mind for future growth as we have aircraft available, particularly as we get to the point where the 787s start arriving, and we free up some flexibility in that regard.\n\nSo we absolutely think there's still runway for growth. We remain primarily a passenger business. We're going to execute the Amazon contract very well but it doesn't detract from our focus on running the passenger operation and looking for opportunities to grow it as we move forward.\n\nDan McKenzie -- Seaport Global Securities -- Analyst\n\nOK. And then second question here, going back to the Amazon opportunity. One follow-up question that I had was just simply on the warrants. And I'm just wondering if you can elaborate on the thought process for warrants close to 18 -- I think was 18% of the company, not more than 20%.\n\nBut why is that sort of the right level of ownership or the right amount for you to grant them, and is it possible that that could potentially be upsized at some point?\n\nPeter Ingram -- President and Chief Executive Officer\n\nLike everything else, this was a subject of negotiation and a back and forth over several months with Amazon. And ultimately, we came to a total package on the contract that we think is a worthwhile endeavor for our company, and we're excited about it moving forward. Just to correct one number. You said there, it's not 18%, it's 15% of fully diluted shares, 9.4 million shares.\n\nDan McKenzie -- Seaport Global Securities -- Analyst\n\nYeah. Understood. OK. All right.\n\nWell, thanks for that. Appreciate the time.\n\nPeter Ingram -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Quinn Wasko with Cowen. Please proceed with your question.\n\nQuinn Wasko -- Cowen and Company -- Analyst\n\nThis Quinn for Helane. So, just thinking about the loosening of travel restrictions in Japan. My thought at the time was when those restrictions came off, we would start to see more capacity and schedule getting allocated to Japan. But it seems since then the capacity has pulled back a bit, even most recently this week, getting pulled back all the way into February.\n\nAnd so maybe just thinking about the full recovery of that market into one each '23 seeing that recovery. What's giving you confidence in that being the point where we're going to start seeing this capacity come back online?\n\nPeter Ingram -- President and Chief Executive Officer\n\nWe had worked our way through and we were waiting on some governmental approvals around our ability to operate a smaller schedule and protect some of our slots. And so some of that had taken a while, which caused us to publish the schedule a little bit later than frankly we would have liked. But yes, as you can see, we've got kind of a published ramp up now through, really through the end of this quarter, a little extra holiday flying back down and then we'll kind of gradually right now bring back more service in the first quarter. As we talked about, we think there is a longer booking curve here.\n\nJapanese residents, comfort and travel is going to take a little bit longer than it has in other geographies. A focus on traveling abroad, I think, it's going to take a little while but we're -- we think that's about the sweet spot where folks will start coming back, and we'll see stronger golden week in travel really at the end of the first quarter and into the second quarter and we plan on matching our capacity concurrent with that.\n\nBrent Overbeek -- Chief Revenue Officer\n\nAnd just as a point of clarification, Quinn, we aren't reducing our capacity from the level we're flying. We actually increased our schedule in August to get to more of a full -- close to a full daily service between Honolulu and each of Narita, Osaka and Kamata. There is no reduction from that. What is reflected in the schedule reductions is a slower pace of growth in our forward schedules as opposed to a reduction from where we are today.\n\nAnd we do anticipate over the course of the fourth quarter having some more of that capacity through Japan come back as we move through the period and then again more in the first quarter.\n\nQuinn Wasko -- Cowen and Company -- Analyst\n\nAnd so moving on to your Amazon business that you guys are doing with them, when you're thinking about how you're going to be sourcing as pilots and how you're going to fill that capacity. If for whatever reason there was some constraints on the pilot hiring, would you think about constraints from your international capacity, especially to Japan, if that market isn't fully recovered yet and moving some to the Amazon business?\n\nPeter Ingram -- President and Chief Executive Officer\n\nI think we've got an extremely high level of confidence that we're going to be able to procure, source all the pilots that we need. We've got a very compelling proposition to aspiring pilots at Hawaiian Airlines. If you look at our fleet composition today, on the passenger side with 24 of our 61 aircraft being widebody aircraft, we've already got a higher proportion of widebody aircraft in the fleet, which are the higher paying positions than any of the US carriers, including big three network carriers. On top of that, we've got commitment for 10 more widebodies from Amazon and we've gotten order for 10 more widebodies entering the form of our firm 787 order.\n\nThe career earnings potential is really pretty attractive for pilots. And so we're confident in our ability to find pilots available. There are -- we're continuing to hire every month and we're confident in our ability to work through the training that we need to make sure that we're ready to serve our customer when we start flying in the back half of next year.\n\nQuinn Wasko -- Cowen and Company -- Analyst\n\nGot it. All right. Thanks for the time.\n\nPeter Ingram -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Chris Stathoulopoulos with Susquehanna. Please proceed with your question.\n\nChris Stathoulopoulos -- Susquehanna International Group -- Analyst\n\nOK. Thank you for the follow up. Peter, just going back to the Amazon business. So just want to clarify, there are no volume commitments on the CMI lease and then B, so do these rates set on a per flight segment basis or at the start of the year? And if Amazon starts to move the schedule around with respect to seasonality in peak and therefore block hours.\n\nHow do you manage your per flight margins?\n\nPeter Ingram -- President and Chief Executive Officer\n\nSo I'll start on that and then I'll maybe hand it over to Jim Landers, who you guys met on the call on Friday, and who's in here again with us today. There are no specific volume levels of flying that need to be maintained in the contract. But there are significant incentives to manage utilization higher on the aircraft and therefore provide a predictable level of flying. And that is, just when you think about it, these will be the biggest and the newest aircraft in the Amazon air fleet across a variety of carriers.\n\nThey are incentivized to cover the fixed costs of those efficiently by scheduling them regularly and keeping them going and probably keeping them going generally on the longer haul and highest demand parts of their network. So we're going to work closely with them on managing that schedule over time. They really do value the flexibility to make the adjustments they need to serve their customers, but they want to do that in a way that puts the carriers that are operating for them in a position to be successful as well. And so we'll work with them over time to make sure we can execute on that.\n\nJim, anything you would add?\n\nJim Landers -- Senior Vice President, Technical Operations\n\nYes. I would just say that we're in our early days of working through the details of the relationship. But clearly in the cyclicality of the year -- of the shopping year, where there maybe peaks and valleys, we can look to optimize the aircraft utilization through maintenance events and optimizing the whitespace and other ways to make sure that we're getting the best out of the aircraft. But to Peter's point on being their new flagship and largest aircraft, we expect a high degree of utilization.\n\nChris Stathoulopoulos -- Susquehanna International Group -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThere are no further questions at this time. I would now like to turn the floor back over to Mr. Ingram for closing comments.\n\nPeter Ingram -- President and Chief Executive Officer\n\nAll right. Mahalo again, and thank you all for joining us today. Let me also again thank our team for meeting the challenges of the competitive marketplace and continuing to deliver the warm hospitality that sets Hawaiian apart from others. I look forward to updating you on our progress again in a few months.\n\nAloha.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nUnknown speaker\n\nPeter Ingram -- President and Chief Executive Officer\n\nBrent Overbeek -- Chief Revenue Officer\n\nShannon Okinaka -- Chief Financial Officer\n\nMike Linenberg -- Deutsche Bank -- Analyst\n\nChris Stathoulopoulos -- Susquehanna International Group -- Analyst\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nDan McKenzie -- Seaport Global Securities -- Analyst\n\nQuinn Wasko -- Cowen and Company -- Analyst\n\nJim Landers -- Senior Vice President, Technical Operations\n\nMore HA analysis\n\nAll earnings call transcripts"
}