{
  "companyName": "Genmab A/S",
  "companyTicker": "GMAB",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/genmab-as-gmab-q2-2022-earnings-call-transcript/",
  "content": "Genmab A/S (GMAB -0.42%)\nQ2 2022 Earnings Call\nAug 10, 2022, 12:00 p.m. ET\n\nOperator\n\nHello, and welcome to the Genmab Q2 2022 conference call. [Operator instructions] Just to remind you, this conference call is being recorded. During this conference, you may be presented with forward-looking statements that include words such as believes, anticipates, plans or expects. Actual results may differ materially, for example, as a result of delayed or unsuccessful development projects.\n\nGenmab is not under any obligation to update statements regarding the future, nor to confirm such statements in relation to actual results, unless this is required by law. Please also note that Genmab may hold your personal data as indicated by you as part of our Investor Relations outreach activities in order to update you on Genmab going forward. Please refer to our website for more information on Genmab and our privacy policy. Today, I am pleased to present Jan van de Winkel.\n\nPlease begin your meeting.\n\nJan van de Winkel -- Chief Executive Officer\n\nHello, and welcome to the Genmab conference call to discuss the company's financial results for the first half of 2022. With me today to present these results is our CFO, Anthony Pagano. And then for the Q&A, we will be joined by our chief development officer, Judith Klimovsky; our chief operating officer; Anthony Mancini; and our chief medical officer, Tah Ahmadi. Let's move to Slide 2.\n\nAs already said, we will be making forward-looking statements, so please keep that in mind as we go through this call. Let's move to Slide 3. Genmab has an innovation-based culture and collaborations and partnerships have always been part of our DNA. During today's presentation, we will reference some of the products being developed under these strategic collaborations, and this slide acknowledges those relationships.\n\nLet's now move to Slide 4. Genmab has experienced significant growth over the past few years in all areas of our business. Based on this progress, our executive committee determined that it was time to look beyond that our 2025 Vision for the company to see how we can continue to impact the lives of patients and the healthcare community even further into the future. Working with a broad cross-functional team of Genmab colleagues, we created our updated core purpose and 2030 Vision that you see here.\n\nThe biggest change between our 2025 and our 2030 Vision's is the expansion and our focus on just cancer, to cancer and other diseases. We know that our antibody know-how assets and technologies can be applied to diseases outside of cancer. The approval of Novartis's Kesimpta in ofatumumab and a rise in Tepezza to in thyroid eye disease are proof of this. So while we will continue to create and develop new treatment concepts in oncology, we will remain open to other potential indications outside of cancer with the ultimate goal of improving the lives of as many people as possible through our innovative and differentiated antibody therapeutics.\n\nSo now let's take a look at some of the recent events that propelled us closer to our 2025 and our 2030 Vision's on the next slide, Slide 5. Genmab's innovative excellence and the hard work and commitment of our unstoppable team have been on display recently with a number of important defense. At the end of June, we announced our intent to submit a BLA to the FDA for epcoritamab for the treatment of patients that relapsed or refractory large B-cell lymphoma. In the second half of this year, subsequently in July, we announced that AbbVie will submit a conditional MAA to the EMA in Amsterdam for the treatment of patients with relapsed or refractory diffuse large B-cell lymphoma, also in the second half of this year.\n\nAnd as a reminder of our collaboration details, Genmab and AbbVie shared commercial responsibilities in the U.S. and in Japan with AbbVie responsible for further global commercialization. The submissions will be supported by results from the LBCL cohort of the pivotal EPCOR NHL-1 study. We and AbbVie announced the top line results from this study in April with primary results presented in a late-breaking oral presentation as part of the prestigious Presidential Symposium at the EHA Conference in Vienna in June.\n\nThe results from this study support our belief that epcoritamab has the potential to offer people living with LBCL, a new therapeutic option with a manageable safety profile. And we are very much looking forward to next steps. The late-breaking epcoritamab presentation at EHA was one of the many recent data presentations that there were multiple epcoritamab dose presentations at ASCO with epco at EHA highlighting data in a variety of treatment settings and hematological malignancies. In addition, we and our partner, CGEN, were pleased that several abstracts evaluating tisotumab vedotin and various tumor types were presented at ASCO.\n\nThese included an oral presentation of the innovaTV 205 for study, evaluating tisotumab vedotin in combination with carboplatin or pembrolizumab in first-line patients with recurrent or metastatic cervical cancer. The data presented recently for both epcoritamab and tisotumab vedotin are reflective of our commitments and the commitment of our partners to investigating these therapies across different lines and combinations. Turning to our earlier stage pipeline. As it relates to DuoHexaBody-CD37, one of our assets with AbbVie, we will discontinue the co-development with AbbVie and Genmab will continue development of this program on its own.\n\nAs we continue to explore this program, we look forward to providing you with further updates. I'm excited to announce an additional update to our product pipeline, a new antibody in the clinic by the end of this year for solid tumors, HexaBody-CD27, also known as GEN1053. The development of this Hexabody-based product is part of our broadening partnership with BioNTech. And like GEN1046 and GEN1042, we will be co-developing this investigational medicine at BioNTech 50:50.\n\nThe foundation of our differentiated product pipeline is our proprietary technologies, and I'm extremely pleased to share with you that our HexElect technology was recently featured in an article in the Journal Nature Biotechnology. The HexElect technology is an approach to enhance the functional selectivity of therapeutic antibodies by making their activity dependent on clustering after binding to two different antigens expressed on the same target cell. The potential of this technology is another example of the innovative spirit of our world-class team. I'm also enthusiastic about the fact that Janssen has announced a positive CHMP opinion for Tecvayli or teclistamab, recommending conditional marketing authorization for the treatment of patients with relapsed and refractory in multiple myeloma.\n\nSince Tecvayli receive approval in either Europe or in the U.S. where Janssen's BLA is currently under review, there would then be six medicines on the market that leverage Genmab's innovation and technology, including two medicines, Janssen's Rybrevant and Tecvayli created using our proprietary DuoBody technology platform. As we look forward to regulatory submissions for epcoritamab, we are hopeful that medicines created with our DuoBody platform will continue to become new treatment options for people with unmatched medical needs. Darzalex continues to redefine the treatment of multiple myeloma with strong sales for the first half of the year as we reported $3,842 million in net sales by J&J, an increase of 37% over the first half of 2021, resulting in DKK 4,024 million in royalties to Genmab.\n\nThis brings me to our new arbitration with Janssen relating to our daratumumab license agreements. As we announced in the beginning of April in the original arbitration, the tribunal ruled in favor of Janssen on the question as to whether Genmab is required to share in Janssen's royalty payments to Halozyme for its technology used in the subcutaneous formulation of daratumumab. The tribunal based its ruling on the finding that Darzalex Faspro constitutes a new licensed product under the license agreement. In the new arbitration, we are seeking an award of $405 million plus interest in accrued milestone payments for Darzalex Faspro and a declaration that we are entitled to a new 13-year royalty term from the date of Darzalex Faspro's first commercial sale.\n\nAs the arbitration is confidential, outside of our disclosure obligations, we do not intend to comment further, and we look forward to our continued collaboration with Janssen. I'm pleased to now hand over the call to Anthony Pagano to take you through our first half financial results. Anthony, the floor is yours.\n\nAnthony Pagano -- Chief Financial Officer\n\nGreat. Thanks, Jan. Let's move to Slide 6. We continue to strengthen our foundation during the first half of 2022.\n\nTo start, we're on track for regulatory submissions for epco in both the U.S. and Europe in the second half of this year. And as we'll see our H1 financials are exceptionally strong. We grew operating profit by 34%.\n\nAnd importantly, we also increased recurring revenues by 86%. This was driven by strong royalties from Darzalex and other approved medicines. You'll remember, of course, that we didn't have any Tepezza revenues in Q1 of last year. Our strong balance sheet, growing recurring revenues and significant underlying profitability allow us to continue to invest in our business and our pipeline in a very focused and disciplined way.\n\nEspecially in the volatile times, the strength of our financial profile really stands out. And an important part of this has been to continue to build the team and our capabilities to enable us to succeed. So let's take a look at those revenues in a bit more detail on the next slide. We saw continued strong performance for Darzalex in the first half of the year.\n\nAs you can see in the chart, overall, net sales grew by 37%. That's net sales of $3.84 billion, which translates to over DKK 4 billion in royalty revenue. This exceptional growth was driven by continued strong market shares across all lines and continued uptake of the subcu formulation. So Darzalex remains a key driver of our revenue, as you can see on Slide 8.\n\nWe grew total revenue to almost DKK 5.3 billion in H1. And as I've already highlighted, that included an 86% increase in our recurring revenue. We've already spoken about Darzalex and the very strong performance there. Turning to Kesimpta and Tepezza, we saw an increase of DKK 452 million in royalties compared to last year.\n\nTaken together, this growth really illustrates the power of our recurring revenue. In fact, over 90% of our H1 revenue was recurring. So our revenue profile continues to get stronger. And we're taking our strong recurring revenue and investing in a highly focused way, as you can see on the next slide.\n\nIn line with our significant growth opportunities, total operating expenses grew 58% in the first half. In R&D, we've accelerated our investment into our product portfolio, especially the advancement of both epco and DuoBody-CD40x4-1BB. We've also further strengthened the Genmab team to support our growth in commercialization and our expanding pipeline, and that includes supporting Tivdak and preparing for the filings and potential launch for epco. Finally, we're leveraging the AbbVie collaboration by utilizing their expertise and significant financial contributions to further expand and accelerate our partnership programs.\n\nNow let's take a look at our financials as a whole on Slide 10. Here, you can see our summary P&L. Revenue for the first half came in at approximately DKK 5.3 billion, and that's up 49% on last year. Total expenses were about $3.5 billion with 69% being R&D and 31% SG&A, and that brings us to a very strong operating profit of nearly $1.8 billion.\n\nAnd for me, this result is particularly impressive given the context. And why do I say that? Last year's H1 makes for a somewhat tough comparator as it included more than $700 million of milestone revenue. And this year, we've also increased our total investment in H1 by nearly DKK 1.3 billion. And even considering these items, we still delivered a 34% increase in operating profit in H1.\n\nMoving to our net financial items. Here, we have income of $1.3 billion, which was primarily driven by the same two partially offsetting items that we highlighted in Q1. First, we've got the strengthening of the U.S. dollar against the Danish kroner positively impacting the value of our cash and investments.\n\nAnd on the other side of the ledger, we have losses on our marketable securities due to rising interest rates and some losses on our public equity investments that we made in conjunction with recent licensing deals. Then we have tax expense of $745 million, which equates to an effective tax rate of 24%. And that brings us to our net profit of nearly DKK 2.4 billion. So as you can see, extremely strong financial performance for H1.\n\nBefore we take a look at our improved guidance, I want to take just a minute to revisit our robust financial framework on the next slide. First off, let's think about our revenue profile, which you can see on the left. At the beginning of 2020, Darzalex was our only product on the market. Today, we have five, and that provides us with expected recurring revenue growth of 53% in 2022, and there's a clear path to potentially expand the number of approved products with Janssen's BLA and MAA for teclistamab, and most excitingly, our plan submissions for epco later this year.\n\nTaken together, we expect significant cash inflows in the years to come. Moving to the right, we continue to be focused on our investments as we evolve our organization for continued success and right at the top of the list is accelerating and expanding epco. Based on the work we've done so far and the data we've seen, including the recent top line data, we're convinced epco is a drug that has the potential to really make a difference for patients. And epco is just one of the exciting opportunities that provide us with a compelling rationale for increasing our investment.\n\nAs we told you before, if we want to seize these meaningful opportunities, we've got to invest and that's exactly what we're doing. So with that background, let's look at our improved guidance on Slide 12. Driven by continued strong Darzalex growth and the positive net impact of the strong U.S. dollar, we raised our 2022 guidance earlier in the week.\n\nWe now expect our revenue to be in a range of DKK 12 billion to DKK 13 billion, an increase of DKK 1 billion to both the bottom and top end of our range. This increase is driven by higher Darzalex royalties following the strong H1 performance. Here, we've increased our guidance for Darzalex net sales to a range of $7.8 billion to $8.2 billion. Our revenue also continues to be positively impacted by the strong U.S.\n\ndollar. Turning to our investments. We remain focused on executing against our strategy and key priorities and creating long-term value. Here, we are increasing our opex guidance to a range of DKK 7.6 billion to DKK 8.2 billion.\n\nThis is driven by pipeline progression and accelerated epcoritamab launch readiness activities as well as the strong dollar. Putting all this together, we're planning for substantial operating profit in a range of DKK 3.8 billion to DKK 5.4 billion. Now clearly, we've all seen a material appreciation of the dollar so far this year. Taking this into account, we've updated our guidance rate for the Danish kroner, U.S.\n\ndollar from 6.4 to 6.8 to reflect the year-to-date average through Q2 as well as consensus. Overall, our increase in revenue is approximately 40% operational and 60% FX and the increase in operating costs is roughly evenly split between operational items and FX. And finally, to give you just a bit more color on foreign exchange, every 10-point move in the exchange rate relative to our guidance rate is worth around DKK 50 million in operating income for the balance of the year. Now for my final slide, let me provide just a few closing remarks.\n\nIn summary, we've had an exceptional first half of 2022. We've created growing recurring revenue streams, and that gives us a strong backbone of significant underlying profitability. And we continue to invest those revenues in a highly focused way to realize our vision and capitalize on the very significant growth opportunities in front of us. Now on that note, I'm going to hand you back over to Jan to discuss our key priorities for 2022.\n\nJan van de Winkel -- Chief Executive Officer\n\nThank you, Anthony. Let's move to Slide 14. Our key priorities are essential to our success, and we are making excellent progress. We are especially excited about the recent advancements for epcoritamab and in addition to the recent data and the announcement of our intent to submit a BLA in the U.S.\n\nand that this intend to submit a conditional MAA in Europe, a new Phase 3 study, epco as a one is now listed on ClinicalTrials.gov. The study will evaluate safety and efficacy of epcoritamab in combination with rituximab and lenalidomide or ORRs there. Compared to [Inaudible] alone, in patients with relapsed or refractory for follicular lymphoma. Together with AbbVie, we anticipate that this study will start in the second half of this year.\n\nWe look forward to providing you with further updates on epcoritamab as well as other clinical programs as Genmab continues to evolve into a leading fully integrated biotech innovation powerhouse. So let's now move to our final slide, Slide 15. That ends our presentation of Genmab's first half 2022 financial results. Operator, please open the call for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Wimal Kapadia of Bernstein.\n\nWimal Kapadia -- Bernstein -- Analyst\n\nCan I first just ask about the HexaBody-CD38, please. So when can we expect the Dara head-to-head trial to begin? Is it fair to assume we won't really get an update from a data perspective until quite late into 2023? So -- and just tied to that, any update you can provide on what you're seeing so far in the current data set that gives you confidence to begin that head-to-head study? And my second question really is just in terms of epco and filing, [Inaudible] it's quite a broad range well in August. So what more is really needed to file with FDA? Are you in the process of putting the package together? Is there more data needed? So just any update there would be great.\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Wimal, for the questions. I think I can handle both of them myself. HexaBody-CD38, we are very excited about the data. You will see the dose escalation data this year remodel, Wimal.\n\nAnd we hope to start the head-to-head against subcu dara near the end of this year. So no data will be there this year. And indeed, I think end of '23 for the head-to-head data is probably the right approximation. Then for the epcoritamab filing in the second half, we have all the data, and we are now basically working on the filing as we speak, Wimal, and we hope to actually finalize that filing in the coming months, literally.\n\nThat's probably all we can say on the timing.\n\nOperator\n\nOur next question comes from the line of Jonathan Chang at SVB.\n\nJonathan Chang -- SVB Securities -- Analyst\n\nA couple from me. First one, on your updated 2030 vision, can you provide any more granularity on your plans outside of oncology? And then second question, when could investors see additional clinical data for GEN1046 and 1042? Will these be in the second half of this year or not?\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Jonathan, for the question. I will ask you that Judith Klimovsky to basically give it a start on both of your questions, and then I can see what can add you. Judith, the floor is yours.\n\nJudith Klimovsky -- Chief Development Officer\n\nYes. So to answer the third question on IRS beyond oncology is serious diseases where our technologies and antibody expertise can make a difference. So we are assessing actively, as we speak, there could be low-hanging fruits. And as Jan mentioned some examples of progressing even would be selective.\n\nSo we are exploring this actively as we speak. So we cannot provide more granularity at this point. With regard to the second question, we are committed to deliver the data to come to a proof of concept for GEN1046 and/or GEN1042. We are actively enrolling.\n\nAnd as you know, we had a very data-driven company. So we are committed to gather this data by the end of the year. The opportunity to present. We are actively assessing vis-a-vis the time lines for the different conventions, but we feel committed to our -- to our goal to present this data by the end of the year.\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Judith. I think nothing to add, Jonathan for now, but thanks for the questions.\n\nOperator\n\nOur next question comes from the line of Sachin Jain at Bank of America.\n\nSachin Jain -- Bank of America Merrill Lynch -- Analyst\n\nA couple of pipeline and then just 1 financial. Just a follow-up on 1042 and 1046. Can you just provide more color where you are with the program? So my interpretation of prior commentary had been that you've obviously got multiple combinations ongoing with different sequences. And there have been signs of initial efficacy and really trying to work out what combinations are giving you the best durability of response vis-a-vis safety.\n\nSo was that interpretation fair? And just any color you can provide us where you are on the path to finding the right combination and sequence? Second pipeline is the CD37. Just any color as to what AbbVie saw to hand that asset to you? And then just one financial for Anthony. Just given the variability of milestone income, just any color you can give us as to how to think about milestone revenue expectations this year within guidance? And obviously, any color you can give on that question, that would be super helpful.\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Sachin, for the questions. What I will do is I will hand the first question on 1042, 1046 to Tahi and also ask Tahi to basically comment further on the AbbVie decision, if possible. And then Anthony Pagano can pick up on the milestone and epco question time, right. The floor is yours, Tahi.\n\nTahi Ahmadi -- Chief Medical Officer\n\nThank you, Jan. Well, I mean, this is going to be issue. I think beyond what Judith earlier said on 1042, 1046, I don't think we're in a position to give any more clarity on the data that we're generating, obviously, you can tell from frequent trials but above from the plan commentary on our end as you correctly summarized that we are generating combination data both in combination with checkpoint inhibitors as well as at combination checkpoint inhibitors, chemotherapy and a variety of solid tumors. And once we have the data, we will make the decisions and communicate the decisions.\n\nAnd as I said, we are committed to presenting what data we have that is meaningful toward the end of the year for -- data for two programs. I think that's all we can say 1042, 1046 as it relates to 1037. I think there's two things to say, a, the dose escalation is not yet completed. And as to why AbbVie made decisions that they made; I think they are probably in a better position to comment on that.\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Tahi, and also to Anthony Pagano.\n\nAnthony Pagano -- Chief Financial Officer\n\nYes. Thanks, Sachin, for the question. I mean maybe sort of stepping back and sort of reminding you of our original 2020 guidance at the beginning of the year. And there, we highlighted we broke down our revenue between recurring items and nonrecurring items.\n\nAnd as a reminder, at the beginning of the year, we said around DKK 1.7 billion to DKK 1.8 billion was nonrecurring, that's where the milestones are located. I would say, broadly speaking, that's still the right way to be thinking about nonrecurring revenue in aggregate. Now zooming in on epco, again, consistent what we said at the beginning of the year, we continue to have an approximately DKK 500 million of epco milestones in our 2022 guidance, which is -- it's a math is DKK 500 million is primarily related to the filing and acceptance of a regulatory submission in a single territory. Now I think this is probably what you're getting at.\n\nIn the event we successfully filed and get acceptance in more territories, again, with acceptance being the trigger, we would be entitled to an additional milestone. So I hope that gives you a little bit more color, Sachin.\n\nSachin Jain -- Bank of America Merrill Lynch -- Analyst\n\nCan I just take one additional for Tahi. Just to -- I understand the no additional color, but perhaps you could just comment at a much higher level and where is your level of confidence based on what you're seeing that either or 1042, 1046 will be Phase 3 ready by the end of this year?\n\nTahi Ahmadi -- Chief Medical Officer\n\nI don't think we can comment on that. So we'll be generating the data. We have all in patients. We're looking at the signal.\n\nAnd I think in the past, we have been very aggressive in making these decisions very early on the small data set. Once we have the confidence, we will communicate that to you in an appropriate form. We have some confidence that we will have data by the end of the year that certainly could inform next steps whatever the next steps maybe.\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Sachin. Thanks, Tahi. Let's go to the next analyst.\n\nOperator\n\nThat's Asthika Goonewardene of Truist Securities.\n\nAsthika Goonewardene -- Truist Securities -- Analyst\n\nCan you hear me, OK?\n\nJan van de Winkel -- Chief Executive Officer\n\nYes. Perfect.\n\nAsthika Goonewardene -- Truist Securities -- Analyst\n\nOK. So, Jan, I know you don't want to talk too much about the new arbitration with J&J. But maybe you could tell us what sort of a time line we should expect for this or if it should be similar to the previous arbitration? And also, is there a completely new arbitration panel for this? And then I have a follow-up.\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Asthika. We can see very limited -- very limited amount of information. But I can tell you that we think this is a much simpler, much more much easier arbitration, basically centering around one question is Faspro a new product or not. And if it's a new product, then it has consequences.\n\nSo the time lines are here only uncertain, but you would certainly hope that this will develop a lot more quickly than the previous arbitration Asthika. But you cannot give any guarantee because it's up to the judges and the panel to determine the time lines.\n\nAsthika Goonewardene -- Truist Securities -- Analyst\n\nGot it. That's helpful. Then maybe just going back to GEN3009. Is it right to assume that you've completed enrollment in the monotherapy dose escalation? And then I was just wondering how far along are you on the recruitment to the epco compound [Inaudible] cohort?\n\nJan van de Winkel -- Chief Executive Officer\n\nI think I can answer this one, Asthika. We are finalizing the dose escalation. So we are not yet completely done on the dosing, we're testing different doses still, and we have not yet started the combination with epco. We hope to start that in the coming time once we know what the recommended Phase 2 dose is.\n\nAsthika Goonewardene -- Truist Securities -- Analyst\n\nOK. And Jan, how confident are you that this could be a drug given that AbbVie has stepped away from it?\n\nJan van de Winkel -- Chief Executive Officer\n\nYes. I should probably not comment on that any further, as I think Tahi already explained to you. We are very much a data-driven company, rational company. The molecule is clearly active.\n\nWe have already said last year in December, that there is a good safety profile here. But I think it's probably premature to comment on that, Asthika. We will inform you once we know and we are very busy with the program until the end of this year, also we will cosponsor the program, we'll pay for 50% of the expenses, and they have taken a portfolio decision that's up to them. And as Tahi already said, I think actually needs to comment on that probably further.\n\nBut we are pretty enthusiastic about what we see preclinically and early clinically, and we will tell you more once we have analyzed all the data.\n\nOperator\n\nAnd our next question comes from the line of James Gordon at J.P. Morgan.\n\nJames Gordon -- J.P. Morgan -- Analyst\n\nIt's James Gordon. One question on CD40x4-1BB programs. So increasing investment. Could we read out that you're more excited or more prioritizing in CD40x4-1BB as the PD-L1 4-1BB because I only heard about increased spend behind one of them? And can you broadly break down how much of the extra spend on epco versus the 4-1BB bispecific? So that's the first question, please.\n\nAnd the second question, grades on track to epco relapsed/refractory DLBCL. But can you just remind where are we on relapsed/refractory FL time lines? What's your base case and when you might be able to further?\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, James, for the questions. So actually, for CD40x4-1BB, we are very excited about that molecule. And we are expanding the number of trials. It's another Phase I/II trial, where we tested in combination with radiotherapy with or without pembro, so we are very excited about that molecule as we already said before, James.\n\nI think as it relates to the expense on this program versus ofatumumab, I will ask Anthony Pagano to comment on that in a sec. But maybe I can first ask you that on the FL time lines. I think quite precisely where we are with the B-cell lymphoma. Maybe you can give -- gain some color on that.\n\nJudith Klimovsky -- Chief Development Officer\n\nSo as you know, for follicular lymphoma in addition to enrolling the patients, the median follow-up needs to be a little bit longer given the nature of the disease. So we are assessing actively this median follow-up to have a more clear picture on when the filing would be possible. So we will -- when we are ready to disclose, we will. But as you understand the thesis different, so it needs a different follow-up time.\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Judith. And then maybe Anthony Pagano, maybe you can give James a bit of color on the epco spend versus the CD40x4-1BB extra spend because we're starting new activities. Let's see what you're willing to share here with James.\n\nAnthony Pagano -- Chief Financial Officer\n\nYes. Thanks, James. Yes, I guess maybe sort of like step back and think about it. Overall, we see a nice increase in overall progression of our pipeline.\n\nAnd then that translates into the increased investment, as you would have seen, we've increased our R&D investment roughly speaking from DKK 1.8 billion in H1 of last year, up to DKK 2.4 billion this year. And I would say the two biggest drivers, if I look at that DKK 66 million increase, the two biggest drivers are going to be epcurtimab and then the build-out of the team really supporting the overall progression of our research activities and progression of our clinical development pipeline and assorted manufacturing activity. So as you just probably heard, the two biggest drivers are epco and build out of the team. So then obviously, CD40 4-1BB would rank behind that, I would say, it ranks behind certainly epcoritamab by a fair margin at this point.\n\nAgain, you shouldn't read anything into this other than where we're at in the overall stage of the development of the program.\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Anthony. Thanks, Jain, for the questions.\n\nOperator\n\nAnd our next question comes from the line of Michael Schmidt at Guggenheim Securities.\n\nPaul Jeng -- Guggenheim Securities -- Analyst\n\nThis is Paul on for Michael. Just a few on your recent expanded partnership with BioNTech. I guess, first, was there anything that was observed in your ongoing clinical HexaBody programs or partner with DuoBody program that sort of trigger this deal? And then are there any preset number of monospecific candidates that you plan to nominate under the collaboration? And then lastly, any additional color on how the HexaBody platform might position you to address the CD27 target?\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Paul. Good questions. We are very excited about the BioNTech partnership. We are working on a number of programs.\n\nSo there are already candidates selected for HexaBody approaches beyond the CD27. But I will ask Tahi who's actually overseeing part of that work with BioNTech to give you some further reflection and comments on your questions. Tahi?\n\nTahi Ahmadi -- Chief Medical Officer\n\nThank you, Jan. So I would try. So I would first say that the collaboration with BioNTech has been one that's been ongoing for now several years and has been an extremely fruitful collaborative collaboration. And as we have worked together on a multitude of targets and then more and more about how to better address them, and this has led now to the expansion of this collaboration to also is Hexa realization as a Genmab developed technology for certain targets that are part of our collaboration.\n\nThe first one that is going to the clinic, as Jan was saying, is CD27 maybe very clearly, and we will show that data and presented to you in the near future, have preclinical evidence that our HexaBody technology, the ability to hexamerize leads to a significantly stronger signal than a comparative antibodies, including those that are in clinical development already. And so that's where our condition comes that this could be a differentiated approach to this particular target. And obviously, that insight also translates to potential other targets. And there are, as Jan already said, other programs that are in development in this collaboration with BioNTech, which is an extremely fruitful and efficient and effective collaboration.\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Tahi. Thank you, Paul, for the questions.\n\nOperator\n\nOur next question comes from the line of Chris [Inaudible] at Morgan Stanley.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nI'm speaking on behalf of Matthew Harrison. So I have two questions. One is on epco. So what do you think are the key factors around commercialization because we have recently seen a lot of late-line DLBCL launches that have plateaued after a few quarters? So with that information, what do you think that has told you about the market potential in this particular disease? And then the second question is about the 4-1BB programs later this year.\n\nWhat bar in the lung cancer expansion cohort is enough in terms of the overall response rate or would you need to see an PFS?\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Chris. I will hand the first question over to Anthony Mancini to talk a bit about market potential of the -- of epcoritamab and the potential in commercialization there. And then the second question, probably to Judith speak a bit more about lung cancer and the bar for the 4-1BB programs. Anthony, floor is yours.\n\nAnthony Mancini -- Chief Operating Officer\n\nThanks, Jan, and thanks, Chris, for the question. Just to provide some context on the commercial potential, the initial addressable patient population in DLBCL across U.S., Europe and Japan is about 9,000 patients in late lines. It steps up quite significantly in the second-line and in the frontline. But what's really important here is just if I focus on the U.S.\n\nmarket is the site of care dynamics. And today, they're such that LBCL is largely treated in the community in the first- and second-line setting. And in later lines, although more therapies have recently become available, what we're hearing from our customers is that there's quite a large degree of dissatisfaction in that setting and the patients more often refer to a hospital or academic setting. And it's clearly driven by the fact that more effective options are only available there.\n\nWhat we also hear pretty consistently from treating clinicians is that off-the-shelf therapies that can deliver the right balance of efficacy and safety and also have the accessibility of an off-the-shelf subcu administration, if those types of therapies were available that they would continue to treat these patients in the later line settings in the community. And frankly, a large portion of potential patients that are referred do not get the therapies that they're hoping to get it in an academic setting. So we still think that epcoritamab offers the potential to have -- to be best-in-class and to have the right balance of efficacy and safety. That's certainly what we've observed thus far.\n\nAnd with the accessibility of a subcu administration, we still see meaningful potential opportunities in the long-term, not just in the late line settings, but particularly as we continue to explore in earlier lines and across B-cell malignancies. So I think I'll leave it at that, Chris.\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Anthony. Then maybe, Judith, maybe you can say a bit more about the bar and lung cancer after checkpoint inhibitors, if you are able to do that for the 4-1BB programs.\n\nJudith Klimovsky -- Chief Development Officer\n\nYes. So I think that the question is alluding the study 04 for 1046, which is a study as Jan mentioned in second-line non-small cell lung cancer after patients failed or exhausted checkpoint inhibitors and doublet chemo. So let's start with the unmet medical need. As checkpoint plus chemo are moving to the firstline for most of the patients or sequential on some, there is a huge unmet medical need for patients that exhaust these main options.\n\nIn that value population is the data we presented at SITC and not last year, but the prior one, where 1046 as the single agent leads on ORR of 17% in a short-lasting mostly, but an ORR of 17%. There are in that setting is very low. Patients are treated with docetaxel, usually, if they can tolerate. And as we know, other IOs try that space with no activity or single-digit activity at the most.\n\nSo this is the study that we are now doing with 1046 in combination with pembro or as a single agent. And the bar is driven by response rate -- but of course the durability as well because what we want is improved survival and for that should be durable. So I won't give you the bar, but you can -- it's huge and maybe can very poorly served with the current option with the paclitaxel. And the bar for other small studies, more current contemporaneous data on paclitaxel is in the single-digit order.\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Judith. Thanks, Chris, for the questions.\n\nOperator\n\nAnd the next question comes from the line of Yaron Werber at Cowen.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nThis is Gena on for Yaron. I actually have a few questions on Darzalex. So given the previous Cassiopeia data showing that Darzalex maintenance improved PFS over observation, do you think that Darzalex actually going to become a key component of maintenance therapy as well and also along those lines, what your expected time line for initial data from the Auriga trial? Secondly, I feel like you're also testing Darzalex in newly diagnosed multiple myeloma as part of the VRD quadruple and trans-eligible and non-eligible myeloma patients? Could you give some guidance as to when we could see that data from specialist and Perseus?\n\nJan van de Winkel -- Chief Executive Officer\n\nThank you for the question, Gena. And I will ask Tahi to give perspective on -- give any perspective and answer on both of your questions. Tahi?\n\nTahi Ahmadi -- Chief Medical Officer\n\nWell, I would say some of those questions, but I'll probably better asked to J&J, OK, because they are in charge of these studies, so they have a better sense on the time lines of when they are suspected to read out, particularly for the VRd combinations trial, which are conducted by answer. So I'm not sure we're in a position to comment on timelines there. But in principle, I think you're right that as I've shown across the multiple of studies in different studies that is a drug that in myeloma setting when given continuously until progression does have an impact on PFS and actually also on OS certainly some of the data predicted being on [Inaudible].\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Tahi. But I can say is that well, in Ct.gov, you could see that the CEPHEUS Phase 3 trial, which, of course, is even driven that has an estimated completion date of September 22. So that's probably where we need to leave it that. And then further information needs to come from our partner Janssen, as Tahi has already said.\n\nOperator\n\nThe next question comes from the line of Elizabeth Walton at Credit Suisse.\n\nElizabeth Walton -- Credit Suisse -- Analyst\n\nI just have a couple of questions left. Firstly, one on costs. I'm curious, if you can provide us any color on the relative spend to SG&A and R&D. We saw a meaningful step-up in your SG&A spending this quarter versus expectations.\n\nHow should we think about that going forward? Is there much more that needs to be done to prep for epco? And then secondly, on Darzalex. Curious on your view on the conversion rate from the intravenous to the subcutaneous formulation. J&J told us in their results, it's about 85% some companies in the U.S. and 80% in Europe.\n\nHow does that track versus your internal expectations?\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Elizabeth, for the questions. I propose that the cost question goes to Anthony Pagano and that's the -- and that Anthony Mancini gives us a bit of perspective on how we think about IV to a subcu conversion as we see it not only in the States, but also outside of the States. And maybe Anthony Pagano can start.\n\nAnthony Pagano -- Chief Financial Officer\n\nSure. Happy to do so. Thanks for the question, Elizabeth. Yes, you're right.\n\nAs our business evolves, we're grounded in investing for what makes sense for Genmab, right? So historically, think about it, everything was going into R&D. And as we got closer to the filing last year and then the launch of Tivdak, obviously, we ramped up that investment in a very focused way together with our partner. So what you're seeing now for Tivdak in particular, whereas in H1 last year, you wouldn't have had a ton of cost for Tivdak and H1, I would say a fully loaded, let's call it, cost structure for Tivdak in our H1 P&L. And that will continue moving forward in the second half of this year and also into 2023.\n\nNow for epco, I would say beginning of last year, getting into H1 this year, we've started launch readiness activities for epcoritamab in earnest. And now following the positive readout of data that we saw in April and now with the -- our announcement of the intent to file, particularly in the U.S., we have to invest for success here. So we are starting to ramp up, as you've just alluded to, our investment in SG&A in H1, and that will continue here in the back half of next year and also into next year. But again, a really focused and disciplined way here to make sure that we really are well positioned to let epcoritamab shine in the marketplace, should it be approved.\n\nAnd I think just something wrapping this all together, just with the overall expansion of our really exciting clinical pipeline and the two commercial drivers that I just highlighted, there is an increase in need to invest in systems, whether it be CRM, ERP, enhanced compliance functions is really round out and make sure that Genmab as a whole is really well positioned to support the growth and manage risk appropriately along the way. Hopefully, Elizabeth, that gives you a little bit of color. And I think Anthony Mancini can take on the other question.\n\nAnthony Mancini -- Chief Operating Officer\n\nYes. Thanks, Anthony, and thanks to Elizabeth for the question on conversion rate. The way we think about it is that really the availability of the subcutaneous formulation in around the world really was a clear driver of strong share performance. And as J&J outlined on their call, it accounts for over 80% in terms of usage, in terms of weekly gross sales in the U.S.\n\nand around 80% in Europe. And what I would say is that it's largely in line with our expectations. I think where we continue to applaud Janssen's execution in Europe and rest of world, in particular, is the rapid availability and access to the subcu formulation has really driven frontline in particular, share gain. So if I just contextualize that a little bit, the overall share gains are impressive in both the EU5 and in the U.S.\n\nSo just looking at IQVIA brand impact data ending at the end of the quarter, there was about a 6% absolute overall share gain in the U.S., about a 13% absolute share gain in the EU5. But when we look at the frontline share, we saw an absolute share gain in the U.S. of 12%, which is impressive, but an even more impressive 22% improvement in share points in this new frontline setting in the EU5. So we think that's driven by strong execution resonance to the overall survival benefit and the availability of subcu, which, as you know well, leads to facilitate earlier usage due to its convenience, efficacy being the same as IV and of course, the safety benefits and convenience benefits that exist.\n\nSo hopefully, that covers that.\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Anthony. Thanks, Anthony and Elizabeth. Let's go on the next question.\n\nOperator\n\nThat's from the line of Zoe Karamanoli of RBC Capital markets.\n\nZoe Karamanoli -- RBC Capital Markets -- Analyst\n\nSo I'd like to ask a question on epco commercialization in a different way, if I may. So from the discussions you have with physicians so far, how they view the data for epco and in particular, how it compares versus [Inaudible] from Roche? And the latest data you shared that we have points to a slightly better safety and efficacy for epco. So I'm just keen to understand whether this is something you hear from physicians or at this point in time? Or perhaps both drugs at this point are give more or less comparable? And my second question is, I noticed on ClinicalTrials.gov that you have initiated a Phase 2 safety study for epco. And is there something you need to have in place before you submit to the BLA application? Is it to support or strengthen the data? Or there's a safety concern here? I'm just wondering of the rationale for this.\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Zoe, for the questions. I propose that definitely Judith will speak a bit more about epco versus [Inaudible] and also the trial, the safety trial in the context of the filing and the route forward for epco. But maybe, Anthony Mancini, you can also give some perspective on commercialization, so we want to hear of epco versus other CD3/CD20 bispecifics. Anthony?\n\nAnthony Mancini -- Chief Operating Officer\n\nZoe, do you want me to start? OK. But look, I think in line with what I said earlier in terms of what we're hearing from clinicians is the desire to treat these patients. And we believe based on the data that we've seen the LBCL cohort of the epco and NHL-1 study, which were shared at the EHA Presidential show that really epco now offers a balance between efficacy, safety and the accessibility of subcu administration. And what we're hearing from clinicians is that, that matters.\n\nSo we feel we will have -- that there are differences between the agents, and we're looking forward to have the opportunity to showcase those going forward. So maybe I'll pass it to Judith for the other comparators.\n\nJudith Klimovsky -- Chief Development Officer\n\nThank you, Anthony. So a cross-study comparisons are limited by the different natures of the populations enrolled. Although you might have similar eligibility criteria, there are nuances that can impact the results. For example, when you see the glofi, it seems the same population.\n\nHowever, the median lines of treatment with epco is 3.5 versus 3. The transform follicular population, super difficult to treat is 29% for epco and 17% for glofi and so on so forth. So you see difference. So you cannot compare because you will be doing by a comparisons influenced by factors that you don't control.\n\nHaving said that, when we put vis-a-vis the data on epco vis-a-vis glofi and some other merchant data, we see that numerically, there is a trend for better efficacy, better safety and last but not least, advantage of subcutaneous and there's a need of inotuzumab or any preparation for the patient. So as the whole package, we see that is very robust to support the whole value proposition for epco. And I mean a testament -- I mean, I am a development person, but I'm telling you when studies enroll fast, it's a good signal of the belief or confidence in an investigational agent. And as you see -- as you have seen, our program progressed, you can guess that enrollment has been -- we had the support of the medical community for enrollment.\n\nThis is with regard to comparative data. With regard to the outpatient care is further request, is some data that we wanted to generate, to give more -- to have this data to help the community centers or every physician that want to have potentially when it's approved, prescribe epco that we have the whole state of data and information to help data, help physicians understand how to use the drug. So this is the reason, it's a very nice study, which is exploring epco in a fully outpatient basis.\n\nJan van de Winkel -- Chief Executive Officer\n\nThank you, Judith. Thanks, Zoe, for the questions -- excellent questions. Let's move on to the next one.\n\nOperator\n\nWe have time for one further question. That's from the line of Etzer Darout of BMO Capital Markets.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nThis is Luke [Inaudible] on for Etzer Darout. I guess on the GEN1053 asset with BioNTech, you said that you're going to be looking at solid tumors. Do you have any more clarity on that? Like, are there specific indications that you're going for? Or are you going for any tumor-agnostic approach?\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks for the questions, Luke. Tahi, can you -- are you willing to provide some further color on that?\n\nTahi Ahmadi -- Chief Medical Officer\n\nSure. So I mean, what I would say to the question is the first question that we need to address in our first in human trial will be the biology CD27. That's essentially a tumor-agnostic biology. And then we can, in the next subsequent session identify the opportunity, which may not necessarily be only restricted to solid tumors, if indeed, we initially biology that we have preclinically seen on the CD27 biology particularly the increase of CdA T-cells to make alignments and the activations are.\n\nThen we can have our second step questions around what is the profit setting for interrogating, that particular biology is or in what combination.\n\nJan van de Winkel -- Chief Executive Officer\n\nThanks, Tahi. I think, operator, I think we lost them.\n\nOperator\n\nHis line is still open. He might have muted himself.\n\nJan van de Winkel -- Chief Executive Officer\n\nAll right. Thank you very much for the question. Operator, back to you.\n\nOperator\n\nAs we have run out of time for questions, I'll hand back to the speakers for any closing comments.\n\nJan van de Winkel -- Chief Executive Officer\n\nSo thank you for calling in today to discuss Genmab's financial results for the first half of 2022. And if you have any additional questions, please reach out to our Investor Relations team. We hope you all stay safe, remain healthy and very much look forward to speaking with you all again soon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJan van de Winkel -- Chief Executive Officer\n\nAnthony Pagano -- Chief Financial Officer\n\nWimal Kapadia -- Bernstein -- Analyst\n\nJonathan Chang -- SVB Securities -- Analyst\n\nJudith Klimovsky -- Chief Development Officer\n\nSachin Jain -- Bank of America Merrill Lynch -- Analyst\n\nTahi Ahmadi -- Chief Medical Officer\n\nAsthika Goonewardene -- Truist Securities -- Analyst\n\nJames Gordon -- J.P. Morgan -- Analyst\n\nPaul Jeng -- Guggenheim Securities -- Analyst\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nAnthony Mancini -- Chief Operating Officer\n\nElizabeth Walton -- Credit Suisse -- Analyst\n\nZoe Karamanoli -- RBC Capital Markets -- Analyst\n\nMore GMAB analysis\n\nAll earnings call transcripts"
}