{
  "companyName": "Walmart Inc.",
  "companyTicker": "WMT",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/15/walmart-inc-wmt-q3-2023-earnings-call-transcript/",
  "content": "Walmart Inc. (WMT -0.25%)\nQ3 2023 Earnings Call\nNov 15, 2022, 8:00 a.m. ET\n\nOperator\n\nGreetings. Welcome to Walmart's fiscal year 2023 third quarter earnings call. [Operator instructions] The question-and-answer session will follow the formal presentation. [Operator instructions] Please note, this conference is being recorded.\n\nI'll now turn the conference over to Steph Wissink, senior vice president, investor relations. Steph, you may begin.\n\nSteph Wissink -- Senior Vice President, Investor Relations\n\nThank you. Welcome to Walmart's third quarter fiscal 2023 earnings call. I'm joined by members of our executive team, including Doug McMillon, Walmart's president and CEO; John David Rainey, executive vice president and chief financial officer; John Furner, president and CEO of Walmart U.S.; Judith McKenna, president and CEO of Walmart International; and Kath McLay, president and CEO of Sam's Club. In a few moments, Doug and John David will provide you an update on the business and discuss third quarter results.\n\nThat will be followed by our question-and-answer session. Before I turn the call over to Doug, let me remind you that today's call is being recorded and will include forward-looking statements. These statements are subject to risks and uncertainties that could cause actual results to differ materially from these statements. These risks and uncertainties include, but are not limited to, the factors identified in our filings with the SEC.\n\nPlease review our press release and accompanying slide presentation for cautionary statement regarding forward-looking statements, as well as our entire safe harbor statement and non-GAAP reconciliations on our website at stock.walmart.com. It is now my pleasure to turn the call over to Doug McMillon.\n\nDoug McMillon -- Chief Executive Officer\n\nGood morning, everyone, and thanks for joining us to discuss our results for the third quarter. Let me highlight what you'll hear from us this morning. First, it was a good quarter. We delivered strong results on the top line across our segments and our value proposition is resonating with customers and members around the world.\n\nWe see this in our grocery business, in stores and online, in key markets like the U.S. and Mexico. Customers that came to us less frequently in the past are now shopping with us more often, including higher-income customers. Second, we're being thoughtful and balanced about inventory levels by category and expenses as we work through the fourth quarter and position ourselves for next year.\n\nThere are places where we remain aggressive and others where we're being more conservative. Third, while we prioritize retail fundamentals, we're also connecting and scaling newer, naturally related capabilities to our larger business so they become mutually reinforcing. Marketplace, fulfillment services, and advertising are examples. As it relates to the third quarter, it began with top-line momentum from the back-to-school season in the U.S.\n\nand Mexico, and that continued through festivals in India, China, and through early deals for days events in the U.S. Walmex had a great quarter and so did Sam's Club in the U.S. as we continued our string of double-digit comp club sales growth. Kath and the team at Sam's had run double-digit comps for almost three years.\n\nWe like the way those numbers compound. As a total company, we're seeing strength in stores, clubs, and e-commerce. Transactions are positive and our penetration of e-commerce sales continues to climb. So far, this year, 13% of our total sales as a company now start in a digital fashion.\n\nAnd that's led by Walmart International, which is already at 20%. With the cost of everyday items still stubbornly high in too many categories, more customers and members are choosing us for the value and assortment we're known for and the responding to the changes we made to save them time. With this in mind, we're focusing on earning repeat business from customers who are now shopping with us more frequently than before. For example, a strong presentation throughout fresh and apparel are priorities, along with executing pickup and delivery to create a delightful experience that saves them time.\n\nAnd in the case of Walmart U.S., it also means selling more Walmart Plus memberships. As more people look to us for value, we want them to see that the experience of shopping with us is also compelling due to the new capabilities we developed. Our app experiences around the world are a place where we introduce these newer capabilities. As our app becomes more a part of daily life for our customers and members, they find that they can do so much with it, like easily build a shopping cart, schedule a time to pick up an order or have it delivered when it's convenient for them, skip the line with scan & go, or find an item in their local store.\n\nAs you would expect, we're helping families stretch their dollars as we head into the holidays. The Walmart U.S. team has set the retail prices for a typical Thanksgiving meal the same as last year. We're removing inflation on a basket of traditional Thanksgiving food items, including whole turkeys for under a dollar per pound.\n\nThe members' dollars are going further at Sam's Club, too, with racks of lamb and lobster tails priced more than 40% lower than last year. We're also making the everyday shopping trip better by lowering the price of the cafe hotdog combo by nearly 10% to $1.38. Around the world, our teams have this type of mindset. In Mexico, we've widened the price gaps in our popular Bodega format by 100 basis points this year.\n\nIt's incredible value at a time when customers need it most. We're finding creative ways to relieve pressure for families across our merchandise categories and countries. I'm proud of how our associates continue to step up. We're grateful for how they've navigated our inventory challenges this year and continued to prioritize the customer and member experience while doing so.\n\nDuring my store club and DC visits, they inspire me by the way they work together, the way they serve others, and how they're embracing change and contributing ideas to improve our business. Looking ahead, we updated our outlook for the year on results from Q3. Yet, we remained balanced in our approach to the rest of Q4 and next year. Inflation is being especially stubborn in some categories like dry grocery.\n\nLiving with high prices through this year has a cumulative impact on our customers, especially for those that are most budget conscious. And so, we're focused on bringing our costs and prices down as quickly as possible by item and category. Regardless of income levels, families are more price conscious now, so it's as important as ever that we earn their trust with value. In just a minute, John David will share more about the guidance we gave this morning.\n\nWe're working to position ourselves to succeed regardless of demand levels through value and the experience we offer and the way we're positioning inventory and expenses. We're into the details, business by business. This is not a time to paint with a broad brush. We're focused on the things we can control.\n\nWe delivered good expense leverage during the quarter across our segments. Strong sales growth helps, but we're also doing a good job of managing costs, and we're doing it in a sustainable way. We can keep costs in line and continue to invest in our people and technology, including supply chain automation, and continue to deliver value for customers, members, and shareholders. We've made good progress to improve our inventory position.\n\nGlobally, inventory is up 13% for the quarter, including 12.4% for Walmart U.S. and 2.5% for international. Inflation drives the majority of the increase rather than units. In-stock on replenishable items and active management of seasonal item quantities and sell-throughs are the priorities.\n\nWe expect this progress to continue through the fourth quarter and that we'll end the year in even better shape. Our merchants have taken an item-by-item, category-by-category approach to match inventory with demand. We've worked through a unique period in history as we chased inventory in 2020 and 2021 and were too heavy in some general merchandise categories this year. Given where inflation remains and that economic uncertainty seems higher than normal, the quantity choice our merchants make is even more crucial than in a more normal time back when there was such a thing as a more normal time.\n\nWe can be more aggressive on shorter lead time items like food and consumables, but we're especially sensitive to quantity decisions on longer lead time items that are imported. We're thankful to have so many experienced and talented merchants. They've accomplished a lot these past few quarters. Just like John, Kath, Judith, and the rest of the team have done, they've demonstrated good judgment and a lot of hustle.\n\nOur flywheel continues to take shape. We're scaling our newer businesses and connecting them to our larger, established retail businesses, primarily by how we design digital interactions. One example is how our growth in e-commerce, especially the marketplace, fuels our ad business. More items and sellers drive GMV and improve customer satisfaction.\n\nAnd it also drives success in advertising. They're mutually reinforcing. If we double-click on advertising with Walmart Connect in the U.S., we see it's benefiting from growth in e-commerce and from improvements made within the business itself. And we've seen strong growth in return on ad spend over last year.\n\nIn turn, this helped drive the highest ad spend all year for sponsored search in Q3. These improvements underscore Connect's strengths and position the business for continued growth. We also continue to see strong growth with Flipkart Ads in India. Like much of what we're doing, advertising is working for us globally because we have something unique to offer media buyers, and these businesses create momentum for each other.\n\nAs with advertising, growing our marketplace business also unlocks fulfillment services opportunities through both fulfillment centers and last-mile delivery. We're scaling these businesses in the U.S., and we're starting to ramp up in Mexico and Canada. The team in Mexico increased the number of sellers on our marketplace by 20% during the quarter. In the U.S., the marketplace on Walmart.com now offers about 370 million SKUs.\n\nThat's an increase of more than 50% from Q2. Many of these sellers want to leverage our fulfillment network. They also want to use our advertising capabilities to drive demand, and we're making that easier for them. We recently shared that all new marketplace sellers in the U.S.\n\nwill be automatically onboarded onto our self-service ad platform. We believe this seamless integration will help both businesses scale even faster. What you see in our results is that we can run compelling stores and clubs, scale of first- and third-party e-commerce business, and connect them together in an omnichannel fashion that saves customers and members money and time. Our strategy unlocks growth opportunities for us and a thread that runs from digital retail to fulfillment and advertising, and opens up even more opportunities with health and wellness and financial services.\n\nThis quarter demonstrates, again, that we can navigate short-term challenges and build for the long term simultaneously. It's been my experience over all these years that Walmart is a well-positioned business and is inherently hedged. When times are good, we have room to grow. When things are more difficult, we sell things people want and need at a value and in ways they want to shop.\n\nAnd with new levers for growth across our flywheel, we're becoming even stronger and more resilient. I'll close today by saying thank you for your interest in our company. We like the momentum we are creating in our business, and we recognize the need for a balanced approach in the near term given the continued strains on our customers and members. Our team is focused and alert.\n\nHappy holidays, everybody. Here's John David.\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nThanks, Doug. I'd like to start by thanking our customers, associates, and partners for helping us deliver a strong quarter. I will focus my comments on the themes Doug mentioned. First, our sales momentum and share gains.\n\nSecond, operational actions we're taking to improve inventory and supply chain. Third, progress we're making to further connect our alternative value streams to our core business. And lastly, our guidance for the balance of the year. Our Q3 results exceeded our expectations due to sales upside, with operating expense leverage across all three business segments.\n\nWhile we're encouraged by our position and our confidence in our business remains high, the macro backdrop remains challenging as persistent inflation is impacting the consumer and our business. As I discuss our results, it's important to note the charges related to the opioid legal settlement framework affect year-over-year comparisons, so my comments regarding Q3 results will focus on the business, excluding adjusted items. Total constant currency revenue grew 9.8% as our omni model and strong value proposition continue to resonate with customers during this period abroad inflationary pressures. Each of our segments delivered strong sales results.\n\nWalmart U.S. comp sales accelerated sequentially to 8.2% growth, with increases in average ticket size, as well as transactions. Constant currency sales in Walmart International were strong, up 13.3%, led by Flipkart and Walmex, while Sam's Club U.S. delivered its 11th consecutive quarter of double-digit comps with growth of 10.3%, excluding fuel and tobacco.\n\nOur purpose of saving people money has never been more important as inflation remains consistently high. High fuel prices and mid-teens food inflation have forced consumers to manage household budgets more tightly, making frequent trade-offs and biasing spending toward everyday essentials. We continue to manage pricing in a way that preserves our price gaps while gaining market share profitably. Walmart is well positioned to serve customers and gain greater trip frequency during tougher economic periods, and we have even more tools to do so in this cycle.\n\nFor example, we've continued to gain grocery market share from households across income demographics, with nearly three-quarters of the share gain coming from those exceeding $100,000 in annual income. This quarter, our private brand penetration in food categories increased about 130 basis points, reflecting customers increased focus on quality products at value prices. We observed incremental trade down in categories, including proteins, baking goods, baby and dog food. We're working hard to keep prices low and help ease the burden to make customers lives better.\n\nThis includes working with vendors to reduce product cost and minimize inflation impacts on final goods pricing. Consolidated gross margin rate decreased 89 basis points. More than half of the decline was due to markdowns and sales mix in the U.S. The remaining headwind reflects a $113 million LIFO charge at Sam's Club due to inflation and the timing of sales events in international, including Flipkart's Big Billion Days.\n\nNotably, the rate of decline in gross margin improved from 2Q as inventory remediation efforts are progressing. We've been very targeted in reducing certain categories of inventory in our system, and our actions included canceling orders and increasing the level of markdowns. The team has done a really good job addressing our inventory situation as reflected by Q3 inventory being up only 13% versus last year, including 12.4% growth in Walmart U.S. In aggregate, this level represents a more than 10-percentage-point improvement versus the end of Q2.\n\nNotably, about 70% of the year-over-year increase relates to inflation. We feel good about our ability to sell through the majority of this in Q4 and expect continued year-over-year improvement even when including the effects of inflation. We saw stronger expense leverage this quarter as selling, general, and administrative expenses leveraged 75 basis points due primarily to higher sales and lower COVID costs. We're focused on what we can control and continue to work down inventory levels and manage general and administrative expenses tightly.\n\nTaking all this together, adjusted operating income on a constant currency basis increased 4.6%. GAAP EPS was a loss of $0.66, but adjusted EPS was $1.50. The difference between adjusted and GAAP EPS reflects a $1.11 impact from unrealized losses on equity investments, primarily JD.com, and $1.05 charge related to the opioid litigation settlement framework. We're pleased that our adjusted EPS outperformed the guidance we provided in August due primarily to better operating expense leverage on higher sales across the business.\n\nOperating cash flow for the year-to-date period decreased $600 million to $15.7 billion, primarily due to the timing of certain payments and a decrease in operating income, partially offset by moderated inventory purchases. During the quarter, we returned $4.5 billion to shareholders through dividend and share repurchases. We're committed to continuing to provide strong cash returns to shareholders while still appropriately investing in our business for the long term. And our board has just approved a new $20 billion share repurchase authorization that we expect to utilize over the next several years.\n\nLet me briefly reference key highlights by segment. For Walmart U.S., comp sales momentum accelerated in Q3 with a two-year stack of 17.4%, up 570 basis points from Q2. Monthly sales gains were relatively consistent throughout the quarter. Food sales continued to lead with mid-teens growth.\n\nWe're particularly encouraged to see year-over-year growth in food units sold after experiencing a slight decline last quarter. We also continue to make good progress on improving in-stock levels in our grocery business despite the heavy volumes we're experiencing. Inflation remained high at mid-teens percentage in food categories, reflecting an 80-basis-point step up compared to levels at the end of Q2. We've seen incremental levels of inflation month over month be less significant, but it's not clear if this represents a sustainable trend.\n\nHowever, we believe our strong price positioning is contributing to share gains as we attract value-seeking customers across the household income spectrum. General merchandise sales declined low single digits, with softness in electronics, home, and apparel. E-commerce accelerated sequentially to 16% growth, even as store transactions continued to grow. We experienced strength in pickup and delivery from stores, marketplace, fulfillment services, and advertising.\n\nGross profit rate decreased 77 basis points due primarily to higher markdowns and product mix headwinds. But the team delivered strong SG&A expenses leverage of 60 basis points, reflecting higher sales and lower COVID cost. As a result, we deliver better-than-expected operating income growth of nearly 5%. Walmart International delivered strong sales results, with sales up 13.3% in constant currency, despite continued macro headwinds.\n\nE-commerce sales on a constant currency basis were exceptionally strong, up 46% in the quarter. The earlier timing of Flipkart's Big Billion Days event was also a benefit to sales results. Currency negatively affected reported sales results by about $1.5 billion. Each of our major markets delivered positive comp sales, led by a great quarter from Walmex, with comp sales growth of 11.7%, reflecting strong performance in Bodega stores, Sam's Clubs, and 17% growth in e-commerce.\n\nIn China, comp sales were up 5.6%, reflecting strong e-commerce growth, as well as strength at Sam's Club. E-commerce sales grew 63% and penetration reached 41% of sales. Canada comp sales increased more than 5%. And in October, we launched Walmart Fulfillment Services in Canada, where sellers of all sizes on the digital marketplace can now contract with us to take care of their inventory storage and logistics needs.\n\nThe new offering will provide faster shipping of customer orders within a two-day window to 95% of Canadians. In India, Flipkart had a great quarter, with strong customer response to our Big Billion Days event, which moved forward into Q3 this year from Q4 last year. We had over 1 billion visits to our site during the eight-day event and, importantly, saw more than 60% of those customers coming from Tier 2 and Tier 3 cities. PhonePe also continues to perform well, with annualized total payment volume, or TPV, now over $920 billion and reaching a record level of monthly transactions to about 3.6 billion.\n\nThis was the first time PhonePe had a quarter with more than 10 billion transactions. International segment operating income was better than expected and increased 3.2% in constant currency led by Walmex and China. In Sam's Club U.S., we had another strong quarter, with comp sales up more than 10%, excluding fuel and tobacco, and an increase of more than 25% on a two-year stack. Both comp transactions and average ticket increased about 5%; and e-commerce sales grew 20%, with strength in curbside orders and ship to home.\n\nMembership income was up 8%, with another record-high quarter in overall member counts and an all-time high Plus member penetration. Sam's leveraged expense is 68 basis points due primarily to higher sales. This helped offset a decline in gross profit rate due primarily to a 53-basis-point, or $113 million, inflation-related LIFO charge. For the quarter, Sam's operating income increased more than 18% with fuel and nearly 8% excluding fuel and including the impact of the LIFO charge.\n\nCombining these results with my comments about international, you can see Sam's Club is performing well around the world, and we're pleased with the leverage we see across markets, with Member's Mark as an example. As we navigate changes to our external environment, we continue to advance our strategic initiatives that were enabled by our omnichannel retail capabilities. Globally, as we're building a larger e-commerce business, we're scaling our marketplace which unlocks and strengthens our fulfillment and advertising businesses and expands the number of families that choose to be members. Across our segments, e-commerce is enabling deeper engagement with customers and members that helps drive strategic growth in our alternative value streams.\n\nNew sellers on our U.S. marketplace are contributing to our advertising growth, and we added more than 8,000 sellers in Q3. Third-party build-out helps diversify and strengthen our product assortment, which now includes more than 370 million SKUs. Strong digital advertising growth continued this quarter, increasing over 30% on a global basis, led by 40% growth in Walmart Connect in the U.S.\n\nand Flipkart Ads in India. As we focus on membership, our ability to leverage our data improves. So, we continue to sign on more customers to our data ventures offering Walmart Luminate, and the number of Walmart Plus memberships continues to grow. We gained some of these new Walmart Plus members after expanding our last-mile delivery capabilities through a fourfold increase since January and the number of pickup points serviced by the Spark Driver platform.\n\nWe're making good progress in fulfillment and automation. The Spark Driver platform now serves customers in all 50 states from more than 10,000 pickup points, with the ability to reach 84% of all U.S. households. This coverage includes a growing revenue stream from businesses utilizing Walmart GoLocal, our delivery as a service offering, that has already made over 1 million deliveries since launching last year.\n\nBuilding Walmart Fulfillment Services in the U.S., Mexico, and now also in Canada has been an important asset in growing our seller base as they seek an integrated omni sales and fulfillment solution. For example, almost 30% of orders on Walmex's marketplace are now being fulfilled using Walmart Fulfillment Services, which was launched a year ago. In September, we opened a next-gen fulfillment center in Illinois. This 1.1 million square foot facility features robotics, machine learning, and automated storage, resulting in increased productivity and a better service for our customers at faster delivery times.\n\nAnd last week, we acquired Alert Innovation as we expand our market fulfillment center build-out. MFCs are positioned inside or attached to Walmart Supercenters and use robotics and AI to fill online orders more quickly. We're putting the building blocks in place to deliver a powerful, mutually reinforcing ecosystem that not only benefits customers and partners, but also shareholders with more durable and diversified earnings streams. Turning to guidance.\n\nIn this period of macroeconomic uncertainty, we believe that we are well equipped to continue gaining market share in an environment where consumers need to stretch their dollars further. We will continue to advocate for customers and work with our supplier partners to maintain strong price gaps and deliver lower relative pricing versus competitors. We're also navigating real inflation on our own cost structure and continue to seek ways to reduce costs and improve leverage potential. With these considerations in mind, we're maintaining a balanced approach to our guidance, incorporating a cautious view on the consumer together with our confidence in our ability to execute.\n\nWe're updating fiscal year '23 guidance to reflect the Q3 upside and leading our sales and profit assumptions for Q4 unchanged. Despite a good start to Q4, our guidance assumes that the consumer could slow spending, especially in general merchandise categories, given persistent inflationary pressures in food and consumables. Our guidance provides flexibility to compete in a promotional environment, accounts for pricing action to reduce remaining excess inventory, and anticipates ongoing mix pressure. For Q4, we expect net sales growth of about 3%, including comp sales growth of about 3% for Walmart U.S., with food and consumables growth continuing to outpace general merchandise.\n\nWe expect year-over-year operating income within a range of a 1% increase to a 1% decrease. And adjusted EPS is expected to decrease 3% to 5%, including higher year-over-year tax and interest expenses. For the full year, incorporating the Q3 upside, we now expect net sales growth of about 5.5%, including comp sales growth of 5.5% for Walmart U.S. On an adjusted basis, we expect operating income to decline 6.5% to 7.5% and EPS to decline 6% to 7%.\n\nExcluding the effect of divestitures and on an adjusted basis, this would translate into net sales growth of 6.5% and a decline in operating income of 5.5% to 6.5% and a decline in EPS of 5% to 6%. Looking beyond Q4, we know some of the unanticipated costs experienced this year shouldn't repeat next year. That said, we're planning our business with the assumption that inflation remains somewhat elevated. In addition, we've had significant currency headwinds this year.\n\nBased on year-to-date results and current FX rates, we estimate a year-over-year sales headwind for this fiscal year of $4.1 billion from currency and a potential sales headwind of about $3 billion next year. Also, as we've had $236 million in LIFO charges this year at Sam's Club, we're likely to experience LIFO charges in Walmart U.S. as well next year. Based on current assumptions, these LIFO charges next year for both Walmart U.S.\n\nand Sam's Club could approximate roughly $1 billion of gross profit headwind. It's important to note that inflation, inventory levels, and additional factors that are challenging to predict will influence the aggregate amount. We're committed to providing you ongoing updates to the assumptions as we report our quarterly results. And with that, we'd be happy to take your questions.\n\nOperator\n\nThank you. We'll now be conducting a question-and-answer session. [Operator instructions] Thank you. And our first question comes from the line of Kate McShane with Goldman Sachs.\n\nPlease proceed with your questions.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nHi. Good morning. Thanks for taking our question. We wanted to focus on inventories.\n\nWe just wondered how much remains from the spring inventory, how you would describe your in-stocks for Q4 versus last year. And you also mentioned you'd be aggressive in some places when it came to inventories. Is that just in a shorter lead time categories or can it be anywhere else? Thank you.\n\nDoug McMillon -- Chief Executive Officer\n\nWe should answer that question across all three segments. But, John, why don't you go first?\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nSure. Good morning, Kate. A couple of things on inventory. You know, first, I think that the team here and the merchants' supply chain teams have done a really nice job improving the year-on-year results from second quarter into the -- into third quarter, as we said earlier, up at 12.4.\n\nThat's down from just over 26% in the second quarter. The first thing I think it's important to consider, if you look back over the quarters of the year and in Q1 when we were the highest, the majority of the extra inventory was in supply chain and part of the backlog problem. Then in the second quarter, that balanced more evenly between stores and the total. And then this quarter, at the end of Q3, what we see is an increase of 12.4, but the stores are still heavy.\n\nSo, the inventory has moved from the supply chain to a balance, and now, it's in the store. And when you look at the dollar amount, that's about 70% of it, three-fourths of it roughly is inflation. And the rest, we can approximate to pretty significant improvements in in-stock over last year. Last year, we were quite low as we see it really needed an improvement in in-stock.\n\nAnd then specifically in your last question, probably around something just under a billion -- around a billion would be what we consider excess. That's down pretty significantly about a third of where we were at the end of Q2. So, we're making improvements. Apparel and certain categories in GM are the heavy categories, and we'll continue to work through those.\n\nAnd, you know, just reminder, we said at the beginning of Q1 we needed a couple of quarters to work through the inventory, and we continue to do that. And then John David did mention in his comments earlier that there is room in our forecast to continue making progress on inventory. But I was in an import center last week and the inbound is in really good shape. The orders are in line.\n\nSo, I think the team have done a really nice job adjusting to the end of the year.\n\nJudith McKenna -- President and Chief Executive Officer, Walmart International\n\nYeah, for international, we're just 2.5% for the quarter. And while there's some helpful tailwind in that from current state, the underlying portion quota has reduced over the last three quarters, and we're in a pretty healthy shape across all of the markets around the world. Of course, there are a couple of pockets here and there that we'll continue to focus on as we go through in Q4. But I'm actually really pleased from an in-stock level because last holiday season, we definitely had areas where we were light.\n\nAnd I'm encouraged to see each market being in a good place going through to this holiday season.\n\nKath McLay -- President and Chief Executive Officer, Sam's Club\n\nYeah, and from a Sam's perspective, our inventory is up 36%. I think 50% of that increase is actually being in-stock, to your question. So, you know, as Doug and John David talked about, we've had 11 consecutive quarters of double-digit comp growth. We have been chasing in-stock for the last two and a half years.\n\nAnd we're in -- we're finally in a great position from a in-stock going into the holiday event period. So, strong in-stock is 50% of it, 30% of it is inflation, and the rest is kind of something that we did going into kind of Christmas. So, we're really happy with the quality of our inventory and are kind of leaning forward into the rest of the year.\n\nDoug McMillon -- Chief Executive Officer\n\nKate, this is Doug. Thanks for the question. I would just point out that we handle inventory and think about inventory in two different categories. The first category is replenishable merchandise, where we want to be in-stock all the time.\n\nWe -- even though we were heavy in inventory through the course of this year, so far, we did not let up on trying to get in-stock on replenishable goods and wouldn't want to do that. That second category of nonreplenishable items, which are often features. We're managing that aggressively category by category and don't want to get too conservative. There are some places where we should still play offense through this quarter and into next year.\n\nAnd then lastly, I think it was appropriate for us the last couple of quarters to break out how much inventory we wish we didn't have. That number is getting down to the point where we probably won't be talking about that going forward because we always have some inventory we don't want even in a more normal circumstance. So, we made a lot of progress. Feeling a lot better about it.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is from the line of Bob Drbul with Guggenheim. Please proceed with your questions.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nHi. Good morning. Just following up a little bit on the inventory side, a couple of things. Can you talk about sort of the vendor reception to reducing, you know, product costs that you mentioned on the call? And I guess the other piece of this is, I think it was $1 billion, you know, LIFO charge, the expectation.\n\nCan you just talk about your assumptions around inflation over the coming quarters and, you know, what the offsets are as you think about that as we proceed throughout the next year? Thanks.\n\nDoug McMillon -- Chief Executive Officer\n\nI'll take the supplier question first. We're not really changing what we've always done. We are trying to find ways with our current suppliers to get cost down, provide value to customers and members, and we're trying to be creative about it. And in some instances, some suppliers are more aggressive than others, and we welcome that.\n\nAnd we're going to try to do the best job we can category by category, item by item of getting prices down as we head through next year. That's been consistent. That's the way we always behave. And there's not really anything different as it relates to that.\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nSure, Bob. This is John David. I'll take the LIFO aspect of your question. First, I'd say that the core business is continuing to perform pretty well in the face of a difficult macroenvironment, but we do have headwinds next year, as we called out, both currency, as well as the LIFO charge.\n\nThe LIFO charge is a result of the inflationary environment that we're in, and it's heavily dependent upon what our inflation and inventory assumptions are next year. For planning purposes, we're basically assuming that prices stay where they are. The result on a year-over-year basis from an inflation perspective would be a little north of 3%, so a little greater than 3%. And, you know, to the extent that that changes, that affects that billion-dollar estimate.\n\nBut I think it's important to note that to the extent that we get back to a deflationary retail cost environment, this billion-dollar headwind actually reverses out as a benefit in latter periods.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nOur next question is from the line of Robby Ohmes with Bank of America. Please proceed with your question.\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nHey, good morning. You know, great quarter. Just, actually, I had two questions. One, just a follow-up.\n\nI think, Doug, you might have mentioned a strong start to the fourth quarter. The -- you know, the others have sort of mentioned, you know, maybe a slower start to the holiday shopping season because of the [Inaudible] last year. And I was just curious if you could, you know, give any color on if you're seeing any of that kind of behavior. And then my second question, just a separate question was just, you know, private label was called out.\n\nCould you all remind us, you know, the private label capabilities at Walmart U.S. and, you know, how much that could grow from here?\n\nDoug McMillon -- Chief Executive Officer\n\nAs it relates to the strong start, Robby, this is Doug, and then I'll toss it to John. It's -- the quarter has just started. And as John David said in his remarks, we're trying to build in some conservatism. I think the fact that we're strong in food and consumables is relevant here.\n\nAnd we mentioned that, you know, annual event activity that we've experienced so far is in the range of what we would expect generally. So, it's just early days. We'll see how the rest of quarter goes.\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nGood morning, Robby. Let me talk about private brand, but more broadly, first, we want to be positioned for customers whatever they want, whenever they want it between the stores, pickup, delivery, e-commerce, Walmart InHome. We're prepared and positioned well to serve a variety of customers, and that would include merchandise strategies like private brand. And we've been pretty open over the years that we don't necessarily manage private brand to specific target, but what we do in private brand is develop great quality items and great values.\n\nAnd then we are there for customers in whatever situation that they're in. And we've seen some customers this year trade in into private brands more than they did in the previous year. That's not necessarily true of all customers. Customers shop differently, depending on the position that they're in.\n\nAnd one of the things John David said that's important is a large percentage, the majority of our share gains in the last quarter have come from high-end customers. So, we want to be ready to serve customers with great quality, great value private brand items. We also want to be able to serve customers well with premium items, and we definitely see that in channels like e-commerce and pickup.\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question comes from the line of Corey Tarlowe with Jefferies. Please proceed with your question.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nHi, good morning and congratulations on the strong quarter. And thank you for taking my questions. So, I have a two-part question. First on international for Judith and second on Sam's Club for Kath.\n\nSo, firstly, on international, net sales were up a strong 13%. I know you highlighted Flipkart. But can you further unpack what drove that growth and what you see driving continued success in this segment ahead? And then secondly, on Sam's Club, I believe the company has driven close to 11 consecutive quarters of double-digit comp growth or close to three years. What do you attribute this continued and consistent growth to and how should we be thinking about this momentum as we head into holiday and next year? And then could you also touch a little bit on how you're seeing memberships trend? I know you mentioned that there's an uptick there that continues to be strong and as memberships are reaching record levels.\n\nJudith McKenna -- President and Chief Executive Officer, Walmart International\n\nYeah. Let me start with the international business, and thank you for the question. Yes, we saw a really strong quarter for international at 13% and sales growth was encouraging. The real stories in here are that we are really starting to see the benefits of the diversification and portfolio work that we did over the last few years.\n\nThat's led us to being able to focus where it matters across the international portfolio. And I'm definitely seeing the benefit of that as we look across the last couple of quarters of growth and profitability that we've seen. For the quarter specifically, maybe two markets to call out. We called out Flipkart.\n\nBut to give you a little bit of color on that, the Big Billion Days event fell in Q3 for this year. It was in Q4 last year. That created some kind of differences in our results between Q3 and Q4, which we've called out. But that is an event which is designed to try to bring new customers on board for Flipkart, and it looks to have been successful in doing that again.\n\nA billion visits over the eight days of the event shows you the amount of traffic that that generates, and those customers shopping, many of them for the first time. So, Flipkart continues to meet our expectations, and we've been pleased with that quarter. The other market I would call out is Mexico. So, a really strong result from Mexico.\n\nThey saw double-digit sales growth and strong profit growth as well. What's really encouraging there is not only that focus on that core business, but equally the focus that they're having on building out solutions for customers across that ecosystem. So, their Cashi payments business, their BAIT telecom business, their emerging healthcare businesses are all helping drive that customer connectivity back into the business. And they're proving to be a real powerhouse for the international segment.\n\nAcross the other markets, maybe the only other market that I would highlight is China, which leads the way from an e-commerce perspective. So, our e-commerce penetration for the quarter was 23%. But we also saw in China a 41% e-commerce penetration. And we're learning a lot from that market about how to deal with those kind of volumes of deliveries and e-commerce, as well in Sam's Club and is a real great format, therefore, as in sharing much of the private brand and much of the innovation at Sam's Club in the U.S.\n\nis bringing through. I think it is that focus on the core business, making sure the omnichannel capabilities around the world are strong and also in looking at how we can make sure that we build out these ecosystems, which are mutually reinforcing, is what will help drive us for the future, too.\n\nKath McLay -- President and Chief Executive Officer, Sam's Club\n\nAnd thank you for the question about Sam's growth. I think, you know, we have a pretty simple flywheel that's been sitting at the heart of driving the growth over the last three years. And it all starts with creating a member-obsessed culture. If you do that, you can't help but create items and services that members love.\n\nIf you create items members love, you can buy deep and get cost advantages that you pass on to the member. And if you have great items at attractive prices and you open up the channels of access like Judith talked about, then you can't help but drive membership income. And as we've driven that, we've been able to take some of the funds back and invest it in our associates, who then help create this member-obsessed culture. And that is the flywheel that's just been fueling the 11 quarters of double-digit comp.\n\nI think, you know, as I -- as you kind of look at that, you can also see our membership income has been up kind of high single digits over that -- kind of over that three-year period as well. And so, it's a really just reinforcing flywheel. If you think about Member's Mark, our Member's Mark item is actually made with and for our members. So, we have 40,000 members who give us counsel on the items before we launch them to market, which means that they always launch successfully and we end up with about a 4.2 star rating minimum on our Member's Mark items.\n\nThat's creating items that members love and say ensure that they're successful when they launch. That's part of the magic that's sitting in that growth of 11 quarters.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nGreat. Thank you very much and best of luck.\n\nOperator\n\nThe next question will come from the line of Kelly Bania with BMO Capital Markets. Please proceed with your questions.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nHi. Good morning. Thanks for taking our questions. I wanted to just talk a little bit about the general merchandise business at Walmart U.S.\n\nJust curious how you think you're performing on that side from a market share perspective and if there's strategies to better leverage the very strong traffic on the grocery side of the business. And also, just how do you think the promotional activity continued -- or contributed to the performance there? Because it looks like some of the categories that did perform well, lawn and garden, automotive were maybe the categories that were not quite as promotional, but maybe you could just help us understand how that played out in the quarter.\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nHey, good morning. You know, first, I think something you said there was really important, that traffic that comes from food and consumables is where a lot of our shopping journeys began. And over the last few years, we positioned the business to have a strong online pickup, delivery business from stores, which includes an omnichannel approach, which enables customers to shop the entire business any way that they want to. In the last quarter specifically, I think there's been really good progress with the number of items that have come onto the marketplace, including the number of sellers.\n\nSo, the offering has grown pretty significantly just in the last quarter. The count of items is up about 50%, which positions us well in categories like apparel as we look forward and also other strong categories like home. On the share point, I think the categories you mentioned in one of our reports which show share gains and others, we feel pretty good about the overall market share remaining in a positive position through the quarter. So, for the next three months, you know, we're really focused on delivering, executing well for all of our customers.\n\nThere'll be a lot of holiday spending as people prepare for gifts. Doug mentioned earlier that our first annual event was basically in line with expectations. But there's a lot of daylight between now and the end of the quarter, still 75 days to go. So, we're really focused on the next few weeks as we lead into December and get ready for the holiday period.\n\nOperator\n\nOur next question is from the line of Simeon Gutman with Morgan Stanley. Please proceed with your questions.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nGood morning, everyone. Two-part question. First, on the third quarter, we -- you had set it up conservatively, and this came in much better. Can you talk about what's changed? Is it clearing of inventory? Inflation definitely picked up at your transactions, too.\n\nAnd maybe it seems like you have some pricing power. And then the second question is, maybe to John David, the timing of LIFO, is it -- a lot of companies experienced a lot of LIFO pressure during '22 because of how high inflation was. Why is it lag? Is it because you lag the pricing that you let through into your price? Is it other -- is there some other dynamic with LIFO that you had some reserves? Anyway, just wondering why it's hitting you next year.\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nSure, Simeon. I'll take both of those pieces. On 3Q, I think there's a couple of things that stand out in terms of the performance relative to our guidance. First is, as we talked about in our prepared remarks, we gained share during the period which, you know, in this time of high inflation, with that's putting pressure on consumers, it shows that our value proposition is more relevant than ever.\n\nAt the same time, there's also been an extreme focus on the expense side of the business. And so, you see that we leveraged by almost 80 basis points in the quarter as we're continuing to focus on providing the best products to our customers, but in the most efficient way that we can. And so, those would be the two areas that I would call out that are most notable in terms of the outperformance. With respect to LIFO, what we've experienced this year with the over $200 million LIFO charges has been entirely related to Sam's.\n\nSam's uses the weighted average cost method for their inventory counting. Walmart uses RIM or retail inventory method. And so, there's a slight nuance difference there that results in the lag. But our expectation, given that we think that these prices will persist, is that Walmart U.S.\n\nwill then -- will soon begin incurring these charges as well. In terms of the timing of next year, it's more front-loaded than, you know, the back half of the year.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nThe next question is from the line of Chuck Grom with Gordon Haskett. Please proceed with your question.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nHey, thanks. Good morning and congrats to the team. Doug, in your prepared remarks, you said customers that came to us less frequently in the past are now shopping with us more often. Can you flesh that comment out a little bit more for us? I think it's interesting and curious the time frame that you're speaking to.\n\nAnd then regionally, just curious if there was any callouts in the quarter, particularly in California, with the rebate checks paid out in the month of October.\n\nDoug McMillon -- Chief Executive Officer\n\nYeah, I'll respond to the first one. And, John, you can help. As it relates to customer shopping with us more frequently, this share gain with people making more than 100,000 household income is what I was referring to. As you would expect, just about everybody, if I think about the U.S., it's probably true in Mexico and other places, too, shops at Walmart at some point.\n\nA lot of people may come to us for Tide or come to us for bananas, but they may not buy a T-shirt or a sweater. We got really high market shares in some general merchandise categories, which would tell you a lot of American shops at Walmart. And during a period of time when people are more sensitive to price, it makes sense that they would increase the amount of their wallet that would be coming to Walmart because of value. So, that's what's happening.\n\nSo, that leads you to the second question, which is can you keep them? And I think some of the things John mentioned a minute ago, like pickup and delivery help. But as I mentioned in my remarks, fresh food and apparel or other areas, homes and other ones where if we can stand tall during this period of time, we think they'll keep coming back to us because we do have quality, we do have value, and we've created a lot more ways for them to save time in the store and with pickup and delivery. So, that's what we're out to do.\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nYes, exactly right. Good morning, Chuck. You know, the business has really positioned itself to be a nominee business. So, we're ready for customers however they want to shop.\n\nCertainly, I would -- just to repeat this, that in higher-income customer groups we're seeing more and more often. So, we're also seeing more digital engagements with customers, more app downloads, more users, people shopping more frequently. And I think that speaks to the strength of the flexibility of what we built. And for a long time, we talked about the value of a store customer plus shopping on e-com, how much more valuable that was.\n\nWe see that accelerate when it's pickup, e-commerce, and stores. So, you know, going forward, you're going to hear from us talk about this more and more as an omni offer, which is really flexible for the customer. And doing things like having options for Thanksgiving meal that are priced the same as last year are really helpful in a time when customers are feeling the pressure of inflation. And then last thing, regionally, no real differences to report in the third quarter across the geographies.\n\nWe saw strength in many geographies. So, I wouldn't say that there's anything that would be a real standout in terms of one region being much stronger than others. The formats were strong across the board, and we saw consistency throughout the quarter.\n\nOperator\n\nThank you. Our next question is from the line of Michael Lasser with UBS. Please proceed with your questions.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning. Thanks for taking my questions. I have two questions. First for Doug, at the start of your prepared remarks, Doug, you mentioned that you're aiming to bring down prices for consumers.\n\nAs we move into next year, it's likely that some of the pressures that caused all the inflation in consumer goods will start to recede. How is Walmart going to handle that? Could you actually see prices come down? And that's important given that Walmart tends to be the price setter across a lot of consumer goods, and you're going to have this growing pool of alternative profits from which you can actually support lower prices into next year. And then my follow-up question is for John David. John David, you provided a couple of list parameters for how to think about 2023 between the billion-dollar LIFO headwind to gross margin and the $3 billion of FX drag to sales next year.\n\nIs that mean we should expect that 2023 is going to be a sub-algo year for Walmart of achieving 4% top-line growth and 4.5% operating income growth, and then you'll get that back in 2024 when some of those headwinds recede such that the combination of those two years should produce the algorithm? Thank you very much.\n\nDoug McMillon -- Chief Executive Officer\n\nYeah, Michael, this is Doug. You know, the algorithm is the first thing that came to mind when you asked the question about how we'll approach prices. The 4% and greater than 4% numbers are certainly on our mind, and that indicates that we think we can grow the operating income percentage of the company over time. As we navigate next year, that will be one factor that we're thinking about.\n\nObviously, we'll be thinking about customers and members as well and driving top line and growing share. So, we'll be navigating it, basically, you know, week to week, month to month as things change. And commodities like protein categories have already started to respond. They move quickly based on demand.\n\nThere'll be volatility in categories like fresh food. The general merchandise categories have started to move as demand softens and things like transportation costs change. We've seen some downward movement in general merchandise, and I think that'll continue, if I had to guess, into next year to some degree. And we'll manage margins and the price gap in general merchandise department by department, category by category, as we always do, but have an eye toward leading down while protecting profitability as much as we can.\n\nI think dry grocery consumables will be more stubborn. Wage rates have gone up, and that won't change, and some input costs have been high for those categories. That's the area where we need to partner even more with our suppliers and come up with more creative solutions and try to do the best we can of relieving that pressure for customers and members. When you add it all up, we'll watch our price gaps.\n\nWe like where our price gaps are. As you've heard us say many times, we understand where price gaps need to be to drive our sales. And then we manage the rest of the pieces to consider operating income and return on investment.\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nAnd, Michael, with the second part of that question, while I wasn't here when we first talked about the growth algorithm, I'm quite certain that the team did not contemplate the ability to know our LIFO change in that number or the FX headwinds. So, I would encourage you to think about that over a multiyear basis. That's a framework to think about the opportunity that we have in our business. We're calling that out now because it's a headwind that we recognize we're going to encounter.\n\nBut that shouldn't take away from the tremendous growth opportunities that we have with our changing business model, moving more to a skilled omnichannel retailer as we invest in things like marketplace, advertising, fulfillment services. And so, all of those things give us a lot of conviction that that growth algorithm is well in place. But I would encourage you to think about that over a multiyear period.\n\nMichael Lasser -- UBS -- Analyst\n\nCould I clarify that real quick? So, if you're expecting the billion-dollar headwind to gross margin from LIFO in, let's say, the next two or three quarters, does that mean you would get it back in the subsequent two or three quarters based on everything that you know today?\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nThat's the right way to think about it, Michael. I don't want to be so specific as to say the number of quarters or which quarters, but over the past, call it, 35 years, we've generally been either because of our business model of everyday low prices or just what's happening with retail prices, in general, we've generally been in a deflationary retail cost environment. We don't expect to live in this era of high inflation forever. I certainly hope not.\n\nAnd so, if we do get back to what we've seen over the last three decades, you would expect that to reverse out in a reasonably quick time period. So, this is not something that if we get back to a normal environment, it's going to take years to reverse out. So, what you said is generally correct. I can't be so specific as to be -- say which quarters they're going to happen, though.\n\nMichael Lasser -- UBS -- Analyst\n\nThank you very much and have a great holiday.\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nYou, too.\n\nOperator\n\nThe next question comes from the line of Peter Benedict with Baird. Please proceed with your questions.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nHey, guys. Good morning. Just a couple of quick ones. First, just, John David, maybe, you know, you guys, you talk a lot about the flywheel, the new capabilities.\n\nUnderstanding that those are all integrated into the business in different ways, how should we be thinking about the impact that can have on the business either currently or over the next few years? Any way you can help us frame that? And then the second question is just around the trade down and the increase in private brand penetration. Just curious how the pace and magnitude of that shift that you guys are seeing compares to maybe past periods where we've had economic stress. Is it similar or is it happening more acutely? Just -- those are my two questions. Thanks so much.\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nSure. I'll take the first part of that and then pass it on to John for the second part of the question. You know, one of the things, Peter, that excites me the most about this business is the opportunity that we have going forward with a changing business model that is really reflective of where consumers -- because our patterns are shifting, too. We're seeing the world move more online.\n\nI think we are unique in our ability to be a skilled omnichannel retailer. And so, when you consider things like advertising or fulfillment services, these are areas of our business that not only are faster growing, they have a higher margin associated with them. And so, that's included when we contemplate our growth algorithm. And so, you know, hopefully, we look up a number of years from now and we've got a much more diverse and durable earnings stream that -- also there's a different multiple ascribed to those earnings streams than what exists today.\n\nWe're quite excited about the opportunity in front of us.\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nAnd hey, Peter, it's John. I'll just talk about private brand for a second. You know, what we've seen really for the last three years up until Q1 of this year was a flat private brand penetration, not much movement in '19, '20, '21, and then the movement, the trading to private brands from other brands really started in about March of this year. And then, as we said in the quarter, it's increased its penetration in the food categories by about 130 basis points.\n\nSo, a relatively decent amount has moved into private brands. As far as comparisons to prior periods, I think the last time we would be able to say anything about this from 12 to 13 years ago, so I don't think I'd have anything today to offer with specificity other than what we've seen in the last three quarters is quite a bit of switching among some consumers. And now, there are other consumers that are trading to Walmart that are not trading in private brands. They're branding customers, and they're buying more premium items.\n\nSo, again, I would just repeat the fact that we positioned ourselves in terms of merchandizing in the portfolio and with the channels by which we serve customers in a very flexible way so that we can help customers in whatever economic situation that they're in, and we'll be ready for the rest of the year.\n\nDoug McMillon -- Chief Executive Officer\n\nI think what you guys have done on the Thanksgiving meal is a great example of how we're helping relieve pressure there, Peter, a group of items that make up kind of a scratch cooking aspects of Thanksgiving, 25 items for $88, the same as last year. That's one basket. We've looked at Thanksgiving baskets in different ways and taken other actions on products that are more convenient, not scratch that -- like our $71 for 17 different items. That alleviates a need to switch.\n\nThese are -- you know, some of these are branded items. I think that's a great example of how we can step up and absorb some of this to help families that need it most. And I'm really pleased to see you guys take that action.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nAppreciate the perspective. Thanks, guys.\n\nOperator\n\nThank you. Our next question is from the line of Scott Mushkin with R5 Capital. lease proceed with your questions.\n\nScott Mushkin -- R5 Capital -- Analyst\n\nHey, guys. Thanks for [Inaudible] in here. So, I guess I wanted to get back to the idea of next year and what Michael was talking about with the inflation receding. I guess the big wildcard in that is if we get a big inflation going away, you know, where does demand -- underlying demand? It would, you know, suggest maybe underlying demand is being destroyed potentially.\n\nAnd so, how do you guys think of your business as we move -- if we move through that type of environment?\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nSure. I'll start and others can jump in. This is John David. Look, one of the biggest impacts on our business this year has been the change in mix, particularly as we think about the U.S.\n\nbusiness, where the margin profile is different on general merchandise versus food and consumables. We don't have an assumption that that bounces back rapidly next year. And with continued high prices, the consumer continuing to be pressured, we expect to have that mix effects -- effect prolonged into next year. And so, I know there's, you know, hope that things would bounce back, and certainly, some of the one-time costs that we've incurred this year related to supply chain are not going to repeat next year, but the consumer is stressed.\n\nOne of the things that's assisted that, thus far, is relatively strong balance sheets among consumers, assisted by stimulus payments. That's not going to last forever. And so, that's why we take a rather cautious view on the consumer. But at the same time, as all of us have mentioned, this is when our value proposition really shines.\n\nWhen customers are looking for value, it's not just value, it's also product assortment. You know, one of the things that John mentioned, and I think it's worth repeating, but it's not just the 370 million SKUs that we're offering between first-party and third-party e-commerce, it's the acceleration of that. That's a 50% increase quarter over quarter. And it shows you that not only are we providing products at the price point that customers want, we're providing additional products and assortment for them to buy.\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nAnd, Scott, good morning. I think I would add for John David said, really three parts of this. What -- first, we have to focus on what we can control in any environment, and that would consist of [Inaudible] merchants, positioning ourselves for value, which is relative value, and taking a longer-term approach to consumer. And then finally, strong execution.\n\nWe've made some progress with inventory, as we said, quarter to quarter, from high 20s to just over 12% over last year. So, having an inventory position that strong going into the year with some flexibility is a really important part to be able to maneuver any environment that we get into. So, we'll continue to focus on those three, and we'll be ready for customers in any scenario that we find ourselves in in the next couple of years.\n\nScott Mushkin -- R5 Capital -- Analyst\n\nSo, as a follow-up to that, John, like if you look at the U.S. business ex-LIFO, do you anticipate EBIT growth?\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nWe're not prepared to give guidance for next year yet. We'll talk about that more on the fourth quarter call.\n\nDoug McMillon -- Chief Executive Officer\n\nIt's a really good try, though, Scott.\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nSo, you're all tempted to jump in and say something, but then John David gave you the appropriate answer.\n\nScott Mushkin -- R5 Capital -- Analyst\n\nAll right. Thanks, guys.\n\nOperator\n\nThank you. Our final question today comes from the line of Paul Lejuez with Citigroup. Please proceed with your question.\n\nPaul Lejuez -- Citi -- Analyst\n\nHey. Thanks, guys. Just curious, you mentioned again seeing a higher-income consumer trading into your store. I'm curious if you're seeing them shop other parts of your store outside of food and grocery.\n\nAre you seeing them show up in general merchandise? And I'm curious, just as you look out to the competitive environment for holiday, what do you expect in terms of the promotional cadence out there? And maybe just talk about the opportunities that you have for holiday this year, as well as the challenges. Thanks.\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nHey, Paul. You know, what's exciting about the rest of the season is we still have a couple of big events this month. We're excited about Thanksgiving next week because of the way we have prepared in the food business. And then we have an event in December that we're looking forward to as well.\n\nThe customers that are trading into the brand, as I said earlier, it's a mix, which is great. We're seeing more customers more often. We're seeing them in more categories. Historically and in the last quarter, we do see a lot of new customers who come in via food and consumables.\n\nAnd then for the digital experience, what we did over the last, really, 12 months was integrate the original Walmart grocery shopping app and the Walmart.com app into one place. So, the entire assortment, up to 350-plus million items are all there in one place. So, I think we're positioned well to be able to navigate. As far as promotions, as we said earlier, the guidance would include the ability to react to a more promotional environment.\n\nBut we don't know yet. It's still mid-November and there's a lot of room between now and the end of the holidays, including New Year. So, again, we'll be prepared for any environment that emerges over the next few weeks.\n\nDoug McMillon -- Chief Executive Officer\n\nMore promotional the normal. Late -- you know, some seasons are later than others. Christmas is a day later. This will be one of those years where we're watching sales closely, you know, up until the last minute of Christmas Eve.\n\nAnd then we'll do a lot of business after Christmas. And we don't finish until January 31st. And sometimes, these quarters work out where the very end of December and January end up being stronger when people are particularly price-sensitive. So, that's kind of what I'm expecting.\n\nPaul Lejuez -- Citi -- Analyst\n\nThanks, guys. Best of luck.\n\nOperator\n\nThank you. At this time, we've reached the end of the question-and-answer session. I'll turn the call to Doug McMillon for closing remarks.\n\nDoug McMillon -- Chief Executive Officer\n\nAs always, thanks for your interest in the company. We are pleased that we had a stronger quarter. I think there's a lot to look at in the metrics that we've shared. We've shared a lot of information this morning that would indicate not only are kind of the key short-term operational metrics being managed well, but we are building a different business model.\n\nJohn David talked a bit about that in his prepared remarks. We're excited to see progress in terms of how marketplace is scaling and how these businesses connect to each other. So, we're not just focused on the short term, but we are focused on the short term as we build for the long term. The key issue has been inventory management, and I'm really thankful to have a team with a lot of experience and able to consume a lot of data to make good choices about where we position inventory by country, by category for the rest of this quarter, and into next year.\n\nI'm sure there'll be some things that surprise us, but we are engineered for flexibility. And as I mentioned in my remarks, one of the things I love about this business, there's a long list of things I love, but one of the things I love are all the natural hedges. If they don't want to buy something, we'll sell them something else. If the price needs to be a little lower, we'll figure that out.\n\nIf a problem needs to be dealt with, we'll deal with it, and there'll be something else going well that helps us manage the total portfolio. And that's the way that I think about it. I'm excited about this holiday and the challenges in front of us and hope you guys have a great holiday yourselves. Thank you all.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSteph Wissink -- Senior Vice President, Investor Relations\n\nDoug McMillon -- Chief Executive Officer\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nKate McShane -- Goldman Sachs -- Analyst\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nJudith McKenna -- President and Chief Executive Officer, Walmart International\n\nKath McLay -- President and Chief Executive Officer, Sam's Club\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nScott Mushkin -- R5 Capital -- Analyst\n\nPaul Lejuez -- Citi -- Analyst\n\nMore WMT analysis\n\nAll earnings call transcripts"
}