{
  "companyName": "MacroGenics",
  "companyTicker": "MGNX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/macrogenics-mgnx-q3-2022-earnings-call-transcript/",
  "content": "MacroGenics (MGNX 3.23%)\nQ3 2022 Earnings Call\nNov 03, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon. We will begin the MacroGenics 2022 third quarter corporate progress and financial results conference call in just a moment. [Operator instructions] At this point, I will turn the call over to James Karrels, senior vice president, chief financial officer of MacroGenics.\n\nJim Karrels -- Senior Vice President, Chief Financial Officer\n\nThank you, operator. Good afternoon, and welcome to MacroGenics conference call to discuss our third quarter 2022 financial and operational results. For anyone who's not had the chance to review these results, we issued a press release this afternoon outlining today's announcements, which is available under the investors tab on our website at macrogenics.com. You may also listen to this conference call via webcast on our website, where it will be archived for 30 days beginning approximately two hours after the call is completed.\n\nI would like to alert listeners that today's discussion will include statements about the company's future expectations, plans and prospects that constitute forward-looking statements for purposes of the safe harbor provision under the Private Securities Litigation Reform Act of 1995. Actual results may differ from those indicated by these forward-looking statements as a result of various important factors, including those discussed in the Risk Factors section of our annual, quarterly and current reports filed with the SEC. In addition, any forward-looking statements represent our views only as of today and should not be relied upon as representing our views as of any subsequent date. While we may elect to update these forward-looking statements at some point in the future, we specifically disclaim any obligation to do so even if our views change, except to the extent required by applicable law.\n\nAnd now, I would like to turn the call over to Dr. Scott Koenig, president and CEO of MacroGenics.\n\nScott Koenig -- President and Chief Executive Officer\n\nThank you, Jim. I'd like to welcome everyone participating via conference call and webcast today. This afternoon, I will provide key updates on our clinical programs, as well as our recently announced collaboration with Gilead. But before I do so, let me first turn the call back to Jim, who will review our financial results.\n\nJim Karrels -- Senior Vice President, Chief Financial Officer\n\nThank you, Scott. This afternoon, MacroGenics reported financial results for the quarter ended September 30, 2022, which highlight our financial position, as well as our recent progress. As described in our release this afternoon, MacroGenics total revenue consisting primarily of revenue from collaborative agreements was $41.7 million for the quarter ended September 30, 2022, compared to total revenue of $15.7 million for the quarter ended September 30, 2021. Revenue for the quarter ended September 30, 2022 included $30 million in milestone payments from Insight related to retifanlimab, which they licensed from us in 2017.\n\nRevenue for the quarter ended September 30, 2022 also included margins net sales of $4.4 million, compared to $3.6 million for the quarter ended September 30, 2021. Our research and development expenses were $48.2 million for the quarter ended September 30, 2022, compared to $49.8 million for the quarter ended September 30, 2021. The decrease was primarily related to decreased retifanlimab manufacturing costs for Incyte and decreased costs related to discontinued studies. These decreases were partially offset by increased development, manufacturing and clinical trial costs related to MGC018, increased expenses related to discovery projects and preclinical molecules and increased clinical expenses related to lorigerlimab and MGD024.\n\nOur selling, general and administrative expenses were $15.4 million for the quarter ended September 30, 2022, compared to $17.2 million for the quarter ended September 30, 2021. The decrease was primarily related to decreased MARGENZA selling costs, as well as decreased consulting expenses. Our net loss was $24.8 million for the quarter ended September 30, 2022, compared to a net loss of $52.9 million for the quarter ended September 30, 2021. Our cash, cash equivalents and marketable securities balance as of September 30, 2022 was $123.6 million, compared to $243.6 million as of December 31, 2021.\n\nThe September 30, 2022 balance did not include $60 million subsequently received from Gilead in October 2022. Finally, in terms of our cash runway, we anticipate that our cash, cash equivalents and marketable securities balance as of September 30, 2022 and the $60 million subsequently received from Gilead, projected and anticipated payments from partners, product revenues, as well as anticipated savings from our previously announced corporate restructuring plan should extend our cash runway into mid-2024. This updated cash runway guidance reflects anticipated expenditures related to the planned Phase 2 portion of the MGC018 TAMARACK study, as well as MacroGenics other ongoing studies. In addition, we note that the potential approval of the teplizumab BLA later this month, which would obligate Prevention Bio to provide us with a $60 million milestone within 90 days of that approval would help us achieve a two-year cash runway.\n\nAnd now, I'll turn the call back to Scott.\n\nScott Koenig -- President and Chief Executive Officer\n\nThank you, Jim. In the past few months, we demonstrated our ability to generate nondilutive capital via partnering efforts, which enabled us to collect $30 million in milestone payments from Incyte and the subsequent receipt of the $60 million upfront payment from Gilead. We are very excited to advance MGD024 in collaboration with Gilead. Also, we continue to operationalize the TAMARACK study of MGC018, which has a new name vobramitamab duocarmazine in prostate cancer and believe we should be able to dose a first patient in the study by year-end.\n\nFinally, with enrollment completed in the monotherapy dose expansion study of lorigerlimab, we look forward to sharing clinical data in first quarter of 2023. With that backdrop, let me walk you through updates on our portfolio of investigational clinical molecules starting with vobramitamab duocarmazine or MGC018, our ADC is designed to deliver a DNA alkylating duocarmycin cytotoxic payload to tumors expressing B7-H3. B7-H3 is a member of the B7 family of molecules involved in immune regulation. Vobramitamab duocarmazi, was designed to take advantage of this antigen's broad expression across multiple solid tumor types.\n\nWe continue to make progress as we operationalize the TAMARACK study. We've begun initiating clinical sites and expect to start the TAMARACK study by year-end with anticipation of interim data from the Phase 2 portion of the study in 2024. Next, let me update you on Lorigerlimab. We continue to dose patients in the Phase 1 dose escalation combination study of vobramitamab duocarmazine with lorigerlimab in patients with advanced solid tumors, including renal cell carcinoma, pancreatic cancer, ovarian cancer, patocellular carcinoma, mCRPC and melanoma.\n\nYou may recall that based on data from our preclinical studies, antitumor activity with vobramitamab duocarmazine, may be enhanced by combination therapy with an anti-PD-1 agent without significant incremental toxicities. During the second quarter, we completed enrollment of the Phase 1/2 dose expansion study with lorigerlimab as monotherapy in cohorts of patients with microsatellite stable colorectal cancer, mCRPC, melanoma and checkpoint-naive non-small cell lung cancer. Many patients are still on study. And while we will wait to provide a clinical update on this study in the first quarter of 2023, I'll mention that we're very encouraged by what we've seen so far.\n\nWe look forward to sharing data with you in early 2023. Next up, MGD024 is our next-generation bispecific CD123 x CD3 DART molecule that incorporates the CD3 component designed to minimize cytokine-release syndrome, while maintaining anti-tumor cytolytic activity and permitting intermittent dosing through a longer half-life. Our Phase 1 dose escalation study of MGD024 is ongoing in patients with CD123 positive relapsed or refractory hematologic malignancies, including acute myeloid leukemia and myelodysplastic syndromes. Of course, we're thrilled to have Gilead as a collaboration partner to advance MGDO24.\n\nLast month, we entered an exclusive option and collaboration agreement with Gilead to develop MGD024 and up to two additional bispecific research programs in oncology. The agreement grants Gilead the options still had the option to an exclusive license to MGDO24, as part of the agreement, Gilead paid us an upfront payment of $60 million and MacroGenics will be eligible to receive up to $1.7 billion in target nomination, option fees and development regulatory and commercial milestones. MacroGenics will also be eligible to receive tiered double-digit royalties on worldwide net sales of MGDO24, and a flat royalty on worldwide net sales of products resulting from the two additional research programs. MacroGenics will be responsible for the ongoing Phase 1 study of MGD024, and Gilead may elect to exercise his option to license the program at predefined decision points.\n\nThe Phase 1 study will include a dose escalation segment and an expansion segment that has been intended to evaluate MGD024 as monotherapy and in combination with other therapies across multiple indications. Next, I will provide an update on our product candidates being developed by our collaboration partners for which we retain certain economic rights. As Jim mentioned earlier, we in prevention await the FDA's decision on teplizumab, an anti-CD3 monoclonal antibody that prevention acquired from us under an asset purchase agreement in 2018. Prevention is developing teplizumab for both the treatment and prevention of Type 1 diabetes.\n\nThe extended PDUFA target action date for the prevention of Type 1 diabetes indication is November 17, 2022. MacroGenics is eligible to receive royalties on net sales of teplizumab if approved, in addition to milestone payments that totaled $170 million, inclusive of the $60 million U.S. approval milestone. Retifanlimab is an investigational anti-PD-1 mAb that we exclusively licensed Insight Corporation.\n\nMacroGenics is eligible to receive royalties on net sales of retifanlimab, if approved, in addition to milestone payments. In July 2022, MacroGenics received $30 million in milestone payments from insight as part of its collaboration agreement. Retifanlimab is currently being studied as monotherapy or in combination with other agents across multiple studies. Finally, as a reminder, we previously announced in August our restructuring plan, which included the prioritization of our pipeline of product candidates, a 15% workforce reduction and plant closure of two facilities with the goal of delivering value-creating data with our existing and anticipated financial resources.\n\nAll of these cost saving measures are proceeding according to plan. With our continued progress through 2022, we remain committed to developing and delivering life-changing medicines to cancer patients. We would be now happy to open the call for questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] The first question comes from John Miller at Evercore. John, go ahead with your question.\n\nUnknown speaker -- Evercore ISI -- Analyst\n\nHi. This is Jessica Hui on for John. Two questions from me. My first question is, what exactly is included in the cash runway guidance that gets you to mid-2024 besides the $6 million upfront payment from Gilead.\n\nThe PR mentioned projected and anticipated future payments from partners and product revenues, and those are part of the anticipated cash runway. Can you give us an idea of what payments these include and what potential milestones can further extend the cash runway to at least the end of 2024. For example, that $60 million milestone payment from Prevention Bio is that already baked in or the data update that you're expecting for their PD-1 CLA 4 in 1223 can that lead to something? And then, my second question is the PR also mentioned that Gilead may elect to exercise this option to license the program at predefined decision points. Can you give us a little bit more color on what these decision points entail? Like is it fair to say that the Phase 1 data would be one of these points, does Gilead have a clock on their choice? Thank you.\n\nOperator\n\nAll right. Standby for our second question. Our next question comes from Jonathan Chang of SVB Securities. Jonathan, go ahead with your question.\n\nJonathan Chang -- SVB Leerink -- Analyst\n\nHi, guys. Thanks for taking my questions. First question, congrats on the recent Gilead partnership. I'm curious to hear your thoughts on business development broadly regarding other pipeline assets post this deal? And I'm having some trouble hearing you, guys.\n\nOperator\n\nYeah, I can hear you. \n\nJonathan Chang -- SVB Leerink -- Analyst\n\nScott? Jim?\n\nOperator\n\nAbsolutely. Will do that. Our next question comes from David Dai with SMBC. David, go ahead with your question.\n\nDavid Dai -- SMBC Nikko Securities -- Analyst\n\nYeah, hi, thanks for taking my questions. I also want to say my congratulations on the recent progress. One question on the MGC018. Could you talk a little more about the biological rationale combining MGC018 and lorigerlimab? I understand that you will also be presenting deviate data at SITC.\n\nCould you maybe help us understand if you will be testing this tumble in the habit trial?\n\nOperator\n\nYes. So to all of our participants on the call. For some reason, we're having issues with you hearing the answer when you've been brought to ask your question. We are not having that same issue.\n\nSo we're gonna work for just a second to see if we can resolve this. [Operator instructions]\n\nScott Koenig -- President and Chief Executive Officer\n\nJust in response to your question, the rationale behind combining the MGC018 and lorigerlimab is that we had identified mechanistically that combining an ADC with a blockade of PD-1 gives a orthogonal mechanisms that give enhanced immune responses, enhanced killing against targets. And given the success we've seen so far with the darpispecific lorigerlimab, where you now have the additional blockchain.\n\nJim Karrels -- Senior Vice President, Chief Financial Officer\n\nOperator, you need to turn off.\n\nScott Koenig -- President and Chief Executive Officer\n\nYeah. So the additional rationale is now using instead of just retifanlimab, but using instead of the bispecific is based on the encouraging monotherapy data we had already seen. So the idea was to optimize both checkpoint blockade, as well as the ADC activity. So that's the rationale.\n\nJim Karrels -- Senior Vice President, Chief Financial Officer\n\nMaybe go back...\n\nScott Koenig -- President and Chief Executive Officer\n\nYeah, let me go back to Jonathan's question. Jonathan, with regard to the BD activity, as you are well aware, we have been very active for many, many years in continuous BD engagement on both our clinical and preclinical portfolio. And I'm pleased to say, in addition to the success of the recent partnership with Gilead, we have ongoing discussions on a number of fronts, both on clinical assets and preclinical assets. So I have nothing more to describe at this point, but you could anticipate as time goes on over the course of the year, we should have additional activity being discussed.\n\nOperator\n\nAnd Jonathan, you are live on the stage, if you would like to ask a follow-up question.\n\nJonathan Chang -- SVB Leerink -- Analyst\n\nWould that -- I guess, to my second question, the predefined decision points in which Gilead may elect to exercise their option to license the program. Could you give us some more color on that?\n\nScott Koenig -- President and Chief Executive Officer\n\nSo Jessica, Jim tried to answer that question, but let me just reiterate, because of the nature of the agreement, there was nothing -- we're not allowed specifically to define the points where Gilead can enter into the option period to take a license during this option period. Having said that, they can do it at any time. So clearly, they will be continuing to monitor the clinical results on the dose escalation. And then, as we described today, there's plans to do additional combination studies going forward.\n\nSo at any time during this examination of the molecule they can opt in.\n\nOperator\n\nOur next question is coming from Charles Zhu with Guggenheim Partners. Charles, go ahead with your question.\n\nCharles Zhu -- Guggenheim Partners -- Analyst\n\nHello. Good evening, and thanks for taking my questions. I was wondering if --\n\nJim Karrels -- Senior Vice President, Chief Financial Officer\n\nOperator, it sounds like you've not dropped that line.\n\nCharles Zhu -- Guggenheim Partners -- Analyst\n\nNo worries. No worries. OK. OK.\n\nAll right. I'll try again. Could you provide some color into the progress of the MGC018 dose escalation study in combination with the lorigerlimab? I think, the study has been ongoing since earlier this year with the newer Q4 weekly dosing. And I was wondering if your early 2023 lower lorigerlimab update could potentially provide some more line of sight into that combination as well? Thank you.\n\nScott Koenig -- President and Chief Executive Officer\n\nYeah, Charles, again, without specifying the timing of things, obviously, we had taken a -- I would say, a reasonably aggressive view of this, where we set the dose of the lorigerlimab component at 6 mg per kg, and that continues. The plan was to dose escalate in a reasonable fashion with the MGC018 starting at 1 mg per kg. As you recall from our dose escalation, we began to see clinical responses even at low doses of MGC018. So with regard to the timing of when we might be able to see some clinical results, they can occur at any time we believe, given that our plan is to dose escalate fairly rapidly, obviously, paying attention to the safety profile of that combination and doing that appropriately.\n\nAnd at any particular time, we may elect to do expansion of particular cohort. So it's just too early at this time to say when that will occur, but could occur in '23 even in the early part of '23.\n\nCharles Zhu -- Guggenheim Partners -- Analyst\n\nGot it. Great. And maybe one follow-up, if you don't mind, on the lorigerlimab program update, specifically in 2023. So looking forward to that one for sure.\n\nAnd I was wondering if you could also help us contextualize the lorigerlimab update relative to some of the other PD-1/CTLX4 bispecific data that we've seen emerging not only recently but also some others that we may see very soon at the upcoming SITC conference as well? Thank you.\n\nScott Koenig -- President and Chief Executive Officer\n\nYeah. So as we noted today, we have been encouraged by the data we've completed in the four expansion cohorts, our enrollment plans. We will discuss one or more of these expansion cohorts, which in many -- in several of these cases are quite considerable. Given that, as we've already noted that we're doing combination studies, we're also looking at plans potentially to move forward in monotherapy studies in one or potentially more indications and all of these will be discussed early in 2023.\n\nSo I should also note that we have made many of the competitor PD-1 CTLA-4 type molecules, and have done comparisons and I can state that our molecule compares quite favorably to all those that we've tested.\n\nCharles Zhu -- Guggenheim Partners -- Analyst\n\nGreat. Thanks for answering the questions.\n\nOperator\n\nAnd our next question is coming from Lukas Shumway with BMO Capital Markets. Lukas, go ahead with your question.\n\nLukas Shumway -- BMO Capital Markets -- Analyst\n\nThe question is on the evolving prostate cancer landscape. What are your views on the opportunity for MGC018 and what critical benchmarks are you looking for for comparison? And for a second question, are you -- what's your latest thinking on development for teplizumab? Do you think we could expect like a business development actions similar to what we saw with 042? Thank you.\n\nScott Koenig -- President and Chief Executive Officer\n\nSo with regard to MGC018, as we've stated quite clearly, this year was prioritized to operationalize the planned Phase 2/3 study in patients with castration-resistant prostate cancer who had progressed on chemotherapy, as well as, one androgen-receptor targeting agent. As we noted today, we plan to have the first patient in by the end of the year, that would be looking at the major part of the enrollment occurring in '23 in this population. And so, that's the major focus right now. And then, of course, as we just discussed, we're doing the combination study of MGC018 with lorigerlimab and based on the results of that data that could lead into additional indications and other opportunities in prostate cancer.\n\nWith regard to the question concerning teplizumab, as we've noted is that we've been prioritizing our programmatic spend. We have, obviously, very exciting data that we've reported on to date, both in solid tumors, as well as in real VCO post CAR-T therapy. We are in discussions, again, looking for additional capital regarding future studies, and we've spent a lot of time identifying opportunities that we think would be most promising in the solid tumor setting, as well as in hematological malignancies. And those discussions are ongoing now.\n\nBut I have nothing more to report with regard to particular partnerships or a magnitude of those partnerships.\n\nLukas Shumway -- BMO Capital Markets -- Analyst\n\nOK. Thank you.\n\nOperator\n\n[Operator instructions] Our next question comes from Silvan Tuerkcan. Silvan, go ahead with your question.\n\nSilvan Tuerkcan -- JMP Securities -- Analyst\n\nYeah, good afternoon, and apologies about my voice here. I have two quick questions regarding, [Inaudible] and the Prevention Bio progress. They announced this morning that they're labeling discussions there. How confident are you in the approval coming soon in November? And then, when do you think royalty -- talking about the commercial opportunity here, when do you think royalties to you will be meaningful considering your MARGENZA sales, if you could answer that would be great.\n\nThank you.\n\nScott Koenig -- President and Chief Executive Officer\n\nWith regard to the prevention announcement today, we, obviously, have been very encouraged all along with their public communications. We know nothing more than that was stated today publicly. But my sense is that we are exactly two weeks from the PDUFA date, and they would not be putting out these reports of the labeling and post-marketing commitments if they weren't encouraged by this. So we, like everyone else is waiting for, hopefully, the approval of the drug within the next two weeks.\n\nWith regard to royalties, you said the marge royalties, I mean, the only royalties that we have -- would anticipate would be that from our partner, Zai in China. We, obviously, have sales ongoing with EVERSANA, with regard to our Zai partnerships, they have expectations sometime next year of getting approval for that. So -- and nothing more to really say in terms of the magnitude of such royalties on the product.\n\nSilvan Tuerkcan -- JMP Securities -- Analyst\n\nThank you so much. And I have a follow-up question, I might have missed this in earlier questions. So we still expect MGC018 data next year, and I believe it was first half, if I'm not mistaken. And here, I have a question around the dosing since you have changed the dosing recently.\n\nWill the update that we'll get be in prostate cancer, and it will it be with the new dosing regimen and the two new dose of 2 milligrams per kg and 2.5 milligrams per kg. Thank you very much.\n\nScott Koenig -- President and Chief Executive Officer\n\nYeah. So we have not treated any new patients as of yet with those two dosing schedules, that will start on when we start the TAMARACK study. Obviously, these doses were extracted from our analysis of the patients that were originally started at 3 mg per kg on a Q3 weekly basis, and how those doses were altered during the course of those patients' therapy. Our plans for future disclosure with regard to the program will occur when we decide on additional cohorts that we would take forward into Phase 2 development and not until then.\n\nSilvan Tuerkcan -- JMP Securities -- Analyst\n\nThank you very much.\n\nJim Karrels -- Senior Vice President, Chief Financial Officer\n\nOperator, if I could address one of the questions that was first asked with regard to cash runway, I believe Jessica asked the question.Jessica, we have not -- and I apologize for this communication that messed up. We have not disclosed the specific milestones other than in aggregate that we are potentially eligible to receive from our various partnerships. What we do when we think about cash runway is we probability adjust those that we think are reasonably within our reach. With regards to the $60 million from prevention, for example, we do have a portion of that in our budget, not the full amount, and that's similar with other things that we have outside line, too.\n\nOperator\n\nAt this time, we have no further questions. So I'd like to turn it back over to the company for closing remarks.\n\nScott Koenig -- President and Chief Executive Officer\n\nFirst of all, we apologize for the technical snafu today, it was beyond our control. We, obviously, look forward to having further discussions on our progress at future conference calls and earnings call. Look forward to speaking to you at that time.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJim Karrels -- Senior Vice President, Chief Financial Officer\n\nScott Koenig -- President and Chief Executive Officer\n\nUnknown speaker -- Evercore ISI -- Analyst\n\nJonathan Chang -- SVB Leerink -- Analyst\n\nDavid Dai -- SMBC Nikko Securities -- Analyst\n\nCharles Zhu -- Guggenheim Partners -- Analyst\n\nLukas Shumway -- BMO Capital Markets -- Analyst\n\nSilvan Tuerkcan -- JMP Securities -- Analyst\n\nMore MGNX analysis\n\nAll earnings call transcripts"
}