{
  "companyName": "Unity Software Inc.",
  "companyTicker": "U",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/unity-software-inc-u-q2-2022-earnings-call-transcr/",
  "content": "Unity Software Inc. (U 0.39%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nRichard Davis\n\nThank you, everyone, for joining Unity's second quarter earnings call. I would like to remind participants that during this conference call, we will be making forward-looking statements, including statements about goals, outlook, industry trends, market opportunities and expectations for future financial performance, all of which are subject to risks, uncertainties and assumptions. You can find more information about these risks and uncertainties in the Risk Factors section of our filings at sec.gov and the press release we issued this morning. Actual results may and we take no obligation to revise or update any forward-looking statements.\n\nWe will also be discussing non-GAAP financial measures today and reconciliations between our GAAP and non-GAAP financial results and the discussion and limitations of our non-GAAP financial measures, can be found in our earnings press release, which was issued earlier today and is available on our website under the Investor Relations tab on the appendix to this call slide deck. On July 13, we announced a definitive agreement to merge with ironSource, which we expect to close in the fourth quarter of this year. We also preannounced that our second quarter results were slightly higher than the top end of our guidance and reduced our full year revenue guidance. Today, we will go deeper into our results and projections.\n\nNow joining me today are our CEO, John Riccitiello; our CFO, Luis Visoso; Marc Whitten, our create solutions leader; and Ingrid Lestiyo our operate solutions leader. With that, let me turn the call over to John.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nThank you, Richard. Before we dive in, I want to address what everyone is aware of, the AppLovin proposal. I acknowledge we received a proposal, and I want you to know that we aren't going to make any comments at this time. I'd like to start this call by reminding us of Unity's North Star, and that is our belief that the world is a better place with more creators in it.\n\nIt is this belief that has guided us over the years and continue to guide our decisions across the company. Through years of innovation, investments and hard work by everyone at Unity, Unity has become the world's leading platform for real-time 3D content creation designed to enable creator success and ultimately led to Unity having two main lines of business: create to help creators make real-time 3D content and operate where we help these creators find operational and business success with their content. The second quarter of 2022 came in consistent with our last update, but well below the standard we have set for ourselves for growth and value creation. We can and will do better.\n\nRevenue of $297 million is up 9% year over year and slightly above guidance of $290 million to $295 million. We are encouraged by the sustained growth and create as we strengthen our relationship with customers. And while we are also pleased with the crop progress we are making and operate, our underperformance in monetization remains disappointing. We have product and engineering efforts in place to get our monetization business back on a stable footing.\n\nWe have fixed the data challenges that we discussed last quarter and are launching new features. We are seeing improvements in our products with lead indicators such as Audience Pinpointer accuracy, showing our innovations are effective. Despite the progress, we lowered Unity's full year revenue guidance to $1.3 billion to $1.35 billion as revenue uptick is slower than modeled. We attribute this to a combination of recent negative macroeconomic factors and the complexity of accurately forecasting the timing of the change in revenue trajectory of the monetization business.\n\nNow let me start with create. Create delivered another strong quarter with revenue of $121 million, up 66% year over year. We were building a large create business fueled by innovation and market tailwinds as the world transitions from linear and 2D to real-time 3D, which is more engaging and interactive experience. Our games strengthen as we improve tools and features, which are used by creators to watch amazing and successful games.\n\nAnd we are seeing acceleration in our business outside of games with big wins across industries and geographies. We're adding new customers and expanding our business with existing customers that are building their business on our digital point capabilities. Our focus on creators and solving their toughest challenges has enabled us to more than double our create business from $55 million in the second quarter of 2020 to $121 million in the second quarter of 2022. We're approaching $0.5 billion yearly run rate and growing at a healthy pace, and I believe that we are just getting started.\n\nWe are encouraged by the performance in the Games business. The second quarter of 2022 was our biggest games quarter end. Our strong performance included record adoption of our 2021 long-term stable or version and the 2022 tech stream and expansion of data-oriented tech stack or capability. Unity is much more than games now as our growing success outside of games of tests.\n\nOur business outside of games represented 25% of our total create business for the full year of 2021 and 33% for the fourth quarter of 2021. At the end of the second quarter 2022, our business outside of games represented 40% of our total create business. And remember, this mix expansion is within the context of having our best revenue quarter ever for our gaming business. I want to acknowledge the amazing games made by creators on Unity and the inspiration than it is to us.\n\nTheir dedication and commitment to the Crafter gaming development places us to constantly innovate and evolve our products. Unity's aim is to provide creators with the complete set of tools they need to be successful. And with that, let me hand it over to Marc to bring some of this to life.\n\nMarc Whitten -- Create Solutions Leader\n\nThanks, John. The investments that we make in our platform and tools are reflected in the wins that we have achieved quarter-over-quarter. Our customers are leveraging the advancements in Unity's platform to realize the vision for their games. Unity 2021 LGS comes with significant additions and improvements for visual scripting.\n\nEditor's instability sea-view overlays for artist-driven tools and acid injection. It also adds editor support for Apple Silicon and target platform support for Chronos and bundles as well as expanding our adaptive performance support so that you can launch quicker and manage mobile device resources for better performance. It supports new functionality for 2D and 3D workflows as well as new feature functionality for our rendering pipelines across both our universal rendering pipeline and our high-definition rendering pipeline. We developed these new capabilities first in our tech stream releases.\n\nAnd after we receive sufficient input and validation from our community of creators, we land those capabilities as the next long-term stable release. This year's Unity 2022 tech screen focuses on significant improvements in several major systems, including refining our user input framework and a focus on developer and artist productivity through features like better flying tooling, better material variant productivity and significant performance improvements as well as connectivity with other creation tools. Most important to us is seeing creator success in bringing their experiences to life. We continue to see a large share of gains released across all gaming platforms made with Unity.\n\nAnd these run the gamut from the largest games publishers in the world to indie developers releasing their very first games to massive success. And we believe that players should be able to find and play games on any platform. Unity enables developers to build their game for any destination platform from the first mile to the last. Our partnerships with platform and hardware creators enable games to be deployed across mobile, console, PC, AR, VR and web.\n\nSo for starters, millions of mobile game developers around the world are using Unity to build the next generation of successful games. Today, Unity Power is more than 70% of the top mobile games. Our engine is optimized to create highly performing games that work across a huge variety of devices and specs and have the tools to make it easier to deploy games and manage their ongoing life cycle. They are great examples here across the board.\n\nKabam launched Disney's Mirrorverse to much fanfare in mobile in June and Subway Surfers by SYBO, celebrated their tenth anniversary in May 2022, topping 3 billion downloads, demonstrating the longevity of mobile games developed on Unity. Second dinner also launched Marvel Snap into several global markets and another success that was made with Unity. Beyond mobile, Unity continues to perform superbly on other platforms. Nearly half of the steam games for PC were made with Unity in 2021.\n\nAnd those names continue to break through to the steam charts, where this quarter, 13 of the top 20 games in May alone were made with Unity. And we've seen the fantastic new experiences here, like rising from unlock where the performance from dots enables Sun Lock to scale up the world size and the number of players, it was a key factor for them, their choice of Unity. Neon White developed by Angel Matrix and published by is another excellent example of how a small development team can punch a other way using Unity. And from these newest of game studios to send to the longest story, we saw great new console games, including Little Noah by Cygames and The Centennial Case from Square Enix.\n\nUnity also enables creators to take their content to long establish a newly emerging growing platforms such as VR and AR. In VR, on Oculus Quest, Unity Games made up 80% of the most popular games in July and 72% of the top selling games. These are very small sets of data points on the scale and scope of gaming with Unity. Wherever you find a platform or device with usage around the world, from the largest scale mobile platforms, PCs and consoles to the latest in VR devices.\n\nYou're going to find an active and committed community of creators and they're going to be using Unity to create compelling games to entertain those users. Now I want to turn to our create business outside of games, which includes media and entertainment, commerce, industrial and manufacturing, architecture and engineering, construction and many other industries. I want to share some customer highlights. I'm going to start with, one of the top three construction companies in Japan.\n\nIn the second quarter, we expanded our relationship with them to help them develop a digital platform to drive major efficiencies in their construction process. Specifically, their internal users will use real-time 3D as a foundational tool for the design and construction work. chose Unity because they see our solution as the most extensible and scalable solution available. Also in the second quarter, we signed our single largest digital twin agreement to date.\n\nThis is a deal with CACI, one of the U.S. government's leading IT service partners. Through this relationship, Unity will help the government defining human machine interfaces or HMI for the aerospace applications and beyond. These applications demand an interactive, robust user experience very much like games.\n\nNow the ultimate goal of this program is to create a reference architecture based on Unity that all U.S. government agencies use for system design and HMI development. Also during the second quarter, we signed our first agency customer, eg plus is a world-class content and creative production company based out of Long Beach, California. And in addition to providing eg plus with the technology required for the internal development teams to create real-time 3D content, we're going to be working with them on many projects such as designing the next-generation real-time 3D product configurators for a leading auto manufacturer.\n\nAnd we continue to strengthen our partnership with Mercedes, Daimler. This quarter, we announced that from 2024 forward, all of Mercedes, Daimler cars will be equipped with an HMI made with Unity. With this agreement, Uniti is now an integral partner of one of the world's leading and most storied automotive OEMs. Together, Mercedes-Benz and Unity are taking next-generation user interaction such as Maps, Avatars and AI Concierges and in-car entertainment to a new level by implementing on a real-time 3D engine.\n\nWe are proud to have found a new partner Mercedes-Benz to equip their vehicles with our visual fidelity and performance, including our years of experience in mobile gaming. These are great examples of the power of real-time 3D to help companies drive innovation, efficiency and engagement across their business in new ways. From building more efficiently and safely to operating complex physical machines to helping customers discover new products and services to our relationship with something as personal as your car. The growth of digital twin technologies in these industries and many more is large and it's accelerating.\n\nAnd we're continuing to invest in functionality and partnerships to ensure that we can meet our customers' needs and capture value in this space. This includes investing in product innovation like Neural Radiance feels or NERF, rendering for visualizing zero touch-up object captures to make it possible for everyone to build their own digital twins and advanced synthetic data creation so that future algorithms and machines can be trained more effectively and efficiently. It also means working with the world's best partners to broaden our cloud strategy and thereby our ability to service more customers. We have a long-standing relationship with Google Cloud and have seen incredible results through our customers.\n\nIn addition, yesterday, we expanded our cloud capabilities by announcing a strategic partnership with Microsoft. This partnership brings the Azure cloud to the community of Unity developers around the world to power real- time 3D experiences across industries. We are working together to make it easier for game developers to reach their players across Windows and Xbox through improved tool and more. I'm also super excited about our breakthrough partnership with Capgemini.\n\nWe will jointly define and execute sector-specific solutions and professional services to deliver tailored platforms for our customers. This new global partnership will focus on sectors and use cases where digital customer employee experience will benefit most from consumer goods and retail to telecommunication, energy and utilities and much more. Now real-time 3D has one challenge that we must continue to work to address and that is the enormous need for 3D content. 3D content creation is complex and it's expensive with large file sizes and complicated rendering techniques required that in order to deliver results that are tuned to a specific device and platform.\n\nIt requires specific expertise in a variety of highly trained and technical artists in order to be successful. That's why our democratization mission includes the needs to provide powerful artist tools that make artists significantly more effective and productive and that make it possible for more people to create in 3D. This is necessary given the long-term growth of real-time 3D, and it's also a significant opportunity for TAM expansion for Unity by serving the needs of these creators. This is why we acquired Weta last year.\n\nAnd we're on track in making strong progress to deliver these extraordinary tools that power some of the world's most amazing content into the hands of creators in both VFX and real-time fields. Today, we have more than 20 million cloud-based vendor hours on Avatar 2 and other productions. And this quarter, we completed our full mirror environment for the Weta tool chain, a first ever outside of Wellington, New Zealand. Our Weta Digital team is also defining and evolving the Universal Scene descriptor or USD standard so that we can represent procedural content such as hair and fur grooms, vegetation, and much more.\n\nAnd also things like physical camera, lighting and materials and deliver it consistently across Unity, Weta Digital and other artist tools. Our ultimate goal is to evolve the USD schema standards for industry at large. Now to bring Weta tools to real time, here is an example where we've implemented our first version of clustered hair simulation into Unity as a novel GPU tile-based software restoration with analytic anti-aliasing and improved advanced physically based hair lighting model for film quality hair strand rendering in real time. That's a mouthful.\n\nWhat this really means is that we can efficiently render millions of individual hair brands, all moving independently and uniquely without artifacts while accurately preserving the hair highlights and the beautiful way that like shines through software. In short, we can make it look and feel real. Let's take a look at an example. All right.\n\nThis is what happens when you connect these powerful art tools with Unity. No longer the domain of VFX and film. This is the line, and it's running in real time on Ambition 5 through Unity's high-definition render pipeline. The Lion features advanced machine learning and procedure art tools, including character deformation from Ziva, procedural vegetation and terrain from SpeedTree and more with a powerful capabilities to read us with tooling, which bring these characters to life.\n\nWe told you that our goal is to drive up creative productivity and capability. And I want to focus on this quote by one of our artists working with our Weta Digital wig tool and how much it speeds up the time to awesome. Weta is a different way of working. It's actually the fastest gondola ever used a high-quality hero room that would take me several months to do for production in another grooming package is much faster to do in rig in a mere couple of weeks with higher fidelity and mini rooms go from weeks to one or a few days at far better quality levels and artistic controls throughout.\n\nEven when you have to react to detailed art direction and feedback notes, like adjusting a specific strand from a reference shot, it's easy to author and wig. Sara Hansen, tech artist, Ziva Unity Technologies. I'm very excited to share that we expect this work to be in preview with customers this year and for our first Weta tools to be released early next year, well ahead of our initial M&A integration schedule. With that, let me turn the call back to John.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nMarc, the lion demo is absolutely groundbreaking. In my 25 years in gaming and entertainment, I have had to great graphics many times. Your team has set a new bar. Before the lion, I'd always compared what I was saying to the best I've seen before in a game or a film.\n\nThis is the first time my comparison is to the real world. Congrats to your team for an amazing achievement. Let's now cover the progress in operating. We have fixed the data challenges and have strengthened our products with new features.\n\nWe've also put in place monitoring mechanisms that allow us to more closely track our performance so that we can react faster when something goes wrong. And as a result of our work, we are seeing leading indicators such as audit pinpoint or consistency and accuracy improve, showing that our interventions are effective. And we continue to innovate. We will continue to launch customer meaningful features in the back half of the year that aim to improve our customers' return on ad spend.\n\nAs mentioned at the beginning of the call, the revenue uptick is slower than modeled due to a combination of recent negative macroeconomic factors and the complexity of accurately forecasting the timing of the change in revenue trajectory with the monetization business. Operated revenue of $159 million is down 13% year-over-year. This compares to $113 million in revenue in the second quarter of 2020 and $183 million in the second quarter of 2021 when we grew 63% year on year. Let me turn it to Ingrid to give you a more detailed status update.\n\nIngrid Lestiyo -- Operate Solutions Leader\n\nThanks, John. Last quarter, in addition to external factors, such as the competitive landscape, we identified two separate yet interrelated issues that impacted our monetization business. One data quality issue and the other, our audience pinpoint products accuracy. Starting with the data quality issue, this one is behind us.\n\nWe have removed the bad data that was inadvertently ingested from interacting with any of our models. Furthermore, we have fortified our monitoring capabilities and observability for our machine learning models to mitigate these rare types of events, should they occur again in the future. In this process, we also improved our data incident response time to address issues more comprehensively and promptly. We have added significant investment in our audience product, innovating on our models and customer experience to address our past scaling challenges.\n\nAs a result, we have seen performance and accuracy improvements at scale, particularly in our contextual product, that is most meaningful for our customers impacted by privacy changes. We are seeing our progress reflected in customer success. Trail mix, for example, is a studio responsible for the creation of the hit title, Love and ties, winner of the best casual game at the TIGA Games Industry Awards. The studio collaborated with Unity from early stages all the way up to global release to refine that targeting, test creatives and scale up their user acquisition efforts.\n\nUsing Audience pin pointer, the team was able to test the target audience and accelerate their growth journey after global release, achieving strong engagement metrics, showing 60% retention by day one and as well as retaining players an impressive 20% by day 30. We remain confident in the long-term outlook for monetization in games. In fact, we are not shying away from making bold moves during this time. We seized an opportunity and announce our intention to merge with ironSource to leapfrog our road map and accelerate value creation for our customers, Unity and our shareholders, which John will touch upon in a moment.\n\nLet me close with an update on Unity Gaming Services, or UGS. UGS is a suite of tools and services and build to simplify every developer's ability to create host and manage their games in the cloud in a single dashboard experience. Today, more and more games are multiplayer social experiences that are connected in the cloud. We designed UGS to be modular to let creators select the best tools for their use case, whether the game was built with Unity unreal or any other game engine.\n\nWith UGS, we provide a platform that hosts many of the world's most popular games with multiplay, enable proven and robust voice and chat with the box while simultaneously measuring their game performance and engaging their players with Unity analytics, all within one UGS platform. UGS supports creators with a consumption pricing model so they can work the way they want and only pay for what they use. That's a powerful business proposition, and we plan to take more of our platform in that direction in coming years. Today, we are simplifying these services.\n\nSo small and large developers alike can launch experiences at the scale of their choice. Self-serve functionality allows developers to access and explore our products on their own, increasing our market reach. A few weeks ago, we published a case study with AXL bot studios for Standard 2, a first-person shooter with millions of players, illustrating how they self-serve integrated voice chat from VVOX four years after their mobile games launched to supercharge their in-game community and gain a 63% increase in day 90 player retention. And this quarter, we are excited to launch multiplay game server hosting and matchmaker self-serve functionality to bring battle-tested AAA multiplayer services to developers of all sizes.\n\nMultiplayer games are amazingly fun but highly complex to develop and often require large teams and investment. Since our beta in October last year and becoming generally available in June, the signs are promising for UGS. We have seen more than 50,000 games -- game developers signed up with 2,300 new customers added since our GA launch in June. While it is early days, we are optimistic that UGS will become a meaningful part of Unity's technology offering.\n\nWe look forward to sharing more customer success and performance metrics from across the UGS platform next quarter. With that, let me turn the call back to John.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nThanks, Ingrid. As I said at the top of the call, the proposal was received and we will not comment at this time. A few weeks ago, we announced Unity and IronSource intend to join forces and will combine creation and growth into a single platform to increase creators' success. Today, I want to spend a few minutes framing the key messages and how we, together, will help creators find success consistency based on science and not just intuition and make.\n\nAs a reminder, the key message is shared when we announced the intent to merge with IronSource are: First, we intend to accelerate our path to becoming a leading end-to-end platform combining creation and growth in a way that creates great value for our customers. Game companies and companies and industries beyond gaming will be able to produce better content and enjoy superior user acquisition, later customer success. We expect this will propel their business and ours. Second, we expect to capture synergies from combining our platform driving greater customer success and enabling the new Unity to deliver $1 billion adjusted EBITDA run rate by the end of 2024.\n\nAnd third, our combined company is expected to reflect a roughly 50-50 revenue mix between our creation and growth technologies and services. Our intent is to unite the work of creating content and engaging users in one interim process where data flows from the growth platform in the creation process and makes the game better. It will start with a piece of content, perhaps a single level for a mobile game. That level will be married with sophisticated tools for user acquisition creative tests to enable a creator and their growth experts to understand and learn from very early indications of user engagement, modernization and the cost to acquire a user and the engagement and where relevant, the LTV of that user.\n\nThis is what game developers have done for years with A/B testing and learning from soft launches, but we can make it easier, smarter and more effective. Based on this learning, creators iterate, change aspects of the content, the advertising and user acquisition strategies driving more financial success. And as most experiences in the future will be live experiences when the content will change over time, this process will continue. Our customers' creation and growth teams will be in a continuous process of learning and improvement or greater data scale will make the feedback look more powerful for all games created with Unity.\n\nNat, together, Unity and ironSource strive to bring unprecedented value to our customers. We aim to provide what every customer needs, whether that customer is a mobile game, a console or PC game and whether that developer seeks to monetize or simply create for their own and their friends enjoyment. With that, let me turn the call to Luis to go through the numbers.\n\nLuis Visoso -- Chief Financial Officer\n\nThank you, John. In the second quarter of 2022, we delivered revenue of $297 million, up 9% year over year and at the high end of our guidance range. Create performed strongly with revenue of $121 million, up 66% from a year ago. As expected, operate was impacted by the issues discussed last quarter.\n\nRevenue of $159 million declined 13% year over year. Strategic partnerships and other delivered $18 million in revenue, down 2% from a year earlier. As we have seen over the years, the strategic partnerships and other business, quarterly results are impacted by the timing of key platform arrangements. At the end of the second quarter, we had 1,085 customers with trailing 12 months revenue about $100,000.\n\nThis compares to 888 customers at the end of the second quarter of 2021, an increase of 22% year over year. This lower rate of growth in our customer count above $100,000 is driven by operate. Our 12-month trailing net dollar expansion rate came in at 121%, down from 142% last year. The drop in our net dollar expansion rate is driven by operate.\n\nOur second quarter non-GAAP gross margin was 74.1%, down from 81% a year ago. The year-over-year gross margin decline is mainly due to lower mix from monetization, which has a higher gross margin than the average as well as the impact of as engineers supporting the business are charged to cost of goods sold. The non-GAAP operating expenses in the second quarter increased 19% as compared to the second quarter of 2021. On a year-over-year basis, R&D sales and marketing and G&A expenses grew 26%, 18% and 4%, respectively.\n\nAll three line items saw favorable expense trends due to slower hiring, lower professional fees and favorable exchange rates. We closed the quarter with 6,246 employees. Non-GAAP loss from operations for the second quarter was minus $44 million or minus 14.9% of revenue. This compares to guidance of minus $62 million to minus $64 million.\n\nWe bid guidance as we're making strong progress against the $100 million cost savings program that we announced last quarter. Cash flow from operations was minus $43 million. We had -- sorry, 298 million outstanding and 360 million fully diluted shares at the end of the second quarter. Moving on to guidance.\n\nFor the full year, we're providing guidance of $1.3 billion to $1.35 billion, as mentioned when we announced the intention to merge with ironSource. This is a reduction from the $1.35 billion to $1.45 billion shared during our last earnings call. The full year guidance reduction is driven by recent negative macroeconomic factors and the complexity of accurately forecasting the timing of the changes in trajectory of the monetization business. We believe that the $50 million range in our full year guidance is appropriate given the uncertainties in the ad market.\n\nWe continue to invest to strengthen our products with additional features that we expect will get our third and fourth quarter through stronger footing. For the third quarter, we expect revenue between $315 million to $335 million, which implies fourth quarter revenue of $368 million to $398 million. At the midpoint of these numbers, we expect the third quarter to grow 14% year over year and the fourth quarter to accelerate to 21% year over year as we expect strong performance increased throughout the year and improving performance in operating. We continue to be commencing non-GAAP breakeven profitability in the fourth quarter of this year despite the lower revenue expectations.\n\nAs mentioned, we're making strong progress against the $100 million cost savings program that we announced last quarter, while preserving the most critical investments in innovation that will drive our growth. For Q3, we're forecastinga non-GAAP operating loss of $35 million to $50 million. For the full year 2022, we expect a non-GAAP operating loss between $95 million and $115 million. The higher losses for the full year reflect a more gradual recovery ramp in Operate partially offset by additional cost savings.\n\nWe expect 301 million primary shares and 375 million fully diluted shares by the end of the third quarter, and 376 million fully diluted shares by the end of the year, excluding the issuance in connection with our pending ironSource deal and any related stock repurchases. We continue to believe that there is a very large opportunity in front of us and that we are very well positioned to capture it. Our create business is performing strongly, and we expect sustainable growth going forward fueled by our innovation and market tailwinds. We continue to innovate on our operate business by delivering products that enable our customers' success by delivering performance and resiliency at scale.\n\nWe're confident that the ironSource merger will make us stronger as we offer our customers an end-to-end platform that will benefit creators and shareholders. Finally, as you may have seen, we're also working to accelerate innovation and growth in a key market, China. Recently, we entered into an agreement with some of our leading partners in China to form a new joint venture that work on in Unity China. To form this venture, Unity will contribute all of its operation in China other than Unity ads.\n\nThe business delivered approximately $50 million in revenue in 2021. We created a venture with investments from a number of leading technology companies, including Alibaba, China Mobile, GBs,Oppo, PCI Tech and Doujin Group at the evaluation for Unity China of $1 billion. Unity will retain majority ownership and control over Unity China, which will operate solely within the Greater China region and be governed by a board consisting of Unity executives and major investors. As such, we will continue to consolidate the China financials.\n\nThe transaction is subject to customary closing conditions, which we expect to complete within the next few weeks. With that, let me turn the call over to Richard for the Q&A section. Thank you.\n\nRichard Davis\n\nGreat. Thank you very much. So as before, we will have you promoted to a panelist, and you can ask some questions here. So Kenneth and Eric, if you can promote the team to analysts, that would be great.\n\nHere we go. First one with a digital hand is Stephen Ju at Credit Suisse.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nOK. So, John and Marc, if you're AWS, you know exactly who you're calling at any given company. But for Unity, it was not always clear to us who you're placing that call into -- on the create side. So as you talk about how create's nongaming revenues now accounting for 40%.\n\nHow has that selling motion and particularly to those companies outside the game industry evolved over time?\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nMarc, I'll take the top of that, and I'll let you build on it with some examples of that works. So Steve, a couple of thoughts here. One, we've gone through a pattern over the last few years where we were originally doing things that were -- they didn't know who we were. They didn't know how to use real-time 3D.\n\nAnd the deals are very, very small. Now what we're seeing is a continued inbound from the top of the funnel and we got a good go-to-market strategy. Mark will talk about that. And we're seeing second and third deals with the same customers.\n\nSo we got a land and expand going. And we're also writing larger deals as we continue to progress because people are understanding what they can get with real-time 3D community. So -- the reason we're seeing the gain as a percentage of our business, more customers, larger customers land and expand. And Marc, do you want to build on that one?\n\nMarc Whitten -- Create Solutions Leader\n\nYes. Thanks, John. And the other part there is certainly over the last several years, we've been building unique solutions that are helpful for all sorts of different industries as they look at how they can take advantage of real-time 3D. And you can see that in tools like Forma, which is used for a lot of product configurators and auto and other spaces to reflect in visual live, which are used around architecture, engineering and construction to other tools that we have like Pyxis, which is about how do we manage large amounts of 3D data, which is extraordinarily common problem in that space.\n\nSo as we've understood the needs of these customers, we've also built the parts that work in conjunction with the core Unity engine an editor to make it easier for them to work. And then the last part that I'll just sort of add on top of what John said is this is a real place where our Accelerate Solutions team has been incredibly powerful because these -- many times, we have companies coming to us just getting started in their journey of transformation around real-time 3D. And together, through our professional services organization, we can build something together help them learn and then often leads to repeat business both in kind of continuing ARR and in future professional services support. And it's one of the big reasons we went after other partnerships like Capgemini because we see more and more opportunities to enable a broad ecosystem of channel partners to help in similar ways.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nJust one last point on this. If you go back a couple of years when we were preparing for our wood show around the IPO, I think a number of investors kind of looked at me when I said that we expected it would be three to five years where our -- we would catch up with our games business, but games would continue to grow strongly. It's actually happened exactly like that. And frankly, just there's so many more industries out there for whom real-time 3D answer.\n\nWhat they're doing is they're creating essentially digital twins, real-time digital twins, where they're using them to simulate the future and understand the presence, the way that makes their business is stronger, their customer relations more less than more engaged. So they're winning and they're coming on to the platform in a bigger way than they were a year ago or we feel great about the trend line.\n\nRichard Davis\n\nAnd Kash Rangan at Goldman Sachs.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nI don't know if you can see me out there as, but first of all, thanks for all the details, John and crew and the tremendous progress in the create side. On the operate, I'm going to probably boot the question since I'm not an expert in mobile gaming and advertising. But, John, you talked about how you have a good handle on data, data versus macro versus competitive impact? I mean how much better informed is the company on all these three potential contributors to the issues that caused a shortfall in? And going forward, what are the -- I know you mentioned a little bit about the guardrails that you have in place to ensure that you won't have this issue. If you don't mind elaborating on that, that will be great as well.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nSo again, I'll tap this and ask everybody to join. The -- and by the way, Kash, thanks for the 11-part question. I'll try to keep it to a reason. So first off, on macro on the operate side, the majority of our business -- the vast majority of our business and operate within gaming.\n\nAnd as I've said a few times before, the only thing that is in larger numbers than games is pundits talking about the game industry and the recession and all the rest of it. I'd just start by saying this. The game industry remains a very robust industry and it's a growth industry. You can look back at the last five or six recessions, I've looked back all the way to the 80s in a prior life.\n\nAnd over almost any three-year time period, you see double-digit growth, typically averaging out the change or better. Yes, there's short-term headwinds that occur from time to time. And in the present period, we're sort of dealing with extremely high engagement when people stay home for COVID together now that we're looking into a little bit of a headwind, which is driven macroeconomic factors. And you've seen that reported out by a number of game companies where a little bit less revenue from bringing down some forecasts.\n\nWe understand there's a near-term headwind in the game industry relative to that mid-teens growth or better than we've seen for so many years. And we expect that we'll persevere through that, and this is a long-term growth space. So we feel very, very good about that. Now in terms of the issues around our own platform, at a very high level, I can tell you one of the things Ingrid did, and I'm really proud of the work that she had our team have pulled together here.\n\nThey pulled together eight task teams. It literally worked seven-day weeks on everything from resiliency and redundancy to the data side, to the engineering issues we wanted to focus on to the new products and features. It has been a magnificent effort on their part. And what they've been able to show me is really strong KPIs around some things that are pre-revenue, but you need accuracy around pinpoint or for the revenue to ultimately grow.\n\nAnd I'm going to let her expand on that, but it's tough coming from a period where we've had some misses, but it's great to see the team rebound top of their game and really start to execute, which is what I'm saying from my vantage point. Ingrid, do you want to add to that?\n\nIngrid Lestiyo -- Operate Solutions Leader\n\nYes. Thank you, John. On our part, just to build on what John said about the task forces, we've added significant investment in audience pin pointer. And across the board, One of the things just connecting your macro question to this is that constraint drives focus and the best innovation.\n\nSo during this time, we've become really disciplined in our resources, we've doubled down on those ad products and services that drive the most value to our customers and Unity. And without the luxury of excess spend, this is really an exercise to drive performance with less for our customers such as finding more installs with fewer dollars, right? So this means that we need to innovate and find new ways to increase the velocity of our model development, for example, pushing the boundaries of machine learning, digging into every part of our system optimization opportunities and making sure that our systems are all resilient to anticipate further incidents that happens. And we really expect all of these actions to provide resiliency both in the systems as well as performance in the current challenging environment. So we expect to emerge -- our goal is to emerge on the other side with our products stronger than ever that enables us to best capture the market opportunity and hard not to take cash.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nWe're measuring a lot of things we didn't use to measure and we built redundancy and resiliency aroundit. I see data sets that I wasn't saying around data accuracy in a variety of things that give us an early warning for things that we would otherwise want to deal with. No data-driven business is without errors. And now we're in a position to catch them fast and fix them as we go along and not suffer the kinds of challenges we had earlier in the year.\n\nRichard Davis\n\nAnd next is Clark Lampen at BTIG.\n\nClark Lampen -- BTIG -- Analyst\n\nI had two, if I may. So the first, I guess, like recognizing what you're talking about, John, with sort of the crosscurrents with macro and sort of visibility relative to, I think, based upon the comments last quarter you're in the second 90-day phase right now where you need to kind of rebuild data. And I'm curious how you guys think about maybe potentially offering customers additional incentives to drive platform usage in what seems like maybe a difficult ad market? And then separately as the solutions and range of products is becoming larger and more compelling for your gaming customers, I'm curious if you guys think you have flexibility or added flexibility now with the approach to sort of bundling products in a way that you could still sort of maximize dollar generation, but maybe push your take rates and monetization in a way competitively where the platform becomes more compelling.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nSo one, I can't say that we would never do incentives, but that's generally a very firm solution and doesn't really yield long-term returns. And so that's not high in our playbook, and it never will be hurting our playbook. Again, it is part of the portfolio of think companies like ours do. But we're very cognizant of focusing on the long term, and I know this can be frustrated to investors at times, a little less focused on the quarter.\n\nThe NPV is higher that way. So that's important to us. The second thing is we're in the very early innings of UGS. And UGS is a very powerful portfolio of tools and products and features that every customer needs as they go to market with their game or application.\n\nOne of the things that I learned when I got into mobile, this now goes back 20 years. But you build this thing, and then suddenly there's like 50 STKs you need to implement, and it covers a gamut of things. And there's a bunch of services you need to invest. And I think we've all watched game companies go online for the first time or mobile for the first time at just fall flat around the ecosystem and as a soup of all the things that they need to bring on board.\n\nIngrid's team brought really sharp focus to that and took all of these services and built a system but basically, you set it up once that it works across all this portfolio of services. It's a huge advantage. It's one source of truth. Now this isn't completely plumbed to every level, but we've seen good uptick and take on this one.\n\nOur customers like it, getting good reports back. And I think it's actually a huge opportunity for us in the years to come because we're really the only company out there in a position to do what we've done. And of course, they start with us and create 74% of the time, but it's a good starting point. When you take -- whether it's matchmaking or hosting, advertising or analytics, voice and the other systems that we pull together, it's a really strong offering.\n\nRichard Davis\n\nAnd then I think we have Matt Cost at Morgan Stanley.\n\nMatt Cost -- Morgan Stanley -- Analyst\n\nOn operate, just to zoom in a little bit here. If the data quality and pin pointer issues hadn't occurred earlier in the year, would operate revenue have been at the 160 level you reported this quarter just because of macro? And if not, how much work is left to do there in terms of improving the tools and scaling spend? And then secondly, on the China JV, I think Greater China was about 15% of your revenue last year. It's already a decent sized business. What will the JV allow you to do that you can't do today?\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nSo, Ingrid, do you want to take that on the Operate question or I can pick up in the beginning of that would be helpful.\n\nIngrid Lestiyo -- Operate Solutions Leader\n\nYes. I think in terms of the specific numbers, look, it's a combination of all of those things. It's hard to kind of divide up like what component is attributed to macro versus audience pin pointer and data issues. But absolutely, I think that the -- obviously, the data issues and audience report at the beginning of the year, impacted our performance.\n\nBut now we're at a place where the data incidents are fixed and behind us and the audience product is strengthened day by day. So right now, we're seeing kind of a slower uptick in advertiser spend just because they're more judicious due to the macroeconomic factors. So that's what's what we are seeing right now.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nYou're right, Matt, to recognize there's both in there. For clarity on our last full earnings call. We talked a little bit about the macro, and we talked a lot about the self-inflicted aspect of this. And that's just basically a philosophy of ours as we would rather focus on the things we did wrong or right, more so than the macro environment when it's working against us.\n\nWe didn't want to give too much of a mix message last time we had things we needed to deal with, and we dealt with them. On China, first off, I want to congratulate Luis and some members of his team in jumbo and China do incredible work here. But at a very high level, we think this sets us up for more sustained higher level growth for years to come than would otherwise would have. What we managed to do is take most of the leading technology companies in and around our space and made the And in doing so, they stand behind us on gaming, but they send the harness in industries beyond gaming.\n\nAnd it also allows us to take advantage of the opportunity to invest in a market where the engineering capabilities are really strong and build tooling that supports very specific use cases in China. Now it may seem like everything is the same, but -- it's not the case, both in the digital twins arena and in the gaming industry. There are a number of things that operators in that part of the world do in terms of business practices and development practices that are different. The way of example, a lot more outsourcing.\n\nAnd so that involves a different way of interfacing with a product, more cloud-centric, more web issues. So by doing this, I think we strengthened our business and set ourselves up for a path for more sustained higher level growth. Louis, you want to add on that one at all?\n\nLuis Visoso -- Chief Financial Officer\n\nYes. The only thing I would add, John, is that the 15% math that you quoted, that's the total China business as a percent of our revenue, not all the businesses are in scope. It's just the create business, and that's 5%. So that's the $50 million I mentioned in my prepared remarks, Matt.\n\nRichard Davis\n\nOK. I think probably our last question is I get one more, Jason Bazinet at Citi, and then we'll try to fit one more in after that.\n\nJason Bazinet -- Citi -- Analyst\n\nI'll try and go fast. Can I -- just to clarify on the China JV. Am I right that there's going to be an inflow of about $1 billion of cash, and then we're going to be modeling noncontrolling interest on the income statement once this deal closes?\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nLuis?\n\nLuis Visoso -- Chief Financial Officer\n\nYes. We will still consolidate China. We're forming a joint venture, and we will get $220 million, and that will stay within the JV. So there is no cash flow coming into.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nAnd we remain a majority shareholder and control the board. And there's a number of operating relationship agreements put in place between our enterprise globally and the China operation. It's also worth noting that leadership team is led by an executive I've worked with around in my last company for well over a decade, go exceptionally well in trust. Junbo Zhang is a very strong leader ex Microsoft EA and now really almost a decade now at Unity.\n\nSo we feel really good about the team we have there.\n\nRichard Davis\n\nAll right. And then our closure question is Dylan Becker at William Blair.\n\nDylan Becker -- William Blair -- Analyst\n\nMaybe one since we didn't touch as much on it. I'd love to get in the strategic SI partnerships, but maybe for Mark to a little bit of incremental color on the partnership with Azure with the release yesterday, can you talk about kind of some of the expanded capabilities, what this can mean for creators and potentially enable and unlock that further kind of Create and Operate a combination of tools for the masses?\n\nMarc Whitten -- Create Solutions Leader\n\nVery excited to deepen our relationship with Microsoft. Obviously, we're already very strong partners, especially on the Xbox side and with HoloLens. But when you go in and you think about where real-time 3D is going, we talked about all these use cases around digital twins. And we talk about just the size of games and the amount of content.\n\nOne thing that's clear is that 3D has a unique set of needs. Often the file sizes are very large. You can be talking about trillions of points in a point cloud billions of polygons and extraordinarily high needs for compute power, whether it's on the creator side when it's being created or on the side when it's actually being consumed. And so we're excited to work with Azure in order to build out the set of services that we believe will most help our creators, whether it's in games, or digital twins or professional art.\n\nIn the near term, I think some places where you'll see it first are areas like DevOps. We are doing a lot of work around cloud build around source control. Again, it's a space that's very different when you're talking about 3D assets. versus non-3D assets.\n\nDigital Twins. It's a place that we've already actually been working closely with Microsoft on the sell side and integrating with their digital twin platform as well as our services together as we build out more cloud services is a very powerful thing. And as you've heard us talk about in professional art with things like Weta Digital, the ability to have access to cloud power is actually a critical component of how we think we can deliver these productivity increases for artists around the world. So the start of a partnership.\n\nThere's a lot of work to go to sort of be ready for those, but it will impact sort of soup to nuts the things that we're doing across create.\n\nRichard Davis\n\nWell, thank you very much. We really appreciate all of your interest and questions, good stuff, and we look forward to connecting to all of you over the coming weeks in either at conferences or on follow-up phone calls, you can always reach out to Stephen Palmtag and myself, and we'll try to help you out kind of navigate these exciting waters. So thank you very much. And, John, if you want to close it up, that would be great.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nSo exciting times, everyone. Thanks for being there for us. We couldn't be more excited about the opportunity in front of us, and we're prosecuting on that front as best we can. Aggressive as always, and excited.\n\nThanks, all.\n\nLuis Visoso -- Chief Financial Officer\n\nThank you. Thanks.\n\nDuration: 0 minutes\n\nRichard Davis\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nMarc Whitten -- Create Solutions Leader\n\nIngrid Lestiyo -- Operate Solutions Leader\n\nLuis Visoso -- Chief Financial Officer\n\nStephen Ju -- Credit Suisse -- Analyst\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nClark Lampen -- BTIG -- Analyst\n\nMatt Cost -- Morgan Stanley -- Analyst\n\nJason Bazinet -- Citi -- Analyst\n\nDylan Becker -- William Blair -- Analyst\n\nMore U analysis\n\nAll earnings call transcripts"
}