{
  "companyName": "Arlo Technologies",
  "companyTicker": "ARLO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/arlo-technologies-arlo-q2-2022-earnings-call-trans/",
  "content": "Arlo Technologies (ARLO 1.45%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. At this time, all participants are in a listen-only mode. Later, we will conduct a question-and-answer session. [Operator instructions] I would now like to turn the conference over to Erik Bylin.\n\nPlease go ahead, sir.\n\nErik Bylin -- Investor Relations\n\nThank you, operator. Good afternoon, and welcome to Arlo Technologies second quarter 2022 financial results conference call. Joining us from the company are: Mr. Matthew McRae, CEO; and Mr.\n\nGordon Mattingly, CFO. The format of the call will start with an introduction and commentary on the business provided by Matt, followed by our review of the financials for the second quarter, along with guidance for the third quarter and full year provided by Gordon. We'll then have time for any questions. If you have not received a copy of today's release, please visit Arlo's investor relations website at investor.arlo.com.\n\nBefore we begin the formal remarks, we advise you that today's conference call contains forward-looking statements. Forward-looking statements include statements regarding our potential future business, operating results, and financial condition, including descriptions of our revenue, gross margins, operating margins, earnings per share, tax rates, expenses, cash outlook, guidance for the third quarter and full year 2022, transition to a services-first business model, the commercial launch and momentum of new products and services, strategic objectives and initiatives, market expansion and future growth, the effect of our anticipate awareness campaign on future growth, partnership with Verisure and Calix, continued new product and service differentiation, supply chain challenges, transportation costs and the impact of COVID-19 pandemic on our business, operating results, and financial condition. Actual results or trends could differ materially from those contemplated by these forward-looking statements. For more information, please refer to the risk factors discussed in Arlo's periodic filings with the SEC, including the most recent quarterly report on Form 10-K and quarterly report on Form 10-Q.\n\nAny forward-looking statements we make on this call are based on assumptions as of today and Arlo undertakes no obligation to update these statements as a result of new information or future events. Several non-GAAP financial measures will be discussed on this call. A reconciliation of the GAAP to non-GAAP measures can be found in today's press release on our investor relations website. At this time, I would now like to turn the call over to Matt.\n\nMatt McRae -- Chief Executive Officer\n\nThank you, Erik, and thank you, everyone, for joining us today on Arlo's second quarter 2022 earnings call. Our services first strategy and excellent execution produced another quarter of record-breaking results in Q2. Total revenue reached $119 million, up 21% year over year and well above the top end of our guidance. We are currently seeing healthy demand and resilience in the Arlo customer base, which contributed to the stellar results and our ability to raise guidance for the full year.\n\nOur annualized recurring revenue, or ARR, continued to grow at a rapid pace, exiting Q2 at $117 million, up 67% year over year. As a reminder, our ARR is the fastest-growing and highest margin portion of our service revenue and represents the annualized recurring subscription revenue we derive from our paid accounts. Total paid accounts were up 113% year over year with Arlo, adding 206,000 paid accounts in Q2, an increase of 41% year over year and flat sequentially, as our migration to the new business model is complete and additions take on the normal seasonality of our sell-through with a 90-day lag for the three-month free trial period. In addition, I am delighted to announce that on July 15th, we achieved another significant landmark in our services business, as we surpassed 1.5 million total paid accounts.\n\nAs we shared on our Investor Day presentation in March this year, the accounts we capture through our domestic retail channel have an ARPU of $9.35 per month and when combined with our low world-class churn metrics translate to an LTV of $550 per user based on Q4 '21 data. With continued strong ARR growth, service revenue reached $32.8 million, up 30% year over year, and marked a record for the 12th consecutive quarter. Despite the additional complexities and expense driven by the pandemic supply chain disruptions, we posted our highest ever non-GAAP gross profit of $35.1 million and our third consecutive quarter of non-GAAP operating profit outperforming the high end of our guidance for non-GAAP EPS, which came in at a profit of $0.01 per share. To maximize the opportunities presented by our successful services first business model, Arlo is executing a long-range plan that focuses on three primary areas of the business to drive revenue growth, margin expansion, and through that shareholder value.\n\nFirst, while our products and services regularly garner best-in-class accolades, the No.1 reason people don't buy Arlo products is because they have not heard of Arlo. This month, we are excited to commence the rollout of our brand awareness campaign, which we will conduct in a targeted manner that focuses on new household formation to drive incremental subscription revenue. While we are kicking off the targeted marketing in Q3, we expect the bulk of the increase in POS to materialize in 2023. More information including examples of our campaign creative can be found at arlo.com/protect.\n\nSecond, we are expanding our product portfolio to address new segments and new markets. An innovative new app called Arlo Safe will provide personal protection for an individual or entire family by offering one-touch emergency health, family location, and safety features, and auto crash response. And our new innovative security system will bring full sensor-based security functionality to our ecosystem of smart cameras. Both of these provide significant opportunities to drive new subscriptions, and we expect these to be available before the end of the year.\n\nAnd third, Arlo will continue to broaden our routes to market. Our most prominent example of this to date has been our Verisure relationship, which has been very successful, driving outsized growth in Europe and an impressive 46% of our Q2 revenue. We also formed a partnership with Calix last year in which Calix integrated Arlo services into their platform to broadband service providers around the country. And most recently, our launch of Arlo Go 2, with partners like Verizon and T-Mobile, is providing cellular-based smart security to numerous market segments, and often comes with unique financing offers or subsidized hardware pricing, lowering the initial acquisition costs for consumers.\n\nArlo's long-range plan is built to realize our three- to five-year targets of 5 million paid accounts, $300 million in ARR, and double-digit operating margin. The outstanding results this quarter show that our focused execution is on track to achieve these ambitious metrics. We are tracking the macroeconomic trends closely, and while they may pretend a softness in consumer demand and higher execution risks in the second half of this year, our confidence in reaching our long-range plan targets remains unchanged. And with that, I would like to hand the call over to Gordon who will provide more insight into our financial performance, operational details, and outlook for the third quarter and full year.\n\nGordon Mattingly -- Chief Financial Officer\n\nThank you, Matt, and thank you, everybody, for joining us today. We delivered strong Q2 2022 financial results that exceeded our guidance, growing our revenue by 20.7% year over year, while growing non-GAAP growth profits sequentially and year over year to a record for the company of $35.1 million. Our financial performance for the quarter was once again underpinned by a successful shift to a services first business model, which helped drive our non-GAAP growth profit up by 27.7% year over year, comfortably overindexing revenues growth. The Arlo team was able to bring channel inventory in line with target and at the same time, navigate supply chain challenges to exceed our expectations on revenue.\n\nAt the same time, even after investing $1.2 million on creating content for our upcoming awareness campaign, we were able to grow our year-over-year non-GAAP operating profit by $5.3 million and post our third consecutive quarter of non-GAAP operating profits. Also, I would like to point out that foreign exchange did not have a material impact on our financials in Q2, and we do not expect it to have an impact moving forward. And now, moving on to the Q2 financial detail, revenue came in at a second fiscal quarter record of $119 million, up 20.7% year over year and down 4.6% sequentially. The strong revenue result clearly demonstrates how our channel diversification and ARR growth are benefiting the business.\n\nOur service revenue for Q2 2022 was a record $32.8 million, up 9.6% sequentially, 29.8% year over year, driven by our services first business model and the addition of 206,000 paid accounts in the quarter. While service revenue accounted for 27.6% of our Q2 2022 revenue, it delivered 61.5% of our non-GAAP gross profit. Our service revenue also includes $0.2 million of NRE services we are providing for Verisure, along with associated costs as compared with $0.1 million in the first quarter of 2022. Product revenue for Q2 2022 was $86.2 million, which was up 17.6% year over year and down 9.1% sequentially.\n\nOur year-over-year product revenue growth was driven by continued strength from our Verisure relationship in Europe, while the sequential result reflected destocking in both our America and Asia-Pacific sales channels, where we were pleased to end the quarter at normal channel inventory levels as we head into the season is stronger second half. During the second quarter, we shipped 1.1 million devices, all of which were cameras. From this point on, my discussion points were focused on non-GAAP numbers, the reconciliation from GAAP to non-GAAP is detailed in our earnings release, distributed earlier today. Our non-GAAP growth profit for the second quarter of 2022 was up $7.6 million year over year and up $0.6 million sequentially to $35.1 million, which resulted in a non-GAAP gross margin of 29.5% up from both 27.9% in Q2 2021 and from 27.6% in Q1 2022.\n\nThe $7.6 million year-over-year improvement in non-GAAP profit included an improvement $6.7 million from services and $0.9 million from products. The improvement in non-GAAP service gross profit was driven by growth in our ARR, coupled with cost optimizations. The improvement in non-GAAP product gross profit was driven by higher product revenue. Non-GAAP service gross margin came in at a record 65.8%, significantly up from 58.9% in Q2 2021 and an improvement on 65.4% in Q1 2022.\n\nNon-GAAP product gross margin was 15.7%, down from 17.2% in Q2 2021, mainly driven by product mix and flat with Q1 2022 at 15.7%. Total non-GAAP operating expenses was $34.1 million, up $0.6 million or 1.9% sequentially and up $2.3 million or 7.2% year over year as we invest in R&D ahead of our new products and service introductions and lay the groundwork for our upcoming awareness campaign, in which we invested a total of $1.2 million during the second quarter. Our total non-GAAP R&D expense for the second quarter was down $0.3 million sequentially at $13.8 million. Our headcount at the end of Q2 was 354 employees compared to 358 in the prior quarter.\n\nThe second quarter was an excellent example of how the team is driving the leverage in the business. While revenue was up 21% year over year, our gross margin expanded by more, driving a 28% increase in gross profit while our operating expenses only grew 7% after investing more than $1 million in our awareness campaign. This resulted in a year-over-year improvement of more than $5 million in non-GAAP operating income. As a reminder, during the early stages of the Verisure relationship, we agreed to provide them with transition services, which include training with Arlo employees, as well as systems costs and some outside service costs.\n\nWe have included these costs in our normal operating expenses. The reimbursement from Verisure is included in other income and was approximately $0.1 million during Q2. Our non-GAAP tax expense for the second quarter of 2022 was $0.2 million. In Q2, we posted a non-GAAP net profit per diluted share of $0.04, much better than our guidance, and $0.05 improvement year over year, driven by a combination of revenue growth and gross margin expansion.\n\nWe ended the quarter with $135.3 million in cash, cash equivalents and short-term investments, down $10.2 million sequentially and down $43.4 million year over year. The sequential reduction was driven by reduction in working capital of $7 million, primarily from lower deferred revenue and accrued liability balances coupled with taxes paid. Q2 inventory closed at $39.2 million, an increase of $2.2 million over Q1 2022, returns at 7.5 compared to 8.7 last quarter and 5.7 a year ago. Our DSO came in at 57 days, up from 48 days a year ago with the increase driven by customer mix and down from 58 days sequentially.\n\nNow, turning to our outlook. We expect third quarter revenue to be in the range of $125 million to $135 million. We expect our GAAP net loss per diluted share to come in between $0.28 and $0.21 per share, and our non-GAAP net loss per diluted share to come in between $0.17 and $0.10 per share. Our guidance includes approximately $8.8 million of awareness spending as we kick off our campaign in the third quarter in line with the plan as we communicated on our Analyst Day back in March.\n\nFor the full year and up from previous guidance, we expect our revenue to be in the range of $500 million to $520 million, while we expect our non-GAAP operating loss will be in the range of $15 million to $25 million equivalent to breakeven non-GAAP operating profit for the year, minus our planned awareness spending. The team at Arlo continues to work tightly with our retail partners. And while we recognize many retailers may be rethinking their inventory strategy for the coming quarters, we believe we have taken potential adjustments into account in considering our updated full year revenue guidance. In line with previous guidance, we expect to end the year with $110 million to $120 million in cash, cash equivalent, and short-term investments.\n\nAnd we'll continue to monitor our performance and prudently manage our operations to preserve our cash position. And now, I'll open it up for questions.\n\nOperator\n\n[Operator instructions] We'll pause for just a moment to compile the Q&A roster. Your first question comes from the line of Jacob Stephan with Lake Street Capital Markets.\n\nJacob Stephan -- Lake Street Capital Markets -- Analyst\n\nHey, guys. Congrats on the quarter. Maybe just help me understand the inventory levels. So, are you guys working through some lower margin inventory yet, or has that kind of been worked through?\n\nGordon Mattingly -- Chief Financial Officer\n\nJacob, you -- it's Gordon here. Are you talking about channel inventory?\n\nJacob Stephan -- Lake Street Capital Markets -- Analyst\n\nYes.\n\nGordon Mattingly -- Chief Financial Officer\n\nYeah, channel inventory is in reasonably good shape, actually. If you look back to where it was at the end of last quarter, U.S. retail channel inventory was up near 16 weeks. Our goal is for 10 to 14 weeks.\n\nWe brought that down in Q2, and we ended the quarter within our target range at 11.8 weeks. So, it's right there. The other thing to bear in mind, we're heading into seasonally stronger sales. Prime Day was right at the beginning of Q3.\n\nSo, I think the stock position, the channel inventory position in America's retail is pretty nicely balanced to be honest. Outside of that, we also made some really good progress in Asia-Pacific in Q2. If you look back to Q1, we told you at the end of Q1 that we were looking to take action to bring APAC inventory more in line. It ended near 20 weeks at the end of Q1.\n\nWe cut that in half in Q2, and we're now back to pretty normal run rate levels of inventory in APAC at 9.8 weeks. So, I think the channel inventory situation that we're looking at is right where we want it to be.\n\nJacob Stephan -- Lake Street Capital Markets -- Analyst\n\nGot it. And maybe, just on Verisure contract, obviously, they're a huge portion of the revenue. But talking about Calix, can you give us an update -- their revenue edge segment was up 129%. Maybe if you could just kind of give us a progress update on how things are going with Calix, that would be helpful.\n\nMatt McRae -- Chief Executive Officer\n\nYeah, I'd be happy to. And in fact, you called out Verisure as well, and you can see what a strong quarter we've had as we continue to roll out with them. On Calix, we're really still in the rollout phase. And so, we're adding BSPs or their customers' broadband service providers every quarter and look to continue to ramp that through the end of this year and have it become more material to our strategic accounts as we get into 2023.\n\nWe started with them in the second half of last year. And I think at the time, we had like 12 or 13 broadband service providers. We're now around 40 broadband service providers. And I would love to see that to continue to ramp, like I said, through this year to where we get to some critical mass as we enter 2023.\n\nJacob Stephan -- Lake Street Capital Markets -- Analyst\n\nOK. And maybe just on 2023 guidance, you're still expecting to double the growth rate from '22?\n\nGordon Mattingly -- Chief Financial Officer\n\nYeah, that's still where we see it. Obviously, the macroenvironment, you know, has somewhat changed since we gave the guidance earlier the part of this year. In terms of growth rate year over year, yes, we still believe that that is reasonable. We just literally kicked off the awareness campaign that is obviously, you know, pretty central to achieving that growth rate.\n\nAnd we're looking forward to seeing how that goes and reporting back on progress when we see more data on that.\n\nJacob Stephan -- Lake Street Capital Markets -- Analyst\n\nOK, great. Thanks for the color. I'll hop back in the queue. Congrats, again.\n\nGordon Mattingly -- Chief Financial Officer\n\nThank you.\n\nMatt McRae -- Chief Executive Officer\n\nThank you very much.\n\nOperator\n\nYour next question comes from Hamed Khorsand with BWS Financial.\n\nHamed Khorsand -- BWS Financial -- Analyst\n\nHi, could you just talk about the rate of paid subscribers, if you're doing anything different than what you've talked about to investors given that it's been rising at a steady increase? And just want to see what's causing that. And is it, you know, stable to assume that that will continue?\n\nMatt McRae -- Chief Executive Officer\n\nYeah, it's a great question, Hamed. I think some of the growth in the past has been us phasing in the new business model. So if you go back over the last 12 to 18 months, especially if you go back a couple of quarters and look past from there, you know, some of that quarter-over-quarter growth was being driven by us, rolling out old product or legacy product, and rolling into the channels and through POS the new business model product. That is basically complete.\n\nAnd so, when you look at our baseline kind of ads from a retail direct perspective, it's going to follow seasonality across our channels, I think, in a lot of ways. So, you'll see Q2 paid account ads are going to be related to Q1 POS because we have a 90-day free trial, and so we'll see them typically turn into a paid account 90 days later. There's some exception that. One, the paid account -- sorry, the campaign that we're doing around awareness, will obviously drive incremental paid accounts above normal seasonality.\n\nAnd we're seeing strength from some of our strategic partners. Again, I mentioned Verisure in the last question. And those are actually added on top of what we would see as kind of normal seasonality from the retail and direct pay. So that's kind of what's driving the growth on a quarterly basis.\n\nAnd so, some of it is going to be driven by retail POS seasonality and some of it is done just through great execution for some of our partners like Verisure.\n\nHamed Khorsand -- BWS Financial -- Analyst\n\nAnd could you just talk about the inventory situation with -- in the channel with retailers in the current environment? Are you looking to sell more directly to the consumer going into Q4? And how comfortable are you that the consumer is not going to retract on their spending habits?\n\nMatt McRae -- Chief Executive Officer\n\nYeah. From an inventory perspective, I think, Gordon gave a great overview on where we sit from a channel inventory across the regions. The commentary in the script is really around we're seeing specific retailers trying to optimize their positions and their balance sheets and things on inventory. So, some of them are looking for less inventory, some of them are looking for a little bit more, and we're making those adjustments that was built into the guidance that we gave for Q3 as we go forward.\n\nWe have not seen a pullback from a consumer perspective as far as purchases and kind of consumer confidence as it relates to them executing with Arlo across our channels. We just finished Prime Day as an example, and Prime Day was actually very strong for us. It actually exceeded expectations as we just got into this quarter. So, we are watching very carefully what kind of the back half of Q3 and as we get into Q4 and continue to monitoring, what the consumer behavior looks like.\n\nWe review POS data from our retailers every single week and actually do it twice a week inside of Arlo. So, we're going to stay very much on top of this as we get through the quarter. I would expect to see maybe some additional competitive offers, if things do slow down a little bit in the channel. But what we're seeing right now as we got through Q2 and even in the Prime Days is some resiliency and some strength from the consumers that are buying Arlo.\n\nHamed Khorsand -- BWS Financial -- Analyst\n\nOK. Thank you.\n\nMatt McRae -- Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nYour next question comes from Mark Cash with Raymond James.\n\nMark Cash -- Raymond James -- Analyst\n\nHi, thanks for taking the questions. So, those guys have already asked, you confirmed the plans to double growth in fiscal year '23, but I was also wondering if you hit on operating profit and if that gold becoming operating profitable still intact? And if there's a chance, would you lean into growth over margins, if the opportunity presents itself?\n\nGordon Mattingly -- Chief Financial Officer\n\nJust to reiterate what we said previously around 2023 that we'll still be in investment mode in the first half of the year. So, still looking at non-GAAP operating lost in the first half, crossing over back into profitability for the second half of '23. And then for the full year, we're expecting to be at breakeven for 2023. So that's the outlook.\n\nThat's the same outlook that we shared earlier this year when we gave you those projections. I'll pass it over to Matt, just to talk about the balance between taking margin versus profit and what his thoughts on that might be. But certainly, I think the awareness campaign that we just embarked on is a pretty good start to us saying that, as we've said, the No. 1 reason people don't buy Arlo is they haven't heard of Arlo.\n\nSo, we want to go and invest and acquire households. And that's what we're doing in Q3, Q4. And then as just mentioned, Q1, Q2 next year. I'll throw it over to Matt to see if he has any other comments to make on that subject.\n\nMatt McRae -- Chief Executive Officer\n\nYeah. I think the question around balancing growth and profitability is something we talk about quite a bit internally and not only in the short term, but the long term. And so, you'll know, if you look back at our March presentation, you can see what we're pegging as far as our long-range plan and how to drive that growth. The marketing spend you see in the second half this year, and to Gordon's commentary next year, where the first half we think we'll continue to spend given our expected results from the campaign is where we are right now on that balance where we think over the next 12 months, we'll be driving growth and spending into that growth.\n\nBut as the results start to pull through, we think we'll return to profitability in the second half of next year. That is where we are in our current balance. Obviously, any macroeconomic headwinds or changes to that may make us adjust as we get into next year, where we may turn up growth. If we see a great reaction to the campaign or pull back potentially or continue to spend at the current level depending on what we see in the second half of this year.\n\nBut that balance is where we spend a lot of time, and spent a lot of time in our long-range plan, really focusing on maximizing shareholder value creation over the next three to five years and not giving up. One of the things you look at is when you look and model out, where are those headed over the next three to five years, growth in that first one to one and a half year, call it 12- to 18-month period of the long-range plan. Actually, has a compounding effect on where shareholder value actually gets created. So, I think the balance that we struck and communicated for the next 18 months still holds with the idea that as we exit this year, we may make adjustments based on actual results.\n\nMark Cash -- Raymond James -- Analyst\n\nAll right, thank you for all that. And if I could just ask one more regarding the awareness campaign just getting kicked off. Do you guys have any had any early feedback and then if there's any metrics you guys are tracking to see how it's going? And if you guys have a plan, if you're trying to lean more toward growing direct-to-consumer versus retail with this campaign, it'd be great. Good to hear that.\n\nMatt McRae -- Chief Executive Officer\n\nYeah. It's a great question. So, on the kind of channel, you'll see us through the various media not only leverage arlo.com significantly, and when you do a brand awareness campaign, that's where a lot of the traffic just kind of naturally flows because the next step of awareness is a bit of education, and we think we do that best at arlo.com. But you could see us do some partnerships with some of our channel partners.\n\nWe would actually do some tagging and drive traffic to them as well. So, it'll be a bit mixed, but I would say overall emphasis -- the significant portion of the emphasis would be on arlo.com, both for that educational component, but also for potential transactions for both products and services. On the efficacy, we are I think slightly more than a week in. So, we have very, very little data as you go through.\n\nAnd initial data is usually wrong. And you usually need at least 30 to 60 days to even get an initial idea of where the spend is being effective. And like we said in the past, we think the actual effect through our waterfall will be more toward the end of this year going into 2023 because of the lag that typically is associated with a branding campaign, transferring into actual POS, and consumer spending. So, we're really looking for data as we exit the year, and we'll be able to report in the first part of next year.\n\nThe way we are looking at it, going back to kind of the original part of your question, we have a very well-characterized waterfall and customer journey at Arlo. So, we know if we sell x number of cameras, how many of them activate, how many of those that activate complete the free trial? How many of those that complete the free trial and on what day do they actually convert to a paid account? How many of those actually churn over what time period? A lot of that we shared on the Analyst Day. So, we have a very well-characterized funnel. This is just adding to the top of that funnel is if we could sell more product through an awareness campaign, we then will watch all of those various metrics I just talked about, see if they go up, see if they go down as we execute the campaign and actually drive incremental households and paid accounts.\n\nSo, that's what we'll be tracking. And that's what we're excited to share more about as we kind of exit this year and get into the first part of next year.\n\nMark Cash -- Raymond James -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nThere are no further questions at this time. I will now turn the call over to Matthew McRae for any closing remarks.\n\nMatt McRae -- Chief Executive Officer\n\nThank you, operator. I would like to take a moment to thank all the teams at Arlo for the hard work to deliver such outstanding results in the face of continuous pandemic and macroeconomic headwinds. The excellent execution confirms our trajectory at this early stage of our long-range plan, and we look forward to continuing from here. Thank you again for joining the call today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nErik Bylin -- Investor Relations\n\nMatt McRae -- Chief Executive Officer\n\nGordon Mattingly -- Chief Financial Officer\n\nJacob Stephan -- Lake Street Capital Markets -- Analyst\n\nHamed Khorsand -- BWS Financial -- Analyst\n\nMark Cash -- Raymond James -- Analyst\n\nMore ARLO analysis\n\nAll earnings call transcripts"
}