{
  "companyName": "Lennar",
  "companyTicker": "LEN",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/15/lennar-len-q4-2022-earnings-call-transcript/",
  "content": "Lennar (LEN -0.19%)\nQ4 2022 Earnings Call\nDec 15, 2022, 11:00 a.m. ET\n\nOperator\n\nWelcome to Lennar's fourth quarter earnings conference call. [Operator instructions] I will now turn the call over to Alexander Lumpkin for the reading of the forward-looking statement.\n\nAlex Lumpkin -- Deputy General Counsel\n\nThank you, and good morning. Today's conference call may include forward-looking statements, including statements regarding Lennar's business, financial condition, results of operations, cash flows, strategies, and process. Forward-looking statements represent only Lennar's estimates on the date of this conference call and are not intended to give any assurance as to actual future results. Because forward-looking statements relate to matters that have not yet occurred, these statements are inherently subject to risks and uncertainties.\n\nMany factors could affect future results and may cause Lennar's actual activities or results to differ materially from the activities and results anticipated in forward-looking statements. These factors include those described in yesterday's press release and our SEC filings, including those under the caption risk factors contained in Lennar's annual report on Form 10-K most recently filed with the SEC. Please note that Lennar assumes no obligation to update any forward-looking statements.\n\nOperator\n\nI would now like to introduce your host, Mr. Stuart Miller, executive chairman. Sir, you may begin.\n\nStuart Miller -- Executive Chairman\n\nVery good. Thank you, and good morning, everyone. Thanks for joining us. This morning, I'm here in Miami and joined by Rick Beckwitt, our co-CEO and co-president; Diane Bessette, our chief financial officer; David Collins, our controller and vice president.\n\nAnd Bruce Gross is here, CEO of Lennar Financial Services. Happy to have Bruce back in the seat. And, of course, Alex, who you just heard from. Jon Jaffe, our co-CEO and president, is on -- is out in California and on the line and will participate remotely.\n\nAs usual, I'm going to give a macro overview and strategic overview of the company. I'll be a little longer than usual. We've got some strategic matters that we want to cover. After my introductory remarks, Rick is going to walk through our markets as he did last time around.\n\nJon's going to update supply chain cycle time and construction costs and give a little overview on land as well. I think that Rick and Jon will both talk a little bit about land. As usual, Diane will give a detailed financial highlight and will give some rough boundaries for the first quarter to assist in looking forward thinking and modeling. And then we'll answer as many questions as we can.\n\nAnd as usual, please limit yourselves to one question and one follow-up. So, let me go ahead and begin by saying that once again, the Lennar team has turned in excellent results for the fourth quarter and year-end 2022, which continue to enhance our positioning for evolving market conditions. Market conditions continue to deteriorate in the fourth quarter as the now well-documented interest rate-driven sales slowdown and pricing correction intersected with the still-stressed supply chain, high labor and material costs, and the elongated cycle times to make for a very complicated landscape to bring the year 2022 to a close. The very sudden movement in interest rates experienced over the past six months have very quickly affected both affordability and consumer confidence, resulting in a very rapid change in market conditions and demand.\n\nSales and sales prices are down materially across both the new and existing home markets. And given commercial underwriting and lending criteria, new for-rent properties are being curtailed as well. Our current view is that production of single-family and multifamily dwellings nationally will be down between a quarter to a third in 2023, exacerbating the national housing supply shortage. Numerically, that means that approximately 1.5 million homes produced over the past couple of years per year will drop to around a million homes produced.\n\nNow, Rick is going to go through a market review and market conditions across our platform in a few minutes. So, stay tuned for that. But even as demand has cooled very quickly, the overhang of a now-correcting, although disrupted, supply chain, stubbornly high labor and materials costs, and production or cycle times that have grown by over two months have created an unusual wedge that the homebuilders have been left to navigate. Jon will give a lot more detail on that.\n\nOn a positive note. Very limited new home inventory exists. Limited existing home supply exists as existing homeowners hold on to extremely low mortgage rates and very limited multifamily production, combined with the chronic housing production shortfall over the past decade, and leaves the industry in the middle of what we believe will be a fairly short duration correction without an inventory overhang to resolve. Against this backdrop, in addition to the two hurricanes that swept through Florida, the homebuilding and financial services teams at Lennar have focused and have executed on the strategies that we've detailed over the past quarters as we have very quickly and efficiently adjusted our business and business model.\n\nWe laid out the Lennar strategy playbook over the past quarters. And those strategies, the successes and the misses, are reflected in our first quarter and year-end results. And I'd like to give a brief overview. First, as the first playbook strategy, we detailed that we're going to continue to sell homes and adjust pricing-to-market conditions and maintain reasonable volume.\n\nIn fact, we relied on our proprietary dynamic pricing model developed by our inimitable Jeff Moses to guide volume-based pricing in order to drive sales at market pricing so that we maintain the volume that maintains our starts and sales pace so they remain in sync and drive steady production. The result of this program is that margin, as opposed to volume, becomes the so-called shock absorber and fluctuates up and down like an accordion as market conditions, especially interest rates, change. Accordingly, interest rate changes, especially downward, potentially improves lagging margins. In the fourth quarter, we saw our margins adjust rather quickly, down some 270 basis points to 25.3% before impairments as we used price reductions plus incentives in the form of both closing cost payments and interest rate buydown to offset volatile interest rate and market shifts.\n\nWe did this both to sell homes, as well as to protect our backlog by adjusting pricing and incentives to ensure closings. While our cancellation rate of 26% is decidedly higher than the 12% last year, it has been falling from the peak of 28% reached in October, and we expect it to normalize below 20% in the near future. Also, in the fourth quarter, we used our pricing strategy to, in orderly fashion, maintain our volume. While our sales were still down some 15% year over year, that result has compared favorably to reported market conditions and enabled us to start over 68,000 homes in 2022, which is only a 1% reduction year over year and gives us visibility to potentially flat 2023 deliveries.\n\nWhile this is not intended to be a projection, it is within the broad boundaries of our look ahead. We derive confidence in our ability to achieve sales pace at the best possible prices for more significant investment in digital marketing, which is more relevant than ever before. Our proprietary digital platform, which we built on a Microsoft backbone, provides digital marketing insights and analytics that guide us to better execution with appropriate pricing for a more dynamic pricing model. Our digital marketing team, under the guidance of Ori Klein, is doing some very interesting, innovative, and very credible work.\n\nOur second playbook strategy was to work with our trade partners to rightsize our cost structure to current market conditions. On this item, let me say that Jon will cover this in great detail shortly. But Jon, together with Rick, is giving a masterclass on cost reconciliation across our platform to our production and our purchasing teams, as well as to our trade partners. Make no mistake.\n\nLennar led the way with reduction in margin while maintaining volume and increasing market share as the market has corrected. We expect our trade partners to work side by side with us and follow suit. As margins expanded in the best of times, they benefited. And as margins have now contracted in the more difficult times, we are driving costs down as prices are reduced, and we expect participation as well.\n\nWhile there is no doubt a lag in those reductions coming through our -- there's no -- there is no doubt a lag in those reductions coming through our reported numbers. There will also be no doubt a significant reduction coming. Period. Cost reductions will improve lagging margins.\n\nOur third playbook articulated strategy was to sharpen our attention on land and land acquisitions. While Rick and Jon will give additional detail on our land reviews, this has been a specific concentrated focus by all three of us, myself, Rick, and Jon, across the platform, working, connected, and together to reconsider every land deal in our pipeline and minimize exposure to falling land values. In that regard, I dare say we have stopped the bleeding early. We have reconsidered every land deal in our pipeline.\n\nWe have reconsidered land development dollars being spent. We have walked from deposits or renegotiated terms in price. And we have been relentless in focusing on protecting cash and only purchasing the next strong margin at today's pricing. New land purchases will improve lagging margins.\n\nFortunately, we are well positioned with well-structured contracts and shorter-term deal structures that enable our capital allocation to be micromanaged constructively. We started the quarter with $2.5 billion of expected land closings. We ended the quarter with three quarters of that spend, either walked from, renegotiated to produce a responsible margin, or pushed for reconsideration at a later time. As with our trade partners, our land partners or sellers understand that we're maintaining volume and increasing market share while taking the first hit to our margin.\n\nThey will need to work together and participate, or will need to move on. Our fourth playbook strategy was to manage our operating costs for SG&A so that even at lower gross margins, we will drive a strong net margin. In as much as we have been driving our estimate down over the past years quarter by quarter to new record lows. And many of those changes, although not all, are hardwired into permanent efficiencies in operation.\n\nNevertheless, as average sales prices come down, the percentages won't hold without corresponding additional costs. We also know that, in more difficult times, there will be an upward pressure on some of our sales and marketing costs in order to drive and find purchasers and drive new sales. In our fourth quarter, we were able to maintain a 5.8% SG&A at the operating level. And we believe, if we continue to drive volume, we'll be able to contain increases and manage to a very attractive cost level.\n\nEach of our operating teams, as well as our corporate teams, are looking for additional efficiencies, especially now that COVID is behind us. And teams are reconvening in person in our offices and finding those inefficiencies face to face and together. Our fifth playbook strategy was to maintain tight inventory control. This is exactly what drives the cash flow machine, and we're focused on this part of our business every day.\n\nBoth land and home inventory control is the mission control of our overall business. And in our fourth quarter numbers, you can see in our 14.4% debt to total capitalization and our $4.6 billion cash position that our inventory is being carefully managed. Now, we know that questions have been raised by the press and others about the mysterious 5,000 homes being sold to single-family for-rent purchasers at deep discount because of dire market conditions. The fact is that we, like other builders, provide a take of homes available for sale to the single-family for-rent buyers, so they are aware of what is available in the ordinary course of our business, and we've been doing that over the past many quarters.\n\nThat might -- that take might have had completed homes and homes that are one to four months out from completion. Over the course of the past year -- and these are the facts, over the course of the past year, we have sold approximately 7% of our homes to single-family for-rent purchasers, including Quarterra. That percentage is approximately the same range quarter by quarter. And as we look ahead to 2023, we think the percentage will be roughly the same or less.\n\nNet margins on those homes are approximately the same as homes sold to primary buyers, and there is no unusual discounting or advantage. In our operating world, our focus is not on fire sales to manage inventory. Instead, it is all -- it all starts with the starts, sales, and closings management of our business. These elements of the business are managed through in every other day management meeting, where numbers are reviewed at the regional divisional levels by the entire management team.\n\nStarts, sales, and closings are maintained in a controlled balance, with the end result of volume that defines expectations. This is the most carefully reviewed and managed part of our business and enables us to maintain an extremely low inventory of completed not-sold homes, which has consistently been at or under one home per community for the past years. And right now, we have approximately 900 unsold completed homes. Currently, land inventory is managed equally carefully.\n\nFrom the corporate office, tight oversight is maintained on the land and land development spend. Diane oversees every dollar spent on land acquisition and development dollars and maintains accountability relative to years of land owned versus controlled and years of land owned overall. If we aren't hitting targets, we aren't spending money. Like with homes, there are no fire sales, just careful day-to-day management.\n\nWe're aware that inventory has grown through the year because of expanded cycle time due to the supply chain disruption. We also know that this inefficiency will correct over the next few quarters and will turn approximately $150 billion of inventory into additional cash and will provide the cash to pay down debt due in 2024. That is on the radar. Additionally, a pause on growth this year will reduce inventory and generate additional cash over the next year as well.\n\nBecause of the tight control of land and completed home inventory, our cash flow has grown, pushing our balance sheet to the point where our net debt to total capital is actually negative at this point. That makes Diane happy. The sixth playbook strategy was to continue to focus on cash flow bottom line in order to protect and enhance our already extraordinary balance sheet. If we reflect on our fourth quarter results, it is mission accomplished, and we are still just getting started.\n\nIf we continue to execute our playbook strategies, we will continue to drive strong cash flow and even through bottom line -- and even through bottom line profitability -- and even though bottom line profitability will be compressed year over year as prices and margins are impacted in the correcting market, our balance sheet and cash position will continue to improve. This improvement enables the flexibility to be opportunistic as market conditions stabilize, as well as opportunistic in repurchasing both stock and debt. We have tremendous optionality. Now, the final playbook strategy is the one where we must report a miss.\n\nThat, of course, being the spin of Quarterra by year-end. In spite of our best efforts -- in spite of my best efforts, the current market conditions are simply not favorable to our commercial asset manager spin on the year-end timeline. Not to be cliche, you just can't and don't want to fight the take. We believe that we have a very high-end public company waiting and almost ready to enter the public arena.\n\nBut we're going to postpone for the time being and wait for the right timing. Quarterra, it deserves exactly that launch. While I remain confident and enthusiastic that Quarterra will be spun, and Lennar will become a pure play homebuilder as promised, it will not happen by year-end. And I'm not prepared to posit another date, given current market uncertainties.\n\nSo, please be patient. So, at the end of the day, if you're keeping score and are considering success in difficult market conditions, I believe that we from the Lennar Homebuilding team to the Lennar Financial Services team to the Quarterra team have had a truly remarkable fourth quarter and year-end 2022. In extraordinarily difficult market conditions. We focused on strategy, and we executed with precision.\n\nWe ended the year with the highest revenues, the highest profit, the highest cash flow, the best balance sheet, and the highest liquidity in Lennar's history. We have a plan of execution to move into the uncertainties of 2023 with a focus on maintaining volume, maximizing margin, managing inventories, driving cash flow, managing land and land spend, and further enhancing our balance sheet in spite of challenging market conditions. Accordingly, we're guiding our first quarter closings to between 12,000 and 13,500 homes with a gross margin of approximately 21%, which we believe will be the lowest gross margin for the year. Additionally, we're targeting delivery volume to be flattish for the full year as we drive volume and pick up market share and build margin through reconciliation of construction costs and land costs and adjustment to product efficiency while carefully managing SG&A.\n\nWe are prepared once again to look adversity square in the eye and stick to our strategies and pull out a big win. Simply put, that's what we expect of ourselves. As a conclusion or an epilogue, let me add that we've come to an end of another year, and we have a truly wonderful leader who will be retiring after 27 years of service. Jeff Roos is one of our regional presidents, who has overseen many of our Western divisions.\n\nJeff has been an absolute warrior of Lennar over these past decades. But as with all great leaders, he leaves us with ample hand-picked talent to fill the void. In fact, his people will be even better than he has been. He wants it that way.\n\nWhile I have a somewhat heavy heart, I feel a great sense of pride to have worked so many years with such a talented partner. Many of you on this call don't know Jeff Roos, and he likes it that way. Jeff is the very essence of Lennar. He is a flight engine under the hood, never the shiny paint job.\n\nExtraordinary on the field, always a leader in execution, and always willing to learn something new. You know, they say that you can't teach an old dog new tricks. Well, Jeff was always the old dog that taught us all new tricks. Off the field, Jeff is even better.\n\nHe has been ever focused on making the world a better place through HomeAid, or diaper drives, or anything that works for community. He never stops caring, never stops striving, and you can't help but love everything that he stands for. So, with that said, Jeff is a shining example of all that drives us here at Lennar to be better and to reach higher. And it is Jeff and people just like him that make it a certainty that Lennar will continue to succeed.\n\nSo, with that, let me turn it over to Rick.\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nThanks, Stuart. As you can tell from Stuart's opening comments, the overall housing market has been reacting to a significant increase in mortgage rates, which has impacted affordability and homebuyer confidence. While we continue to have many strong markets in our more challenging areas, we've had to adjust base sales prices, increase incentives, and provide mortgage rate buydowns to maintain or regain sales momentum. As a sales strategy, our sales strategy has been to find the market clearing price for each of our homes on a community-by-community basis as quickly as possible and price our homes accordingly, in many cases, resulting to a monthly payment and not to the sales price.\n\nThis requires a detailed understanding of community- and product-specific pricing, financing programs, traffic trends, inventory levels, and buyer sentiments. During the fourth quarter, our new sales orders declined 15% from the prior year on a 4% lower year-over-year community count. Our year-end community count was lower than we projected at the beginning of the year as we walked away and renegotiated our many communities. Jon will walk you through this as he discusses our land strategy.\n\nWhile our cancellation rate and sales incentives increased sequentially from the third quarter, our sales orders and sales pace for communities was relatively flat throughout the fourth quarter as we successfully executed our pricing strategy in most of our markets. To maintain and regain sales momentum, our fourth quarter new sales order price declined 9.5% sequentially from our third quarter, with mix accounting for 250 basis points of the decline and base price reductions and incentives accounting for 200 basis points and 500 basis points, respectively. The combination of adjusted pricing and rate buydowns have created a more stabilized environment. As we cleared out or closed many of our older contracts in our backlog, our backlog has reset to these new prices, admittedly at lower margins, and we're seeing more stability and a trend toward lower cancellation rates.\n\nTo this point, our cancellation rate peaked in October, declined significantly in November, and we've seen a continued reduction thus far in December. We fundamentally believe that this price-to-market strategy reflects our balance sheet-first focus, where we can maintain starts and sales, generate cash flow, and keep our homebuilding machine going. To this end, as Jon will discuss, by maintaining our starts base, we've been able to get cost reductions from our trade partners and significantly increase our market share, as many of our competitors are either stock or slow starts altogether. I'd like to now give you an update on our markets across the country.\n\nThey really fall into three categories: one, markets that are performing well; two, markets where we've adjusted pricing and incentives, found the market price, and have successfully regained sales momentum; and three, markets that may require some additional pricing adjustments to regain our targeted absorption base. During the fourth quarter and so far in December, we had eight markets that are performing well. These include southwest Florida, southeast Florida, Tampa, Palm Atlantic, New Jersey, Charlotte, Indianapolis, and San Diego. These markets are benefiting from extremely low inventory, and many are benefiting from strong employment and strong local economies.\n\nWhile these markets continue to be strong, we had to offer mortgage buydown programs and normalized incentives. Our category 2 markets, which reflect markets where we've made more significant adjustments and have successfully regained sales momentum, include 23 markets. These include Jacksonville, Ocala, Atlanta, Coastal Carolinas, Raleigh, Virginia, Maryland, the Philadelphia metro area, Chicago, Minnesota, Nashville, Dallas, Houston, San Antonio, Colorado, Tucson, Las Vegas, California Coastal, the Inland Empire, the Bay Area, Central Valley, Sacramento, Seattle, and Boise. While inventory is limited in each of these markets, we had to offer more aggressive financing.\n\nBase price reductions and/or increase incentives to regain sales momentum. Aside from the adjustments -- the size of the adjustments is very community-by-community basis and has often been limited to specific homes each week. In some cases, to avoid cancellations, we had to adjust pricing on our homes in backlog. We're being very proactive with our pricing and not reactive.\n\nThis has allowed us to sell homes and avoid building up finished inventory. We're outselling the competition and, as I said, increasing our market share. Our category 3 markets, which reflect a more significant softening and correction, include eight markets. These include Orlando, Pensacola, Northern Alabama, Austin, Phoenix, Utah, Reno, and Portland.\n\nWhile the driver of the individual dynamics of these markets vary somewhat, traffic is slowed, buyers are taking more time to purchase, and many need to be convinced that now is the time to buy. There is fear that prices haven't hit bottom, which has led to elevated inflations. In these markets, we're focusing on establishing pricing to generate new gross sales to offset the cancellations. And we have achieved that.\n\nThis is required to work with our backlog to prevent cancellations. It's also required a mix of base price adjustments, sales incentives, and mortgage buydown programs. While we've made progress in each of these areas, we still need to make some adjustments going forward. It's not a one-size-fits-all solution.\n\nI'm confident, however, that we're making progress in each of these areas, and we're very fortunate to have limited, completed unsold inventory. So, we should be able to get these markets back on track in the first quarter. I hope this gives you a better picture of our markets across the country and what we're doing to keep our sales activity going. The markets are very fluid, and we're making proactive strategic decisions and adjustments every day.\n\nWe are committed, as a management team, to address any future market changes. And as we've said in the past, we're going to keep our homebuilding machine going to maintain our starts and price our homes to market. This is our balance sheet-first focus. And now, I'd like to turn it over to Jon.\n\nJon Jaffe -- Co-Chief Executive Officer and Co-President\n\nThank you, Rick. Our well-executed strategy of pricing the market to maintain sales volume, as Stuart and Rick have detailed, set us up for the next part of our game plan, our construction strategies. Simply put, by continuing to sell homes and generate cash flow, we'll keep starting homes. Our construction playbook has three primary areas of focus: lowering construction costs, reducing cycle time, and achieving even flow production.\n\nProperly executed, these strategies improved both gross and net margins, allowing us to profitably continue the cycle of finding the market to sell homes. Let me address each area. Reductions in construction costs have historically lagged the change in market conditions. While that is true this time, what is different is the speed of change in the market conditions, I'll just call it a sharp reduction in industry wide starts, thus speeding up the availability of labor and materials for Lennar.\n\nThis is very quickly turning the shortages of the last two years into excesses. Taking a look back at our fourth quarter, construction cost continued to increase as we guided on our last earnings call. Increases in both materials and labor resulted in a total direct construction costs increase of 6% and 16% sequentially and year over year, respectively. Moving forward, our process is a three-pronged approach of first, working with our trade partners to reduce the cost of labor materials; second, evaluating all specifications in the home; and third, an intense value engineering review.\n\nWe have very strong relationships with our trade partners. We have demonstrated to them that we have taken the first step by lowering sales prices to drive sales. And they understand this and understand the dynamic of labor availability as overall starts low, and they are working closely with us to lower their prices. Since the beginning of our third quarter, we have reduced contractor costs by approximately $14,000 per home, or $6.22 per square foot.\n\nAnd this amount will grow throughout our first and second quarters as reduced demand for labor and materials accelerates. These savings will start to flow through our results in the back half of the second quarter and will primarily be seen in closings for the second half of the year. What has been a steady increase in construction costs over the last few years but reversed course in our first quarter with a small reduction in cost per square foot compared to our fourth quarter. This is primarily driven by lower lumber costs from earlier in the year.\n\nThis improvement is already baked into our backlog as these homes started in the last four to six months. Cycle time is the second area of focus for our construction strategy. We see meaningful improvement in this area as cycle time was flat sequentially for the quarter, despite the cumulative effect of supply chain disruptions experiencing the two hurricanes that impacted production in Florida and parts of the Carolinas. Importantly, we saw cycle time improvement during the quarter for the front end of construction, which measures the duration of time from trenching to insulation.\n\nThis first part of construction process is the first to see labor free up and came down at an average of eight days during the last four weeks of our quarter as compared to the prior four weeks. As Stuart noted, bringing down our cycle time throughout the next few quarters will free up a significant amount of cash that is tied up in inventory, further strengthening our balance sheet. The third area of focus is even flow production prior to the pandemic and its related supply chain disruptions, even flow production was a core focus for us. It is a key pillar for being the builder of choice for the trades as it maximizes efficiencies for them.\n\nThe study pace and rhythm of starts through completions is absolutely critical and is only achieved with real-time communication between all parties, from Lennar's offices in fields to manufacturers to distributors to trades, and then back to us. Information, such as projected start dates and day-by-day scheduling in the field, is enabled with rigorously adhered to technology-driven tools and processes. Level construction flow of our homes drives field and G&A efficiencies for both the trades and Lennar, helping improve margins for both. As Stuart noted, this is an intense focus of both Rick and myself, along with our national, regional, and divisional purchasing and construction teams.\n\nAll of us are focused every single day on lowering costs, reducing cycle time, and achieving even flow production. Turning next to our land light strategy, this focus has been the primary driver of cash flow generation over the past several years, leading to the strongest balance sheet in our company's history. And we have taken it up a notch in the current environment. Quarter after quarter, we have worked with our strategic land banks and land partners, where we have established relationships, to purchase land on our behalf and deliver just-in-time finished home sites to our homebuilding machine on a quarterly basis.\n\nDuring the fourth quarter, we reassessed every land deal in our pipeline, utilizing updated underwriting, where we restructured the price, the terms, and/or the timing, or we did not proceed with the transaction. The result of this focus was that 75%, or approximately $680 million of land purchased in the quarter, were just-in-time deliveries from our land banks or land partners. The remaining $220 million of land purchases were made up of option payments and small short-duration land purchases. In fact, about 88% of the land purchased in the first quarter were for transactions under $2 million each.\n\nDuring the quarter, we also terminated contracts totaling about 27,800 home sites. There was approximately $37 million in forfeited land deposits associated with some of these terminations. The ongoing focus on our land light strategy resulted in ending fiscal 2022 with a controlled homesite percentage of 63%, up from 59% last year. Additionally, we reduced the years of owned home sites to 2.5 years at the end of the fourth quarter, down from three years last year.\n\nThank you, and I'll now turn it over to Diane.\n\nDiane Bessette -- Chief Financial Officer\n\nThank you, Jon, and good morning, everyone. Stuart, Rick, and Jon have provided a great deal of color regarding our homebuilding performance, so I don't need to provide any additional details. Therefore, I'll spend a few minutes on the results of our other business segments in our balance sheet, some points already noted, and then provide high-level thoughts for Q1 '23. So, starting with financial services, for the fourth quarter, our financial services team produced operating earnings of 125 million.\n\nMortgage operating earnings were 80 million compared to 77 million in the prior year. We benefited from a higher level of locked volume than expected as buyers locked in the attractive rates offered with our interest rate buydown programs. These discounted interest rates provided a certainty to our buyers to avoid potential future rate increases. Title operating earnings were 44 million compared to 30 million in the prior year.\n\nTitle earnings increased primarily as a result of higher volume and the decrease in cost per transaction, as the team continues to focus on efficiencies through technology. These solid results were accomplished as a result of great connectivity between our homebuilding and financial services teams as they successfully executed together through this choppy environment. Then turning to our Lennar other segment. For the fourth quarter, the Lennar other segment had an operating loss of 106 million.\n\nThis loss was primarily the result of noncash mark-to-market losses on our publicly traded technology investments, which totaled 96 months. Although it's been a tough, very tough environment for technology stocks, we have found and continue to believe that there are incremental operating efficiencies through these technology partnerships for both our homebuilding and financial services platforms, as well as greatly improving our homebuyers experience. And turning to the balance sheet, as we've all noted this quarter, we were laser-focused on our balance sheet. We focused on pricing to market, turning inventory, and thus generating cash.\n\nAnd we also focused on preserving cash by matching our start pace with our sales pace. And as Jon mentioned, reevaluating every landfill in our pipeline to ensure the underwriting aligned with today's market conditions. The results of these actions that we ended the quarter with 4.6 billion of cash and no borrowings on our revolving credit facility. This provided a total of 7.2 billion of homebuilding liquidity.\n\nDuring the quarter, we continued our progress of becoming land lighter. At quarter end, we owned 166,000 home sites and controlled 281,000 home sites for a total of 447,000 home sites. This translates into 2.5 years owned, which exceeded our year-end goal of 2.75 years on and was an improvement from three years in the prior year. We controlled 63% of our home sites, which was slightly lower than our goal of 85% since we walked away from approximately 28,000 home sites related to option contracts that we terminated this quarter.\n\nLast year's control percentage was 59%. When we calculate our years owned and home sites controlled, we include home sites with vertical construction, that is, homes and inventory. Since the goal of these calculations is to assess future balance sheet risk, and homes and inventory present lower risk since they turn into cash in a short period of time, we plan to exclude inventory homes from the calculations on a go-forward basis. It's just a better way to look at our business and will provide greater comparability to others in our industry.\n\nSo, for reference, we had approximately 40,000 homes in inventory, mostly under construction at November 30th. If we exclude those homes from the calculations, our years owned was 1.9 years, and home sites controls are 69%. We also remain committed to our focus on increasing shareholder returns. During this fiscal year, we repurchased 11 million shares, totaling 967 million, or about 4% of our outstanding shares at the beginning of the year.\n\nAdditionally, during the year, we returned cash to our shareholders by paying dividends of 438 million. From a leverage perspective, as we mentioned, we continue to benefit from the paydown of senior notes and strong generation of earnings, which brought our homebuilding debt to total capital down to 14.4 at quarter around, our lowest ever, which was an improvement from 18.3 in the prior year. And as we mentioned, our net debt to total capital at quarter end was a negative 2.4%. As we look forward, we do not have any note maturities in fiscal '23.\n\nOur next maturity is 400 million due in December of '23, which is our fiscal '24. And just a few finer points on our balance sheet, our stockholders equity increased to 24 billion. Our book value per share increased to $83.16. Our return on inventory was 32.8%, and our return on equity was 20.9%.\n\nIn summary, summary, the strength of our balance sheet, strong liquidity, and low leverage provides us with significant financial flexibility for the upcoming year. With that brief overview, let me turn now to the first quarter of '23. It continues to be difficult to provide the targeted guidance that we have historically provided, given the uncertainty and market conditions. So, as we did last quarter, we're providing very broad ranges to give some boundaries for each of the components of our first quarter.\n\nSo, starting with new orders, we expect Q1 new orders to be in the range of 12,000 to 13,500 homes and expect our Q1 ending community count to be about flattish with the prior year as we walked away from deals that would have produced new active communities. We anticipate Q1 deliveries to also be in the range of 12,000 to 13,500 homes. Our Q1 average sales price should be in the range of 440,000 to 450,000, as we continue to price to market. We expect gross margins to be about 21%.\n\nThis number will adjust somewhat based on the number of deliveries, primarily as a result of our policy to expense field costs. As Stuart mentioned, as we see things today, we expect our Q1 gross margin will be the low point for gross margins for the year. And we expect SG&A to be about 8%. This, too, will adjust based on deliveries and homebuilding revenue.\n\nFor the combined homebuilding joint venture land sale and other categories, we expect to have a loss of about 10 million. And looking at our other business segments. We anticipate our financial earnings for Q1 will be in the range of 50 million to 55 million. We expect a loss of about 25 million for our multifamily business and for the Lennar other category, also a loss of about 25 million.\n\nThis guidance does not include any potential mark-to-market adjustments to our technology investment since that adjustment will be determined by the stock prices at the end of our quarter. We expect our Q1 corporate G&A percentage to be about 2% to 2.2% as a result of lower total revenues and our continued investment in internal technology initiatives to produce efficiencies. Our charitable foundation contribution will be based on $1,000 per home delivered, and we expect our tax rate to be approximately 24.5%. The weighted average share count for the quarter should be approximately 287 million shares.\n\nSo, when you pull this together, this guidance should produce an EPS range of approximately $1.40 to $1.70 per share for the first quarter. Finally, given the market uncertainty, we're providing boundaries for deliveries only for the full year of 60,000 to 65,000, but are not providing further details at this time. However, we do look forward to giving you another update on our next earnings call. So, with that, let me turn it over to the operator.\n\nOperator\n\n[Operator instructions] Our first question comes from Stephen Kim from Evercore ISI. Please go ahead.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nThanks very much, guys. Appreciate all the information. Very exciting times here. I thought that the most interesting thing you commented on today was your outlook for gross margins in 1Q to be the low point for the year.\n\nAnd so, I wanted to explore that a little bit. I think there were a few components. I think you talked about lower costs that would start flowing through. I think you said in the back half of 2Q and mostly into the back half of the year.\n\nYou also mentioned, I think, Jon, that lumber benefit is already in the numbers for 1Q, so that's probably not the reason. So, there's two other potential reasons I could see why margins might improve. One of them is that maybe you're benefiting from having lowered the level of specifications or finishes, the finish level, you know, of the homes. And so it's costing you less.\n\nMaybe -- and those would be delivered in 2Q. Or that you maybe you've seen an improvement in buyer demand over the past several weeks. And so I was wanting to see if you could comment on either of those. And also tell us, what range of mortgage rate are you assuming in your outlook?\n\nStuart Miller -- Executive Chairman\n\nSo that's a lot of questions, Steve. So, let me start by saying, we do expect that our first quarter margin, we think, is going to be a low point. I think it derives in large part from a very general notion, and that is we've gotten out ahead of the migration downward in pricing. We've done it by price reduction and by incentive structure, as noted.\n\nAnd we took a very strong first move in that regard in order to keep pushing the volume moving in the right direction. With that in mind, we started the reconciliation process with land. Remember, our land position is much shorter term than it's been in the past. And therefore, we have flexibility.\n\nAnd so we think that we'll be able to reconcile some land pricing. And as far as our trade partners are concerned, I think I was clear we've been working with trade partners both on labor and materials. Some of those materials, like lumber, are already filtering through and just at the very early stages, filtering through some of the price reductions. That will build as we go through the year.\n\nBut we are working hand in hand with our partners. And given our volume and pick-up in market share, there's a lot of labor, a lot of other people out there that are looking to do business with us. We think we'll be able to bring our pricing down. And additionally , we've been hard at work reconciling efficiencies in the homes that we build, changing product where appropriate, and making sure that we are best positioned at sales prices and interest rates that are higher to be able to access the market and refine our margin as we go through the year.\n\nYour last question is what our assumption is relative to interest rates. We've kept a flexibility in our numbers. We recognize that, you know, that the Fed is focused on unemployment numbers and wage numbers and are likely to continue raising interest rates. But the tenure has had a mind of its own, and mortgage rates have been trending down and noted the flexibility, the shock absorber nature of our program or dynamic pricing program that we have in place.\n\nAll of it is almost agnostic to interest rates. We're going to keep moving through the year adjusting our pricing and the affordability for our customers in order to do what we can to maintain volume. So, we don't have a forward view on interest rates that defines how our program is working. We're going to be adaptable to the interest rate as it evolves through the year.\n\nAll indications, though, are that we're probably not going to see much more spiking and more moderating relative to interest rates. But that's a toss-up question.\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nSo, I guess the only thing I would add to that very thorough description is that, you know, our gross margin is impacted by the volume of closings that we have every quarter. And Q1 is most likely going to be the lower volume quarter. As we close more homes, as Diane said in her description, the level of field overhead that gets absorbed is spread over more closings. So, that has a positive impact on margins.\n\nStuart Miller -- Executive Chairman\n\nAnd I know Jon wants to add something. Go ahead, J.\n\nJon Jaffe -- Co-Chief Executive Officer and Co-President\n\nThanks. I just want to clarify, Steve, on what I said about construction costs. As I noted, we're currently working closely with our trade in adjusting contracted pricing. That's what I was referencing in terms of what will start flowing through in the second half of the second quarter.\n\nThe biggest needle mover is lumber, which moved down throughout the year. And we will see a benefit of that throughout the entire second quarter.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nGotcha. OK. That is helpful, Jon. So, in other words, you're not talking about deliveries in the back half of 2Q with that lower contracted pricing.\n\nThat's going to be on stuff you're sort of starting in the back half of 2Q, I gather?\n\nJon Jaffe -- Co-Chief Executive Officer and Co-President\n\nNo, no. Starting now and through the first quarter and even on some open commitments on homes already started.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nOK.\n\nJon Jaffe -- Co-Chief Executive Officer and Co-President\n\nIt's just that we'll see the first benefits of those renegotiated prices with trade starting to happen in the latter part of the second quarter. And we will see the full -- the benefit throughout the full quarter of lumber reductions that started happening in the summer of '22.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nOK. That's helpful. Appreciate that. The second question is on your owned lot count.\n\nI know you talk a lot about the ratio years and all that. But your actual number of owned lots declined for the third straight quarter, and it's down almost 20% from 1Q. And so, I'm wondering, can you help us anticipate how much the actual owned lot count might fall over the next few quarters if market conditions stay challenging? And conversely, you know, what kind of market conditions would you need to see for your owned lot count to start rising again?\n\nStuart Miller -- Executive Chairman\n\nDiane, do you want to start that one off?\n\nDiane Bessette -- Chief Financial Officer\n\nYeah. I mean, Stephen, the way I look at it, I think that it's a positive direction that our owned lot home site count has been going down. The desire is to always protect the balance sheet and reduce risk. So, the growth really comes from controlling as much as we can and keeping our own at a much lower level of the owned home sites really should be primarily finished on site.\n\nSo, we're going to put a shovel in the ground pretty quickly. So, I'm not bothered by the reduction of homes. The goal is --\n\nStephen Kim -- Evercore ISI -- Analyst\n\nSo am I.\n\nDiane Bessette -- Chief Financial Officer\n\nTo keep that as low as possible and keep growing the controlled percentage.\n\nStuart Miller -- Executive Chairman\n\nWell, and I think that basically, if you think about what we're doing strategically is really building the pipeline between our land bankers, our land bank programing, and the execution strategy embedded in our volume-based programing. And that's just going to continue to build confidence. I think that you'll see our own home site count continue to moderate and be rightsized relative to the business to be able to adequately provide for either stable delivery levels or growth levels as we choose. But that confidence that we're building in that pipeline, I think, is really value add for the future.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nGreat. Yeah. Yeah. I didn't mean to imply that I thought that that was a bad thing, Diane.\n\nI certainly agree with you. It's a good thing.\n\nStuart Miller -- Executive Chairman\n\nVery good.\n\nDiane Bessette -- Chief Financial Officer\n\nYeah.\n\nStuart Miller -- Executive Chairman\n\nYup. It's good, and it's getting better.\n\nDiane Bessette -- Chief Financial Officer\n\nYeah.\n\nStuart Miller -- Executive Chairman\n\nThank you.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nAwesome. Thank you so much, guys.\n\nStuart Miller -- Executive Chairman\n\nOK. Next question.\n\nOperator\n\nNext, we'll go to Susan Maklari from Goldman Sachs. Please go ahead.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nThank you. Good morning, everyone.\n\nStuart Miller -- Executive Chairman\n\nGood morning.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nMy first question is thinking about the sales pace, which you actually maintained ahead of your historical normal level in the last quarter despite everything that's going on, on the ground. And assuming that that does kind of tied to this broader strategy that you have around inventory controls and cash generation, can you talk to how we should be thinking about the sales pace for next year, the ability to hold it, perhaps, elevated even as we do continue to move through this environment, and what that will mean for the level of cash that you can generate in 2023?\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nSo, looking at our sales pace for last quarter, as well as our go-forward sales pace, you know, we're going to keep -- as Stuart said, we're going to keep the machine going and feel that from an overhead and operational standpoint, we get greater leverage by keeping that sales active. We know it's above where we were in 2009 from a pace standpoint, and our focus is to keep and maintain that pace as we move forward into 2023.\n\nStuart Miller -- Executive Chairman\n\nYeah, I think you can expect a lot of consistency. You know, I probably haven't spent enough time talking about our dynamic pricing model, but it is really at the core of how we're running our business. And we're doing it on a day-by-day basis, focusing on how do we get the right pricing for the customer base for today's affordability and to maintain that sales pace. I think you're going to continue to see us working hard in that direction.\n\nAs I noted, it has the ancillary business of informing our land banking pipeline about the dependability they expect is the dependability they'll get. And we're moving through our pipeline of higher-priced land that was priced or bought to yesterday's pricing. And we'll be bringing in land that is more appropriately priced to current market conditions. All of this kind of works synergistically to really inform us to keep that volume and that sales pace consistent.\n\nJon Jaffe -- Co-Chief Executive Officer and Co-President\n\nI would just add to remind you that our strategy has been and remains matching sales to our start pace. And we have a very steady start pace that will inform our sales pace as we move forward. That ties directly into the dynamic pricing model that, as a tool, our operators use to do exactly that.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nOK. That's all very helpful. And I guess it also leads to the next question of how do you think about the uses of that cash? You know, you mentioned that you're obviously in a net cash position now as it relates to your balance sheet. What are some of the priorities you bought back stock in this past quarter? Would you consider getting more aggressive there? Anything else that's on your radar?\n\nStuart Miller -- Executive Chairman\n\nYeah. So, I'm happy you asked that question. I know it's on the minds of many of our investors and people who follow the company. We're not ashamed of having too much cash.\n\nIn fact, in these -- in times like we've been in, it's a tremendous advantage and produces a lot of optionality. Looking backwards to this quarter, this was a tough reconciling quarter. Again, you have the clash of prices coming down and a very complicated supply chain that was in disrepair, exacerbated by two hurricanes rolling through our primary markets. This was a very good quarter to focus on our balance sheet and cash generation.\n\nBut here we sit and what do we do with cash? We're likely to continue to generate cash with the program that's in place. Stock buybacks are clearly one of those avenues. We're constantly looking opportunistically at repurchasing stock. We did purchase some stock this quarter.\n\nBut in the abundance of caution, we just decided to go slow before we go back. Stock buybacks are on the table. But also, as we come around, we know -- and remember that in the body of my messages, we are going to sit with a production reduction. I think it's going to be by a third, maybe more reduction in production of homes, both multifamily and single family.\n\nWe are not going to see the existing home market putting a lot of supply in place because buyers are protecting low interest rates. And we're not going to have an inventory overhang. So, it is our belief that the duration of this correction is going to be somewhat smaller or more limited. And having additional capital enables to be opportunistic in growing our business when those signals start to come our way as well.\n\nAnd you know us from the past, people have seen how we operate in the past. Lennar tends to be a first mover. We probably will be in this case as well. So, both to grow our business and to buy back stock and to pay down debt, all of these are viable uses of cash.\n\nWe're fortunate to have the optionality to go slow first and then to accelerate, and to pick and choose where the best returns are garnered.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nOK. Thank you. Good luck.\n\nStuart Miller -- Executive Chairman\n\nThank you.\n\nOperator\n\nNext, we'll go to the line of Ken Zener from KeyBanc. Please go ahead.\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nGood morning, everybody, or afternoon now.\n\nStuart Miller -- Executive Chairman\n\nGood afternoon.\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nStuart, an iconic movie says a-b-c, always be closing, which requires you to start homes to optimize inventory turns, which reduces your land, your most cyclical asset, a simple strategy, I think, many investors overlook when considering margins alone. My first question is with starts leading orders, could you comment on how you balance the unit economics of, let's say, the lower margin 5% versus the incremental cash flow of selling that unit as your land goes down 20%, or perhaps 50% when your actual inventory units decline? Because I think the idea is the income statement is nice, but the cash flow that comes from any of these choices is much more cyclically important.\n\nStuart Miller -- Executive Chairman\n\nWell, in your question, you basically embedded the entirety of our strategy. Because the reality is, if you look backwards, we have been reducing our SG&A to extremely low levels, so that as margins come down, we're still producing cash, and we're producing profit and bottom line. But at the same time, it enables us in tougher time to continue turning our inventory, turning our land inventory, as I noted, our higher price purchase to yesterday's pricing land inventory. We will continue turning that.\n\nIt is cash productive, and we'll redeploy that into repriced land purchases for the future. All of this is symbiotic and works to drive cash flows, replenish inventory appropriately positioned, while keeping the trains running on time and generating cash flow, improving the balance sheet, and maintaining profitability. So, that is basically the game plan.\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nGreat. And then, second question, Diane, I think your comments on owned land, 2.5 years versus 1.9, absent WIP is new. Within that context, my question is, if you do 12,500 starts, that's 50,000 annualized, just to make it simple, does that suggest or imply your ending inventory units will probably be down year over year versus your 60,000 closing? Because that's going to be potentially an enormous amount of cash flow from that unit reduction. Thank you.\n\nDiane Bessette -- Chief Financial Officer\n\nYeah, I think that's right, Ken. I mean, you know, since you've heard us say consistently, we're very focused on keeping volume up, capturing the market share. We're enthusiastic about resolving some of the supply chain issues. You know, you just mentioned that we think embedded in our balance sheet might be about a $1.5 billion.\n\nSo, you know -- direct, you know, whether that's the exact right number or not is we can debate. But directionally, the point is there's a lot of cash sitting on our balance sheet. And so, as we unwind all of that, that would that would lead me to believe that you'll see lower inventory levels and lower homes on the construction.\n\nStuart Miller -- Executive Chairman\n\nAnd by the way, you know, it reminds me of a meeting that we had with one of our investors some years ago where we mapped out -- and when I say something like six or seven or eight years ago, where we mapped out exactly this strategy. You remember that, Rick?\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nYeah. We've been there.\n\nStuart Miller -- Executive Chairman\n\nWe -- that's right. We've mapped out exactly the strategy and said this is what we're going to do all the way down to the reduction in that inventory level. And that's exactly the game plan.\n\nDiane Bessette -- Chief Financial Officer\n\nYup.\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nThank you.\n\nStuart Miller -- Executive Chairman\n\nYou bet.\n\nOperator\n\nThank you. Our next question is from Matthew Bouley from Barclays. Please go ahead.\n\nMatthew Bouley -- Barclays -- Analyst\n\nGood afternoon, everyone. Thank you for taking the questions, fitting me in here. So, I just wanted to ask about sort of the, I guess, the downside scenarios. You know, the balance between price margins and pace.\n\nYou know, clearly, your price-taker model is successfully keeping that sales pace elevated and you're getting the cash generation out of that. And I know you mentioned the 21% gross margin is going to be, you know, potentially the low point for the year. But my question is, if market conditions were to deteriorate, kind of where the limit is to your willingness to trade margin further? Is there somewhere where you would draw the line? Basically, how does the model kind of change when you get to these levels on gross margin? Thank you.\n\nStuart Miller -- Executive Chairman\n\nWell, let me just say that as I noted just a minute ago, we've been preparing for this for quite a long time. We have been focused on building efficiencies, sticking efficiencies into our SG&A, especially at the division level over the past years, quarter by quarter, basis points by basis points. We've been refining, reducing the cost of doing business. And I think that if market conditions were to continue to deteriorate, we're going to continue to lean into the consistent program going forward.\n\nWe have a lot of room to be able to make those adjustments. I think that, you know, there's been some concern about notions of impairment. There might be some modest impairments that flow through with further deterioration, but it's not going to be the significant kind of programing that you've seen in the past. I think we've got really terrific shock absorbers within our operating platform to be able to continue the program.\n\nEven if you look at a downside scenario, we'll continue to be building and volume-focused through alterations in the market.\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nAnd you really can't underestimate the leverage that we get in working with our trade partners as things slow down across the board. People are looking for work. If we're going to be the ones out there starting homes, we're going to get cost concessions, bringing across concessions from our trade partners, from our land partners. And we're just going to continue, as Jon said, value engineer.\n\nAnd we stand by our product in order to make it more affordable so we can have more higher margins.\n\nMatthew Bouley -- Barclays -- Analyst\n\nWonderful. Thank you both for that. And second one, you know, Stuart, you just alluded to it, but I wanted to ask about the impairment side. You did take the small write-downs in the quarter.\n\nIt sounds like your -- as you just mentioned, that, you know, you might expect some smaller ones going forward. But just kind of, I guess, number one, given what you did write down this quarter, did that kind of clear the deck, so to speak, or, you know, as you think about potential market deterioration, you know, what would be that kind of next decile of communities, you know, where there is risk? Just kind of any elaboration on owned land impairments and then further option to walk away. Thank you.\n\nStuart Miller -- Executive Chairman\n\nOK. Look, I understand the concern and the black box of impairments that, naturally, people feel. If you look historically, we've been very quick to get ahead of the curve. And so, when you ask the question, do we clear the decks? We're always clearing the decks, and that's how we think about it.\n\nThe answer is if the market's going to continue to deteriorate, and we can't put a boundary on what that might mean, we're going to always be straightforward and give as much visibility as possible. And I don't think there's additional visibility to give right now. I think that the size and scale of what we took as an impairment is about all there is. We really, you know, especially given cash and balance sheet and everything else, we really shook the tree this time and as we always do.\n\nAnd, you know, we cleared the decks, as you say. I think you're going to consistently see that with Lennar. It's always been the case with Lennar. Diane, do you want to add to it?\n\nDiane Bessette -- Chief Financial Officer\n\nYeah. I was going to say, Matt, you know, if you think about what you're looking for in impairments, it's where are you finding negative net margins. And so, if you look at where our gross margins are, it's not a surprise that our impairment, you know, split between backlog and asset communities. And the asset community size is 18.\n\nAnd we have 1,200. So, there's always going to be some communities that have negative net margins. But given, you know, where we are as a company on average, I don't think that the concern for net margins should be as great as some people are articulating. There's always going to be some backlog adjustments.\n\nThere's always going to be some communities that are below the norm. But I don't think we're anywhere near the widespread impairment that people are voicing concern over.\n\nMatthew Bouley -- Barclays -- Analyst\n\nGreat. Well, thank you, Diane. Thanks, Stuart. Good luck, everyone.\n\nStuart Miller -- Executive Chairman\n\nYou bet.\n\nOperator\n\nNext, we'll go to the line of Truman Patterson from Wolfe Research. Please go ahead.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nHey, good afternoon, everyone. And, Diane, congratulations on the cash balance.\n\nDiane Bessette -- Chief Financial Officer\n\nThank you.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nSo, first question is kind of three-part with your dynamic pricing model. One, you know, could you just elaborate, you know, on it a bit more with, you know, perhaps not giving away too much competitively, if you will. But second, I understand every market is different, but could you just discuss generally what level of pricing, maybe below nearby computing communities is generally needed to move the inventory? And then three, well, Stuart, I believe said that incentives kind of accelerated through the quarter discounts. Anyway, in orders, you could just kind of give us an understanding where you sat in November-December versus maybe a year ago.\n\nStuart Miller -- Executive Chairman\n\nSo, was the first point that he was asking about the pricing model?\n\nDiane Bessette -- Chief Financial Officer\n\nThat's --\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nYeah, yeah. The dynamic pricing model.\n\nDiane Bessette -- Chief Financial Officer\n\nSo, one of the questions --\n\nStuart Miller -- Executive Chairman\n\nSo, Truman, to be able to understand and really get into the pricing model, you'd have to talk to the inimitable Jeff Moses. And he doesn't talk to anyone, and internally. But if you want to go ahead and answer that, Diane?\n\nDiane Bessette -- Chief Financial Officer\n\nSo, one of the questions --It's really an incredible tool, Truman. And we really should spend -- and I'm happy to do that, really, happy to spend some time. It's much more involved than you would imagine. It's a home-by-home assessment.\n\nEach home, each community --\n\nStuart Miller -- Executive Chairman\n\nMarket.\n\nDiane Bessette -- Chief Financial Officer\n\nEach market. And the tool looks at three of what we sold that exact plan for over time. And it also looks at the market competition for that plan in that community in that market. So, it's a lot of detail, but the point is it truly gives us in an unbelievable amount of real time detailed information because that's really the only way that you can price.\n\nWe talk about it in a very high level, but pricing really is at a planned community market level. And it allows us to be really flexible when precedent is going up, as well as pricing is going down. Use the tool in all market conditions.\n\nStuart Miller -- Executive Chairman\n\nAnd it is real time available to the local market, as well as to the corporate office and everyone in between. And so, that connected engagement really enabled us to say close to the market, close to the pricing, and very interactive at all levels in the company.\n\nDiane Bessette -- Chief Financial Officer\n\nAnd react quickly.\n\nStuart Miller -- Executive Chairman\n\nYeah.\n\nJon Jaffe -- Co-Chief Executive Officer and Co-President\n\nThe other thing that tool does is you hear us throughout our strategy is talk about start pace and sales pace. This tool connects all of the dynamics and metrics Diane just reference to that pace so we can adjust in real time to make sure that we're not ever getting behind the pace that we want to be at.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nOK, perfect. And then any -- I'm just trying to understand maybe the last is the -- of demand with, you know, how much might be needed to move relative to, you know, some competitors nearby.\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nWell, as we said in that commentary, we're constantly evaluating what's going on with other competitors, what their inventory position is, what their pricing is, how are they generating sales. And this is a very fluid conversation that Jon and I have with the regional presidents and the division presidents. We are all over this. And, you know, to the extent someone makes a pricing adjustment and we need to move something, we're going to move it.\n\nWe want to stay ahead of it and hopefully have them follow what we do. And there's not anything that we're really not familiar with that's going on out there.\n\nStuart Miller -- Executive Chairman\n\nAnd it dovetails -- all of this dovetails with our digital marketing focus. We have a robust digital marketing group with, you know, a data science component that dovetails exactly with the dynamic pricing programs that we're generating. We're generating the customer base and building the pricing that is going to appeal in creating the intersection.\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nAnd I think that the drop the mic or the proof in the pudding is, as Stuart mentioned, that we've only got 900 completed homes in the company right now.\n\nStuart Miller -- Executive Chairman\n\nRight.\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nAnd, you know, in many ways, I would tell Jon, I'd like some more. Jon said he like less. As we have our even flow and machine going, and homes are being produced as we match them to sales, we've got the perfect demand inventory there.\n\nStuart Miller -- Executive Chairman\n\nYeah. And I'm going to say, as long as you brought it up, we have 900 homes in inventory. We would actually be better with more of that standing inventory because today's customer is --\n\nDiane Bessette -- Chief Financial Officer\n\nPremium.\n\nStuart Miller -- Executive Chairman\n\nYeah, it's, it's premium. and I want to emphasize one more time, there were no bulk sales at discounted rates to clear inventory. And, you know, you always trust what you read. So, let's go from there.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nOK. OK, perfect. And then, just on the vendor and contract or savings specifically, what inning of cost savings do you think we're in today? And, you know, as of, we'll call it, December 15th, are the savings primarily on the labor side? Or there, you know, certain materials, products outside of lumber.\n\nJon Jaffe -- Co-Chief Executive Officer and Co-President\n\nWe're clearly in the early innings because as the homebuilding industry is completing the fourth quarter of the year you have for all builders really drove their largest production quarter. So, labor has been -- has remained very busy while the market had slowed down prior to the fourth quarter. And as Stuart noted and I noted, that's why you typically always see a lag between sales prices moving down and then construction costs moving down. So, we're clearly in the early innings of that.\n\nWe feel like we've got tremendous traction. And as I noted earlier, I think we'll see significant movement as we move through our first quarter into our second quarter in terms of reductions. And that will happen primarily because starts have dramatically slowed within the industry. We've kept our start level at a consistent pace.\n\nAnd so, as that labor frees up, that brings the cost of labor down, but also to start to come down, that creates more availability of materials for the manufacturing production. So, material prices come down as well. That also tend to lag a little bit more behind labor because it's got a longer production cycle where labor is more immediate.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nAll right. Thank you all for the time.\n\nStuart Miller -- Executive Chairman\n\nYou bet. We're going to have two more.\n\nOperator\n\nThank you. OK, perfect. Thank you. Our next question is from Alan Ratner from Zelman and Associates.\n\nPlease go ahead.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nHey, guys. Thanks for squeezing me in and for all the information so far. Stuart, I'd love to drill in a little bit on your kind of industrywide stance outlook for next year. You know, my initial reaction when you kind of threw out down 30% was a little bit of surprise.\n\nAnd I guess the way I'm thinking about it is, you know, you guys are targeting a pretty flat pace for the year. Your largest competitor, D.R. Horton, has kind of articulated something similar. You guys are 25% of the single-family production market.\n\nThere's been a lot of other builders that, you know, pull back very sharply this year on starts as they were kind of clearing through some of the spec they built up in the spring. But a few have said, you know, we see the advantages of spec. We're going to ramp our start pace heading into the spring to kind of capitalize on that as well. So, I guess my question is, you know, how do you kind of arrive at that number? And let's say for argument's sake, you know, the decline is less than that.\n\nLet's say it's 10% or 20%. Does that impact your, you know, confidence on kind of getting the cost savings that you're clearly expecting for the year and the margin guidance that you gave as far as 1Q being the low watermark?\n\nStuart Miller -- Executive Chairman\n\nSo, first of all, Alan, I said that. you know, we could look at some of the larger builders, and I'm sure that they'll, you know, adjust their start pace. And no one's asleep at the switch in our industry, a lot of very smart participants. But there are some practical realities relative to smaller builders across the country.\n\nRemember, the larger builders are that we make up a portion, and the capital markets are complicated right now. It's not just a question of strategy for. For some, it's a question of, you know, what can we actually get started and how are the capital markets supporting it? I think that it might be only 10% or 20% or 30% -- I don't know what the percentage is going to be. My personal view is that it looks like many of the smaller builders have really pulled back the complication of price reductions and what's been paid for land and stuff like that.\n\nThe other side of it, which makes up about a third of production, is multifamily. And the multifamily capital markets are very frozen up right now. I think that the number of new communities coming out of the ground for multifamily and even the single family for rent buyers are kind of seized up because of the capital markets considerations. So, let's not even throw in strategy just from a capital market standpoint.\n\nIt feels me you can't prove it that a very sizable portion of starts for next year are going to be, you know, under limitation. Now, if it ends up being only 10% instead of 25%, you know, still, you're looking at a housing shortage. I know that there there's many with different opinions on this. I believe there's been a production shortage, housing shortage across the country.\n\nIf you talk to mayors and governors across the country, their single biggest concern is workforce, housing, workforce, housing supply, and affordability. It is a drumbeat that is in almost every major city and every state. And we feel that there is a shortage that is going to be compounded by the fact that there will be some production and reduction out of this. And whether it's 10% or 35%, it's still going to be short supply and, I think, the more limited downturn.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nI appreciate the insight there, Stuart. Second, I think you kind of touched on it a little bit. You highlighted your can rate peaking in October. But just to kind of be more explicit, can you just talk about what changes you have seen over the last, you know, three, four weeks with, you know, pullback in rates? Have you seen homebuyer demand improving? And, you know, any pricing power coming back even or maybe a moderation in the need for additional incentive thus far in November and early December so far?\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nWe've seen a combination of increased traffic, greater buyer demand, traffic increase both on the community level and on our website. Definitely you fewer cans, which we noticed. And all of that is just being stabilized in the environment, hasn't quite led to higher pricing yet, but those are generally what happens before you gain some sort of pricing power that counts.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nThanks, Rick. And just to be clear, that is incorporated in your 1Q order guidance of down 15 to, I think, 25 or so percent. That incorporates the --\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nYes, that's the range that we're expecting at this point in time.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nOK. All right. Thanks a lot, guys.\n\nStuart Miller -- Executive Chairman\n\nOK. Thanks, Alan. One more question, please.\n\nOperator\n\nThank you. Our final question comes from Mike Rehaut from JPMorgan. Please go ahead.\n\nStuart Miller -- Executive Chairman\n\nHi, Mike.\n\nMichael Rehaut -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks so much. Appreciate you taking my questions.\n\nStuart Miller -- Executive Chairman\n\nNice to end the call today.\n\nMichael Rehaut -- JPMorgan Chase and Company -- Analyst\n\nAppreciate that, Stuart. First question, just wanted to be clear. I'm sorry if I'm not fully grasping elements of the guidance or comments. But on, on your view around or outlook around first quarter gross margins being the lowest of the year and improving from there on in.\n\nJust wanted to be clear that, or perhaps you could articulate a little bit, what type of view on price or pricing trends over the next six to nine months does that incorporate? Because certainly it appears that it's incorporating some amount of cost relief, I guess, as you're going into the back half. Just curious how much of a basis-point standpoint the cost relief is, but, more importantly, what type of view on price. Does that outlook for gross margins throughout fiscal '23 reflect?\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nSo, from a price ASP standpoint, we're not assuming any depreciation in the market. That's where we're underwriting that. That's what we see out there. To the extent that there's price appreciation or we're able to increase our ASP, what we do with incentives.\n\nAnd there's a benefit in, you know, the financing market that's just incremental upside to what we view will happen in 2023.\n\nJon Jaffe -- Co-Chief Executive Officer and Co-President\n\nJust to emphasize Rick's point, Michael, if you think about, mortgage rate buydowns as really being a very effective tool in making sales in this environment, to extent that rates come in to cost of that buydown becomes less expensive, and you can see, probably, you know, potentially the biggest benefit from that if that come in.\n\nMichael Rehaut -- JPMorgan Chase and Company -- Analyst\n\nSo, just to be clear, then. You're not baking in, obviously, any price appreciation. But on the flip side, you're not baking in any further softening in pricing trends from here on in as well in terms of additional incentives or price discounts needed if the market continues to slip from here.\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nThat's correct. So, we're assuming no price appreciation, no incremental price reductions. We think that the incentives that we've been offering are good, solid incentives and base prices in order to attract the volume. I think you can see that in the numbers that we've been generating.\n\nYou know, the margin upside throughout the year, as we noted in Q1, is going to be the low point, is really going to come from several things. One, as Jon went through, is cost side. Jon went through the cycle time. Stuart talked about lands.\n\nAnd we're going to continue to value engineer product to the extent that we need to.\n\nStuart Miller -- Executive Chairman\n\nYou know, and to the extent that prices curtail a bit more, some of the embedded cost savings are going to be offset through that. But I think that we've gotten ahead of where prices have been going. And, you know, so, we're looking at kind of a level field right now.\n\nMichael Rehaut -- JPMorgan Chase and Company -- Analyst\n\nOK. No, I appreciate that. And I guess just secondly, any thoughts around community count growth as the year progresses? You know, I know obviously there's been movement on the lot side and walking away from certain amounts of lots on the option side. But oftentimes, that might impact, you know, one or two years out.\n\nSo, any thoughts around where the community count might be by year-end '23 versus '22?\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nSo, we'd really rather not talk about community count right now because it's a very moving picture. You might expect basically renegotiating and repositioning deals that community count could or should grow in the back half of '23. But I think, right now, it's just too soon to give any guidance as to what those numbers would be.\n\nMichael Rehaut -- JPMorgan Chase and Company -- Analyst\n\nRight. Thanks so much.\n\nStuart Miller -- Executive Chairman\n\nOK. Thank you, Mike, and thank you, everyone, for joining us. I know that we went on a little longer than normal, but, you know, these are complicated times. It's been a complicated year-end, and we want to give a lot of detail.\n\nLook forward to reporting back in our first quarter. And if you have further questions, give us a call. Thank you, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAlex Lumpkin -- Deputy General Counsel\n\nStuart Miller -- Executive Chairman\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nJon Jaffe -- Co-Chief Executive Officer and Co-President\n\nDiane Bessette -- Chief Financial Officer\n\nStephen Kim -- Evercore ISI -- Analyst\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nMatthew Bouley -- Barclays -- Analyst\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nMichael Rehaut -- JPMorgan Chase and Company -- Analyst\n\nMore LEN analysis\n\nAll earnings call transcripts"
}