{
  "companyName": "Cincinnati Financial",
  "companyTicker": "CINF",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/cincinnati-financial-cinf-q3-2022-earnings-call-tr/",
  "content": "Cincinnati Financial (CINF -1.70%)\nQ3 2022 Earnings Call\nNov 01, 2022, 11:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Cincinnati Financial third quarter 2022 earnings conference call. [Operator instructions] Please note, this event is being recorded. I would now like to turn the conference over to Dennis McDaniel, investor relations officer. Please go ahead.\n\nDennis McDaniel -- Investor Relations Officer\n\nHello. This is Dennis McDaniel at Cincinnati Financial. Thank you for joining us for our third quarter 2022 earnings conference call. Late yesterday, we issued a news release on our results along with our supplemental financial package, including our quarter-end investment portfolio.\n\nTo find copies of any of these documents, please visit our investor website, cinfin.com/investors. The shortest route to the information is the quarterly results link in the navigation menu on the far left. On this call, you'll first hear from chairman and chief executive officer, Steve Johnston, and then from executive vice president and chief financial officer, Mike Sewell. After their prepared remarks, investors participating on the call may ask questions.\n\nAt that time, some responses may be made by others in the room with us, including president, Steve Spray; senior vice president of investments, Steve Soloria; and Cincinnati Insurance's chief claims officer, Marc Schambow; and senior vice president of corporate finance, Theresa Hoffer. First, please note that some of the matters to be discussed today are forward-looking. These forward-looking statements involve certain risks and uncertainties. With respect to these risks and uncertainties, we direct your attention to our news release and to our various filings with the SEC.\n\nAlso, a reconciliation of non-GAAP measures was provided with the news release. Statutory accounting data is prepared in accordance with statutory accounting rules and therefore, is not reconciled to GAAP. Now, I'll turn over the call to Steve.\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nThank you, Dennis. Good morning, and thank you all for joining us today to hear more about our third quarter results. In addition to market volatility affecting the valuation of our investment portfolio, elevated inflation and natural catastrophe events affecting the industry also continued to pressure our property casualty insurance results. We remain well positioned to improve performance through ongoing focus on successfully executing profitable growth strategies for our insurance operations, similar to how we have managed past challenges.\n\nOur financial strength provides us the ability to maintain a long-term view, keeping a steady approach that can benefit all stakeholders. We reported a net loss of $418 million for the quarter due to the recognition of a reduction in the fair value of securities held in our equity portfolio. Non-GAAP operating income of $114 million for the third quarter of 2022 was down $95 million from a year ago, including catastrophe losses that were $19 million higher on an after-tax basis. Our 103.9% third quarter property casualty combined ratio was 11.3 percentage points higher than the 92.6% for the third quarter of last year.\n\nInflationary pressures led to higher estimated ultimate losses and rising loss ratios on a current accident year basis, while we experienced another quarter of favorable development on prior accident years, it was less favorable than a year ago. We continue to respond with underwriting selection and pricing actions addition to prudent reserving for estimated ultimate losses. In addition to various premium rate increase filings with the states, underwriters have increased expectations to address current inflationary trends in areas such as risk selection criteria, pricing of policies and adjusting premium factors for changes in exposure. Commercial umbrella loss experience has been elevated in recent quarters, and it's challenging to determine relevant drivers given unusual business activity and general uncertainty as the pandemic waned.\n\nFor example, the third quarter of 2022 included three very large claims with estimated losses averaging $9 million each, while elevated losses during the second quarter were driven more by a higher frequency of smaller claims. We continue to carefully underwrite commercial umbrella risks and respond promptly to adequately reserve for emerging loss patterns which we expect will eventually lead to a return of profitability for our commercial umbrella business. Overall premium growth was strong and included average renewal price increases for each of our property casualty insurance segments. Cincinnati Insurance appointed agencies continued their outstanding production and our underwriters are focused on working to retain and grow profitable accounts while addressing areas where they judge pricing is not adequate segmenting opportunities on a policy-by-policy basis.\n\nConsolidated property casualty net written premiums rose 14% for the third quarter of 2022. That included a 12% increase in third quarter renewal written premiums, including 11% each for our commercial lines and personal lines insurance segments. Higher renewal premiums included healthy increases for higher levels of insured exposures that are rising faster due to elevated inflation amounts. For example, our commercial property premium adjustments for rising costs of building materials, so far this year, are about double the level of last year.\n\nIn addition to exposure increases, our commercial lines Insurance segment continued to experience estimated average renewal price increases in the mid-single-digit percentage range, somewhat higher than the second quarter. Our excess and surplus lines insurance segment continued in the high single-digit range, also higher than the second quarter. Personal lines average renewal price increases remained in the low single-digit range with auto a little higher and homeowner a little lower than the second quarter. Personal auto insurance for the industry, including our book of business, generally needs higher premium rates to achieve profitability.\n\nBased on our rate filings that average low double-digit rate increases for policies effective beginning January 1, 2023, we expect the full year 2023 personal auto written premium effect will be an average premium rate increase of approximately 10%. The commercial lines segment grew third quarter 2022 net written premium by 10% with a combined ratio of 99%, reflecting elevated inflation effects and catastrophe losses 1.2 percentage points higher than a year ago. For our personal lines segment, net written premium grew 15%, mostly from our continued planned expansion of high net worth business produced by our agencies. Its third quarter combined ratio of 104.5% also reflected elevated inflation effects while the catastrophe loss ratio was 4.1 percentage points lower than last year's third quarter.\n\nOur excess and surplus lines segment had a 93.9% combined ratio and continued healthy growth with the third quarter 2022 net written premiums increase of 16%. Cincinnati Re and Cincinnati Global each experienced significant catastrophe losses from Hurricane Ian that drove their underwriting loss for the quarter. We expect catastrophe losses of that magnitude from time to time. Our estimate as of September 30 was within our expectations of loss potential for events of Ian's magnitude based on our models.\n\nResults of modeled effects estimating probable maximum losses are disclosed in our annual report on Form 10-K. Cincinnati Re grew third quarter 2022 net written premiums by 51%, while Cincinnati Global grew 21%, each having what we believe are good prospects for future profitability. Our life insurance subsidiary continued to perform quite well. Along with growth in term life insurance earned premiums up 4%, it produced third quarter 2022 net income of $21 million and nearly tripled operating income of a year ago.\n\nWe continue to use the value creation ratio as our primary measure of long-term financial performance. VCR was negative 8.4% for the third quarter of 2022. Net income before investment gains or losses made a positive contribution, but was again offset by lower investment valuations during the quarter. Next, chief financial officer, Mike Sewell, will highlight several other points we consider important regarding our financial performance.\n\nMike Sewell -- Chief Financial Officer\n\nThank you, Steve, and thanks to all of you for joining us today. Investment income growth continued at a rate of 8% for the third quarter of 2022 compared with the third quarter of last year. Dividend income rose 8% for the quarter. Net equity securities purchased during the first nine months of 2022 totaled $47 million.\n\nBond interest income grew 7% in the third quarter. The pre-tax average yield of 4.08% for the fixed maturity portfolio was 2 basis points higher than a year ago. The average pre-tax yield for the total of purchased taxable and tax-exempt bonds continue to rise, reaching 5.39% during the third quarter of 2022. We again purchased additional fixed maturity securities with net purchases totaling $534 million during the first nine months of the year.\n\nValuation changes for our investment portfolio during the third quarter of 2022 were unfavorable in aggregate for both our stock and bond holdings. The overall net decrease was approximately $1.2 billion before tax effects, including an additional and $514 million of unrealized losses in our bond portfolio. At the end of the quarter, total investment portfolio net appreciated value was approximately $3.5 billion. The equity portfolio was in a net gain position of $4.5 billion, while the fixed maturity portfolio was in a net loss position of just under $1.1 billion.\n\nCash flow continues to fuel growth of investment income. Cash flow from operating activities for the first nine months of 2022 generated $1.4 billion compared with $1.5 billion a year ago. Regarding expense management, we continue to apply what we see as the appropriate balance between expense control and strategic investments in our business. The third quarter 2022 property casualty underwriting expense ratio was 1.3 percentage points lower than last year.\n\nMost of the decrease was from lower accruals for profit sharing commissions for agencies. Next, I'll comment on loss reserves. We continue to use a consistent approach that targets net amounts in the upper half of the actuarially estimated range of net loss and loss expense reserves. As we do each quarter, we consider new information such as paid losses and case reserves and then updated estimated ultimate losses and loss expenses by accident year and line of business.\n\nIn the first three quarters of 2022, our net addition to reserves was $814 million, already exceeding the full year amounts for both 2021 and 2020. We think that's a strong indication of the quality of our balance sheet. During the third quarter 2022, we experienced $43 million of property casualty net favorable development on prior accident years that benefited the combined ratio by 2.4 percentage points. On an all-lines basis by accident year, net reserve development for the first nine months of 2022 was favorable and included $94 million for 2021, $95 million for 2020 that was partially offset by unfavorable $46 million in aggregate for accident years prior to 2020.\n\nWhile we've recently reported significant unfavorable reserve development on prior accident years for our commercial casualty lines of business, the net $25 million for the first nine months of 2022 included $41 million for the commercial umbrella and net favorable amount of $16 million for other coverages included in commercial casualty. Moving on to briefly highlight our consistent approach to capital management, we again repurchased shares that include maintenance intended to offset shares issued through equity compensation plans. Importantly, we continue to believe we have plenty of financial flexibility and also believe that our financial strength remained in excellent shape. During the third quarter we repurchased just under 2.1 million shares at an average price per share of $98.50.\n\nAs usual, I'll conclude with a summary of third quarter contributions to book value per share. They represent the main drivers of our value creation ratio. Property casualty underwriting decreased book value by $0.12. Life insurance operations increased book value $0.14.\n\nInvestment income, other than life insurance and net of noninsurance items added $0.42. Net investment gains and losses for the fixed income portfolio decreased book value per share by $2.58. Net investment gains and losses for the equity portfolio decreased book value by $3.46 and we declared $0.69 per share in dividends to shareholders. The net effect was a book value decrease of $6.29 per share during the third quarter to $60.1 per share.\n\nNow, I'll turn the call back over to Steve.\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nThanks, Mike. Our fundamentals are strong, and we have an excellent book of business curated from our agency's best accounts. We've clearly communicated across the organization, the steps we need to take to improve challenged areas of our business and our underwriters are focused and aligned to those goals. Our financial strength remains excellent and allows us to keep concentrating on our long-term strategies and objectives of remaining a steady insurance market and producing shareholder value far into the future.\n\nAs a reminder, with Mike and me today are Steve Spray, Steve Soloria, Marc Schambow and Theresa Hoffer. Anthony, please open the call for questions.\n\nOperator\n\n[Operator instructions] Our first question will come from Paul Newsome with Piper Sandler. You may now go ahead.\n\nPaul Newsome -- Piper Sandler -- Analyst\n\nThank you, and good morning. I wanted to touch a little bit about maybe additional color on the deterioration in the accident year perhaps in commercial, but -- and also in excess and surplus lines, That's excluding the umbrella piece. Can you talk about sort of what's going on there from I guess it's just a pure inflation issue? Or is there something else in that -- in those pieces that we should know?\n\nSteve Spray -- President\n\nHey. Paul, good morning. This is Steve Spray. Let me tackle the E&S piece first.\n\nAnd I would say to you there, it's -- that book is about 90% casualty-driven. It's got inherent variability in it. It's E&S casualty is a severity business. and you're going to get noise from quarter to quarter.\n\nI think it's more meaningful to look at over a longer period. And through nine months, I think you can see that, that book continues to perform well. The E&S company is coming off of nine years in a row, of a 90 combined or better. and performing well through nine months, too.\n\nBut I would say that similar to what we're seeing on the casualty side on the primary business, standard business, we are seeing inflation or inflationary pressures there and taking prudent reserves to recognize that also.\n\nPaul Newsome -- Piper Sandler -- Analyst\n\nAnd maybe on the regular commercial business, is there anything in there other than pure just general inflation?\n\nSteve Spray -- President\n\nYeah, I think it's general inflation. I think it's businesses getting back to normal post COVID or post pandemic. And I think a lot of what we're seeing in the casualty book, the inflationary pressure is primarily on that commercial umbrella line.\n\nPaul Newsome -- Piper Sandler -- Analyst\n\nAnd then I was hoping you could talk a little bit about cat exposure in general. It's been elevated the last couple of years. And I noticed there's a fair amount of cat exposure coming through at least as it's reported in the Cincinnati Re and Cincinnati Global. How do you think about sort of -- how should we think about the cat load going forward? Is it kind of on average, what we've seen in the last couple of years about right? Is that kind of the choice that Cincinnati has made.\n\nI think historically, the cat loan at Cincinnati is known to be low, but it seems like it's kind of moved from a kind of four to seven to somewhere around seven to 12. And how should we think about that prospectively?\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nPaul, this is Steve Johnston. And I think we have a vibrant risk management process that we adhere to. We do modeling of all of the particular risks. I think we're in a very good position with our property in terms of cat-exposed pricing now.\n\nI think that they have already been -- the prices have already been going up. They will continue to go up. I think if we look at CGU, our Lloyd's Syndicate, they've been a top quartile underwriter over at Lloyd's in the last two years. Even with the cats, so far for nine months, their combined ratio is under 100, and we're seeing strong rate growth there.\n\nAnd at the same time, they are diversifying into lines of business outside of the property related. I think similarly with Cincinnati Re, we've started that from scratch just several years ago. We've developed a very talented team that really looks to understand all of their risks, both quantitatively and qualitatively. And we are very bullish on the opportunity for rate that both will get as we move into the year-end renewals and into next year.\n\nSo we feel good about our property in catastrophe-related exposures. I guess, I would even throw in high net worth there. There's a little bit more exposure there. But we think with the type of underwriting that we do, the quality of the homes we're writing and the potential for higher rate at this point, we're very confident and bullish that we are going to get really strong rate increases in all those areas.\n\nPaul Newsome -- Piper Sandler -- Analyst\n\nI mean, that's great. I guess, but my question really is sort of is this an underwriting choice that we've seen a couple of years of elevated cats because you're moving into more property and stuff that has more catastrophe events? Or is this just an anomaly for the last couple of years?\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nWell, I think our actual cat losses over the last couple of years have really not been that outsized. We've been in a position where years ago before we went into more diversification of our book a year with a heavy cat loss like this could put over 100% and did. If you look back to 2011 in those type of years. And now with, I think, a better spread of risk, we can take body blows like this.\n\nWe're still under 100% year-to-date and feel that we are bullish about the fourth quarter toward taking our streak of sub-100 combined ratios to 11 consecutive years. And I think over those -- that time period, we've outperformed the industry on a combined ratio basis by about 5 points, and we've been growing at about half again the rate, this is in total, which puts us in a good position to invest well. And as you've seen with the investment income as Mike described, pre-tax up 9% year-to-date, among that, dividend increase is up 13%, the equity portfolio has outperformed the S&P 500, both on a year-to-date basis and on a five-year trailing. That drives our cash flow.\n\nAnd if you would look at our cash flow over time, it really has increased. If we would go back to 2012, our cash flow from operations was $247 million. It's increased very steadily ever since then up to about $1.1 billion in the 2016, 2017 time period, up to nearly $2 billion a year ago. As Mike mentioned, we're at $1.4 billion through nine months compared to $1.5 billion.\n\nSo that's our strategy, Paul, is we're going to grow over the long pull, as Steve mentioned, we think above the industry rate. We're going to do it with a combined ratio that is better. We're going to provide overwhelming claim service. We're going to invest well, both with our fixed income and our equity portfolio, generate a lot of cash that we can then return to shareholders as we've done with our dividends by increasing them some 62 years in a row.\n\nWe're going to continue to have a strong balance sheet as our reserves have developed favorably, I think, 33 years in a row. That's just our basic strategy over time is to steadily execute our strategy, and we think it will deliver value for our shareholders for a long time to come.\n\nPaul Newsome -- Piper Sandler -- Analyst\n\nThat makes a lot of sense. Thank you for the help as always. Much appreciated.\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nThank you, Paul.\n\nOperator\n\nOur next question will come from Mike Zaremski with BMO. You may now go ahead.\n\nMike Zaremski -- BMO Capital Markets -- Analyst\n\nHey. Good morning. So just piggybacking off the last question. So it sounds like from your answer, if we think about the outlook for Cincinnati Re into 2023.\n\nIt feels like your appetite remains focused toward growth and Cincinnati Re's results over the last couple of years are -- I guess, I don't want to put words in your mouth, but you're OK with those results and kind of no change in strategy there.\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nI would say that we'll see -- I would very much anticipate, significant rate increases. I think one thing to keep in mind to tie on to my comments, only about one-third of the Cincinnati Re written premiums, which in total are about a little bit over $0.5 billion through nine months, about one-third are property, another half are casualty and the other one-sixth specialty. So we will look across the organization very -- with a lot of scrutiny as to where we allocate capital in the property area relative to the type of pricing that we think we get on a risk-adjusted basis for the contracts and policies that are offered to us. So I think with Cincinnati Re, they're running just over 100 -- I think 103.9% or so inception to date.\n\nAnd given the toughness of the reinsurance market over that period of time, yes, I'm not disappointed with that. We've been able to build a great team without really any cost to the organization and are now well positioned, I think, as these prices firm to opportunistically and on a risk-adjusted basis, take advantage of it.\n\nMike Zaremski -- BMO Capital Markets -- Analyst\n\nI guess just curious if Cincinnati Re gives you guys some diversification. But is the combined ratio target for Cincinnati Re meaningfully lower than the companywide range?\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nIt's lower than the company range, yes.\n\nMike Zaremski -- BMO Capital Markets -- Analyst\n\nOK, great. I guess, switching gears to commercial casualty and I appreciate your honesty and comments about the activity this quarter was a little unusual as it was larger claims versus prior quarters, so some smaller claims. So I just -- it sounds like there's not going to be post pandemic, hopefully, knock on wood, you're coughing it up to just a normalization and kind of funky trends over the last couple of years. So it just -- it sounds like you're not going to take any meaningful terms and conditions or kind of strategic actions to rethink kind of multiyear policies or anything? Just -- it sounds like kind of steady as she goes, you're going to take some rates and nothing kind of beyond that to kind of take into account these unusual past couple of quarters or more.\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nWell, we are going to take strong action. I think the one thing we want to point out is just to recognize that we do have inherent volatility in our umbrella book. For 2019, our paid losses for umbrella were up 80%. And then in 2018 and 2020, they were down 35%.\n\nSo there's going to be some variability there. but we are all hands on deck. And I think Steve Spray is best to describe the specifics of what we're going to do to address umbrella.\n\nSteve Spray -- President\n\nYes. Thanks, Steve. Good morning, again, Mike. Yeah, I don't want you to leave thinking that we're not taking action on the umbrella book.\n\nLike Steve said, it's a sizable book for us. It's over $500 million. We've written umbrella very well for many, many years. We've got a lot of expertise on that front.\n\nWe feel very good about the line. It's performed very well. As a matter of fact, from 2017 through 2021, each year, our umbrella excess book was sub-80 combined each year. Definitely have inflationary pressure.\n\nYou can see it, as Steve said in his remarks and then in our Q and in our release as well. The book needs rate. It's getting rate not only from specific rate increases that we're providing to the umbrella, but you're also getting lift from the underlying exposure changes as well because umbrella is priced off of your underlying general liability and your underlying auto. So we're getting lift there.\n\nWe analyze every single large loss we have and look at it from a standpoint, do we see any specific trends, whether it be geography, class of business, segment, agency, field rep. Don't see any trends there. I would tell you that our commercial umbrella is typically driven by the underlying commercial auto, meaning those underlying commercial auto losses that will pierce up into the umbrella. So like Steve said, it's all hands on deck.\n\nIt's risk selection, it's pricing. And it's also looking at where we lay out the capacity, different jurisdictions, whether it be individual state, or segment of the market. So something that we've done well for a long time. We think we can -- well, not think, I know we can return it to profitability.\n\nWe've taken prudent reserving here with the uncertainty that we've experienced. But like Steve said, it's all hands on deck.\n\nMike Zaremski -- BMO Capital Markets -- Analyst\n\nOK, that's very helpful. And maybe a similar question, if I can sneak another one in, on personal lines. The data, I guess, we can look at, but the cognizant that you are, you have more of a superregional focus versus some of the national players that you've been taking a little less rate than many peers over the last year. It sounds like, clearly, you've stated the last couple of quarters, you're going to start pushing the gas on taking rate in personal lines, especially in auto.\n\nBut just curious, when you speak to your agents, do you expect an impact on your top-line growth? Or is it going to change kind of your strategy near term? And just curious if you also feel like some of the business you've put on the books over the last year, just probably isn't that profitable, but you're playing the long game especially in the high net worth space. So over time, you'll well exceed your cost of capital. Thanks.\n\nSteve Spray -- President\n\nYeah. Great question, Mike. Will make sure I can get all that in my answer. If I don't, please give me a follow-up.\n\nBut our -- we're about 50-50 now, high net worth to middle market. Our middle market business has been under pressure for several years as we have taken -- we've had to take specific rate action. And quite frankly, in some specific states, we had to be pretty aggressive. And that put our middle-market personal lines growth under pressure.\n\nIt's still under pressure, but we think we've seen the bottom. New business for middle market is actually up through nine months this year in personal lines. The last three years on personal auto have performed very well. We're definitely seeing the inflation pressure this year.\n\nHence, what Steve talked about as far as the rates that we're going to be planning on getting in 2023. High net worth is performing very well. The industry for high net worth over time has outperformed the market personal lines. The last several years have been, I think, a little difficult for the industry with cat.\n\nBut I think we're at the right place at the right time with personal lines. And I think the fact that we're 50-50 is unique in the market. It's differentiating. Our agents appreciate it.\n\nAnd we're just getting more sophisticated and more segmented in our pricing as well. So I think the outlook for personal lines going forward is really, really good as well.\n\nMike Zaremski -- BMO Capital Markets -- Analyst\n\nYou got everything in there. Thank you.\n\nSteve Spray -- President\n\nOK, thanks, Mike.\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nThanks, Mike.\n\nOperator\n\nOur next question will come from Greg Peters with Raymond James. You may now go ahead.\n\nUnknown speaker\n\nHey, good morning. This is actually Sid on for Greg. We've got a couple of questions on the reserve charges and commercial casualty and commercial auto. So hoping maybe you could unpack that for a minute and provide any additional information.\n\nMike Sewell -- Chief Financial Officer\n\nSure. Yeah. Let me -- this is Mike. Let me start and then if Steve or Steve or anyone would like to add any color.\n\nBut -- for the quarter, we had favorable development of $43 million, which, as I indicated, was 2.4 points for the quarter. And I would note that for the last several years, we've been in the range of 2.5 to 5 points of favorable development. So the quarter is at the lower end of that range, but right there with the range. Unpacking it, as you described, every line had favorable development, except for the commercial casualty and then the auto for both commercial and personal.\n\nRelated to the commercial casualty for the quarter, that was unfavorable by $23 million. And of that number, $16 million related to commercial umbrella. And actually, for the quarter, it was -- there was some reserve strengthening for 2021 and 2020 accident year, but then the older accident years for commercial umbrella actually was favorable. That's a little bit of the opposite when you look at it on a year-to-date basis.\n\nAt year-to-date basis, we had $143 million of favorable development in total. Commercial casualty on a year-to-date basis was unfavorable by $25 million. When you unpack that, umbrella was unfavorable by $41 million, while all the other commercial casualty was favorable by $16 million. And then if you look at that, commercial casualty by accident year, it was favorable on a year-to-date basis for both 2021 and 2020.\n\nAnd then it was unfavorable for '19 -- accident year '19 and prior to that. I probably would also make the same comment if I think about commercial auto, personal auto, both on a year-to-date basis and a quarterly basis. That was unfavorable for both of those time periods. But then when you look at the exited years, it was the unfavorable development was primarily in the 2019 and previous accident years.\n\nBut it was favorable for accident year 2021, 2020. Those are a lot of numbers I threw out and hopefully impact that at least. But if there's any other questions or anyone else here would like to expand? Thank you.\n\nUnknown speaker\n\nGot it. Thank you.\n\nOperator\n\nOur next question will come from Scott Heleniak with RBC Capital Markets Insurance. You may now go ahead. Pardon me, Scott. Your line may be muted.\n\nScott Heleniak -- RBC Capital Markets -- Analyst\n\nHello. Good morning. \n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nGood morning, Scott.\n\nScott Heleniak -- RBC Capital Markets -- Analyst\n\nMorning. I just wanted to touch base real quick on the commercial umbrella. You gave some good detail on that. And you mentioned that the -- so it was more of a severity issue this quarter as opposed to second quarter's frequency.\n\nJust wondering if you can talk about how much of the deviation between the frequency between second quarter and third quarter. And I'm assuming that the severity was that just litigation -- adverse litigation that you saw on that book.\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nYeah, I don't have the exact frequency numbers. It was less frequency for the third quarter. I don't know that I would necessarily call it litigation as much as I would just say, we're getting some claims in, and we go to think about where we should set the reserve. It is just larger than -- these are larger claims than we had second quarter.\n\nIt was -- we're just trying to give some color that it was more frequency-driven for commercial umbrella in the second quarter and more severity driven in the third.\n\nScott Heleniak -- RBC Capital Markets -- Analyst\n\nOK. Yeah, that's fair enough. And then I just wanted to touch base real quick on the buybacks, you're pretty active again for the second consecutive quarter, a fair amount, a couple of hundred million. And so is this something that you might be a little more assertive or a little more regular on? Or is this -- I know you mentioned maintenance buybacks.\n\nIt seems like it's a little bit more than that, at least the couple -- the last couple of quarters, but if you could just give us your updated thoughts on where you were. It's certainly enough for the share count to be down year over year and to make a little bit of a difference, but anything you can offer there.\n\nMike Sewell -- Chief Financial Officer\n\nSure. No, this is Mike. I would say our thought process around that really has not changed. So I also call it a maintenance buyback.\n\nYes, you are correct for the quarter and for the year, now we've repurchased about 3.6 million shares. That's higher than the maintenance for the current year. But if you go back and look at the last several years, it has bounced around a little bit. Just a couple of years ago, we only purchased -- repurchased 600,000 shares.\n\nSo it's kind of on average, I'll say that it will cover our maintenance. If you go back to when we have some larger buybacks back in about 2007, 2008, our total share count is just slightly below where we were at that time. So -- it's -- we've kind of maintained a certain level. If it's down one million, two million, three million shares from that time period, that's probably not very significant, when you're -- when you've got 160 million shares outstanding.\n\nSo I would still call it a maintenance buyback, but it's -- we'll look at it quarter to quarter and may be higher, may be lower.\n\nScott Heleniak -- RBC Capital Markets -- Analyst\n\nOK. That make sense. I just add one last one, too, on the expense ratio. You made the comment how a lot of it was just driven by the lower contingent commissions that were paid.\n\nBut I know you mentioned a few quarters ago, but the target was to get the expense ratio down to 30%. And just wondering if you thought that might be realistic to happen in 2023 based on what you're seeing now?\n\nMike Sewell -- Chief Financial Officer\n\nWell, it's something that we continue to work on. So of course, we want -- our target is to be below a 30% expense ratio. But if we're not below 30%, because we are paying more commissions, profit sharing to agencies, that's probably a good thing overall. So I'll still take that, but we would still like to have a goal of being profitable, paying a lot of commissions and being under 30% would be a great way to do it.\n\nAnd so we'll still keep working on our expenses and trying to have the increase of expenses be slower than the increase in premiums.\n\nScott Heleniak -- RBC Capital Markets -- Analyst\n\nYeah. I agree on that, more than happy to pay the expense if you get the good business, but that's helpful. Thanks, a lot.\n\nMike Sewell -- Chief Financial Officer\n\nYou bet. Thank you for the questions.\n\nOperator\n\nOur next question will come from Meyer Shields with KBW. You may now go ahead.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nGreat. Thanks. Good morning, everyone. \n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nGood morning, Meyer.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nI guess the question that I'm hearing a lot is if there are issues in umbrella, is there any concern that, that is sort of the initial reflection of another wave of social inflation that will ultimately impact casualty lines because it sounds like you're still confident in reserve adequacy or redundancy elsewhere? And I was wondering how you're thinking about that.\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nMeyer, it's a good question. I think that it is a reflection of really all types of inflation. I think that when you look at upper layers, there's a leveraged impact. And then as you go up in layers for a constant inflation rate, it has a higher impact on each layer as you go up, and I think it's generally because those claims that otherwise would have been just below the attachment point now inflate into the layer as well as the normal inflation on the layer.\n\nSo I think it's something that we keep a close eye on, try to measure, try to price for, go through everything that Steve mentioned already in terms of all hands on deck from underwriting to pricing to claims to make sure that we are understanding the impacts on umbrella and also recognizing that there's volatility there, as I mentioned a little bit earlier in terms of what we've seen and variation of payments on commercial umbrella from one year to the next. There's just going to be some natural variation. But in this inflationary time period, it calls for very much a heightened sense of urgency and intensity from every area of our company.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nOK, that is helpful. I have, I think, a mathematically similar question. When we look at the large loss data for combined losses over -- between $1 million and $5 million and $5 million and higher in commercial, about 50% year over year, much more than in the second quarter. Is there any way of getting a sense as to how much of that increase in larger losses is just a function of inflation pushing some losses over that line?\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nThat's part of our analysis, Meyer, and we'll be looking at that. Where we're seeing it, as Steve mentioned, in terms of geographic areas and the various limits that we write, which are generally relative, I think, the most in the industry, smaller layers. But all that we need to take a look at it. It is difficult to ascertain or really specifically assign it to inflation given the inherent volatility we see in the book.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nOK. And then one -- that is very helpful. I guess, one final question. Does anything in third quarter results, I guess, on the cat side, lead you to want to change the structure of your reinsurance protection in 2023?\n\nSteve Spray -- President\n\nMeyer, this is Steve Spray. I would say, no, nothing that we saw in the third quarter would lend us to change the structure. I think one of the good things with that is it's pretty common knowledge out there that you hear that reinsurance market is going to harden. I think we believe we're in a really good position, relatively speaking for that.\n\nWe're just in the middle of our property -- all of our reinsurance renewals now. But I think the good thing is, as we have performed well for our reinsurers over time, we take a long-term approach in partnership with them. And we've got the financial strength, the financial flexibility to -- if we need to take more co-participation and balance that with rate, we're more in an enviable position, I think, that we've got the financial strength to do that.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nOK, thank you very much. That's very helpful.\n\nOperator\n\n[Operator instructions] Our next question will come from Grace Carter with Bank of America. You may now go ahead.\n\nGrace Carter -- Bank of America Merrill Lynch -- Analyst\n\nHi, everyone.\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nGood morning, Grace.\n\nGrace Carter -- Bank of America Merrill Lynch -- Analyst\n\nSo I had a quick question on rate versus trend in commercial lines. I mean, obviously, loss cost trends have kind of proceeded to be challenging this quarter, and you mentioned that your commercial pricing is somewhat higher versus 2Q '22. So how do you see the spread between your pricing versus loss cost trends in 3Q '22 versus earlier in the year? And I mean, is there any color that you can give us on how that might evolve going forward, just given where inflation is trending and your continued pricing actions?\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nOK. Good question. And I think for the commercial lines segment, we are in a position, as we define loss cost versus premium that we can stay ahead of the trend. We are very prospective.\n\nWe're looking out into the prospective policy periods in terms of estimating how loss costs will rise versus the type of premium that we think we're going to get. And we think for the sector, we should be in a position to be ahead of loss costs. Obviously, some of the lines of business are more challenging than others, but I think in total that we can get there. I think really, when you look at our ex cat accident year combined ratio of 91.1%, while that's a deterioration from where it was in 2021.\n\nThat was an awfully tough comp, the best accident year ex cat that we've ever put in for the full year, it was an accident year ex cat combined ratio of 86.2%. The current 91.1% that we have relative to our accident year ex catastrophe losses for every year from 2012 through 2019 is actually better than every one of those except for 2016 where we were at 90.8%. So just three basis points lower there. So I think given where we are, given the trends that we're estimating, recognizing the challenge and that needs to be met with not only rate but underwriting, and again, every aspect of every part of the company coming together to do their part to manage the loss cost lower, we feel that we're in a good position for the sector as we go into 2023.\n\nGrace Carter -- Bank of America Merrill Lynch -- Analyst\n\nThank you. And then I had a quick question on the umbrella trends as well. I think last quarter, you had mentioned that more gradual court reopening had driven a little bit of volatility in those losses. I was curious just as that kind of period of closures gets further behind us, if that continued to drive some issues this quarter that has gotten better.\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nI think it's still uncertain. I would hope that it especially given our commentary on frequency in the umbrella line decreasing here into the third quarter that it's slowing down. But that is an uncertain area that I think ourselves and really the industry, in general, will be keeping an eye on.\n\nGrace Carter -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question will come from Harry Fong with MKM Partners. You may now go ahead.\n\nHarry Fong -- MKM Partners -- Analyst\n\nThank you. Good morning, Steve. And Steve, I heard quite a bit about the umbrella line and the longer-term trend of development from 2017 through 2021. However, we did see, if I recall correctly, the bump in frequency in either the fourth quarter of '16 or first quarter of '17 that led to a very similar discussion as what we've been hearing this morning.\n\nCan you characterize what you saw in large frequencies back then to what is going on today? And are there significant differences that may require you to implement changes that will take longer to improve the current situation?\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nYeah. Harry, you are very astute in recognizing that. I think we have seen with the volatility in the line over time, ups and downs in terms of the performance. I would think one thing that was maybe a little bit different than now as we were seeing the paid-to-incurred ratio rising.\n\nCurrently, that isn't the case. I think we're reserving more now than we were then relative to the exposure. So it's a slight difference. But to be honest, I think it's the same approach that we'll take that we did back then that worked out to be successful really in what I would consider to be not that long of a time period.\n\nHarry Fong -- MKM Partners -- Analyst\n\nSo paid to incurred hasn't risen yet. What drove you to increase the reserves, just the macro environment rather than experience?\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nI would say it's a little bit of both. I would say it's a little bit of both.\n\nHarry Fong -- MKM Partners -- Analyst\n\nSounds good. Thank you.\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nThank you, Harry.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Steve Johnston, CEO, for any closing remarks.\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nThank you, Anthony, and thanks to all of you for joining us today. We look forward to speaking with you again on our fourth quarter call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDennis McDaniel -- Investor Relations Officer\n\nSteve Johnston -- Chairman and Chief Executive Officer\n\nMike Sewell -- Chief Financial Officer\n\nPaul Newsome -- Piper Sandler -- Analyst\n\nSteve Spray -- President\n\nMike Zaremski -- BMO Capital Markets -- Analyst\n\nUnknown speaker\n\nScott Heleniak -- RBC Capital Markets -- Analyst\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nGrace Carter -- Bank of America Merrill Lynch -- Analyst\n\nHarry Fong -- MKM Partners -- Analyst\n\nMore CINF analysis\n\nAll earnings call transcripts"
}