{
  "companyName": "Centene",
  "companyTicker": "CNC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/centene-cnc-q3-2022-earnings-call-transcript/",
  "content": "Centene (CNC 0.35%)\nQ3 2022 Earnings Call\nOct 25, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, everyone, and welcome to the Centene Corporation third quarter 2022 earnings results conference call. [Operator Instructions]. Also note, today's event is being recorded. At this time, I would like to turn the conference call over to Jennifer Gilligan, senior vice president of finance and investor relations.\n\nMa'am, please go ahead.\n\nJennifer Gilligan -- Senior Vice President, Investor Relations\n\nThank you, Jamie, and good morning, everyone. Thank you for joining us on our third quarter 2022 earnings results conference call. Sarah London, chief executive officer; Brent Layton, president and chief operating officer; and Drew Asher, executive vice president and chief financial officer of Centene, will host this morning's call, which also can be accessed through our website at centene.com. Any remarks that Centene may make about future expectations, plans, and prospects constitute forward-looking statements for the purpose of safe harbor provision under the Private Securities Litigation Reform Act of 1995.\n\nActual results may differ materially from those indicated by those forward-looking statements as a result of various important factors, including those discussed in Centene's most recent Form 10-K filed February 22, 2022, and other public SEC filings. Centene anticipates that subsequent events and developments may cause its estimates to change. While the company may elect to update these forward-looking statements at some point in the future, we specifically disclaim any obligation to do so. The call will also refer to certain non-GAAP measures.\n\nA reconciliation of these measures with the most directly comparable GAAP measures can be found in our third quarter 2022 press release, which is available on the company's website under the investors section. Company is unable to provide a reconciliation of its 2023 and 2024 adjusted diluted EPS targets to corresponding GAAP measures without unreasonable efforts due to the difficulty of predicting the timing and amounts of various items within a reasonable range. Finally, please mark your calendars for our upcoming investor day on December 16 in New York City. Invitations and necessary registration information will be sent out shortly.\n\nWith that, I'd like to turn the call over to our CEO, Sarah London. Sarah? \n\nSarah London -- Chief Executive Officer\n\nThank you, Jen, and thanks, everyone, for joining us this morning as we discuss our third quarter results. During our time today, I'll review the highlights of our financial and operational performance for Q3 and address some of the more recent developments shaping our view of 2023 and beyond. Then Brent will offer comments around the core businesses and share updates on our strong positioning relative to 2023 Medicare and marketplace enrollment. Finally, Drew will provide details of our overall financial performance and update our full-year 2022 outlook.\n\nFirst, the quarter. We reported third quarter adjusted EPS of $1.30, slightly ahead of our expectations. Our strong results were driven by continued organic growth in Medicaid and Medicare, the continued impact of marketplace bid discipline, as well as strategic capital deployment in the form of share and bond repurchases. We now expect Centene's full-year 2022 adjusted EPS to be within a range of $5.65 to $5.75 as we've raised the bottom end of the guidance range by $0.05 to reflect strong third quarter results and taking into account continued investments to yield future returns.\n\nSince our initial issuance of the 2022 adjusted EPS guidance, we have now raised the midpoint 5.5% or $0.30, driven by government program growth and the successful execution of several key value creation initiatives. Drew will cover the quarter and our financial outlook in more detail shortly. Our strong year-to-date performance provides positive momentum as we prepare the organization for 2023 and beyond. With successful Medicaid reprocurements in Mississippi, Nebraska, and Texas this quarter, our business development team continues to execute well, demonstrating their powerful market knowledge and delivering solid results.\n\nWhile we were disappointed with the results in the California RFP process, we remain confident in the quality of our RFP response and in the merits of our protest there, which we'll talk more about shortly. In our other core business lines, we are enthusiastic about the opportunities we see to strategically balance growth with margin expansion. In marketplace, we have demonstrated strong margin improvement this year and see the recent developments in the marketplace competitive landscape as an opportunity for new organic growth in 2023 and beyond. In Medicare, we are confident we have positioned our bids to achieve expanded margin performance next year while still delivering low to mid-single-digit growth.\n\nTogether, Medicare and marketplace are well-positioned to offer tailwinds in support of our 2023 earnings goals. Behind the scenes, our transformation work continues with a number of value-creation initiatives achieving key milestones during the quarter. As you know, we are redesigning key shared service functions to reflect the size and scale of the organization, and we're supporting these teams with modern, flexible technology that will streamline workflows and make it easier to serve both members and providers. This quarter, we completed the first wave of call center regionalization and successfully installed new call center technology to support the marketplace team in the upcoming open enrollment period.\n\nWe also launched our Provider 360 application that will allow us to more seamlessly manage our provider relationships across the country. Each of these enhancements position Centene for improvement in both quality and efficiency as we move into 2023. At the same time, we continue to advance our portfolio review work. We closed Panther this quarter and are in the closing process on both Magellan Rx and Ribera.\n\nWe will share additional updates as we position our non-health plan assets for maximum strategic value. Finally and importantly, we are pleased to share that a major cornerstone of our value creation plan was achieved this month when we concluded our PBM RFP process ahead of schedule. As many of you know, we expected the RFP process to drive significant value for Centene, our members, and our state and federal partners. Beginning January 1, 2024, Evernorth Express Scripts will provide Centene's pharmacy benefit management services.\n\nThis new partnership will allow us to innovate and redesign the way our pharmacy benefits are administered as we deliver improved value to our customers and shareholders. As a result of this new contract, we anticipate delivering savings that exceed our previous expectations in 2024 and throughout the duration of the multiyear agreement. Now turning to two recent challenges. Given the development around both Stars and our California contract, I'd like to spend a few minutes providing additional perspective on each of these issues.\n\nAs we've shared before, the year-over-year deterioration of our Medicare Advantage Star Ratings was driven in part by the sunsetting of disaster relief provisions related to COVID. We were additionally impacted by a decline in specific metrics related to ops and admin, a result of our own operational challenges during late 2020 and 2021. While the final results were slightly worse than our internal expectations, the vast majority of the revenue headwind was known to us months in advance as we shared transparently with the investment community. This knowledge allowed us to position 2023 products with an emphasis on benefit stability and create a glide path to better mitigate the member impact from the Stars revenue headwind in 2024.\n\nAs we called out during our June investor day, since learning of the magnitude of the Stars impact, we've taken aggressive action to change our approach to the Stars program. From an organizational perspective, we hired an experienced chief quality officer and assigned strong operational leaders to manage key ops and admin programs beginning in Q1. We centralized oversight of the quality program and moved the entire organization under Jim Murray, our chief transformation officer, to directly connect quality to our value creation office and take advantage of Jim's long experience driving Medicare quality outcomes. In addition, we launched a focused effort to standardize and streamline our quality processes, and we implemented real-time operational dashboards to track key performance metrics.\n\nEarlier this year, we invested in new technology to enhance our access to clinical data around gaps in care, and we committed to integrating the company's numerous quality platforms into a single unified workflow. Finally, we made significant investments to improve our Medicare members onboarding journey, including the redesign of our approach to those mission-critical survey questions that impact caps and other metrics. But addressing the Stars challenge didn't stop with operational transformations. In late Q1, this newly installed management team cracked open our 2022 performance plan and added quality improvement as a key compensation metric for every single employee at Centene across the enterprise.\n\nWhen I say quality is a priority, I mean it. Over the next three cycles, our goal is to achieve at least 60% of members in four-star plans. And I promise you, this senior management team is aggressively tracking Stars improvement toward that goal on a real-time basis. Now turning to California.\n\nThe California RFP also carries implications for earnings power in 2024. Shortly after the August Medical award announcement and after closely reviewing the results, Centene, along with many other RFP participants filed protests with the state of California. As this audience will appreciate, we are limited in our ability to comment too much during an active protest, but I will say this. Centene takes a matter of filing protests seriously.\n\nWhen we do so, it is not a matter of reflex but done only when we see serious errors in a decision-making process, resulting in negative impacts on our beneficiaries. Because of our historic discipline around these decisions, Centene has a proven track record of success in the protests we have undertaken. And given our strong view of the merits of our California protest, we intend to exhaust all available avenues of appeal. Drew will talk more specifically about the financial impact of the Stars issue and the California results in a moment, but it is important to note that we are actively managing both situations and feel confident in our current strategies.\n\nAs a reminder, Centene is on a journey of transformation in service of value creation. Between now and 2024, our work is to focus and fortify the organization, creating a strong foundation from which to drive profitable growth over the long term. From the time our value creation plans were initially late in June of 2021, this team went in eyes wide open to the level of change we were determined to enact. As we reflect on 2022 and the two full quarters since this management team has taken the helm, I am pleased with the amount of progress we have made and confident in our delivery of future milestones.\n\nWe've assembled the right talent with proven executive leadership skills, created a sharpened focus through our value creation office, and made deliberate investments to accelerate change. There is a lot more work ahead, but delivering this year's foundational milestones creates important momentum that will carry us into 2023 and 2024. The upcoming December investor day presents us with an important opportunity to give investors clarity around the long-term strategy that will underpin the trajectory of Centene's business. We'll use investor day as a platform to share important areas of operational focus as well as to lay out the market opportunities upon which we'll build our future growth.\n\nAnd importantly, we'll commit to long-term growth targets so that our investors are clear on management's expectations for our enterprise. Before I turn it over to Brent, I'd like to take a brief moment to express my gratitude to our Centene team members in Florida for their efforts in the face of the destruction brought by Hurricane Ian last month. Once again, our local teams activated quickly, harnessing the power of our local partnerships to support our members and employees, and their communities in a time of mean. Sunshine employees contacted more than 22,000 high-risk members ahead of the storm to ensure they had a plan and in the storm's wake to confirm their safety and assess their needs.\n\nWe partnered with state and local government entities to strategically deploy resources, provide community support and offer distribution and staging sites for relief efforts. More than 500 Sunshine Health employees, some of whom were impacted themselves. Nonetheless, volunteered their time at disaster relief sites, including those sites we stood up inside our health plan community centers. At the height of operations, our community center in Fort Myers was serving more than 2,100 families each day, providing needed items like food, water, diapers, baby formula, and basic hygiene products.\n\nMission-driven employees are Centene's most powerful asset. Thank you to Sunshine Health employees and employees nationwide for your steadfast support of the communities impacted by Hurricane Ian. Throughout 2022 from Buffalo to Uvalde to Fort Myers, your acts of selflessness and service demonstrate the extraordinary impact of our mission-driven workforce. I cannot express to you how proud I am to call you colleagues and friends.\n\nWith that, I'll turn it over to Brent for an update on the business.\n\nBrent Layton -- President and Chief Operating Officer\n\nThank you, Sarah, and good morning. We are pleased to have made so much progress in 2022, both organizationally and operationally. While some of the benefits will take time to materialize externally, the internal advancements are tangible. During the third quarter, we received results from several RFPs.\n\nIn August, we received mixed results in California as we were awarded contracts in nine counties, including San Diego. We have also been awarded a sole-source contract in Imperial county. As Sarah mentioned, we have appealed the state's notice of awards and we'll provide updates on the process as appropriate. In August, we were also informed of our successful bid to continue to serve the state of Mississippi Medicaid managed care program, including entry into the CHIP program.\n\nWe've been a part of the Medicaid program since its exception and are pleased to continue our relationship with the state. In another of our long-standing markets, we reprocured the Star Health Medicaid program in Texas. We've held this contract since 2008 when in collaboration with the Texas Health and Human Services Commission and the Department of Family and Protective Services. Our health plan, Superior, became the first managed care organization in the country to provide statewide sole-source Medicaid coverage to children in foster care.\n\nTo round out the quarter, we were fortunate to win the reprocurement of our statewide managed care contract in Nebraska. We look forward to continuing to serve our membership in the Heritage Health program. In our existing Medicaid business, membership has increased to 15.7 million members at the end of third quarter, and we continue to see an uptick in RFP activity. As the PHE has been extended to February, our Medicaid growth continues to be aided by the ongoing suspension of eligibility redeterminations.\n\nAs you've heard me say before, whenever the PHE comes to close, we'll continue to work with our state partners to support member transition and believe we are well-positioned to attract membership to our marketplace products. Our Ambetter product ended the quarter with 2.1 million members and remains on track to meet its margin goal for 2022. As the marketplace leader, we continue to ensure that Americans have financially affordable options for coverage especially there in times of disruption, such as the recent announcement of market exits by some of our competitors. We are working closely with our state partners to ensure these members have access to affordable coverage.\n\nWe also see the extension of the enhanced advance premium tax credits as fuel for additional growth during 2023 open enrollment period, which will begin in a few days. Consistent with our strategy, Ambetter Health will continue to pursue margin expansion through strategic membership growth and thoughtful pricing discipline. As we look to 2023, we've expanded our marketplace offerings to the state of Alabama, bringing this to 28 states. Additionally, we've added more than 60 new counties, bringing us to over 1,500, which is over half the counties in the United States.\n\nWe're also looking forward to the expansion of our Ambetter Health Virtual Access product, which we first launched during 2022 open enrollment. This product supports affordable and convenient access to licensed vertical primary care providers as well as access to specialists and other support services. We will offer virtual access in nine new states for the upcoming open enrollment period, bringing the product to 13 states in total. Our geographic and product expansion, sales strategy, stable pricing, product offerings, and operational strengths allow us to be optimistic about our positioning for 2023 open enrollment.\n\nIn Medicare, we ended the quarter with over 1.5 million members. We have strong geographic growth for 2023 with WellCare product offerings of about 80% of the eligible Medicare population. We feel our 2023 products are in line with the expectations to support our low to mid-single-digit growth expectations and continue to focus on member retention. Look forward to telling you more about our '23 outlook in December.\n\nIn short, our core products continue to perform well. With that, let me turn the call over to Drew.\n\nDrew Asher -- Executive Vice President and Chief Financial Officer\n\nThank you, Brent. Today, we reported third quarter 2022 results of $35.9 billion in total revenue, an increase of 11% compared to the third quarter of 2021, and adjusted diluted earnings per share of $1.30. Based upon performance in the quarter, we're raising our 2022 adjusted earnings guidance to a range of $5.65 to $5.75 by lifting the bottom of the range $0.05. Year-to-date, our guidance midpoint is up $0.30 or 5.5% since our original 2022 guidance provided in December of 2021.\n\nTotal revenue grew by $3.5 billion compared to the third quarter of 2021, driven by: one, strong organic growth throughout the last year in Medicaid, primarily due to the ongoing suspension of eligibility redeterminations and Missouri Foster Care that commenced 7122.  Number two, the January 2022 acquisition of Magellan and three strong Medicare membership growth. This was partially offset by the July 2022 Panther divestiture. Our Q3 consolidated HBR was 88.3%, Medicaid at 90.2% was right on track in the quarter, consistent with normal seasonality and back-to-school encounters. 48% of our Medicaid members are under 18 years old.\n\nMedicare at 83.9% was better than expectations in the quarter, driven by favorable health-care affordability initiatives consistent with our efforts to improve execution. Year-to-date, the Medicare HBR is trending better than our original expectation, which we assumed would be roughly flat to 2021. That should bode well for our baseline as we look ahead to 2023 and 2024. The commercial HBR of 84.2% improved 450 basis points quarter over the prior year quarter, consistent with our original full-year goal of an approximate 500 basis point HBR improvement in 2022 compared to 2021.\n\nCommercial performance in 2022 has been driven by disciplined pricing actions initiatives executed in 2022, and as expected, a reduction in COVID and pent-up demand costs compared to 2021. Our marketplace businesses in 2022 are a good example of execution of margin expansion balanced with growth, which will enable us to take advantage of membership opportunities in 2023 and beyond. Moving to other P&L and balance sheet items. Our adjusted SG&A expense ratio was 8.3% in the third quarter, compared to 8.1% last year.\n\nThe inclusion of Magellan and the sale of Panther increased the ratio by approximately 20 basis points compared to the year-ago quarter. Additionally, we increased Medicare marketing and value creation investment spending in the quarter. This was partially offset by real estate optimization savings based upon efforts that we began in Q2. Since the start of the third quarter, we have repurchased 15.3 million shares of our common stock for $1.3 billion.\n\nYear-to-date, we have repurchased 19.5 million shares for $1.7 billion. Also, since the start of the third quarter, we have repurchased approximately $317 million of our senior notes for $300 million to balance the capital structure and take advantage of market conditions. We are working to close the Magellan Rx divestiture by the end of the year. Estimated net deployable proceeds on that transaction would be in the zone of $1.1 billion.\n\nA few weeks ago, we were very pleased to receive an upgrade for our senior notes to investment grade by Fitch. The company has been working on that goal for a couple of years. Our senior notes are now rated investment grade by two of the three major rating agencies. Cash flow provided by operations was $3.3 billion in the third quarter, primarily driven by earnings and the receipt of approximately $2.9 billion in CMS payments for October on the last day of September.\n\nThis temporarily drives up unearned revenue and accounts payable on our balance sheet. Our year-to-date operating cash flow was $7.8 billion or $4.9 billion, excluding the early receipt of payments from CMS representing 3.5 times net earnings or 1.7 times adjusted net earnings. Our domestic unregulated and unrestricted cash on hand at quarter end was $387 million, a portion of which was spent in October to finish up the capital deployment I just referenced. Debt at quarter end was $18 billion.\n\nOur debt to adjusted EBITDA came in at 3.0 times. Our medical claims liability totaled $16 billion at quarter end and represents 54 days in claims payable compared to 55 days in Q2 2022 and 51 days in Q3 of 2021. The sequential decrease was largely driven by the timing of pharmacy claims payments. Outside of adjusted earnings during the quarter, we recorded a $0.65 gain on the sale of Panther, partially offset by a $0.23 loss on the impairment of Ribera Salud and a $0.16 real estate impairment, consistent with what we discussed last quarter.\n\nWe expect another $0.15 or so of real estate impairment outside of adjusted earnings over the next couple of quarters as we complete the value creation real estate optimization. These items are reflected in updated GAAP guidance. Quickly on 2022 adjusted earnings guidance since we only have one quarter left in the year. As mentioned, we are lifting the bottom of the adjusted EPS range by nickel.\n\nUnderneath that, premium and service revenue is up approximately $700 million. There is no change to HBR from the previous range. In the back half of 2022 investment income outperformance has largely been offset by SG&A investments to yield future returns. Suffice to say, 2022 has been a very good year on of executing on the value creation plan as a new leadership team.\n\nMany of you have asked about 2023 and 2024 in the context of recent business developments like the California RFP, Florida Medicaid rates, and Stars, so let me give you some more color. We are in the middle of building up our detailed 2023 annual operating plan that we will complete by the beginning of December, seek our board approval and then share formal 2023 guidance with you at our December 16th investor day. Based upon good execution on our value creation plan and anticipated 2023 tailwinds and headwinds, we are still targeting low sixes consistent with what we have relayed to you previously. While we so-called blessed consensus last December when it was at $6.20, today's consensus would still be in an expected 2023 guidance range.\n\nAnd that includes the worse-than-expected 4% to 4.5% rate decrease effective 10/01/22. We will run through all of the tailwinds and headwinds at the investor day and provide you bridges such that you can have confidence in our 2023 game plan. As we look ahead to 2024, we know a fair amount more than we first -- than when we first laid out a long-term target at our June 2021 investor day. Let me provide more insight into a few of the components that are different than our original construction of 2024, starting with Stars.\n\nIn 2021, we knew we would have a step back in Stars revenue for 2024 and due to not only the inevitable sunsetting of COVID disaster relief provisions but also underperformance in the area of Medicare ops and admin in the back half of 2020 and in the first half of 2021 prior to this management team taking the helm. Sarah provided you color on more of the background. But yes, it was a little worse than we originally expected as the final Star results became visible during 2022. Moving now to California.\n\nOur 2024 forecast construction anticipated and continues to anticipate retaining our major state Medicaid contracts, including California. We are confident in the basis for our protest but if we are unsuccessful, that could be a pressure point relative to the $7.50 plus target. On the positive side, we are very pleased with the economics to be realized as a result of the PBM RFP process. Investment income is stronger today and expected to be stronger in 2024 than we originally had built into the 2024 modeling.\n\nAnd we are pulling value creation plan levers and buying shares with 2024 in mind. A number of you have asked for the impact of Stars in California. But let me boil it down into a macro view of 2024, including the items I just mentioned. There is approximately $0.20 to -- $0.25 to $0.50 of potential EPS pressure in 2024 in relation to our original goal of $7.50 plus.\n\nUntil we know more on the outcome of California, we are still committed to driving to at least $7.50. I hope that gives you adequate scenario-based color for 2024 as we sit here in 2022. And I'm sure you've thought through if we can achieve our 2024 goals. That means we have pulled levers that both annualize and carry into 2025 when our Stars headwind turns into a sequential tailwind.\n\nWe are pleased with the third quarter and the progress demonstrated in 2022 as well as the prospect for our business in 2023 and beyond. And we look forward to sharing with you our long-term strategy and long-term growth algorithm for both revenue and earnings growth at investor day in December. Thank you for being part of our journey. Operator, you may now open the lineup for questions.\n\nOperator\n\n[Operator Instructions]. And our first question today comes from Josh Raskin from Nephron Research. Please go ahead with your question.\n\nJosh Rashkin -- Nephron Research -- Analyst\n\nHi. Thanks. Good morning. I was wondering if you could talk a little bit more about the key factors and the decision to move the PBM to Express Scripts, sort of what got you over the hurdle of moving.\n\nAnd I was curious if you were attracted by any of the other services that are offered by Evernorth that's part of it. I'm specifically interested in specialty as well. And then I know parts of one question, but any way to size the relative outperformance versus previous expectations just on the economics of the deal?\n\nSarah London -- Chief Executive Officer\n\nYes. Thanks, Josh. So first, I would say that we were very pleased how competitive the process turned out to be and the fact that we had multiple very good options. As we said, we were able to achieve savings that exceeded expectations without feeling like we were sacrificing quality and execution.\n\nAnd we carried forward into the process, all of the criteria that we talked about in earlier calls in terms of operational execution, level of partnership, a sense of quality performance innovation. We have ahead of us a significant operational undertaking, but I have to major credit to our team for spending a lot of the time during the RFP process doing preparation work in order to give us maximum optionality in the consideration. So we're feeling good about moving forward with core services and the ability to continue to expand the relationship, if that makes sense.\n\nDrew Asher -- Executive Vice President and Chief Financial Officer\n\nYes. And, Josh, on the economics, as I'm sure you can appreciate, we don't like disclosing sort of proprietary cost structure elements, but it did exceed our expectations, which I think you can surmise by our willingness to take on the operational challenge of moving. And that was sort of baked into the macro view I provided on 2024.\n\nJosh Rashkin -- Nephron Research -- Analyst\n\nOK. Understood. Thanks.\n\nOperator\n\nAnd our next question comes from Stephen Baxter from Wells Fargo. Please go ahead with your question.\n\nStephen Baxter -- Wells Fargo Securities -- Analyst\n\nHi. Thank you for the question and all the colors. I think you said you'll be targeting 60% of your Medicare Advantage membership in four-star Ambetter contracts. I apologize if I missed it, but what was the time frame you think it will realistically take to get there and assuming that it is a multiyear process, do you think it's reasonable to expect most of the improvement to be concentrated in the next cycle and some of those metrics are still in front of you be measured? Or do you think we should think about maybe a more even pacing on that? Thank you very much.\n\nSarah London -- Chief Executive Officer\n\nYes. Thanks, Stephen, for the question. So it is -- we do see that goal of the 60% in four or at least 60% in four-star over the next three cycles. So keeping in mind the fact that Stars results are released in October.\n\nAnd I think we see the progress over that time period to be sort of fairly equal steps and are, again, like I said, pleased with what we're seeing in terms of the real-time data that we're tracking and meaningful operational improvement over the course of 2022 so far.\n\nOperator\n\nOur next question comes from Justin Lake from Wolfe Research. Please go ahead with your question.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nThanks. Good morning. Just a couple of things here. First, I appreciate your comments on 2024.\n\nCan you be -- just give us a little bit more color in terms of when you say the $0.20 to $0.25 to $0.50 of headwinds potentially. Does that assume -- is that net of everything, meaning, like, for instance, if I were to think about your guidance in 2024 there's some -- looked like there was some conservatism just in terms of the buildup when you gave it initially, plus the tailwinds minus the headwinds. Are you saying when you add all of that together, if everything happens the way it looks today, meaning the appeal is not successful, for instance, that number would be $0.25 to $0.50 too high? First. And then secondly, can you just give us an update on California in terms of the timing? My understanding is the state has to make a decision or the arbiter has to make a decision on the appeal.\n\nAnd then there's also a lawsuit that are in place that a judge would need to roll on. So maybe you can give us a color on that timing. Thank you.\n\nDrew Asher -- Executive Vice President and Chief Financial Officer\n\nYes, I'll take part one, Justin. As we sit here, 16 months removed from that first look into 2024 back in June of 2021. We obviously know a fair amount more than we did then. And so yes, what I covered was meant to capture everything we know now.\n\nAnd I think you pointed out the biggest swing factor, obviously, is California, a pretty sizable piece of business for us in L.A. and Sacramento and current counties. So that would be the swing factor of that $0.25 to $0.50. It's a net view, but that's the biggest swing factor that would get us back into that $7.50 plus.\n\nSarah London -- Chief Executive Officer\n\nAnd then in terms of timing on the appeal, the department is currently considering all of the appeals that have been submitted across RFP respondents. And the next step is what we consider to be a fairly procedural ruling. And then from there, we would move into the courts with a lawsuit.\n\nOperator\n\nAnd our next question comes from Lance Wilkes from Bernstein. Please go ahead with your question.\n\nLance Wilkes -- AllianceBernstein -- Analyst\n\nYes. See, I just wanted to get a clarification on the PBM, the kind of expected timing of the savings, if they're all hitting in '24 if you're getting a portion of that in '24 and more in '25. And then just understanding the length of contracts on that. And then if there's anything to tell us about mitigation strategies on the Star ratings, like any opportunity to shift people to other if you have dual plans in the state or anything like that, that would be helpful, too.\n\nThanks.\n\nDrew Asher -- Executive Vice President and Chief Financial Officer\n\nYes. On the PBM contract, it's a multiyear contract. And so you're right, we get the stairstep benefit. Quite frankly, that we'd always anticipated.\n\nThe concept of a stairstep effect of 1124 with either a renewal or a new PBM contract. And then we negotiate multiyear guarantees and inflators. And so think of it as sort of a gradual improvement thereafter. So over the next, call it, few years after the commencement of the contract.\n\nSarah London -- Chief Executive Officer\n\nAnd then on Star, I would say there are probably three ways to think about mitigation. The first and most important is making sure that we position 2023 bids in order to maximize benefit stability across 2023 and 2024. And given that we had early visibility into headwind, we were able to do that. The second, of course, is creating the important tailwinds in 2024 in order to make up for the revenue hit.\n\nAnd then the most important one is making sure that our performance in Stars dates of service of 2022 as strong as possible so that we're creating maximum tailwinds for the Star revenue as we head into 2025, as Drew referenced. And again, on that latter point, having the strong predictive data that allowed us to the impending impact of the 2021 issue is equally giving us visibility to meaningful improvement in our operational performance on Star in 2022 so far.\n\nOperator\n\nAnd our next question comes from A.J. Rice from Credit Suisse. Please go ahead with your question.\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nThanks. Just first one cleanup on the PBM contract. I know this is one of the biggest contracts. It's changed hands in a while.\n\nAnd sometimes, historically, when there's been a big contract change, the customer gets some help on the transition period. Is there any support that you're going to get from your new PBM on next year that impacts the results as you make the transition? And then my more meaningful long-term question is on the reverifications. Obviously, there's been another delay in the -- or extension of the PAG since I think you last time updated your thoughts on reverifications. There's also the chatter about the economy slowing down.\n\nMaybe give us your updated thoughts about how much of the reverifications you might absorb next year versus slipping into '24, if you have any updated thoughts.\n\nDrew Asher -- Executive Vice President and Chief Financial Officer\n\nOK. Yes, two good questions. On the first one, yes, it's very customary, as you pointed out, A.J., that the winning PBM covers the transition costs. So there's a negotiated pool of cost coverage for the actual sort of operating and consulting cost and execution costs that will take during 2023 to convert as of 1/1/24.\n\nQuite frankly, similar concept we had back in 2015. And your second question, so yes, another three months go by, and we're targeting our construction of our forecast 2023 operating plan is assuming a 2.1 commencement of redeterminations, but that has moved since last quarter. So right now, if you look back at right before the pandemic, we've grown about 3 million members in Medicaid, a little over 3 million, so call it about $12.5 billion of revenue. And so the last time we talked, we were estimating $7 billion to $7.5 billion would be the amount that would be sort of given back due to redeterminations, bumped that up a little bit now to $7.5 billion to $8 billion.\n\nSo it's about 62% of that revenue that we've gained. But as each quarter goes by, I think the long-term prognosis of the company, we benefit because we don't give back 100% of that incremental revenue we've grown, at least in our estimates. So the time has been really good to be able to work with the states to plan for not just ensuring that there's continuity of coverage for Medicaid recipients but also to make sure our marketplace business, which is well positioned in '25 of our Medicaid markets to be the recipient of some of those members. Your question about '23 versus '24, based upon a 2.1 commencement date, the midpoint of that revenue is $7.75 billion, probably $4 billion to $4.5 billion of that would hit in '23 and then the balance largely in '24, but let's see what happens with the PHE date, and we'll have to update you if that moves.\n\nSarah London -- Chief Executive Officer\n\nSorry, I was just going to add quickly on the recession point. It's hard to estimate exactly what the impact of that will be partly because we're still watching that trend, but in general, during a recession, more folks rely on the health safety net and managed care growth. And so that may be an input as we see what the overall impact of redeterminations is as they unfold.\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nOK. Great. Thanks so much.\n\nOperator\n\nAnd our next question comes from Kevin Fishbeck from Bank of America. Please go ahead with your question.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks. I wanted to go into, I guess, the state rate update on backdrop. You guys for a while, talked about redeterminations and kind of the confidence that states will give you appropriate rates if the risk pool does get worse.\n\nI'd just like to hear kind of what you think happened in Florida and whether any other states are talking about rate cuts in front of that? Because that one to me kind of bothered me a little bit heading into next year, making me wonder if we're about to see additional states come in with rates. So any color on how you're thinking about that?\n\nDrew Asher -- Executive Vice President and Chief Financial Officer\n\nYes. In Florida, they never put in a COVID-era risk corridor. And so I'm sure that was a consideration for them. But believe me, we pushed back on that.\n\nWe didn't think that the minus 4.5% on behalf of the participants, the industry in Florida was appropriate. And the good news with Florida is historically they're very good listeners, and it's our job to show data. And if we can show the data mid-cycle or certainly by 10/1/23, we get another buy at the Apple and Florida has been a great partner for us and really expect to have a continuing strong and economically viable arrangement in Florida in the long run.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nOther states looking to -- for cuts?\n\nDrew Asher -- Executive Vice President and Chief Financial Officer\n\nYes. If you go back, let me frame the answer in terms of what we shared with you at investor day, the 1.3% is what we had built in is our composite rate into the 2022 plan that we shared with you in December of 2021. That's closer to 0.9% to 1%, and most of that difference is Florida. So the rest of the portfolio is sort of in the zone of right on track.\n\nOperator\n\nOur next question comes from Scott Fidel from Stephens. Please go ahead with your question.\n\nScott Fidel -- Stephens, Inc. -- Analyst\n\nThanks. Good morning. Wanted to just maybe flesh out the exchange marketplace a bit more for 2023. As you mentioned, obviously, some pretty major competitive changes in the marketplace, particularly with Bright exiting and looks like Friday is exiting at least Texas as well.\n\nSo maybe walk us through how meaningful you think, I guess, the jump ball on membership could be. And then also, your comfort just with your pricing, if you do end up getting a big bolus of members from some of these other carriers, whether you're confident that your pricing is positioned to still achieve your targeted exchange margins. Thanks.\n\nSarah London -- Chief Executive Officer\n\nYes. Thanks for the question. In general, we see the marketplace exit as an overall positive, but I'll let Brent walk through the why and how we're feeling about pricing and positioning.\n\nBrent Layton -- President and Chief Operating Officer\n\nThere is no doubt that there is a great opportunity for us here. We've been in the exchange program from day one. We've never exited. We've continued to provide strong provider networks, good customer service and very stable pricing with good distribution.\n\nSo we do see this as an opportunity from the standpoint. At the same time, we think that there's one, the membership that would potentially come over from some of our competitors were exiting, but also just overall growth as we head into the upcoming open enrollment. So we feel positive about the opportunities. We've spent many, many years working very closely with our state regulators, which have given us an opportunity to work through this challenge that they face as people have exited, but that partnership allows us also to continue to work on a daily basis of getting strong customer service.\n\nOperator\n\nAnd our next question comes from Calvin Sternick from J.P. Morgan. Please go ahead with your question.\n\nCalvin Sternick -- JPMorgan Chase and Company -- Analyst\n\nYes. Hi. good morning. Maybe ask one just on utilization.\n\nCan you give us a little color on utilization trends in the quarter by product line and how those sort of compared to pre-pandemic levels. I guess, whether you've seen any notable shifts quarter-over-quarter?\n\nDrew Asher -- Executive Vice President and Chief Financial Officer\n\nGood question. So let me hit COVID first, then I'll get to your non-COVID, which I think is more of the line of your questioning. So COVID was slightly higher than Q2, which was, as you may recall, down from Q1. So -- and there was a very shallow peak in August.\n\nSo really sort of consistent, slightly higher than Q2. The non-COVID, which is what you're asking about is really in line with normal seasonality and pre-covid movements, like from Q2 to Q3. We don't see any signs of pent-up demand at the magnitude that we saw in 2021. And we also track a basket of potentially deferrable services, and that's flat to Q2.\n\nSo pretty stable macro. And yes, there's a couple of pockets of continued, call it, minor suppression. I'd point to nonemergent ER still a little suppressed, which is good news, obviously. And then while we had a really good quarter in Medicare underneath that, I'd say, ER and urgent care are a little high, offset by a little bit favorable inpatient in Medicare.\n\nSo just something we're watching in Medicare, but obviously, it didn't affect the aggregate results, which were really strong in Medicare in the quarter.\n\nCalvin Sternick -- JPMorgan Chase and Company -- Analyst\n\nCan I just ask on the Medicare and commercial side. Are you seeing any change from inflation on consumers' willingness to sort of access care?\n\nDrew Asher -- Executive Vice President and Chief Financial Officer\n\nWith the subsidies, think about our government programs business and the cost sharing that most of our members avail themselves of. I think it's probably a different population than if we had a national account business. So no -- yes, no signs of that yet.\n\nOperator\n\nAnd our next question comes from Michael Ha from Morgan Stanley. Please go ahead with your question.\n\nMichael Ha -- Morgan Stanley -- Analyst\n\nThank you, guys. Just on MLR real quickly. It looks like the [Inaudible] might have been a little bit too low in Medicaid MLR for the quarter, but it sounds like it was directly in line with your internal expectations. Is that right? And on MA, very strong performance sequentially improving 170 bps you mentioned some favorable affordability initiatives, but it just seems unusually strong for third quarter.\n\nI was wondering if you could help trail down a bit on that. And then one last one on the PBM contract. Of your $35 billion in drug spend, how much of that is currently sitting with CVS Caremark? Thank you.\n\nDrew Asher -- Executive Vice President and Chief Financial Officer\n\nAll right. Let me see if I remember all three questions. Almost all of it is the answer to your last question. We have about $40 billion plus or minus of gross spend and almost all of that is with Caremark.\n\nOn Medicaid, yes, we are right on the nose. We are right at our expectation, both in our plan as well as our  six plus six forecast, which is that midyear reforecast. So right on track on Medicaid. And in Medicare, pleased with the performance.\n\nThere's a whole slate of clinical initiatives and call them sort of initiatives to help improve quality and the affordability of healthcare. And so it could be anything from clinical initiatives or provider contracting or execution on chart chase for risk adjustment. So it's sort of like the nuts and bolts execution that we've got a whole slate of initiatives that will continue to drive into all of our businesses. We just happen to do really well in Medicare so far this year.\n\nMichael Ha -- Morgan Stanley -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nAnd our next question comes from Nathan Rich from Goldman Sachs. Please go ahead with your question.\n\nNathan Rich -- Goldman Sachs -- Analyst\n\nThanks. Good morning. First, if I could just ask a quick clarification on the $0.25 to $0.50 potential headwind. Does it include incremental capital deployment benefits from buybacks and debt repayment? And could you maybe just talk about generally how you're thinking about the capital deployment piece of the long-range plan? And then as a follow-up on the MA business, I think you had previously talked about margin improvement in 2023.\n\nAnd I think, highlighted some of the investments you're making in light of the recent Star scores. So does that change the margin trajectory for that business over the next few years? Thank you.\n\nDrew Asher -- Executive Vice President and Chief Financial Officer\n\nYes. We'll talk a lot more at investor day about capital deployment. But yes, the third bucket of our value creation plan is always contemplated heavy deployment of share buyback, but debt management as well, as you saw this quarter, we bought back $317 million of face of our bonds for $300 million and cut out some future interest expense along the way. But we'll cover more of capital deployment at investor day.\n\nSo the answer to your first question is yes, it's contemplated in that -- in the 2024 macro view I provided. And then, I guess, since we've already sort of bless the current consensus. The answer to your second question, which is we've contemplated investments necessary to drive performance in our 2023 buildup, and we still expect margin expansion in Medicare for 2023.\n\nSarah London -- Chief Executive Officer\n\nYes. And again, I think we've pointed in the past to the fact that the marketplace progression is a good proof of our ability to expand margin and still grow and innovate in a product line as well as being positioned to take advantage of market opportunities like we are in marketplace. So that is still the plan for 2023, and we feel good about how our bids are positioned for that. And then as we go through 2024, we're going to want to make sure that we reduce member abrasion that was part of how we designed the bids.\n\nAnd then as we look to 2025 and pick up the tailwinds of Star, the ability to revisit sort of the margin and growth balance on a go-forward basis.\n\nOperator\n\nOur next question comes from Gary Taylor from Cowen. Please go ahead with your question.\n\nGary Taylor -- Cowen and Company -- Analyst\n\nHey. Good morning. I just had a quick question, and I wanted to pass on a clinic question. I still get a lot including this morning.\n\nMy click one was just on the Florida rate cut, which you said was, I think, worse than you had thought yet you maintained. Actually raised the low end of this year and blessed and maintain what you had said about 2023. So my question was just other operational offsets anything specific that allows you to uphold the guidance despite that cut. And then the client question, I still get all the time is really around redetermination, adverse selection risk.\n\nI know, Drew, you've talked a lot about that low utilizer bucket and keeping an eye on that, etc. But anything sort of updated there that is underpinning that the confidence on the Medicaid MLR on margin for '23 would be helpful, I think. Thanks.\n\nDrew Asher -- Executive Vice President and Chief Financial Officer\n\nThe answer to your first question, it's really the beauty of having a very broad portfolio of multiple lines of business, being in 30 states now for Medicaid. I mean that helps a lot. So you're not ultra, ultra dependent on any single state, although Florida is a pretty big one for us. So I think it's the execution of the value creation plan and the levers that the team is pulling that has enabled us to power through that isolated item.\n\nAnd in the portfolio, there's things that are going to be better than you expected and things that won't come in exactly where you had expected. So we're pretty pleased to be able to still be targeting that low sixes zone for 2023. On redeterminations, we continue to look at the data, sort of nothing different than what we've said in past earnings calls at our June investor day. I don't want to minimize that as an important lever that we will be tracking.\n\nIt's our job to educate states and provide data to the extent that a rate modification would be necessary in a post-redetermination world. So there's work to do in there, but we're ready to do so. I think I described on the prior call, we've got -- we've actually developed a common template across all of our health plans. We've got the data sources available and we're ready to go in and make the arguments and we've warmed up our state partners to acknowledge that it's going to be something that they are going to track also.\n\nSo I don't want to minimize that as either a risk or something that we really have to work hard to execute on, but we're ready, and our state partners are generally good listeners.\n\nOperator\n\nOur next question comes from Steven Valiquette from Barclays. Please go ahead with your question.\n\nSteven Valiquette -- Barclays -- Analyst\n\nThanks. Good morning, everybody. So just a follow-up on the utilization trends. I think if I heard you right, you mentioned that you're not really seeing any notable pent-up demand of traditional non-COVID utilization in '22 versus what you saw in '21.\n\nSo I guess as we just sort of think about the puts and takes for utilization for '23, do you still factor in the possibility of pent-up demand utilization in any cost categories for next year, whether it's led to procedures or other areas? Or do you just think the Canopy, this is just not going to happen now, and it's all in the rearview mirror as far as the whole notion of pent-up demand? Thanks. \n\nDrew Asher -- Executive Vice President and Chief Financial Officer\n\nYes, I think we're going to assume it's going to be a blend. I mean, there are some pockets where we do expect some normalization. But when I say pent-up demand, it's really the sort of the flood that we saw in Q2 of 2021, especially in the marketplace. And we don't expect something like that to occur again.\n\nProviders have become very resilient of managing through and we saw that in omicron. They were able to manage through that very well without any residual meaningful pent-up demand coming out of that Q1, early Q1 omicron variants. So we're going to make forward trend assumptions that we think about not just future COVID costs, future COVID vaccine costs, but also sort of flu normal trend, a normal flu season meaning sort of a pre-covid error flu season. So all of that is fungible and our forward estimates of trend.\n\nBut yes, we're thinking about sort of all of those legs of the stool.\n\nSteven Valiquette -- Barclays -- Analyst\n\nOK. Got it. OK. Thanks.\n\nOperator\n\nAnd our next question comes from George Hill from Deutsche Bank. Please go ahead with your question.\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nHey. Good morning, and I appreciate you guys sneaking me in. Drew, just two things I wasn't clear on is, number one, is there any recourse left for the Florida rate cut? Or is that decision final? I was just a little confused by the commentary as to whether or not we're done there or something goes forward. And maybe just I had a quick -- I'll do PBM for 1,000 here well I'll ask.\n\nCan you provide any color on kind of what was kind of the incremental thing that drove the decision change from CVS to ESI? And I typically try to land order these things like price, service, access formulary? Just would love to know kind of what was the needle mover in the [Inaudible]. Thank you.\n\nSarah London -- Chief Executive Officer\n\nYes, I can take the PBM question first and then kick it over to Drew on Florida. I think like I said, we were really happy with how competitive the process was. We thought everybody showed up with strong bids. Obviously, economics matter a lot.\n\nBut we look across the whole slate of criteria. And it was really sort of the aggregate calculus that made the decision, not any one individual thing. Again, I think the market has good strong competition. We feel good about the go-forward partnership and the ability to sort of innovate how our PBM functions are administered.\n\nDrew Asher -- Executive Vice President and Chief Financial Officer\n\nAnd then on Florida, yes, the cake is baked for the 10/1 sort of rate change. But my reference was we're constantly reviewing data with not just the state representatives but also their actuaries and we'll continue to do so over the next year. And then we expect the renewal of that rate no later than 10/1/23. One question you didn't ask, but we've got a couple of notes coming in just to be clear on the $0.25 to $0.50 is net of the tailwinds that I laid out.\n\nSo that was a macro overall view of 2024, where this team, we are committed to driving to the $7.50 plus but we also have -- we don't have perfect information, including California. And that view is net of tailwinds, but it includes headwinds such as Star.\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nVery helpful. Thank you.\n\nOperator\n\nAnd ladies and gentlemen, that will conclude our question-and-answer session. At this time, I'd like to turn the floor back over to Sarah London for any closing remarks.\n\nSarah London -- Chief Executive Officer\n\nThanks so much. Thanks, everyone, for your time this morning. Great questions. We look forward to seeing many of you at our December investor day and look forward to the opportunity to share more about Centene's strategy for long-term profitable growth.\n\nHave a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJennifer Gilligan -- Senior Vice President, Investor Relations\n\nSarah London -- Chief Executive Officer\n\nBrent Layton -- President and Chief Operating Officer\n\nDrew Asher -- Executive Vice President and Chief Financial Officer\n\nJosh Rashkin -- Nephron Research -- Analyst\n\nStephen Baxter -- Wells Fargo Securities -- Analyst\n\nJustin Lake -- Wolfe Research -- Analyst\n\nLance Wilkes -- AllianceBernstein -- Analyst\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nScott Fidel -- Stephens, Inc. -- Analyst\n\nCalvin Sternick -- JPMorgan Chase and Company -- Analyst\n\nMichael Ha -- Morgan Stanley -- Analyst\n\nNathan Rich -- Goldman Sachs -- Analyst\n\nGary Taylor -- Cowen and Company -- Analyst\n\nSteven Valiquette -- Barclays -- Analyst\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nMore CNC analysis\n\nAll earnings call transcripts"
}