{
  "companyName": "Karyopharm Therapeutics",
  "companyTicker": "KPTI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/karyopharm-therapeutics-kpti-q3-2022-earnings-call/",
  "content": "Karyopharm Therapeutics (KPTI 7.94%)\nQ3 2022 Earnings Call\nNov 03, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon. My name is Jason, and I'll be your conference operator today. At this time, I would like to welcome everyone to Karyopharm Therapeutics third quarter 2022 financial results conference call. Please be advised that this call is being recorded at the company's request.\n\n[Operator instructions] I would now like to turn the call over to Elhan Webb, senior vice president of investor relations.\n\nElhan Webb -- Senior Vice President of Investor Relations\n\nThank you, operator, and thank you all for joining us on today's conference call to discuss Karyopharm's third quarter 2022 financial results and recent company progress. Today, I'm joined by Richard Paulson, president and CEO; Sohanya Cheng, chief commercial officer; Dr. Reshma Rangwala, chief medical officer; and Mr. Mike Mason, chief financial officer.\n\nToday, we issued a press release detailing Karyopharm's financial results for the third quarter 2022. This release, along with the slide presentation that we will reference during today's call, are available on our website. For today's call, as seen on Slide 2, Richard will start with some opening remarks. Sohanya will provide a commercial update.\n\nThen Reshma will provide an update on our clinical development programs. Mike will then present an overview of financial highlights from the quarter and Richard will end with some closing remarks, before opening the call up for questions. Before we begin our formal comments, I'll remind you that various remarks we will make today, constitute forward-looking statements for purposes of the safe harbor provisions under the Private Securities Litigation Reform Act of 1995 as outlined on Slide 3. Actual results may differ materially from those indicated by these forward-looking statements, as a result of various important factors, including those discussed in the Risk Factors section of our most recent quarterly report on Form 10-Q, which is on file with the SEC and in other filings that we may make with the SEC in the future.\n\nAny forward-looking statements represent our views as of today only. While we may elect to update these forward-looking statements at some point in the future, we disclaim any obligation to do so, even if our views change. Therefore, you should not rely on these forward-looking statements, as representing our views as of any date subsequent to today. In addition, we will also be providing on this call outlook for non-GAAP R&D and SG&A expenses for 2022.\n\nWe are not providing reconciliations of these forward-looking non-GAAP measures because projections of stock compensation expense, which is required for such reconciliations are not available without unreasonable efforts. I will now turn the call over to Richard. Please turn to Slide 4.\n\nRichard Paulson -- President and Chief Executive Officer\n\nThank you, Elhan, and good afternoon to everyone joining us on the call and webcast. Today, I'm excited to provide an update on our plan, as we continue to execute on our growth strategy through our focused pipeline, targeting life-threatening cancers. Turning to Slide 5, Karyopharm was founded in 2008 as an innovation and patient-focused company, developing first-in-class oral Selective Inhibitor of Nuclear Export which target XPO1 that mediates multiple processes, integral to cancer cell growth. Fast forward to Karyopharm today, where we are successfully leveraging that fundamental mechanism of action to build upon our existing multi-myeloma franchise, anchored around our commercial drug Xpovio.\n\nXpovio's footprint now reaches 40 countries and combined with increasing use in earlier lines of therapy in multi-myeloma, we are currently expecting total revenue of between $155 million to $165 million in 2022. We are working to expand indications through advancing our focused clinical pipeline. This pipeline is comprised of mid and late-stage clinical development programs that is being purposefully built and strategically focused to help patients who suffer from cancers with high unmet need, to demonstrate efficacy at lower doses with improved tolerability and where we believe, we will have the highest probability of success. Based on compelling data signals, we are pursuing opportunities in endometrial cancer, myelofibrosis, and myelodysplastic syndromes.\n\nCollectively, we believe we have the potential to achieve multiple product approvals over the next two to four years. We've also evolved our leadership with a team of dedicated and highly accomplished executives from across the biopharmaceutical industry, specifically with commercialization and mid to late-stage clinical development experience, to lead us in delivering our targeted mid and late-stage clinical pipeline. With a strengthened leadership team in place, we believe we can achieve both scientific and commercial excellence, while executing on our key corporate objectives. Let's now turn to the third quarter of 2022, which was marked by several meaningful achievements as outlined on Slide 6.\n\nIn Q3, we saw US Xpovio net product revenues of $32 million which translated to a 20% year-over-year growth, compared to Q3 of 2021, despite an increasingly competitive multi-myeloma market. We continue to see increasing use of Xpovio in earlier lines, with strong growth in the community setting. Sohanya will provide more detail in a moment. Internationally NeXpovio received full marketing authorization in July 2022 from the European Commission for the treatment of patients with multi-myeloma after at least one prior therapy.\n\nThis has opened the door for recent commercial launches in Germany and Austria by our partner Menarini. Important steps forward for patients in Europe, where nearly 51,000 new cases of multi-myeloma are diagnosed each year. With patient access for selinexor starting to expand across the world, we expect revenues in ex-US territories to have an increasing contribution to total selinexor revenues in the future. On the clinical side, we are delivering on our focused pipeline.\n\nGiven the meaningful improvement in PFS observed with selinexor in the exploratory, TP53 wild-type subgroup in our Siendo study, we are excited about the initiation of our pivotal Phase three study. This study will utilize Foundation Medicine's tissue-based next-generation sequencing test to identify this important group of patients. As highlighted in the ASH abstracts released today, the combination of selinexor and ruxolitinib evaluated in the Phase 1 XPORT-MF-034 study, continues to demonstrate compelling activity and Reshma will provide more detail on this momentarily. In addition, we were granted EU Orphan Medicinal Product designation for selinexor for the treatment of myelofibrosis in Europe.\n\nIn myelodysplastic syndromes, after completing enrollment in Q2 for the interim analysis in our relapsed and refractory MDS Phase 2 study, we are waiting for overall survival data to mature and expect to present data late this year or early next year. Finally, as Mike will provide more detail later in the call, in the third quarter we continued to execute on our cost reduction initiatives, in line with the evolution of our focused and prioritized pipeline. As we now turn to Slide 7, I would like to turn the call over to Sohanya for her review of the commercial performance for the quarter. Sohanya?\n\nSohanya Cheng -- Chief Commercial Officer\n\nThank you, Richard, and good afternoon, everyone. I am pleased to talk about the growth story of Xpovio, the first and only drug in the novel class of sign therapy and a key combination partner in the second to fourth-line multiple myeloma setting in an evolving marketplace. Turning now to Slide 8 and our commercial highlights for the third quarter of 2022. Net product revenue grew by 20% versus the same period last year and we continue to make progress across key indicators.\n\nOur team executed with strength to access and educate our physician community, resulting in the growth of both new patient starts and prescription refills. We continue to make progress with our primary growth driver and what we believe is most important to patients, which is the continued shift of Xpovio into earlier lines, with over half of our patients in the second to fourth line. In fact, during the first half of 2022, we were the fastest-growing brand in third-line multiple myeloma. As patients move into earlier lines and physicians gain experience and confidence using Xpovio at the new once-weekly lower dose, we see that patients are continuing to stay on therapy longer.\n\nAs we have seen increasing competition in the late-line setting at academic centers with new approvals and ongoing trials, our focus remains on expanding the use of Xpovio in the community setting, which contributed over 65% of our business in Q3. With our continued focus on growing both breadth and depth of prescribing accounts, in Q3 we reached the highest number of total prescribing accounts since the launch of Xpovio. Two-thirds of these accounts were in the community setting. Our focus is to continue to expand breadth of use while leveraging this broad base of accounts in building upon their positive experience to drive depth.\n\nWe continue to see a positive shift in the perception of Xpovio in the second to fourth line per our intend to prescribe data due to the growing confidence among physicians in using the lower dose once weekly Xpovio-based triplet regimen with approximately 93% of patients now starting on a 100-milligram weekly dose or less. This evolution, since the first approval from higher to lower dose and from late to early align use, is one that we have seen with many other myeloma therapies. The growing marketplace experience we see with Xpovio at lower doses is enabling better patient experiences and adherence to therapy. Reshma will expand upon our ongoing development and dose optimization plans for selinexor.\n\nAs we look to the future growth potential of Xpovio within an evolving multiple myeloma landscape, it is clear there continues to be a high unmet need both in the near, mid, and long term. First, as the anti-CD38 class moves to the front line, there is a significant need for a class switch to a novel therapy for patients who progress on an anti-CD38 therapy. Unlike many other myeloma agents, we have generated data from our Boston study in the post-anti-CD38 setting and we continue to generate more data across multiple settings in the second to fourth line. Second, while new therapies continue to emerge many of them are expected to enter in the late-line setting with patient tolerability and accessibility in the community becoming an increasing challenge.\n\nOur focus remains on growth in the community setting and positioning Xpovio in second to fourth line as a novel class of therapy that is effective, easily combinable and a convenient oral regimen with a manageable safety profile. With that please advance to Slide 9, and I will turn the call over to Reshma to review our clinical pipeline progress.\n\nReshma Rangwala -- Chief Medical Officer\n\nThank you, Sohanya. Before I go into more detail on select programs, I would like to highlight how we have been working to optimize the dose of selinexor and how it relates to our ongoing clinical development programs on Slide 10. As Sohanya mentioned due to the growing confidence among physicians in using the lower once-weekly dose of Xpovio-based triplet regimens, both the patient and physician experience, as well as adherence is improving. Since Xpovio is launched in 2019, we have utilized real-world experience coupled with observations from our clinical trials to demonstrate that lower doses of selinexor can optimize the patient benefit by improving its tolerability, which will ultimately allow patients to remain on therapy longer improving their overall benefit.\n\nAs a result all of our ongoing clinical trials incorporate selinexor doses at 40 milligrams to 60 milligrams weekly, which is a quarter to less than half of the originally approved dose of 80 milligrams twice weekly. Such dose optimization will further enable our opportunity to accelerate new approvals in the next two to four years. On Slide 11, I would like to highlight the advancements we have made in our development pipeline, which include initiation of the Phase 3 EC-042 trial in women with endometrial cancer and completion of enrollment in the Phase 1 portion of the MF-034 trial. In our eltanexor program, we have stopped enrollment on the Phase 1 combination trial in treatment-naive MDS, so that we can reevaluate the combination regimen.\n\nWe have completed enrollment in the interim analysis in our relapsed refractory program and are awaiting for overall survival data to mature. Now as we turn to Slide 12, I would like to discuss the unmet need in endometrial cancer and why we find this opportunity so exciting for women. Endometrial cancer is the most common form of gynecologic cancer in the US with approximately 50% of advanced and recurring tumors classified as TP53 wild-type. Second, the current treatment landscape for advanced or recurrent endometrial cancer consists of a first-line chemotherapy.\n\nUpon completion of chemotherapy, the NCCN guidelines recommend a watch-and-wait approach until disease progression. This approach clearly needs improvement given that the five-year survival rate in this patient population is only 17%. The selinexor is administered orally and maintenance therapy is well-established in other cancer types, we believe selinexor has the potential to offer a maintenance option that could sustain the response from chemotherapy and improve the overall clinical benefit for these patients. Please turn to Slide 13, presented at ASCO 2022 with the subgroup analysis and molecular classification data from the Siendo study, evaluating selinexor in endometrial cancer as a maintenance therapy.\n\nAs previously disclosed this analysis indicated that patients whose tumors were TP53 wild-type and treated with selinexor, demonstrated a median progression-free survival of 13.7 months compared to 3.7 months for patients treated with placebo. In contrast, patients whose tumors were either TP53 mutant or aberrant when treated with selinexor demonstrated a median PFS of 3.7 months compared to 5.6 months for patients treated with placebo. These data suggest that TP53 wild-type has the potential to be a robust biomarker and selinexor may provide a meaningful benefit to patients with TP53 wild-type endometrial cancer. We are very encouraged by the hypothesis-generating data gained from our Siendo study and are eager to study selinexor further in the TP53 wild-type population.\n\nAs you can see on Slide 14, we are excited to announce that we have initiated the Phase 3 maintenance study designed to evaluate the efficacy and safety of selinexor in TP53 wild-type patients with stage four or recurrent endometrial cancer and expect to dose the first patient in the fourth quarter. This study will utilize Foundation Medicine's tissue-based next-generation sequence test to identify patients and enroll approximately 220 women whose tumors are TP53 wild-type. Patients will be randomized in a one-to-one manner to receive either once weekly selinexor at a dose of 60 milligrams or placebo. The study's primary endpoint is progression-free survival with the key secondary endpoint of overall survival.\n\nThe study is a collaboration between Karyopharm and ENGOT, the European Network for Gynecological, Oncological Trial Groups, and GOG, the Gynecology Oncology Group. Data from this study are expected in 2024 and could represent a paradigm shift for women with endometrial cancer. If you would now turn to Slide 15, I would like to highlight our rapidly advancing myelofibrosis program in the current treatment landscape. Ruxolitinib is the current standard of care for newly diagnosed myelofibrosis.\n\nHowever, only approximately 40% of patients respond to frontline treatment. Once patients stop responding the expected median survival is approximately 14 months and the five-year survival rate is only 18%. There is a clear unmet need for a novel new mechanism both in the front line and relapsed refractory setting as no other drug classes other than JAK inhibitors have been approved in the last 10 years. Selinexor has the potential to be a convenient safe and effective oral treatment for frontline and relapsed refractory patients.\n\nAs seen on Slide 16 as a novel agent targeting XPO1, selinexor has the potential to mediate relevant factors beyond the JAK-STAT pathway, which can enhance or complement the efficacy of JAK inhibitors and can also serve as a single agent in JAK-resistant cells. On Slide 17, the Phase 2 Essential study evaluated single-agent selinexor in patients who received prior JAK one or two therapies. 40% of patients achieved a spleen volume reduction of 35% or greater following at least 24 weeks of treatment. The two-year probability of survival was 92%.\n\nTo put these data into context, currently available therapies in a similar patient population lead to a spleen volume reduction of 35% or greater in only approximately 15% of patients. Furthermore, in the Essential trial, we observed positive impact from hemoglobin levels including 50% of patients achieving either stable or improved hemoglobin levels or transfusion independence, as well as hemoglobin increases by at least two grams per deciliter in 65% of patients, contrast this with other approved agents in which anemia often worsens on therapy. In this study, selinexor was generally well tolerated with a median treatment duration of 11 months. Although the Essential study is small and the data are still preliminary, the results build on compelling non-clinical and pre-clinical data by demonstrating monotherapy activity and highlights the potential of this novel class of therapy to improve outcomes including durable spleen volume reduction and maintaining or even improving hemoglobin levels.\n\nTurning now to Slide 18, we continue to enroll on our most advanced myelofibrosis study the ongoing Phase 2 MF-035 study and we look forward to reporting our top-line results in the second half of 2023. This study is a randomized open-label study evaluating single-agent selinexor versus physician's choice therapy in patients with myelofibrosis who have had at least six months of prior treatment with a JAK1/2 inhibitor. The primary objective of this study is to assess SVR35 and key secondary endpoints include TSS50, ORR, OS, anemia response and safety. Turning now to Slide 19; here is our frontline myelofibrosis study a Phase 1 study evaluating the combination of selinexor and ruxolitinib in patients with treatment-naive myelofibrosis.\n\nIn this study we completed enrollment of the Phase 1 portion in dose 24 patients. Our objectives for this study are to explore the combination of selinexor and ruxolitinib building on the single-agent activity of both of these compounds. Given the potential synergism between these two drugs we believe that the combination of selinexor plus ruxolitinib has the potential to improve upon key efficacy parameters including rapid spleen reduction, symptom improvement hemoglobin stabilization and overall survival. We are looking forward to advancing this combination into the registrational portion.\n\nTurning to Slide 20; I am delighted to share updated results published in the ASH abstract earlier today. Based upon July data cut 79% of evaluable patients achieved a 35% or greater spleen volume reduction at week 12 and 86% of the valuable patients achieved a 35% or greater spleen volume reduction at week 24. In addition, 69% of evaluable patients achieved a 50% or greater reduction of their Total Symptom Score at week 12. And finally, 65% of transfusion independent patients for at least eight weeks of treatment maintained stable hemoglobin or improved hemoglobin levels at last follow-up.\n\nThese results are notable given that the Grade 3/4 anemia rates observed with the combination were only 21% compared to the 45% observed with ruxolitinib alone. The combination of selinexor and ruxolitinib was generally well tolerated and had a manageable safety profile with the most common reported Grade 3/4 adverse events being thrombocytopenia, anemia, and neutropenia. The hematologic adverse events were reversible with dose interruptions and reductions that occurred with both ruxolitinib and selinexor. Current observations suggest that the rates and grades of adverse events are dose-dependent.\n\nIn light of the meaningful impact, we are seeing in patients across all relevant efficacy parameters combined with the manageable safety profile our investigators are very encouraged and enthusiastic about the potential of this novel combination for treatment-naive myelofibrosis patients. We look forward to presenting further updated results at ASH with a longer follow-up in additional patients in the 40-milligram dose arm. We will be hosting a webcast at ASH to discuss these data with investors. With that, I'll now advance to Slide 21 and turn the call over to Mike to review the third-quarter financial highlights.\n\nMike?\n\nMike Mason -- Chief Financial Officer\n\nThank you, Reshma. Since we issued a press release today with the full financial results I will just focus on the highlights, which begin on Slide 22. Total revenue for the third quarter of 2022 was $36.1 million compared to $37.7 million for the third quarter of 2021, which included a $9.8 million milestone from Antengene. With increasing approvals and commercial launches for selinexor globally, we expect milestone and royalty payments by our partners to deliver a larger contribution to our total revenues in 2023 and beyond.\n\nNet product revenue from US. commercial sales of Xpovio for the third quarter of 2022 was $32 million, compared to $26.7 million for the third quarter of 2021 representing a 20% increase year over year. The gross-to-net discount for Xpovio in the third quarter was 18%. We continue to expect gross to net discount to be in the 15% to 20% range for the full year 2022.\n\nWe recognized $4.1 million of license and other revenue in the third quarter of 2022, which includes $2.4 million earned in royalties from our partners and $1.4 million earned in reimbursement of development expenses. R&D expenses for the third quarter of 2022 were $31.4 million, compared to $45.8 million for the third quarter of 2021. The decrease was primarily driven by the recognition of $7.4 million of costs in connection with the acquisition of certain assets from Neumedicines in the third quarter of 2021. Additionally, clinical trial and related costs decreased primarily due to the prioritization of our core programs in the clinical pipeline.\n\nWe continue to expect our 2022 non-GAAP R&D expenses to decrease by approximately 10% compared to 2021. SG&A expenses for the third quarter of 2022 were $34.6 million, compared to $35.1 million for the third quarter of 2021. Cash, cash equivalents restricted cash and investments as of September 30, 2022 totaled $150.1 million, compared to $235.6 million as of December 31, 2021. Based on our current operating plans, we are reaffirming guidance for the full year of 2022 as follows: total revenue in the range of $155 million to $165 million, Xpovio net product revenue of $120 million to $130 million and non-GAAP R&D and SG&A expenses, which excludes stock-based compensation expense to be in the range of $250 million to $265 million.\n\nWe initiated cost reduction initiatives in the second quarter that accelerated in the second half of 2022, including stopping certain signal-seeking programs such as our lung and colorectal cancer studies. In addition, we have optimized our R&D and G&A infrastructure by eliminating roles as we continue to align the organization with our prioritized programs. We continue to expect an overall reduction of R&D expense of approximately 10% in 2022 compared to 2021. We project that our existing cash, cash equivalents, and investments as well as the revenue, we expect to generate from Xpovio product sales and license revenues, including a $20 million cash payment from Antengene that we expect to receive near the end of the year, related to a milestone that we previously recognized will be sufficient to fund our planned operations into early 2024.\n\nLet's move to Slide 23 and turn the call back to Richard for some final thoughts.\n\nRichard Paulson -- President and Chief Executive Officer\n\nThank you, Mike. And in closing, I would like to thank all of our teams at Karyopharm and our investigators, as we work every day to positively impact the lives of patients with cancer, helping us deliver on our commitments as you can see on Slide 24. With that, I would now like to ask the operator to open the call up to the question-and-answer portion of today's call. Operator?\n\nOperator\n\n[Operator instructions] Our first question comes from Maury Raycroft from Jefferies. Please go ahead.\n\nKevin Strang -- Jefferies -- Analyst\n\nHi. This is Kevin Strang on for Maury. Thanks for taking the questions and congrats on the update. Just a quick question on the myelofibrosis data.\n\nYou showed 19 patients in the abstract and you mentioned that you had the 24 patients enrolled. Could you just say how many of those patients we might see at ASH? And how many of those patients would be on the 40-milligram dose? And based on what you're saying so far how the dose is influencing safety and efficacy? Thanks.\n\nRichard Paulson -- President and Chief Executive Officer\n\nYeah. Thanks, Kevin. I'll turn to Reshma to go through those questions.\n\nReshma Rangwala -- Chief Medical Officer\n\nYeah, and thank you for the question. So you're correct. In the ASH abstract and this is from a July data cut, we included 19 patients who received at least one dose. The SVR data and the TSS50 data are from those patients who are efficacy evaluable for both the SVR as well as the TSS endpoints.\n\nWhen we look forward to ASH, we are going to provide additional updates both in terms of patient numbers as well as follow-up, and expect to provide TSS and SVR data on approximately 21 patients from the entire 24-patient cohort. In terms of the breakdown between the 40 and 60-milligram doses, so we enrolled 10 patients as part of the 40-milligram dose level and 14 patients as part of the 60-milligram dose level and we'll be providing safety and efficacy data at ASH across those two dose levels. And then lastly, in terms of AE rates dose dependency, you're correct. So this is a phenomenon that we are seeing with selinexor across all of our indications including endometrial cancer, multiple myeloma, as well as myelofibrosis in that there is a dose dependency between AE rates, grades with the doses.\n\nAnd this is again, an observation that we're seeing also with the MF program in which we're combining with ruxolitinib.\n\nKevin Strang -- Jefferies -- Analyst\n\nGreat. Thank you. And then just a follow-up for the TSS50 that you're seeing. At ASCO, we saw that there were three out of seven responders I believe, in the abstract today we're seeing nine out of 13.\n\nCan you talk about if these are new responders or if this is potentially a deepening of response? And why is the symptom score getting better? Is there any -- are there any learnings that you can carry forward into future studies?\n\nReshma Rangwala -- Chief Medical Officer\n\nYes. So again the TSS50 that we're presenting in the ASH abstract similar to the ASCO or from the efficacy of valuable patients. And we are seeing a very nice improvement in that TSS score at week 12 from 43% to now 69%. And that includes, in symptoms that are deepening in the patients that are initially responded in the ASCO data set, as well as the new patients who are responding as well so really very encouraged by these symptom scores that are occurring as early as week 12.\n\nKevin Strang -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\nThe next question comes from Colleen Kusy from R.W. Baird. Please go ahead.\n\nAbi Gray -- Baird -- Analyst\n\nThis is Abi Gray on for Colleen. Thanks for taking our questions. First off, congratulations on the myelofibrosis update. And then, I was wondering on the TSS50, do you have any update on the TSS50 scores on those patients that have followed out to 24 weeks? And if not, do you have any commentary on how the symptoms are changing over time?\n\nReshma Rangwala -- Chief Medical Officer\n\nYes. It's a great question. So, we weren't able to provide the TSS50 data at week 24 in the ASH abstract. This is again a July data cut.\n\nAnd unfortunately, we just had some missing data at that time, but we look forward to presenting week 24 data in the ASH presentation come December.\n\nAbi Gray -- Baird -- Analyst\n\nAnd then I have a follow-up. It looks like the rates of nausea and vomiting increased from the last update at ASCO. So is there any additional color, on the GI toxicities you're seeing? And is it mostly presenting at the beginning of the study or does that present later, and how persistent is it throughout the study follow-up? And have you implemented any anti-MC protocols to help with that medic, sorry antiemetic to help with that?\n\nReshma Rangwala -- Chief Medical Officer\n\nYes. I appreciate the question. So as you know, selinexor causes nausea. This is an AE that has been observed in multiple myeloma, as well as our other cancer types including myelofibrosis as well as endometrial cancer.\n\nIt's important to note that while we see the nausea, this isn't dose limiting for the patient. So we aren't seeing patients who are discontinuing therapy, due to the nausea nor does it limit their ability to stay on therapy. We also see nice improvements as you know in the TSS50 scores. And while nausea is not included in that TSS50 domain specifically, it really is a testament to their overall global symptom improvement.\n\nSo, again it is not clinically relevant to this patient population. Lastly, I'll note we do incorporate antiemetics with selinexor. And this is again, just a standard mitigation strategy that we use across all of our programs.\n\nAbi Gray -- Baird -- Analyst\n\nGreat. Thank you so much.\n\nRichard Paulson -- President and Chief Executive Officer\n\nThanks, Abi.\n\nOperator\n\nThe next question comes from Brian Abrahams from RBC Capital Markets. Please go ahead.\n\nBrian Abrahams -- RBC Capital Markets --- Analyst\n\nAll right. Thanks for taking my questions. Congrats on all the progress. Continuing on the theme of the myelofibrosis data as you mentioned the TSS scores look like they improved versus the last cut.\n\nAnd I'm curious what sorts of TSS50 scores, would you be looking for to be confident that you're getting additive activity over ruxolitinib just given the challenges of an open-label study.\n\nReshma Rangwala -- Chief Medical Officer\n\nYeah. I got to say, Brian, we're very encouraged by these data right now as well as the evolution in the TSS50 over time. At ASCO, as you know, we presented 43% of the patients achieving that TSS50, and now we're seeing a nice evolution to 69%. So again, we're very encouraged, especially when we couple that with a very meaningful FBR and hemoglobin stabilization, as well as improvement score as well, really does suggest that this combination one is additive if not synergistic in combination with ruxolitinib.\n\nWe're having meaningful improvement on all efficacy endpoints in the context of a manageable safety profile. So, again, very encouraged by the data so far.\n\nBrian Abrahams -- RBC Capital Markets --- Analyst\n\nGreat. And you mentioned that as expected you saw some dose dependence to the tolerability profile. Did you also see a dose dependence related to spleen response or TSS response?\n\nReshma Rangwala -- Chief Medical Officer\n\nSo those data are maturing and we look forward to presenting that data at ASH. Ultimately, we will identify the recommended Phase 2 dose, either 40 milligrams or 60 milligrams based upon the totality of data, including safety efficacy and both pharmacokinetic data.\n\nBrian Abrahams -- RBC Capital Markets --- Analyst\n\nGreat. And then maybe one last one on -- also on MF. Wondering I think in the past you sort of alluded to consistency of response across different patient profiles and risk profiles. Just wondering, if you're continuing to see that or if there are any predictors of who might have the deepest and most durable responses here?\n\nReshma Rangwala -- Chief Medical Officer\n\nYeah. We are seeing improvement really across all the patient demographics. It's also notable to know that approximately 70% of our patients are classified into or high risk. So these really are a high-risk patient population.\n\nDespite that, again, we're really seeing meaningful improvement across all efficacy domains in this patient population. In terms of are we seeing anything predictive still interrogating the data. But right now the data again really are very encouraging and we're seeing it across all patient demographics.\n\nBrian Abrahams -- RBC Capital Markets --- Analyst\n\nThat's great. Thanks so much and look forward to the next update at ASH.\n\nRichard Paulson -- President and Chief Executive Officer\n\nThanks, Brian.\n\nOperator\n\n[Operator instructions] And our next question comes from Eric Joseph from J.P. Morgan. Please go ahead.\n\nEric Joseph -- J.P. Morgan -- Analyst\n\nGood evening. Thanks for taking the questions. I guess, with the -- in getting more efficient on the R&D spend, I'm just curious to get a sense of whether you see the need to sort of prioritize between selinexor development in combination with RUX in the treatment-naive setting versus in the RUX experience population. I guess, ultimately do you see both regimens advancing to later stage development? And I guess, as it relates to the treatment-naive setting is -- it's still a pretty conservative sample size.\n\nI'm just wondering if that is sufficient to make a call on the prospects of potentially advancing the RUX-combo forward as part of a pivotal study? Thanks.\n\nRichard Paulson -- President and Chief Executive Officer\n\nYeah. Thanks, Eric. Maybe I'll turn to Reshma to talk to that really in terms of the totality of building the multimyeloma or sorry the myelofibrosis franchise, and I'll come back to talk to the spend.\n\nReshma Rangwala -- Chief Medical Officer\n\nYeah. And thanks for the question. I mean, I think one of the key differentiating factors for selinexor is the fact that it has robust monotherapy activity especially in that relapsed refractory patient population. This builds upon preclinical non-clinical data that demonstrates selinexor's active and JAK-resistant cells.\n\nWe see that again in that Phase 2 Essential trial. But that allows us again to be able to develop selinexor in the widest patient population of myelofibrosis really why we are focused on both the treatment-naive opportunity in combination with ruxolitinib, but also as a monotherapy in those patients that have been treated with at least six months of prior JAK inhibition.\n\nRichard Paulson -- President and Chief Executive Officer\n\nAnd we look at our plans Eric and in terms of our pipeline the work we've done I think over the last year and year and a half really prioritize the pipeline both the relapse setting and the frontline setting are in our plans moving forward. And as we're really very encouraged, how the data is evolving we're excited to keep moving forward with them. Operator?\n\nOperator\n\nThere are no more questions in the queue. This concludes our question-and-answer session. I would like to turn the conference back over to Richard Paulson for any closing remarks.\n\nRichard Paulson -- President and Chief Executive Officer\n\nThank you, everyone, again for joining the call today, and we wish everyone a great evening. Good night.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nElhan Webb -- Senior Vice President of Investor Relations\n\nRichard Paulson -- President and Chief Executive Officer\n\nSohanya Cheng -- Chief Commercial Officer\n\nReshma Rangwala -- Chief Medical Officer\n\nMike Mason -- Chief Financial Officer\n\nKevin Strang -- Jefferies -- Analyst\n\nAbi Gray -- Baird -- Analyst\n\nBrian Abrahams -- RBC Capital Markets --- Analyst\n\nEric Joseph -- J.P. Morgan -- Analyst\n\nMore KPTI analysis\n\nAll earnings call transcripts"
}