{
  "companyName": "UP Fintech Holding",
  "companyTicker": "TIGR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/07/up-fintech-holding-tigr-q2-2022-earnings-call-tran/",
  "content": "UP Fintech Holding (TIGR -28.51%)\nQ2 2022 Earnings Call\nSep 07, 2022, 8:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to UP Fintech Holding Limited second quarter 2022 earnings conference call. [Operator instructions] I must advise you that this conference is being recorded today, September 7, 2022. I'd now like to hand the conference over to your first speaker today, Mr. Aaron Lee, investor relations director.\n\nThank you. Please go ahead.\n\nUnknown speaker\n\nThank you, operator. Hello, everyone, and thank you for joining us for the call today, UP Fintech Holding Limited second quarter 2022 earnings release was distributed earlier today, and is available on our IR website at ir.itiger.com, as well as newsletter services. On the call today from UP Fintech are Mr. Wu Tianhua, chairman and chief executive officer; Mr.\n\nJohn Zeng, chief financial officer; and Mr. Kenny Zhao, our financial controller. Mr. Wu will give an overview of our business operations and discuss project highlights.\n\nMr. Zeng will then discuss our financial results. They will both be available to answer your questions during the Q&A session that follows their remarks. Now, let me cover the Safe Harbor.\n\nThe statements we are about to make contain forward-looking statements within the meaning of the U.S. Private Securities Litigation Reform Act of 1995. A number of factors could cause actual results to differ materially from those contained in any forward-looking statements. For more information about factors that could cause actual results to materially differ from those in the forward-looking statements, please refer to our Form 6-K furnished today, September 1, 2022, and our Annual Report on Form 20-F filed on April 28, 2022.\n\nWe undertake no obligation to update any forward-looking statements, except as required under the applicable law. It is my pleasure to now introduce our chairman and chief executive officer, Mr. Wu. Mr.\n\nWu will make remarks in Chinese, which will be followed by an English translation. Mr. Wu, please go ahead with the result.\n\nWu Tianhua -- Director and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nHello, everyone. Thank you for joining the Tiger Brokers Second Quarter 2022 earnings conference call.\n\nWu Tianhua -- Director and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nMarket backdrop remained challenging in the second quarter, particularly in the U.S. capital markets. The weak U.S. market performance somewhat slowed down the trading activities and asset growth, given that our clients have more exposure in the U.S.\n\nmarket compared to Hong Kong. This growth in the 2B business and prudent capital deployment, the total revenue of the second quarter increased by 2% from the fourth quarter to $53.5 million. Non-GAAP net income also turned profitable to $3.5 million, demonstrates the resilience of our business model during market turbulence.\n\nWu Tianhua -- Director and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nWe added 27,900 funded accounts this quarter, with over 70% coming from outside of China. Our total number of funding accounts also exceeded 730,000 by the end of the second quarter, an increase of 38.2% from the same quarter last year. And we are confident to deliver our annual guidance of acquiring at least 100,000 new funded accounts this year. In the second quarter, mark-to-market loss, two had an adverse impact on the total connect assets, which slightly decreased by 2.3% to $14.9 billion compared to the end of the fourth quarter.\n\nBut the trend of healthy asset inflow continues. Net asset inflows exceeded $1.5 billion this quarter, funded account retention rate exceeded 99% this quarter, demonstrating user confidence and trust in our platform.\n\nWu Tianhua -- Director and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nWe pay very close attention to client quality and payback period. In the second quarter, average CAC for funded account was about $300, a 10% decrease from the fourth quarter, while we keep acquiring high-quality clients. Taking Singapore as an example, that's been Singapore for two years, and now, Singapore already becomes our company's largest market in terms of both incremental and existing clients. More than 6% of our new funded accounts in the second quarter coming from Singapore, a testament to our industry-leading user acquisition in the region.\n\nThe average net asset inflows of our newly acquired clients in Singapore exceeded $9,000 in the second quarter, further decreased from around $8,000 in the second quarter -- sorry, in the first quarter, solidifying our leading position in both market share and client quality in Singapore.\n\nWu Tianhua -- Director and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nWe continue to invest in research and development to improve operational efficiency and to enhance user experience. The set clearing, the execution and clearing costs as a percentage of the trading commission further decreased compared with the previous quarter. To better help our users to navigate the market turmoil, we have launched the 8.0 version of our app with both lite and pro models, which provides a more simplified interface and diversified product offering.\n\nWu Tianhua -- Director and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nOur 2B business continues to grow. In the second quarter, we added 26 new companies to a total of 364 ESOP clients, a year-to-year growth rate of 68%. We provide a comprehensive ease of services, from client design to digital management, and has become the go-to choice for many start-ups and public companies listed in PRC, Hong Kong and U.S. In terms of the investment banking business, we underwrote 11 U.S.\n\nand Hong Kong IPOs in the second quarter, in which we were the lead bank in three U.S. IPOs. According to [Inaudible] with data consulting, we ranked No. 3 in number of deals underwrote for the first half of this year and No.\n\n1 globally for the second quarter.\n\nWu Tianhua -- Director and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nNow, I would like to invite our CFO, John, to go over our financials.\n\nJohn Zeng -- Chief Financial Officer\n\nThanks, Tianhua and Aaron. Let me go through our financial performance for the second quarter. All numbers are in U.S. dollar.\n\nTotal revenue were $53.5 million this quarter, a decrease of 11% year over year, as market backdrop, particularly the U.S. market was still choppy, which is still down trading and margin activities. On a sequential basis, we managed to offset the slowdown in commission with more corporate service revenues, such as underwriting and IRPR services. So total revenue grew 2% on a quarter-over-quarter basis.\n\nCash equity take rate was 6.5 bps this quarter, slightly better than 6.3 bps of last quarter and a 6 bps in the same quarter last year. Our pricing strategy has been consistent. The difference in take rate are primarily due to change in share price. As for U.S.\n\nequities, we charged by number of shares, not trading volume. Now, on the cost. Interest expense was $3.5 million, a decrease of 27% from the same quarter of last year, primarily due to more interest expense savings from U.S. sales clearing.\n\nExecution and clearing expenses were $3.9 million, decreased 41% from same period last year. Since we started self-clearing, clearing expense as a percentage of commission have come down from over 20% a year ago to under 5% this quarter for both U.S. cash equities and options. We expect further reduction in clearing expense when we start self-clear Hong Kong equities.\n\nAs of right now, we are paying about 50% of our Hong Kong Commissioner's clearing expense. Employee compensation increased 25% year over year to $25.6 million this quarter as we added headcount during last year to support our global expansion. In line with the headcount increase, occupancy expense increased 69% to $2.5 million, but general and administrative expense decreased 15% year over year to $4.3 million due to one-off professional service fee occurred last year. Marketing expense were $8.4 million this quarter, decreased 65% year over year.\n\nWe focus on quality of new users. Don't see current market condition is suitable for major marketing campaign as we keep a close eye on CAC and payback. We will dynamically adjust our marketing strategy based on market environment. Communication and market data expense were $7.2 million, an increase of 40% from a year ago due to rapid user growth and expanded market data coverage.\n\nTotal operating costs were $51 million, decreased to 17% from the same quarter of last year. As a result, we narrowed our GAAP loss to $0.9 million from a loss of $21.5 million in the same quarter last year. Non-GAAP net income turned positive to $3.5 million versus a non-GAAP net loss of $4.4 million last year. Now, I have conclude our presentation.\n\nOperator, please open the line for Q&A. Thanks.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Han Pu from CICC. Please ask your question.\n\nHan Pu -- CICC -- Analyst\n\n[Foreign language] Thanks, management for taking my question. This is Han from CICC. I have two questions related to the Singapore market. Firstly, how do we maintain and penetrate Singapore market with increasing competitive environment? Secondly, what is the customer acquisition cost in Singapore this quarter? And how do we see the trend to continue?\n\nJohn Zeng -- Chief Financial Officer\n\n[Foreign language]\n\nUnknown speaker\n\nOK, I will translate. Well, yes, the landscape is getting more competitive in Singapore because in addition to traditional brokers, there are also some online brokers, more online brokers coming to Singapore. We do embrace the healthy competition as long as it could bring better products and service to the local clients. Well, for broker customer acquisition, cost control and acquiring clients with high quality are the imperative tasks to cope with during the competition.\n\nAnd our purpose is to be the largest and the most trustworthy broker in Singapore. Our strategy is shooting for the long-term development, so we will not sacrifice the quality of clients or incur high CAC just for short-term growth. We believe the research and development is the core competitiveness of Tiger, so we do attach great importance to product quality. We continue to optimize our products and draw up more functions to meet the investment needs of different types of investors, thus to improve client engagement, the user stickiness as well as the ARPU.\n\nAs we can see from our financials in the second quarter, we keep staying ahead in the Singapore market under the weak market backdrop and intensive competitive landscape. More than 60% of our total newly acquired clients in the second quarter coming from Singapore, and the average net asset inflows of our new funded clients in Singapore exceeded $9,000, while the average CAC decreased sequentially, so it solidifies our leading position in both market share and client quality.\n\nWu Tianhua -- Director and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nOK. So in the second quarter, the average CAC in Singapore was around $215. And if we let the broker operating expense, the average CAC will just go down to $156. Meanwhile, we launched our services in Australia in the fourth quarter, right? So when we enter a new market, similar to what we've done in Singapore, we will spend more branding to -- branding costs to promote our company.\n\nTherefore, the average CAC in Australia and New Zealand is still relatively high, which brings the total average CAC to about $300 in the second quarter, decreased about 10% on a quarter-over-quarter basis. While the market sentiment was weak during the first half year and investors prefer to stay on the sideline, under this kind of circumstance, we are very prudent with the marketing spending. We keep a very close eye on CAC and payback period to make sure we can have a very healthy business model, and we will just be very dynamic to address our marketing strategy.\n\nHan Pu -- CICC -- Analyst\n\nThanks, management. That's very helpful.\n\nOperator\n\nThank you for your question. Our next question comes from the line of Cindy Wang from China Renaissance. Cindy, please ask your question. Cindy's line has disconnected.\n\n[Operator instructions] Our next question comes from the line of Judy Zhang from Citi.\n\nJudy Zhang -- Citi -- Analyst\n\n[Foreign language]\n\nWu Tianhua -- Director and Chief Executive Officer\n\n[Foreign language]\n\nJudy Zhang -- Citi -- Analyst\n\n[Foreign language] Thanks, management for giving me this opportunity to ask question. This is Judy Zhang from Citi. I have two questions. The first question is, we saw Tiger has acquired Hong Kong brokerage license for almost a year.\n\nWhat is the status? And the development plan for, like, to develop business in Hong Kong? And second question is in light of fed accelerating rate hike cycle, what is the impact to the company's business, and what is the potential response from the company? Thank you.\n\nUnknown speaker\n\n[Foreign language] OK, so in regards to our progress in Hong Kong. So we have some delays earlier this year due to COVID. Now, I think everything is progressing on the track. So, so far, we are upgrading the trading infrastructures, for example, getting more direct lines, expand our server, doing testing with the exchange and back test order book and records using our own system.\n\nSo so far, I think everything is on the right track, and hopefully, we can have a soft launch in the near future. And also, recently, we have obtained the Type 4 and 5 license from SFC which allows us to create more content for users and our online communities. So we will apply for more license down the road, so we can provide more value-added service to our Hong Kong users. OK, Tianhua?\n\nWu Tianhua -- Director and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nOK, so your second question about the rate hike. You see the broker-dealer industry has very strong price hike effect. We think the price hike mean we will have mixed impacts on our business and the whole industry. So on the bright side, we can, of course, generate more interest income from the increased risk cycle, especially with our increased client base and set clearing efficiency.\n\nWhile on the other side, to a certain extent, the liquidity tightening will have negative impacts on the capital market activity and the transaction volume as well as the appeal issuance. So to neutralize the downside of -- strategic speaking, we will keep concentrating on investor education and product optimization, and consequently, to have our clients to better navigate market turmoil and enhance client engagement. So in addition, we will keep upgrading the infrastructure in Hong Kong so that we can provide better services to our clients when the market recovers. Thank you.\n\nOperator\n\nAll right. Thank you. Our next question comes from the line of Cindy Wang from China Renaissance. Please ask your question, Cindy.\n\nCindy Wang -- China Renaissance Securities -- Analyst\n\n[Foreign language] Thanks for -- management for giving me the opportunity to ask questions. So I have two questions here. First question is, could you provide a business update for Australia and New Zealand market in second quarter of 2022? And what's the marketing strategy you will adopt, and any new products will be launched in these two markets in second half of this year? Second question is regarding to the new paying clients. Could you provide a breakdown by geographies, and how do you expect the distribution of the new paying clients in the second half of this year? Thank you.\n\nJohn Zeng -- Chief Financial Officer\n\n[Foreign language]\n\nUnknown speaker\n\nOK. So I'll translate. In general, in the second quarter, more than 10% of our new funded accounts coming from Australia and New Zealand. We still make our efforts, such as sponsoring the local sport team, just to localize our products and services by adding more features that will give the local investors more control over the investment.\n\nSo in the meantime, still keeping the user experience simple and efficient. In addition, the ranking of the Tiger trade app rose to No. 31 by the end of the second quarter, which is higher among the online brokers in Australia. As a result, our newly registered users increased more than 80%, and the trading volume also doubled on a sequential business in Australia.\n\nWe keep fine-tuning our local marketing strategy and localized -- sorry, localization and we are confident that there will be more local users coming on board of Tiger platform.\n\nWu Tianhua -- Director and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nOK. So second question about our new clients acquired. OK. So basically, our internationalization is progressing very well.\n\nIn the second quarter, over 70% of newly funded users were acquired from overseas markets, in which about 20% of funding accounts came from Mainland China, more than 60% came from Singapore. And for the rest, 10% to 20% were from Australia and New Zealand. We do expect the proportion of new clients acquired in Australia and Singapore will increase in the second half year of 2022 alongside with our local development and expansion. Thank you, Cindy.\n\nCindy Wang -- China Renaissance Securities -- Analyst\n\nThank you. Very clear.\n\nOperator\n\nThank you. There are no further questions at this time. I'll now turn the conference back to Mr. Aaron Lee for closing remarks.\n\nUnknown speaker\n\nOK. Thank you, operator. I would like to thank everyone for joining our call today. I am now closing the call on behalf of the management team here at Tiger.\n\nWe do appreciate your participation in today's call. If you have any further questions, please reach out to our investor relations team. This concludes the call, and thank you very much for your time. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nUnknown speaker\n\nWu Tianhua -- Director and Chief Executive Officer\n\nJohn Zeng -- Chief Financial Officer\n\nHan Pu -- CICC -- Analyst\n\nJudy Zhang -- Citi -- Analyst\n\nCindy Wang -- China Renaissance Securities -- Analyst\n\nMore TIGR analysis\n\nAll earnings call transcripts"
}