{
  "companyName": "Greif",
  "companyTicker": "GEF",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/greif-gef-q3-2022-earnings-call-transcript/",
  "content": "Greif (GEF -1.21%)\nQ3 2022 Earnings Call\nSep 01, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to Greif's third quarter 2022 earnings conference call. [Operator instructions] I would now like to turn the conference over to Matt Leahy, vice president of Corporate Development and investor relations. Please go ahead.\n\nMatt Leahy -- Vice President, Corporate Development and Investor Relations\n\nThanks, and good morning, everyone. Welcome to Greif's third quarter fiscal 2022 earnings conference call. This is Matt Leahy, Greif's vice president of corporate development and investor relations. And I am joined by Ole Rosgaard, Greif's president and chief executive officer; and Larry Hilsheimer, Greif's chief financial officer.\n\nWe will take questions at the end of today's call. And in accordance with Regulation Fair Disclosure, please ask questions regarding issues you consider important because we are prohibited from discussing material non-public information with you on an individual basis. Please limit yourself to one question and one follow-up before returning to the queue. Please turn to Slide 2.\n\nAs a reminder, during today's call, we will make forward-looking statements involving plans, expectations, and beliefs related to future events. Actual results could differ materially from those discussed. Additionally, we'll be referencing certain non-GAAP financial measures and reconciliation to the most directly comparable GAAP metrics that can be found in the appendix of today's presentation. And now, I will turn the presentation over to Ole on Slide 3.\n\nOle Rosgaard -- President and Chief Executive Officer\n\nThanks, Matt, and good morning, everyone. Following on our formal introduction of the build to last strategy at our June investor day, we are very pleased to present our third quarter results. We delivered both earnings and EBITDA growth against the historically strong Q3 2021 comp and during the time of economic uncertainty, record inflation, continued supply chain pressures and the ongoing pandemic. We delivered third quarter adjusted EBITDA of $251 million and adjusted EPS of $2.35, but perhaps most impressively, we delivered a record single quarter adjusted free cash flow of $175.8 million.\n\nThese results are indicative of the build to last strategy, powerful value creation when executed effectively by our exemplary global Greif team. Our company has also achieved a milestone by ending the quarter below our target leverage ratio range, opening up significant opportunities to accelerate our capital allocation priorities and deploy capital to drive shareholder value and grow our business. Our confidence in the Greif team's ability to produce continued strong results had led us to raise our expected fiscal 2022 guidance, as Larry will discuss later. Please turn to Slide 4, to begin discussion of our detailed results.\n\nGlobal Industrial Packaging delivered an excellent third quarter. We continue to see solid demand across our global resin-based portfolio with plastic drums down low single digits and IBC's up 10% per day versus a strong prior-year comp. Global steel drum volume fell by mid-single digits per day versus the prior year on late quarter weakness in EMEA and APAC driven by customer challenges around raw material availability, supply chain and labor disruptions and inventory rebalancing, which impacted order patterns. Our North American end markets which remain stable and our LATAM business continues to outperform with strong volumes across the ag chem, citrus and lubricant end markets.\n\nAs a reminder, our GIP business benefits from a portfolio effect of mixed geographic product and end market exposures as discussed at investor day. Adjusted EBITDA decreased year over year by approximately $29 million. We are proud of our team's ability to largely offset multiple headwinds when viewed against the historically high performance of third quarter 2021. In addition to the absence of a $10 million contribution from FPS that benefited the previous year as well as a higher year-on-year incentive accruals, the team has also been excellent at taking steps to offset the previously discussed $100 million one-time full year 2021 benefits related to last year's historic run up in steel prices.\n\nMost of the impact of that tailwind occurred during the second half last year. Our teams also faced the continued headwinds of non raw material inflation, but were diligent in passing along costs ahead of the inflationary curve. Our global GIP team has exemplified relentless execution and discipline during these challenging times. Please turn to Slide 5.\n\nPaper packaging's third quarter sales rose by $131 million versus the prior year due to steady and solid volumes in all paperboard grades and higher average selling prices. Adjusted EBITDA rose by $42 million versus the prior year due to higher selling prices, partially offset by higher raw materials, notably at $10 million headwind related to higher OCC costs, higher incentives and the continued and substantial headwinds of transportation, labor and energy inflation. Third quarter volumes in our CorrChoice sheet feeder system were down three and a half percent per day compared to the historically strong Q3 2021 in line with industry box demand, but remain 10% above pre-pandemic levels. Third quarter Q and core volumes were down 2.4% per day versus the prior year due to softness mainly in film and textile end markets being partially offset with strength in our other key end markets as well as our growing adhesive business.\n\nAs some may know, we had a fire in one of our production lines at our Riverville Mill toward the end of July. Most importantly, we are happy to report that all of our colleagues are safe and unharmed from the event. Thanks to the dedicated efforts of those colleagues. The fire resulted in only 20 days downtime at one of our two lines at the mill.\n\nThe team did an excellent job of bringing the line back to operation in a short timeline. The time focused on that incident led us to determine we should defer our plans 13 days of maintenance downtime into next year. As a result of that shift, the fire will result in a loss of net seven days of production during the fourth quarter equal into approximately 9,000 tons that is factored into our fourth quarter guidance. I will now turn it over to our CFO, Larry Hilsheimer, on Page 6.\n\nLarry Hilsheimer -- Chief Financial Officer\n\nThank you, Ole. Good morning to everyone. Our third quarter results demonstrate our team's ability to perform despite substantial ongoing headwinds. Despite a combined $59 million of nonvolume-related raw material, transportation, labor and energy cost headwinds in the quarter, we delivered adjusted EBITDA of $251 million, well ahead of prior year.\n\nYou will note that our EBITDA growth was driven by our paper packaging business, which is exhibiting strength during a quarter where GIP was faced with several headwinds and a difficult prior-year comparison. The portfolio effect provided by these businesses act to create stability of earnings over the long-term for Greif, and this quarter is no exception. We have included in the appendix of today's presentation a slide from investor day, which displays this dynamic over the past seven years. During this quarter, we also grew earnings by over 20% with adjusted earnings per share of $2.35, and most impressively, produced record free cash flow of over $175 million during the quarter.\n\nThis cash generation provides proof of another of our core messages from investor day, the resilience of the Greif business system as a highly generative cash machine regardless of business cycles. Our teams are also executing below the line where interest expense was a year-over-year benefit to earnings of $0.12 a share as a result of our deleveraging efforts in a favorable refinancings. Tax expense was a $9 or $0.09 negative year-over-year earnings impact primarily due to higher income in the United States. Please turn to Slide 7.\n\nWe are again increasing our fiscal 2022 guidance as a result of our team's extraordinary efforts in continuing to live to deliver for our customers and managing well through an inflationary environment. We are raising the midpoint of our adjusted earnings per share guidance by $0.40 to $8 a share for fiscal 2022, reflective of our strong third quarter performance and confidence in our ability, our team's ability to deliver results to round out the year. We are also raising our free cash flow guidance for fiscal 2022 with a new range of $415 million to $445 million. Continued outperformance on the operating line, coupled with improving net working capital management and slightly lower capex is driving the upside.\n\nWe anticipate these net working capital benefits to continue to support strong free cash flow into 2023. Finally, you'll find a slide with key modeling assumptions in the appendix of today's deck for use as needed. Please turn to Slide 8. Reflecting back to our investor day and the promise we made to continue to provide value to shareholders, we are increasing our quarterly dividend by 8.7% to $0.50 on A shares and $0.75 on B shares.\n\nIn addition to raising our dividend, we continue to repurchase shares as announced at investor day. Our increasing dividend and commitment to share repurchases offer a compelling shareholder return opportunity. Furthermore, we have reached yet another milestone in delevering our balance sheet to below our target leverage ratio target. The strength of our balance sheet affords us the flexibility to pursue new opportunities to deploy capital opportunistically in the coming year.\n\nOur acquisition pipeline remains robust and we are excited about the opportunities to further grow our business. With that, I'll turn things back to Ole on Slide 9.\n\nOle Rosgaard -- President and Chief Executive Officer\n\nThanks, Larry. To sum up our thoughts, we are extremely proud of our team's performance in the past quarter. As discussed at our investor day, our focus and disciplined execution on the four missions of our build to last strategy ensures that we will deliver exemplary performance in any economic environments. Included in the appendix for today's presentation is a summary of our key messages from investor day.\n\nWe are confident in the ability for our build to last strategy to drive long-term value creation, and this quarter is a prime example of that strategy in action. Thank you for your interest in Greif. Operator, can you please open the line for questions.\n\nOperator\n\nCertainly. [Operator instructions] Our first question comes from Ghansham Panjabi from Baird. Please go ahead. Your line is open.\n\nUnknown speaker\n\nHi. This is actually Tom Diggins here in for Ghansham. Our first question, could you characterize fundamentals in PPS as you see them right now? We've seen containerboard momentum for the industry pull back somewhat recently. So I'm wondering how we should think about demand now and going forward relative to earlier this year?\n\nOle Rosgaard -- President and Chief Executive Officer\n\nWe saw toward the end of the quarter a slight weakening in demand, but I will stress that our demand is still solid and our backlogs are still around seven to eight weeks.\n\nUnknown speaker\n\nGot you. That's helpful. And then could you also characterize the macro in each region and also, how would you say dynamics have involved since yesterday? And then also any commentary around what you're seeing across the European customer base as it relates to nat gas shortages would be helpful as well?\n\nOle Rosgaard -- President and Chief Executive Officer\n\nSure. I could just -- we can walk around the world. If we start out in APAC, what we see out there is basically the effect of the continued lockdowns in China. Those lockdowns prevents transportation across the Chinese regions, and that puts damp on some demand.\n\nWe also see end markets like auto, like construction being affected. That means that there's less demand for paint, less demand for silicon, which all gets transported in our packaging and also the increased supply chain cost has an effect on the whole region. So that's really why we see weakening in that region. For Europe, for EMEA, we also see some weakening not to the extent of APAC at the moment.\n\nThat is really caused by several things. One is the conflict in Ukraine. It's the inflation and energy prices, gas restrictions that causes companies to basically take down capacity for cost reasons. We do see pockets in EMEA, where demand has remained strong, but in terms of in all the materials that goes into order production and some consumer goods are weak.\n\nIn North America, we see weakness to a lesser extent, but we do see the same picture in terms of auto, which has an effect on paint and some types of chemicals. LATAM is strong and overall, we see strong demand in ag chem, we see strong demand in food-related packaging as well.\n\nUnknown speaker\n\nThat's really helpful. Thank you.\n\nOle Rosgaard -- President and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nOur next question comes from George Staphos from Bank of America. Please go ahead. Your line is open.\n\nUnknown speaker\n\nYeah. Hi. This is actually Kashim Kila on for George today. So I guess just heading into '23, would you be able to provide any initial color on that for both segments and then what might be your biggest risk margins as well?\n\nOle Rosgaard -- President and Chief Executive Officer\n\n'23 is a long way off, yet particularly given the -- just uncertainty of the economic path here. I mean, obviously even the Fed is struggling with that. So I mean, we're working hard at building out our budget plans now, and we'll be well prepared to talk about that on the fourth quarter call.\n\nOperator\n\nOur next question comes from Adam Josephson from KeyBanc Capital Markets. Please go ahead. Your line is open.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nOle, Larry, Matt, good morning. Hope you're well. Thanks very much for taking my questions. Larry, would you mind just going through your volume trends by month in the quarter as well as in August, in other words, compared to the down 2.8 in fiscal 3Q, can you tell us what each of the three months was as well as what August was and relatedly, what your volume expectation for 4Q is embedded in your updated full year guidance?\n\nLarry Hilsheimer -- Chief Financial Officer\n\nYeah. We -- like we had talked at investor day where May and June were, so they weren't showing really any signs of weakness. Things tailed off a bit in July leading to the results we published. As we look at August, it continues the trend that we saw in July.\n\nAnd Ole went through where we're seeing steel sort of -- yes, it's looking down that mid-single digits kind of number on steel. IBCs remain positive up even in August. And our sheet business remain strong in paper as we mentioned. Our backlogs are still close to eight weeks in our paper business.\n\nSo a lot of mixed signals, Adam, but overall, things are a little weaker, but nothing that is overly concerning at the moment.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nI appreciate that. And just related to Ole, the comment about the seven to eight week backlogs in your paper business, obviously your volumes were down in fiscal 3Q, obviously you took your OCC guidance down by $10 a ton. Can you tell me like what you're expecting in terms of the OCC decline in September and relatedly, if your backlogs are still strong in your paper business, why do you suppose OCC prices would be falling by as much as they are?\n\nOle Rosgaard -- President and Chief Executive Officer\n\nYes. We built in -- it's 127 in August, then we reflected going down to 107 for September and October. You are seeing people taking a lot of different maintenance downtime within the industry. And I do think that there is some weakness out there that's driving down demand a bit in the paper industry, but we continue to do well against our specialty businesses.\n\nOur URB and CRB businesses are continue to be strong. There are some pieces that are showing weakness, but others not. I mean, you've got residential construction while you may see housing starts down, you still have housing completions up year over year over a strong '21. Actually permits went up in July year over year.\n\nSo we're seeing, for example, if you look down in our URB business, carpet and floor, cores and roofing cores are actually up 6% and 12% August-over-August. You got now construction tubes, which goes more into commercial construction is down 6%. So it's just a mixed bag across the portfolio. And like I said, on balance still pretty good for us.\n\nLarry Hilsheimer -- Chief Financial Officer\n\nAnd Adam, when you follow housing, you have to remember that when you sign a contract to build a house, that house will be built from now and then nine, 12 months into the future, and you can't stop that. So you will see demand for housing-related products continue well into 2023.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nThank you, Ole.\n\nOperator\n\nOur next question comes from Mark Wilde from BMO. Please go ahead. Your line is open.\n\nMark Wilde -- BMO Capital Markets -- Analyst\n\nThanks. Good morning, Ole. Good morning, Larry.\n\nOle Rosgaard -- President and Chief Executive Officer\n\nHey, Mark.\n\nLarry Hilsheimer -- Chief Financial Officer\n\nGood morning, Mark.\n\nMark Wilde -- BMO Capital Markets -- Analyst\n\nOle, can you just talk with us a little bit first about how you think about your ability to hold onto these recycled boxboard price gains? I've kind of lost track at this point, but it seems like we've got about $400 to $450 worth of price hikes out there in the last 18 months. And if OCC is a little over a $100 right now, that's really not terribly much higher than it was two or three years ago. So it seems like you've picked up quite a bit of spread there. And I'm just curious about your ability to retain that spread and how you think about that?\n\nOle Rosgaard -- President and Chief Executive Officer\n\nThe way I think about it, Mark, is really it's a supply and demand issue. I mean, that's way I put it very simple.\n\nMark Wilde -- BMO Capital Markets -- Analyst\n\nOK. And can you also -- can you talk a little bit around your leverage targets and whether you might be willing to operate below the low-end, below that two times number for some extended period of time?\n\nLarry Hilsheimer -- Chief Financial Officer\n\nYeah. Mark, we don't find that terribly capital efficient, but we're not going to be crazy to deploy the capital and chase things that don't make sense. So to the extent that there is nothing for us to acquire that is attractive, we could see that fall some. But as I mentioned in my prepared remarks, our acquisition pipeline is very robust.\n\nWe are looking at a number of things. We'll remain disciplined in deploying that capital. But yes, if we don't execute on any of those, I could see us being down for a while so that we have that dry powder to do things. And then we'll continue to look at returning more and more capital to our shareholders to the extent that we don't.\n\nBut -- so we're not going to be rash about it, but I wouldn't anticipate us linger -- falling dramatically below that for a long period of time.\n\nMark Wilde -- BMO Capital Markets -- Analyst\n\nOK. And finally, Larry, just on the M&A front, can you just give us a sense of what you're seeing out there from sellers because it's clearly a really tough financing market for the private equity buyers. In fact, it seems to me it's kind of frozen at this point. I'm just curious if you're seeing an awful lot of sellers just pull back from the market right now.\n\nLarry Hilsheimer -- Chief Financial Officer\n\nWe're not. We're actually seeing lots of opportunities, but they're not huge opportunities. I mean, we're not talking Caraustar size deals, Mark, by any stretch. But we look at this as an opportunity for us, obviously the extent that they're having more difficulty in financing, we don't have any trouble financing, we have the drypowder to be able to do this very rapidly, and we'll take advantage of that in the market to the extent that we're able to find transactions that make sense for us and that fit our target objectives.\n\nMark Wilde -- BMO Capital Markets -- Analyst\n\nOK. Thanks, Larry. I'll drop back in the queue.\n\nOperator\n\nOur next question comes from Michael Hoffman from Stifel. Please go ahead. Your line is open.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nHi. Thank you for taking the questions. So I'd like to tackle the overall commodity book and you've alluded to fiber, the OCC trend, but could you share with us your thoughts about your mix of resins, steel trends going into 4Q and how we think about that comparative year over year?\n\nOle Rosgaard -- President and Chief Executive Officer\n\nHi, Michael. This is Ole. Are you thinking of like raw material prices?\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nYes. Yes.\n\nOle Rosgaard -- President and Chief Executive Officer\n\nSo we have obviously seen a steady, but not dramatic decline in raw materials over the periods. We expect to see a continued sort of slight decline of raw materials toward from now and toward the end of the year, we don't expect anything dramatic on that front at all. And that goes to both steel and resin.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nOK. That's good to know. And then on the -- Larry, on the capex side, is the intention that that gets rolled into next year, is this a supply chain issue and that's -- you are trying to deploy it, but you can't find the things you want to buy, just to understand why?\n\nLarry Hilsheimer -- Chief Financial Officer\n\nYeah. That's it, Michael. And it's a bit frustrating for us because that's been a continuing story for the last three years, unfortunately. Three years ago, it was sort of a unique situation on a large piece of equipment, but then last year as the supply chain difficulties became more pronounced then that became an issue.\n\nWe thought until like three weeks ago that we were still going to be in good shape on not having to lower our capex spend this year, but then we got told some equipment wasn't going to come in. So yeah, it's all supply chain related. It's not anything related to desire or capability. And so it will go into next year and we do have plans as we've announced about having it a new Texas sheet feeder next year.\n\nSo that's a major capital spend, that'll fall into the guidance we'll give for next year.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nOK. And if I can just tweak out a little then, given the trend, I guess, you're not giving guidance, but just so everybody's modeling intelligently, given the trend on the raws by definition numbers year over year or tighter, we're having a flat to slightly down conversation, which nobody should be surprised about, but that's the way to think directionally.\n\nLarry Hilsheimer -- Chief Financial Officer\n\nYeah, I think that's the way to think about it. The one thing that I would talk is, as that occurs, cash generation just goes up. I mean, because the need for working capital declines, the collection on receivables and those things play out. So as you would expect, when we modeled out doing the stock repurchases and the dividend increase, we modeled out a bunch of scenarios and even in a really tough drop, which we don't anticipate.\n\nI mean, we are talking 20% declines in EBITDA over the next couple years. We still are just printing cash and getting our leverage ratio will remain down below our target range, even if we do some decent size acquisitions. So yes, we may see that fall off in earnings if the economy goes south, but cash flow is going to be strong.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nGot it. Thank you very much.\n\nOperator\n\nOur next question comes from Gabe Hajde from Wells Fargo. Please go ahead. Your line is open.\n\nGabe Hajde -- Wells Fargo Securities -- Analyst\n\nOle, Larry and Matt, good morning. \n\nOle Rosgaard -- President and Chief Executive Officer\n\nHey, Gabe.\n\nGabe Hajde -- Wells Fargo Securities -- Analyst\n\nReal quick, as we think about, I guess, energy volatility and what could happen over the winter months, can you give us any sort of framework in terms of regional profitability to the extent that you have to, your customers perhaps move where they're manufacturing their product and any potential capacity limitations that you might have? And again, I don't know specifically, but for example, in Germany, if someone is trying to make X, Y, Z product and they choose to make it in the United States, again, to the extent they have the capability, anything that we should be mindful of that that could impact profitability.\n\nLarry Hilsheimer -- Chief Financial Officer\n\nYeah, I think that I wouldn't -- I don't think you'll see a lot of that Gabe, I think to the extent that we see movement, generally you'll see, like in May, it might move to -- we've seen things move to Saudi Arabia before and our plants down there. We see things move oftentimes in China, but China is difficult right now, obviously with all the shutdowns they have there. But the extent that they would move to the United States for us that's a very good answer. That'd be like really good, but we just -- we haven't seen much of that in the past.\n\nI think the migration would be more the kind that I just mentioned. I don't know if you have other thoughts on that.\n\nOle Rosgaard -- President and Chief Executive Officer\n\nNo. And then also just remember, if we talk about our sales, so our mills, they consume 70% of our energy and that's in the U.S. and we obviously have no energy issues with supply here. It's more in Europe, you see that.\n\nGabe Hajde -- Wells Fargo Securities -- Analyst\n\nAll right. Thank you. And then just one quick one to dial in, I guess this fire issue, which was fortunate that no one was injured. 9,000 tons of downtime, if I assume maybe $300 a ton of under absorbed fixed overhead, maybe a $3 million headwind or so to fourth quarter, is that -- I mean, what maybe less than five? Is that fair?\n\nLarry Hilsheimer -- Chief Financial Officer\n\nYeah. That's roughly, and obviously it's already built into our guidance. Gabe, we didn't build anything into the fourth quarter for any kind of business interruption recovery because we don't know the timeline of when that might occur. We're obviously working on that, but we've got high deductibles against that stuff anyway, so it's not going to be substantial.\n\nSo I didn't put anything in for that.\n\nGabe Hajde -- Wells Fargo Securities -- Analyst\n\nOK, thank you.\n\nOperator\n\nOur next question comes from Justin Bergner from Gabelli Funds. Please go ahead. Your line is open.\n\nJustin Bergner -- Gabelli and Company -- Analyst\n\nGood morning, Ole. Good morning, Larry.\n\nOle Rosgaard -- President and Chief Executive Officer\n\nHey, Justin.\n\nLarry Hilsheimer -- Chief Financial Officer\n\nGood morning, Justin.\n\nJustin Bergner -- Gabelli and Company -- Analyst\n\nOn past calls, you've bridged the change in guidance from one quarter to the next. And I was wondering if you might be able to do that for the earnings guide, maybe breaking it down into sort of the benefit from lower OCC below the line -- other factors and maybe for free cash flow, if you could do the similar thing between operating capital and capex?\n\nLarry Hilsheimer -- Chief Financial Officer\n\nHappy to do it. So yeah, so our guidance for that midpoint was $7.60 on Q2, operations other than our paper business price and OCC, which I'll break out separately. So operations across both businesses driven mostly by GIP was a pickup of about $0.17, PPS pricing on mix because we had built in price increases that we knew we had already announced and executed, but the mix left us was about $0.12 pickup. The OCC dropped relative to what we had built in before, it came out at 143 a ton versus 152.\n\nWhat we had in is $0.24. Interest expense on some of the variable part of our interest expense is $0.05 bad guy. Some other expenses just unrealized that currency loss, that kind of thing was $0.06 and tax and other was $0.02 all, so five, six and two on the negative. So that should walk you from $7.60 to $8.\n\nI'll pause and see if you get all -- did you get all that?\n\nJustin Bergner -- Gabelli and Company -- Analyst\n\nYeah, that's great. The positive operations across the businesses mainly GIP that's $0.17. Could you just provide a little bit more color there? Was that just better execution, better volume?\n\nLarry Hilsheimer -- Chief Financial Officer\n\nYeah, really disciplined execution on selling prices relative to non raw material price increases, and we got a little bit of benefit of some timing on the decline in some of the steel that played well for us. So minor amounts there, so just the combination of those things. And then in PPS, some more integrated times where we have -- it plays out better for us in our specialty products in our CorrChoice operation and our tube and core business. So combination of all those things amounted to that $0.17 lift.\n\nJustin Bergner -- Gabelli and Company -- Analyst\n\nOK, great.\n\nLarry Hilsheimer -- Chief Financial Officer\n\nCash flow side, I'll do the same walk. So we started it, 410 was the guidance. That same operation, it's going to be the same elements obviously, but $1.9 million on those operations, 7.1% on the pricing, 14.5% on OCC, interest expense down 3.2%. Adjusted capex was up because we spent less than we expected to 6.6 and -- or we are going to spend less than we expected as I just discussed.\n\nAnd then other things, cash taxes, other miscellaneous stuff is a negative 6.9.\n\nJustin Bergner -- Gabelli and Company -- Analyst\n\nGreat. Thank you for all that detail. Second question I had was on repurchases. So you repurchased $60 million in the quarter.\n\nI assume the 10-Q will speak to sort of the price at which you repurchase. I mean, should we think of that -- I mean that's not a significant amount of dollars relative to your mark capitalization. Should we think of that as something that you will continue to do in subsequent quarters unless the M&A activity picks up or was it more one-time?\n\nLarry Hilsheimer -- Chief Financial Officer\n\nNo. We had announced at investor day that we did -- we executed on the $75 million ASR program. So if you look at our cash flow statement, you actually see a two entries related to it. And it breaks it into pieces of $60 million and $15 million and you get delivered 80% of that on the day one and that stuff impacts earnings per share.\n\nAnd I'll come back to that impact in a minute. You don't really know the price that ultimately gets paid until the ASR program gets filled out, which will happen over the rest of this year. And then we also plan to do another $75 million in open market, which probably be about two-thirds B shares, and one-third A shares, but that'll play out how it plays out in the market. Coming back to the earnings per share impact, $0.01 a share in this quarter of lift on earnings per share another $0.03 in Q4, so $0.04 for the whole year.\n\nAnd if it plays out the way we think it is. On that first $75 million will be about $0.15 for the whole year next year. We'll execute on the other $75 million open market. Hopefully, it has way less impact per share because hopefully our stock price goes up and it costs us more money to buy it back.\n\nJustin Bergner -- Gabelli and Company -- Analyst\n\nGreat. That's very helpful as well. And then just lastly, the $100 million headwind from price cost versus the benefit in '21, is that still sort of the right number? Has it become a little bit larger or smaller?\n\nLarry Hilsheimer -- Chief Financial Officer\n\nNo, no. That number was fixed. I mean that was what we got out there rapidly increasing prices last year, that just wasn't going to repeat this year and didn't. And yes, we've lost more than that as we've gone through the year just in a normal playback through volume decreases and stuff, but now the $100 million is fixed number.\n\nJustin Bergner -- Gabelli and Company -- Analyst\n\nOK, great. Thank you.\n\nOperator\n\nOur next question comes from Adam Josephson from KeyBanc Capital Markets. Please go ahead. Your line is open.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nThanks very much. Larry, just one follow-up on the volume question I had earlier, which is, if you were down 3% in 3Q, July was the worst. And then you said, I think August was trending fairly similarly to July. Should we assume that July was down 5% if not more as was August?\n\nLarry Hilsheimer -- Chief Financial Officer\n\nLet me look here. Adam, I'm looking at...\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nYeah, thanks. I could ask another one.\n\nLarry Hilsheimer -- Chief Financial Officer\n\nI don't remember what July was down. Actually, I don't even -- do you know that Matt?\n\nMatt Leahy -- Vice President, Corporate Development and Investor Relations\n\nI don't have that in front me here now.\n\nLarry Hilsheimer -- Chief Financial Officer\n\nBut I mean, if I look at August versus July on steel globally, it's upper, single, mid to upper single digits, but I hesitate on that because so much of it is driven b China and just what's slowed down there. I mean, it's...\n\nOle Rosgaard -- President and Chief Executive Officer\n\nWhat we also have to remember, Adam is the -- we are obviously pushing our inventories down, but so our customers and that comes to point where you just need to replenish your inventories. So whether it's 50%, I don't know, but there's an element of that. So you will see customers starting to -- once they come to the end of that cycle, starting to increase their purchase again or that demand again.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nRight. No, I'm just trying to figure out what a reasonable volume expectation is for fiscal 4Q, in other words, what is embedded in your guidance? I assume it's down more than 3%. But I obviously don't know that?\n\nLarry Hilsheimer -- Chief Financial Officer\n\nWell, yes. I said mid-single digits, yes.\n\nOle Rosgaard -- President and Chief Executive Officer\n\nIt's about that. \n\nLarry Hilsheimer -- Chief Financial Officer\n\nIt's on steel and plastics. So that's about it right now.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nOK. I was talking total company, but OK, yeah. And then with -- regarding Mark asked about the sustainability of these URB and containerboard prices given what's happening to OCC prices and the historic spread between the two and your response to those it's all supply demand. So volumes are falling in tubes and cores and in containerboard.\n\nSo is it reasonable to think in light of that, that these -- I mean, based on the demand trends that you're seeing in tubes and cores and containerboard. Is there any reason to think that these prices are sustainable?\n\nLarry Hilsheimer -- Chief Financial Officer\n\nI mean, we don't comment on future prices, Adam. I mean, you can obviously make your assumptions. We're very comfortable that our business is going to continue to operate well, we're going to obviously try our best not to give up price because it's very valuable to us, but to the extent that, demand drops dramatically in the market, yes. I mean, it's going to follow supply demand.\n\nSo if you're projecting that demand's going to drop, I think it's not an unreasonable expectation that prices would at some point come down.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nYeah. Just one last thing along those lines and I appreciate that is, is URB versus containerboard, URB has historically been more economically sensitive than containerboard because a lot of containerboard goes into food and beverage and other non-durables. What do you think a reasonable expectation is for URB versus containerboard demand, if we are going into a pretty meaningful recession over the next year or so?\n\nLarry Hilsheimer -- Chief Financial Officer\n\nI mean our URB, the end markets it goes into is extremely diverse. I mean, if you go back and you look at the pie chart stuff that we've provided over time, I mean, it's extremely diversified. But it's different than containerboard. I mean there is a lot of differences in the end market, so I don't think they correlate that that closely.\n\nAnd I don't think it is fair to assume that they're worse.\n\nOle Rosgaard -- President and Chief Executive Officer\n\nAnd Adam just...\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nYeah. Go ahead Ole, sorry.\n\nOle Rosgaard -- President and Chief Executive Officer\n\nYeah, just two points. As we also explained during investor day, we balanced that portfolio. So we have lesser extent of containerboard in our overall portfolio. And that's the comment on demand.\n\nSo URB demand is stable, which indicates that there's no -- there will be no price pressure, at least at the moment. And also CRB you have strong demand.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nWhereas in containerboard, Ole? Demand?\n\nOle Rosgaard -- President and Chief Executive Officer\n\nI didn't comment on containerboard.\n\nLarry Hilsheimer -- Chief Financial Officer\n\nMaybe our -- we've talked about our backlogs. Backlogs remain the same through -- yeah.\n\nOle Rosgaard -- President and Chief Executive Officer\n\nExactly. Yeah.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nOur next question comes from Mark Wilde from Bank of Montreal. Please go ahead. Your line is open.\n\nMark Wilde -- BMO Capital Markets -- Analyst\n\nNow we get the right country. Listen, Larry, can you give us any color on just where you're thinking about the best internal reinvestment opportunities? Other words, if you're going to invest kind of on projects -- capital projects in your existing businesses over the next two or three years. What's that going to be focused on? Is it more sheet plants? Is it some mill upgrades? Is it IBC build outs? What would that pie chart look like?\n\nLarry Hilsheimer -- Chief Financial Officer\n\nYeah, I mean, Mark, if we go back and appreciate you weren't at investor day, for a very good reason, at least from my opinion. But we're going to do this sheet feeder in Texas, which is a significant span next year. We'll get us over integrated in the containerboard space. We're going to spend -- continue to spend in the IBC space.\n\nIt's a primary focus of us. Small plastics, think Jerrycans and that expanding our business from where we have in isolated places around the world where we're very attractive business for us, you'll see us spending more and more on automation in just recognizing of course labor components and upgrading our facilities, those kind of things. Those are the primary focuses. Did I miss anything?\n\nMark Wilde -- BMO Capital Markets -- Analyst\n\nOK. And I'm just curious, are there any opportunities you think that potentially recapitalize in the URB business? I mean, if you look at sort of across the industry, there are a lot of old cylinder machines that are probably 80 or 90 years old. And so I'm just curious about the potential to perhaps recap some of that capacity.\n\nLarry Hilsheimer -- Chief Financial Officer\n\nYeah, it's something that we looked at. Mark, I would say to you that our team has not yet been able to convince me that the returns from that type of investment on a wholesale basis make any sense for us. People like to play out 20 and 30-year curves and you modify one assumption and eighth of a percent and it changes the answer. And so I mean, we will continue to examine it and we will spend money to the extent needed to make sure that the plants continue to operate well.\n\nAnd we'll continue to explore whether something of the nature you mentioned makes sense, but so far it hasn't.\n\nMark Wilde -- BMO Capital Markets -- Analyst\n\nOK. Sounds good. Thanks. Good luck in the fourth quarter guys.\n\nLarry Hilsheimer -- Chief Financial Officer\n\nThanks, Mark.\n\nOperator\n\nOur next question comes from Michael Hoffman from Stifel. Please go ahead. Your line is open.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nThank you for the follow-up. A lot of questions with regards to the economy and supply demand. How do you think of your own channels and what's in your sort of channels as far as inventory, what your customer channel looks like and then what your competitor channels look like that ultimately will be the major shock if there's -- if we're overstuffed.\n\nLarry Hilsheimer -- Chief Financial Officer\n\nYeah. I mean, we have some places in the world, Michael, where we had some excess inventory related to concerns about supply chain. We have been working that down and we'll continue to do so that obviously it was one of the big drivers of cash flow in this quarter year over year versus a dramatic improvement in working capital and that focus will continue. In terms of inventories of our product in customers, we don't have that many customers who actually keep much of our inventory because you're basically storing air.\n\nWhen you think about it, empty steel drums, empty plastic drums, we do have some customers who actually store them in semi-trailers and some of them, they pay us rent for them actually, while they keep them. But that's a small portion of what we have. And I'd say the same thing relative to our competitors in that space. You just don't store that much.\n\nAnd the same goes on the containerboard side, I mean the box plants don't store a lot of paper waiting to use it. It's more real-time.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nSo the channels aren't over stuffed. So this really comes down plainly to what your perception is about economic cycle?\n\nLarry Hilsheimer -- Chief Financial Officer\n\nYeah. I mean, Ole mentioned that we did have some impact of some supply destocking in the limited group of customers that I mentioned that do store some of our inventory. But we think that's coming to the end and so we would expect order patterns to pick back up, offset by any further drop in the economy.\n\nOle Rosgaard -- President and Chief Executive Officer\n\nYes, those inventories are safe to stock Michael, so they're not huge. So then they'll come to an end shortly.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nThat's very helpful.\n\nOperator\n\nWe have no further questions. I would like to turn the call back over to Matt Leahy for closing remarks.\n\nMatt Leahy -- Vice President, Corporate Development and Investor Relations\n\nGreat. Thanks everyone for joining today. Hope you found the call helpful. Have a safe and enjoyable week.\n\nAnd thank you again. Take care.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMatt Leahy -- Vice President, Corporate Development and Investor Relations\n\nOle Rosgaard -- President and Chief Executive Officer\n\nLarry Hilsheimer -- Chief Financial Officer\n\nUnknown speaker\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nMark Wilde -- BMO Capital Markets -- Analyst\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nGabe Hajde -- Wells Fargo Securities -- Analyst\n\nJustin Bergner -- Gabelli and Company -- Analyst\n\nMore GEF analysis\n\nAll earnings call transcripts"
}