{
  "companyName": "Herbalife",
  "companyTicker": "HLF",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/herbalife-hlf-q3-2022-earnings-call-transcript/",
  "content": "Herbalife (HLF 1.29%)\nQ3 2022 Earnings Call\nOct 31, 2022, 5:30 p.m. ET\n\nOperator\n\nGood afternoon, and thank you for joining the third quarter 2022 earnings conference call for Herbalife Nutrition Limited. On the call today is Michael O. Johnson, the company's chairman and interim CEO; Alex Amezquita, the company's chief financial officer; and Eric Monroe, the company's senior director, investor relations. I would now like to turn the call over to Eric Monroe to read the company's safe harbor language.\n\nEric Monroe -- Senior Director, Investor Relations\n\nGood afternoon. On today's call, we will be making some forward-looking statements. And while we are making these statements in good faith, we do not have any guarantee about the results we will achieve. Descriptions of our risk factors are included in the documents we filed with the SEC.\n\nWe will also be discussing some non-GAAP financial measures. These non-GAAP and adjusted numbers refer to measures that exclude items management believes impact the comparability for the period referenced. Please see the earnings release for additional information on our comparability items. These GAAP to non-GAAP reconciliations can be found in the earnings press release and the slides that we will be reviewing on today's call, both of which can be found on the investor relations section of our website.\n\nI will now turn the call over to chairman and interim CEO, Michael Johnson.\n\nMichael Johnson -- Chairman and Interim Chief Executive Officer\n\nThanks, Eric, and good afternoon, everyone, and thank you for joining us on the call today. It's great to be back on this call with you and to be stepping back into my former role as chairman and interim CEO. I'm honored to be in this role again for this great company that I am so passionate about. As interim CEO, my focus will be in two key areas: first, to rebuild sales momentum at Herbalife Nutrition; and second, succession management.\n\nI will be working closely with the board to help select and mentor the future leader of the company who will propel us toward the future. Since I left the CEO role in 2020, the progress we have made broadening our product portfolio, investing in our technology platform, and embarking on the transformation of our operational capabilities is truly remarkable. At the same time, we've had to navigate an unprecedented time in the world as global economies are impacted by the onset, persistence, and aftermath of a global pandemic. Herbalife Nutrition has not been immune to the dramatic ups and downs that companies and societies have faced during these times.\n\nHowever, over Herbalife Nutrition's 42-year history, in my nearly 20 years at the company, we have overcome many similar challenges, including recessions and periods of economic uncertainty. This company's resilience is not only founded in the global megatrends that demand better nutrition around the world, but also in the economic opportunity that affords individuals the potential to supplement their income. We have seen how the entrepreneurial spirit of our distributors have developed new successful sales strategies in both good times and in tough times as individuals look to the Herbalife Nutrition business opportunity for supplemental or even full-time income. As you know, I am extremely familiar and respectful of our incredibly capable leadership team that we have overseen our strategies.\n\nAnd I'm confident that we're not going to miss a beat. I have been working closely for over a decade with our CFO, Alex Amezquita; chief operating officer, Mark Schissel; and of course, my good friend and executive vice chairman, John DeSimone, among others, in this great management team. I'm incredibly proud of this team and their hard work and commitment to our goal of being the world's premier nutrition company. Let me turn the call over to Alex, who will give you details of our quarter. \n\nAlex Amezquita -- Chief Financial Officer\n\nThank you, Michael, and I'm incredibly thrilled to be working with you once again. Now to the six key points that we would like attendees to take away from our call today. First, third quarter volume points of $1.6 billion were down 10.7% compared to the prior year, which was above just the midpoint of our Q3 guidance range. However, the significant strengthening of the U.S.\n\ndollar during the quarter, as well as the geographic mix of revenue resulted in net sales down 9.5%, which was below our expectations. Note that FX headwinds from the stronger U.S. dollar has had a significant impact on Q3 results, and consistent with the headlines you have likely seen in the financial press. Second, despite the net sales shortfall, focused expense management efforts in the quarter contributed to adjusted EBITDA above our Q3 guidance range and adjusted EPS near the high end of our range.\n\nThird, we experienced a softening of sales through a result of the current economic backdrop, as well as the significant off-cycle pricing actions that took place in June for many markets around the world. We anticipate these trends could continue into the fourth quarter. Fourth, significant strength in India buoyed a global softening of key metrics for active sales leaders and new member counts. We are keenly focused on improving our distributor metrics with Q4 promotions specifically designed on addressing new member counts.\n\nFifth, while we focus on protecting the bottom line in the near term, we continue to invest for our future growth, including our Herbalife ONE platform we referenced last quarter. And sixth, while we anticipate trends that emerge in the third quarter to persist into the fourth quarter, we are not able to forecast in an environment with such rapidly shifting consumer behaviors and volatility in the world at large. As such, the company is withdrawing fiscal year '22 guidance. We will revisit our ability to provide 2023 guidance at our next earnings call in February.\n\nNow focusing on Q3 results. Reported net sales for the third quarter declined 9.5% compared to the prior year. Despite hitting our volume projections, the strengthening of the U.S. dollar during the quarter drove a 600-basis-points currency headwind to net sales compared to prior year.\n\nReported net income of $82 million resulted in adjusted EBITDA of approximately $183 million, which was above the high end of our guidance range. Adjusted EBITDA margin in the quarter was 14.1%, exceeding expectations. Reported EPS of $0.83 resulted in adjusted earnings per diluted share of $0.91, which was near the high end of our EPS guidance range. Reported and adjusted EPS were both negatively impacted by a year-over-year currency headwind of approximately $0.18.\n\nDuring the third quarter, as previously communicated, the company strategically reduced $50 million of our outstanding debt. We ended the quarter at 3.5 times gross debt to EBITDA, which was above our target leverage ratio of 3.0 times. I'll discuss capital allocation going forward in a moment. Drilling into net sales.\n\nWhere we benefited from 10.3 percentage points of pricing from the combination of our CPI-linked price increases we implemented primarily in the first quarter, as well as the 10% global price increase most markets implemented in June. Unfavorable country mix, primarily driven by significant outperformance in India, resulted in a net sales headwind of approximately 310 basis points. The U.S. dollar strengthened significantly against most major currencies during the third quarter and had an impact on our Q3 results.\n\nFX was a 600-basis-point headwind to net sales. Moving to margins, where adjusted EBITDA of $183 million resulted in an adjusted EBITDA margin of 14.1%, which outperformed our margin expectations for the quarter. EBITDA benefited 270 basis points from the significant price increases we've taken this year, while geographic mix of revenue and other was a headwind of 50 basis points, largely due to the continued strength in India. Although gross profit of 78% in the quarter was a sequential improvement, it drove an EBITDA margin headwind versus prior year of approximately 200 basis points, primarily driven by increased input costs in our supply chain.\n\nWithin SG&A, we experienced an approximate 120-basis-point headwind related to promotional spend. This headwind was largely due to the return of in-person events in most regions, as well as the return of more normalized promotional spend. Recall, in 2021, our distributor promotions were significantly disrupted because of the pandemic. We continue to see the positive impact of cost savings in labor and benefits.\n\nDuring the third quarter, we benefited by approximately 40 basis points of EBITDA margin expansion due to the efficiencies and targeted strategic improvements, leading to favorable margin impact, even after absorbing the impact of annual merit increases. As mentioned earlier, currency had a significant impact and led to an additional 80 basis points of headwind on EBITDA margins. For the quarter, average active sales leaders of approximately 482,000 was 5% under last year and slightly improved from Q2. Q3 performance was supported by the continued outperformance of India.\n\nExcluding India, active sales leaders declined 2% versus the second quarter. Similar trends were seen in our new distributor and preferred customer metric. While the Q3 metrics slightly improved as a whole compared to the second quarter trends, excluding India, new distributor, and preferred customers joining the business declined single digits sequentially compared to the second quarter of '22. The sequential declines we experienced in the new distributor and preferred customer metric is a key focus area for management.\n\nWe have market-specific actions in place for improving this metric with several near-term strategies already underway. For example, in both Mexico and Korea, we have implemented promotions around new distributor sign-up kits. And while early, we observed positive results and observed a month-to-date sequential increase in October over September, up 91% and 21% in Mexico and Korea, respectively. Turning to our regional results.\n\nI'd like to call out that our operational segments have been reduced from six to five as our previous segments of Mexico and South and Central America are now combined into the Latin America segment. Also, a few highlights from APAC and EMEA. The Asia Pacific region had another quarter of growth, up approximately 10% compared to the prior year. The region was led by continued strength in India, which grew 37%, and Vietnam, which was up 30%.\n\nCertain markets in the region were adversely impacted in the third quarter by accelerated purchases in the second quarter, ahead of the significant price increases effective during June. As one of our more price-sensitive regions, we will continue to monitor the impact that price increases have had on APAC's volume from an elasticity perspective. The EMEA region saw a 9% decline in local currency net sales, which was materially amplified by 14 points of currency pressure in the quarter, resulting in reported net sales of down 23%. Turning to capital allocation and our cash position.\n\nOur long-term use of cash prioritization as a company remains unchanged. As always, our No. 1 priority is to service our debt. And as I mentioned earlier, during the third quarter, we strategically reduced our debt by approximately $50 million as we remain prudent with cash, given the difficult macroeconomic backdrop.\n\nGiven the persistence of this difficult macroeconomic landscape, the company plans to reduce debt by an additional $50 million in the fourth quarter, reallocating funds that were previously earmarked for share buybacks to reduce our debt. Turning to cash. While our cash generation ability remains strong, year-to-date, for 2022, we have generated approximately $299 million of operating cash flow. We currently have $532 million of cash on hand.\n\nAs Michael started out on the call by saying, over our 42-year history, we have overcome numerous macroeconomic challenges. And while we are not satisfied with this quarter's results, we do remain confident that the resilience of our business and the strategic actions we are taking will help us significantly emerge from the current macroeconomic environment. This concludes our prepared remarks. Operator, please open up the line for questions. \n\nOperator\n\nThank you. [Operator instructions] Please stand by while we compile the Q&A roster. Our first question comes from the line of Chasen Bender with Citi. Your line is open.\n\nChasen Bender -- Citi -- Analyst\n\nGreat. Thanks for me and good afternoon, everyone. Where I'd like to start is just on the leadership change. Obviously, any time there's a change at the top, it can be a little bit disruptive to culture.\n\nAnd I just wanted to give you an opportunity to expand on the change and maybe offer why now was the right time for John to be leaving the company.\n\nMichael Johnson -- Chairman and Interim Chief Executive Officer\n\nSo, the -- this is Michael, incidentally, and welcome, we haven't had a chance to meet yet. You're right, most management changes are highly disruptive. The unusual part of this one is this is a three-peat. I am returning back to a company I love from the board of directors.\n\nWe decided to make the change in order to provide a spark. We have spent all morning on the phone with our leadership in the field, our management team, and our employees, and I'm trying not to -- I got to be careful talking about my own receptivity in here because it sounds a little egocentric, but the reception has been extremely warm. I've maintained relationships with our leadership for the time I've been away from the company because I've got a lot of friends in that team. I've maintained the relationship with management here because we are friends, too.\n\nAfter 20 years working in a company, you don't just build professional relationships, you build personal relationships. Bringing my professional relationship back inside this time allows me to expand on the personal relationships I have and create, hopefully, an energy and a motivation that will lift the top-line sales of this company to where we want them, to serve our -- all of our stakeholders, our customers, our employees and especially, our shareholders, so they can benefit from the hard work of the team in the field. So, while it usually is disruptive, I think this has actually a little different pace to it, a little different feel. I don't think it's a disruption.\n\nI think it's a continuation of the momentum that we created with the team almost 20 years ago. And we're looking forward to building it stronger in the future.\n\nChasen Bender -- Citi -- Analyst\n\nGotcha. Perfect. Thank you for that color. And then, Alex, maybe one for you.\n\nCan you maybe just expand on the rationale for why you're withdrawing guidance? I mean, I get the macro is tough, and there's a lock in China, conflict in Ukraine, inflation pressures, you name it, but these aren't new issues per se. And with just two months left in the year, I guess I'm wondering, why pull guidance now? What does this really mean in terms of your ability to forecast the business?\n\nAlex Amezquita -- Chief Financial Officer\n\nYeah, so -- it's a good question. So, while a lot of the headlines aren't necessarily new, we've been dealing with the pandemic, the fallout of the pandemic, the issues around the supply chain, all of those are largely new. What we have seen through the third quarter is a pretty dynamic shift in consumer behavior and purchasing behavior. As you know, largely, we've been focused on active sales leaders and the introduction of new distributors and preferred customers as key KPIs throughout the year.\n\nBut what we saw in the third quarter was a reduction in productivity in it as well. And so, what appears -- and again, this is just Herbalife Nutrition data, I'm not suggesting this is broadly, but perhaps, is that these macroeconomic conditions or I should say, the change, is impacting consumer behavior beyond the ability for us to forecast. Again, we're seeing productivity down, which suggests a reduction in buying behavior, whether that's a swapping out for other goods, whether that's just simply supply -- saving dollars for energy purchases and other critical nondiscretionary purchases is unclear at this moment as we're looking through the data. But clearly, there has been a shift through the quarter and our inability to really forecast these shifts just leads to our inability to forecast how Herbalife Nutrition is going to behave in that environment. \n\nChasen Bender -- Citi -- Analyst\n\nGotcha. OK, great. And then sorry, if I can just sneak in one more. Just in terms of the campaign to bring in new distributors, I was wondering if you could just maybe offer some specifics there in terms of what that entails.\n\nAnd then maybe specifically, how is it different what you're doing now versus what you've done historically to really drive new recruitment? Thanks.\n\nAlex Amezquita -- Chief Financial Officer\n\nSure. So clearly, with inflation and just how the world has been reacting to really, unprecedented levels of pricing, even in mature economies like the U.S. and Europe, where we're seeing high single digits, you're having actually real inflationary costs of maybe double digits. That price sensitivity, we are taking into account into how we structure promotional activities.\n\nSo, for example, figuring out ways for new member kits to be either a 3-for-2, not passing along price increases on a very select part of the portfolio to encourage demand in a part of the market where we want to encourage growth. So, I would say it's really related around demand impacts, around pricing, and around the ability for new members to come in without necessarily that hurdle or at least keeping pace with the significant price increases that we're seeing around the world.\n\nChasen Bender -- Citi -- Analyst\n\nGreat. Thanks so much for that. I'll pass it on.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Jeff Van Sinderen with B. Riley.\n\nYour line is open.\n\nJeff Van Sinderen -- B. Riley Financial -- Analyst\n\nHi, everyone, and welcome back, Michael. In light of the leadership change, can you speak to what the board is looking for in a permanent CEO and the process around that? And then, Michael, how long do you plan to stay there to help with succession once a candidate is chosen?\n\nMichael Johnson -- Chairman and Interim Chief Executive Officer\n\nI guess permanent is an open-ended word anymore, but I'm the permanent chairman of the company, been voted by the board to take the role of chairman. So, we, as a board, are looking for someone who has got heart and wants a brain connected to it in order to drive this opportunity, both fundamentally with the numbers, have a keen sense of margin in their perspective, but also someone who's volume aware, who knows how to harness and frankly, let loose, I guess harness is the wrong word, let loose distributor innovation, distributor entrepreneurialism in the field, cut through some of the red tape that companies gather over the years. Someone who has a passion for nutrition, somebody who has a passion for product, somebody who has a passion for our distributors and help them build their businesses every day, and someone who wants to build an employee environment that is spectacular. Herbalife employees tend to work very, very hard.\n\nTheir work-life balance is one that is a bit challenged at times. And bringing that passion in, making people feel very good about working in a place that brings a special opportunity to people in terms of an economic opportunity, as well as a nutritional opportunity is someone that is going to be unique. So it may take us a little time. Hopefully, we'll be able to harness that very quickly and bring someone to the front.\n\nI don't want to give you a time frame on me or an exact date because it's going to take a process. And that process is going to be completed as we see fit when we find the right person. He or she who steps into this role will find themselves at the helm of a spectacular company and a huge opportunity, and we want them to understand that. And when we find that person, away we go.\n\nJeff Van Sinderen -- B. Riley Financial -- Analyst\n\nOK, great. And then I just wanted to kind of -- and I realize I know you withdrew guidance and I know this is a tough question. But overall, just interested to hear if you think you -- maybe you have to put some pieces in place for this to happen but do you think you can grow the business in the face of recession? Or do you think that that's more likely a return to growth or year-over-year growth exiting a recession?\n\nAlex Amezquita -- Chief Financial Officer\n\nHi, Jeff, this is Alex. I'll take that one. Good talking with you. So, we do believe that we have the ability to grow during the recession.\n\nNow obviously, we have to get the right strategic initiatives in place. But we have the history of being able to do something -- to grow during recessionary periods. We've referenced a lot on this call about the macroeconomic challenges. And I want to make a distinction between your question and sort of what we're facing.\n\nSo currently, these current macroeconomic challenges are still faced with things like a tight labor market, are still faced with a pricing transition that's affecting consumer sentiment. Those are all significant headwinds, obviously, to almost any business. To the extent that you have some stabilization there, to the extent even if you have some weakening of the labor market, those sorts of activities could play to our favor. Historically, our distributors have had the mantra or have had the motivation to get out there and help people find an extra income opportunity at times when they were looking for it.\n\nSo the motivation, our model being a push model where distributors get out there and have certain motivations at times to create that extra sale. Recessionary times, people looking for extra income, those types of -- that type of environment actually should -- could benefit us. And so obviously, we have to see how things play out. There's a lot transitioning in the moment, and it's hard to -- that's why we withdrew guidance.\n\nIt's a little hard to forecast when that might be. But I just want you to simply take away, recessionary times do not necessarily mean that there isn't an opportunity for us to grow. We could potentially grow in those environments, provided we get the right strategies and we get the right motivations out there in the field.\n\nJeff Van Sinderen -- B. Riley Financial -- Analyst\n\nOK, good to hear. And then I just wanted to circle back to India for a moment, if we could. You're continuing to see really strong growth there. And I guess my question is, are there elements of what is working to drive growth in India that you could potentially apply to other regions? And I guess if so, how do you do that or what are those elements?\n\nAlex Amezquita -- Chief Financial Officer\n\nYeah, certainly. So, one of the great things about what we do as a company when we find things that are working in one place, we really do a deep dive to understand those things and try and get that best practice or whatever that activity might be going on in other regions. Now -- so we studied some of the things that are going on specifically in India to see how they might apply to other places. And particularly, there's some strategy around the preferred customer models, which are fairly uniquely one of the many things that are going right in India.\n\nNow while we are doing those things, it is probably important to note, India more or less is a self-contained economy. And while we can look at those best practices and try and replicate those in other places, it really is the combination of things that are happening in India. It's the momentum that's been going on over the years. It's the specific things that we just referenced.\n\nAnd it's also the fact that right now, that economy, more or less being closed, still has a lot of the backdrop for continued success that is pretty unique and not really being experienced anywhere else in the world right now. So again, while we definitely are going to look toward those specific strategies, it really is a combination of things happening in India that is really promoting the continued outperformance there.\n\nJeff Van Sinderen -- B. Riley Financial -- Analyst\n\nGot it. And best of luck in the remainder of Q4.\n\nMichael Johnson -- Chairman and Interim Chief Executive Officer\n\nThanks, Jeff.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Karru Martinson with Jefferies. Your line is open.\n\nKarru Martinson -- Jefferies -- Analyst\n\nGood afternoon. Last quarter and the quarters before, we talked about there was the pandemic cohort who was not engaging, your longer-term distributors were still putting up good metrics. Is this kind of pulling of guidance now saying that those two groups have kind of merged together? Or is there still a difference between the two groups? Thank you.\n\nAlex Amezquita -- Chief Financial Officer\n\nKarru, great question. Our Q3 results have shown exactly, that that those two groups have effectively merged. We're not seeing a material difference from them at this point, and the productivity comments that we've made and just generally the trends of pre-pandemic, pandemic, and I'm not quite sure if you say post-pandemic quite yet, but really all cohorts are trending in line. \n\nKarru Martinson -- Jefferies -- Analyst\n\nAnd then if we look at the kind of the macro headwinds that you're talking about, the tight labor market, the pricing transition, those are certainly things that are going to be with us probably in a non-transitionary way for the next couple of quarters, at least. What are the programs in place that you have to kind of function even with those headwinds?\n\nAlex Amezquita -- Chief Financial Officer\n\nYeah. So clearly, some of the promotional activity that we were talking about on new member growth is going to be a big focus for us. The strategies that go beyond those key metrics, we're actually meeting with key leadership next week to continue to drive and understand what we, the company, can do with distributor leadership around the world in specific strategies to address that. I think we're all focused on really understanding sort of the landscape that we're in, and we're really going to think about what are the strategies we could do to help Herbalife Nutrition be successful in that. \n\nKarru Martinson -- Jefferies -- Analyst\n\nOK. And just lastly, in terms of the $50 million debt repayment here in the fourth quarter coming up, will that be ABL again? And just how do you guys look at your converts here in the, what you call, March of '24, that maturity?\n\nAlex Amezquita -- Chief Financial Officer\n\nYes. So, yeah, so likely it will be the same as what we did in the third quarter, paying down the revolver with that $50 million. We'll start looking at the converts as we get into 2023. The maturity isn't till 2024 so we have plenty of opportunities to do various alternatives with that piece of the capital structure.\n\nBut to answer your question, the $50 million will likely be against the revolver this quarter.\n\nKarru Martinson -- Jefferies -- Analyst\n\nThank you very much, guys. Appreciate it.\n\nMichael Johnson -- Chairman and Interim Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Mary Ann Neale with Barclays. Your line is open.\n\nHale Holden -- Barclays -- Analyst\n\nHi. It's Hale Holden from Barclays. Michael, I know you've been sort of through starts and stops with this company over time. And I was wondering, as you look at the landscape now, how long do you think it will take you from your starting point today to sort of restart distributor engagement and then get the excitement going to where you can build growth off the base?\n\nMichael Johnson -- Chairman and Interim Chief Executive Officer\n\nThat's a great question. Tomorrow, I get on a plane with all the executives here and we're heading to Cairo, Egypt, our Founder's Circle, and Chairman's Club, 60, 70 distributorships. Alex, how many are we now? We've grown so nicely. We'll be there.\n\nThese are the leaders who have the organizations that impact every local market in the world. We were on a Zoom call with them already today. Their enthusiasm is pretty high. They are very welcoming.\n\nThey're -- as I said earlier in the call, I've created lot of friendships in that group. And I'm not going to say I'm going to trade on the friendships, but I'm going to trade on other business instincts. And I think we can get growth back, hopefully, sometime next year. That would be a goal of mine.\n\nI don't want to promise that. Eric reads all those wonderful statements in the beginning about no promises in here. But the expectation with me is let's get rolling. And we have done well in many types of environments, economic environments.\n\nWe've never had a pandemic environment, this is new to all of us. But I think this company has a great opportunity. There's no bad time for good health ever. And this is an economic opportunity that gives people a lot of dignity, and I'm going to play on that like we played on it for 20 years because it's real, and you see it impact and change people's lives.\n\nSo, to get growth back, that's my No. 1 goal in here. And if we don't get the growth back, you won't see me on this call. It's the purpose of me being here.\n\nIt's the purpose of the opportunity that our distributors know and love and embrace. And sometimes, you just need a little shot of energy to get the game going again. And I think we've got it. And I feel it from the distributors, I feel it from the team, and we are highly, highly motivated to move forward.\n\nSo, no timing, but a heck of a lot of energy and a heck a lot of desire and a great team to pull it off.\n\nHale Holden -- Barclays -- Analyst\n\nThank you. My second question was, I mean, if I'm just sort of listening between the lines here, it sounds like some of the pricing that you took over the summer, combined with the macro environment, has sort of driven those productivity declines sort of getting worse month-to-month-to-month through the third quarter. And I was wondering if you thought my comment on the pricing was correct. Or if it was just something else?\n\nAlex Amezquita -- Chief Financial Officer\n\nWell, so we saw the reduction in demand. That's clear and evident in the data. We have our data scientists that run through the performance on a month-to-month basis and we could see the reduction in demand. Now what's challenging is those results, whether it's due to the pricing increase, whether it's due to the macroeconomic conditions, the results are the same.\n\nSo, you can't -- it's hard to give attribution to one of those two things in any sort of -- with any sort of specificity. Further, I think as you go region by region and market and market, that's going to vary. What's working in the U.S. is probably different in Europe is probably different in Asia Pacific, so on and so forth.\n\nSo, I think your comment is generally right. It has had -- pricing has had some impact. But to sort of quantify the specific amount of demand elasticity that we've seen in the third quarter, we don't have the data to really suggest with any precision.\n\nHale Holden -- Barclays -- Analyst\n\nOK, that makes sense. Thank you. Safe travels tomorrow.\n\nMichael Johnson -- Chairman and Interim Chief Executive Officer\n\nThanks, Hale.\n\nOperator\n\nThank you. I'm showing no further questions in the queue. I would now like to turn the call back over to Michael Johnson for closing remarks.\n\nMichael Johnson -- Chairman and Interim Chief Executive Officer\n\nThanks, everyone. Thanks for being on this call. It's really a tremendous honor, the responsibility that I embrace to be back in the seat. I'm really proud of what this company does.\n\nOur mission, our vision, and our values, they're spectacular. It's really something that we show up every day, helping people get healthier and provide the opportunity to earn a little more money. I'll never forget day 1 when I joined here. My brother sent me a little saying that was in a framed -- in a frame and it said, \"The first wealth is health\", and this company creates that opportunity.\n\nNow today, we have opportunities and challenges that are never -- like never before, but this is an incredibly resilient business, and we're working closely and we'll continue to work closely, as we mentioned, in Cairo with our distributors to make sure that we improve our trends and deliver a better return. We've got a great team of executives here. We've got distributors who are incredibly dedicated. I will be focused to ensure their passions result in better sales in each of our markets.\n\nI know and I believe our opportunity far outweighs our challenges. We have a bright, bright future ahead of us. We've got a great company here and a world-class leverageable distribution channel, supported by global megatrends that will provide the catalyst for growth for years to come. I'm looking forward to being with you all again and for another great chapter in Herbalife Nutrition.\n\nSo, thanks very much, and as I always say to the team, \"Let's go Herbalife.\" Thank you.\n\nOperator\n\n[Operator instructions]\n\nDuration: 0 minutes\n\nEric Monroe -- Senior Director, Investor Relations\n\nMichael Johnson -- Chairman and Interim Chief Executive Officer\n\nAlex Amezquita -- Chief Financial Officer\n\nChasen Bender -- Citi -- Analyst\n\nJeff Van Sinderen -- B. Riley Financial -- Analyst\n\nKarru Martinson -- Jefferies -- Analyst\n\nHale Holden -- Barclays -- Analyst\n\nMore HLF analysis\n\nAll earnings call transcripts"
}