{
  "companyName": "Warner Music Group Corp.",
  "companyTicker": "WMG",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/22/warner-music-group-corp-wmg-q4-2022-earnings-call/",
  "content": "Warner Music Group Corp. (WMG -0.85%)\nQ4 2022 Earnings Call\nNov 22, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to Warner Music Group's fourth quarter earnings call for the period of fiscal year ended September 30, 2022. At the request of Warner Music Group, today's call is being recorded for replay purposes. And if you object, you may disconnect at any time. Now, I would like to turn today's call over to your host, Mr.\n\nKareem Chin, head of investor relations. You may begin.\n\nKareem Chin -- Head of Investor Relations\n\nGood morning, everyone. Welcome to Warner Music Group's fiscal fourth quarter and full year earnings conference call. Please note that our earnings press release, earnings snapshot, and the Form 10-K we filed this morning will be available on our website. On today's call, we have our CEO, Steve Cooper; and our CFO, Eric Levin, who will take you through our results, and then we will answer your questions.\n\nBefore our prepared remarks, I would like to refer you to the second slide of the earnings snapshot to remind you that this communication includes forward-looking statements that reflect the current views of Warner Music Group about future events and financial performance. We plan to present certain non-GAAP results during this conference call and in our earnings snapshot slides and have provided schedules reconciling these results to our GAAP results in our earnings press release. All of these materials are posted on our website. Also, please note that all revenue figures and comparisons discussed today will be presented in constant currency unless otherwise noted.\n\nAll forward-looking statements are made as of today, and we disclaim any duty to update such statements. Our expectations, beliefs, and projections are expressed in good faith, and we believe there is a reasonable basis for them. However, there can be no assurance that management's expectations, beliefs, and projections will result or be achieved. Investors should not rely on forward-looking statements because they are subject to a variety of risks, uncertainties, and other factors that can cause actual results to differ materially from our expectations.\n\nInformation concerning factors that could cause actual results to differ materially from those in the forward-looking statements is contained in our filings with the SEC. And with that, I'll turn it over to Steve.\n\nSteve Cooper -- Chief Executive Officer\n\nThanks, Kareem. Good morning, everyone, and thanks for joining us. As you may know, I'll be stepping down as CEO in January. So, this is my last earnings call.\n\nI'll have more to say about our leadership transition later, but let's start by talking about what's happening today. It's no secret that we've been challenged on multiple fronts as we navigated the tumultuous macro environment. This includes financial volatility, rising interest rates, inflation, declines in online advertising spend, and currency headwinds. In addition, we've been navigating the complexities created by the pandemic and dealing with the impacts of the war in Ukraine.\n\nDespite all these challenges, I'm pleased to say that we've had a very successful quarter. Our total revenue in Q4 was 1.5 billion, representing year-over-year growth of 16%. Adjusted EBITDA also increased 16% to 276 million, with a margin of 18.4% compared to 17.2% in the prior-year quarter. These results were driven by growth across all revenue lines, as well as the benefit from settling certain copyright infringement cases as we discussed on our last earnings call.\n\nRecorded music revenue was 1.24 billion, an increase of 13%. Streaming revenue grew 10.4% when adjusted for the one-time impact of the DSP renewal we've been discussing since Q1. I'd like to remind everyone that Q4 was the final quarter impacted by this renewal. Q4's uptick in subscription streaming growth and the benefit from emerging streaming platform deal renewals more than offset the decline in ad-supported revenue.\n\nArtist services continued to recover in Q4, increasing by 33%, while licensing and physical were up by 38% and 6%, respectively. Publishing had another impressive quarter with revenue of 254 million, reflecting exceptional growth of 32% plus. Digital and performance revenue stood out, growing 39% and 48%, respectively. As I look back on the last two and a half years since going public, it's clear that we haven't for a single day operated in a normal environment.\n\nSo, it's gratifying to report that our businesses continued to shine during fiscal '22. Excuse me. For the full year, we delivered total revenue growth of 16% and adjusted OIBDA growth of 18%. Excluding one-time items, adjusted OIBDA grew 22%.\n\nWe converted 65% of our adjusted OIBDA to operating cash flow for fiscal '22, well in excess of the expectation we discussed last quarter of 50% to 60%. As we look ahead, there's tremendous momentum in both the short and long term. I've consistently told you that streaming revenue would continue to have a significant runway, that we would have price increases and ongoing subscriber growth, and that emerging platforms would continue to expand. We're now seeing all these come to fruition.\n\nMost significantly, Apple and Deezer recently announced price increases. Making these announcements in the current economic environment shows that music subscription services offer amazing value to consumers. Music remains undervalued, but we're optimistic that there will be other increases to come. We're also encouraged by reports of subscriber growth.\n\nDeveloped markets continue to grow in the double digits while emerging markets are growing at higher percentages. With global smartphone penetration expected to increase meaningfully in the coming years, our conviction in streaming growth remains strong. Finally, the revenue growth curve of emerging streaming platforms continues to outpace more established formats. These new platforms are all heavily reliant on music.\n\nAnd as engagement continues to grow, we expect monetization to follow suit. In our recent deal with Meta, our annualized revenue from this category reached 370 million this quarter. We look forward to the continued evolution of our deals as these platforms harness the power of user-generated content, not just for music discovery but for marketing and monetization. You've often heard me reference the four key pillars of our long-term strategy: music, globalization, innovation, and people.\n\nSo, I'd like to talk about how these pillars have shaped our culture over the last decade and how they continue to drive our results. Let's start with the music. What distinguishes the Warner Music Group is our ability to identify and sign original artists at the beginning of their careers and develop them into the world's most recognizable superstars. We discovered many of our biggest names like Ed Sheeran, Cardi B, Dua Lipa, Bruno Mars, and Anitta when they were just starting out.\n\nQ4 exemplified the impact of our multi-pronged approach. We had great carryover success from our key artists like Ed, Dua, and Silk Sonic. Newly minted superstars, Jack Harlow and Zach Bryan, had multi-million selling albums released in Q3. And Lizzo's phenomenal singles were a precursor for her chart-topping album, Special, released in Q4.\n\nWe've also proved once again that music can come from anywhere and resonate everywhere. Not only do we develop Anglo blockbusters, but also superstars within their domestic regions. Local chart-toppers like Japan's Aimyon and South Korea's Twice, and international superstars like France's David Guetta, Argentina's Paulo Londra, and Nigeria's Burna Boy. In addition, given the growing consumption of catalog music, we placed even more emphasis on spotlighting our legendary artist.\n\nRecent highlights include great looks for Kate Bush, Fleetwood Mac, and Led Zeppelin. As we broaden and deepen our artist roster and prioritize the global approach to domestic music, our revenue composition has evolved. A decade ago, our top five artists generated over 15% of our recorded music's physical and digital revenue. In 2022, they generated just over 5%.\n\nOur momentum will continue with a strong release slate in Q1, including new music from Paramore, Aya Nakamura, Cardi B, Peter Fox, Roddy Ricch, Joel Corry, and more. I should also mention our outstanding showing in the Grammy nominations announced last week. Recorded music picked up more than 80 nods, which included half of the Album of the Year contenders. Our top nominees were Elektra's Brandi Carlile with seven, and six each for Atlantic's Lizzo and 300's Mary J.\n\nBlige. We also had three Best New Artist nominations for Anitta, Omar Apollo, and Molly Tuttle. And Warner Chappell had a great showing highlighted by nominations for The-Dream and Amy Allen in the brand new category of Songwriter of the Year. Warner Chappell is also performing very well, delivering on its strategy of diversifying revenue streams while providing wider opportunities for songwriters globally.\n\nHere are a few recent highlights. In the U.S., Daniel Caesar took home Song of the Year for Peaches at the 2022 BMI, R&B and Hip-Hop Awards. We saw pop sensation, Lauren Spencer-Smith, and breakout punk rock band, The Linda Lindas. We renewed our deal with eight-time Grammy Award winner, Chris Stapleton, and we entered into a license renewal with China-based social platform, Kuaishou, for our catalogs across multiple Asia-Pac countries.\n\nWe constantly work to enhance the value of our songwriter's catalogs. Our teams proactively find needle-moving placements for their music, which distinguishes us from passive right holders. One recent example of this is the placement of George Michael's Freedom covered by Warner's superstar Dua Lipa in a Yves Saint Laurent campaign that launched in August. There's been a lot of debate over the value of major labels and publishers in a world where artists and songwriters have any number of distribution alternatives.\n\nWhile distribution has been democratized, talent never will be. Genuine talent is rare and difficult to find, but discovery is just the beginning. True, long-term success requires significant resources, including financial investment, global infrastructure, creative expertise, and the skills to navigate the changing tech landscape. It's that combination.\n\nGenuine talent, backed by our considerable resources and skills, that builds careers for the long haul. Over and over again, artists and songwriters not only stay but grow their relationships with us in this fiercely competitive market. That's when we know we're on the right track. Ten years ago, we were an Anglo-centric company.\n\nToday, we're a truly global music entertainment company operating in over 70 countries. The key to our successful global expansion has been in identifying markets on the brink of ignition. We've customized for each new territory, market, and presence-building strategies. A couple of examples from the past decade are the 2014 acquisition of Gold Typhoon in China and the critical mass we built in MENA, the world's fastest growing market, through our investments in Qanawat, [Inaudible] and Rotana.\n\nWe see Eastern Europe as a new and important growth area for music. Consumption in the region, which has a population of some 160 million people, grew 20% in 2021. Seizing on this opportunity, we've made moves to grow our presence. Examples include our recently announced investments in Grupa STEP and Big Idea in Poland, Mascom Records in Serbia, and the launch of Out of Order, a new label that will elevate artists in Eastern Europe and other emerging markets.\n\nThe expansion of our global footprint has been further complemented by entering into partnerships with more than 200 streaming services around the world. In the music entertainment business, new technologies and business innovation stay driven, have often been met with fear rather than excitement. But today, we see tech as providing us with incredible opportunities to enhance the world of music. We've consistently been a first mover in investing across the digital landscape.\n\nOur early embrace of streaming made us the first major to report it as our largest source of recorded music revenue back in 2016. Around that time, we also began our revenue diversification efforts. Since then, we've partnered with nearly every major social platform, including Instagram, Facebook, Snap, Twitch, TikTok, and, most recently, Pinterest. In many cases, we were the first major to do so.\n\nThese deals are empowering our artists to scale their communities, encouraging fans to share user-generated content, and delivering significant incremental value. We were also the first major to aggressively pursue opportunities in the metaverse. While our work in Web3 space has accelerated over the last 12 months, our efforts started back in 2019 when we invested in leading blockchain company, Dapper Labs. Our partnerships with Roblox, Fortnite and Wave have created innovative opportunities for virtual world-building, concerts, and other forums.\n\nThis has allowed us to work with artists like Twenty One Pilots and Charli XCX in pioneering new forms of fan engagements. Through our deal with Sandbox, we were the first major to plant a flag and build on virtual real estate. WMG Land, our current working title, is now live in the Sandbox. And Atlantic's Sueco was the first artist to become part of the experience.\n\nI'm very proud of the progress we've made over the past 10 years. We've moved way beyond thinking in terms of singles, albums, and videos. We help artists create all forms of rich, immersive interactions with their music in both the real and virtual worlds. As I look out on the next 10 years, I believe we're at the doorstep of a new golden age of music.\n\nAs the ecosystem becomes more complex and exciting new business models emerge, our role as the connective tissue between artists and fans will only become more prominent and more important. Finally, our people are the driving force that will always take our company to the next level. Last month, we announced that Julie Greenwald had been elevated to chair and CEO of the newly created Atlantic Music Group. Julie's been with the company for 18 years, and it's industry mavericks like her that are the backbone of our success.\n\nWe've enhanced our focus around important areas like ESG and diversity. Last year, we hired ahead of ESG and established an executive oversight committee. On February 1st of 22, we released our first annual ESG report detailing our commitment to sustainability, equity, and social impact. Our second annual report will be published this coming January.\n\nIn 2020, we hired a global head of diversity, equity, and inclusion. We've since established global north-star commitments and launched our DEI institute, and we created the $100 million Warner Music Group Blavatnik Family Foundation Social Justice Fund that invests in organizations and advances community initiatives around the globe. To date, the fund has already committed over 24 million in grants. On November 1st, we published the \"Protect Black Art\" open letter in the New York Times and the Atlanta Journal-Constitution.\n\nThe letter urges legislators across the U.S. to end the racially discriminatory practice of treating rap lyrics as criminal confession. Signatories included companies such as Universal, Sony Music, Spotify, and TikTok; organizations such as the ACLU, Color of Change, the Recording Academy, and RIAA; and artists such as Alicia Keys, Coldplay, Drake, Megan Thee Stallion, and Post Malone, among many others. I'm pleased to see us creating new opportunities in our local communities using our resources to express our values and taking a stand on important issues.\n\nAt the end of September, we announced that Robert Kyncl will become CEO during January 23 and then CEO on February 1st. As an entrepreneurial leader, Robert has an impressive track record of championing change at companies like YouTube and Netflix. He's a pioneer of the creator economy whose command of technology will enable us to unlock new opportunities for our company, our artists, and our songwriters. I have the utmost confidence that he'll build upon our strong foundation and bring us into a new era of how music lives in the world.\n\nWith that, I'll turn it over to Eric.\n\nEric Levin -- Chief Financial Officer\n\nThank you, Steve, and good morning, everyone. Against the backdrop of currency fluctuations, the weak ad market, inflation, and war, our 2022 results truly highlight the resilience and diversified nature of our business. Despite the many macro challenges, we delivered double-digit growth for Q4 and the full year across a number of key metrics, including total revenue on a constant currency basis, adjusted OIBDA, and operating cash flow, which, as Steve mentioned, exceeded our full year expectations. Let me provide some detail on our results in Q4.\n\nTotal revenue grew 16%, reflecting growth across recorded music and music publishing. I want to note that our revenue includes the benefit from settling certain copyright infringement cases as we discussed on our last earnings call. The $38 million impact is reflected in downloads and other digital revenue. Adjusted OIBDA increased 32.5%, with a margin of 17.7%, compared to 15.5% in the prior-year quarter.\n\nThese increases were primarily due to strong operating performance, as well as $29 million from the copyright settlement. Adjusted OIBDA and margin growth were impacted by foreign exchange rates, as well as two one-time items. These were the copyright settlement I just mentioned and the impact of a DSP renewal we've been discussing since our earnings call since Q1. Excluding these items, constant currency adjusted OIBDA grew 33%, and margin would have increased 200 basis points.\n\nAdjusted EBITDA increased 16.5%, with margins increasing from 17.2% to 18.4%. You can find our adjusted EBITDA reconciliation in our earnings press release. Recorded music revenue grew 13.1%. Streaming revenue increased 5%, reflecting continued growth in subscription streaming and our recent deal with Meta, partially offset by the market related slowdown in ad-supported revenue and the impact of the DSP renewal.\n\nAdjusting for that DSP renewal, which had a $38 million impact in the quarter, streaming revenue grew by 10.4%. This growth was highlighted by subscription streaming growth in the low teens and sequential improvement from Q3. However, ad-supported streaming revenue, which does not include revenue from emerging streaming platforms, saw increasing pressure and declined by high single digits. Adjusting for the impacts of the DSP renewal and the copyright settlement, recorded music revenue grew by 14.2%.\n\nArtist services and expanded rights revenue increased by 33%, driven by merchandising and concert promotion. Physical revenue also increased with growth of 6%, primarily driven by higher sales of vinyl products and strong performance in Japan. Licensing revenue grew by 38% due to higher broadcast fees, synchronization, and other activity. Recorded music adjusted OIBDA increased by 20%, with margin improving from 17.2% in the prior quarter to 18.2%, primarily due to strong operating performance, as well as a $15 million impact from the copyright settlement.\n\nExcluding the one-time items detailed earlier, adjusted OIBDA grew 26% on a constant currency basis, and margin improvement would have been approximately 170 basis points. Music publishing continues to deliver impressive results, posting 32% growth. Digital revenue grew 39%, reflecting solid momentum in streaming, which increased 37%. Digital revenue includes a $7 million benefit in downloads and other digital revenue from the copyright settlement.\n\nExcluding this benefit, digital revenue increased 33%. Performance revenue increased by 48% as revenue from bars, restaurants, concerts, and live events continued to grow. We saw a particularly strong recovery in Brazil, U.K., Germany and the U.S. Sync and mechanical revenue both increased by over 8%.\n\nMusic publishing adjusted OIBDA increased 33% to $60 million, with margin increasing modestly. Excluding the impact of the copyright settlement, adjusted OIBDA would have increased 31% on a constant currency basis, and margin would have increased 50 basis points. Moving to our full year results, total revenue grew 16%, driven by double-digit growth in both recorded music and music publishing. This translated to a healthy adjusted EBITDA growth of 18%, with a margin of 19.4%, up from 19.1% in the prior year.\n\nExcluding one-time items, the details of which can be found in our earnings press release, constant currency adjusted OIBDA increased 21.6%, and margin increased 70 basis points to 18.6%. Full year adjusted EBITDA increased 9.7%, with margin decreasing from 20.6% to 20.2%. Recorded music revenue increased by 13.6%, or 15.2% when normalized for one-time items. Within recorded music, streaming revenue grew 9.5%, or 13.5% on a normalized basis.\n\nAdjusted OIBDA increased by 12%, with margin declining by 30 basis points to 21.1%. Excluding the one-time items, adjusted OIBDA increased 17% on a constant currency basis, with margin increasing 30 basis points to 20.4%. Music publishing revenue increased by 30% or 27% when normalized for one-time items. Adjusted OIBDA increased by 35%, with margin increasing from 23.4% to 24.3%.\n\nExcluding the one-time items, adjusted OIBDA increased 32% on a constant currency basis, with margin increasing 100 basis points. In line with our expectations. Q4 capex increased to $38 million as compared to $35 million in the prior0year quarter, mainly due to investments in IT infrastructure. I want to note that our financial transformation program has encountered a delay as a result of the disruption of COVID-19.\n\nIn addition, the size and scale of this global system implementation requires us to invest more time performing the rigorous system testing and data validation to ensure go-live readiness. We expect the program to meaningfully roll out in 2024 and expand globally in the following couple of years. The program is still expected to deliver annualized run rate savings of $35 million to $40 million once fully implemented. However, the delay will result in a reduction in pro forma impact of cost savings that we account for in our adjusted EBITDA reconciliation in fiscal '22 and '23.\n\nWe saw very strong operating and free cash flow growth and conversion in Q4. Operating cash flow increased 78% to 406 million from 228 million in the prior-year quarter. Free cash flow increased 91% to $368 million and from $193 million in the prior-year quarter. For the full year, operating cash flow increased 16% to 742 million, and free cash flow increased 11% to 607 million.\n\nWe delivered operating cash flow conversion, calculated as the ratio of operating cash flow to adjusted OIBDA, of 65% for the full year. This was well above our expectation of 50% to 60% that we discussed last quarter. The over-delivery was largely driven by our strong operating and operating performance in Q4, higher recruitments, and the timing of A&R investment in deal renewals. I want to emphasize that some of our Q4 over-delivery was the impact of timing.\n\nWhile we believe that our targets are reasonable, we view them as multiyear period, and there will be lumpiness in working capital that will impact our operating cash flow to adjusted or EBITDA conversion rates from quarter to quarter. As of September 30. We had a cash balance of $584 million, total debt of $3.7 billion, and net debt of $3.1 billion. Our weighted average cost of debt is 3.5%, and our nearest maturity date is in 2028.\n\nFiscal '23 is already off to a very solid start, even as the challenging macro environment persists. While there is still softness in the online ad market, we believe it is a temporary dislocation and that we will be well positioned to capitalize on the inevitable recovery. We are excited about the recent price increases announced by several of our digital partners, as well as the opportunity for more to come. The runway for streaming growth remains strong as global penetration continues to increase and the next wave of emerging opportunities take shape.\n\nMusic is no longer reliant on any one format or distribution channel. It is an essential part of every form of entertainment. The momentum in the music entertainment business is strong, and we continue to position ourselves for long-term success and growth. We're excited about the next chapter, and we look forward to having Robert on board to lead us into new frontiers.\n\nFinally, Steve. Steve and I have been doing these calls together for the past eight years. It's been a true joy to share the mic with him. On behalf of everyone at the company, I want to thank Steve for an amazing decade of growth and success.\n\nHe's led this company brilliantly through an era of incredible change, both in our industry and the world at large. Steve, thank you so much. And thank you to everyone for joining us today. We'll now open the call for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Ben Swinburne with Morgan Stanley. Your line is now open.\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nThank you. Good morning. Couple of questions. Maybe just to start with Steve, you know, stepping back, you've been there and watched the industry go from declining to growing during your tenure as CEO.\n\nWhen you step back and think about your time at Warner Music, what's been the biggest change for the industry, the company, the one you think will have the biggest impact as we all look forward over the next, you know, five to 10 years?\n\nSteve Cooper -- Chief Executive Officer\n\nWell, thanks for the question, Ben. Happy Thanksgiving.\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nThank you.\n\nSteve Cooper -- Chief Executive Officer\n\nI think, you know, the easy answer is streaming. But at least what I believe at Warner, it's really been for us a shift in our mindset. And that shift has been driven by our evolution, you know, from an Anglo-American music company, to a global music entertainment platform; from thinking about our business in terms of rigid formats, to really moving to offering fans access to unlimited, ubiquitous music in every way, shape, and form in the real land and the virtual worlds. We move from a narrow set of artists deals to expanding our definitions of artists and partnerships and offering much broader suites of services.\n\nAnd the mind shift has really been built on a foundation of running Warner as one company and one team with a common set of goals. And I think that, at least for us, that as the ecosystem becomes more and more complex, that by having that mind shift and by working as one team, that that connective tissue that we provide between artists and fans and what we do to, you know, move the value of music to its appropriate place, will just become more and more apparent as time goes by. And I'm happy to say that with my colleagues, I've played a part in creating that mind shift. And I'm very confident that we will continue to embrace, adapt and adopt, adapt and adopt, as the world of music continues to evolve.\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nThank you, Steve, and all the best in the next chapter for you. Eric, could you just help us think about the emerging streaming opportunity in fiscal '23? Obviously, you know, you're always at work trying to get music valued appropriately. But I think it's a potentially a busy year for you in terms of contract renewals. And, in particular, given what's happening with YouTube and ad-supported streaming, TikTok is one of kind of a paramount -- import for your business because they seem to be taking share from YouTube and others.\n\nSo, could you help frame, you know, sort of the year ahead on the emerging streaming front and what we should be focused on, on our end?\n\nEric Levin -- Chief Financial Officer\n\nSure. So, thanks, Ben. And nice hearing from you. So, I don't want to get into specific deals, but, broadly, the category.\n\nSo, you're right, Ben. So, in fiscal '21, we had a series of deals that we did or renewed. And, generally, we do deals in two- to three-year cycles. So, '23, we would expect to be the start of that process.\n\nBroadly, that category consists of more and more licenses with growing consumption. We see that category as a growing category for the long, long term to come. Each deal and each contract will be negotiated individually. Some of the companies within that category have been highly successful and scaled, and others have had more challenges.\n\nSo, each deal will meet where that partner is. But it's our objective deal by deal to get the full and appropriate value of music, and we'll be negotiating for each deal assertively to make sure each deal is valued properly. The other thing to note is that these deals, as we've talked about in the past, are generally fixed-fee deals. It is our objective over time to move these deals to or toward being variable.\n\nWe know that's not going to all happen in one renegotiation across the board, but we'll be working toward that end. And obviously, as deals move variable, the growth curve would be smoother and in line with monetization and consumption growth. Whereas with fixed-fee deals, it's more of a stair step, and you try to capture the expected growth in the platform within a fixed fee over that period of time. So, we'll be working each negotiation and seeing what we can accomplish there.\n\nAnd the last thing I would say is Web3. Web3 is an emerging category that we're actively driving in market experiments. Steve talked about the experiment we're doing in the Sandbox now with others in flight. We see that as an area that, over time, is quite promising and we think is going to be a contributor to the long-term growth of our of our new digital revenue.\n\nI hope that helps, Ben.\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nYeah, absolutely. Thanks, everybody.\n\nEric Levin -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Jason Bazinet with Citi. Your line is now open.\n\nJason Bazinet -- Citi -- Analyst\n\nI just had one quick question regarding your calendar year or your reporting schedule for next year because I think you guys are shifting from that sort of 53-week that happens every four years to something more normalized. So, can you just help us, as we think about modeling '23 and beyond, where we'll see sort of the greatest distortion? Is it in the fourth quarter of next year? Is that the right answer and then everything gets smooth after that?\n\nEric Levin -- Chief Financial Officer\n\nJason, thank you. Good -- I'm glad you hit on that good question. It's an important one. So, yeah, we've now shifted to calendar quarters.\n\nAnd so, we'll see the main real impact in fiscal Q1 of '23. We disclosed that in fiscal Q1 of '22, we had kind of that extra week. As this is the 53rd week, you get an extra week and one quarter. That was in Q1 of '22.\n\nSo, that will be a comparative item in Q1. But the rest of for the following quarters in fiscal '23, we will expect a consistent year-on-year comparison with the same number of weeks. But in Q1, we will have that to address. And we disclosed that last year, and we'll continue to make sure we're careful about that when we report Q1 results.\n\nJason Bazinet -- Citi -- Analyst\n\nOK. Thank you very much.\n\nEric Levin -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Kutgun Maral with RBC Capital Markets. Your line is open.\n\nKutgun Maral -- RBC Capital Markets -- Analyst\n\nGood morning, and thanks for taking the questions. Two, if I could. First, Steve, congratulations again on a successful run at WMG. Can I just follow up on the question earlier and maybe ask it a bit differently? As you reflect back on the last two and a half years following the IPO, are there any parts of the story that you feel remain misunderstood or at least underappreciated by investors? And second, for Eric, on recorded music streaming revenue, the 10.4% underlying growth was particularly strong, and it certainly seems to be ahead of your peers.\n\nI'm not expecting multiyear guidance, and I know the ad-supported piece remains uncertain. But can you help frame the puts and takes for 2023 a bit and maybe update us on your longer-term expectations, specifically around the subscription front. You had very attractive low-teens growth in the fourth quarter. Is that a good benchmark heading into '23? Could it be higher given Apple Music? Or are there offsets we should be mindful of? Thanks.\n\nSteve Cooper -- Chief Executive Officer\n\nAll right. So, Eric, I'll go first on. And thanks for the question. I do think that our business is, to a certain degree, misunderstood.\n\nAnd it's misunderstood in the following context. When you look at the results we produce over the longer term, call it for argument's sake, a year, versus the shorter term, our march for the last, I don't know, nine or 10 years has been steadily northward bound, both by way of the top line and by way of the bottom line. And my expectation would be that that steady march north will continue for the foreseeable future. That being said, I think that many investors evaluate us on a quarter-to-quarter-to-quarter basis.\n\nAnd as I believe many of our investors have seen, that quarters can be impacted by any number of extraneous items. But as those extraneous items, whether it be shifts and release schedules, getting a deal done a quarter late versus a quarter early, what we done both by bolstering our investments in recorded music, by bolstering our investments in publishing, and with publishing now, you know, having lagged by way of the growth of digital revenue, is now leading by way of that growth. Through the focus that we put on diversification over the last four or five or six years, diversification, both geographically, that is local language with emerging platforms, emerging markets, that I think that all of these quarter to quarter blips have a tendency to be ironed out over an extended period of time. Again, call it a year.\n\nAnd that, you know, the really observant investors will see that despite those blips that year to year, year to year, year to year, that march north continues. And it's continued this year despite choppiness in a couple of quarters. So, I think it's valuing us or evaluating us as a quarterly business is somewhat misguided. And I think evaluating us on an annual basis or a rolling 12-month basis is, at least from my perspective, a far better way of looking at how we are doing, the health of our company, and the trends we're setting.\n\nSo, hopefully that answers your question.\n\nEric Levin -- Chief Financial Officer\n\nI fully agree with Steve on that. So, Kutgun, thank you for both your questions. I'll answer your second one on streaming. So, let me break that into two pieces, kind of 2022 and then forward-looking.\n\nSo, in 2022, on an adjusted basis, meaning looking at the underlying trends of streaming, Q4 grew 10%, and the full year grew 13%. Very strong streaming results in a challenging macro market. In Q4, we saw subscription streaming grow low teens a very strong result. Ad-supported, though, is significantly affected by the macro environment.\n\nAd-supported declined and declined in the high single digits this quarter. As we look forward, we think there's a lot to be really quite positive and optimistic about. I will point toward Goldman's Music in the Air forecast just because it gives an interesting and, we think, useful template to look at. They see subscribers doubling or, quite frankly, more than doubling over the next seven to eight years.\n\nIt's driven by a couple of components. And each of the components I'll try and address and paint what we think is the picture. Developed markets, which are around -- which are penetrated in the 30% now, we've seen market studies and forecasts that predict that increasing to 50s or even 60% penetration as you look forward five, six, seven years. We think we are seeing consistent growth in developed markets today, and we think there's a lot of runway to be looking forward to.\n\nWhat is now really additive to that is we've seen price increases just in the past quarter from Apple, Deezer. Others have talked publicly about considering price increases. We think the environment for price increases has changed, and we are optimistic about continued price increases going forward. And that is additive, especially in developed markets.\n\nWe think developed markets for prescription streaming has a lot of growth in front of it, and we're really pleased with the potential and opportunity there. Emerging markets are growing even faster than developed markets. The penetration across emerging markets on average are still single digits and have the opportunity to grow into the 10s, 20s, and, hopefully, over time, even the 30s. Although the average ARPU is lower in emerging market, the rate of growth has increased, and we think has tremendous promise.\n\nWe've also been investing at Warner into what we think are some of the most promising emerging markets. Steve and his talking points talked about our investments in the Middle East, which, in '21, was the world's fastest growing market, growing, I believe, 35%. And we're building our market share into that growth. So, we see emerging markets as being a real opportunity for subscriber growth, revenue growth, but also for us to develop real footholds and develop our market share and footprints.\n\nAd-supported, it has been more challenging in the short term. Remember, before the macro environment was so challenging, ad-supported would grow in line double digits, pretty consistently with subscriptions. But when macro environment gets difficult, one of the first things that we've seen consistently gets affected negatively is ad-supported. We saw it when COVID hit in 2020, and we're seeing it now.\n\nThe ad-supported market is in decline. Even though consumption of products go up, just monetization has gone down in the short term. When the macro environment starts to improve and economies start to improve, we would expect to see that improvement ad supported to rebound strongly and go back to growth. We also see the emerging streaming category as one that is still in early stages with more diversified revenue streams, increased number of partners and deals, and growth within many of the key partners within that category.\n\nSo, we see it and Web3 as an emerging component. So, we see the emerging streaming bucket as one that is a continued growth area for us. While noting that our deals -- many of our deals in there are fixed price, that the growth is not consistent, it can be lumpy. But over time, we see it as an extremely promising growth contributor.\n\nSo, we see streaming as a very diversified form of growth now globally across subscription, social, fitness, Web3. And we're very pleased with how's developing and see it as an area that we're really optimistic of growth going forward. Thanks, Kutgun.\n\nOperator\n\nThank you. Our next question comes from the line of Stephen Laszczyk with Goldman Sachs. Your line is open.\n\nStephen Laszczyk -- Goldman Sachs -- Analyst\n\nThank you. Good morning, Steve. Congratulations on your retirement from Warner. Maybe two questions, if I could.\n\nFirst, on market share. You have some notable releases, album releases in the back half of the fiscal year. Could you maybe talk a little bit more about how that impacted the mark during the quarter, and then, looking forward, how the release slate is shaping up relative to other major labels as we head into the '23? And then, a follow-up with Ben's question on emerging, maybe for Eric. The label is in the process negotiating with ByteDance.\n\nI know it's in -- looking to expand its regular service. It'd be great to get your latest thoughts on the opportunity you see to improve monetization of ByteDance at a holistic level, whether that's on the TikTok side of the house or with the expansion of ByteDance itself. Thank you.\n\nSteve Cooper -- Chief Executive Officer\n\nOK, So while I can't talk about our release slate in specifics, we did touch upon those albums that we know have either dropped or will drop in the first quarter. But what I will say is that our diversification, our geographic diversification, and our focus over the last decade in growing not only our Anglo but our non-Anglo business has provided us with a tremendous amount of what I would call release resiliency that we have local, regional, and global superstars bubbling up from many, many, many different parts of the world. And because we've created both a geographic, redomestic, you know, domestic music, local language portfolio along with our Anglo portfolio, Stephen, it gives us a tremendous amount of resiliency by way of quarter-in, quarter-out; year-in, year-out momentum where we have become less and less dependent upon any particular artist and less and less dependent upon blockbusters because this portfolio is consistently hitting singles, doubles, triples, and home runs. So, that's kind of on the slate point.\n\nOn market share, market share moves around a bit, often driven by the strength or, you know, more strength or less strength in release schedules. One of the things I would point out, though, is that while there are various reports on share moving to labels for artists that aren't affiliated with Warner or Sony or Universal, the fact of the matter is when you continue to look at listening and the listening behavior of people that immerse themselves in music, that we continue to be one of the truly dominating global forces in music when it comes both to share and, as importantly, to hours of listening. So, while you will see small movements, the fact that listening continues to be dominated by Warner, Sony, and Universal, it shows, in my view. the fact that -- and I mentioned this in my opening remarks, that while access and distribution has become democratized, talent isn't and never will be.\n\nYou know, frankly, if talent was democratized, I'd be celebrating my entry into the NBA Hall of Fame. And the fact of the matter is that we seek out real, genuine talents that complemented and supplemented by our resources, our creativity, our skills. You know, create a very meaningful probability that that artist, whether it be on a local, regional, or global level, will be able to be successful. And it's those artists at the local, regional, and global levels that are driven by only a few companies in the world, one of which is the us.\n\nIt ended up dominating listening hours and the use of the music consuming public. Hopefully, that addresses your question, Stephen.\n\nEric Levin -- Chief Financial Officer\n\nAnd I'll take the second question. So, on your question on ByteDance, Stephen, so just I'll start by couching a little bit just that we don't talk to individual deals, but I can certainly talk to our approach, which I think will be helpful. First is we work with each partner, each platform. And one of our first goals is to help them and determine how we can work together to help them expand their products, their services, their reach that's positive to consumption, that's positive to competition, all of which, we think, are favorable to the music industry and Warner.\n\nThe second piece is we take each negotiation, and we look at the established growth trends and the projected growth trends of that platform in business. And we negotiate each deal to get what we think is full value from music out of that platform. As platforms evolve and as more information about how they've achieved over the past several years and more clarity into their product and expansion plans for the go-forward term, we will build all of that into our negotiation and attempt to get the best economics that we can out of that deal. Obviously, as I said before, we also seek to move our emerging streaming deals from fixed to variable deals as best as we can that requires them the systems, that requires that we're able to resolve the negotiation in a very favorable variable form.\n\nBut these are all things that come into the equation, and we work hard to make sure each deal for every single partner is rightsized and structured to help them succeed, to fully value music, and continue to build and expand our partnership. Hope that helps, Stephen.\n\nStephen Laszczyk -- Goldman Sachs -- Analyst\n\nIt does. Thank you very much.\n\nOperator\n\nThank you. Our last question comes from the line of Vijay Jayant with Evercore ISI. Your line is now open.\n\nUnknown speaker\n\nThanks. This is Ashton on for Vijay. Just have a quick question on some of these DSP price increases. Is there sort of any dynamics with the price increases and sort of changes in payment terms versus what you're getting before the price increase? Or is that a negotiation that comes up when DSP is increased?\n\nEric Levin -- Chief Financial Officer\n\nAshton, I think -- sorry, it was a little fainted, but I think your question is about price increases and how that affects our economics, if I have that right. And so, what we have said, and we'll continue to remind folks, is that certainly our major DSP partners are generally all on similar economic terms in a very tight band and are generally variable deals. So, as price increases roll through the market, we generally expect to share in the upside that that generates. So, as the average ARPU per consumer increases, that's positive and favorable for our economics.\n\nWhat I would say is that each affiliate is a complex mix of how they generate their revenue. They operate across both developed and emerging markets. Subscribers are growing in both developed and emerging markets. Each affiliate has a different mix for what their growth is, the different percentage from developed and emerging markets.\n\nOur ARPUs are different in developed markets and lower in emerging markets. But price increases, obviously, raise the whole boat and are favorable for us and the industry. And we're thrilled to see that price increases are starting to roll through. It's something we've been advocating for years and years.\n\nAnd it's really nice to see that distributors are starting to recognize that as well. Thank you, Ashton.\n\nOperator\n\nThank you. This concludes the question-and-answer session. I would now like to hand the conference back over to Steve Cooper for closing remarks.\n\nSteve Cooper -- Chief Executive Officer\n\nThank you. Just a couple last points. I want to thank my Warner colleagues, our artists, songwriters, partners, board of directors, and shareholders for allowing me to lead the company over the last 11 years. It's honestly been just an enormous amount of fun, incredibly interesting, and one of the greatest experiences of my working life.\n\nAnd I'm really honored to have been a small part of the incredible Warner Music Group journey. Number two, thanks again for joining us today, and I hope that everyone has a very happy Thanksgiving and a wonderful holiday season. So, goodbye for now.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKareem Chin -- Head of Investor Relations\n\nSteve Cooper -- Chief Executive Officer\n\nEric Levin -- Chief Financial Officer\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nJason Bazinet -- Citi -- Analyst\n\nKutgun Maral -- RBC Capital Markets -- Analyst\n\nStephen Laszczyk -- Goldman Sachs -- Analyst\n\nUnknown speaker\n\nMore WMG analysis\n\nAll earnings call transcripts"
}