{
  "companyName": "Rollins",
  "companyTicker": "ROL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/rollins-rol-q3-2022-earnings-call-transcript/",
  "content": "Rollins (ROL -0.33%)\nQ3 2022 Earnings Call\nOct 26, 2022, 10:00 a.m. ET\n\nOperator\n\nGreetings. Welcome to Rollins's third Quarter 2022 earnings conference call. At this time, all participants are now in a listen-only mode. A question-and-answer session will follow the formal presentation.\n\n[Operator instructions] Please note this conference is being recorded. I will now turn the conference over to Joe Calabrese. Thank you. You may begin.\n\nJoe Calabrese -- Investor Relations\n\nThank you. By now, you have all received a copy of the press release. However, if anyone is missing a copy and would like to receive one, please contact their office at (212) 827-3746 and we'll send you a release, and make sure you're on the company's distribution list. There will be a replay of the call which will begin one hour after the call and run for one week.\n\nThe replay can be accessed by dialing (877) 660-6853 with the passcode 137-33-118. Additionally, the call is being webcast at www.rollins.com and the replay will be available for 90 days. The company is also offering investors a supporting slide presentation which can be found on Rollins's website at www.rollins.com. We will be following a slide presentation on the call this morning and encourage you to view that with us.\n\nOn the line with me, today and speaking are Gary Rollins, Rollins' chairman and chief executive officer; John Wilson, vice chairman; Jerry Gahlhoff Junior, president and chief operating officer; Kenneth Krause, executive vice president, chief financial officer, and treasurer; and Julie Bimmerman, group vice president, finance, and investor relations. Management will make some opening remarks and we'll open the line for questions. Gary, would you like to begin?\n\nGary Rollins -- Chairman and Chief Executive Officer\n\nYes. Thank you, Joe, and good morning. We appreciate all of you joining us for our third quarter 2022 investor call. Julie will read our forward-looking statement disclaimer, and then we'll begin.\n\nJulie Bimmerman -- Group Vice President, Finance and Investor Relations\n\nOur earnings release discusses our business outlook and contains certain forward-looking statements. These particular forward-looking statements and all other statements that have been made on this call, excluding historical facts, are subject to a number of risks and uncertainties, and actual results may differ materially from any statement we make today. Please refer to today's press release and our SEC filings, including the Risk Factors section of our Form 10-K for the year ending December 31, 2021, for more information and the risk factors that could cause actual results to differ.\n\nGary Rollins -- Chairman and Chief Executive Officer\n\nThank you, Julie. I'm pleased to report that Rollins's third quarter performance was highlighted by continued growth in solid financials. As we look ahead, the company remains well-positioned to continue accomplishing our long-term business objectives. I'm also proud to welcome Rollins's new chief financial officer, Kenneth Krause.\n\nKen is a highly regarded business executive with more than two decades of financial and accounting experience. Ken is already contributing to our success. We welcome him to our team. Jerry, will you share more about Ken later? Let me now turn the call over to John Wilson, our vice chairman, who will provide some business updates.\n\nJohn?\n\nJohn Wilson -- Vice Chairman\n\nThank you, Gary. Good morning, everyone. Rollins delivered another strong performance this quarter, reflecting the solid execution of our operating strategies. I want to continue to emphasize that Rollins's success is a direct result of the efforts of the dedicated and caring people that work for our company.\n\nThis incredible team works hard every day to achieve our objectives and take great care of our customers. At Rollins, our people are our most valuable asset. Pursuant to that, we're always looking to improve our employee training and benefit offerings, as well as provide a workplace where they are respected and able to grow professionally. Last quarter, we announced a new partnership with Everside Health to offer an onsite health center providing primary care at our Atlanta home office and virtually nationally.\n\nThis new program offers free or reduced-cost primary care for all employees. We're pleased to share that since its opening four months ago, this effort has registered over 500 employee visits and filled over 300 prescriptions. We are very focused on enabling our employees to live healthier lives at home and at work while enjoying multiple benefits within this effort. With same-day and next-day appointments, this health center handles everything from routine screenings to chronic disease management.\n\nIt also offers onsite lab draws, medications, prescriptions, immunizations, and mental health services, as well as the ability to reach a care team 24/7 for urgent needs. Further, we plan to expand this free primary care offering to the covered dependents of our team members starting January 1st. Feedback to date has been extremely positive with a very high satisfaction rate. Ultimately, we believe that by providing easier access to these kinds of services, we are facilitating better health outcomes and happier, healthier employees.\n\nWe also recently expanded our employee stock purchase plan. This plan allows employees the option to purchase shares of Rollins common stock at a 10% discounted price through payroll deductions. Since we launched the plan in July 2022, we are pleased that over 2,200 employees have enrolled. This represents greater than 130% growth in employee stock ownership participants compared to our previous program.\n\nMost importantly, we want to encourage employee ownership in Rollins as we want everyone to think and act like owners in our company. In summary, guided by our commitment to employees and our culture, we feel these types of benefit programs and improvements are important to our long-term success. Not only by retaining and incentivizing our valued employees at all levels and for them to have a vested interest in our performance, but also by effectively position Rollins Brands as a leading contender for top talent. Last, I would like to discuss Hurricane Ian.\n\nThank goodness all of our employees in Ian's path are safe, but they have needed assistance through our Rollins Employee Relief Fund, our team provided over 170 emergency grants to impacted employees within the first 10 days following the hurricane to enable team members to address essential needs. Since then, the relief team has been processing multiple full grants to address employees who have endured even greater hardship. Our hearts go out to those affected by the hurricane but must acknowledge how excited we were about all our team members who have jumped in to assist those impacted in various ways. They quickly volunteered their time and energy, often after work hours to gather, load, and deliver supplies to those most in need.\n\nThis was a total team effort and we are tremendously proud of their care, compassion, and commitment to helping one another. Overall, while Ian shut down a total of 28 branch offices, 18 were only closed for a day or two, while the remainder opened by the end of the following week. Between these few location closures and the loss of several vehicles within our fleet, the impact on our employees in the days following the storm was far worse than the impact on our business. I'd like to now turn the call over to Jerry, who will provide more details on our quarter.\n\nJerry Gahlhoff -- President and Chief Operating Officer\n\nThank you, John. Good morning, everyone. In early August, we announced that Kenneth Krause would be joining Rollins as our new chief financial officer effective September 1st. Ken has many years of finance experience, most recently as a CFO of a large publicly traded global manufacturer.\n\nYou'll hear from him in a little bit. But for anyone who hasn't had the pleasure of speaking with him yet, he is passionate about business, very experienced, and has a unique combination of strategic, operational, and financial expertise. We're extremely pleased to have him as a member of our leadership team. I'd now like to walk through our 2022 third quarter performance focusing on items that directly impacted our operations during the period.\n\nKen will address the financials in more detail in a moment. Looking at our financial results Rollins's third quarter of 2022 was highlighted by revenue growth of 12.2% to $730 million, compared to $650 million in last year's third quarter. Net income was $108 million or $0.22 per diluted share. This is compared to $94 million or $0.19 per diluted share for the same period in 2021.\n\nOperationally during the quarter, all of Rollins's business lines continued to experience solid growth. Residential pest control increased by 9.8%, Commercial pest control was up by 11.4%, and Termites increased by 18.9%. Overall, organic presented a strong 8.6% total growth for the quarter. Next, I'd like to turn to the expense side.\n\nDuring the last few conference calls, we've discussed various inflationary pressures, primarily fleet-related costs, specifically fuel and vehicle repairs, and materials and supplies. We've also provided insights into the proactive actions we've been implementing to mitigate these pressures. In this context, I'm pleased to note that during Q3 we're beginning to see a gradual improvement in fuel prices. We've also been reducing our overall mileage per service visit through routing and scheduling initiatives.\n\nOverall, when compared to last quarter, Q3 presented a 5% reduction in fuel expenses. On the fleet side, as we discussed previously, we're keeping our trucks longer, forcing higher than normal costs for items like basic maintenance and tires, as well as some repairs outside of the norm. Recently, a small amount of new fleet vehicles are beginning to arrive from our primary manufacturers, which certainly will help. However, the quantities are less than what we historically received by this point in the year.\n\nLooking ahead, we're told by our manufacturers that the supply environment is improving and that potentially we could expect an uptick in inflow levels for new vehicles in the coming quarters. As we received similar assurances last year, we're certainly keeping a watchful eye on this and we'll keep you updated on future conference calls. On the Labor side, even through the tight labor market, Rollins remains well-positioned in effectively attracting, retaining, and deploying talent by prioritizing employee well-being, workplace inclusion, and professional development opportunities while also providing attractive employee benefits offerings. We have a track record of being a premier destination for talent.\n\nAs we headed into peak hiring season this year, we successfully integrated a recruiting software platform to allow our hiring managers to more efficiently recruit and engage with potential new candidates. This talent recruitment platform makes it easier for prospective team members to explore open positions on our career portals and apply for open positions in just a few minutes and they can do so easily from a mobile device. Our hiring managers can more easily prescreen candidates, communicate with them, and schedule interviews in a more streamlined way. As a result of this new and improved process, we averaged 35,000 job applicant submittals per month for the third quarter.\n\nAnd over the last five months, we have almost matched the total year 2021 application submittals. In short, by offering candidates an enhanced hiring experience, we've been able to successfully source and add qualified talent across the country despite the tight labor market. Next, I'd like to turn to acquisitions. Year to date, we've completed 27 acquisitions.\n\nFive of these were completed in the third quarter across Canada, Australia, and the US. In August, we announced the acquisition of Bug House Pest Control. Bug House Pest Control was founded by Mike Prosperi in 1993 and has grown to be one of the largest pest control companies in Georgia. Bug House serves residential and commercial customers throughout Central and South Georgia.\n\nWe are proud to welcome their more than 220 team members to Rollins. We continue to pursue potential opportunities as we look ahead to the remainder of the year and into 2023 our pipeline remains strong. Before I turn the call over to Ken, I want to emphasize how pleased we are with Rollins's strong third quarter performance. We're confident in our ability to continue driving growth and improving profitability in the business.\n\nI'll now turn the call over to Ken.\n\nKenneth Krause -- Executive Vice President, Chief Financial Officer\n\nThanks, Jerry, and good morning, everyone. It's great to be here and I look forward to working with Jerry and the team across Rollins as we continue to drive value for all of our stakeholders. During my first 60 or so days, I've had the opportunity to spend time with several of our key stakeholders. I've spoken with investors and attended investor conferences.\n\nI've spent time at industry tradeshows and visited with our teams in the field. It has been beneficial to interact with our investors, employees, vendors, and customers. As I reflect on my experiences thus far, I want to highlight two key observations. First, Rollins has a strong commitment to doing what is right and best for all of our stakeholders.\n\nOur commitment to our customers and employees is second to none. The company places a tremendous amount of effort into promoting a culture that is focused on solving our customer's problems the first time and providing our employees with a workplace where they can build a long and rewarding career. Second, our strategy is driving strong results. We have a very valuable business model, well-recognized brands, and a strong financial position by which we can drive profitable growth.\n\nLet me start by highlighting a few key accomplishments in the quarter. First, revenue growth was strong, with organic revenue growing just under 9% on an as-reported basis. Second, EBITDA margins were healthy at 23.3%, up 10 basis points versus the same period a year ago. Despite incurring higher casualty reserve charges, these charges weighed down EBITDA margins by approximately 140 basis points in the quarter.\n\nI will spend more time on the casualty reserve in a bit, but it was good to see the strong margin performance in this challenging inflationary period. Earnings per share improved by 15% to $0.22 per share. And free cash flow was very healthy with operating cash flow growing over 60% versus the same period a year ago. Let's now dive into the quarterly results in more detail.\n\nQuarterly revenue was $730 million, up just over 12% on a reported basis. This includes approximately 4% of growth from acquisitions. Currencies reduce sales growth by 50 basis points on the stronger dollar, notably versus the Canadian dollar, the Australian dollar, and the British pound. It was good to see strong organic growth across our service lines.\n\nAll services, commercial, residential, and termite services grew at a double-digit growth rate with very strong organic growth in commercial and termite businesses. Residential revenues increased by approximately 10%, with growth stemming from both acquisitions and organic activity. We also had strong growth across substantially all of our brands. We are not seeing any significant signs of slowing and retention rates are not changing materially.\n\nOverall demand for our services remains robust to start the fourth quarter. Turning to profitability. Gross profit was 52.3% of sales in the quarter, down 70 basis points from the same quarter a year ago. The decline is driven primarily by an increase in our casualty reserve to auto claims.\n\nAs I said earlier, this increase drove EBITDA margins down by 140 basis points in the quarter with the most significant impact on gross profit. This expense in the quarter was driven by a number of auto-related claims that matured in the quarter. These claims tend to change from time to time and we either reached a resolution or received additional information about the nature of the claim that provided a better estimation of the total liability associated with the claim in the quarter. Excluding this, we saw improvement in gross profit as pricing more than offset inflationary pressures and increases associated with people, fleets, and other areas.\n\nPricing and managing our margins remain at the top of our agenda. SG&A expense in the quarter was just under $214 million or 29.3% of sales, up approximately $20 million from the prior year. As a percent of revenue, we realized 60 basis points of leverage in SG&A on the double-digit sales growth, which helped offset the gross profit headwinds. GAAP operating income was $145 million or 19.7% of revenue, up 20 basis points from the year-ago period.\n\nEBITDA margin was 23.3%, up 10 basis points over the prior year. As I indicated, the increased expense associated with claims activity negatively impacted EBITDA margins by 140 basis points. I like to look at the business using incremental margins, or what percent of every additional dollar of revenue growth is converted to EBITDA. And in the quarter, on an as-reported basis, we generated 24% incremental margins, but over 35% when you consider the quarter included the higher expenses associated with the claims activity.\n\nGAAP net income was $108 million or $0.22 and earnings per share increased 15% versus the same period a year ago on the 12% increase in reported revenue. Turning to cash flow and the balance sheet, quarterly free cash flow was very strong in the quarter. We generated over $120 million of free cash flow on $108 million of earnings in the quarter. Free cash flow increased by over 60% in the quarter.\n\nWe made acquisitions totaling approximately $60 million in the third quarter and we paid just under $50 million in dividends. That remains negligible and debt to EBITDA is well below one time on a gross level. Cash balances approximated debt balances to the end of the quarter. Year to date, we have made acquisitions totaling just over $110 million and paid dividends of approximately 148 million.\n\nDebt balances are down $30 million since the beginning of the year and cash is up over $16 million, finishing at $122 million the finished the third quarter. Speaking of dividends, we increased our regular quarterly dividend last night to $0.13 per share, an increase of 30% versus the third quarter a year ago. With this announcement, this will enable us to realize an increasing dividend again in 2022. We are well-positioned to continue to maintain our balanced approach to capital allocation.\n\nOur focus is to consistently fund a regular dividend that increases as our business grows while continuing to use our balance sheet to fund additional acquisition-related growth. Our third quarter performance demonstrated the strength of our business model. Organic demand remains robust and we are well-positioned to continue to use our balance sheet to grow our business. The acquisition pipeline is very healthy and our strong cash flow and balance sheet position us well to invest in our business.\n\nWe continue to focus on execution and driving long-term profitable growth for our shareholders. With that, I'll turn the call back over to Gary for closing remarks. Gary?\n\nGary Rollins -- Chairman and Chief Executive Officer\n\nThank you, Ken. We're happy to take any questions at this time.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Tim Mulrooney with William Blair. Please proceed.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nYes. Good morning, everybody.\n\nGary Rollins -- Chairman and Chief Executive Officer\n\nGood morning.\n\nJerry Gahlhoff -- President and Chief Operating Officer\n\nGood morning.\n\nKenneth Krause -- Executive Vice President, Chief Financial Officer\n\nGood morning.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nSo first I wanted to ask on the residential business. Well, first, I should say congratulations on a great quarter. But, I wanted to dig into the residential business for just a second because there is some concern right now about the state of the consumer. And I was hoping that you could comment on the trends that you're seeing with respect to volumes in your resi business specifically.\n\nAre you starting to see any slowdown as we move from, August to September or October, given the increased macro uncertainty? And could you maybe comment on how lead generation these days compares to maybe last year?\n\nJerry Gahlhoff -- President and Chief Operating Officer\n\nTim, this is Jerry. The residential business is -- it remains strong. Certainly, leads are down a little bit. It's hard to always -- you don't know if it's economic, or is it weather-driven, those kinds of things.\n\nIt's hard to attribute it. Despite that, we still have challenges keeping up with the lead volume that we get in the quarter. And, when you also look at the quarter on the residential side, we were impacted at the end of the quarter. If you see it kind of dragging a little lower than the other two categories.\n\nWe were impacted by the worst possible time for that hurricane was the end of the month, at the end of the quarter. And that was a revenue drag in southwest Florida -- in parts of Florida where we're very heavily weighted on the residential side. And so that to end the quarter that was a bit challenging. And that certainly had more of a drag on residential revenue than necessarily some change in demand.\n\nI don't John, or anybody have anything to add there.\n\nJohn Wilson -- Vice Chairman\n\nWell, the only thing I would add, Tim, is that leads for residential has been down for some time. Quality of lead and lead closure has been up, leading to increased sales and increasing organic revenue. But lead closure -- or leads receives, excuse me, as a measure of the strength of the residential business, is not really necessarily a good yardstick. We continue to close at a higher rate and where we can be given some labor challenges, our teams are getting to the work.\n\nSo we're still seeing the strength and it is as strong as it was over the last couple of years. Maybe not, but we're very optimistic still about residential.\n\nKenneth Krause -- Executive Vice President, Chief Financial Officer\n\nThe only thing I would add as we as from a revenue perspective, as Jerry had pointed out, we had good revenue growth throughout the quarter. It was interesting when we look at the revenue growth by month throughout the quarter in the residential area, we saw a little bit of weakness in July associated with just some COVID exposures and some challenges with COVID. But August was exceptionally strong and September was very healthy as well. But unfortunately, our ability to deliver services was hampered by the hurricane which hit us late in the quarter.\n\nSo overall, business remains pretty well intact on the residential side.\n\nJerry Gahlhoff -- President and Chief Operating Officer\n\nAnd let's not forget that that hurricane also impacted South Carolina as well, went through there, which is another area where we have a large -- very large presence from a residential standpoint.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nOK. That's really helpful. Thanks for all the colors, everybody. So it sounds like.\n\nYeah. And Jerry, you're right. That's exactly what I was looking at. I was looking at the trends slowing down in residential, but it seems like that might be much more related to the hurricane than anything else.\n\nAnd it's still a very strong result. So it sounds like demand remains strong there. My last question is maybe for Ken or Julie. It's just a quick one.\n\nthat 8.6% organic growth figure, does that just exclude acquisitions? In other words, if I exclude the 50 basis points of foreign currency headwind, would organic growth have been more like 9.1% for the quarter?\n\nKenneth Krause -- Executive Vice President, Chief Financial Officer\n\nYou're thinking about that correct, Tim? We had a 50 basis point headwind on revenues. The 8.6 is an as-reported organic number. So adding back the currency headwind, your organic growth would have been just north of 9%.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nThank you, everybody.\n\nJerry Gahlhoff -- President and Chief Operating Officer\n\nThank you.\n\nKenneth Krause -- Executive Vice President, Chief Financial Officer\n\nThank you.\n\nJulie Bimmerman -- Group Vice President, Finance and Investor Relations\n\nThank you.\n\nOperator\n\nOur next question is from Ashish Sabadra with RBC Capital Markets. Please proceed.\n\nAshish Sabadra -- RBC Capital Markets -- Analyst\n\nThanks for taking my question. And again, let me add my congrats as well for the solid quarter. I just wanted to focus more on the cross-selling opportunities. I was wondering if you could talk about how much traction are you getting on cross-selling into your existing customer base.\n\nAnd also as the technicians are more appropriately staffed, how is that helping drive better sales momentum among your existing, but also new customers? Thanks.\n\nJerry Gahlhoff -- President and Chief Operating Officer\n\nSo a lot of what you see in the termite, an ancillary growth is a result of cross-selling to your existing customer base. So that's where we get a lot of the left is on the termite ancillary side directly through cross-sell opportunities. So that continues to remain strong and continues to be a great opportunity for us, for, certainly for years to come. We have seen a nice uptick this year also in technician sales that have in some ways offset a little bit of the lead decline and the better we know, the better staffed we are.\n\nWith technicians, the more technicians will actively sell. So getting that formula right is good. And we have certainly seen an uptick in technician-involved sales, which could be upgraded on the commercial side as well as on the residential side as well. We see we do see sales productivity ticking up with technicians.\n\nAshish Sabadra -- RBC Capital Markets -- Analyst\n\nAnd that's great. And maybe I can just have a follow-up question on the margins. The incremental margins of 35%, excluding the one-time item, looks like a very strong margin growth profile as we think about going forward, not necessarily from a guidance perspective, but as we think about some of the puts and takes. Inflation rolling over and revenue momentum being strong, is that the right way to think about incremental margins going forward? Thanks.\n\nKenneth Krause -- Executive Vice President, Chief Financial Officer\n\nYou know what, Ashish? I don't want to commit to something too early here. I do only 60 days or so. And, but what I'll tell you is the gross margin profile of 50 plus percent is certainly an appealing gross margin profile and provides me a sense of confidence in our ability to generate that type of margin profile. But what I'd ask for is a little bit of time to better understand the business and some of the drivers that we have in the business, but nonetheless, that gross margin profile that we do have and the pricing opportunities we have in our business gives me some confidence in our ability to continue to improve our margins going forward.\n\nAshish Sabadra -- RBC Capital Markets -- Analyst\n\nThat's great. Congrats once again on such a good quarter.\n\nKenneth Krause -- Executive Vice President, Chief Financial Officer\n\nThank you.\n\nJerry Gahlhoff -- President and Chief Operating Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] Our next question is from Seth Weber with Wells Fargo Securities. Please proceed.\n\nSeth Weber -- Wells Fargo Securities -- Analyst\n\nHey, good morning, everybody. And welcome, Ken. I guess I wanted to ask a question on pricing. Can you just kind of catch us up on where you're at with pricing? I think you pushed through increases in April, and May.\n\nAnd I think on the last call you talked about that was going to be it for the year, but you just maybe talked to us about it. You know your thoughts on pricing going forward, whether you if the inflationary environment continues, whether you might take another shot at raising pricing, and just whether it sounds like maybe there's been a little bit of pushback on, maybe some, maybe attrition picked up a little bit is what it sounds like from your messaging. But if there's -- if you're seeing any kind of. customer churn based on the pricing actions you've taken.\n\nThanks.\n\nJerry Gahlhoff -- President and Chief Operating Officer\n\nWe feel like our price increase program was very successful this year. And, and, certainly, as Ken noted, it attributed some of our success here in the third quarter to pricing not only through our -- through rate increases but also to increase our rate cards, and our new sales pricing is up rather significantly. That's, that's been helpful. Our strategy will be to get through the rest of this fiscal year.\n\nIn January we'll all meet again and we'll have a discussion about our price increase strategy for 2023 and assess what the economic environment looks like, what's going on, and make some determinations at that point. We need to have those discussions fairly early in the year if we're going to keep it on the same cycle to be able to deploy that price increase by March and April time frames. Should we depend on what levels we go at? So -- and part of that process in January will also be a very lengthy look back, detailed look back into our price increase campaign this year, what the impact on raw rollbacks and customer retention was. And we'll use those data to help us determine what our plan will look like in 2023.\n\nWe've monitored that. We haven't noticed any real significant jump in retention due to pricing. So, we feel pretty good about where we are right now.\n\nSeth Weber -- Wells Fargo Securities -- Analyst\n\nOK. That's helpful. Thanks. And then.\n\nJust maybe, can you just touch on what you're seeing in the international markets? I know it's not a big part of your business, but if there are any notable changes in trends internationally versus the US. Thanks.\n\nJerry Gahlhoff -- President and Chief Operating Officer\n\nI guess, internationally usually we see some of the and a little bit of some of the impact in the UK of their inflationary pressures there, but that -- our business in the United Kingdom is doing quite well. That team there thriving. Same in Australia, they're performing very well. So we're very happy with the results that we're getting internationally.\n\nSingapore's a little down. They've had some -- a little more challenges on the revenue growth side and that's been large. They were engaged during the peak of COVID with a lot of disinfection services, and some of those disinfection services have disappeared. And so they've struggled a little bit more, not necessarily because of any economic conditions, more just a shift in what's going on in the market from a pest control and disinfection standpoint.\n\nBut overall, internationally, I think Canada as well or Canadian operations are doing fantastic and they're growing well. So it's all very positive on that front.\n\nSeth Weber -- Wells Fargo Securities -- Analyst\n\nGreat. OK. Thank you very much, guys. Appreciate it.\n\nOperator\n\nOur next question is from Stephanie Moore with Jefferies. Please proceed.\n\nHans Hoffman -- Jefferies -- Analyst\n\nHi. This is Hans Hoffman, filling in for Stephanie. Thanks for taking my question and congrats on the quarter. I was just wondering, could you maybe dive in a bit on kind of what drove the strength in the commercial and termite business?\n\nJerry Gahlhoff -- President and Chief Operating Officer\n\nI didn't quite catch what you asked for specifically. Could you repeat your question for me?\n\nHans Hoffman -- Jefferies -- Analyst\n\nYeah. Did you just, talk a little bit sort of what drove the strength in the commercial and termite business?\n\nJerry Gahlhoff -- President and Chief Operating Officer\n\nA lot of that is having feet on the street and staff, and having the staffing and the quality team on both the commercial and a number of home inspectors we have in the field. It's really about being a staff to handle demand and drive those drive the sales results that we get. You look at our headcount of commercial account managers and our head -- the volume of home inspectors that we've added over the last 12 to 18 months. That's by far the largest driver of the growth that we're seeing.\n\nThose folks have been very successful. Given the tools and infrastructure that we give them to be successful in their sales jobs. And by far, I think that's been the biggest driver. John, do you have any other opinion on that?\n\nJohn Wilson -- Vice Chairman\n\nYeah, I think you hit the nail on the head, Jerry. It's all about having the right amount of people to handle the production of the sales needed to grow those service lines. That only grows by having feet on the street. Not by -- it's not lead-driven.\n\nI guess what I'm trying to say is like the residential side. So you got to have those bodies in front of those customers.\n\nHans Hoffman -- Jefferies -- Analyst\n\nGot it. Thanks.\n\nOperator\n\nWe have reached the end of our question-and-answer session. I'd like to turn the conference back over to management for closing comments.\n\nGary Rollins -- Chairman and Chief Executive Officer\n\nOK. Well, thank you for joining us today. We appreciate your interest in our company and we look forward to updating you in February for our fourth quarter earnings. Thanks again.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJoe Calabrese -- Investor Relations\n\nGary Rollins -- Chairman and Chief Executive Officer\n\nJulie Bimmerman -- Group Vice President, Finance and Investor Relations\n\nJohn Wilson -- Vice Chairman\n\nJerry Gahlhoff -- President and Chief Operating Officer\n\nKenneth Krause -- Executive Vice President, Chief Financial Officer\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nAshish Sabadra -- RBC Capital Markets -- Analyst\n\nSeth Weber -- Wells Fargo Securities -- Analyst\n\nHans Hoffman -- Jefferies -- Analyst\n\nMore ROL analysis\n\nAll earnings call transcripts"
}