{
  "companyName": "United States Steel",
  "companyTicker": "X",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/28/united-states-steel-x-q3-2022-earnings-call-transc/",
  "content": "United States Steel (X -2.03%)\nQ3 2022 Earnings Call\nOct 28, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, everyone, and welcome to United States Steel Corporation's third quarter 2022 earnings conference call and webcast. As a reminder, today's call is being recorded. I will now hand the call over to Kevin Lewis, vice president, investor relations and corporate FP&A.\n\nKevin Lewis -- Vice President, Investor Relations and Corporate Financial Planning and Analysis\n\nThank you, Tommy. Good morning, and thank you for joining our third quarter 2022 earnings call. Joining me today on today's call is U.S. Steel president and CEO, Dave Burritt; and senior vice president and chief strategy and sustainability officer, Rich Fruehauf.\n\nAlso, a special welcome to our senior vice president and CFO, Jessica Graziano, joining us this morning for her first earnings call at U.S. Steel. This morning, we posted a slide issued yesterday along with our remarks today, are made as of today, and we undertake no duty to update them as actual events unfold. I would now like to turn the conference call over to U.S.\n\nSteel president and CEO, Dave Burritt, who will begin on Slide 4.\n\nDave Burritt -- President and Chief Executive Officer\n\nThank you, Kevin, and good morning to everyone joining us today. We appreciate your continued support of U.S. Steel. We delivered another strong performance in the third quarter.\n\nMost importantly, we did it safely. We had one of the safest summers in our history and are on track for a third consecutive year of record safety performance. While we certainly don't focus on safety for awards, we are pleased that our industry-leading safety performance was recently recognized. Not once, but twice.\n\nBoth the National Safety Council and World Steel awarded U.S. Steel Safety programs with Safety Excellence Awards, further validating our leadership role in placing safety first. At U.S. Steel, we have a culture of caring that extends through our facilities.\n\nExceptional safety means exceptional operations. Thank you to my U.S. Steel colleagues for doing your job safely for yourself, for your coworker, and for your families. We'll spend the next 15 minutes or so providing you with a business and strategy update.\n\nThere's a lot of noise out there, but one thing is clear, we are confident in our ability to execute our best for all future. I remain bullish on U.S. Steel's future. We are better positioned now more than ever to confront market uncertainty and to prove the foundational strength of our business.\n\nThe challenges we face today remain transitioning to a less carbon and less capital-intensive business model while becoming the best steel competitor. Our strategy creates a path to achieve these goals and reach our best for all future. To become the best, you have to outperform the best. That's why we're expanding our competitive advantages and expanding our low CapEx, low GHG emission EAF steelmaking, and value-added capabilities to meet customer demand.For example, we are leveraging our unique raw materials advantage to support our growing electric arc furnace fleet.\n\nEarlier this month, we were joined by Governor Walz in Minnesota at the groundbreaking ceremony for our DR-grade pellet upgrades at Keetac. The excitement from the team and from the community was invigorating, and everyone involved appreciates the importance of this investment as an integral part of our best overall strategy. We're another quarter closer to the earnings and free cash flow growth our strategic projects will generate, each project remains on time and on budget. This means we'll be we'll continue to have a balanced approach to capital allocation focused on driving long-term stockholder value.\n\nWe're also pleased to see the recent reinforcement of trade policies by the U.S. government. These policies are critical to ensuring national and economic security and ensuring a level playing field for American steelmakers. We are also optimistic that the Chips and Science Act, Inflation Reduction Act, and Infrastructure Bill will positively impact steel demand in 2023 and beyond.\n\nOur country is a leader in sustainable steelmaking and we are encouraged the administration continues to support the role American manufacturing plays in the global economy. This gives us the confidence to deliver our best overall strategy for our employees, our customers, and most importantly, our stockholders. Let's get into this morning's materials on Slide 5. I'll focus on three key areas that are helping to advance our best for all future.\n\nFirst, we're operating from a position of strength. While we're facing the same economic and geopolitical uncertainties as everyone else, the steps we've already taken have us well-positioned to execute our strategy with confidence. We are closer to our customers and continue to add the capabilities to expand our offerings of steel solutions. Second, we're safely navigating current headwinds.\n\nWe've taken steps to optimize our footprint and remain disciplined on cost. We also remain on track to generate higher and more stable through cycle earnings and free cash flow as we execute our strategy. Our future is extremely bright. Finally, we're returning capital stockholders, as we've demonstrated through our progress against our stock repurchase program.\n\nWe continue to invest in strategic projects that will grow earnings and free cash flow, and reward stockholders with direct returns. Our balance sheet is strong, which allows us to sustain the actions that drive long-term stockholder value, even as markets are volatile. Slide 6 details how our improved business model has us operating from position of strength. We have redefined steel making for U.S.\n\nSteel since the last cycle, strengthening our business model in the process, and we will only get stronger as we complete our strategic projects. We are a more innovative company and continue to add differentiated capabilities. Since the last cycle, we've invested to revitalize and strengthen our North American flat roll assets, enabling record safety, record quality, and record reliability. We also continue to build our position in flexible, sustainable mini mills steelmaking.\n\nOur customers are less than a year away from benefiting from the 200,000 tonnes-per-year state-of-the-art electrical steel line nearing completion at Big River. We will be uniquely positioned with products ranging from 0.25 millimeter to 0.5 millimeter gauge to serve high-end electric vehicle grades of steel. Consumers want electric vehicles that are more efficient and effective, and U.S. Steel is helping to unlock that potential.\n\nWith the completion of Big River two, including a differentiated portfolio of downstream finishing lines to serve the automotive and paint markets. Our minimal segment is expected to deliver $1.3 billion of annual through-cycle EBITDA, supported by only $100 million of annual sustaining CapEx. That will be a new source of significant cash flow generation for business, cash flow that earns a premium for our investors. We expect to improve the financial performance of the business by lowering our capital intensity.\n\nWe're also lowering our carbon intensity to achieve our bold 2030 and 2050 goals. These factors encourage us to move faster on our transformative strategy. On Slide 7, you can see our balance sheet has already been transformed. We have record cash and record liquidity.\n\nWe have no meaningful near-term debt maturities, 80% of our total debt is due in 2029 and beyond, and we have overfunded pension and OPEB plans. On Slide 8, our transformed balance sheet pre-fund our strategic investments with record cash and liquidity. Our strategic investments remain on time and on budget. By year-end, we will be nearly 40% completed on our pre-funded strategic projects.\n\nLooking forward to 2023, we expect total CapEx spending of approximately $2.5 billion. Jess will provide more details on next year's CapEx plan shortly. Turning now to Slide 9, we are safely navigating current headwinds with decisive management actions, across North America and flat-rolled we responded quickly to soften demand and cautious buying. We accelerated planned outages and temporarily idled integrated assets to better align supply with demand across our diverse end markets.\n\nIn our minimal segment, we foreshadowed the negative impact higher raw material prices would have on Big River in the third quarter. We were prudent and moved quickly to secure additional raw materials as the Ukraine war intensified, to protect our customers and our operations. These types of supply shocks reinforce the rationale for the metallic strategy we have underway. Our low-cost iron ore advantage in Minnesota will protect our electric arc furnaces from market price fluctuations, as our Gary pig operation begins production in early 2023.\n\nTemporary headwinds aside, we remain confident in the strategic and financial impact of the Big River steel operating model, and we look forward to demonstrating the through-cycle value of the segment in 2023 and beyond. Moving next to our European segment, the prolonged and tragic conflict in Ukraine has continued to pressure our European business on costs for both raw materials and energy. The uncertain outlook for the global economy and Europe's manufacturing sector is also contributing to softer demand and lower prices, which compounds the impact of normal seasonal buying patterns. While we don't believe these are permanent impacts, we do expect these pressures to persist.\n\nIn response, we are executing management actions. In September, we pulled forward a planned 60-day outage on blast furnace number two at [Inaudible] to better align supply with customer demand. We've also reduced our overhead costs in response to lower production. We're focused on the things we can control to balance supply with customer demand and improve our cost position heading into 2023.\n\nOur tubular segment remains an outperformer, benefiting not only from solid energy market fundamentals but the strategic investment we made in electric arc furnace rounds production. We continue to run at high levels of utilization to support robust customer demand for seamless OCTG products. We're further benefiting from the $100 million of annual savings from the in-source rounds substrate. Recent trade actions also provide important positive impacts on the segment.\n\nTurning to Slide 10. I want to reinforce the importance of returning capital to stockholders, as part of our previously shared capital allocation framework. Our balance sheet is strong. Our investments are on track.\n\nAnd most importantly, we continue to see significant value in direct returns to stockholders. U.S. Steel is uniquely positioned to deliver higher earnings and expand our multiple, which means we expect to continue repurchases under our existing authorization as we enter 2023. With that, I'd like to welcome our new CFO, Jessica Graziano, to her first earnings call with U.S.\n\nSteel. I'll turn it over to Jess now to cover the financials, Jess.\n\nJessica Graziano -- Senior Vice President, Chief Financial Officer\n\nThanks, Dave, and good morning, everyone. Thanks for joining us today. I'm so pleased to have joined U.S. Steel at this point in its history and to be a part of the transformation that's underway.\n\nOur compelling best for all strategy and the opportunity it creates to generate significant value are two key factors that attracted me to this role. I'd like to start by saying thank you to Kristy Breathes as she passes the baton. Not only am I grateful for Christy support in transition, but I'm thrilled to inherit the pristine balance sheet, she was so instrumental in building. Our record level of cash on the balance sheet is a highlight for the third quarter.\n\nWell, we've seen some demand softness and some expected transient cost headwinds. More on that in a moment. I'll also provide some color on our guidance to finish the year. But let's start on Slide 11, with the third quarter results.\n\nWe delivered adjusted EBITDA of $848 million in the third quarter from revenues of over 5.2 billion. This represents an adjusted EBITDA margin of 16%. Our adjusted EPS in the quarter was $1.95 per share, which was at the high end of the guidance range we provided in our September 15th press release. We generated nearly $600 million in free cash flow in the third quarter, and that's after investing close to $500 million to support the execution of our strategy.\n\nTaking a closer look at the balance sheet. Total liquidity on September 30 was a record $5.8 billion, including just under $3.4 billion in cash. Leverage at the end of the quarter was 0.7, times significantly below our target range of 3 to 3 and a half times adjusted debt to trailing 12-month EBITDA. In Treasury, we issued $290 million of low coupon, 30-year environmental revenue bonds in support of our big River two investment.\n\nThis green bond commitment underscores our effort to use a high value of recycled scrap in our many mill operations, and the strong investor turnout demonstrates the market's conviction for our best for all strategy. We also successfully repurchased approximately $300 million of shorter-dated higher coupon debt in the quarter. Together, these actions extended our maturity profile. They reduced our run rate cash interest expense by $5 million per year, and they maintained our strong leverage position, and further enhance the balance sheet.\n\nLet's take a closer look at each of our operating segments. North American flat-rolled EBITDA was 631 million, which reflects a healthy EBITDA margin of 19%. The segment continues to deliver solid earnings due in part to fixed contracts that make up a significant portion of its order book, as well as quarterly market-based contracts. These fixed and longer-term contracts take some of the noise out of market price fluctuations.\n\nAs a result, our average selling price remained resilient through the quarter, declining about 8% versus a spot market that declined 36%. Shipment volumes declined 8% off their two-year high watermark in the third quarter, as broader economic concerns have some customers limiting their order exposure. We were quick to respond with footprint decisions as we started to see demand soften. In the quarter, we idled the blast furnace at each Gary and Mandalay works.\n\nBoth blast furnaces remain temporarily idled today and will be brought back online when customer demand warrants it. Moving to our mini mill segment, which experienced headwinds in the quarter that weighed on both EBITDA and margins. Notably, we foreshadowed the headwind Big River was facing to absorb higher-priced metallics costs, particularly pig iron when we provided guidance in mid-September. The impact of those higher costs is temporary and we expect to work through them by year-end.\n\nIn the third quarter, that impact was an eight-point drag on EBITDA margins for the segment. Not unlike what we experienced in North American flat world, demand softening through the quarter was an additional challenge for Big River. This was especially the case in service centers and with distributors where Big River has more exposure as a percentage of their total order book than the Flat World segment. Big River also has more exposure to spot business, which felt the impact of lower steel prices on its margins in the third quarter.\n\nSimilarly, higher raw material costs and commercial headwinds were at play in our European segment. This was compounded by the spike in energy costs across Europe, which pressured results for the third quarter, and resulted in the significant EBITDA decline in the segment. Like we did in North American Flat-rolled, we took action in Europe to respond to these headwinds, which included overhead cost reductions. We also pulled forward a planned 60-day outage on blast furnace number two from October into September.\n\nThis furnace will stay offline until customer order activity improves. Looking forward, a weak manufacturing outlook in Europe and persistent raw material and energy cost headwinds create a challenging backdrop for USSE for the remainder of 2022 and the start of 2023. Our tubular segment remains a bright spot. EBITDA and margins in the segment are meaningfully increased sequentially behind strong customer demand and higher pricing.\n\nLet's move to the fourth quarter and I'll share some thoughts on each of our operating segments. In our North American Flat-Rolled segment, we expect volume to remain stable throughout the fourth quarter. However, September volumes represented a low in the third quarter, so sequential shipments will be lower. We expect the pace of steel prices to decline similarly to what we experienced in the third quarter.\n\nAnd on [inaudible] first quarter EBITDA for the flat-rolled segment will be down sequentially. In our mini mill segment, we expect EBITDA to decline in the fourth quarter as we continue to work through the higher-cost metallics inventory. Most steel prices will continue to impact margins for the fourth quarter, reducing our average selling price sequentially. In Europe, we expect lower sequential EBITDA from lower average selling prices.\n\nA big headwind given half of Europe's volumes are at spot rates. We also expect reduced shipment volumes and elevated raw material costs will continue to drag on segment EBITDA in the fourth quarter. And lastly, in our Tubular segment, we expect this business will continue to generate robust results in response to strong demand. Prices will continue to be healthy across steady volumes.\n\nOur Fairfield EAF will operate at near maximum capacity for seamless pipe in the fourth quarter. And when you tally it up, we expect fourth-quarter adjusted EBITDA for the company to be approximately $400 million, delivering a full year of over $4.2 billion in adjusted EBITDA, the second best ever for U.S. Steel. As we've mentioned, we continue to see tremendous opportunity to create value through capital returns and are pleased with the progress we've made so far in our share repurchase program, which is covered on Slide 12.\n\nShare repurchases in the third quarter totaled $177 million, bringing our total buyback activity to $850 million since the fourth quarter of 2021, and reducing our share count by 38 million shares or about 13% of our outstanding base. We expect to continue repurchases under our current $500 million program through year-end. Before I hand the call back to Dave, let me take a few moments to provide some additional detail on our 2022 and 2023 capital spending on Slide 13. We expect our 2022 total CapEx spending to be under $2 billion, which is about $300 million less than we originally forecasted.\n\nProjects remain on time and on budget with an unchanged scope and will be approximately 40% done by the end of the year. That $300 million spending update is all timing as we expect some of our construction payables will be paid in Q1 next year. Looking forward to 2023. We expect capital spending to be in the neighborhood of two and a half billion dollars.\n\nAs planned, we will invest a significant portion or about $1.7 billion for in-flight strategic projects. Notably Big River 2 make up about $1.4 billion of the total. While the level of strategic capital spend in material in 2023 for Big River 2, and our low-cost iron ore, mini mill steelmaking, and best-in-class finishing projects, we expect spending will ramp down in 2024 as we move toward commissioning and full operations of these projects. As a matter of fact, two of these projects will achieve significant strategic milestones in 2023.\n\nFirst, our Gary Works pig machine is expected to commence operations in the first quarter, supplying big river steel with low-cost metallics. This will accelerate the competitive cost advantage gained by our using internally produced pig iron. In addition, we expect to begin operating our state-of-the-art non-grain-oriented electrical steel line in the third quarter. Trials have been successful and we expect to be well-prepared to meet robust customer demand for electrical steels later next year.\n\nLastly, we are carefully managing investments across our existing operating footprint and we expect capital spending in those facilities to total about $650 million in 2023. And with that Dave, back to you.\n\nDave Burritt -- President and Chief Executive Officer\n\nThank you, Jess. Before we open the line for questions, let me summarize today's prepared remarks on Slide 14. Our solid performance amid challenging conditions in the third quarter is a result of our continued focus on safe and reliable execution. It's the product of some heavy lifting over the past few years, and I'm pleased but not satisfied with where we are today.\n\nWe are operating from a position of strength, with a historically strong balance sheet that put us in a position to execute with confidence. We are safely navigating the current headwinds. We are operating our footprint to match demand and remain disciplined on cost. We are on our way to becoming a more capable, more agile, and increasingly differentiated producer of innovative and sustainable steel Solutions.\n\nWe're also returning capital to stockholders. We look forward to delivering on our earnings and cash flow commitments so that we can continue to reward stockholders with direct returns. As I said, I remain bullish about our future. We are better positioned than ever and we are confident in our ability to execute.\n\nKevin, let's move to Q&A.\n\nKevin Lewis -- Vice President, Investor Relations and Corporate Financial Planning and Analysis\n\nThank you, Dave. Our first question comes from say Technologies. We received a few questions on our demand outlook and growth strategies. Dave, can you share your thoughts on outlook and growth, please?\n\nDave Burritt -- President and Chief Executive Officer\n\nYeah, thanks. I think that's an important question and it's kind of a boil-the-ocean question. So I hope you're sitting down because I'll probably run through a bit of a stream of consciousness here as we think about the remainder of the year and then 2023 and beyond. But to be clear, on the remainder of 2022, we've got near-term challenges, there's no doubt.\n\nAnd as we think about considerations for 2023 and then beyond, the future is very bright, as I said, bullish. So the remainder of the year demand headwinds likely persists into the fourth quarter. Automotive has been more resilient. We expect a flat to maybe slightly up shipments in the fourth quarter versus the third quarter for appliance impacted by consumer sentiment.\n\nAnd we saw some slowdown in shipments in the third quarter. Service centers and industrial and construction, cautious buying saw shipment growth in industrial machinery and container containers in the third quarter. There's a resilient demand from construction, energy. It's unique exposure and strong market for us today.\n\nEnergy shipments increased over 10% in the third quarter for both flat-rolled and Big River. So as we think about the remainder of the year, yes, there's the near-term challenges, but as we get into 2023 and beyond, things get better. Expect to see growth in steel demand in 2023. Recently, you probably saw that the growth forecast from World Steel, which is up and modestly pockets of demand, we're uniquely positioned to serve in We think there's opportunities for us to grow share and in appliance.\n\nAnd I think, appliance is a strategic market for us, and we're a key supplier on several or several of popular appliances. We're encouraged by feedback from the automotive negotiations and optimistic there's pent-up automotive demand and build rates will be higher next year. Automotive customers already signaling higher steel consumption in 2023. So that's all good news.\n\nWe're uniquely positioned, we believe, to sell a portfolio of differentiated, differentiated automotive products, advanced high strength, steel exposed automotive steel solutions, vertex deals, our grain steel, and of course now non-grain oriented electrical steels that we're finishing up at Big River. Beyond the market, specific considerations demand catalysts, and chips, and inflation reduction acts, and infrastructure. And there's some really good news coming, but that's probably a longer-term strategic market growth to outpace overall market growth, demand for grain steel, rapid electrification infrastructure, that kind of list goes on. One of the key things that we've learned from the pandemic and the conflicts that we see geopolitically is that there's on shoring and strengthening of regional supply chains should also positively impact demand.\n\nThe things we think about is where we must win, our advanced high-strength steel, and automotive and non-automotive applications. Electrical steels will feel great about this. We'll have the world-class NGL line this next year, and grain steel with our vertex line of sustainable steel that gives us important reductions in GHG. So to win, as you think about us in the future, we're building differentiated capabilities, we're not trying to be the biggest, what we want to be is the best that we're building capabilities.\n\nWe're focused on product and process innovation and the things we're doing in that space we should be able to have some breakthroughs over time. And we're getting some top talent in the organization. We're working differently, we're more nimble, we're more flexible. We allow folks to work from wherever, and we're attracting talent we never would have had access to because we are so much more flexible in our work for more ever design.\n\nSo our goal is basically over this horizon, the future is profitable growth in the markets we serve. And as I said, near-term challenges longer term are very bright.\n\nKevin Lewis -- Vice President, Investor Relations and Corporate Financial Planning and Analysis\n\nOK. Thanks so much, Dave. Tommy, you may now cue the phone line for questions. [Operator instruction] \n\nOperator\n\nThank you very much. Once again, if you would like to register a question, [Operator instructions] And we'll get our first question on the line from David Gagliano with BMO Capital Markets. Go right ahead.\n\nDavid Gagliano -- BMO Capital Markets -- Analyst\n\nHi. Thanks for taking my questions. First, I just want to ask a little bit about Europe and [Inaudible] Particularly, you've got one of three blast furnaces idled there, given the operating headwinds that you flagged. What are your plans for the other two blast furnaces\n\nDave Burritt -- President and Chief Executive Officer\n\nWell, David, thanks for that question. And there's no doubt that it's an increasingly challenged market backdrop over there. That the broader macro considerations are clearly impacting the steel markets, and buyers have been focused on destocking, limiting the [inaudible], and that continues across, frankly, all of Europe. We got the continued raw material prices, elevated energy costs, and the big wildcard there, the Ukraine war.\n\nWe have [inaudible] offers there and as we say, we will be nimble and adjust to whatever it takes to make sure that we continue to keep those operations robust and strong. But I have to pivot a bit here because at some point in time, there is going to be a great opportunity for that facility to expand and grow. With the steel shut off from Russia and the damaged mills in Ukraine and U.S. Steel just 60 kilometers away from the border.\n\nWe're uniquely positioned to provide value to that construction market. So as far as shutting off another flat blast furnace, we'll see what the demand holds and what that looks like. But longer term, we should be in good shape. We're going to adjust and be as nimble as we can in the short term manage these headwinds.\n\nBut at some point things turn around and then it'll be so robust overheads will probably snap back as we start to build up rebuild Ukraine and the surrounding area there.\n\nDavid Gagliano -- BMO Capital Markets -- Analyst\n\nOK. Thank you. I just have a two-part follow-up here. On capital returns, obviously, we've got elevated spending and we've got a stormy outlook near term.\n\nPart one is why not pause the capital returns and focus on making sure that balance sheet stays robust. And then the other part of my question, I was wondering if you could comment on the negotiations with the unions in the U.S. Thanks.\n\nDave Burritt -- President and Chief Executive Officer\n\nYeah, David. I'm not sure I completely understood the stock buybacks were committed to the stock buyback program and making sure and maybe just you can just fill in the gaps. You heard her say earlier the $38 million that we reduced so far, we are committed to this. This is part of our program.\n\nThis is what we're doing. We're making sure we're rewarding stockholders, Jess.\n\nJessica Graziano -- Senior Vice President, Chief Financial Officer\n\nGreat. Thanks, Dave. Yeah, I think you can think about it as against the backdrop of a balance sheet that is dare I say, the strongest steel against the opportunity that we have, as we even think about looking forward into 2023 to continue to generate cash flow, even in an environment where we are going to be spending frankly, the bulk of cash toward our strategic investments in 2023. We don't want to get ahead of ourselves as we go through the 2023 planning process.\n\nAnd we certainly don't want to get ahead of our board, but we feel very comfortable that listen, this is an end strategy. There is strength in the business and strengthen the cash flow enough for us to feel very comfortable, to continue to underwrite, continued share repurchases at a minimum through the end of the year. And then, as I mentioned, not getting ahead of the board and not getting ahead of our planning process. But as we look forward into 2023, we feel very comfortable that we can continue to frankly afford our strategic initiatives without any trouble and be able to return excess cash to our shareholders.\n\nIt's a very strong place to be.\n\nDave Burritt -- President and Chief Executive Officer\n\nAnd David, your second question was an update on the labor agreement. Did I hear that right?\n\nDavid Gagliano -- BMO Capital Markets -- Analyst\n\nYeah.\n\nDave Burritt -- President and Chief Executive Officer\n\nOK. Yeah. Well, we continue to bargain in good faith. I just say I'm optimistic about the framework being developed, and we're confident that we'll reach an agreement that is best for all, best for our employees, best for our customers, and best for our stockholders.\n\nThat enables us to make sure we fulfill our commitments on getting these strategic investments completed. We've made good progress so far, and we're taking the necessary time to make sure we get an appropriate agreement that is best for all. We'll give you an update as soon as we have an agreement.\n\nOperator\n\nThank you very much. And proceed to our next question on the line from Tristan Gresser, BNP Paribas, Exane. Go right ahead.\n\nTristan Gresser -- Exane BNP Paribas -- Analyst\n\nYes. Hi. Thanks for taking my question. The first one is n Europe, the European Commission, as recently approved, I think under EU state aid rules to Slovakian schemes for a budget of above a billion euro to help companies decarbonize in the country.\n\nSo my question is, have you applied? Or do you plan to apply to those schemes? And if so, for what type of project facilities, and how confident are you to receive public funding there? Thank you.\n\nDave Burritt -- President and Chief Executive Officer\n\nYeah. Thanks for the question. I'll turn it over to Rich Fruehauf here. One of the keys to our strategy is to make sure that we have a lot of optionality.\n\nThat's why we have so much cash and so much liquidity. And so that's a key ingredient to the way we look at all things. Maybe, Rich, you could talk a little bit about the opportunity in Slovakia.\n\nRich Fruehauf -- Senior Vice President, Chief Strategy and Sustainability Officer\n\nYeah. Thanks, Dave. So, yeah, you're absolutely right. The EU Commission did recently approve the Slovak schemes.\n\nObviously, USSK is a major employer and source of CO2 in Slovakia. So we've been watching that process very carefully. There is an allocation toward decarbonizing heavy industry in Slovakia, that we would anticipate being part of the scheme when the government of Slovakia issues the call for projects. We're pleased with the support toward decarbonization we've seen so far in Europe and in Slovakia.\n\nI think it's part of a comprehensive approach to decarbonizing these energy-intensive industries. And as I mentioned, USSK is a significant portion of the CO2 emissions that Slovakia needs to address. We look forward to doing our part there. And we're looking at what's the best path forward for our Slovak operations.\n\nAnd obviously, we would look at any opportunity to see what's available to help that path forward from the government of Slovakia. So we're evaluating that right now. And we'll let you know where we head as we complete that evaluation.\n\nTristan Gresser -- Exane BNP Paribas -- Analyst\n\nAll right. That's very helpful. Just maybe a follow-up. Do you have any timeline regarding the approval process in Slovakia?\n\nRich Fruehauf -- Senior Vice President, Chief Strategy and Sustainability Officer\n\nWell, I think that's really something that's up to the Slovakian government. Again, they have to issue, as I understand, their process, a call for projects. So really, that's the next step is how the Slovakian government moves forward with its process. And as I said, we'll be watching that very carefully.\n\nAnd as Dave said, evaluating the options under that called process from the Slovak government.\n\nOperator\n\nThank you very much. We'll now proceed to our next question on the line from Emily Chieng with Goldman Sachs. Go right ahead.\n\nEmily Chieng -- Goldman Sachs -- Analyst\n\nGood morning, David and Jess. Thank you for taking my questions. My first is just a follow-up around sort of the cash flow questions that we've had so far this morning. Could you please help us with how you're expecting to see the working cap release patch in the fourth quarter and into 2023 and how that could help to support free cash flow generation?\n\nJessica Graziano -- Senior Vice President, Chief Financial Officer\n\nSure, Emily. I'll take that one. So we are seeing some amount of working capital release, particularly in AR and through inventory as we move into the fourth quarter. We do expect to have positive cash flow through the fourth quarter.\n\nAnd when you think about, or I should say positive working capital through the fourth quarter, when you think about the continued spend that will ramp up on these strategic projects. Right, we feel very comfortable that the pace of that spend is something that we've planned for, something that we've pre-funded, frankly, with the cash position that we have on the balance sheet. And even as we look forward into 2023. Right, very comfortable that consistent with our capital allocation framework.\n\nOur, cash balances will remain robust even as we continue to spend what's necessary to move those strategic projects forward and closer to completion with 40% already behind us.\n\nEmily Chieng -- Goldman Sachs -- Analyst\n\nGreat. That's helpful, Jess. And just one follow-up, if I may. I wanted to dig deeper into the mini mills segment and the profitability during this segment.\n\nI know you did mention that a lot of the cost increases related to high-cost inventory, but perhaps are you able to share of the $200 a tonne sequential increase in cost there? How much of that was related to the high-cost material and how quickly should we expect that to reverse through the next couple of quarters? Thank you.\n\nDave Burritt -- President and Chief Executive Officer\n\nYeah. Thanks for the question. I answer it this way. We definitely have some challenges here as we highlighted in the third quarter that will continue into the fourth quarter, and likely bleed into the first quarter of next year as we work it off.\n\nI mean, the good news is that's a temporary situation and we'll work through that over time and we'll have a lot better result.\n\nRich Fruehauf -- Senior Vice President, Chief Strategy and Sustainability Officer\n\nYeah, and Emily, just to add to Dave's comments there. If you think sequentially, total metallics cost for the furnace, we probably sell up somewhere in the range of $50 to $60 a tonne in the third quarter versus the second quarter. I would say in total of our total kind of HRC cost at Big River, about $650 or so dollars was related to metallics. So certainly at elevated levels and we would look to what, maybe 6 to 7 weeks of metallics inventory on hand with more of a long-term target of 3 to 4 weeks walk to work that after a year-end.\n\nI think we remain selective in our buys for metallics. And as we turn the page to 2023, we expect to be in a much more normalized position related to inventory levels and, unit costs.\n\nOperator\n\nThank you very much. And we'll get to our next question on the line from Curt Woodworth with Credit Suisse. Go right ahead.\n\nCurt Woodworth -- Credit Suisse -- Analyst\n\nYeah. Hi. Good morning, David and Jessica. I just wanted to drill down more into, I guess [inaudible] historically, we always kind of view that the story as being among the lowest cost in Europe and, generally speaking, fairly advantaged from an energy perspective.\n\nUm, you still have kind of the benefit of some of the semiannual contracts that were repriced over the summer. So, I guess, you know, question one is just what is the path you think to get to profitability there? And then, with respect to the guidance, you outlined, $450 million of sequential EBITDA decline. Can you help break that out a little bit by segment? How much of that should we think about incremental decline into Europe sequentially?\n\nKevin Lewis -- Vice President, Investor Relations and Corporate Financial Planning and Analysis\n\nYeah. So, Curt, this is Kevin. I appreciate the question. When it comes to USSK, certainly, historically, it's been a low-cost facility on the favorable side of the cost curve there in Europe, really advantaged by its streamlined access to raw materials coming out of Russia and Ukraine.\n\nBut as we know, that dynamic has, has changed as a result of the conflict. So we've seen challenges related to sourcing and resulting impacts on, transportation costs and raw materials. And then just broader energy headwinds has certainly impacted margins as well. So I think we're more optimistic that we'll be working our way through some of the raw material impacts through year-end.\n\nAnd we'll continue to monitor broader energy headwinds that I think are impacting our facility as well as many others in the region. Shifting to the fourth quarter, if you think about sequential declines, you should expect the pace of decline in our North American flat-rolled business to be the sharpest. We would see some step down from the mini mill segment, as Jess alluded to, and then some strength, some sequential strength. And in our tubular business, maybe order of magnitude 15% to 20% up quarter over quarter, potentially approaching $200 million in the fourth quarter for the segment.\n\nSo it definitely not for a given the flow-through of prices is just described in her remarks with some more modest cutbacks in other segments and strength and tubular.\n\nCurt Woodworth -- Credit Suisse -- Analyst\n\nAnd then just respect to the cash flow outlook. I believe, Jessica, you had a comment regarding 2023 that you do see still, I think, positive free cash flow. where you talked about generating free cash flow. So can you just confirm that in the event that you would be free cash flow negative given the strength of the balance sheet, do you still feel like you could continue capital return? I know that's kind of a board level decision, but if you just speak to your confidence level on those issues.\n\nThank you very much.\n\nJessica Graziano -- Senior Vice President, Chief Financial Officer\n\nSure. Sure. So I really don't want to get ahead of the planning process for 2023 right now. I mean, we're really knee-deep in that.\n\nSo I don't want to go too far just in terms of getting specific around what that free cash flow could look like. What I will say is, if the challenges continue and we're in a position where we would look to be unfavorable from or have negative free cash flow, if you will. I think you said it best. There is confidence in our continuing without delay, our strategic initiatives because of the opportunity we've had to prefund the balance sheet.\n\nSo for sure, we know that 2023 cash flow for those strategic projects is going to be heavy. Right. I mentioned in detail that we'll have about 1.7 billion of the two and a half billion specific specifically spent toward those projects. So to the extent that we have obviously offsetting cash from the operations of the business, time will tell and we'll update you in January as we pull that budget together.\n\nBut I think the bigger takeaway on cash flow, and the bigger takeaway on the balance sheet is that we are very comfortable to keep going in the strategic processes that we know are going to enable that future of lower cost intensity, lower capital intensity, higher cash flow.\n\nDave Burritt -- President and Chief Executive Officer\n\nYou know Curt, we've laid out the capital allocation process. We're following that capital allocation process and we're going to get through these strategic investments, and direct returns are a part of that. We have a lot of optionality. We got a lot of cash.\n\nThere's a lot of things that we can do with this. We need to get through the planning process and see have a better view on the future. There's massive uncertainty related to geopolitical issues, macroeconomic issues. We're very fortunate to have the optionality that we do.\n\nBut direct returns should be a part of our normal way that we reward our stockholders.\n\nOperator\n\nThank you very much. We now proceed to our next question from the line of Carlos de Alba with Morgan Stanley. Go right ahead.\n\nCarlos de Alba -- Morgan Stanley -- Analyst\n\nYeah. Good morning, David and Jess. Some of my questions have been answered already, but just on sustaining CapEx or the CapEx on your existing footprint. I think as you mentioned, around $650 million in 2023.\n\nHow should we think about these going forward given the investments in the strategic break that you have, the renewal [inaudible] to some extent or shift in your asset base. How should we think about these number going forward? And I understand that it may be early, but just maybe, just a path it would be will be useful. I think just in basic how, where we have challenges and we're doing our best to overcome, were to cost intense were to capital intense, were to carbon intense. And so over time the problems we're trying to say get solved is it become less cost-intensive and less capital intensive.\n\nSo over time, those numbers will come down as we implement our strategic projects over the horizon here over the next 2 to 3 years so that the future is going to be a lot less, uh, capital intensity.\n\nOperator\n\nThank you very much. We'll get to our next question on the line with Karl Blunden of Goldman Sachs. Go ahead.\n\nKarl Blunden -- Goldman Sachs -- Analyst\n\nHi, good morning. Thanks very much for your time. Just a question on the footprint. You commented on recently idling some blast furnace operations, Gary and Ron Valiant in an attempt to bring them back online, depending on customer demand.\n\nAre there specific signals you're looking at to bring those back? Is it volume that customers want? Is it a price signal to some kind of visibility into how that will evolve would be very helpful.\n\nDave Burritt -- President and Chief Executive Officer\n\nWell, it's obviously a multivariate analysis, but we're always saying very close to the customers. And the priority is to make sure that we have the steel on time, high quality delivered safely to them. So the signals are pretty basic. You know, we take a look at what their needs are and we do our best to fill them.\n\nAnd when they tell us that looks like it's ramping up will ramp up as well. And we're looking for those signals. We're working closely with them. We have ongoing daily conversations.\n\nAnd when they place the orders, we feel we fill the book.\n\nKarl Blunden -- Goldman Sachs -- Analyst\n\nOn the balance sheet. You recently extended some maturities and at a pretty attractive interest cost by using, by accessing different parts of the debt market. Is there more opportunity for that? Yeah, you don't have a lot of debt that's due near term but a little bit of 29 debt, that you could extend is there. The goal to do some more of those kinds of extensions when you think about liability management.\n\nJessica Graziano -- Senior Vice President, Chief Financial Officer\n\nWe're always looking at opportunities. I mean, we have a fantastic treasury team that is always communicating with the market, looking at opportunities to continue to tighten and strengthen our balance sheet going forward. There's nothing that I'd speak to specifically now in terms of looking for near-term action on the balance sheet. I guess the takeaway is we're always looking we're always talking to the market, had very close relationships with the banks, and we'll take advantage of opportunities as they arise For us to again, continue to strengthen that balance sheet.\n\nDave Burritt -- President and Chief Executive Officer\n\nWe'll preserve optionality and we'll be opportunistic.\n\nKarl Blunden -- Goldman Sachs -- Analyst\n\nThanks, Dave. Thanks, Jess. Thanks.\n\nOperator\n\nThank you. We'll get to our next question on the line, Gordon Johnson with GLJ Research. Go right ahead.\n\nGordon Johnson -- GLJ Research -- Analyst\n\nHey guys, thank you for taking my question. A lot of my questions have been answered. I know you talked about the BRS, can you talk a little bit more things like the EBITDA [inaudible] they are to roughly $40 million [Inaudible] You talk a little bit about and I know there's higher costs associated, but can you talk a little bit about the other components there and which, what should we expect looking into 2023 and then I have a follow-up. Thank you.\n\nJessica Graziano -- Senior Vice President, Chief Financial Officer\n\nI'm sorry, were you talking about BRS specifically? We couldn't hear parts of your question. Do you mind just repeating? I want to make sure we're answering you right on. Is it BRS you're asking about?\n\nGordon Johnson -- GLJ Research -- Analyst\n\nYes, very specific.\n\nJessica Graziano -- Senior Vice President, Chief Financial Officer\n\nAnd your question was about cost pressures or what we're looking BRS [inaudible]\n\nGordon Johnson -- GLJ Research -- Analyst\n\nYeah, I guess just overall, a bit of underperformance this quarter and the guidance was a bit weaker than we expected. Wanted to get your thoughts on kind of what's driving that beyond cost pressures that are just cost pressures, and what you expect in 2023? And then I have a follow-up.\n\nKevin Lewis -- Vice President, Investor Relations and Corporate Financial Planning and Analysis\n\nThanks. Gordon. This is Kevin. So as Jess articulated in the prepared remarks, right, the raw material headwinds certainly believed to be temporary, really persisting through year-end, but resetting, uh, toward the beginning.\n\nParts of 2023 had about a 800 basis point impact on margin. So if you add that back to the 6% of third quarter performance, that gets us back more toward the mid-teens goal that we've set for the business, you know, before executing projects like the non-grain-oriented electrical steel line, and the additional galvanizing capability. We saw in the third quarter I think was also impacted by just the mix, there at Big River as we continue to mature that facility and increase its capabilities. The product mix in the third quarter was certainly more skewed toward HRC, which is about 60% to 65% of the book in the quarter.\n\nAs we bring on projects like the NGO line, that will add additional volume, 200 thousand tons of electrical steel as we add capabilities related to the galvanizing facility, which is another 300 plus thousand tons of downstream value-added product. We would see that mix really rebalancing to something more, certainly more diversified. Maybe 50% of the book being more hot roll with the remainder being downstream. New value-added product including 10% of the book being NGO steel going forward.\n\nTo Dave and Jesss comments, we remain very, very confident in our business's financial and strategic impact on the enterprise. And as we continue to complete these projects on time and on budget, we see tremendous opportunity to continue to enhance the mix, and drive margins even higher into the low 20% after the completion of those projects. So the fourth quarter, as you mentioned, will continue to be, I think, burdened by some of the high-cost raw materials. But as we turn the page into 2023, um, you know, we're confident the business will be more normalized from a cost perspective and really, really excited for the second half of next year as the NGO line comes on and we expect to meet really robust demand quite quickly.\n\nDave Burritt -- President and Chief Executive Officer\n\nAnd there's no doubt there are the short term challenges here and this temporary impact of the high-cost raw material. But to Kevin's point there, we should be well into the mid to high teens on Big River and then the low 20 percentile. As we get the England gallon, we've got to get a better balance book. We need to make sure we fill the mill, we need to make sure that we get this thing back on track.\n\nAnd I don't think there's any question, the best days are ahead for this facility. Facility. We had great talent down there. We got great operations and it's got a great future.\n\nGordon Johnson -- GLJ Research -- Analyst\n\nOK. Thanks for that. And then just one last thing on my, looking at imports, Is it fair to assume that import prices are somewhat negatively affecting things now? And if things shift there, we could see a positive impact. And then you guys have done great with respect to capital allocation, in my view.\n\nUm, and it seems like you guys are going full steam ahead with CapEx and, and share repurchases. Is there an HRC price at which you guys would accelerate, and or decelerate that? Thanks for the question.\n\nDave Burritt -- President and Chief Executive Officer\n\nBut our top priority, of course, here is to make sure that we're pleasing these stockholders. Right. And the way we do that is do it over the longer term. We've got to get this next mini mill in place.\n\nWe've got to get the NGO line, the gambling, these strategic projects on budget, on time, and those are really important for us to deliver the value that our stockholders expect and deserve. And along that path, we want to give them some direct returns. So that's what we're headed for. We're not setting a specific target on HRC or things like that.\n\nWe let the marketplace, we let down the economic environment. And we let our customers tell us how good we are going to be here in the short term? The longer term, again, I'm just over-the-top bullish.\n\nRich Fruehauf -- Senior Vice President, Chief Strategy and Sustainability Officer\n\nYeah. And then Gordon, I think on imports or we've seen the global price gap continue to narrow and we think that's going to have a positive impact on import penetration too.\n\nDave Burritt -- President and Chief Executive Officer\n\nYeah, imports are down, so it's a good place right now. And we continue to be very, very encouraged with, you know, various trade actions, confirmations of various policies, that we've talked about in our prepared remarks. So optimistic from that. And these trade cases, it's great to see this administration carry forward with understanding the number one priority for any sovereign state is safety and security.\n\nAnd when you get that right and you have a strong manufacturing base, you know, I'm I'm bullish on the countries that understand that. So I'm bullish on the U.S. for sure.\n\nOperator\n\nThank you very much. And there are no further questions at this time. And I'll turn the call back to U.S. Steel CEO David Burritt, for closing remarks.\n\nDave Burritt -- President and Chief Executive Officer\n\nThank you again for joining us this morning. We're on pace for the second-best year in U.S. Steel history and are set up for success in 2023 and beyond. Thank you to our employees who come to work every day to make the steel our customers depend upon.\n\nWhen we do well, you do well. And we're demonstrating that again with another quarter of significant profit sharing. We are working toward a common goal to make U.S. Steel the best steel company and to provide our customers with profitable steel solutions for people and planet.\n\nWe are pleased to safely and reliably provide high-quality steels to our customers. My thanks to each and every customer for your continued partnership. Thank you also to our investors. We are generating value by investing in the future while rewarding you along the way with direct returns.\n\nWe've already delivered record results and 2021 and 2022, and we're confident this business is better position than ever before to create long-term value for stockholders. We look forward to proving the value of our best for all strategy today and tomorrow. Now let's get back to work safely.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKevin Lewis -- Vice President, Investor Relations and Corporate Financial Planning and Analysis\n\nDave Burritt -- President and Chief Executive Officer\n\nJessica Graziano -- Senior Vice President, Chief Financial Officer\n\nDavid Gagliano -- BMO Capital Markets -- Analyst\n\nTristan Gresser -- Exane BNP Paribas -- Analyst\n\nRich Fruehauf -- Senior Vice President, Chief Strategy and Sustainability Officer\n\nEmily Chieng -- Goldman Sachs -- Analyst\n\nCurt Woodworth -- Credit Suisse -- Analyst\n\nCarlos de Alba -- Morgan Stanley -- Analyst\n\nKarl Blunden -- Goldman Sachs -- Analyst\n\nGordon Johnson -- GLJ Research -- Analyst\n\nMore X analysis\n\nAll earnings call transcripts"
}