{
  "companyName": "Mosaic",
  "companyTicker": "MOS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/mosaic-mos-q3-2022-earnings-call-transcript/",
  "content": "Mosaic (MOS 1.06%)\nQ3 2022 Earnings Call\nNov 08, 2022, 11:00 a.m. ET\n\nOperator\n\nGood morning and welcome to The Mosaic Company's third quarter 2022 earnings call. [Operator instructions] Your host for today's call is Mr. Paul Massoud, vice president of investor relations and financial planning and analysis of The Mosaic Company. Mr.\n\nMassoud, you may begin.\n\nPaul Massoud -- Vice President, Investor Relations\n\nThank you. Welcome to our third quarter 2022 earnings call. Opening comments will be provided by Joc O'Rourke, president and chief executive officer, followed by a fireside chat, then open Q&A. Clint Freeland, senior vice president and chief financial officer; and Jenny Wang, senior vice president, global strategic marketing will also be available to answer your questions.\n\nWe will be making forward-looking statements during this conference call. The statements include but are not limited to statements about future financial and operating results. They are based on management's beliefs and expectations as of today's date and are subject to significant risks and uncertainties. Actual results may differ materially from projected results.\n\nFactors that could cause actual results to differ materially from those in the forward-looking statements are included in our press release published yesterday and in our reports filed with the Securities and Exchange Commission. We'll also be presenting certain non-GAAP financial measures. Our press release and performance data also contain important information on these non-GAAP measures. Now, I'd like to turn the call over to Joc.\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nGood morning. Thank you for joining our third quarter 2022 earnings call. Mosaic delivered record third quarter revenues of $5.3 billion, which resulted in net income of $842 million or earnings per share of $2.42. Adjusted earnings per share was $3.22, and adjusted EBITDA was 1.7 billion.\n\nThese results are driving significant cash flow generation, which is allowing us to return significant capital to shareholders while also continuing to invest in the business and strengthen the balance sheet. During the quarter, we returned roughly $670 million to shareholders, including 600 million of share buybacks. Now, before diving into our operations, I'd like to address current market dynamics. Food security remains a concern around the world.\n\nGlobal grain and oilseeds stock-to-use ratios remain at 20-year lows. And early data continues to suggest there may be further downside to total production once the fall harvest is complete. It is important to remember that the market was tight when the year began well before the start of the war, and issues over the last several months have further exacerbated the situation. Ukraine's production shortfall is significant, but weather issues like high temperatures and drought conditions in other major growing regions are having an even bigger impact on an already tight market.\n\nIn the U.S., weather delayed spring planting and the compressed planting window reduced nutrient applications. The growing season was further impacted by high temperatures and drought in some areas. Weather tends to be a significant factor in yield, but underfertilization doesn't help, and you can only mine the soil for so long. Both are contributing to an expectation of weaker than normal North American harvest, and this was reflected in the most recent USDA yield forecast.\n\nIn Brazil, fertilizer shipments appear poised to have dropped around 10% year over year, and La Nina remains a threat despite the market counting on record-breaking corn and soybean production. Beyond grains and oilseeds, we're seeing food security issues play out in other crops as well. Staples like rice are also seeing significant production shortages, driving some countries like India to restrict exports. Because of this, we see a tight market for global grains and oilseeds continuing into 2023 and beyond.\n\nThe global fertilizer market remains tight, with supply constraints in both potash and phosphate still unresolved. Global potash supply remains impacted by the significant reduction in Belarussian exports, which we think will be down 8 million tonnes in 2022. Of the 4 million tonnes they will export this year, we estimate about 2 million tonnes were shipped in the first quarter before the sanctions and Lithuania's decision to prevent Belarus from using its ports. Belarus exports are down significantly from the first quarter, and we do not expect much recovery through the rest of the year or for most of 2023.\n\nThis means the market will continue to be short of potash in 2023. The phosphate market is also impacted by supply constraints. China production is down because of environmental concerns, and exports are being restricted to ensure domestic availability and affordability. This year, we expect China's phosphate exports will be down by up to 5 million tonnes.\n\nThose restrictions could extend through at least the first half of 2023 and possibly beyond as China prioritizes securing domestic food supply and meeting growing industrial demand. While global channel inventories of phosphate and potash remain below historic norms, certain regions, especially in the areas where we do most of our business, saw inventories build in the first half of the year. But prices have retreated back to levels low enough to entice growers to step back into the market. We expect inventories to continue working lower through the end of the year and into early 2023.\n\nU.S. fall application has been trending back toward normal levels. We believe we could end the season with inventories significantly depleted, especially for phosphates. The U.S.\n\nis also experiencing low water levels on the Mississippi River, which is delaying supplies coming through New Orleans. In Brazil, the higher-priced inventory built during the first half of the year has slowed third quarter shipments. But sentiment is improving. Prices have retreated enough to encourage sales, and we expect inventories will end the year much the same as where they started.\n\nThe barter ratio suggests we're approaching a much more constructive environment for demand. In India, importers are taking advantage of the price pullback in phosphates. India's phosphates inventory is still low, while farmer demand remains strong. Government subsidies remain at a level that is supportive of phosphate imports but are likely to leave the country short of adequate supply of potash.\n\nTo summarize, the strength of crop prices and more affordable fertilizer prices suggest nutrient demand will recover from the summer lull we experienced during the third quarter. Given the constructive ag backdrop, we believe our business is well-positioned to benefit. In our phosphates business, Hurricane Ian forced us to shut down operations late in the third quarter, which delayed shipments at the end of September. Our team performed admirably and was able to get our Florida operations back up and running quickly following the hurricane.\n\nWe estimate the shortfall in production to be in the range of 200,000 tonnes. Looking forward, we now expect fourth quarter sales to be in the range of 1.7 million to 2 million tonnes. Our phosphate business is expected to benefit from lower raw material prices in the fourth quarter, particularly as low sulfur prices start flowing through our costs. We expect a fourth quarter benefit of $40 to $45 per tonne from lower raw materials in our North American phosphate business over the course in the third quarter.\n\nIn our potash business, we are realizing the benefits of improved volumes from Esterhazy and from the addition of Colonsay. Eleven of the 13 planned miners are now running at Esterhazy, and improved operating rates of Kilonzo together are driving higher volumes. We anticipate some turnarounds during the fourth quarter that will impact total production but expect sales volumes to be 2 million to 2.2 million tonnes. Mosaic Fertilizantes continues to be a very good business, having earned $1.2 billion in EBITDA over the last 12 months.\n\nHigh inventories built during the second quarter led to slower than initially expected demand during the third quarter as shipments typically seen during Quarter 3 didn't materialize. But pricing trends toward the end of the third quarter reached a level that is beginning to drive shipments, and we've begun seeing that in our business. Some of the third quarter buyer hesitancy is impacting the fourth quarter, but we expect trends to begin normalizing as we finish out the year. Before moving on, I'd like to address the next iteration of our transformation process.\n\nOver the last three years, we've extracted significant cost efficiencies in Brazil, lowered our cost profile in the potash business with transition to Esterhazy K3, and benefited from the combination of support functions across North America. Our next area of focus is the realization of efficiencies through a digital transformation of how we manage our business. In our release last night, we introduced our Global Digital Acceleration Project, an initiative that will transform how we use data to manage a complex business across our global footprint. This effort will upgrade our core systems and allow for more seamless integration across sales, production, supply chain, and global support functions.\n\nOver the next several years, the total cost will be about $200 million to $250 million, split roughly evenly between SG&A and capital expenditures. As a result of this transformation, we expect to realize significant benefits in our sales and production planning and our cost and capital management. Similar to our early transformation efforts, this initiative will continue the trend of adding shareholder value. We expect this investment will have a payback in the range of three to four years.\n\nFinally, I want to reiterate that we remain committed to our capital allocation strategy. Later this month, we expect to retire the remaining $550 million of long-term debt that completes our goal of 1 billion of long-term debt reduction. Our capex expenditures expectation this year remains unchanged at 1.3 billion, and all remaining free cash flow after these commitments will be returned to shareholders through dividends and share buybacks. During the quarter, we returned roughly $670 million to shareholders, which included 600 million of share repurchases.\n\nOver the last year, we've reduced our share count from approximately 380 million shares to 340 million shares. Putting all of this together, our outlook is quite strong. The global agriculture market continues to point to tight supply and demand for grains and oilseeds. We've strengthened our balance sheet.\n\nOur team has recovered from Hurricane Ian in Florida. Our potash business continues to benefit from our low-cost position at Esterhazy and the flexibility gained from restarting Colonsay. Our Brazil distribution business has a significant and growing footprint in an important agricultural market. We have positioned ourselves to maximize value across our business, and this has allowed us to return significant capital to shareholders.\n\nWith that, let's move on to the fireside chat portion of our call. Paul.\n\nPaul Massoud -- Vice President, Investor Relations\n\nThanks, Joc. Similar to last quarter, before we open the lines for live Q&A, we're going to address some of the most common questions that came in last night. First, we received several questions on our general view of both the potash and phosphate markets. Where are we most optimistic and where do we continue to see risk as we move into 2023?\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nThanks, Paul. I'm going to hand it over to Jenny for some detail here, but let me summarize by saying we're very positive on both markets as both remain supply constrained. Ag fundamentals remain strong and fertilizer prices have moderated from the previous peaks in earlier this year, which is driving a return to more historic levels. So, Jenny, can you give us some detail?\n\nJenny Wang -- Vice President, Global Strategic Marketing\n\nThanks, Joc. I like to start from North America. The warm and dry weather has allowed farmers to go to the field for fall applications with a wide-open window. And as of today, we are still seeing products are going to grant this improved farm economics, and affordability has encouraged farmers to put down their phosphate and potash in the fall.\n\nIn fact, we started to get customers' inquiries and the request for the spring season demand. We sold a block of phosphate to one of our major customers yesterday. As their customers, the farmers, have come to the table to buy product with the concern of the potential logistic issues for the spring supply and very strong cash flow the farmers are having to manage but before end of the year. So, a good and normal fall applications are setting a good stage for the inventory drawdown in North America and some good stage for spring season in 2023.\n\nMoving over to Brazil, the barter ratios have improved significantly with the moderation of fertilizer prices and elevated ag commodity prices. We are seeing the Brazilian customers are reengaging in the purchases in order to prepare the coming of Safrinha seasons, and the inventories are coming down. Moving over to India, the farm economics has been very strong this year with the support from their government. The monsoon has also been helpful as we see demand increases, especially for phosphate.\n\nThe recently announced subsidy program from the Indian government has been very supportive to their phosphate input and also consumption. We are seeing steady findings from Indian customers on DAP recently at $750 per tonne level. With the strong demand in Q4 and getting into 2023, we continue to see the supply constraints for both phosphate and potash. On phosphate, we expect that the Chinese export control will continue as we get into 2023 as the Chinese government to ensure that domestic supply availability and that their farmers to be able to get fertilizers for their food production.\n\nAnd there's very little new capacities coming online in phosphate production in 2023. Similarly, to potash, we envision Belarus' and Russia's supply will remain constrained in 2023 and the alternatives elsewhere will not be able to ramp up quickly to offset the continued constraints from that part of the world. To summarize, as you mentioned, Joc, we are very positive to both phosphate and potash as we move into 2023.\n\nPaul Massoud -- Vice President, Investor Relations\n\nThe next question is on channel inventories for both potash and phosphates. Can you provide some detail on recent channel inventory levels and what we expect for the balance of the year and early 2023?\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nThanks, Paul. I'm going to hand this one straight over to Jenny. Jenny.\n\nJenny Wang -- Vice President, Global Strategic Marketing\n\nSure, Joc. The inventory level in most parts of the world are pretty low. In some of the regions like in Europe, the inventory level is really, really low given the supply situation in 2022. I probably want to provide some color on the inventory situation in North America and Brazil, where we believe most of the questions are about.\n\nIn North America, for both phosphate and potash, the current channel inventory are about average relative to historical norm at the same time of this year. As of yesterday, our other country warehouse capacity for phosphate has come down to 30% used; and for potash, that has come down to 50% used. This level of inventory are right at the same level as we see historically at this point of time. As we are seeing good norms fall application, the channel inventories are expected to come down further.\n\nAnd we'll also want to remind ourselves, logistics remains very challenging in North America, particularly on the river, which highlights the unique strengths of Mosaic's assets, which can serve North America by both rail and barges. Moving over to Brazil, since the war started in the first quarter, a lot of the Brazilian customers rushed to buy products from all around the world in order to ensure their supply. As a result of this rush buying, we are seeing a very high inventory building at a port in Brazil, started in July. That inventory at port has gradually slowed down over the last few months.\n\nBy end of October, we are seeing that inventory export has come down by 35% versus the peak in the end of July. The other thing that I want to mention is the import shipment to Brazil. In the middle of the year, the vessels coming to Brazil had to wait for over eight weeks to unload product because the port's warehouses are so full. Now, the waiting time has come down to less than two weeks.\n\nThat's a signal. And in the meantime, we are seeing reexport vessels for both potash and phosphate. With that, we believe the market reached to the bottom in Brazil.\n\nPaul Massoud -- Vice President, Investor Relations\n\nJoc, the next question is on the status of our potash production increases, especially given what we've seen with recent demand and price trends. Are we committed to continuing to increase production in 2023?\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nThank you, Paul. Let me start by talking about Esterhazy. Esterhazy has been a 10-year plan. And in that plan, we not only brought out a new mine at K3 but fully intended to bring on an extra million tonnes of production, which was aligned with the capacity of the K1 and K2 mills.\n\nSo, as we talk about that, we've always looked at Esterhazy as being our most efficient, lowest-cost operation. So, yes, we absolutely will expand the capacity of Esterhazy's K3 mine to meet the capacity of the mill. In terms of Colonsay, we see an immediate need for those tonnes as the gap in supply from Belarus has meant there's been an opportunity for us and through Canpotex exporting more product. That near-term need we expect will continue into 2023.\n\nSo, we certainly see a need for Colonsay in the near term. Bringing that production on has been relatively inexpensive, likely in the range of $50 per capacity tonne. So, on that basis, that's paid off over a matter of months. So, how will we look at it as we go forward? We will always be focused on working toward value, not volume.\n\nAnd as such, we will meet the needs of the market and know more.\n\nPaul Massoud -- Vice President, Investor Relations\n\nThe fourth question we should cover is on Fertilizantes' gross margins in the fourth quarter. How should investors think about the impact of cost inflation in Brazil across our production and distribution businesses? What are the key takeaways on cost?\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nThank you, Paul. Yes, inflation is showing up in our cost structure through the increased price of commodities, labor, and inputs, as well as our raw materials. We expect, overall, the impact on our cost structure to be around 15%. Our distribution business in Brazil benefited by matching low-cost inventory with high-priced sales in Q2.\n\nWe saw a reversal of that in the third quarter. For distribution business, due to the timing of purchases, a step down in gross margin per tonne is expected. However, even with that, we are still seeing gross margins above our historic norms.\n\nPaul Massoud -- Vice President, Investor Relations\n\nWith that, operator, can we open the call to questions from the audience?\n\nOperator\n\nWe will now begin the question-and-answer session to ask a question. [Operator instructions] And the first question will come from Steve Byrne with Bank of America. Please go ahead.\n\nSteve Byrne -- Bank of America Merrill Lynch -- Analyst\n\nYes, thank you. Joc, you were talking about lower pricing kind of incentivizing farmers to start to purchase again. Is it -- is that what was delaying it or were they just simply deferring purchases because prices were falling, and now that it's showing some stabilization, there could be a bit of a flood of purchasing going on from here going forward? Is that reasonable?\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nYeah. Thank you, Steve, and good morning. Certainly, as prices are declining, nobody wants to step into a market. There's necessary caution.\n\nI would argue probably when the prices were higher, there was also a psychological or sentimental response. The economics of planting and using fertilizer never went negative. So, it isn't a matter of the fundamentals. It was a matter of the sentiment, I would think, at some point.\n\nAnd then as the prices declined, as you suggest, the buyers take a step back and wait. If they think the price is going to be lower tomorrow, they'll wait and start buying when they absolutely need to. I think the indication now is the price has, in fact, stabilized. It stabilized at a price where they can see easy value, if you will.\n\nAnd so, they're stepping back in. And absolutely, we expect there will be a pretty steady buying. Remember, at least in North America, though, we are in the fall season. So, they are taking a price risk for next spring.\n\nSo, there might be a little more caution in terms of coming all in. But we're seeing good movement, and that indicates that they believe that this is good value and that'll continue.\n\nSteve Byrne -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nThe next question will come from Adam Samuelson with Goldman Sachs. Please go ahead.\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nHi. Yes, thanks. Good morning, everyone. I guess my question is thinking about your market outlook into 2023 with the increases that you're forecasting in potash and phosphate shipments, how should we think about Mosaic's ability to grow shipments in excess of the market lapping some of the production issues this year, increased capacity at Esterhazy? I mean, what's a rough framework, Joc, for how much production for you can be up in a market that has higher shipments next year?\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nYeah. Thanks, Adam, and good morning. If I think about 2023, you know, starting with potash and, you know, we've been saying this and with the lack of -- or the lack of sales coming out of Belarus, we do see that the market's going to have to ration supply, which does, as you mentioned, bring up an opportunity for us to potentially move more product. I will say that North America, we expect to stay relatively flat.\n\nIt's not a high-growth market. So, this is all an export opportunity, if you will. The challenge there are twofold. One is do we get to the right markets that really need it? And then the other question is, can we even move it? So, those are the first points.\n\nYou know, the supply chain is at its limit right now. And we're -- you know, we struggle to get the tonnes out, particularly, say, in the first quarter, which I think everyone sees problems getting product out of Canada in the first quarter with winter and all the rest. And then it comes down to what's the production capacity. We have, I think, developed real great flexibility there with Esterhazy now reaching what I would call its full capacity, bringing on Colonsay to augment that capacity and give us some flexibility so that we can hit the seasonality, as well as the increased demand.\n\nSo, I think we're well positioned there. I can't give you a specific number at this stage of what we think the year's going to bring for demand. But I mean, we're looking at a global market of, you know, 64 million tonnes next year and potash up probably a little bit off this year. I think, this year, we might have been as low as 62.\n\nSo, we do see an improvement in the market. We see the rush of tonnes that came in the first quarter from Russia and Belarus are probably not coming. So, a good opportunity for us in that first and second quarter certainly of next year and then throughout the year. In terms of phosphates, we're probably a little more production limited in phosphates.\n\nI mean, we're running those assets. But between the limitations of the, you know, the resource base, whatnot, we don't have an expansion opportunity really there. So, we expect that to stay similar in that sort of eight -- maybe 8.5 million, 9 million tonnes of capacity. How well we utilize those will depend on the market.\n\nAnd so, our expectation is our utilization will be quite high next year. And in both those cases, we're looking forward to being very well sold, if you will, and having high utilization of all our assets. And that would include our production assets in Brazil, of course, as well.\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nOK.\n\nOperator\n\nThe next question will come from Josh Spector with UBS. Please go ahead.\n\nJosh Spector -- UBS -- Analyst\n\nYeah. Hi. Thanks for taking my question. I guess just given consensus seems to be at the market will be short something like 5 million to 8 million tonnes of potash next year, I'm curious where you think support level is for pricing the potash in that environment.\n\nJust given your 4Q expectations of around $600 per tonne, do you think pricing moves up from here as inventories come down, or is there a support level you would think about? Thanks.\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nYeah, thanks, Josh. If I think about prices, I think there's really -- at this stage, it's going to be sentiment that will really -- sentiment and fundamentals that are really going to be the limitation to prices. I would argue that what we saw, particularly in Brazil when the price of potash went to say, $1,200, the economics was still OK, but it was starting to get pretty difficult for the Brazilian farmer. And the one that they probably work off more is their barter ratio, which became quite elevated.\n\nSo, in other words, it was costing them a lot more of their production to buy the inputs than it had in previous years. So, I think there's a risk if you go too high in price that you will actually start really destroying demand. So, look, I think there is a great opportunity for a, you know, at the same reasonable barter ratios as we've had with elevated crop prices, that we can have very good margins and that the market should be able to move up from here. I don't believe it's going to move to 1,200, but I think there's probably some good room to move from where we are today.\n\nOperator\n\nThe next question will come from John Roberts with Credit Suisse. Please go ahead.\n\nEdlain Rodriguez -- Credit Suisse -- Analyst\n\nThank you. Actually, it's Edlain Rodriguez. Jenny did an excellent job highlighting the strengths of both potash and phosphate. Granted it's always difficult to choose between your children, but if you have to differentiate between potash and phosphate, which one do you believe will prove more resilient pricewise over the next, you know, three to six months?\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nYeah. Thanks, Edlain. So, yes, we don't -- we love all our children, as you highlight. If I look at the market's fundamentals, and they're both strong, but clearly, today, potash has a very good position in that as the slightly smaller of the two markets and it has the bigger supply disruption.\n\nThe supply disruption in China, while we believe will continue through 2023, or the export restrictions out of China, we expect those to continue. But that's 5 million-ish tonnes on a 70-something-million-tonne market; where in potash, you're talking about a 8 million-tonne decline on a 70 million-tonne market. So, as you think about it from that perspective, the problems in Belarus in terms of exports are, A, less likely to be resolved and, B, more significant to the overall market. So, if I had to be asked which of the two had higher resilience, you'd probably say at this stage it would be the potash market.\n\nEdlain Rodriguez -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nThe next question will come from Christopher Parkinson with Mizuho. Please go ahead.\n\nChris Parkinson -- Mizuho Securities -- Analyst\n\nGreat. Thank you so much. Joc, just, you know, taking a step back and looking at the various costs in both of your businesses. In potash, it seems like, you know, Esterhazy is running well and Colonsay is, you know, getting back on track.\n\nAnd on the phosphate side, you know, you have relative stability right now in NH3, Faustina ops, and then a decline in the sulfur price. So, just, you know, on any just preliminary basis, how should we maybe thinking about the margins or the Street margins in phosphates, you know, as we hit on '23, or what are the big puts and takes in your team's view? Thank you so much.\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nThanks, Chris. Hey. So, if I'm thinking about potash, I'll just hit potash real quick because I think you've touched on that. You know, in potash, it's two things that matter.\n\nOne is where the product comes from? So, obviously, running Colonsay at a little higher cost. The other thing that we have to take into account is Belle Plaine is highly dependent on the price of natural gas. It uses arguably some 30 million MMBtus per year of natural gas. So, if you add a couple of dollars to the natural gas price, it has a pretty big impact on that operation.\n\nSo, other than that, though, as you mentioned, the potash pricing or the potash cost is pretty stable. If we then look at phosphates, you know, and quite frankly, we are seeing some inflation in both mining costs and processing. Mining, the distances are getting longer. The grades probably over the years is declining slightly.\n\nSo, you've got some costs in there that come up. But they pale in comparison to when you look at the raw materials. If we think about $1,000 ammonia, that represents $200 on the cost of a tonne of phosphates. If you think about a $400 sulfur, that represents about $180 cost on tonne.\n\nSo, you could have, you know, at the peak, there was probably $420 a tonne in our -- or sorry, $380 a tonne in our phosphate costs just on those two raw materials. Now, they've retracted back to $100 for sulfur, and our average -- I think our average ammonia cost is now in the range of 600 if you take into account our own production and all the rest. So, that's stable. And I think we talked about a $40 or $50 decline in raw materials costs, and that will fall straight to the margins.\n\nSo, assuming flat prices, you could expect the margin to increase by about $40 to $50. And so, we'll see where the price goes in the next quarter. But that -- that's kind of how that plays out.\n\nOperator\n\nThe next question will come from Jeff Zekauskas with J.P. Morgan. Please go ahead.\n\nJeff Zekauskas -- JPMorgan Chase and Company -- Analyst\n\nThanks very much. It's a two-part question. In your slide deck, you said that you were contemplating a special dividend. Why is it that you're contemplating a special dividend given your very low valuation and your high free cash flow generation? Wouldn't continuing share repurchase be a higher return for your shareholder? And second, I was hoping you would comment on the possibility of Chinese phosphate rock capacity expansions or DAP or MAP expansions in 2024.\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nOK. So, first one, for special dividend, I think we've been consistent in saying that we would be -- look at both dividends, regular dividends, share buybacks, and special dividends. So, far, we have definitely focused on the share buybacks. And one of the reasons for that is -- or one of the main reasons for that is exactly as you say, we believe our shares offer as good of value as anything we can think of.\n\nAnd so, that's a good place to return money to shareholders. At the same time, we have to consider all of our shareholders. Some of the long-term shareholders would like to see income. I would say, as a shareholder myself, I don't mind the idea of seeing some of it come back as stable income.\n\nAnd, you know, quite frankly, if I decide that, as I think I would, that the value of that meant I could buy more shares, I'm free to do that as well. So, I don't think the idea of a combination is bad. We certainly have focused more on share buybacks, but I think we want to make sure we look at all of our shareholders. And, you know, if a small portion of our return to shareholders is through a special dividend when we're doing well, I think that's fair, too.\n\nAnd obviously, on a yearly basis, we'll look at our overall dividend and make sure that we give a fair but affordable dividend there, too. So, second question, PRock. I'm not sure I 100% understood the question, Jeff, but there's no question from, you know, in general, that phosphate rock mining in China has been restricted greatly because of its proximity to the Yangtze River. And so, for environmental reasons, they've done a lot of restrictions on mining in China.\n\nSo, if anything, I would argue that China is probably somewhat resource constrained from a phosphate rock process. And so, we don't expect expansion there. And what we've seen as well in terms of finished fertilizers is they have dropped their capacity significantly and shut down plants a lot, particularly again along the Yangtze River, and have not rebuilt them. So, I think their capacity is down about 25% now.\n\nAnd, you know, in terms of their exports, two things are going on there. More product is going to industrial, and particularly purified phosphoric acid. You know, I can't help but mention, again, you know, the growth of lithium iron phosphate batteries in China is just incredible. And it seems like that may well be the future of batteries is the more economical lithium iron phosphate rather than nickel iron or nickel lithium cobalt.\n\nSo, putting all that together, we see the Chinese government needing to make sure fertilizer stays affordable in China, and they're doing that by restricting exports. And so, we think that will continue. I hope that answers the question you were asking. If you're asking about potash, I think what we've seen is Qinghai Lake has actually decreased in capacity over time.\n\nAnd I suspect that's just the -- that the quality of the resource and what they can extract on a year-by-year basis.\n\nOperator\n\nThe next question will come from PJ Juvekar with Citi. Please go ahead.\n\nPJ Juvekar -- Citi -- Analyst\n\nYeah, hi. Good morning, Joc and team. Just a couple of quick questions. One, you kind of partially answered earlier.\n\nI had a question on, you know, raw materials, particularly sulfur impact on phosphates. I guess my question there would be, you know, you expect to keep that benefit, you said, straight to the bottom line. What gives you confidence that it falls to the bottom line and you don't have to share that with your customers? And secondly, just on this LFP batteries that you just mentioned. You know, our understanding is that the use of phosphates in LFP, it's a very small part of phosphate that goes into LFP.\n\nDo you really think that LFP is going to have an impact on the phosphate market? Thank you.\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nExcuse me. Thanks, PJ. OK. So, raw materials first, lithium iron phosphate second.\n\nSo, when I say that the benefit of the raw materials will fall to the bottom line, look, in general, that's a flow through to the customer. But what we find, of course, is always supply and-demand impacts. So, in the case of a tight market, more of that sticks with us. In the case of a sloppy market, if you will, that goes -- the customer takes all of the -- all of that benefit.\n\nToday, we see the market is relatively tight. So, we think we can maintain our margins and potentially benefit from that falling cost. In terms of is LFP battery a significant use of phosphates? What we're seeing today, I think, is I think we've gone from 100,000 tonnes of purified phosphoric acid, this is China alone, moving up in a couple of years to about 400,000 tonnes of purified phosphoric acid. And even year to date, the LFPs has gone up to 670,000.\n\nAnd we expect 2022 will be a million tonnes total. So, what we're seeing is a, you know, an extremely quick increase in consumption, which we think over time definitely will have an impact on the supply and-demand balance for the product. It is a big industrial use for our phosphates.\n\nOperator\n\nThe next question will come from Joel Jackson with BMO Capital Markets. Please go ahead.\n\nJoel Jackson -- BMO Capital Markets -- Analyst\n\nHey, good morning. I have two questions. Maybe I'll ask them one after the other if that's OK. So -- sorry.\n\nSo, was there kind of a Russian rule --\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nYou know that that's three in a row.\n\nJoel Jackson -- BMO Capital Markets -- Analyst\n\nWhat's that?\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nSorry, Joel. I'm just kidding. Go ahead.\n\nJoel Jackson -- BMO Capital Markets -- Analyst\n\nOh, sorry, I missed that. Sorry. Mosaic could have relatively lower potash sales volume decline in Q3 than your Canpotex part to Nutrien. You're also going to flat volumes in Q4 versus Nutrien guiding lower.\n\nSo, I mean, you're just a sponsor for yourself, but you're linked on the offshore with Canpotex. So, are you -- like you just said that you think that potash volumes in the channel in North America are normal. But do you think that the pause in purchases in North American channel is a longer period than the offshore market?\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nYeah. I -- look, first of all, I can't comment on, you know, anyone other than Mosaic, obviously. And I also don't know the differences in selling strategies or RevRec and all that. It's like, you know, making any kind of comparison.\n\nWhat I will say is what we saw in North America in the third quarter was a, you know, a pretty good slowdown. What we did also see, though, was a reduction of imports. I mean, imports year to date are probably down by 50% or, you know, close to a million tonnes. I suspect we had a pretty good uptake of our summer fill program, or, you know, considering how the markets played out, we had a pretty good uptake of our summer fill program.\n\nSo, you know, we think our customers came to the table and again saw good value and saw that they, you know, they were willing to price, and that was a good thing. So, we RevRec, you know, what we think was reasonable considering the market. In terms of going forward, you know, again, there's just a high level of uncertainty of where that market's going to be. And I would argue that that pertains both to Canpotex and to the North American market.\n\nIn the North American market, we expect a decent fall season. If we do better than that, hey, all the better. But the expectation is a decent or a normal fall season. And that's exactly what we're seeing.\n\nWe expect to see the inventory work its way down throughout the season, which is good. I think Jenny said earlier, we're down to 50% of our in-market inventories. So, that's been run down significantly to where a normal level for middle of November. So, you know, we're seeing a very normal sort of playout, and that is what we would expect.\n\nNow, you know, we had a summer fill program. It was -- we didn't discount or anything. So, I think that just says the fundamentals are there and, you know, people are ready to buy.\n\nOperator\n\nThe next question will come from Andrew Wong with RBC Capital Markets. Please go ahead.\n\nAndrew Wong -- RBC Capital Markets -- Analyst\n\nHey, good morning. So, I just had a -- actually, a few questions on Fertilizantes. I find it a little bit difficult sometimes for us to get some good visibility there. You know, in phosphate production, it looks like it's kind of trended a little bit lower in the past few quarters now.\n\nCan you maybe shed some light on what's going on there and what your expectations are on production going forward? And then on gross margins going into Q4, if I'm understanding the commentary correctly, it sounds like it'll still be relatively quite high, but maybe sequentially down into Q3, even if you include the wholesale margins, is that correct? And then just the last one --\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nCould you repeat the second piece, Andrew? I just -- I didn't quite get the Q4 question.\n\nAndrew Wong -- RBC Capital Markets -- Analyst\n\nWell, just wondering, like, margins going into Q4, the commentary sounded like it'll still be very strong historically, but maybe down sequentially versus Q3. Sounds like there's some pressure on distribution. And then just wondering, if you include the wholesale sales, which are typically higher margin, would the margins still be down sequentially? And then just on costs. Yeah.\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nYeah, go ahead. [Inaudible]\n\nAndrew Wong -- RBC Capital Markets -- Analyst\n\nAnd just on costs --\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nYou want to know cost, margin, and distribution?\n\nAndrew Wong -- RBC Capital Markets -- Analyst\n\nSure. Sure. And just like when you expect going forward, like, you know, should these cost this year that we're seeing in Fertilizantes, is that what we should expect going forward? Thanks.\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nOK. OK. That's a brain full. Let me try and hit these one at a time.\n\nFirst of all, phosphate production, I guess we have over the last couple of years up and down a little bit on phosphate production. Some of that obviously is, you know, from time to time, reliability, from time to time are moving in different areas of the mining, etc., which will happen. But the other piece is, you know, the market started moving pretty slow, and we ran into where our sales out of production haven't really been up to where we might have loved them. And, you know, as such, you got to match your production to your sales with that situation, particularly if you look at single super phosphate, SSP, where we're actually pretty loaded up on our inventory.\n\nAnd so, continuing to run against a full inventory doesn't make a whole lot of sense. So -- and from a cost perspective, that hurts your unit costs. So, there's a couple of things in play there. In terms of our -- when I was talking about margin, I just want to highlight.\n\nWe take positions -- and normally we try and keep our positions, you know, fairly balanced. But you tend to take a position as much as a couple of months ahead of when you sell. So, if you are in a declining market and you buy, you know, and you buy in July and you sell in September, you tend to take that price risk for those two months. If the prices are going up, you have extraordinary -- or you have gains in that positioning.\n\nAnd if it's -- if the prices are going down, you have losses in that positioning. So, if we look at Brazil right now, you are seeing that we had very good margins in Quarter 2 that reversed, to some extent, in Quarter 3, although, as I said in the earlier comments, the margins are still looking pretty strong. And I think I would credit that with our product management teams, not only globally but in Brazil specifically, who are able to understand the market dynamics, decide how far ahead or how late they want to address the pricing and how much inventory they're holding. So, I mean, there's a great art to that.\n\nAs a production company, however, there's limitations on how much of that you can really do. So, I think that answers most of what you ask there, Andrew.\n\nOperator\n\nThe next question is a follow-up from Joel Jackson with BMO Capital Markets. Please go ahead.\n\nJoel Jackson -- BMO Capital Markets -- Analyst\n\nSo, I want to follow up that question. It's a tough one. But, Joc, so Nutrien is going to add some tonnes going forward here. And obviously, their capital allocation is set to that capacity.\n\nI assume proving them has already done. So, for them to place those extra tonnes has to be all in North America. And then you said that demand might be 64 million tonnes next year based on your preliminary guess, up only a couple of million from 2022. Assuming that you have a little bit more, if that's capable of that, assuming Israel Chemicals has a little bit more -- excuse me, ICL has a little bit more, assuming Belarus will be getting a little bit out more, who knows what happens with EuroChem.\n\nYou know, it would seem that Nutrien can't produce all those tonnes. So, I guess I'm trying to figure out and not have an answer, but how do you think about all this? And if Colonsay is a swing mine, are you cautious to want to run it at the beginning of the year full out if it looks like, based on your own numbers, it may not be needed?\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nYeah. So, as you aptly mentioned, I can't and won't contemplate either my competitor, partner, or whatever and what their plans are. I think you have to ask their new CEO. However, let me say how we view the market.\n\nLike I said, we see next year, that that 8 million tonnes won't come back, yes. I'm sure ICL will try and push out what they can. I'm sure EuroChem seems to be reasonably effective in getting to market. I will say that Uralkali seems to be not as active in the market this year as previous.\n\nAnd there's been a couple of rumors and whatnot about why, but I can't tell you. That would be, again, a question for them. What -- and the Belarusians, as long as they can't get product through the Lithuanian ports, they're going to be restricted to either a long rail haul to Saint Petersburg, assuming they can get a port capacity there, or a long and complicated rail haul to China, which they have done relatively successfully. I think they've probably been able to move a million and a half-ish tonnes to China through that rail link.\n\nSo -- but with all of that together, we see a supply side -- even with, you know, extra tonnes from Canpotex, we see a supply side of in the range of 64 million tonnes. And from our perspective, if -- the market will have to find a way to be at that 64 million tonnes. So, in other words, we think there's good need or there's need for all the Colonsay tonnes next year. What happens beyond that? Who knows.\n\nAgain, I will emphasize with Colonsay, it cost us virtually, you know, a couple of months production to restart it. So, we're making a good margin at Colonsay right now. And the downside risk of restarting it was virtually zero and the upside opportunity was large. So, to us, that's a perfect value-adding decision.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Mr. Joc O'Rourke for any closing remarks. Please go ahead, sir.\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nThank you. Well, to conclude our call, I would like to emphasize the strength of Mosaic's financial performance. We delivered excellent results, and our outlook remains strong. Global agricultural market conditions remain constructive, and tight supply of grain and oilseeds is very likely to continue for the foreseeable future.\n\nAs a result, fertilizer demand remains strong and supply constraints persist. We're using this opportunity to return significant capital to shareholders, to invest in our business, and to strengthen our balance sheet. Mosaic is in an excellent position to continue to benefit from compelling business conditions throughout 2023 and beyond. Thank you for joining the call.\n\nHave a good and safe day, and go out and vote. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPaul Massoud -- Vice President, Investor Relations\n\nJoc O'Rourke -- President and Chief Executive Officer\n\nJenny Wang -- Vice President, Global Strategic Marketing\n\nSteve Byrne -- Bank of America Merrill Lynch -- Analyst\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nJosh Spector -- UBS -- Analyst\n\nEdlain Rodriguez -- Credit Suisse -- Analyst\n\nChris Parkinson -- Mizuho Securities -- Analyst\n\nJeff Zekauskas -- JPMorgan Chase and Company -- Analyst\n\nPJ Juvekar -- Citi -- Analyst\n\nJoel Jackson -- BMO Capital Markets -- Analyst\n\nAndrew Wong -- RBC Capital Markets -- Analyst\n\nMore MOS analysis\n\nAll earnings call transcripts"
}