{
  "companyName": "Viant Technology Inc.",
  "companyTicker": "DSP",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/viant-technology-inc-dsp-q2-2022-earnings-call-tra/",
  "content": "Viant Technology Inc. (DSP 1.26%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nHello, everyone, and welcome to Viant Technology's second quarter 2022 earnings webinar. My name is Kelsey, and I will be your operator today. Before I hand the call over to the Viant leadership team, I'd like to go over just a few housekeeping notes for the program. As a reminder, this webinar is being recorded.\n\n[Operator instructions] We thank you for your attendance today, and I will now turn things over to Nicole Borsje with the Blueshirt Group. Nicole?\n\nNicole Borsje -- Investor Relations\n\nThank you, Kelsey. Good afternoon, and welcome to Viant Technology's second quarter 2022 financial results conference call. On the call today are Tim Vanderhook, co-founder and chief executive officer; Chris Vanderhook, co-Founder and chief operating officer; and Larry Madden, the company's chief financial officer. I'd like to remind you that we will make forward-looking statements on our call today that are based on assumptions and subject to future events, risks, and uncertainties that could cause actual results to differ materially from those projected.\n\nWe undertake no obligation to update these statements, except as required by law. For more information about factors that may cause actual results to differ materially from forward-looking statements IN our entire Safe Harbor statement, please refer to the news release issued today, as well as the risks and uncertainties described in our registration statement on Form 10-K and with other filings with the SEC. During today's call, we will also present both GAAP and non-GAAP financial measures. Additional disclosures regarding these non-GAAP measures, including a reconciliation of GAAP to non-GAAP measures, are included in the news release we issued today and in our filings with the SEC.\n\nI would now like to turn the call over to Tim Vanderhook, chief executive officer of Viant. Tim?\n\nTim Vanderhook -- Co-Founder and Chief Executive Officer\n\nThank you, everyone, for joining us for our second quarter earnings call. We continued to build on momentum across our business in the second quarter. Total spend on our platform grew 32% year over year as we continued to gain share in the growing market for programmatic advertising. Customers are rapidly adopting our DSP software to purchase their digital advertising campaigns as it provides a complete platform of ad personalization and measurement for cookie and cookieless devices.\n\nAs we continue to execute our long-term strategy of acquiring new customers and moving fixed price customers to our percentage of spend business model, this creates a near-term drag on our reported GAAP revenue growth rates relative to the growth rates we are seeing of total advertiser spend on the platform. We have made tremendous progress executing against our strategic plan and remain very excited about the conversations we are having with customers as they consolidate more of their ad budgets in Viant's DSP. The tailwinds shifting ad dollars into programmatic channels have never been stronger, and we are continuing to enhance our platform and organization for long-term profitable growth. We are very encouraged by the ongoing traction we are having with customer additions, while the average spend per active customer on our platform continues to grow.\n\nWe remain on track to achieve our long-term financial targets and are well capitalized to fund our growth objectives. Advertisers are increasingly seeking an independent omnichannel platform for digital advertising that delivers tangible return on investment without relying on cookies and device identifiers. It's also critical in times when budgets and spending priorities shift that advertisers have the flexibility to quickly reallocate spend to match their reach and audience goals. For example, budgets may dictate a shift away from brand campaigns across CTV and into more performance-based marketing programs across desktop or mobile.\n\nOur Adelphic software offers advertisers the ability to do just this, strategically manage omnichannel ad campaigns that can be adjusted in real-time to meet budget, audience, and measurement goals. The growing number of strategic conversations we are having with larger advertiser and agency customers are a testament to the value they see in the flexibility of our platform and our patented household ID technology. Dynamics across the industry are changing every day. And Google's recent announcement on further delaying the deprecation of the cookie is just another headline creating uncertainty in the market for digital advertisers.\n\nBut what isn't being discussed enough is the fact that as of this very moment, three out of every four ads in the bid stream don't support the outdated cookie technology our competitors use. And this is only magnified in the future when we consider the fact that all emerging channels, connected TV, streaming audio, gaming, and more are built cookieless from inception and have been scaling upwards at a very fast pace. As we've discussed in the past, Viant's DSP software enables buyers of digital advertising to personalize and measure the three out of every four ads that don't have a cookie today. To that end, we continue to see customers investing more into our advanced measurement suite, and this remains a significant revenue opportunity for us in the long term.\n\nI want to take a moment and talk about a meaningful addition to our executive team. We were excited to announce in the second quarter that we welcome Dustin Kwan as our new chief product officer. Dustin reports directly to me and oversees our entire product roadmap. He joined us after eight years leading ad products at Amazon's DSP.\n\nDustin has a clear and insightful vision on what a successful product roadmap looks like for Viant. And we are excited to invest in our product and engineering teams around him to bring this vision to our customers. We are incredibly grateful to have been able to attract such an experienced and talented product leader in Dustin. The impact he has made in just the short few weeks of joining our team have been substantial.\n\nAnd the combination of his vision, leadership, and execution will have an even greater impact in the years to come. Before turning the call over to Chris, I want to address what we are seeing across the macroeconomic environment and, more importantly, what we are doing to actively manage our business through softer consumer spending and the tightening of ad budgets across the industry. While we are pleased with the growth in advertiser spend that we saw with our platform in Q2, we did notice a deceleration of ad spend by some customers toward the back half of the quarter. As we look ahead to the second half of the year, we are encouraged by the underlying trends we are seeing in our business KPIs, but we are also acutely aware of the macroeconomic headwinds in Q2 and are taking a more cautious approach to the end of the year.\n\nWe are adjusting our internal spending plans to be more focused and selective, concentrating on strategic areas that will position us well for long-term growth and market share gains. We continue to take a long-term view on our opportunity and are being mindful to avoid shortsighted decisions that might impact the momentum we've gained over the last several years. We are on track to hit our 2025 revenue and EBITDA targets and feel very confident that Viant is well-positioned to address the industry's biggest challenges and continue to drive growth. I'll now turn things over to Chris to discuss some key strategic updates across our customers and technology.\n\nChris?\n\nChris Vanderhook -- Co-Founder and Chief Operating Officer\n\nThanks, Tim. In the second quarter, we continued to build on our platform with new partnerships and integrations that are driving more value for our customers. As Tim mentioned, we're also pleased to welcome Dustin to the team and see a meaningful opportunity to further build upon our product suite under his leadership. For the seventh consecutive quarter, we grew our active customers now totaling 336, a 17% increase over the prior year period.\n\nMarketers and their agencies continue to seek out an independent buy-side platform that is fully self-service, has industry-leading integrations across all channels, and a strong measurement offering that accurately calculates return on ad spend. To expand on Tim's comments on macroeconomic trends, we are seeing that ad spending from CPG and automotive continues to lag due to ongoing supply chain-related issues. We also began to see ad spending soften more broadly throughout the month of June. This broad slowdown was highlighted in connected TV ad spending as marketers pulled back their investments in brand advertising, while shifting some of that spending to performance-based advertising campaigns.\n\nAs a result, connected TV spending grew just 2% in the quarter, or 28%, excluding CPG and automotive. Conversely, we saw large increases in spending across all other channels with desktop and mobile up 56%, audio up 80%, and digital out-of-home up 214%. Although there are macroeconomic headwinds at play, marketers still need to advertise to reach new consumers and engage current ones across all channels. Now I want to highlight the value of an omnichannel DSP like Viant.\n\nAs conditions and markets change, marketers will react. The key for them is to have a partner like Viant that can allow them to shift their spending habits to adapt to the everchanging landscape. Marketers saw the benefits of the DSP at the start of the pandemic, where they could pause certain spending in real time, and when they were ready, turn it back on with press of a button. Today, we are seeing that as consumer spending shifts, marketers are shifting their tactics, so it's important they not only have an advanced DSP partner, but a partner with omnichannel capabilities that can easily help them navigate that shift in spending.\n\nOver the last year, customer spending through two or more channels have continued to increase, and they now represent roughly 95% of total spend on our platform. Very much in the way diversification has proven to be a successful long-term investing strategy used to manage risk, an omnichannel strategy is more sustainable long term and much less susceptible to the volatility of single-channel companies that may only be in mobile or connected TV. I've talked several times about the importance of continuing to build out our capabilities while also continue to improve the usability of our software. One of the reasons our customers have so easily shifted their spending across channels like connected TV, mobile, desktop, audio and digital out-of-home is because of the significant supply integrations we've invested in across these channels.\n\nWe recently added SiriusXM to our audio channel, joining an existing roster of Spotify, Pandora, NPR, iHeart, and many others. Our depth of audio supply is a big reason why audio continues to be a fast-growing channel for us. We've also talked about our growth in digital out-of-home. This is primarily due to our continued efforts in bringing on supply partners like Place Exchange, Firefly, Volta, Clear Channel, OUTFRONT, Intersection and JCDecaux.\n\nThree years ago, connected TV was considered an emerging channel, but today is a mainstay in digital advertising. Our early dedication to adopt and develop emerging channels resulted in us becoming a leader in connected TV. Similarly, our work in audio and digital out-of-home is starting to pay similar dividends. Lastly, we are adding another new emerging channel called in-game.\n\nIn-game refers to PC, mobile and console-based games that have dynamically inserted ads within the games themselves that don't interrupt gameplay. We've added in-game supply partners like Adverty, Anzu.io, Bidstack, Frameplay, Sayollo and Relentlo. In-game advertising is believed to be more than a $1.5 billion market that is rapidly growing but still drastically trails the amount of time spent by gamers in this channel. We believe in-game advertising will become another significant channel for us in the future.\n\nMarketers and their agencies continue to move their spending to programmatic. And in a field with very few self-service omnichannel platforms, Viant is emerging as a go-to partner. The last trend I want to address is measurement. This continues to be a popular topic with customers as only a quarter of the bid stream have the common identifiers that marketers have relied on for measuring the effectiveness of their advertising.\n\nViant has long been a leader in helping our customers calculate their return on ad spend and the importance of a platform with strong measurement capabilities has never been more important. As marketers continue to be challenged with policy changes in big tech and now macroeconomic changes that are causing this shift to more performance-based buying, they need a partner that can increase the visibility and confidence of every dollar they spend. We will continue to invest in our measurement capabilities as we believe this will continue to drive increased spending in our software. I'm pleased that the ongoing investments we have made in our platform translate to not just the new client wins but also industrywide recognition of Viant as a leader in the industry by independent software marketplaces.\n\nMost recently, we were named a leader in demand-side platforms by G2 in their Summer 2022 Grid Report. Our recognition as a leader indicates our platform is highly rated by G2 users and that we have a strong market presence. We received a 95% feature rating on our Targeting capabilities and 91% of users enjoy Viant's Quality of Support. This validation from users of our platform is powerful.\n\nAchieving high marks directly from our customers is further proof that our focus on empowering advertisers with an intuitive, self-service platform for omnichannel advertising is resonating with customers and driving the increase in advertising spending on our platform. We're very proud of what we continue to accomplish with our product and customers, despite the challenging environment for advertising. We are building a platform that will set us up for sustainable long-term growth and ongoing market share gains. Let me now turn things over to our CFO, Larry Madden, to discuss our financials and offer more detail on some of the spending trends we are seeing.\n\nLarry?\n\nLarry Madden -- Chief Financial Officer\n\nThanks, Chris, and thank you, everyone, for joining us today. Before I begin, I'd like to remind everyone that we have posted a presentation to our investor relations website with supplemental financial information to accompany today's presentation. As Tim mentioned, we are very pleased with the market share gains we achieved in Q2. Advertiser spend across our platform increased 32% over the prior year period and 15% over the prior quarter, despite a deceleration in spend that we saw in the last month of the quarter, as some of our customers adjusted their spending levels due to the challenging adverse macroeconomic environment.\n\nWe continue to be pleased with increased adoption of our software as evidenced by the growth in our active customer base and average spend per active customer, with both increasing year over year and quarter over quarter. Our growth in advertiser spend has been driven by our long-term strategy of new and existing customers expanding their usage of our platform through our percent of spend pricing option, which we expect to continue moving forward. We believe that the lifetime value of a customer using our percent of spend pricing option is significantly greater than that of a fixed price customer as percent of spend customers typically ramp spend over time as they consolidate their advertising budgets on our platform. Percent of spend customers have also have higher retention rates as compared to fixed-price customers.\n\nIn Q2, customers using our percent of spend pricing options spent, on average, approximately three times that of customers using our fixed-price pricing option. Increasing customer adoption of our percent of spend pricing option has always been our goal because we believe it creates a deeper relationship with our customers and provides for more consistent, predictable, long-term value creation. We are pleased to see this adoption occurring faster than we had expected. As a reminder, revenue from our percent of spend pricing option is recorded after deducting traffic acquisition costs, or TAC, whereas fixed price revenue is recorded before deducting TAC.\n\nTherefore, as the percent of spend pricing option continues to make up a larger part of our advertiser spend mix relative to the prior year period, we will have a corresponding drag on our revenue and contribution ex-TAC growth rates. While the impact of this mix shift has negatively impacted revenue and contribution ex-TAC growth rates in '22 relative to advertiser spend growth rates, we expect this to significantly improve beginning in 2023 as such growth rates begin to converge as the impact of the mix shift becomes less significant over time. This afternoon, I will be discussing some of the highlights of our Q2 performance, the key financial and operational drivers during the quarter, and our current expectations for Q3. In terms of top line metrics for the second quarter, as I said, advertisers spend across our platform increased 32% over the prior year period and 15% over the prior quarter.\n\nOn a year-to-date basis through June 30th, advertiser spend has increased 37% from the prior year period. In the second quarter, revenue was $51.2 million, an increase of 2% over the prior year period and 20% over the prior quarter. And contribution ex-TAC was $31.7 million, a decrease of 1% over the prior year period and an increase of 15% over the prior quarter. Growth in advertiser spend on our platform continues to outpace the overall growth of the U.S.\n\nprogrammatic market. Again, this is being driven by increased adoption and accelerating growth across our percent of spend pricing option. From an industry vertical perspective, during the quarter, we saw broad-based strength across all key customer verticals outside of automotive and CPG, which continued to be negatively impacted by pandemic-induced supply chain issues and other adverse macroeconomic developments. Advertiser spend across all customer verticals, excluding automotive and CPG, increased 51% in Q2 versus the prior year period.\n\nSpend from our automotive and CPG customers, although down 13% on a year-over-year basis for the quarter, did show some improvement during the quarter, increasing 13% from Q1 levels and 3% from Q4 of last year. Spend across our largest customer vertical, retail, grew an impressive 84% in Q2 versus the prior year period. During the quarter, we also saw solid growth in advertiser spend across all key digital channels as customers are increasingly using the full omnichannel capabilities of our platform. Advertiser spend across mobile and desktop grew 56% year over year as we continued to benefit from the market disruption created by Apple's IDFA deletion.\n\nAcross emerging channels such as streaming audio and digital out-of-home, advertiser spend grew 80% and 214%, respectively, during the quarter. CTV growth slowed, in part due to the difficult year-over-year comp, but also as a result of continued weakness across automotive and CPG. Excluding automotive and CPG, CTV spend grew 28% year over year. Investments in our sales, marketing and technology teams also continued to pay dividends during the quarter as evidenced by the significant increase in the number of active customers.\n\nAt the end of Q2, we had 336 active customers, which compares to 288 in the prior year period, representing a net increase of 48 customers over the past 12 months for an increase of 17% year over year. Sequentially, the number of active customers increased by nine compared to Q1, representing a quarter-over-quarter increase of 3%. Active customers using our percent of spend pricing option increased 37% year over year and 3% quarter over quarter. Average spend per active customer also increased 13% on a year-over-year basis.\n\nMoving down the P&L. Non-GAAP operating expenses, which is defined as the difference between contribution ex-TAC and EBITDA, totaled $34.8 million in the quarter, representing a year-over-year increase of 46% and a quarter-over-quarter increase of 11%. The year-over-year increase is primarily attributable to the investments we have made over the past 12 to 18 months across the organization to enhance our product capabilities and expand our sales team. As we have stated in the past, we have been investing to scale the business to accelerate growth and drive market share gains.\n\nHowever, as Tim discussed, given macroeconomic conditions, we intend to slow the pace of such investment in the second half of the year, focusing investments primarily across our product and engineering teams to ensure that we continue delivering on our long-term product vision, while maintaining profitability in the near term. Adjusted EBITDA of negative $3.1 million for the quarter was at the high end of our expectations, with lower non-GAAP operating expenses offsetting lower-than-expected revenue and contribution ex-TAC. For the quarter, our non-GAAP net loss, which excludes stock-based compensation, totaled negative $5.9 million and non-GAAP loss per diluted share of Class A common stock was negative $0.08 for the quarter. From a liquidity perspective, we ended the quarter with $207.2 million in cash and no debt.\n\nDuring the quarter, we repaid $17.5 million of outstanding debt previously drawn on our $40 million credit facility. With that, I'll now turn to guidance. As I mentioned earlier, we began seeing some marketers begin reducing budgets in June, and that trend is continuing into Q3. Our Q3 guidance reflects slower growth in advertiser spend across the platform relative to Q2 given these headwinds.\n\nFor the third quarter of 2022, we expect year-over-year growth in advertiser spend of 20% to 25%. We expect revenue in the range of $47.5 million to $50 million, which represents a year-over-year decline of 2% to 7%. We expect our non-GAAP operating expenses to be consistent with what we saw in Q2 of 2022. And we expect adjusted EBITDA in the range of negative $1 million to $2 million.\n\nThe uncertain macroeconomic environment is currently making it difficult to predict spend levels more than a few months out. As a result, we are only issuing guidance for Q3 at this time and are withdrawing our previously issued fiscal year 2022 guidance. In closing, we remain confident in our long-term targets of at least $500 million in revenue and 35% EBITDA margins by 2025. Our conviction is based on how marketers and their agencies are responding to our solution.\n\nWe continue to win new customers and our existing customers continue to consolidate budgets across our platform and grow their spend. Our total addressable market provides significant opportunity to us, and we firmly believe that our solutions uniquely and effectively address many of the challenges that marketers are facing across today's dynamic digital landscape. That concludes our prepared remarks today. And with that, I will now turn it back over to the operator to open the lines for questions.\n\nOperator?\n\nOperator\n\nGreat. Thank you so much. [Operator instructions] And we will hear first from Lloyd Walmsley with UBS.\n\nLloyd Walmsley -- UBS -- Analyst\n\nAll right. Can you guys hear me OK?\n\nLarry Madden -- Chief Financial Officer\n\nYeah. Hi, Lloyd.\n\nLloyd Walmsley -- UBS -- Analyst\n\nAll right. Great. Thanks. I have a couple, if I can.\n\nFirst, help us elaborate a little bit. It sounds like you said, if I caught all the disclosures right, auto and CPG were down 13%, but showed some improvement during the quarter. So I guess the worst impacted by the macro verticals are improving, but the overall shape of the quarter sounded like it was exiting a little bit slower, and that's continuing into 3Q. I guess the question is, it sounded like outside of auto and CPG things were broadly pretty strong.\n\nWhere are you seeing the most decel in the 3Q maybe by vertical? And anything you can share on by advertiser type, brand ER or advertiser size, I guess? Anything you could help us a bit more there would be great. And then the second one would just be, it sounds like a great hire you guys had with Dustin. Maybe you can just talk about some of the product initiatives you guys are most excited about that maybe he's adding some fuel to now that he's on the platform. Thanks.\n\nTim Vanderhook -- Co-Founder and Chief Executive Officer\n\nYup. Larry, do you want to take the first portion?\n\nLarry Madden -- Chief Financial Officer\n\nYeah. In terms of some of the budget cuts that we've seen, again, we said start it'd in June, but we are seeing it continue. It's across a few different customer verticals. In terms of dollars, I would say it's probably most pronounced across CPG and retail, which are two of our largest verticals.\n\nYou mentioned the improvement that we've noted on CPG and auto in Q2 relative to Q1 and the prior year Q4. That's largely driven by the fact that the comps are getting easier. This has been an issue for several quarters. The amounts are getting smaller, so therefore, the growth that we saw there improved, but it's partly due to relatively easier comps.\n\nThe other thing I would say is other verticals such as travel and healthcare, they continue to do well. So it really is a case-by-case advertiser. It is probably a little more skewed toward certain verticals versus others. But it's really -- even within something like retail, you have different segments of that market, some are cutting and many others aren't.\n\nSo it's really a case by case. But I would say CPG and retail are probably the most significant ones.\n\nTim Vanderhook -- Co-Founder and Chief Executive Officer\n\nAnd just, Lloyd, a little bit more color on that. The pullbacks that we're seeing have largely been in brand-based advertising, particularly we saw it in CTV. We definitely saw a little bit of a pullback there. As I noted in my remarks, we did see a reallocation of some of that money into more performance-based campaigns.\n\nAnd I think that propped up desktop and mobile quite a bit. But it's largely what we're seeing in CTV is in the scatter market where we expected to see a larger increase in spending. And really, we saw most pronounced in June, and we expect that to continue into Q3.\n\nChris Vanderhook -- Co-Founder and Chief Operating Officer\n\nYeah. I'll take the question on Dustin. What an incredible hire for Viant to be able to get a leader over in Amazon's advertising business working on their DSP. To give you an example, he'd previously worked on putting the first ads on Fire TV and then building out that platform.\n\nSo his ability to come in and shape our CTV from a format perspective and a channel and continue our leadership there is going to be big, but the long-term vision of autonomous advertising and making that a reality where it takes less people to do this very complicated task of purchasing programmatic advertising and simplifying that process is the big goal. But I can tell you, just in a short stint he's been in here, the process that he's brought from Amazon and instituted in our product and engineering team is topnotch. And I think we're going to see huge productivity gains just from the process alone. And then coupled with his vision on where we can take this in CTV, we think it's going to be very meaningful and impactful.\n\nAs he gets his sea legs, we'll probably hold an Investor Day and a Customer Day further out to share some of what that vision looks like.\n\nLloyd Walmsley -- UBS -- Analyst\n\nGreat. We'll look forward to that. Thanks, guys.\n\nChris Vanderhook -- Co-Founder and Chief Operating Officer\n\nThanks for the questions, Lloyd.\n\nOperator\n\n[Operator instructions] We'll move on to Matt Condon with JMP.\n\nMatt Condon -- JMP Securities -- Analyst\n\nHi, guys, Matt Condon on for Andrew Boone. Just two for me. Just when -- I appreciate the comments on the convergence between contribution ex-TAC and spend. But is there any more color you can give in 2023 and just the pace of that? And then two, with cookie deprecation being pushed out to 2024, can you just talk about how that's changing your conversation with marketers and maybe just the overall go-to-market strategy? Thanks.\n\nChris Vanderhook -- Co-Founder and Chief Operating Officer\n\nI'll let Larry take the first one, but I'll jump in on the delay of cookies getting deprecated add to anything. When we look at the bid stream today, three out of four ads don't have a cookie or a device ID today. I think the nagging issue is that Chrome still has the cookie. One of the toughest things that Viant is up against is just status quo.\n\nAnd as long as Google has that cookie, some marketers get comfortable and they're going to keep with this old, outdated technology for a longer time period. So, for us, it's just challenging status quo, but marketers -- it doesn't change the fact that these are still going away in the future. There's just more time. And so we've actually taken third-party cookies and brought them back into our platform for use across the Crome web browser and improve the product there, given that now they're going to be available until the end of 2024 as the stated date.\n\nSo today, as it works in the cookieless channel, we're operating on the people-based data set. In the cookie or trackable channel of Chrome, we're utilizing the third-party cookie. And we updated our WWC software release earlier this year to incorporate third-party cookies once again while they exist. So we improved our product with the use of them inside of Chrome.\n\nAnd again, 40% of mobile ad impressions are on iOS devices and there are no device identifiers there. All these new channels, connected TV, streaming audio, digital out of home that are powering our outsized growth in those channels are all using the technology that we created around the household ID. And we think this is just a continual drumbeat. And once that status quo finally needs to get upended, we do believe our leadership position there will reap us rewards.\n\nTim Vanderhook -- Co-Founder and Chief Executive Officer\n\nBut, Matt, just to add to that, I would just look at the customer wins that we continue to knock down. We continue to outperform there. We're winning more customers every day. A lot of that is really because, yes, we have great software.\n\nOur platform is incredibly easy to use. We have a vast amount of supply integrations. However, that said, our differentiation lies within the fact that we have our household ID embedded in the software, and it makes it easy for marketers to come in, use that ID across all channels. And ultimately, it bears out in performance.\n\nThey see what their return on ad spend is across all these channels. You just can't do that with a cookie any longer. You can certainly serve an ad in Chrome and see if somebody went to the website and bought a product, but again, only in Chrome. So I think the market widely recognizes the limitations that are there with the cookie.\n\nAnd we're just focused around continuing to knock down customers and continuing to invest in our household ID technology.\n\nLarry Madden -- Chief Financial Officer\n\nYeah. And Matt, with respect to your first question regarding the mix shift and the impact on revenue and ex-TAC growth rates. As we've been saying all year, that was expected in 2022, and this is what we want to happen. It's just happening much faster than we expected, which is having a significant impact on revenue and ex-TAC growth rates.\n\nIt certainly creates some short-term pain in terms of those growth rates, but we do believe it better positions us long term. As we mentioned in the prepared remarks, in Q2, percent of spend customers spent three times what the average fixed price customers spent. So that's the direction we clearly want to go. In terms of how long that will play out, I think as we move, and we've said this before, as we move into 2023, we do expect this trend to begin to improve as the revenue and ex-TAC growth rates will start to converge with the spend growth rates as the impact of this mix shift becomes less significant.\n\nIn other words, the delta between spend growth and revenue growth will narrow as percentage of spend continues to make it a larger part, but that will take some time. But we'll start seeing that in 2023. And then beyond that, it will get closer and closer.\n\nMatt Condon -- JMP Securities -- Analyst\n\nGreat. Thanks, guys.\n\nChris Vanderhook -- Co-Founder and Chief Operating Officer\n\nThanks for the questions, Matt.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNicole Borsje -- Investor Relations\n\nTim Vanderhook -- Co-Founder and Chief Executive Officer\n\nChris Vanderhook -- Co-Founder and Chief Operating Officer\n\nLarry Madden -- Chief Financial Officer\n\nLloyd Walmsley -- UBS -- Analyst\n\nMatt Condon -- JMP Securities -- Analyst\n\nMore DSP analysis\n\nAll earnings call transcripts"
}