{
  "companyName": "Navigator Holdings",
  "companyTicker": "NVGS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/19/navigator-holdings-nvgs-q2-2022-earnings-call-tran/",
  "content": "Navigator Holdings (NVGS 1.36%)\nQ2 2022 Earnings Call\nAug 19, 2022, 9:00 a.m. ET\n\nRandy Giveans\n\nGentlemen, welcome to the Navigator Holdings conference call for the second quarter 2022 financial results. We have with us Mr. Dag von Appen, Chairman, Mr. Mads Peter Zacho, Navigator's new chief executive officer, Mr.\n\nNiall Nolan, chief financial officer, Mr. Oeyvind Lindeman, chief commercial officer, and myself, Randy Giveans, executive vice president of investor relations and business development in North America. I must advise you that this conference is being recorded today. As we conduct today's presentation, we'll be making various forward-looking statements.\n\nThese statements include, but are not limited to, the future expectations, plans and prospects from both a financial and operational perspective, and are based on management assumptions, forecasts and expectations as of today's statements. And, as such, are subject to material risks and uncertainties. Actual results may differ significantly from our forward-looking information and financial forecast. Additional information about these factors and assumptions are included in our annual and quarterly reports filed with the Securities and Exchange Commission.\n\nWith that, I now pass the floor to our chairman, Mr. Dag von Appen. Please go ahead, Dag.\n\nDag von Appen -- Executive Chairman\n\nThank you, Randy. Can everyone hear me well? I hope yes.\n\nRandy Giveans\n\nYes.\n\nDag von Appen -- Executive Chairman\n\nGood. Good day to everyone. Welcome to the Navigator Gas second quarter earnings call. Today's call will include comments from our senior executive team, including Niall Nolan, our chief financial officer, Oeyvind Lindeman, our chief commercial officer, and for the first time since his appointment, Mr.\n\nMads Peter Zacho, chief executive officer of the company. With the merger between Ultragas and Navigator now behind us, we are benefiting from the synergies our two companies have brought one another. We can appreciate this in terms of a better and more flexible service offering to our clients, increasing revenues, more efficient operations, improving cash flow, and finally, a stronger balance sheet that will allow us to tackle upcoming opportunities. On behalf of the board of directors, I would like to thank all the staff at Navigator for their continued hard work during the quarter.\n\nToday, on this call, I'm joined by Niall and Oeyvind, who have been part of Navigator's successful expansion from a small company operating five ethylene ships, and since the merger, working very closely together with Michael Schrader, our chief operating officer. The three together have been efficiently leading, as a team, the merged companies for the last 10 months. But now, I'm very glad to welcome and present our new CEO, Mads Peter Zacho. After careful and many in-person meetings, by now, we know Mads well, and are certain he is the right person to join our executive team to lead Navigator during the next phase.\n\nThe next decade for shipping in general and for Navigator, in particular, are going to be very interesting and challenging. I can, without a doubt, tell you it will bring several profitable growth opportunities for our company. Mads has joined us from Maersk Mc-Kinney Moller Center for Zero Carbon Shipping, where he was Head of Industry Transition. With a long career in shipping, including Maersk, J.\n\nLauritzen, TORM and SVITZER, and a deep corporate experience, we are well placed to transition into a new exciting period of growth with Mads at the helm, and we look forward as a board to continuing to work closely with him and the executive team in the coming years. With that, I will hand over to -- the call to Mads, who can introduce himself, and give us some comments before we move on with the formal proceedings of this earnings call. Thank you.\n\nMads Peter Zacho -- Chief Executive Officer\n\nGreat. Thank you, Dag, for the introduction and the kind words, and good morning to you all. Before I begin, I'd like to first express my gratitude to the senior executive committee who's been leading Navigator prior to my appointment. Oeyvind, Niall, and Michael Schrader have stepped up to jointly fill the role at the senior management team since late 2021, have together driven Navigator to achieve new records.\n\nThey have not only maintained our stated goals but have driven some of the strongest operational performances as a company at the same time. This speaks volumes to their capability, tireless work and commitment to this company. And for that, I cannot thank you enough. By way of introduction, I joined Navigator from the Maersk Mc-Kinney Moller Center for Zero Carbon Shipping.\n\nMy career over the past 20 years have been in shipping where I held a number of several leadership positions. I'm very excited to lead Navigator as we transition into our next and very exciting period of growth. I joined Navigator at a crucial time in the company's and also the industry's history. The rising importance and demand required to fuel the energy transition cannot be understated, and in tandem, neither can the pace at which it's required.\n\nIn addition, the importance of energy security nationally and locally has taken on a whole new level of significance. This is emphasizing the importance of strong infrastructure and reliable supply chains. I believe that we at Navigator are ideally placed to support this transition, and hence, my grand excitement about joining this company. Not only do we have the skills and expertise developed over years of exceptional service, we also have an extraordinary and determined workforce and, critically, a young fleet with which continues to lead the handy-size market.\n\nHaving worked across the industry in multiple functions, I believe that by continuing to build on our market position, contracts and ingenuity, we can take this company to further heights. And more specifically, Navigator has a successful track record in making accretive vessel acquisitions and further consolidating the handy-size and smaller LPG shipping fleet. We remain engaged in the market and will continue to pursue accretive secondhand acquisitions that will complement our fleet and reduce our average fleet age. In addition, we are working closely with our partner, Enterprise, in reviewing options to best expand our ethylene export terminal in Houston.\n\nTo note, the terminal sets another quarterly record in the second quarter in terms of both throughput, volumes, as well as financial performance. Our guidance for 2022 remains intact. Together with our partners, we'll continue to service our growing target market and importantly, deliver growth and value to our shareholders. And with that, I'd like to hand it over to Niall.\n\nHe will talk you through our financial results from Q2 2022. Please, Niall, take over.\n\nNiall Nolan -- Chief Financial Officer\n\nThank you, Mads, and good morning, everybody. The operating performance for the second quarter was not actually dissimilar from that of the first quarter, although there were some important differences in the constituent parts. The net income for the quarter was $14 million or $0.18 per share, which, when compared to the $300,000 generated in the second quarter of 2021 or $0.01 per share, provides an indication of the trajectory the company has taken over the past 12 months and hope to continue in the coming quarters. The adjusted EBITDA for the second quarter at $55 million compared favorably to the $28.8 million for the second quarter of 2021 and is the third consecutive quarter with EBITDA in excess of $55 million.\n\nThe total operating revenues for the second quarter were $123.9 million compared to $85.7 million for the comparative second quarter of 2021. $12.3 million of the $37.3 million increase in revenue was generally as a result of the additional seven handy-size vessels joining the fleet as part of the Ultragas transaction, with a further $11.4 million generated from the nine smaller vessels acquired that operate within the independently run Unigas pool. Charter rates, too, continued to improve during the quarter, which accounted for $8.3 million of the overall increase in revenues with an average charter rate rising to $24,633 per day or just under $750,000 per month, the highest daily time charter equivalent since Q2 of 2016, and compares to $22,169 per day or approximately $674,000 per month for the second quarter of 2021. And importantly, this $24,633 per day was also an increase from the $22,900 per day achieved last quarter, the first quarter of 2022.\n\nAlthough vessel utilization improved to 87.4% during the second quarter compared to 85.4% for the second quarter of last year, it does represent a slight deterioration from the 89.5% utilization achieved during the first quarter of this year. A further three vessels entered into dry dock for the scheduled surveys during the second quarter in addition to the four vessels during the first quarter, taking a total of 53 days and with a capital cost of $3.8 million. A further five vessels are scheduled to enter dry dock for the planned surveys over the course of the second half of 2022 at an expected aggregate cost of $7 million. As we have no new builds on order, these dockings are the only capital expenditures the company has for the remainder of 2022.\n\nThe operating revenue from the Luna Pool was $6.7 million for the quarter, representing our share of the other participants' net revenues, with voyage expenses from Luna Pool of $7 million representing the other participant share of our net revenues from the pool. Consequently, we had a net deficit of $300,000 from a pool during the second quarter, although we did achieve a benefit of $1.3 million during the first quarter. And overall, this should generally net to zero over time. The voyage expenses increased by 17.6% or $3.1 million during the second quarter to $20.8 million, primarily as a result of the additional vessels in the fleet, most of which are on voyage charters, thereby incurring these pass-through voyage expenses.\n\nBunker costs, along with all global energy prices, continue to be significantly higher than at the beginning of the year. And these higher fuel costs, which form part of voyage expenses, are passed on to our customers through higher charter revenues. Our vessel operating expenses or opex increased 34% to $38.6 million for the second quarter compared to the second quarter of last year, all of which was as a result of the additional investments in the fleet during this quarter relative to last year. Daily operating -- vessel operating expenses per vessel actually reduced quarter on quarter to $8,009 per vessel per day for the second quarter of this year compared to $8,336 per vessel per day during the second quarter of last year.\n\nDepreciation on our vessels increased also by 61.6% or $12 million compared to last year. And as I stated in the last earnings call, this is in part due to the 16 additional vessels in the fleet which accounted for $5.9 million of this increase, but also $6.1 million of additional depreciation as a result of the company's decision to reduce the estimate useful life of all of its vessels from 30 years to 25 years as of January 1, 2022. General and administrative costs increased by 35% and or approximately $2 million to $7.8 million relative to the comparative quarter of last year. $1.5 million of this increase relates to additional administrative costs associated with the Ultragas, and also in addition to unfavorable exchange movements on our Indonesian rupiah account.\n\nWe received Indonesian rupiah from Pertamina for two of our long-term charters for vessels trading in Indonesia. Other income, being the management fees earned from the other participant for our management of the Luna Pool, was $109,000 for the quarter. And the unrealized losses on derivative instruments was $5.3 million for the quarter, relating to movements in the fair value of a foreign currency swap associated with our Norwegian kroner bond. And this is offset by further gains on our interest rate swaps as five-year LIBOR swap rates continue to rise during the quarter, although not at the same rate as during the first quarter.\n\nOur Norwegian kroner bond is fully hedged from -- against movements in foreign currency exchanges, so any gains or losses on the translation of the principal bond amount are generally offset by an equal and opposite movement in the fair value of the related currency swap. We have fixed interest rates on two of our bank loans at 0.36% and 1.3% and the loans assumed as part of the Ultragas transaction, each have LIBOR fixed at approximately 2%. Interest for the quarter was $11.5 million, an increase of $2.8 million in the second quarter, all of which was as a result of interest on the additional debt assumed as part of that Ultragas transaction. Our share of results from the Ethylene Export Terminal was a further record-breaking profit of $6.8 million for the quarter, based on throughput charges relating to 268,444 tons of ethylene exported during the second quarter.\n\nThis compares to a profit of $2 million for the second quarter of last year, which was based on 155,500 tons export to the terminal. And this quarterly performance is the third consecutive quarterly profit of approximately $6.5 million. Terminal depreciation amounts to $5.2 million per year or $1.3 million per quarter, giving an EBITDA for our share of the terminal of somewhere between $7.8 million and $8.2 million per quarter. On the balance sheet on slide seven, the company had cash of $151.2 million at June 30 and a further $20 million available from undrawn revolving credit facility.\n\nOur minimum liquidity covenant from the various bank loans remains a maximum of $50 million, thus providing significant headroom. Our total debt reduced by $45.9 million during the second quarter, which stood at $905.8 million at June 30. And our debt comprises of loan facilities relating to our investments of approximately $686 million, the credit facility associated with the terminal of $47.5 million and two Norwegian bonds, the principal of which amounted to $171.7 million. One of these bonds, the NOK 600 million denominated bond, equivalent to $71.7 million has a maturity in November 2023.\n\nAnd currently, there's a call option on this bond at a redemption premium of 2.864%, falling to 1.79% in November of this year. On slide nine, we outline the estimated cash breakeven for 2022 at $18,280 per day. This low level enables us to generate positive EBITDA in even the toughest of markets, and we have remained cash generative throughout the shipping cycle. In the box on the right-hand side of slide nine, we provide our daily -- expected daily opex across the vessel segments, ranging from $6,800 per day for the smaller vessels to $9,000 per day for the larger, more complex and older ethylene vessels.\n\nWe also provide a range of expected annual spend from vessel opex, G&A cost, depreciation and interest expense for your guidance. On this following slide, slide 10, we outline our historical quarterly EBITDA, showing an uplift in Q3 2021 and a further increase in Q4 2021, the quarters in which the positive impact of the Ultragas transaction was achieved. It also shows consistent EBITDA of approximately $55 million over the most recent three consecutive quarters. And finally, on the right-hand side of that slide 10, we outline with the bar on the left of that graph an annualized EBITDA based on the Q2 performance.\n\nThereafter, each bar moving right shows the potential EBITDA if charter rates across the fleet were to rise by $1,000 per day, giving an EBITDA in excess of $300 million if charter rates were to rise to approximately $30,000 per day. And with that, I will hand you over to Oeyvind for his remarks.\n\nOeyvind Lindeman -- Chief Commercial Officer\n\nThank you, Niall, and good day to all the listeners. The U.S. is the main global locomotive for natural gas liquid's production and exports and it does not disappoint. On page 12, we can see that North American LPG exports reached new highs during the second quarter of this year, with record exports during June.\n\nA larger proportion of these exports deviated from Asia destinations to discharge ports located in the Atlantic Basin. Any additional volume needing maritime logistics in this region is generally positive for medium and handy-size vessels due to the shorter distances. As a result, handy-size LPG cargoes from the U.S. grew during the last few months, however, not yet near the high of January 2021, but it's showcasing a degree of volatility, as well as a proven upside to our segment.\n\nIn parallel, between the increasing LPG exports, we're also seeing a similar trend for ethane. Ethane exports from the U.S. are reaching new highs, with additional volumes heading both across the Atlantic, as well as the Pacific. Our vessels offer a safe, reliable and efficient pipeline service in both directions, and we believe this will continue for the long term in the ethane market.\n\nWhilst ethane continues to be the cheapest feedstock for the production of ethylene, U.S. propane remains competitive compared to naphtha for the production of propylene. This can be seen on page 13. Most of the European petrochemical producers have the capacity to switch from oil to gas should the price be sufficiently attractive as it is today.\n\nConsequently, Europe is importing larger volumes of propane from the U.S. for propylene production. However, in addition, LPG is extremely versatile and is also used for energy. Europe is struggling with high energy prices due to issues with natural gas supplies, which makes LPG a viable additional source to the energy mix and is pulling supply from North America.\n\nAnother more market change is that of the ammonia supply chain. Europe supplied three-quarters of its own demand up until February this year when the Black Sea exports via Ukraine stopped. Ammonia's self-sufficiency is dramatically reducing in Europe as a result, and European consumers are looking further afield to secure supply. We have rarely seen ammonia moving from Asia to Europe, however, today, this is a required reality.\n\nThis brings with it increasing ton mile demand and incremental vessels entering the ammonia trade. We have now seven vessels transporting ammonia, which is double that of one year ago, and we expect more to come. Ammonia as part of food security is becoming strategically important for countries. But also, perhaps more importantly, in addition, the promise of blue and green ammonia as part of our journey to net zero carbon emission is driving the ammonia industry into overdrive, and Navigator is here to lead and support these changes.\n\nThe rate environment has stabilized through the typically slower months of summer. Our three vessel categories attract different rate assessment, as you can see on page 14, and the current levels are ranging from $29,000 per day for ethylene time charters to $21,000 per day for fully refrigerated time charters. It is worth noting that these levels are well above our cash breakeven at $18,280 per day. Our earnings sales mix is constantly evolving.\n\nWe can illustrate some of the points already mentioned in the graph on page 15. Ammonia, being the dark blue at the bottom of the graph, is trending up, adding a few utilization points for July, and we expect this trend to continue as we go forward. Navigator's LPG transportation has increased slightly over the last couple of months due to additional demand in the Atlantic Basin. Most of the volume tends to move on time charters, with some spot opportunities throughout the months.\n\nPetrochemical demand is intrinsically linked to GDP and consumer spending. There is a saying stating that everything that moves up to China in containers have to come into China as raw materials. This holds true for petrochemical commodities that we transport. Today, U.S.\n\nethylene has the widest arbitrage to Europe as opposed to Far East and China, as seen on page 16. Whereas the majority of ethylene were transported across the Pacific in the past, most of the volume are now heading to Europe. This results in half the demand for vessels due half the distance needing to sail, which is pretty logical. Taking all these things into account, petrochemical demand is expected to be soft in the short term until specifically, China returns to a more normal state of consumption and production.\n\nIn the meantime, Europe will continue to import most of these volumes. LPG is stabilizing with traditional demand in the various area's intra-regional trade lanes. There is an upside should Europe further increase imports of LPG for petrochemical production. But perhaps, more importantly, increasing its use of LPG as an energy substitute for natural gas.\n\nWe expect ammonia to continue its strong growth due to the increased disparity between supply and demand locations. As an example, BASF is restricting its use of natural gas at one of the German ammonia plants. They are doing this to assist the energy deficiency in Germany. Ammonia is still needed, however, and the only alternative is to import by sea from other continents such as North America and Asia.\n\nSo in short, petrochemicals is soft short term because of GDP; LPG is sideways, pretty good with an upside; but ammonia is the biggest and most positive as we see right now. And with that, I'll leave it back to Randy.\n\nRandy Giveans\n\nExcellent. Thank you, Oeyvind. Operator, we'll now open the lines for some Q&A. [Operator instructions] So with that, first question.\n\nYour line should be open.\n\nOmar Nokta -- Jefferies -- Analyst\n\nHow's it going? This is Omar from Jefferies. That's the standard Jefferies greeting. For those who don't know Randy, he installed that while he was here. Mads, welcome to Navigator.\n\nFirst off, I just wanted to ask, maybe Oeyvind, on your latest commentary regarding ammonia. You mentioned the blue and green ammonia. And I guess, from a sort of a bigger picture perspective, the ammonia trade has been somewhat, I guess, inconsistent over the past many years with some up years, some down years with really no major change to overall tons moved. Do you think that's changing? Are you seeing that shift? And maybe it starts to get into a high gear, like we've seen with more broader propane and butane trade?\n\nMads Peter Zacho -- Chief Executive Officer\n\nMaybe I can just start out and then you can take over, Oeyvind. From my perspective, there are some, you could say, short term, and you could say, EDP-related fluctuations and so on. But structurally, and if you look at the longer term, there will be some very significant changes taking place. First of all, the food security situation has changed dramatically just over the course of this year, and that means that the need for ammonia as a fertilizer will grow, certainly.\n\nSecondly, ammonia is a very, very important energy carrier for carrying and transporting hydrogen between continents. It's much more efficient to carry hydrogen as ammonia, and then it can be split upon arrival. And then, of course, thirdly, ammonia in itself is going to be an important fuel for the future not only for shipping, but also potentially for other industries. So there are some very -- there are a ton of projects that are already under development to produce both blue and green ammonia.\n\nBut Oeyvind, you can elaborate, please.\n\nOeyvind Lindeman -- Chief Commercial Officer\n\nOmar, to answer your question, 12 months ago, there was lackluster demand for ammonia. It was a -- it was pretty traditional 17 million tons being transported by sea, went up a little bit, it went down a little bit. Today, in comparison, it's night and day. In terms of compensation, interest and serious companies who want to expand, build more production, production then means more exports demand for shipping.\n\nSo shipping and the additional incremental production supply of ammonia goes hand in hand. So they are very different. Where this will go, we shall see, but it's definitely a very exciting area to be part of. Just in our own segment, we never had this many ammonia ships on charter before, and I don't think that's going to end anytime soon.\n\nAnd if you've seen one of the charts there, we haven't -- I mean what is happening is ammonia -- everybody who needs ammonia, looking around the world, not within the region, but around the world globally, to find ammonia today. And the distances are vastly increasing and you need more ships, which is a great thing for us. And we are a big player in that space. So more to come, I'm sure.\n\nOmar Nokta -- Jefferies -- Analyst\n\nYes, that's interesting. So from all talk to now activity, we'll see how things develop there. Second, sort of a follow-up, just wanted to ask about the ethylene movements that you're highlighting, and how it's been more geared toward Europe here the past couple of quarters instead of maybe being a bit more balanced to Asia as well. And you said that that creates more supply of ships because of the shorter ton mile, which obviously sounds like it leans negative, but your realized rate during the quarter, up $24,000-plus, was at the highest level since 2016.\n\nSo did you see an effect or an impact of the shorter ton mile? Was it fleet utilization, or is that maybe something still to be seen?\n\nOeyvind Lindeman -- Chief Commercial Officer\n\nYes. I mean, petrochemical demand generally since [Inaudible]. And if GDP is uncertain and consumers are not spending on household items and so forth because their disposable income is under stress because of inflation and other things, then of course, demand and GDP is quite -- it's softening. So we are plugged into the global trade, and we see that there's -- the pie is smaller.\n\nWhat does that mean? It means that it's a little bit more tricky to do trades. The trades are happening, takes more time, but it is shorter, there's more squeeze on utilization. But I think this is a short-term impact today, all eyes on China and when they are getting out of their malaise with the zero-COVID strategy and so forth. But it is good to see that at least Europe, which have their own issues, are importing or taking the role of China in the terms of ethylene, but that is softening on the petrochemical side, which is ethylene, which is butadiene, which is propylene.\n\nIt's a matter of fact.\n\nOmar Nokta -- Jefferies -- Analyst\n\nOK. All right. Thanks. I'll leave it there.\n\nRandy Giveans\n\nThanks, Omar. Next question, your line should be open. Operator, if you can open the line.\n\nBen Nolan -- Stifel Financial Corp. -- Analyst\n\nCan you guys hear me? This is Ben Nolan at Stifel.\n\nRandy Giveans\n\nBen, we can hear you.\n\nBen Nolan -- Stifel Financial Corp. -- Analyst\n\nSo my first question goes a little bit to what, Oeyvind, you were talking about in your prepared remarks, just as it really relates to how we're thinking about Europe through the winter. There's a lot of discussion in Germany and elsewhere about rationing of natural gas, and maybe petrochemical plants being down or having to dramatically cut their output. How does this impact what you guys do if there is gas rationing or if they shut the work week down to three days or -- what's the impact on the even for what you guys do?\n\nOeyvind Lindeman -- Chief Commercial Officer\n\nThank you, Ben. Very deep question there. So at least for our LPG, I think it's a positive. LPG transportation from any other location that you can buy LPG from, whether that's Mediterranean, or more importantly, in North America.\n\nNorth America has supply, so that brings shipping into the picture. In rationing situation, then you would expect the nations or Europe to look for other energy sources. And as I mentioned, LPG is extremely versatile and is an excellent source of energy. So perhaps if you used to run your cooker on natural gas and if there is lack of natural gas, you could see LPG being spiked into the natural gas beam, although you have to be careful about BTU levels, however, you can also perhaps be more likely to buy a canister or cylinder of LPG and have it as a camping device.\n\nI mean it's very versatile, and I think you're getting into that for winter when temperatures in Europe generally gets colder, and you get a pinch on that, you need more energy and LPG could be part of alleviating some of that pain. And that means more transportation across all segments, big ships, medium ships, handy-size ships in the Atlantic Basin. So we haven't seen -- we've seen a little bit now. You saw it on the slide, a little bit more LPG from the U.S.\n\non handy-size. U.S. exporting record volumes. More of it proportionally is in the Atlantic Basin, meaning Europe, Africa, and Latin America.\n\nI think that is going to stay, if not, increase because of everything that's happening in Europe.\n\nBen Nolan -- Stifel Financial Corp. -- Analyst\n\nAll right. I appreciate the answer there. And then, my next question is maybe for Mads and Dag. The last number of years, obviously, the Ethylene Terminal has come online and there's been a lot of discussion about the expansion of that and appreciating that really is probably more in the hands of your infrastructure partner in terms of the expansion and timing.\n\nBut maybe big picture, how you guys think of the evolution of Navigator in terms of that infrastructure element? Where do you see the company going in, let's say, the next five years in terms of how you're allocating capital to shipping versus petrochemical and LPG infrastructure?\n\nMads Peter Zacho -- Chief Executive Officer\n\nMaybe I can just kick us off, and then I'll invite my colleagues, Dag and Oeyvind, also to add here. We are extremely pleased with the cooperation that we're having with Enterprise. The whole process around building the terminal, getting it on stream and seeing the effects of having that integration together with our fleet, and then having the on-land large export volumes, in our own hands together with Enterprise, has worked really well for us. So it has been a project that has been run on time and budget, and also one that has fully lived up to our expectations.\n\nSo it would be natural for us to want to continue expanding that relationship with Enterprise, and we'll certainly stay in these extremely fruitful discussions that we are having with them right now to see how we can best expand it because it is strategically very, very important for us, and something that supplements our focus on shipping as well.\n\nDag von Appen -- Executive Chairman\n\nJust to add -- thanks, Mads. Just to add to that -- thanks, Ben, for the question. That U.S.A. shale gas has made North America amazingly competitive.\n\nAnd you're seeing great -- lots of projects, and many probably coming onstream soon, growing the exports of ethane, ethylene and other petchem gases. You're seeing with this competitive edge, U.S.A. has -- American shale gas has kind of a reindustrialization of the U.S. Gulf area.\n\nSo this is good news because it will be exported, it will be shipped, and we'll be present in that.\n\nBen Nolan -- Stifel Financial Corp. -- Analyst\n\nGreat. Am I allowed one more, Randy? Is that OK?\n\nRandy Giveans\n\nSure. Go for it.\n\nBen Nolan -- Stifel Financial Corp. -- Analyst\n\nMy last question is around utilization. You're sort of in the high 80s. The last time we were at these kind of day rates, it was closer to the mid-90s. Is there something structurally a little bit different about how the business operates today versus how it operated in the previous cycle when we were at these kind of rates, or is mid -- maybe even high 90s achievable again?\n\nOeyvind Lindeman -- Chief Commercial Officer\n\nOn that graph, Ben, on page 15. You can see the utilization points per month going back a couple of years. So there's no structurally different today than -- that you see throughout that time period in that graph except, of course, the Ethylene Terminal kicked in really this year, which is great. However, you have nuances such that where does cargoes go? Is it Asia? Is it Europe? That sort of stuff.\n\nWhat it doesn't show as well is propylene and butadiene, is it short sea? It from Europe to Asia or Europe to U.S.? Propylene, etc. So the petchem side of that petchem utilization, petchem trade is really what is driving the utilization between, whether it's 90-plus or 90 below. What is good to see now is the ammonia is backing up from below, so that is creating a sustainable floor for us in terms of utilization. So the more we do in ammonia or LPG charter time reduces that volatility.\n\nBut it's the petrochemical side, which is the volatility that causes utilization up and down. But again, it's no structurally different today than a year ago or two years ago, except our term, which is meaning.\n\nRandy Giveans\n\nThanks, Ben. All right, next question. Your line should be open.\n\nSean Morgan -- Evercore ISI -- Analyst\n\nCan you hear me. This is Sean Morgan with Evercore.\n\nRandy Giveans\n\nSean, we can hear you.\n\nSean Morgan -- Evercore ISI -- Analyst\n\nSo I think this is a pretty helpful and detailed chart on slide nine. And I was just wondering, with the Ultragas merger now being about a year on, you've had some time to sort of look at synergies. Is there any -- has most of the low-hanging fruit sort of executed? Or is there kind of more we could sort of find in terms of G&A, or just other kind of share costs between the two fleets to kind of bring down the cash breakeven to, I guess, sort of help the margin a little bit? Kind of a mid to sort of moderately strong rate environment you guys have.\n\nMads Peter Zacho -- Chief Executive Officer\n\nNiall, will you speak to that one, please?\n\nNiall Nolan -- Chief Financial Officer\n\nYes, sure. So Sean, there are some synergies, but it's a bit longer than just a sprint. There are some synergies that we've already made. A lot of it, I think, as we discussed perhaps some calls ago, related to the technical management, to the crewing management of the vessels.\n\nAnd as you appreciate, that takes -- changing crew on ships takes some time, and that is the largest benefit of -- that we foresee in the synergistic effect of merging the two businesses. But there are some of the low-hanging fruit that have already been explored and accepted, but there is yet quite a lot more to come.\n\nSean Morgan -- Evercore ISI -- Analyst\n\nAll right. And then, just kind of just touching again on the European and Chinese demand for ethylene, which I think people have talked about, but maybe asking a little bit differently. We had almost surprisingly high utilization of U.S. exports from Europe.\n\nDo you think that that's -- if you had a sort of way out, whether it's the COVID-related sort of industrial slowdown in China or is there maybe a little bit of demand disruption in Asia happening because they're sort of getting crowded out of the trade by European buyers willing to pay just really excessive premiums because of their energy and security?\n\nOeyvind Lindeman -- Chief Commercial Officer\n\nIt's a little bit of both, Sean. If you talk about China first, ethane, as a feedstock to produce ethylene, is going very strong to Chinese crackers. So the demand is there, and they are competitive compared to the vast majority in Chinese crackers are run on naphtha oil. Oil has been very high, so they have reduced operating rates.\n\nBut on one of the graphs, ethane has gone from strength to strength to Chinese crackers. The crackers that can't, it's very few. So that shows the strength of ethane to ethylene in China. And of course, if consumption is down or reduced in China, that impacts petrochemical trade flows as we see today.\n\nSo conversely, in Europe, they have old inefficient crackers that produce ethylene. So if they are unable to use oil -- sorry, if oil is very expensive and they're inefficient crackers and if they cannot switch to gas like ethane, some do but some don't, then they're definitely disadvantaged. Therefore, those guys will reduce operating rates and then commercially pay up for ethylene, should they need. But demand in consumption in Europe, too, just consumption in household items and so forth, is also under pressure.\n\nBut Europe is still buying because they kind of need it, which is for trade.\n\nSean Morgan -- Evercore ISI -- Analyst\n\nAll right. Thanks, Oeyvind. And that's it for me.\n\nRandy Giveans\n\nThanks, Sean. All right, next question. Your line should be open.\n\nTurner Holm -- Clarksons Platou Securities -- Analyst\n\nHello, everybody. This is Turner from Clarksons. Hello is the traditional greeting at Clarksons when Omar was here, so we'll continue with that. A bit of musical chairs on this conference call.\n\nSo I just wanted to touch on the TC fleet. I guess you have quite a few ships that are rolling over. Just looking at the appendix, I think I counted 11 ships that have been on time charter that will roll over the next six months. Can you give us some color, flavor in terms of how those negotiations are going? How you're thinking about sort of time charter coverage versus spot, and what the rates may look like compared to kind of what they're currently on?\n\nOeyvind Lindeman -- Chief Commercial Officer\n\nYes. Thanks, Turner. The time charter market in the handy-size space, it's typically 12 months, so invariably -- six to 12 months. Invariably, at any point in time, you will have negotiations or you have renewals or people or customers are thinking about, OK, how does the future look? And how can we, in partnership with Navigator, come to agreement to make the supply chain more efficient, etc., on a time charter basis? So we have those internal discussions every week.\n\nTypically, we've had 50% coverage. Today, we have a little bit more because of the ammonia has pushed up on a good note. But the rate environment is Europe, for Clarksons, we typically peg our assessments and so forth publicly on the Clarksons assessments, so you can take cues from that. The textbook in shipping, as you know, if the market is expected to be up or down, it depends on whether the customer and the ship owner wants time charter.\n\nSo we're in a little bit of mix on that.\n\nTurner Holm -- Clarksons Platou Securities -- Analyst\n\nRight. So, I guess, just looking at the public rates, it should be up about 10% versus last year, if you look at the rates for this year. Is that about right?\n\nOeyvind Lindeman -- Chief Commercial Officer\n\nIf that's what your graph says, yes.\n\nTurner Holm -- Clarksons Platou Securities -- Analyst\n\nI'll trust the Clarksons data. OK. And then, I guess, could you talk a little bit more about the supply side? There hasn't been a lot of discussion on this call so far on that element, especially as we're looking into next year. Newbuild prices continue to go up as far as I can see.\n\nMarginally, not a lot of ordering. It's a quite modest order book in the handysize segment, and I guess there's some environmental regulations that are coming into play and some older ships as well. So over the next year or two sort of within the sort of view of the order book, how do you see the fleet developing?\n\nOeyvind Lindeman -- Chief Commercial Officer\n\nYes. So we have visibility on the supply side for the next three years. The orders of ship today used to be 24, 28 months. Now, it's longer because of supply chain issues.\n\nSo we have visibility over the next three years, and the order book for the handy-size is quite limited, which is a good thing. And there are about 10 vessels that are more than 20 years of age, which -- or 25 years of age, which will invariably fall off on the other side. So the fleet supply side is positive, it's balanced, which is a good platform to start off with and when we talk about the future. So we don't foresee any rush to order in the handy-size space or any space, really, depending if it's project-based.\n\nBut in the gas segment, because, as you say, it's expensive today, delivery times are long, but also there are -- you need to have consideration about a few -- what engines to use, what do you think you have an opinion about, what is the fuel of the future and so forth, etc. So it's -- if you have ships today, which Navigate we do, the situation is good.\n\nTurner Holm -- Clarksons Platou Securities -- Analyst\n\nOK. And if I could squeeze one last one in. Dag in his remarks, was talking about the U.S. just incredible competitiveness, especially in the midst of the European energy crisis, which just seems to get worse day by day.\n\nAnd exports out of the U.S., I guess, as a consequence of that and higher production increasing. Are there any bottlenecks on the infrastructure side that could kind of hit the brakes in terms of U.S. exports? I mean they're at high levels. You've been running your terminal at quite high levels, close to capacity or above even the times.\n\nBut do you see any bottlenecks that could slow things down?\n\nDag von Appen -- Executive Chairman\n\nI wouldn't be able to answer in detail about operating bottlenecks, pipeline, storage. I think there's no -- there's always a black swan here in there that can hit, weather or other issues. But I think not. I do also see that developing terminals, new infrastructure, investing and expansion, production and export expansion projects is easier in U.S.A.\n\nthan in other parts of the world, especially if you look into Europe, for example. So I do sense that there is a -- that the competitive edge is not only on the competitive availability, the availability of natural gas and shale gas, it's also the network that already exists, the pipelines that already exist, couple of large companies, including our good partners, Enterprise, who have an amazing grid. So in general terms, I see definitely more strength than bottlenecks or troubles. But maybe Randy or Oeyvind can complement.\n\nOeyvind Lindeman -- Chief Commercial Officer\n\nI think having -- toward North America, and visited some of the midstream companies recently, they are quite optimistic about the future. They are revising their capex program. People are talking about new fractionators. Because production is going up, you must have fractionators to facilitate all of it.\n\nSo the industry in North America on that front, very optimistic about the future. And also, there was a question at the conference, I think, that Randy visited earlier this week. On the question of red tape or bureaucracy permitting in North America, and it's available. And it's there for new expansion, for production, midstream, and then ultimately, exports.\n\nRandy Giveans\n\nYes. And as Dag mentioned, Enterprise, I think on their recent call, announced six or seven different growth projects, Energy Transfer, the same. Kinder Morgan, Plains All American. Any of these midstream kind of pipeline companies are focused on that very thing.\n\nMore pipelines, more terminal capacity and a lot of those hydrocarbons are going through the water, right, for European or Asian imports. So I think that growth is coming. Thanks, Turner. All right, next question.\n\nYour line should be open.\n\nCliment Molins -- Value Investor's Edge -- Analyst\n\nThis is Climent Molins, I'm from Value Investor's Edge. You've been clear on your willingness to pursue the expansion of your Ethylene Terminal. And I was wondering if you could provide some commentary on whether you're looking into potentially participating in other infrastructure projects? And following on that, should you find any attractive opportunities, do you believe your current fleet would be enough to service them?\n\nOeyvind Lindeman -- Chief Commercial Officer\n\nExcellent questions. Infrastructure, should we -- are we looking? Yes. Will it have a positive impact on the fleet that we need more transportation? Yes.\n\nCliment Molins -- Value Investor's Edge -- Analyst\n\nAll right. That's helpful. And you're still trading at a sizable discount to NAV. And I was wondering, is there any appetite to pursue share repurchases in the current environment? How would you balance share repurchases with potential capex if attractive opportunities come along?\n\nMads Peter Zacho -- Chief Executive Officer\n\nMaybe I can just talk to that one. We constantly evaluate how our projects measure up about -- to other ways of returning -- making returns for the investors. So we keep a very close look at that, and we are definitely evaluating all the options, and we'll be super happy to revert back to you during the second half of this year to make more clarity around how we do that. But we are definitely very observant about the discount that we're trading at, and that certainly goes into our consideration around how we best secure that there's a good return to the shareholders.\n\nCliment Molins -- Value Investor's Edge -- Analyst\n\nAll right. That's it for me. Thank you for taking my questions and congratulations for the quarter.\n\nRandy Giveans\n\nThanks, Climent. All right, we have time for one more question. Operator, if there's any more, we can open their line.\n\nUnknown speaker\n\nThanks. This is Tom McKay. I wanted to ask Niall what -- a question about the debt level the company has. You've been reducing debt since the Ultragas combination last year.\n\nAnd could you comment on what your target debt level, your ideal debt level would be?\n\nNiall Nolan -- Chief Financial Officer\n\nTom, I mean, the debt level is an amalgam of different things. As you may recall, the terminal was financed pretty much 100% on debt. The Ultragas ships, on the other hand, we've actually got quite a low gearing. So we've got a kind of a mixed bag, and a lot of the recent significant reduction in debt is associated with the terminal, not surprisingly, given the cash distributions we're getting from that.\n\nIn terms of the target, I think somewhere -- we're at about 43% net debt to capitalization at the moment. I think somewhere around there, we're reasonably comfortable with. It could come off at another couple of points down to, say, 40%, 39%, something around those levels.\n\nUnknown speaker\n\nOK. Great. Thanks.\n\nRandy Giveans\n\nExcellent. Thanks, Tom. Well, that's it for the call. I'd like to turn it back over to Mads for some closing remarks.\n\nMads Peter Zacho -- Chief Executive Officer\n\nYes. Just wanted to thank you all for the great questions that you asked and also for a good discussion. We really appreciate this dialogue with you. And it was a good quarter.\n\nIt was a strong quarter, and that was -- it means that the whole first half of 2022 came out really well. So we look forward to continuing the momentum that we have had, and we also look forward to continuing to keeping you updated on both the growth opportunities that we are seeing right now, and there are several, and also other exciting developments that may come that can strengthen and secure that the return to the shareholders remains strong in the long term as well. So thank you so much for joining us and look forward to keeping you updated as we go.\n\nRandy Giveans\n\nThank you.\n\nDuration: 0 minutes\n\nRandy Giveans\n\nDag von Appen -- Executive Chairman\n\nMads Peter Zacho -- Chief Executive Officer\n\nNiall Nolan -- Chief Financial Officer\n\nOeyvind Lindeman -- Chief Commercial Officer\n\nOmar Nokta -- Jefferies -- Analyst\n\nBen Nolan -- Stifel Financial Corp. -- Analyst\n\nSean Morgan -- Evercore ISI -- Analyst\n\nTurner Holm -- Clarksons Platou Securities -- Analyst\n\nCliment Molins -- Value Investor's Edge -- Analyst\n\nUnknown speaker\n\nMore NVGS analysis\n\nAll earnings call transcripts"
}