{
  "companyName": "Cronos Group Inc.",
  "companyTicker": "CRON",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/07/cronos-group-inc-cron-q3-2022-earnings-call-transc/",
  "content": "Cronos Group Inc. (CRON)\nQ3 2022 Earnings Call\nNov 07, 2022, 8:30 a.m. ET\n\nOperator\n\nThe conference will begin shortly. [Operator instructions] Good morning. My name is Chris, and I will be your conference operator today. I would like to welcome everyone to Cronos Group's 2022 third-quarter earnings conference call.\n\nToday's call is being recorded. At this time, I would like to turn the call over to Shane Laidlaw, investor relations. Please go ahead.\n\nShayne Laidlaw -- Investor Relations\n\nThank you, Chris, and thank you for joining us today to review Cronos Group's 2022 third-quarter financial and business performance. Today, I am joined by our chairman, president, and CEO, Mike Gorenstein, and our CFO, Bob Madore. Cronos Group issued a news release announcing our financial results this morning, which is filed on our EDGAR and SEDAR profiles. This information, as well as the prepared remarks, will also be posted on our website under Investor Relations.\n\nBefore I turn the call over to Mike, let me remind you that we may make forward-looking statements and refer to non-GAAP financial measures during this call. These forward-looking statements are based on management's current expectations and assumptions that are subject to risks and uncertainties that could cause actual results to differ materially from those projected in the forward-looking statements. Factors that could cause actual results to differ materially from expectations are detailed in our earnings materials and our SEC filings that are available on our website by which any forward-looking statements made during this call are qualified in their entirety. Information about non-GAAP financial measures, including reconciliations to U.S.\n\nGAAP, can also be found in the earnings materials that are available on our website. We will now make prepared remarks, and then, we will move into a question-and-answer session. With that, I'll pass it over to Cronos Group's chairman, president, and CEO, Mike Gorenstein.\n\nMike Gorenstein -- Executive Chairman\n\nThanks, Shayne, and good morning, everyone. I'd like to start our call today by discussing the strategic realignment we have been working on this year. We've taken steps to cut costs, as you've seen within our operating expense structure and continue refining our budgeting and capital allocation processes to improve further. Our slimmer cost structure and more targeted approach to growth across segments helps ensure that we're allocating funds to the right project initiatives.\n\nAll new investments share a common goal, profitably grow Cronos with a focus on borderless products and brands that can adapt to new markets as they open. Thanks to continuous efforts and reinforcing our start-up mentality, we remain on track to hit our cost savings target of $20 million to $25 million in operating expenses in 2022. As we complete the budgeting process for '23, we remain keenly focused on cutting additional costs throughout our business to provide a firm footing for Cronos to build its borderless product portfolio and enable long-term, sustainable growth. A key area of focus for us has been adapting our supply chain.\n\nThe build out of downstream processing capability at GrowCo is progressing with flower packaging up and running, and we continue to be pleased with the cultivation performance at GrowCo and our other CMO providers. In the third quarter, GrowCo reported to us preliminary unaudited revenue of approximately 5.8 million to non-Cronos customers. And as a reminder, GrowCo has been repaying its senior secured loan, which is now approximately 73 million. These loan receivables, combined with our balance sheet of approximately 890 million in cash and short-term investments, and strategic investments in Cronos Australia and PharmaCann set us up well to enter new markets as they opened.\n\nBalance sheet management through economic uncertainty is paramount, and our desire to maintain a significant industry-leading cash balance ahead of potential global strategic growth opportunities has guided many of our decisions here to date. To maximize the benefits of our balance sheet, we've repositioned a significant portion of our cash into short-term investments to take advantage of the higher interest rate environment. Growth via innovation continue to be a theme for us. In Canada, our Spinach brand is winning in the edible and vape categories, and we expanded on our offerings in these two categories with Spinach FEELZ, CBN gummy and vape products.\n\nWe're excited that this portfolio of rare cannabinoids continues to grow. And with a best-in-class product development team, we believe we can continue to provide consumers with superior and differentiated products utilizing rare cannabinoids. Further leveraging rare cannabinoids to expand our portfolio will continue to be pivotal for our ongoing new product launches. Having most recently announced the achievement of the equity milestone for THCB, we are pleased with the product development progress across categories and look forward to sharing more details on new product launches in the future.\n\nThis quarter, we also received the results of an important third-party verified study, which evaluated the sustainability and impact of traditional methods of cannabis extraction and their own proprietary fermentation methods. The results were clear. The environmental footprint of growing plants indoors is high, and using innovative fermentation processes dramatically lower the environmental impact of cannabinoid production. These results show a striking advantage for the fermentation method as the average percentage carbon footprint saving of the fermentation method is 99.8%.\n\nWhile our industry is young, it's never too early to lead and invest in technology that helps contribute to a greener future. While fermentation enable us to make a smaller environmental impact, it also allows us to leverage rare cannabinoids, making way for unique and new experiences through proprietary blends of cannabinoids. The fact that we're able to create breakthrough products while being environmentally friendly is a win-win for Cronos. Despite a challenging macro environment in Canada, driven by disruptions at our provincial customers in Ontario and British Columbia, our team continued to push new innovations and drive profitable growth.\n\nTo make up for these disruptions, we strive to maintain supply continuity with customers. Although those efforts resulted in higher labor and shipping costs, we expected the focus we put on making sure our products were on the shelf will pay dividends over the long run. The following market share commentary will all be referencing Hifyre data. In the flower category, 28-gram bags have come to dominate the market, making up seven of the 10 -- top 10 SKUs.\n\nSpinach once again achieved the No. 1 ranked dry flower SKU in September with their 28-gram wedding cake offering, achieving a nationwide flower market share in Q3 of 6.4%, up 50 basis points from last quarter, making us the No. 3 brand nationally in flower. Twenty-eight-gram flower typically carries a lower-margin profile, despite its impact to our financials.\n\nIt is important that when selling into the provinces and building relationships with retailers that we have a full product portfolio that they're looking for. Our 28-gram products are winning on quality, not just being the cheapest. We are confident that over the long run, in partnership with GrowCo and other contract manufacturers, we can improve on the margin profile of the category. Moving to edibles, Spinach continues to expand market share, up 100 basis points from last quarter to 15.3% and 19.8% market share when looking at just the gummies category.\n\nFive Spinach gummies SKUs are in the top 15, including the No. 1 and No. 2 market share positions on a per SKU basis. We continue to be more efficient and targeted with our SKU launches and edibles, driving market share gains with limited cannibalization, which is exemplified by our Spinach FEELZ rare cannabinoid-focused gummy additions which are quickly climbing market share ranks.\n\nIn vapes, we expanded market share by 70 basis points versus last quarter to 4.1%, driven by the wave of new products we brought to market this year, including the Blackberry Kush CBN vape, the Tropical Diesel CBG vape, and the Atomic Sour Grapefruit vape. In pre-roll, despite not being where we want to be yet, we have several innovations in SKU assortment changes that we expect to change the trajectory of this category for us. This overhaul will include new packaging, market-aligned pricing, and innovative new-infused pre-roll offerings that just shipped last week. These new Spinach pre-rolls include a THC-boosted product called Atomic GMO, which is a crossbreed of two of our best-selling flower offerings, Atomic Sour Grapefruit and GMO Cookies, as well as the CBG-infused pre-roll under the new Spinach FEELZ subbrand.\n\nWe are very excited to get our new pre-roll product assortment into the retail channel, so our sales team can do what they do best. Turning to Israel, our PEACE NATURALS products continue to win in the market. Our team in Israel grew reported net revenue, 88% year over year to 7 million, and on a constant currency basis, net revenue in Israel increased 98% year over year to 7.4 million. We've had incredibly positive patient reactions to our newest strain launches, Cocoa Bomba, Wedding Cake, and GMO Cookies, in addition to our packaging redesign, which allows for additional information on the terpene profiles of our products.\n\nIsrael's patient count continues to grow as well, adding approximately 1,500 new medical cannabis patients in September, nearing a total of 120,000 patients. This is the third consecutive month we have seen patient growth of approximately 1,500 or greater. The reacceleration and year-over-year growth for patient permits provides a good foundation for growth in the Israeli market for us to capitalize on. Earlier this year, our brand, PEACE NATURALS, launched an ad campaign in partnership with the Warriors for Life Association in Israel.\n\nThe campaign called on mayors to restrict or stop traditional firework shows that cause distress and anxiety to medical patients and those with PTSD as a result of conflict and war, a serious problem faced by many veterans in the country. We are proud to have been awarded a prestigious Clio Award for this campaign in the Social Good category. Congratulations to our deserving PEACE NATURALS team in Israel and the amazing work Warriors for Life do for our veterans. I want to take a moment to shed light on our U.S.\n\nbusiness performance. As you've heard over the past couple of quarters, we have completely shifted away from our beauty category-focused portfolio. All inventory that is beauty-focused is being worked through in the wholesale and DTC channels as we shift the focus of these brands to adult-use product formats. We continued improving our cost structure in the U.S.\n\nand believe it is important to focus our investments only in areas that will give us an advantage in adult-use product formats. We are focused on creating borderless products and brands that can easily be adapted to emerging cannabis markets as they become commercially viable opportunities. The pivot in our U.S. business further drives us toward our singular focus of creating adult use cannabinoid products.\n\nLooking to the adult use cannabis market opportunity. We are pleased to see progress by the Biden administration last month to issue pardons for minor cannabis-related offenses at the federal level and urging governors to do the same, these actions that represent a small but important step toward healing the harm done by cannabis prohibition in the United States. We believe cannabis should be legal and that a comprehensive and reasonable regulatory framework should be put in place for the industry. As legalization efforts continue across the U.S., we are committed to using our voice to lead the industry forward responsibly, and we will continue to be an integral part of the conversation.\n\nWe're proud to support responsible legalization efforts and meaningful social justice reform. Moving to Australia, where we have an approximate 10% stake in Cronos Australia, the team is executing at a high level in the early stages of the market development. During our third quarter, Cronos Australia announced a $0.01 per share cash dividend, which yielded Cronos approximately $390,000 in October. Having a long-term, low-capital investment, such as Cronos Australia, start to pay capital back is a big positive.\n\nCronos Australia also recently -- excuse me -- also recently reported strong financial results, with revenue in September hitting a record AU$9.9 million, which is a run rate of nearly 120 million annually. To continue to drive long-term growth, they recently brought a new state of the art distribution center online. With a growing infrastructure, expanding medical market, and strong team, we look forward to Cronos Australia's continued growth and market penetration. And last but certainly not least, I would like to congratulate Jeff Jacobson on his expanded role and promotion to chief growth -- chief growth officer.\n\nJeff has been with Cronos since 2016 and most recently served as SVP, head of growth North America. In addition to Jeff's oversight of the marketing and sales functions, in his new role, he will oversee North American operations. Given the speed at which this industry moves, we believe having one leader guide the process from the point of idea creation to getting the product on the shelf will lead to better results for us going forward. Congrats to Jeff on this new role.\n\nWith that, I would like to pass it to Bob to take you through our financials.\n\nBob Madore -- Chief Financial Officer\n\nThanks, Mike, and good morning, everyone. The company reported consolidated net revenue in the third quarter of 2022 of 20.9 million, a 3% increase from the third quarter of 2021. Constant currency consolidated net revenue increased 7% to 21.8 million. Revenue growth year over year was primarily driven by an increase in net revenue in the rest-of-the-world segment, driven by cannabis flower sales in Israel and cannabis extract sales in Canada, partially offset by reduced sales in the U.S.\n\nand lower cannabis flower sales in Canada, driven by adverse price mix. Consolidated gross profit for the third quarter of 2022 was 1.2 million, representing a 1.9 million improvement from the third quarter of 2021. The gross margin was positive 6%, up from a negative 4% last year. The improvement versus prior year was primarily driven by increased revenue in the ROW segment, mainly driven by cannabis flower in Israel, a favorable mix of cannabis extract products that carry a higher market profile than other product categories and lower cannabis biomass costs, which were partially offset by lower fixed cost absorption due to the timing and the wind down activities at the Peace Naturals Campus and lower revenue in the U.S.\n\nsegment. Consolidated adjusted EBITDA for the third quarter of 2022 was negative 21.7 million, representing a 25.1 million improvement from the third quarter of 2021. The improvement versus prior year was primarily driven by decreases in general and administrative, sales and marketing, and research and development expenses as a -- as a result of the company's strategic realignment initiative and an improvement in gross profit. Now, turning to our segments.\n\nIn the rest-of-the-world segment, we reported net revenue in the third quarter of 2022 of 20.4 million, an 11% increase from the third quarter of 2021. Constant currency net revenue in Israel increased 98% to 7.4 million, while constant currency net revenue in Canada was down 2% to 13.9 million. Revenue growth year over year was primarily driven by increased flower sales in Israel and increased cannabis extract sales in Canada. These gains were partially offset by lower cannabis flower sales in Canada, driven by an adverse price mix shift.\n\nGross profit in the rest-of-the-world segment for the third quarter of 2022 was 3.1 million, representing a 2.6 million improvement from the third quarter 2021. The gross margin was positive 15%, up from positive 3% last year. The improvement versus prior year was primarily driven by increased cannabis flower revenue in Israel, higher cannabis extract sales in Canada that carry a higher gross margin than other product categories, and lower cannabis biomass costs, partially offset by lower fixed cost absorption due to the timing of wind down activities at the Peace Naturals Campus. Adjusted EBITDA in the rest-of-the-world segment for the third quarter of 2022 was negative 11.4 million, representing an 18.3 million improvement from the third quarter of 2021.\n\nThe improvement versus prior year was primarily driven by a decrease in general and administrative expenses and an increase in gross profit. Turning to the U.S. segment. We reported net revenue in third quarter of 2022 of $500,000, a 76% decrease from the third quarter of 2021.\n\nThe decrease year over year was primarily driven by a reduction in sales as a result of a decrease in promotional spend and SKU rationalization efforts as the company implements its realignment of the U.S. business. Gross profit for the U.S. segment for the third quarter of 2022 was negative $2 million, representing a $700,000 decline from the third quarter of 2021.\n\nThe decline year over year was primarily due to lower sales volumes and increased inventory reserves driven by the realignment activities. Adjusted EBITDA in the U.S. segment for the third quarter of 2022 was negative 4.9 million, representing a 7.3 million improvement from the third quarter of 2021. The improvement versus prior year was primarily driven by decreases in sales and marketing, general and administrative, and research and development expenses driven by the reduction in beauty category-focused R&D.\n\nNow turning to our balance sheet. The company ended the quarter with approximately $890 million in cash and short-term investments. This foreign exchange rate volatility that has impacted our P&L has also had a large impact on our balance sheet. If you apply the effects rates for the period ended December 31 of 2021, on the current period balance sheet, we would have approximately $940 million in cash and short-term investments, approximately $50 million difference.\n\nWe've made significant strides to reduce spending and improve our cash burn rate. Our free cash flows improved by over 50% versus the same period last year, driven by operating expense savings and a 35% reduction in capex, which was down to 1.6 million in the third quarter. With that, I'll turn it back to Mike.\n\nMike Gorenstein -- Executive Chairman\n\nThanks, Bob. We started in Canada to learn and build a borderless product portfolio. The lineup of products we've created to date continue to win, driving market share gains for Cronos across categories, giving us confidence that they can win in any market. Despite certain challenges in Canada that drag on profitability, proving out our capabilities and building an elite team remain top priorities.\n\nIn Israel, our team continues to fight for and win market shares, which is a testament to our branding and product quality. Having a team on the ground is a big differentiator for us, and you will see us continue to leverage that strength in Israel as the market continues to grow and evolve. As we continue to execute on our strategic realignment, I'm encouraged that we have maintained our innovation progress with a leaner cost structure. I want to thank our dedicated employees who continue to stay focused on the long-term plan.\n\nWe remain singularly focused on winning in the adult-use cannabis market globally, and our industry leading balance sheet affords us the opportunity to selectively invest and build our platform and new markets as they open. With that, I'll open the line for questions.\n\nOperator\n\nThank you. [Operator instructions] We ask that you, please, limit yourself to one question and one follow-up. Stand by as we compile the Q&A roster. One moment, please, for our first question.\n\nOur first question will come from Andrew Carter of Stifel. Your line is open.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nHey, thanks. Good morning. I wanted to focus -- drill down on the Spinach bags, which has been kind of the vast majority for growth kind of heads -- in the headset trends, obviously, it shows some diminishing returns. First is -- is that profitable on a gross margin basis? And is the theory there like an attachment rate that allows you to get the other Spinach products, whether it be pre-rolls, vapes, on the shelf, and this is just the cost of doing business? Thanks.\n\nMike Gorenstein -- Executive Chairman\n\nSure. Thanks, Andrew. You know, it is -- it is a -- it's a positive gross margin. And, you know, I think there's a few things.\n\nOne, we do -- we do look at it and, you know, it is important from a utilization perspective to be able to, you know, to have the sort of the outflow for, you know, the supply chain. But also, when you think about utilization, for us, it does drive a lot of value in the GrowCo equity that we have to make sure that we're utilizing the facility. You know -- but also, I think it's important for the strength of the brand and for some of the other products we're launching. Getting familiarity with some of the new strains will certainly fuel some of the work that we do in -- in pre-rolled and vapes.\n\nSo, I think when you look at it overall for the portfolio and, you know, value driver, it's certainly there. And, you know, I take your point on 28 grams versus three and a half grams, but I think, you know, we have to look at what consumers want and respond to it.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nThanks. Second question, I wanted to ask about the cost savings, the 20 to 25 achieved this year. Can you give us a sense of how much of those 20 to 25 hit the P&L this year? Therefore, how much is incremental next year? And you did allude to further optimization savings. I wanted to make sure I understood that you could have more.\n\nAnd I know that you said kind of the U.S. is important for your future business, but that's $8 million of cost, if I got that right, a quarter. Is that just -- just a cost that's going to be embedded with you until something changes, until you hit some kind of disruptive, or is even those 8 million or, therefore, 30 million annualized savings in scope as well? Thanks.\n\nMike Gorenstein -- Executive Chairman\n\nSure. So, you know, when we think about the U.S., there's still -- you know, we see opportunity there. I wouldn't say that we are we're happy with the cost structure versus, you know, what the contribution is today. But we do see opportunity in the U.S.\n\nSo, you know, it's still a business that we're working on and making sure that we're making it as lean as possible and, you know, basically transforming into something that's a positive contributor. You know, I'll let Bob speak to where we are overall on the 25 million. But, you know, part of that, when I talk about further opportunities, is just because we had the plan in the beginning of the year, doesn't mean we're not constantly looking for any incremental savings, evaluating everything we do to find, you know, places that we can, you know, improve our bottom line.\n\nBob Madore -- Chief Financial Officer\n\nYeah, thanks. Thanks, Mike. I'll just add a little more color on that. Listen, we're very confident in our ability to hit the 20 to 25 million in cost savings.\n\nThose are actual realized cost savings in this fiscal year versus the prior year. You know, we're -- we're in the middle of and working through our 2023 budget process. And then Mike -- as Mike pointed out in his prepared comments, we're very focused on continuing to, you know, become more efficient and effective. Our realignment strategy and restructuring activities are really going to be a big contributor to, you know, improve not just gross margin, but also operating efficiencies, too.\n\nSo, we're anticipating additional savings beyond the 20 and 25 we realized this year going into 2023 also.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nThanks. I'll pass it on.\n\nOperator\n\nThank you. One moment, please, for our next question. And our next question will come from the line of Michael Freeman of Raymond James. The line is open.\n\nMichael Freeman -- Raymond James -- Analyst\n\nHey, good morning, Mike, Bob, and Shayne. Thanks for taking our questions here. I was glad to see the launch of a CBG-infused pre-rolls, products involving CBN, product development with THCB. I wonder if you could provide us an update on your -- on -- if there's any new strategic thinking on how you are considering deploying cultivated cannabinoids through your partnership with Ginkgo.\n\nThanks.\n\nMike Gorenstein -- Executive Chairman\n\nSure. Thank you. You know, we actually think this could be going well as far as -- as far as uptake for the product. And a lot of the strategy for the product pipeline that we've had in motion does, you know, involve heavily those products.\n\nSo, we've seen great response to -- you know, to the edibles and to the vapes. And with just shipping [Inaudible] with a rare cannabinoid this week or, sorry, last week with pre-rolls. And we just feel like those are the three main categories that make sense to have the rare cannabinoids in. Now, it's some of the cannabinoids we've been developing that haven't been on market starting to come out.\n\nSo, you know -- you know, just given when we look at, say, CBG FEELZ gummies having a 1.9% market share, just, you know, on a single SKU basis, we think the strategy is working, and we think that the portfolio will continue to gain strength as there's more and more new differentiating cannabinoids that we can add to the roster.\n\nMichael Freeman -- Raymond James -- Analyst\n\nOK, great. Thank you. And as a -- as a follow-up, I was -- I was reading that the -- your exit from -- from the Peace Naturals Campus is -- is going to be pushing into 2023. I wonder if you could provide us update on that.\n\nMike Gorenstein -- Executive Chairman\n\nSure. You know, while we think the bulk of the transition should still be done this year, there's just been, you know, some delays with -- with getting some the CMO's up and running to be able to handle the capacity. And for us, what we think is most important is making sure that we're able to, you know, maintain the products on shelf to be able to keep -- keep the top-line momentum so that when the transition is complete, we can fully realize the benefits of, you know, the cost savings. So, we're being -- we're being careful and making sure that we're not rushing.\n\nWe -- we expect still the first half of next year, the transition should be complete. And noting that it's a -- definitely a gradual transition, but we have completed our cultivation activities at [Inaudible]\n\nMichael Freeman -- Raymond James -- Analyst\n\nOK. Thank you. If you would entertain just one more -- thinking about your U.S. strategy, I wonder if you could shed some -- shed some light on your internal thinking, especially in light of Canopy's recent move to execute U.S.\n\ninvestments by way of holding [Inaudible] this changes your view on the U.S. outlook.\n\nMike Gorenstein -- Executive Chairman\n\nYeah. I think, you know, for us, we're in a different situation than a lot of peers. You know, given that -- you know, we have a strong investment with PharmaCann today, but most of our -- most of our dry powder is still, you know, maintained on the balance sheet with a lot of flexibility, not having any debt. And we do look at it still, making sure we have the right product portfolio.\n\nAnd, ultimately, when we look at the U.S., just how do we get out our product portfolio and how do we [Inaudible] do products to add to it? You know, we think that there is certainly a lot of momentum with the Biden announcement. But, you know, we're -- we're looking at structure that fit us best. And I think you'll -- you know, you'll see us getting closer and closer to that. So, we're really excited about the U.S.\n\nopportunity, and we still feel that is a branded product opportunity, and things are going to continue moving more toward the CBG-looking market.\n\nMichael Freeman -- Raymond James -- Analyst\n\nThat's great. Thanks. I'll pass it on.\n\nOperator\n\nThank you. And one moment for our next question. Our next question will come from Vivien Azer of Cowen. Your line is open.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nHi. Thank you. Good morning. I wanted to follow up on the rare cannabinoids.\n\nWhile it's clearly early days for you, Mike, I know you're a keen observer of the U.S. marketplace where products featuring rare cannabinoids are more available. So, I'd love to just get your impressions on what you see from a category-penetration perspective and whether you think that will apply to Canada. Thank you.\n\nMike Gorenstein -- Executive Chairman\n\nSure. It's a great question. You know, I think one of the challenges that led us to work down this pathway is it's still very difficult to get enough availability of some of those rare cannabinoids. You know, there are -- there are some cannabinoids that are easier to get in the U.S.\n\nnow that's CBN and CBG. But, you know, we look at some of the ones, you know, THCB, for example. But you're just not seeing commercial availability and being [Inaudible] to supply. You know, we've seen that even, you know, outside of the traditional cannabis channels, cannabinoids like CBN, once consumers have now learned, you know, what CBN is and what CBN does, there is a lot of uptake of it.\n\nAnd it does provide a differentiator and really like stand-alone branded products. So, you know, we continue to believe that it's -- it's a great opportunity and a good way to, you know, to escape, call it commoditization of the products.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nUnderstood. And for my follow-up, pertaining to Israel, it's nice to hear that the market is reaccelerated. Just would love to get an updated view of where you think market penetration can go in Israel. Thanks.\n\nMike Gorenstein -- Executive Chairman\n\nSure. Yeah. I think, you know, we did have those -- you know, those temporary kind of stop for a few months, and we've seen things start to turn back on. We -- we think that things are now headed back in the right direction.\n\nThe market's looking good growth-wise. And it's really, you know, the thing to watch is what's happening with patient growth, how much of that reaccelerate. Towards -- we just had -- had an election last week, which we think, you know, give more certainty to -- you know, have things move forward politically. And we're very optimistic.\n\nWe think that our ability to continue outpacing the growth of the market on the wholesale channel. Ad then, also, the market continue to grow is -- gives us a bright future.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment, please, for our next question. The next question will come from John Zamparo of CIBC Capital Markets. Your line is open.\n\nJohn Zamparo -- CIBC World Markets -- Analyst\n\nThanks. Good morning. I -- I also wanted to touch on the Israeli market. And can you talk about the pricing dynamics here, and do you think you're taking share in Israel?\n\nMike Gorenstein -- Executive Chairman\n\nSure. Yeah. They -- they're -- you know, there are still been some -- some limited pricing pressure, but it's -- it's relieved compared to what we had, you know, a quarter or two ago. So, you're seeing some of the excess supply work its way through the system.\n\nAnd I think we are taking share. I think that we --we stand out when it comes to quality. I think that the brand is -- is recognized as being a leader. And, you know, we are -- we're continuing to perform.\n\nSo, you know, I think that the combination of having, you know, better quality but also now getting back to patient growth is generally improving the dynamic there. And I think there was sort of a lesson that was learned as far as we did have a big shortage in Israel. So, there was a lot of -- a lot of activities to just bring in whatever products, you know, local companies could find. And I think now, there's a little bit more skepticism in what product is coming in.\n\nSo, we see those macro dynamics continue to improve, and we've already seen them improve over the last couple [Audio gap]\n\nJohn Zamparo -- CIBC World Markets -- Analyst\n\nOK. That's helpful. Thanks. And then my follow-up is on gross margin.\n\nAnd apologies if I missed it. But can you say what this was, either consolidated or rest-of-world if you back out the Peace Naturals exits?\n\nMike Gorenstein -- Executive Chairman\n\nYeah. Bob, do you want to go ahead and take that one?\n\nBob Madore -- Chief Financial Officer\n\nYeah. No, definitely. We really feel confident in the trajectory of our margin profile. You know, there are a lot of pluses and, you know, some minuses that transpired in the quarter.\n\nBut, you know, as you guys talked about a second ago, you know, Israel's margin has remained strong and is growing as that business continues to grow in revenues. You know, we're experiencing lower biomass costs through our relationship partnership with GrowCo, and that's going to be a long-term, sustainable-type savings versus, you know, history, past experience. You know, as cannabis extracts continue to become a bigger part of our business in Canada, you know, continue to have favorable margin trends. They have higher margins than other product categories.\n\nAnd, you know, that was offset particularly in this quarter by a few things. You know, one was we -- we realized and recorded a 1.8 million decline in gross profit dollars sequentially from Q2 in the U.S. business. And a lot of that was driven by taking inventory reserves, discounting product as we work through discontinued use and product categories.\n\nYou know, we had and we experienced in the ROW segment lower fixed cost absorption this particular quarter with the slight delay in our transition out of the Stayner facility, as we've talked about a little bit. We also discussed in the call, you know, the adverse price mix shifts in the Canadian flower categories that's driven by the 28-gram bags that drove some of the margin impact in the quarter. So -- and then lastly, you know, and again, another like period-based anomaly we believe, during this quarter, in the third quarter, we did -- began downstream processing of some rare cannabinoids that haven't reached their milestones yet on efficiency. But we think speed to market for this product and  the differentiation that it's going to create is a great investment, and we'll have a long-term ROI.\n\nSo, you know, there are a lot of pluses that are going to be sustained and sustainable and a lot of minuses. And I would say most of the minuses incurred in the quarter were -- were just period expenses. And I don't consider they're going to be things that carry forward long term.\n\nMike Gorenstein -- Executive Chairman\n\nThanks. Thanks, Bob. And just to follow up on the rare cannabinoid point, what you're seeing here, remember, last year, we amended the agreement so that if we wanted to commercialize the cannabinoid early before the -- the product -- productive [Inaudible] hit, that we had the option to issue one-third of the equity upon commercialization. And so, you know, what you could see back there is we were excited about a cannabinoid that we wanted to get in the market early.\n\nJohn Zamparo -- CIBC World Markets -- Analyst\n\nUnderstood. That was helpful. Thank you.\n\nOperator\n\nThank you. And one moment for our next question. Our next question will come from Nadine Sarwat of AllianceBernstein. Your line is open.\n\nNadine Sarwat -- AllianceBernstein -- Analyst\n\nHi. Thank you. Good morning, everybody. Two questions for me.\n\nSo, first, you've stated that you expect pre-roll innovation to be your next big driver of growth. And I know you called out those two products in particular. So, given that that segment is already pretty crowded, what gives you the confidence that your brands are going to win in that space and drive that growth you're talking about? And then my second question, your U.S. revenues, they continue to fall.\n\nYou've explained that very clearly as part of your realignment plan. Could you give us any clarity as to how we should think about that segment a little bit more long term? Should we think of this quarter as a bottom? Is there more decline to come? How can we expect it? When should we expect it to actually start growing again? Thank you.\n\nMike Gorenstein -- Executive Chairman\n\nSure. Thanks. For the first question, look, I think every category in cannabis either is crowded or will quickly become crowded until there is ultimately differentiation and you see companies start to set apart. So, when we think about the way that we're entering, you know, taking similar approaches in other categories, it's about really focusing on what we think consumer wants.\n\nIt's, you know, making sure that the brand is, you know, going to perform well and that we have a really, really good product. So, there's a lot of innovation to come in pre-rolls. But one of the reasons you're seeing some movement there is there's -- there's an opportunity to differentiate, able to provide a lot of value to consumers as far as the complexity of the product with different [Inaudible] and flower and the convenience. So, you know, I think it's ultimately the same.\n\nYou know, you could have said that edibles is really crowded. And I think we've performed well. And I think that pre-roll is a very large category with a lot of runway and opportunity. So, you know, we're excited about it, and I think that, you know, this is only the beginning.\n\nWe have a lot that will be coming out for the next -- the next couple of years, and I think it's going to continue to take share from flower. As far as -- as far as the U.S., I think it's still something that you'll see in transition. I mean, we are going to be focused on continuing to skinny down and get to a place where we're focused on just the adult-use product formats. And I think, you know, you'll then see -- start to grow when we're able to get the right innovation back in the market and we have the infrastructure proper.\n\nYou know, I think that while we would limit the formats, what we can do to our product SKUs, it's something where you see the growth come from. You know, there's cannabinoids beyond CBD that we think are able to stand out and, you know -- and provide more growth. I think it's very hard to differentiate with only CBD. And it's similar to what we see in, you know -- in THC-type products.\n\nSo, I think being able to use a lot of different cannabinoids is what's going to drive the growth there.\n\nNadine Sarwat -- AllianceBernstein -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nThank you. And one moment, please, for our next question. Our next question will come from the line of Andrew Bond of Jefferies. The line is open.\n\nAndrew Bond -- Jefferies -- Analyst\n\nHey, good morning. Andrew Bond on the line for Owen Bennett. Thanks for taking our question. I wanted to touch -- revisit on the comments you've  made about the sizable dry powder you have on the balance sheet and prospects for M&A.\n\nObviously, valuations in the industry across the board have been coming down. Can you give any more detail around what opportunities you might be evaluating, valuation levels you are seeing? And can you remind us of kind of how -- how your focus is in terms of assessing how you'd like to deploy that -- deploy that cash? Thank you.\n\nMike Gorenstein -- Executive Chairman\n\nSure. I think that's a great question. You know, I think valuations, certainly, are coming down. I think that one of the things that we probably think about differently here is we're, again, looking at what happens in a world where state borders fall and when there's the equilibrium of supply and demand.\n\nSo, we're looking when, you know, what's going to stand out when you're able to always find a location that you're able to go and pick up product, what's it look like in a mature market? And for us, that comes down to branded products. So, we haven't really changed in our thinking there. Still looking to see, you know, what the best opportunities are. And -- and you see every -- you know, every quarter, you're seeing separation and you're seeing that kind of maturity in a lot of the markets.\n\nSo, you know, we're not as interested in, \"OK, here's a brand-new market. Look at this huge sizable margin spread, \" because you'll see that that will compress as you're able to get more supply on the market. And then, over time, that starts to shift as with any other consumer product industry toward what the best branded products are.\n\nAndrew Bond -- Jefferies -- Analyst\n\nGot it. Thank you, Mike. I'll pass it on.\n\nOperator\n\nThank you. One moment, please, for the next question. Our next -- excuse me. Our next question will come from Matt Bottomley of Canaccord Genuity.\n\nYour line is open.\n\nMatt Bottomley -- Canaccord Genuity -- Analyst\n\nGood morning, all. Thanks for the question here. Just one follow-up for me, Mike. Just on one of your comments in the Q&A here that, you know, you anticipate a lot of different product categories, particularly in Canada, to eventually become saturated, which I would -- I would agree with.\n\nIn the current regulatory environment, do you think, you know, a lot of the gains, you know, Cronos has done, particularly in the edible category, there's been one or two of your peers which edible seem to be a category where there's been some growth here. What's your view on how that [Audio gap] category in particular is going to trend. Obviously, dried bud kind of fell off a cliff, particularly at the -- at the value segment. Do you think kind of branded products, as limited as they are in Canada, are a little more protected from that, or are you anticipating over the next 12, 16 months is going to have to be additional pivots even in the categories that are doing well for you right now?\n\nMike Gorenstein -- Executive Chairman\n\nYeah. Sorry. Just to clarify what I -- what I meant there -- that's a great question. You know, what I meant by saturated is there's not going to be an opportunity in cannabis, just given how large of an industry and all of the potential where you're going to be the only one who moves in and say, like you're one of three companies that are offering pre-rolls.\n\nThere's an opportunity, you can expect everyone's going to go chase it. But what I -- what I do think and I liked about pre-rolls and all, you know -- just all types of edible is the further you get from flower, you know, the -- the more differentiation you can have. Adding edibles is probably about as far along that differentiation as you can get. So pre-rolls is certainly right up there, but I don't think you're going to see a lot of change in edibles.\n\nAnd it's not a coincidence. If you look at the U.S., edible is -- is probably more than any other category. We can see consistent brands that are popping up across different states, even though they aren't necessarily your traditional multistate operator. I think you'll see that with pre-rolls.\n\nSo, I think there's more innovation to come, you know, outside of just gummies in Canada. But I think it started off saturating. If anything, you know, you're seeing leaders emerge, and there's much more stickiness than something like flower.\n\nMatt Bottomley -- Canaccord Genuity -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. And this will conclude the Q&A session of today's call and will also conclude today's conference call. Thank you all for participating. You may now disconnect and have a pleasant day.\n\nBob Madore -- Chief Financial Officer\n\nThank you.\n\nDuration: 0 minutes\n\nShayne Laidlaw -- Investor Relations\n\nMike Gorenstein -- Executive Chairman\n\nBob Madore -- Chief Financial Officer\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nMichael Freeman -- Raymond James -- Analyst\n\nVivien Azer -- Cowen and Company -- Analyst\n\nJohn Zamparo -- CIBC World Markets -- Analyst\n\nNadine Sarwat -- AllianceBernstein -- Analyst\n\nAndrew Bond -- Jefferies -- Analyst\n\nMatt Bottomley -- Canaccord Genuity -- Analyst\n\nMore CRON analysis\n\nAll earnings call transcripts"
}