{
  "companyName": "Transocean",
  "companyTicker": "RIG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/transocean-rig-q3-2022-earnings-call-transcript/",
  "content": "Transocean (RIG)\nQ3 2022 Earnings Call\nNov 03, 2022, 9:00 a.m. ET\n\nOperator\n\nGood day, everyone, and welcome to today's Q3 2022 Transocean earnings conference call. [Operator instructions] It is now my pleasure to turn the conference over to Alison Johnson, investor relations.\n\nAlison Johnson -- Investor Relations\n\nThank you. Good morning, and welcome to Transocean's third quarter 2022 earnings conference call. A copy of our press release covering financial results, along with supporting statements and schedules, including reconciliations and disclosures regarding non-GAAP financial measures are posted on our website at deepwater.com. Joining me on this morning's call are Jeremy Thigpen, chief executive officer; Keelan Adamson, president and chief operating officer; Mark Mey, executive vice president and chief financial officer; and Roddie McKenzie, executive vice president and chief commercial officer.\n\nDuring the course of this call, Transocean management may make certain forward-looking statements regarding various matters related to our business and company that are not historical facts. Such statements are based upon current expectations and certain assumptions, and therefore, are subject to certain risks and uncertainties. Many factors could cause actual results to differ materially. Please refer to our SEC filings for our forward-looking statements and for more information regarding certain risks and uncertainties that could impact our future results.\n\nAlso, please note that the company undertakes no duty to update or revise forward-looking statements. Following Jeremy and Mark's prepared comments, we will conduct a question-and-answer session with our team. [Operator instructions] Thank you very much. I'll now turn the call over to Jeremy.\n\nJeremy Thigpen -- Chief Executive Officer\n\nThank you, Alison, and welcome to our employees, customers, investors, and analysts participating on today's call. As reported in yesterday's earnings release, for the third quarter, Transocean delivered adjusted EBITDA of $268 million on $730 million in adjusted revenue, resulting in an adjusted EBITDA margin of approximately 37%. Our overall performance was supported by strong bonus revenue and the transition to higher day rates on several of our rigs. As usual, this was truly a team effort.\n\nAs such, I would like to extend a sincere thank you to the entire Transocean team for their commitment every day to deliver best-in-class service to our customers and the best possible results for our shareholders. On our second quarter earnings call, I addressed the ongoing energy security concerns that have become an area of international focus following the Rush Ukraine conflict. Access to affordable, reliable energy sources is essential to global economic prosperity. The sabotage of the Nord Stream pipeline carrying gas from Russia to Europe further underscores the importance of a reliable and diverse energy supply chain.\n\nA vicious cycle of poor shareholder returns in the downturn and aggressive ESG investment mandates led to chronic underinvestment in reserve replacement, which ultimately affects production. Consequently, we are facing a risk of sustained oil and gas shortages globally. Separately, this year, slowing inflation and rising interest rates have, for the first time in almost eight years, shifted investor sentiment toward energy stocks, oil and gas, in particular. This shift, coupled with the recent effects of systemic underinvestment in energy have further exposed the impracticality of a swift global transition from fossil fuels.\n\nIn the mid- to long term, demand for all sources of energy will continue to grow, and it's imperative that new sources that supply are discovered and developed to meet this demand. And while hydrocarbons will undoubtedly over time, lose market share to renewables in the overall energy mix, most believe that volume metric demand for oil and gas will continue to increase. In fact, Rystad Energy recently estimated that 63 million barrels per day of new supply are needed to avoid a shortfall in 2030. This cannot be accomplished without significant investment in additional exploration and development, including in the offshore basins requiring our assets and expertise.\n\nAccordingly, we as the market leader in offshore drilling, having necessarily an important role to play in the ongoing energy expansion for the foreseeable future. Let's now turn to the fleet. As reflected by the new fixtures in our October 13th fleet status report, we observed heightened demand for our services again in the third quarter. I'm pleased to share that we added an incremental $1.6 billion in backlog since the release of our July fleet status report, bringing our total backlog to $7.3 billion.\n\nImportantly, these fixtures come from five separate regions, confirming that the recovery of the offshore drilling market is indeed global. And as I will discuss in more detail in a few minutes, we continue to see a steadily increasing number of tenders in addition to numerous direct negotiations with our customers. I'll now provide a summary of our recent fixtures. First, I'd like to briefly recap two awards discussed on our second quarter earnings call as these two important contracts are now reflected in our backlog numbers.\n\nIn the Gulf of Mexico, we signed a contract with a major operator for two years on the Deepwater Conqueror and direct continuation of the current program at a very favorable rate of $440,000 per day with up to an additional $39,000 per day for managed pressure drilling, integrated services and our technology products. The contract represents approximately $320 million in firm backlog and take the rig off the market through Q1, 2025. Also discussed on our previous call, in Brazil, the Petrobras 10,000 received a nearly six-year contract starting at $399,000 per day and escalating annually to $462,000 per day. As a reminder, the rate does not include an additional fee for the customers anticipated use of our patented dual-activity technology, which remains valid through May of 2025.\n\nThe contract will commence directly following the end of the current term in October 2023 and adds an estimated $915 million to our backlog. Now to the remainder of our recent fixtures. In the Gulf of Mexico, Murphy Oil awarded the Deepwater Asgard a one-well contract plus a one-well option at a rate of $395,000 per day anticipated to commence in the fourth quarter. I'm pleased to say that the option has been struck and closes the small gap before the rig moves to its next program, a one-year contract with an independent operator at a rate of $440,000 per day.\n\nWith the addition of these two contracts, the rig is now busy through January 2024. In Suriname, the Development Driller I received a one-well contract with Total Energies at a rate of $345,000 per day, excluding additional services. The firm contract, which is expected to commence in Q1 2023 also includes two one-well options at $360,000 per day and $370,000 per day, respectively. In Norway, our joint venture, Harsh Environment Semi, the Transocean Nordia, was awarded a 17-well contract with Wintershall Dea and OMV at day rates escalating from $350,000 per day to $430,000 per day, resulting in an initial $73 million contribution to our backlog.\n\nBut assuming that the components of the program received final investment and government PDO approvals, which we expect, the backlog potential is $437 million based upon an average market-leading regional day rate for a full term of $408,000 per day. Also in Norway, Equinor exercised a one-well option on the Spitsbergen at a rate of $316,000 per day. The option extends the current firm term through September 2023, bringing the GAAP between the end of the current contract and the commencement of the rig follow-on contract also with Equinor. In the U.K., Harbor Energy exercised a one-well option in the Paul B Loyd Jr.\n\nat a rate of $175,000 per day, extending the contract through September of 2023. If all options are exercised, the Paul B Loyd will be contracted through June of 2024. In India, Reliance Industries exercised a one-well option on the KG1 to $330,000 per day. The rig will move to perform this work and then return to complete the current campaign.\n\nWith the addition of this well, the rig is now contracted through October 2023. Looking forward, we expect the global recovery for the offshore drilling market to continue on a pace consistent with the past several quarters. The offshore capex budgets of the majors have increased for the second consecutive year, and we're seeing this reflected in tender and contracting activity. Importantly, these budgets are increasingly directed to offshore deepwater.\n\nYear to date, the majors have contracted nearly 31 rig years on deepwater drillships, when compared to 20.5 years for jack-ups. Drillship day rates have continued their upward trajectory and moved comfortably above the $400,000 per day mark. As an example, in just 10 months, the Deepwater Conqueror saw rates increase $105,000 per day, excluding integrated services like NPD. And if we look at the third quarter of 2020, the average drillship fixture was $184,000 per day.\n\nLast quarter, the average was $393,000 per day, an increase of 113%. Taking a closer look at the global market environment. Active utilization in the Gulf of Mexico is expected to remain effectively 100% as we estimate 8 programs to be awarded with commitment, commencements in the next 18 months. As a direct result of this limited active supply, we continue to see our customers favor direct negotiations with an increasing propensity toward multiyear programs.\n\nAlso, I'm pleased to share that last week, the Deepwater Atlas commenced its in agro campaign with Beacon Offshore Energy. Needless to say, we are extremely excited to kick off this development with one of our two new eighth-generation drillships. The Atlas will perform the drilling campaign with Beacon for the first 255 days of this contract before the installation of its 20,000 psi BOP stack. The Atlas will then return to operations with Beacon for another 275 days as the industry's first or perhaps second closely following our Deepwater Titan, 20,000 psi floating rig.\n\nNext contracting activity in Latin and South America remains strong with a number of open tenders. In Brazil, Petrobras alone could contract an additional 12 rigs to long-term work, several of which would likely come from outside the country. The much anticipated results of the Petrobras pool tender have been announced, and we are pleased to confirm that the Deepwater Corcovado and Deepwater Orion are among the seven rigs that Petrobras selected for this work at day rates of $399,000 per day and $416,000 per day, respectively. The period for public comment has passed, and we anticipate contracts will be signed in the coming weeks, at which time, we estimate we will add approximately $1 billion to our backlog.\n\nAdditionally, Petrobras' BMS-11 prospect is expected to be awarded by the end of the year with the award for the Buzios field development anticipated in the first quarter. These two multiyear tenders could put an additional five rigs to work, further limiting the pool of available rigs and tightening the global market as we expect most, if not all of the rigs necessary to deliver these projects will be mobilized from outside the region. In addition to Petrobras requirements, Shell, Equinor, and Total Energies will be tendering for their respective programs in Brazil, each requiring a minimum of one year with anticipated commencements in the 2024, 2025, time frame. In India, we anticipate in the next few months, ONGC will retender for previously tendered work that was not awarded.\n\nThe new tender is expected to be for two rigs, each with 21 months of firm term with commitments scheduled for mid-2023. With extremely limited local supply, we expect strong dayrates to be announced when contracts are ultimately awarded. Moving to the harsh environment market. In the third quarter, 3,924 days were contracted in the North Sea market, including Norway and the U.K.\n\nIt's the highest incremental days added since the third quarter of 2012. Of the contracted days, 72% were in Norway, where we are beginning to see the supply of rigs decline as demand from outside Norway could pull up to 4 rigs out of the North Sea market in 2023. This is a result of the opening of new harsh environment regions, including the South Atlantic and the Basra South of Australia. In the U.K., policies to improve energy reliability and security are expected to drive incremental investment in the sector, including offshore oil and gas.\n\nThe active market is nearly sold out for 2023, and we are seeing longer-term opportunities that have not been typical in the U.K. in recent years, including programs longer than one year in duration for Ithaca, Equinor, and EnQuest. In the near term, it's likely shorter duration opportunities will require rigs to come from outside the country, applying even more strain on the rig availability in Norway. On that topic, earlier this week, we signed a conditional letter of award, or CLOA, for the Barents for work in the U.K.\n\ncommencing in the first quarter of next year. Final signature is expected by the end of the month and the PLOA provides for cancellation fees in the event of termination. With the recent multiyear awards for our transition Norga and several of our competitors rigs in Norway, we expect the number of available high-spec rigs in country to diminish very quickly. Based on our internal analysis, we expect the Barents to be one of several rigs that will leave Norway in the next few months for work elsewhere, removing the highest specification available assets remaining from the Norwegian market.\n\nPresently, there are 24 Norwegian AOC compliance semis in just 18 of those in country. Current demand supports around 15 floaters and is expected to increase as projects sanctioned under the tax incentives to come online. Consequently, we anticipate the Norwegian market will not have enough rigs to fulfill customer requirements by 2024. In Australia, there are two programs with durations greater than one year expected to commence in the next 18 months.\n\nWe believe this requires us to two incremental rigs, one opportunity is in the Vasterain Southern Australia and due to extreme marine conditions requires a harsh environment semi. Separately, Woodside is tendering for a DP moored rig for its program. As we prepare our assets for the future, we continue to invest in technologies that add value for Transocean and our customers. Last quarter, we installed the first crane anti-sway rotator in our fleet on to the Deepwater Glossop.\n\nThis technology further reduces the exposure of our personnel to hazards associated with lifting and moving equipment and free them up to complete other activities. We look forward to fully utilizing the tool and operations and installing units onto other assets across our fleet. We've also agreed with one of our customers to deploy the second kinetic blowout stopper in our fleet and anticipate it being operational in the first quarter of 2023. As a reminder, KBOSS is a pyro-mechanical device that is designed to share and seal any object in the wellbore in milliseconds.\n\nImportantly, this technology significantly reduces the risk of non shareable across the BOP. As an update to our emission reduction initiatives, we've now adopted and implemented a fuel additive on four of our rigs with agreements for implementation on 4 additional rigs. When these installations are complete, we will be utilizing the additive on over 40% of our contracted fleet. The additive optimizes fuel consumption, thereby lowering our emissions and reducing our costs.\n\nField tests utilizing the additives suggest fuel consumption can be reduced by 6% depending upon engine loads. At this time, we're tracking operational statistics to better analyze real-world reductions in savings. In summary, the demand for our assets and services remain strong, and accordingly, our outlook for our high-specification floating fleet is the most optimistic it has been in recent years. Increased cash flows from higher day rate contracts will enable us to continue to address our balance sheet.\n\nAs we transition our focus from extending our liquidity runway to actually deleveraging and positioning the company for the future. As the supply of high-specification floaters remains extremely limited, we anticipate there will be more opportunities to begin reactivating our cold-stacked fleet. As always, we will continue to prudently examine all opportunities to place our cold stacked rigs back into the market and thoroughly assess each potential reactivation on a case-by-case basis to ensure that each creates value for the company and our shareholders. Finally, we echo the sentiment heard across broader oilfield services and reaffirm our view that we have definitely entered a multiyear upcycle.\n\nAs always, we will continue to focus on delivering the safe, reliable, and efficient operations upon which we have built our reputation as the leading provider of high-specification, ultra-deepwater and harsh environment drilling services. I'll now turn the call over to Mark.\n\nMark Mey -- Executive Vice President, Chief Financial Officer\n\nThank you, Jeremy, and good day to all. During today's call, I will briefly recap our third quarter results, provide guidance for the fourth quarter and conclude with preliminary expectations for 2023, including our latest liquidity forecast. As is our practice, we will provide more specific guidance when we have our 2022 year-end call in February of next year. As we reported in our press release, which includes additional detail on our results for the third quarter of 2022, we reported a net loss attributable to controlling interest of $28 million or $0.04 per diluted share.\n\nDuring the quarter, we generated adjusted EBITDA of $268 million and improved our adjusted EBITDA margin to approximately 37%. We also generated cash flow from operations of approximately $230 million. Looking closer at our results during the third quarter, we delivered adjusted contract drilling revenue of $730 million and an average day rate of $343,000. Revenues above our previous guidance due to a combination of more than anticipated operational days and early termination payment on the Equinox and higher reimbursable, partially offset by lower-than-expected revenue efficiency.\n\nOperating and maintenance expense for the third quarter was $411 million. Costs came in below our guidance due primarily to the timing of certain maintenance activities and other costs. We ended the third quarter with total liquidity of approximately $2.1 billion, including unrestricted cash and cash equivalents of approximately $154 million, approximately $387 million of restricted cash for debt service, and $774 million from our undrawn revolving credit facility. I will now provide an update on our expectations for the fourth quarter.\n\nWe expect adjusted contract drilling revenue of approximately $600 million based upon an average fleet quired revenue efficiency of 96.5%. The quarter-over-quarter decrease is attributable to somewhat lower activity in the fourth quarter. We expect fourth quarter O&M expense to be approximately $440 million, which is higher than the prior quarter due to the timing of certain maintenance activities. We expect G&A expense for the fourth quarter to be approximately $54 million.\n\nThe quarter-over-quarter decrease increase is attributable to professional accounting and legal fees. Net interest expense for the fourth quarter is forecast to be approximately $104 million. This includes capitalized interest of approximately $16 million. Capital expenditures and capital additions for the fourth quarter, including capitalized interest, were forecast to be approximately $575 million.\n\nThis includes approximately $540 million for our newbuild drillships and $35 million of maintenance capex. Cash taxes are approximately $9 million for the fourth quarter. Now I'd like to provide Proman overview of our financial expectations for 2023. Recurring forecast adjusted contract revenue to be between $2.9 billion and $3 billion.\n\nFurthermore, we believe our full year 2023 O&M expense will be between $1.8 billion and $1.9 billion. Finally, we expect G&A costs to be around $200 million. Our expected liquidity in December 2023 is projected to be between $1 billion and $1.2 billion, reflecting our revenue and cost guidance and including the $600 million capacity of our revolving credit facility and restricted cash of approximately $300 million, which is reserved for at service as well as anticipated secured financing of our second eighth generation drillship with Deepwater Titan. This liquidity forecast includes the 2023 capex expectation of $260 million.\n\nThe 2023 capex includes approximately $150 million related to our new builds and $100 million for maintenance capex. The new board capex includes mobilization, capitalized interest costs related to the 20,000 BOP upgrades and capital spares. Our 2023 capex guidance includes contract preparation costs for the Deepwater Orion, reflecting our expectation that we have successfully contracted rig with Petrobras under its full tender. As always, our guidance excludes any speculative rig reactivations or upgrades.\n\nIn conclusion, rig day rates are now above levels necessary to generate cash flows that help support deleveraging our balance sheet. As Jeremy mentioned, we are beginning to benefit from the strengthening market as it brings roll off their legacy contracts onto these higher day rates. While our focus is on deleveraging, we will also take prudent actions that contribute to our financial flexibility. In this regard, as we have previously highlighted in our presentation materials, we will continue to evaluate the potential for opportunistic refinancing of some of our outstanding secured bonds into one or more new bonds with the objective of extending maturities and increasing net-term liquidity.\n\nAs you would expect, the terms, timing and occurrence of earning transactions are dependent upon a variety of factors, particularly market conditions at the time of such transactions. Additionally, at this time, we do not expect to engage in exchange transactions such as the one we executed in the third quarter. And absent any material increase in the trading price of our shares, we do not plan to utilize our ATM equity sales program in the near future. We reiterate the creating value for our shareholders and we manage our priority, and we will assess all feature actions through this lens.\n\nThis concludes my prepared comments. I'll now the call back over to Alison.\n\nAlison Johnson -- Investor Relations\n\nThanks, Mark. Shannon, we're now ready to take questions. [Operator instructions]\n\nOperator\n\nThank you. [Operator instructions] We'll go ahead and take our first question from Thomas Johnson with Morgan Stanley.\n\nThomas Johnson -- Morgan Stanley -- Analyst\n\nAll right. Thanks, and congratulations on the strong quarter here. First question on the reported O&M expense. Obviously, you know well below the guided number, some helpful commentary there on maintenance timing, which is not a typical, but it would be helpful just to get some additional color on the impact of kind of FX in the quarter.\n\nObviously, that was noted in the press release. I guess, a, could you guys give us a ballpark number of the possible tailwinds from the strengthening U.S. dollar there? And maybe rough outlines on the percent of kind of opex that is non-USD just in an average quarter.\n\nMark Mey -- Executive Vice President, Chief Financial Officer\n\nThomas, this is Mark Mey. So obviously, the U.S. dollar has strengthened negative impact on our cost, but the main reason for the cost increase is the -- some of the supply chain challenges and the timing of the making expand is tied to supply chain hiccups. We've mentioned this in previous quarters that some of our major vendors are having difficulty in meeting delivery schedules.\n\nAnd as such, some of our planned maintenance expenses get pushed out from quarter to quarter. As you've seen in our fourth quarter earnings is guarded to be higher because of the shortfall in Q2 and Q3. So there should be some catch-up in the fourth quarter. Regarding the modeling questions, I suggest you speak to Alison afterwards.\n\nThomas Johnson -- Morgan Stanley -- Analyst\n\nGreat. That's helpful. And then last one, just on the Deepwater Titan, I know prior commentary has been around possibly an issue up to $400 million of secured against that asset once it's delivered and on contract. Obviously, that is a constructive number there.\n\nSo I guess, a, could you kind of provide any updated outlook for a plan for the deepwater tightening just for helping us think through additional liquidity, maybe when typically would you be able to issue secured against the ship after it's commenced its initial contract?\n\nMark Mey -- Executive Vice President, Chief Financial Officer\n\nYes, Thomas. So we expect the rig to be delivered in the fourth quarter, probably later in the fourth quarter. Never after the rig will mobilize the U.S. Gulf of Mexico, once the rig leaves Singapore, we plan to start working on a secured transaction.\n\nWe said in the past that we could raise up to $400 million, that's conservative. I would say it's between $400 million and $500 million. And as the market has stabilized over the last, call it, two and a half, three weeks, we feel highly confident that we can achieve that. So you can expect to see this financing completed in the first quarter of next year right before the rig starts operating for everyone.\n\nOperator\n\nThank you. And our next question comes from Eddie Kim with Barclays.\n\nEddie Kim -- Barclays -- Analyst\n\nHi. Good morning. So we've seen day rates increase pretty dramatically here in just the past four months. But if I look at all the contracts with day rates at or above 400 a day and we count about 15 of them, nearly all those have either been in the Gulf of Mexico or Brazil.\n\nSo my question is, when can we expect to see day rates at a similar level in other regions like West Africa or Asia Pacific, for example? And is there something structural about those regions that are making day rate increases a little harder to come by?\n\nRoddie Mackenzie -- Senior Vice President of Marketing, Innovation, and Industry Relations\n\nYes. This is Roddie. I'll take that one. So yes, we've seen the first move in rates coming in the U.S.\n\nGulf of Mexico kind of followed up with long-term and high day rates, higher day rates in Brazil. In West Africa, we're actually beginning to see that. So there's been a couple of fixtures that are closer to those numbers. Most recently, you'll see stuff in Angola getting around that $400 and above mark.\n\nWhat we're actually looking at it now in terms of like a market outlook is a tighter and tighter market from our point of view that there's just not as many capable assets available. So I think you're going to see a pretty substantial move in those markets as well. Asia typically is a little bit lower specification. So if you look at the tenders in Asia, you look at the assets that are there, they are typically kind of the 6th gen and the fifth gen assets.\n\nSo that's usually the last place for dairies to start moving. We also happen to be coupled with a particularly low operating cost. So even though you may not see the highest day rates in those regions, you will see very solid EBITDA margins created by those contracts. So I think in summary, your kind of seeing this ripple effect across the markets, primarily because these rigs move between markets because they're mobile, because they're capable in all these different jurisdictions, you simply see them moving first in the ones where they're in the highest demand.\n\nAnd I think you'll actually see some of the lower specification rigs getting better and better day rates as the market gets tighter and tighter, it's typically the way things go in an upturn. But yes, I look super encouraged by Brazil rig counts potentially going from around 28 rigs in Brazil in this time frame to in excess of 40 rigs within the next 12 to 18 months. So it would be very interesting to see if the industry is capable of producing that number of assets in Brazil. But yes, it's super encouraging things.\n\nEddie Kim -- Barclays -- Analyst\n\nThat's very helpful. And just my follow-up is on reactivation. So one of your competitors earlier this week said reactivation economics are very attractive at current day rates. Transocean is understandably in a little bit of a different situation, given the leverage on the balance sheet.\n\nSo you may have other more pressing priorities for that reactivation expense. So just curious if that is impacting your decision at all in pulling the trigger on a reactivation here, even if you are coming across contracts today with a sufficient level of pricing and term or maybe a simpler way of asking is if Transocean had been debt free for the past year, year and a half, would we have seen a reactivation by now?\n\nMark Mey -- Executive Vice President, Chief Financial Officer\n\nSo let me start, and then I'll already comment as well. We've said consistently, I think, over the last four or six quarters that we will reactivate rigs to contract. Hence, you have not seen us do this. With the most recent Petrobras tenders, we have built in some of our cold-stacked rigs.\n\nAnd there's a good possibility that we'll be able to achieve one or two of those rigs on contract. Those contracts at those rates and mobilization fees will allow us to fully pay back the cost to reactivate the rig long before the end of the contract. So we're very comfortable doing this and balance sheet leverage or not is not going to be habit us from activating rigs.\n\nJeremy Thigpen -- Chief Executive Officer\n\nYes. I think I would add to that and kind of say that previous administrations that our competition may have gone down that track. But certainly, what we're hearing across the board is that nobody is willing to speculatively reactivate those rigs. But what you are seeing is reactivations for contracts that support that.\n\nAnd you know, so to Mark's point, I think we've been really clear on that over the entire cycle that we will not reactivate on speculation, but we will do it to contract, and we will ensure that that contract fully pays that reactivation. So actually just don't see that, that's going to be an issue to Mark's point in terms of does our financial requirements prohibit us, -- certainly not because we're only bidding on things that are cash flow positive over the term of that contract.\n\nEddie Kim -- Barclays -- Analyst\n\nGot it. Thank you. Appreciate all that color.\n\nOperator\n\nI'll take our next question from Fredrik Stene with Clarksons Securities.\n\nFredrik Stene -- Clarksons Platou Securities -- Analyst\n\nHey, guys, and congratulations on strong performance this quarter, nice cash flows, I would say. So I think some of my questions have been touched upon already, but I wanted to circle a bit back to the day rate side. With a few quarters back when you guys were pushing the 400 Kmart in use Gulf of Mexico, I think it was -- at least with the operators reluctance in a way to actually see something starting with a four handle that they were trying to package this into other types of or a way to recognize this revenue, higher mod fees but lower clean day rates, etc. So now we push toward or upping to the mid-400s, it's starting to get global for sure.\n\nAnd I think for me, I'm wondering when are we going to see this five handle. I'm of the firm opinion that we are short on rigs on filters in the Golden Triangle and that we need to see reactivations. But now there's this battle between operators, again, what are their willingness to pay, how do they ambition the future? Are they understanding the lack of capacity, etc.? So I was wondering, do you have any thoughts on whether or not the trend that we see now can continue? Or if you want to -- or if you need to have a battle with UP companies once again to start to see far handles.\n\nJeremy Thigpen -- Chief Executive Officer\n\nSo greedy, man. No. I think we agree with you in terms of shortage of active supply, definitely high-specification assets. We're seeing it.\n\nI think our customers are finally realizing it to. And we see that in the way that they're behaving. More direct negotiations, certainly trying to -- I wouldn't say, hide their prospects, the rigs that they're interested in, but they see the lack of availability. So we're having far more direct negotiations, which is a good sign.\n\nYou've seen day rates steadily improve. I mean, pretty dramatically. I think I said in my prepared remarks that over the last year, day rates have improved 113% for ultra-deepwater drillships. And so we expect that trend to continue.\n\nOur customers feel it. They know it's coming. And so I'm not going to give you a date by when we would see a five handle, but we're definitely moving in that direction. And I'll turn it over to Rod to add even more color.\n\nMark Mey -- Executive Vice President, Chief Financial Officer\n\nYes. I think I would add to that, that those that have moved while the rates are still in the 400. They've done so because it represents very good value for money. I mean don't forget that over our seven years of winter, the prospects that are being invested in now are breakevens in the 30s and 40-barrel range.\n\nSo even with a substantial increase in the rig rates, there's still economically very sound prospects. If you couple that to where you have a stable, high commodity price as we've had for some time, albeit volatile, but it's volatile above that -- well above that investment level. I just think that you're going to see the scarcity of the rigs become more and more of an issue, particularly for specifications that customers need. So hard to see us going anywhere but up in terms of day rates.\n\nBut certainly, as I often explained, the operators are kind of paying three-quarters of a day, or at today, we still haven't got back to what we would consider a full-day rate, but I think you will see that over the next couple of years.\n\nFredrik Stene -- Clarksons Platou Securities -- Analyst\n\nAnd I think we're of the same opinion area and I would also add that you should allow to be greedy after detail years.\n\nMark Mey -- Executive Vice President, Chief Financial Officer\n\nI agree with you.\n\nOperator\n\nThank you. And our next question, our final question comes from Karl Blunden with Goldman Sachs.\n\nKarl Blunden -- Goldman Sachs -- Analyst\n\nHi. Good morning. Thanks for the time and Congrats on the strong results this quarter. I was curious about the comment about not intending to use the ATM.\n\nYou used it during 3Q, pretty similar stock price overall. And so just interested in understanding what has changed maybe through under expectations or comfort with liquidity. Just any other color there would be helpful.\n\nMark Mey -- Executive Vice President, Chief Financial Officer\n\nKarl, as you're probably aware, we evaluate this on a continuous basis. In the third quarter, we were expecting to have some expenses, which we felt we would need to shore up our balance sheet. So we use the ATM. We feel comfortable now, as you've heard with my liquidity forecasts on the prepared comments, we're very comfortable with where we are, and we expect to transact with the [Inaudible] potentially with the secured bonds.\n\nAnd with those transactions, we think our liquidity is in a good place. So we can revisit this. Our stock price jumps to $5, could we use the ATM, perhaps. But at the moment, we feel comfortable where we are.\n\nKarl Blunden -- Goldman Sachs -- Analyst\n\nThat's really helpful. I mentioned also, Mark, thoughts around these extensions of the secured bonds, you could look to do that extended into one or more secured bonds. So presumably, that means maybe a pooled contract or just a standard approach where you've had a bond backed by a rig and cash flows from a contract. As you think about that, what are the considerations that you're looking at when you think about the optimal outcome for Transocean?\n\nMark Mey -- Executive Vice President, Chief Financial Officer\n\nYes. As I said, the two benefits translation is a restructured amortization program. What that does is it utilizes the remaining part of those contracts, especially the shelf contracts, because we put on six and seven-year bonds, we can to contract. So we have sales of three or four years, which will not get utilized, which means the amortization things pushed out over that time period, which improves near-term liquidity.\n\nElse there's more financial flexibility by having the bonds collapsed into one or two larger bonds. So the balance sheet becomes a little bit less complex.\n\nOperator\n\nAnd ladies and gentlemen, that does conclude today's question-and-answer session. I'll turn the conference back over to Alison Johnson for any concluding remarks.\n\nAlison Johnson -- Investor Relations\n\nThank you, Shannon, and thank you, everyone, for your participation on today's call. We look forward to talking with you again when we report our fourth quarter 2022 results. Have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAlison Johnson -- Investor Relations\n\nJeremy Thigpen -- Chief Executive Officer\n\nMark Mey -- Executive Vice President, Chief Financial Officer\n\nThomas Johnson -- Morgan Stanley -- Analyst\n\nEddie Kim -- Barclays -- Analyst\n\nRoddie Mackenzie -- Senior Vice President of Marketing, Innovation, and Industry Relations\n\nFredrik Stene -- Clarksons Platou Securities -- Analyst\n\nKarl Blunden -- Goldman Sachs -- Analyst\n\nMore RIG analysis\n\nAll earnings call transcripts"
}