{
  "companyName": "Lyft",
  "companyTicker": "LYFT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/07/lyft-lyft-q3-2022-earnings-call-transcript/",
  "content": "Lyft (LYFT 1.57%)\nQ3 2022 Earnings Call\nNov 07, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Lyft third quarter 2022 earnings call. At this time, all participants are in listen-only mode to prevent any background noise. Later, we will conduct a question-and-answer session and instructions will be given at that time. [Operator instructions] As a reminder, this conference call is being recorded.\n\nI would now like to turn the call over to Sonya Banerjee, head of investor relations. You may begin.\n\nSonya Banerjee -- Head of Investor Relations\n\nThank you. Welcome to the Lyft earnings call for the quarter ended September 30, 2022. Joining me to discuss Lyft's results and key business initiatives are our co-founder and CEO, Logan Green; co-founder and president, John Zimmer; and chief financial officer, Elaine Paul. A recording of this conference call will be available on our investor relations website at investor.lyft.com, shortly after this call has ended.\n\nI'd like to take this opportunity to remind you that during the call, we will be making forward-looking statements. This includes statements relating to the expected impact of the continuing COVID-19 pandemic, macroeconomic factors, the performance of our business, future financial results, and guidance, including the impact of our cost reduction initiative strategy, long-term growth, and overall future prospects. We may also make statements regarding regulatory matters. These statements are subject to known and unknown risks and uncertainties that could cause actual results to differ materially from those projected or implied during this call.\n\nIn particular, those described in our risk factors included in our Form 10-Q for the second quarter of 2022 filed on August 5, 2022, and in our Form 10-Q for the third quarter of 2022 that will be filed by November 9, 2022, as well as risks related to the current uncertainty in the markets and economy. You should not rely on our forward-looking statements as predictions of future events. All forward-looking statements that we make on this call are based on assumptions and beliefs as of the date hereof, and Lyft disclaims any obligation to update any forward-looking statements, except as required by law. Our discussion today will include non-GAAP financial measures.\n\nThese non-GAAP measures should be considered in addition to and not as a substitute for or in isolation from our GAAP results. Information regarding our non-GAAP financial results, including a reconciliation of our historical GAAP to non-GAAP results, may be found in our earnings release, which was furnished with our Form 8-K filed today with the SEC, as well as in our earnings slide deck. These materials may also be found on our investor relations website. I would now like to turn the conference call over to Lyft's co-founder and chief executive officer, Logan Green.\n\nLogan?\n\nLogan Green -- Co-Founder and Chief Executive Officer\n\nThanks, Sonya, and good afternoon. First, I want to thank all of the team members that we had to say goodbye to last week. I'm grateful for all of their contributions toward building the business and advancing the mission. While difficult, the reduction in force sets us up for a strong 2023 where we can focus on execution, knowing we are in a strong position in the face of external uncertainty.\n\nThank you again to the entire team for your continued hard work to take care of drivers, riders, and our business. I'm going to kick things off by recapping our Q3 results. Then I'm going to focus my comments on the actions we've taken to accelerate key business initiatives and deliver on our 2024 financial targets. With a strong Q3, adjusted EBITDA beat the top end of our outlook, revenues of $1.054 billion were the highest in our company's history.\n\nAnd active riders, active drivers, and total rides all reached the highest level since COVID began, which was great to see. Demand was strong. Airport trips were 10.4% of rideshare rides in Q3, beating the record set last quarter. And bike and scooter rides reached a new all-time high, reflecting growing demand and warm weather seasonality.\n\nAdditionally, Lyft business managed bookings grew by more than 50% year over year and reached a new high with strong adoption of our B2B offerings, including Lyft Pass and Concierge. And even more drivers are organically choosing Lyft. In Q3, the number of active drivers using Lyft showed the strongest quarter-over-quarter growth in the year. New drivers grew at an even faster rate, helped by strong organic tailwinds.\n\nIn fact, more than half of new drivers in Q3 were acquired organically. Our network gives drivers valuable access to supplemental earnings opportunities on demand. We expect to see more people looking for these kinds of opportunities in a recessionary environment. Overall service levels on our network keep getting better.\n\nAcross the U.S., our average rideshare ETA was faster in Q3 than it was in Q2 '22 and got even closer to where it was before COVID, and our Q3 rideshare conversion rate was the highest that they've been in several years. Additionally, for riders, the average price per mile declined quarter over quarter, reflecting less prime time. Drivers were also incredibly productive in Q3. Active drivers gave 17% more rides on average than they did in 2019.\n\nAn average U.S. driver earnings this quarter were north of $35 per utilized hour, including tips and bonuses, which is up 7% year over year. Now I'm going to talk about Q4 and the go-forward. In anticipation of continued economic headwinds and rising insurance costs, we've been taking prudent and decisive action.\n\nThis includes taking a hard look at all of our costs to make sure we're using our resources to accelerate initiatives with the strongest returns. All in, the cost reduction initiatives we've been implementing since Q2 are expected to result in roughly $350 million of savings on an annualized basis. This reflects the work that we've done across three categories: headcount, operating expenses, and real estate. First, on headcount.\n\nEarlier this year, we significantly slowed and then froze new hiring. Last week's action reflected a continuation of our commitment to carefully manage our team size and expenses in this environment. One focus was to remove management layers to accelerate decision-making and execution. It was a hard decision, but we're confident that it's the right step for the business.\n\nSecond, operating expenses. Starting in Q2, we reduced various operating expenses, inclusive of professional services and limited discretionary spending, particularly related to marketing. Third, our real estate. Since many team members now enjoy working remotely, we are reducing our office footprint and cutting the related real estate costs by approximately half.\n\nThese actions go hand in hand with the continued prioritization and streamlining of our highest ROI initiatives that will further enable greater operational efficiency and speed. We are also using other levers in our marketplace. Given the uptick in insurance costs, we've increased our service fee to help provide this important coverage. With gas prices moderating, we were also able to remove the fuel surcharge that had been in effect since March so the net impact on riders has been roughly neutral.\n\nAdditionally, we're focused on providing drivers' competitive earnings opportunities and fuel rewards. So, while we expect an $82 million sequential cost of revenue headwind in Q4 due to our insurance renewal, we also expect to more than offset the impact to adjusted EBITDA. Keep in mind, our insurance fiscal year began on October 1, reflecting updated risk transfer agreements that are locked in for 12 months. So, starting in Q1, the quarter-to-quarter changes in insurance costs will reflect the typical differences in ride mix, volumes, and mileage in each period.\n\nThe bottom line is we expect the actions we are taking will more than offset the entire impact of higher insurance costs in Q4 and over the next 12 months. Coming off a strong Q3, we're continuing to take a prudent approach to managing our business to ensure we're successful over the long term. As I said last quarter and would like to reinforce today, we're confident in our ability to continue navigating near-term headwind to deliver strong, long-term business results. Time and time again, we've proven our ability to make hard decisions and overcome difficult challenges.\n\nThis is what we did after we first set our adjusted EBITDA profitability goal back in October of 2019, and we delivered on our target sooner than expected during a global pandemic. The work we've been doing sets us up to accelerate execution and deliver strong business results. We now feel even more confident in our ability to deliver $1 billion of adjusted EBITDA and more than $700 million of free cash flow in 2024. Let me turn the call over to Elaine to share the details on our financials.\n\nElaine Paul -- Chief Financial Officer\n\nThank you, Logan, and good afternoon, everybody. In the third quarter, we delivered all-time high revenues of $1.54 billion, up 6% quarter over quarter and 22% year over year. Q3 revenues came in toward the high end of our outlook of $1.04 billion to $1.06 billion. Revenue growth was driven by ride share strength in addition to bikes and scooters with total rides up more than 10% year over year.\n\nActive riders of 20.3 million reached the highest level in more than two years, reflecting strong new rider growth. Revenue per active rider reached a new all-time high of $51.88, up 4% quarter over quarter and 14% year over year. The increase reflects higher revenue per ride associated with longer trips given the sustained pickup in travel through Q3. Before I move on, I want to note that unless otherwise indicated, all income statement measures are non-GAAP and exclude stock-based compensation and other select items as detailed in our earnings release.\n\nA reconciliation of historical GAAP to non-GAAP results is available on our investor relations website and may be found in our earnings release, which was furnished with our Form 8-K filed today with the SEC. Contribution margin in the third quarter was 56%. This was 100 basis points higher than our guidance of 55% with the outperformance reflecting rideshare strength. Relative to Q2 '22, contribution margin declined by 360 basis points.\n\nNormalizing for $15.5 million in discrete accounting items in Q2, contribution margin decreased sequentially by 200 basis points, reflecting a risk transfer renewal in Q3 that has now been shifted to align with our normal Q4 renewal timeline. As a reminder, contribution excludes changes to the liabilities for insurance required by regulatory agencies attributable to historical periods. In the third quarter, there was adverse development of $93 million. This adverse development is primarily related to claims between October 2018 and September 2021, and is specifically associated with the legacy third-party claims administrator that did not close these claims out as effectively as we would have expected.\n\nThe longer claims take to close, the more expensive they can become, especially when subject to the inflationary pressures that are affecting the broader insurance industry. We are working quickly to resolve the remaining open 10% of claims that were handled by our legacy partner. Let me provide a quick update on the insurance structure that's in place for the next 12 months. Just as we did for the previous insurance fiscal year, we've transferred a significant majority of risk to best-in-class, third-party partners.\n\nSo as of October 1, all of our risk transfer agreements have been locked in. Over time, we believe that our risk transfer strategy will limit our exposure to future adverse. Let's move to non-GAAP operating expenses below cost of revenue in Q3. In the aggregate, these expenses declined as a percentage of revenue by roughly 150 basis points quarter over quarter and 270 basis points versus Q3 of '21.\n\nLet me start with operations and support. As a percentage of revenue, operations and support was 10.6%, up roughly 60 basis points from Q2, but down 140 basis points from Q3 of '21. In absolute terms, this expense was $111.6 million in Q3. The sequential increase is a reflection of bike and scooter seasonality, which typically peaks in Q3.\n\nAt the same time, relative to Q3 of last year, we achieved better leverage on our operations and support expense even as ride volumes grew, and we onboarded more drivers. R&D was 10.2% of revenue in Q3, down roughly 40 basis points from Q2 and 240 basis points from Q3 of '21. In absolute terms, R&D expense was $107.7 million in Q3. Year-over-year comparisons reflect the partial impact of the divestiture of Level 5 that closed mid-July of last year.\n\nRelative to Q2 '22, R&D increased by $2 million, reflecting incremental investment in rideshare-related infrastructure and support. Sales and marketing as a percentage of revenue was 11.3% in Q3, down 170 basis points from Q2 and 20 basis points from Q3 of '21. This is a reflection of organic tailwinds to supply and demand, as well as our continued discretionary cost discipline. In absolute terms, sales and marketing expense was $118.7 million.\n\nWithin sales and marketing, incentives were 3% of revenue. G&A expense as a percentage of revenue was 20.6% in Q3, flat with Q2 and up 130 basis points from Q3 of '21. In absolute terms, G&A expense was $216.9 million. Normalizing for $12 million of discrete accounting items in Q2 '22, G&A increased by roughly $1.2 million quarter over quarter.\n\nIn terms of the bottom line, our Q3 adjusted EBITDA profit of $66 million came in above the high end of our outlook of $55 million to $65 million. Adjusting for $29 million in discrete accounting items in Q2 for every $1 of sequential revenue growth in Q3, roughly $0.26 flowed to adjusted EBITDA. We ended Q3 '22 with unrestricted cash, cash equivalents, and short-term investments of $1.8 billion. And today, we announced we've entered into a revolving credit facility for $420 million that will provide us with additional available liquidity.\n\nNow I'd like to address the difficult but responsible step we took last week to reduce our workforce. As we disclosed in the 8-K filed on November 3, we expect to incur a charge of between $27 million and $32 million related to this restructuring, which we expect will be incurred in Q4. In addition to this amount, we expect to record a stock-based compensation charge and corresponding payroll tax expense related to affected team members, as well as restructuring charges related to a decision to exit and sublease or ceased use of certain facilities. However, we're unable to estimate these charges at this time because they depend in part on our future stock price.\n\nWe will exclude these restructuring charges in our calculation of non-GAAP metrics. Before I move to our outlook, it's important to note that macroeconomic factors are impossible to predict with any certainty. Future conditions contained rapidly and affect our results. Now let me share our Q4 outlook.\n\nWe expect revenues of between $1.145 billion and $1.165 billion, up 9% to 11% quarter over quarter and 18% to 20% versus Q4 of last year. To be clear, even at the low end of the range, our guidance implies a new all-time high for our business. Our Q4 revenue guidance assumes sequential rideshare wide growth consistent with the seasonality we saw in Q4 last year, which is stronger than what we saw in Q4 of 2019. Let me share an update on what we've seen so far in Q4.\n\nFor the month of October, our total company bookings are on track to reach an all-time high. Rideshare rides grew roughly 6% month over month versus September, which is consistent with the seasonality we've seen over the past two years and is stronger than what we saw in 2019. Keep in mind, while October ride trends were robust, it's typically the strongest month in the fourth quarter. November and December rideshare trends are generally dampened with people spending more time at home around the holidays.\n\nWe also expect softening bike and scooter seasonality in the winter. This will impact active riders in Q4 since this metric captures bike and scooter riders in addition to rideshare. In terms of profitability, we expect Q4 contribution margin to be approximately 51.5%. This is a decline of 450 basis points from Q3, reflecting the impact of roughly $82 million or roughly 700 basis points from our insurance renewals.\n\nHowever, we expect this headwind will be partly offset by higher revenue per ride inclusive of the service fee change. As a percentage of revenue, we expect operating expenses below cost of revenue will be roughly 46% to 47%. This would represent a sequential improvement of roughly 600 to 700 basis points with the majority reflected in G&A and operations and support. Within operations and support, there are savings associated with bike and scooter seasonality between Q3 and Q4.\n\nIn terms of adjusted EBITDA, we expect to deliver $80 million to $100 million in Q4, which would be an all-time high for our business. Guidance implies an adjusted EBITDA margin of 7% to 9%. To put a finer point on it, while we expect contribution margin will decline quarter over quarter, we expect adjusted EBITDA margin will increase sequentially by roughly 1 to 2 percentage points. Given our Q4 outlook, we expect calendar year 2022 revenue of $4.65 billion to $4.85 billion, up roughly 27% versus 2021.\n\nWe expect full year 2022 contribution margin of approximately 56%. Finally, we anticipate adjusted EBITDA of $280 million to $300 million for the full year with a margin of 7%. This would be triple the level of adjusted EBITDA achieved last year with more than twice the margin. We are laser-focused on delivering on our 2024 financial targets.\n\nBetween the momentum we are seeing in our business, our product and marketplace work, and our cost management, we are even more confident in our ability to deliver $1 billion of adjusted EBITDA with over $700 million of free cash flow, which is defined as operating cash flow less capex. We continue to see multiple paths to achieving these milestones driven by industry bookings growth, marketplace efficiency work, and cost discipline. With that, let me turn it over to John.\n\nJohn Zimmer -- Co-Founder and President\n\nThanks, Elaine. We're continuing to accelerate the work that will have the biggest impact for drivers, riders, and our company. Let me start with how we are increasing the efficiency of our overall marketplace using three specific examples on maps, drivers, and riders. First, Lyft maps.\n\nApproximately 25% of our rideshare rides are now powered entirely by Lyft's in-house mapping and navigation. And on average, each ride that leverages our mapping technology can produce more than $0.10 of incremental value for Lyft, and there's more ahead. We are leveraging Lyft maps to optimize our routing. This can save drivers and riders time and add to our marketplace efficiency.\n\nThis is helping us solve last-mile problems that rideshare drivers encountered daily. For example, when ride requests lead to closed apartment complexes, we can route drivers to public entry points, solving a pain point that couldn't be addressed with traditional mapping tech. And in markets like Dallas and Atlanta, up to 20% of weekly pickups and drop-offs can occur under these circumstances. So, this routing improvement can have a meaningful impact.\n\nWe've also integrated Lyft maps with Android Auto and CarPlay. This integration is one of the most requested over the past few years and can make driving safer by reducing dashboard clutter and result in a better overall driving experience. Since launching in September, drivers have given nearly 1 million rides leveraging this integration. We're excited to be the first rideshare company to bring this to market and expect it to continue scaling in the months ahead.\n\nNext, we are accelerating initiatives that can increase driver preference. Upfront pay is a great example. In the markets where upfront pay has been available, we've seen drivers spend more time using our network and an uptick in drivers' preference for Lyft. As of last week, upfront information is available on more than 70% of rideshare rides on our network, and we are accelerating the rollout with a goal of covering all rides by the end of the year.\n\nDriver innovations can increase organic driver acquisition and loyalty and greatly improved marketplace balance. Finally, for riders, we are continuing to ensure we provide a full range of price points and ride experiences. Wait & Save is one example on the affordable side of the spectrum that delivers great value to consumers, as well as to our broader marketplace management. This mode gives us more time to balance supply with demand and can increase driver utilization.\n\nIt also serves as a strong acquisition funnel for new riders. In the past six months, nearly 20% of Wait & Save riders were new to Lyft. Priority Pickup is another example, one that provides a premium experience. With Priority Pickup, riders have the option to pay a little more for a faster pickup.\n\nThis can result in a higher margin to Lyft. The work we are doing to improve the rider experience helps us reinforce rider loyalty, increase ride frequency, and have better tools for both revenue management and marketplace management. Finally, Lyft continues to be extremely well-positioned in consumer transportation and is set up to take on more and more consumer spend. There are three big drivers fueling long-term growth: demographics, infrastructure changes, and new products.\n\nLet me start with demographics. As we've shared in the past, every year, roughly 4 million people in the U.S. become old enough to use ridesharing on their own. Younger members of the population have a digital first preference and value the convenience and flexibility of on-demand services.\n\nSecond, infrastructure changes. These happen over a longer time frame and continue to provide important tailwinds. Consider the airport use case. It took time for airports to get comfortable with ridesharing.\n\nAnd now many airports allocate designated curb space and queuing lots, plus rideshare serves as an important source of airport funding. This is just one example of how infrastructure changes over time, help reinforce rideshare in people's lives. And finally, new products. Lyft launched 10 years ago with one rideshare option.\n\nToday, we offer a range of ride modes and price points, including Wait & Save and Priority Pickup. We've also integrated new categories like bikes and consumer rentals that reinforce our core with additional touch points. In fact, this year, more than 2 million people use Lyft for the first time because of our bike and scooter systems. With continued product innovation, we expect to capture a larger portion of consumers' transportation wallets in the months and years ahead.\n\nI'm very grateful to the team and Lyft community and excited bout the road ahead of us. Operator, we're now ready to take questions. \n\nOperator\n\n[Operator instructions] Your first question is from the line of Doug Anmuth with J.P. Morgan. Your line is open.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nThanks for taking the questions. I have two. First, just on insurance costs. I think you said $82 million in 4Q.\n\nCan you just walk through the offsets here on both the top and bottom line? I just want to make sure that we got those clearly. And then also the impact to riders you said is neutral, but I wanted to get a sense of what drivers are saying with the changes in the surcharges. And then perhaps if you could also just roll out the -- talk about the multiple pads to 24% EBITDA and free cash flow, that would be helpful. Thanks.\n\nLogan Green -- Co-Founder and Chief Executive Officer\n\nYeah, we got that. Sure. So, Elaine is going to take about the first one on insurance, and then we'll go to the other two. \n\nElaine Paul -- Chief Financial Officer\n\nSure. On insurance, in Q4, we expect an $82 million increase in cost of revenue versus Q3 that's reflective of our Q4 insurance headwind. And then in terms of the puts and takes, given our guidance, revenue is about $100 million quarter on quarter. That offset -- that more than offsets the $82 million headwind in insurance driving an increase in absolute contribution margin quarter over quarter, then below cost of revenue.\n\nThen below cost of revenue, our opex in total will decline by roughly $20 million in Q4 versus Q3. That's reflective of a partial quarter impact of our reduction in force and other changes we're making to opex. And taken all together, that's what's driving our projections in EBITDA increase from $66 million in Q3 to our guide of $80 million to $100 million in Q4.\n\nJohn Zimmer -- Co-Founder and President\n\nDid that answer your question on insurance prices? I'll talk about the driver side. \n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nYeah, that's helpful. Thank you. \n\nLogan Green -- Co-Founder and Chief Executive Officer\n\nOK. Great. Yeah. So, on the driver side, we're doing a couple of things.\n\nNumber 1 is we're investing in the Lyft Rewards program. So, we increased the cash back on gas reward that comes along with the Lyft debit card that has now bumped up to 7% cash back, which is a pretty meaningful benefit. We additionally have had, for the last year or so, a partnership with a company called Upside that gives all drivers access to additional cash back on gas, and we bumped that up with higher rewards for our gold and platinum drivers. The bottom line is that since we have eliminated the fuel surcharge at the start of the quarter, we have not seen any impact on driver supply.\n\nAnd in October, active driver growth accelerated month over month versus September. Overall, additionally, the driver churn levels are meaningfully below our 2019 levels. So broadly, we feel like we're in a great position with drivers. And then your last question was on the 2024 targets.\n\nIs that right?\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nYes. The multiple pads, exactly.\n\nJohn Zimmer -- Co-Founder and President\n\nYes. So, feeling more and more confident in our ability to hit that $1 billion and adjusted EBITDA was $700 million in free cash flow. And we believe we can achieve this regardless of the macro environment. We've been using internally two main cases.\n\nOne is the growth case, which assumes market bookings grow in the low to mid-20% year over year and that the labor market stays as tight as it currently is. And then internally, what we call a recession case where the market growth slows, and we see operating leverage through lower driver engagement and acquisition costs if unemployment rises. So, in both cases, we have a very confident path to the $1 billion. And in both cases, we'll continue to focus our R&D spend on marketplace innovation that helps improve the cost basis of the business.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. Thank you.\n\nOperator\n\nYour next question is from the line of Stephen Ju with Credit Suisse. Your line is open.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nOK. Thank you. So, I don't want to sit here and dwell too much on the reduction in force. But can you talk about some of the projects that you may have had to sunset or deprioritize from a product development perspective, given the cost containment measures you talked about earlier? And secondarily, revisiting the insurance costs, it seems like Lyft had a bunch of irons in the fire between making greater use of telemetry data and changing driver behavior, etc., which were all supposed to help lower costs longer term.\n\nSo, should we be thinking about potential benefits over the longer term from these initiatives? Or are they basically sidelined for the time being? Thanks.\n\nLogan Green -- Co-Founder and Chief Executive Officer\n\nOK. Great. Yeah. So first, just to talk a bit about the reduction in force.\n\nWe wanted to be equally prepared for any scenario that we encountered in '23, whether it's the growth scenario or the recession scenario. And to try to put kind of the scale of the reduction in force in context, we had started to invest in headcount growth in late 2021 and the first half of 2022 before we slowed and then froze hiring, preparing for a larger kind of faster post-COVID recovery. The reduction in force effectively takes us back to the same team size that we were at in Q3 of last year. And broadly speaking, we always -- I believe having a lean team is always important.\n\nAnd we try to focus these cuts on cuts that would help us increase our velocity. So, one of the areas that we focused on was we're doing -- producing layers of management, increasing span of control, helping the organization operate faster. One of the particular areas that we've been spending a lot of energy on additionally is how we support our drivers. So today, we have both virtual online support through SMS channels and phone support.\n\nPart of the reduction in force was focused on closing the majority of our in-person support centers. And we had seen through testing over the last six months or so that by offering premium driver support through our virtual channels, we're able to produce a great experience for drivers at a lower cost point, and we felt like it was important for us to double down on that and focus on the virtual support experience. Beyond that, we're -- there are a long list of kind of smaller areas where we're -- that are either slightly unprofitable or just lower ROI areas of investment or shifting resources. And the last piece to note is that we are putting the vehicle service business up for sale, running a sale process.\n\nAnd that logic is very similar to the change we made around Lyft Rentals where we're still dedicated to providing the rental and the vehicle service experience. But both those first-party businesses have real kind of significant scale thresholds that need to be achieved for that business to work well. And it wasn't going to be the highest ROI investment for us to make. So, we decided to exit those businesses.\n\nWe will be doubling down on our strength which is building a third party -- a marketplace of third-party partners so that we're still able to provide our drivers and our customers with great vehicle service capability through partners.\n\nJohn Zimmer -- Co-Founder and President\n\nI'll take the insurance question and just starting at a higher level than going into what you asked about product work like telemetry. But at a high level, first, the inflationary pressures and rising current insurance costs that we see are an industry issue and are primarily driven by rising premiums as a result of higher cost of used vehicles, vehicle repair, higher medical costs, and increased litigation costs. You see this across the board in both personal and commercial auto. And so -- we've fully offset, as we said previously on this call, our insurance cost pressures that we had in Q3 and Q4 and are now locked in for the next 12 months.\n\nWe do believe that there's likely a timing difference in our renewals and our competition. We're centered on October and the competition is likely early next year. So, we feel proud of the hard work the team did in Q3 and Q4 to offset that big increase in cost. Now we do believe that the product work we've been working on around mapping and telemetry also, as you noted, has further upside, not just in reducing costs, but more importantly, in reducing the frequency and severity of accidents that lead to additional cost.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nYour next question is from the line of Mark Mahaney with Evercore ISI. Your line is open.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nYou talked about sort of these two headwinds or issues going into the December quarter insurance cost and macro. That the October trends that you talked about sounded reasonably healthy. So, are there -- and I certainly understand that we're all concerned about macro showing up. But is there anything you've actually seen in your -- in either the rider volume, length of trips, I don't know, frequency of usage, something in there that has you somewhat concerned about the fourth quarter since you called out macro, but I don't hear it in the October numbers? And then just talk about shared rides.\n\nI know that's been kind of a late cycle recovery for ridesharing as a whole and for Lyft, and I know it's important to your business. Can you just talk about where that is in terms of recovering back to kind of full 2019 levels? I know it's going to take a while, but just where are we in the path? Thank you.\n\nLogan Green -- Co-Founder and Chief Executive Officer\n\nYeah, absolutely. No, we are not seeing any concerning trends, sort of macro trends in terms of growth in Q4. We are trying to -- reading all the same things, I'm sure you are, we know that we can't sort of predict exactly how '23 is going to shape up, and we want to put ourselves in a position of maximum flexibility so that we can handle at any scenario and have the flexibility and agility to lean into that. But no, we are seeing strength in the business in Q4.\n\nJohn Zimmer -- Co-Founder and President\n\nAnd then on shared rides, still a small percentage of total rideshare volume, but starting to look at the right markets to bring it back to -- or additional markets like New York City, we just relaunched shared rides in New York City. This is a market where shared works really well because it's very dense. The other perspective I'd give is that we're starting to see our affordable ride options as more of a portfolio. And so, when we first had shared rides, we didn't have Wait & Save.\n\nWait & Save has become very popular among our riders as an option to wait an extra five to 10 minutes and save a few dollars. And again, that has become very popular.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nThank you very much.\n\nLogan Green -- Co-Founder and Chief Executive Officer\n\nThanks. Next.\n\nOperator\n\nYour next question is from the line of Brent Thill with Jefferies. Your line is open.\n\nJohn Byun -- Jefferies -- Analyst\n\nThank you very much. This is John Byun for Brent Thill. Two questions. I guess if you could maybe give some color on how the use cases are trending.\n\nYou gave the airport case, but wondering how the other use cases are trending in terms of community nights, as well as business. And then I don't know if you have any sense in terms of market share change, maybe, especially on the West Coast, as well as ride price trends on average? Thank you.\n\nJohn Zimmer -- Co-Founder and President\n\nSo, can you repeat the second part of your question?\n\nJohn Byun -- Jefferies -- Analyst\n\nYeah. I wanted to see if you have any sense for the market share, any total changes versus your main competitor? And maybe even related to that in terms of how the West Coast is recovering? \n\nJohn Zimmer -- Co-Founder and President\n\nYeah. So, on use cases, as we mentioned, airport rides being -- they're all-time high, about 10.4% of rides. Commute, we seem pretty static, I think, around the 30% mark. And then I think there's still more upside and opportunity and where we're seeing some of the growth in the kind of more nights and weekends use cases people come -- continue to come back out.\n\nThat's on the use case. On the West Coast, still more runway ahead. It is improving. Q3 rideshare volumes in our top U.S.\n\nmarkets were 75% recovered versus Q4 '19. And within that, the top 10 West Coast markets, we're just 65% recovered. So, feeling good that we have more room on the West Coast where we've historically over-indexed. Logan, do you want to talk about market share?\n\nLogan Green -- Co-Founder and Chief Executive Officer\n\nYeah. So broadly on market share, third-party data that we track shows a 1% drop in market share quarter to quarter. Based on our internal assessment, it was primarily driven by additional driver incentives that the competition temporarily put into market, along with their rollout of upfront pay. So, those incentives no longer appear to be in the market.\n\nAnd over the last couple of weeks since those incentives have dried up, we've seen market share increase in a meaningful way. So, we think there's always opportunities to take share, but we are focused on durable growth and driving the bottom line.\n\nJohn Byun -- Jefferies -- Analyst\n\nThanks so much.\n\nLogan Green -- Co-Founder and Chief Executive Officer\n\nThanks.\n\nOperator\n\nYour next question is from the line of Steven Fox with Fox Advisors. Your line is open.\n\nSteven Fox -- Fox Advisors -- Analyst\n\nHi, good afternoon. I was just curious, you went through a detail on some of the marketplace improvements you're making right now. How do we think about those factoring into getting to $1 billion? And how does it maybe help the contribution margins or the conversion margins over the longer term? Thanks.\n\nJohn Zimmer -- Co-Founder and President\n\nSo, on the high-level marketplace work, something we've talked about in the past and has continued to be a big focus for the R&D dollars we're spending is the use of the driver engagement spend. So, for example, you could put -- one important thing to note is people often don't think about the fact that there is a variable pay component to what a driver makes, as well as kind of the base. There's always going to be variable pay, but you could either time it a week in advance or a day in advance or just in time. And our machine learning that we're doing is getting more and more accurate and that the tools and incentives that we have to break up things like nights and weekends at the time when there is the most demand are getting more targeted.\n\nAnd so, there's quite a bit of efficiency in driving the supply when you need it versus paying for it when it's less needed. I'd say that's like the biggest opportunity on the marketplace side to improve the bottom line.\n\nSteven Fox -- Fox Advisors -- Analyst\n\nBut do you think there's sort of an efficiency curve we should think about as you go to $1 billion of EBITDA? Or is it mainly opex and top line driven? Thanks.\n\nJohn Zimmer -- Co-Founder and President\n\nWhat do you mean on that? What specific cost curve are you speaking about?\n\nSteven Fox -- Fox Advisors -- Analyst\n\nJust in general, for marketplace. So, you're getting some significant improvements. It sounds like now -- it sounds like there's opportunities to do that further. But how much of a contribution is that to the $1 billion you're targeting for 2024?\n\nJohn Zimmer -- Co-Founder and President\n\nIt's a meaningful part of that. There's still quite a bit of room left in the last two quarters with the goal of swallowing this insurance increase, we did make some material progress. But there is, I would say, tens to hundreds of millions of dollars of marketplace efficiency over the next couple of years.\n\nSteven Fox -- Fox Advisors -- Analyst\n\nGreat. It's helpful color. Thank you.\n\nYeah.\n\nOperator\n\nYour next question is from the line of Deepak Mathivanan with Wolfe Research. Your line is open.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nHey, guys. Thanks for taking the questions. Just a couple of ones. So first, if I look at the fourth quarter guide, it's about $100 million or so quarter-to-quarter increase.\n\nIt sounds like a sizable portion on that is coming from the incremental service fees. I know the seasonality is a little bit different for rides and scooters. And you said that macro is not as much of an impact right now. But what's factored in, in terms of sort of organic rate growth maybe quarter to quarter? Maybe you can provide a little bit of color on that, that would be great.\n\nAnd then on the long-term guide or 2024 expectations for $1 billion, with the additional cost savings, it seems like you certainly have a lot more levers and conviction to reach those levels. But what do you need to see to kind of raise those to a higher levels right now? Thank you so much.\n\nJohn Zimmer -- Co-Founder and President\n\nSure, Elaine will take the question you had -- the first question you had.\n\nElaine Paul -- Chief Financial Officer\n\nYes. So, in terms of our Q4 revenue outlook, it implies 9% to 11% quarter-on-quarter growth and 18% to 20% year-on-year growth. And just to reiterate, that Q4 revenue range would be a new company high. It reflects the service fee and growth in rideshare rides.\n\nAnd as you noted, that is partly offset by the seasonality we see in bike and scooter revenue. And just to reiterate, the service fee is less than $0.50 a ride. With respect to the rides' growth, we are assuming rideshare rides grow quarter on quarter in Q4 in line with the same sort of rides growth we saw quarter on quarter last year in 2021. So, it's the combination of those two things.\n\nService fee plus the rides growth, partially offset by the seasonality in bikes and scooters that are driving the incremental roughly $100 million increase quarter on quarter. \n\nJohn Zimmer -- Co-Founder and President\n\nAnd then on 2024, the -- again, as we've noted a few times on this call, we have increasing confidence in our ability to hit $1 billion adjusted EBITDA target. I'd say that the two -- kind of material differences between the two cases we're tracking are: one, the rate of growth on the demand side or any recessionary pressure, which on the driver engagement side is lowers the cost of driver engagement and acquisition. So those are the biggest movers and in either direction would drive even further confidence.\n\nSteven Fox -- Fox Advisors -- Analyst\n\nGot it. Thank you so much.\n\nJohn Zimmer -- Co-Founder and President\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Eric Sheridan with Goldman Sachs. Your line is open.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks so much for taking the questions. Maybe one to double back and one more on the financials. In terms of driving continued adoption of new riders, maybe just give us a little bit of sense of what you see as the biggest unlock factors there? Is it lower-priced rides? Is it more flexibility? Is it the product continuing to evolve? Because I think the biggest question we get from investors a lot is just elements of continuing to deepen out, widen the rider base in the next couple of years as an element of growth, even if that results at more moderate price per unit type ride. So just better understanding that, I think would be helpful.\n\nAnd then looking at the financials, any color you could give us on some of the trends around stock-based comp not just for you guys, but generally across the industry, we continue to see sort of upward pressure there. How much is that driven by elements of hiring or retention or elements of where the stock price is or things that are more backward looking than forward looking. Some color on how to think about that would be super helpful. Thanks so much.\n\nLogan Green -- Co-Founder and Chief Executive Officer\n\nYeah. So first, in terms of really kind of the TAM growth and the opportunity, one of the largest areas of opportunity that we see beyond the demographic trends is increasing reliability and affordability. So first on reliability, the moments where the ETA is too high or there's simply not a driver available, that is sort of a latent demand in the system today that we are just not capturing and we should be. There are many times where we can match -- there is a driver out there somewhere, who would be willing to do that ride at the right price, and there's a rider out there willing to pay that price.\n\nAnd we are simply not matching those two and we can be. So, increasing that reliability so that you can always get a ride and you can count on it in any situation, any geography, etc. I think, is probably the largest opportunity. Secondarily, as John was talking about earlier, our portfolio of lower-cost options from Wait & Save to shared rides, I think we found to be very powerful.\n\nAnd the ridesharing sort of market is known to have significant dynamic pricing where supply tightens up, the prices go up, to maintain service levels, but being able to maintain a low-cost option and flexing service levels so that low-cost option may mean you're sharing the ride or it may mean you're waiting a little longer for the pickup. But always having those options at that price point and having that flex coherently as a portfolio, I think there's still a lot of room in terms of how we kind of price and organize the portfolio together to create optimal kind of experience for our customers. So, those are broadly the kind of big product-focused levers that we're focused on in addition to the sort of demographic shifts over time.\n\nElaine Paul -- Chief Financial Officer\n\nThen in terms of your question regarding stock-based comp, a couple of things that will help reduce stock-based comp going forward. Obviously, the risk has an impact on reducing stock-based comp. In addition, we have stopped U.S. new hiring in the United States.\n\nAnd with respect to backfills going forward, we're shifting the nexus of our hiring away from largely U.S. to focus on international markets, where there's a different compensation model with low or no equity in markets like Canada and Eastern Europe. So, we're proactively taking these moves to reduce the impact on our comp and ben expense, as well as the impact of stock-based comp and effective dilution.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks so much.\n\nLogan Green -- Co-Founder and Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question is from the line of Benjamin Black with Deutsche Bank. Your line is open.\n\nBenjamin Black -- Deutsche Bank -- Analyst\n\nGreat. Thanks for the questions. Curious, how should we be thinking about driver incentive levels? You mentioned it earlier. I think last quarter, you spoke about incentives spend per trip being down sequentially sort of between the second and the third quarter.\n\nHow should we be thinking about trending into the fourth? And then it would be great if you could sort of give us your perspective on the new DOL proposal for employee classification. Where do you sort of see driver classification the debate sort of ending up? Is there a path sort of for the ICs model to be more widely adopted across the country? Thank you.\n\nElaine Paul -- Chief Financial Officer\n\nYes. With respect to your first question on driver incentives, one thing that's really important to remind everyone and to point out is that driver incentives and the extent to which they fluctuate quarter to quarter is largely driven by prime time, and in the imbalance that we see in the marketplace. So, we do project going from Q3 to Q4 and embedded in the guidance that we're giving, we're projecting driver incentives to go up quarter on quarter in aggregate and on a per ride basis, but for it to be entirely funded by prime time. And that increase in prime time is largely driven by things that we're seeing on the demand side and increased demand in peak periods, which we see as a good healthy sign.\n\nJohn Zimmer -- Co-Founder and President\n\nOn the pro-regulation, you asked about the Department of Labor. They released a proposed rule with 60 days of public comment. This was not at all a surprise. In fact, it was expected on day 1 of the administration.\n\nThere's no immediate or direct impact to the Lyft business. And important to note, this rule does not reclassify Lyft drivers as employees. It does not force Lyft to change our business model. And it's a very similar approach to that the Obama administration took to use -- to determine employee status, and as previously applied to Lyft and other app-based companies and did not result in a reclassification of drivers.\n\nApp-based work, as hopefully, most people on the call know, is quite fundamentally different than traditional 9:00-5:00 work. And we will continue to advocate for laws that drivers consistently show they prefer that includes flexibility plus benefits like the one that recently was enacted in Washington state, which gave driver what they wanted. That independence was benefit. So, to your broader point, I do think there will be more opportunities for that type of law of independence plus benefits and no major change from the federal policy.\n\nBenjamin Black -- Deutsche Bank -- Analyst\n\nOK. Thank you very much.\n\nJohn Zimmer -- Co-Founder and President\n\nThanks.\n\nOperator\n\nYour next question is from the line of Brian Nowak with Morgan Stanley. Your line is open.\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nGreat. Thanks for taking my questions. Maybe to -- just the first one on the active riders. I know there's a lot going on with the recovery and sort of getting back to pre-COVID levels.\n\nBut just as you sort of think about the growth of riders, the port to kind of bring new people into the population. Can you just help us better understand percentage of your riders right now are new credit cards and new people that weren't on the Lyft platform, say, pre-COVID swing an idea of new people coming to the platform? And then the second one, I think insurance has been somewhat surprising to people this year a little bit. As you think about the path toward $1 billion of EBITDA, what are your assumptions on insurance costs between now and 2024? Thanks.\n\nJohn Zimmer -- Co-Founder and President\n\nYou say that last thing you called off on the insurance cost piece?\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nYeah. Sorry. Just trying to get an understanding for your assumptions on insurance costs between now and 2024 and the EBITDA guide.\n\nJohn Zimmer -- Co-Founder and President\n\nYeah. Got it. Got it.\n\nLogan Green -- Co-Founder and Chief Executive Officer\n\nYeah. So, on the first point, in Q3, we had the most active riders and ride volume since COVID started. Quarter over quarter, it was 2% active rider growth, which was in line with the broader industry. And if you look back and sort of look at absolute numbers, it's in line with the quarter-over-quarter growth we saw back pre-pandemic, if you look at Q3 2019.\n\nAnd broadly, as we talked about before, we continue to see service levels improve. So, we see better retro ETAs. We see less prime time declining over – quarter over quarter. And our conversion rate in Q3 '22 was the highest it's been in recent years.\n\nSo, we feel great about that. We continue to market to and bring in new riders all of the time. We're -- in terms of new rider growth in Q3, new riders grew by nearly 10% quarter over quarter. So, it's something that we continue to invest in and lean into.\n\nJohn Zimmer -- Co-Founder and President\n\nAnd then you asked about the 2024 case and what's assumed on the insurance. So, the case of getting -- we're confident of getting to the $1 billion, and we have baked in any assumed changes in insurance on our annual October renewal. And we think going forward, we have much better line of sight into those insurance rates. So again, I want to reiterate, we feel quite confident in our path to $1 billion in 2024, and that does bake in the renewal for insurance next October.\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nThanks.\n\nJohn Zimmer -- Co-Founder and President\n\nThank you.\n\nOperator\n\nYour next question is from John Blackledge with Cowen. Your line is open.\n\nJohn Blackledge -- Cowen and Company -- Analyst\n\nGreat. Thanks. Two questions. First, what markets drove the strength in the third quarter and into October? And then what markets were lagging.\n\nIt sounds like West Coast still lagging a bit. And then second, on Lyft Pink, any update on the subscription program, and what percentage of bookings are from Lyft Pink subs? Thank you.\n\nJohn Zimmer -- Co-Founder and President\n\nSure. So just a quick response on the markets, quite similar to what we've seen in the past, continue to see kind of strength on the East Coast compared to pre-pandemic markets like New York and Miami continue to be extremely strong, whereas those SF, LA, West Coast markets are just lagging behind. But over the last two quarters, we have seen them start to pick up. So, no difference in that trend, which we talked about last quarter.\n\nLogan, do you want to talk about Pink?\n\nLogan Green -- Co-Founder and Chief Executive Officer\n\nYeah. So back in April, we relaunched Pink at a new price point. It's now priced at $9.99 a month and a brand-new headline benefit, which is unlimited priority pickups. So, priority pickup typically costs $4 to $5 over the standard price of ride, and it gets you a faster pickup.\n\nYou sort of cut the line ahead of everybody else. And our members were seeing great product market fit. Our members are seeing, on average, over $29 of benefit per month. So, it's like roughly a 3x return for them, and we're layering in other benefits.\n\nSo, we're doing savings on sort of luxury and preferred rides, waiving fees on cancellations, and a really unique benefit is our roadside assistance that we think is a lot better than AAA. You open up the app, click a button and you have a tow truck showing up, the same kind of classic Lyft experience. Additionally, we have the All Access Pink, which is $199 a month. This is where we've been or our bike share membership programs.\n\nSo, this is an incredible deal weaving in sort of first of its kind national bike share membership. We see pink members taking 3x the number of rides compared to nonmembers. So, it is showing a lot of impact. And while we're not disclosing number of subs, we are starting to see some real growth in the program, and we are very excited about it.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSonya Banerjee -- Head of Investor Relations\n\nLogan Green -- Co-Founder and Chief Executive Officer\n\nElaine Paul -- Chief Financial Officer\n\nJohn Zimmer -- Co-Founder and President\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nStephen Ju -- Credit Suisse -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nJohn Byun -- Jefferies -- Analyst\n\nSteven Fox -- Fox Advisors -- Analyst\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nBenjamin Black -- Deutsche Bank -- Analyst\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nJohn Blackledge -- Cowen and Company -- Analyst\n\nMore LYFT analysis\n\nAll earnings call transcripts"
}