{
  "companyName": "BioNTech SE",
  "companyTicker": "BNTX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/07/biontech-se-bntx-q3-2022-earnings-call-transcript/",
  "content": "BioNTech SE (BNTX -1.89%)\nQ3 2022 Earnings Call\nNov 07, 2022, 8:00 a.m. ET\n\nOperator\n\nWelcome to the BioNTech third quarter 2022 update call. I would like to hand the call over to the vice president of investor relations and strategy, Sylke Maas. Please go ahead, Sylke.\n\nSylke Maas -- Vice President, Investor Relations\n\nThank you all for joining us today as we review our third quarter operational highlights and provide you with a financial update. BioNTech is in an exciting phase of its corporate development, and we are delighted to share our progress with you. A few housekeeping items before we start. I invite you to view the slides that accompany the webcast and the third quarter 2022 press release, both of which were issued this morning and can be found in the investor section of our website.\n\nTaking a first look at Slide 2, I would like to remind you that during today's presentation, we will make several forward-looking statements. These forward-looking statements include but are not limited to our COVID-19 vaccine revenues as these include figures that are derived from preliminary estimates provided by our partners; our estimated financial results for 2022; the continued global demand for our COVID-19 vaccine; expected COVID-19 vaccine production, supply, and deliveries for 2022 and beyond; the planned next steps in our pipeline programs; the timing for enrollment, initiation, completion, and reporting of data from our clinical trials; the timing of and our ability to obtain and maintain regulatory approval for our product candidates; and other risks described in our filings made with the U.S. Securities and Exchange Commission, including our most recent quarterly report filed today. Actual results could differ from those we currently anticipate.\n\nYou are, therefore, cautioned not to place undue reliance on any forward-looking statements, which speak only as of today, share today during the conference call and webcast. Also, please note that Slides 3 and 4 provide detailed and important safety information regarding our COVID-19 vaccine. Finally, today's agenda can be found on Slide 5. It is my pleasure to welcome the BioNTech management team, who will guide you through our third quarter update.\n\nI'm joined by Uğur Şahin, CEO and co-founder of BioNTech; Ozlem Tureci, our chief medical officer and co-founder; Jens Holstein, our chief financial officer; and Ryan Richardson, our chief strategy officer. With that, I would like to turn the call over to Ugur.\n\nUğur Şahin -- Chief Executive Officer\n\nThank you, Sylke. A warm welcome to all participants of today's conference call. I am pleased to update you on BioNTech's operational progress during the third quarter of 2022. Before I start, let me tell you the fundamentals of our success.\n\nWith our deep expertise in immuno-oncology, our scientifically graph of a fully integrated spectrum of translational research and manufacturing competencies, we succeeded, together with our partner, Pfizer, in developing and supplying variant-adapted vaccines globally. We did so at an unprecedented speed. Since BioNTech inception, we have pursued our vision to establish a fully integrated global immunotherapy powerhouse, aspiring to translate science into survival. We follow a technology-agnostic solution-focused multiplatform strategy.\n\nOur innovation engine leverages various emerging technologies and therapeutic approaches. Our aim is to address high unmet medical needs in oncology, infectious diseases, and beyond. We are advancing a diversified product pipeline of immunotherapies and are facing an unprecedented opportunity to accelerate our progress toward our long-term vision to bring the next generation of immunotherapies to patients. Moving to our third quarter highlights.\n\nWe reported total revenues of 3.5 billion euros, contributing to total revenues of 13 billion euros for the first nine months of the year. The strong performance can be attributed to the continued successful execution of our COVID-19 vaccine franchise and reflects shipments of the omicron-adapted vaccine booster, which started early in September. We are updating our 2022 financial guidance by raising our vaccine revenues estimate to 16 billion to 17 billion euros. We have expanded our team to more than 4,000 employees around the world.\n\nWe are expanding our global mRNA manufacturing network to ensure access to our innovative medicines worldwide. We recently signed a letter of intent with Australia's state of Victoria for strategic partnership to establish an mRNA research and innovation center and help to translate encouraging academic research into the clinic. We will establish one of our modular BioNTainer manufacturing facilities in Melbourne to enable end-to-end clinical scale manufacturing of mRNA product candidates. In oncology, we are executing across our both pipelines.\n\nWe have advanced a total of 19 candidates in 24 ongoing clinical trials, including five phase 2 trials. In the third quarter, three new programs entered phase 1. At this year's ESMO conference in September, we presented another positive clinical update for BNT211 for the treatment of solid tumors. Ozlem will share more detail on the data update momentarily.\n\nSlide 7 highlights our Quarter 3 progresses, our commitment, and franchise. This quarter, we and our partner, Pfizer, continued to build on our global COVID-19 vaccine leadership. The first-to-market omicron BA.4/BA.5-adapted vaccine launches across multiple countries and regions worldwide. As I've mid of October 2022, we have invoiced approximately 300 million doses of our BA.1 or BA.4/5-adapted bivalent vaccines.\n\nWe have multiple regulatory developments around our original Comirnaty vaccine. The vaccine is undergoing conversion to full market approval in several regions around the globe. It has received full marketing authorization in the EU for all existing and upcoming indications and formulations. Additionally, we received EC approval for three-dose primary series in children aged six months to five years in the EU and for our third booster dose for children aged five to 11 years.\n\nA fourth booster dose was recently approved by the EC for individuals aged 12 and older. With these regulatory approvals, our COVID-19 vaccine is one of the broadest labels among available vaccines. Our omicron BA.4/5 bivalent vaccine boosters now have approvals for use in more than 45 countries and regions worldwide. We recently reported initial positive data at the 30-day post-boost timepoint in the phase 2 clinical trial of our omicron BA.4/5-adapted bivalent vaccine in individuals 12 years and older.\n\nAdditionally, we initiated a phase 1,2,3 trial of the omicron BA.4/5-adapted bivalent vaccine in children aged six months to 11 years. At the end of October, as part of our ongoing collaboration, we and our partner, Pfizer, initiated a phase 1 clinical trial evaluating our omicron BA.4/5-adapted bivalent vaccine in combination with an mRNA influenza vaccine. The mRNA influenza vaccine candidate is also partnered with Pfizer and has now advanced to phase 3 clinical testing after positive data from the phase 2 trial we have reported in the second quarter of this year. Slide 8 highlights our COVID-19 vaccine execution on a global scale.\n\nOur mRNA platform and established processes allow for development, testing, and manufacturing of variant-adapted vaccine as an unprecedented speed, supporting a rapid regulatory path. With the occurrence of omicron end of 2021, we and Pfizer started evaluating monovalent and bivalent vaccines directed against omicron sublineages and other strains of SARS-CoV-2. Data from this study were presented to regulatory agencies in June and July 2022. We supported regulators' definition of the most appropriate regulatory pathways.\n\nIt took us approximately two months to go from the first regulatory recommendation for BA.4/5-adapted vaccine for our first shipments of the respective vaccine. The ability to execute with such a speed was enabled by three sectors: our continued surveillance and analysis of variants of concern, our extensive and proactive COVID-19 clinical program, and the rapid manufacturing adaptation. We are well-positioned to supply countries and regions around the globe. I thank our team and collaborators for their tireless efforts to make this accomplishment possible again in such a short period of time.\n\nSlide 9. The need for an omicron BA.4/5-adapted booster is supported by current research, including our own data as shown on Slide 9. In the Northern Hemisphere, we tend to see case numbers steadily rising. Epidemiologically speaking, BA.4/5 and the related sublineages continue to be the dominant strain.\n\nOmicron BA.4/5-adapted bivalent vaccines may also confer robust protection against potential future emerging omicron sublineages or new variants of concern that are closer to the wild-type strain. The enhanced neutralization breadth be driven by expansion of memory B cells against epitopes shared broadly among variants, as well as, in part, induction of de novo immune responses against new epitopes. Moreover, expansion and preservation of T-cell responses may protect against severe disease. Slide 10.\n\nLooking at the evolution of COVID-19 pandemic and currently overt evidence, we anticipate a long-term need for annual or seasonal variant-adapted booster. If the virus is in a state of continuous evolution, the possibility of a new wave of infections driven by novel immune-evasive strains remains. We are vigilantly monitoring the landscape and are prepared to adapt our vaccines as needed. The risk of severe COVID-19 disease remains high in the vulnerable population.\n\nThe full extent of the prevalence of COVID-19 patients who will go on to experience longer-term health consequences is also not yet fully understood. Clinical data have demonstrated that boosters extend the protection of a COVID-19 vaccine, which research has shown, natural immunity acquired by SARS-CoV-2 infection is variable across individuals and the protection it offers wanes over time. The booster restores and enhances infection-acquired immune protection and further reduces the risk of reinfection. Slide 11 shows our framework to support a sustainable vaccine business in the future.\n\nFirst, we have demonstrated the safety, tolerability, and efficacy of our mRNA COVID-19 vaccines. Second, we have shown our ability to rapidly adapt our products and processes to address emerging variants of concern. Third, our expertise in navigating the evolving regulatory landscape on a global scale has positioned us as the first mover and enabled us to receive one of the broadest labels among currently available COVID-19 vaccines. This applies to both the original Comirnaty vaccine and our omicron BA.4/5-adapted vaccine.\n\nFourth, this continued innovation by improving the already strong product profile of our COVID-19 vaccine, targeting continuous protection from current and future virus threats. These four pillars are built on our validated mRNA platform of proven science, discovery, development, manufacturing, and commercialization and position us for success as we continue to expand and advance our pipeline and build our 21st-century immunotherapy powerhouse. With that, I would like to thank you all for your confidence in our success and your continued support and turn the call over to Ozlem.\n\nOzlem Tureci -- Chief Medical Officer\n\nThank you, Ugur. I'm delighted to provide you with our COVID-19 vaccine pipeline update to date. On Slide 13, we have our multipronged innovation strategy to respond to the evolving pandemic and improve upon our vaccines with next-generation approaches that generate broader and more durable immunity. We have successfully delivered the first variant-adapted vaccines to address omicron BA.1 and BA.4/5 variants.\n\nWe believe that our vaccine has potential to be combined with a seasonal flu vaccine. Across many parts of the world, people are currently receiving the omicron-adapted vaccine booster at the same time as vaccine shots. Health agencies, including the U.S. CDC, now recommend co-administration of COVID-19 booster with the annual influenza vaccine.\n\nThe combination product has the potential to provide seasonal protection from both viruses with a single shot. We are working together with our partner, Pfizer, to develop an influenza-combination vaccine, which leverages our mRNA technology. In the mid-term, we are also developing next-generation engineered vaccine candidates to expand the breadth of immune response and provide more durable protection. This includes our T-cell enhancing vaccine candidate and engineered spike vaccine approaches.\n\nOur approach is supported by insights from continuous surveillance of variants and our robust clinical program. On Slide 14, our innovation strategy has already yielded success with our omicron BA.4/BA.5-adapted bivalent vaccines, approved for use in more than 45 countries and regions around the world. Through the rapid execution that Ugur highlighted, we are continuing to broaden the label of our omicron BA.4/5-adapted bivalent vaccines across different age groups. This includes FDA emergency use authorization for individuals aged five and older in the U.S.\n\nIn the EU, we received EC marketing authorization for individuals aged 12 and older. Submissions for ages five to 11 years in the EU has been completed, and we are awaiting CHMP's recommendation. As a next step, we plan to submit data to regulatory agencies from our ongoing trial in aged six months to four years in the first quarter of 2023 to expand access to omicron-adapted bivalent vaccine to young children. Our regulatory activities are supported by our ongoing clinical program, evaluating the BA.4/5-adapted boosters in various age groups.\n\nSlide 15 highlights the positive data in the ages 18 and older cohort reported from the ongoing phase 2/3 trial of our BA.4/5-adapted booster in individuals 12 years and up. The study was initiated in August and enrolled approximately 900 healthy volunteers aged 12 and older, all of whom had already received at least three doses of an approved COVID-19 vaccine. They received either 30 or 60 micrograms of our BA.4/5-adapted bivalent booster, our original vaccine as a comparator. Adolescents aged 12 to 17 received a 30 microgram dose of our omicron-adapted vaccine, our original vaccine.\n\nThe data at the 30-day timepoint is from the Sentinel cohort, which included 40 people in each age group 18 to 55 years of age and older than 55 years, each having received the 30 microgram dose of the bivalent vaccine. The comparator group included 40 individuals over 55 years of age who received the original vaccine. The data showed that the safety and tolerability profile of the bivalent booster remains favorable and similar to the original vaccine. On Slide 16, you can see the types of neutralizing antibodies broken down by age group and by pre-vaccination status.\n\nWhile the 18 to 55-year-old had -- had a 9.5-fold increase over baseline, for the group as a whole, the increase was notably higher, namely 16-fold for those who were baseline negatives. In the individuals who were older than 55 years, the group, as a whole, experienced a 13.2-fold increase in neutralization titers, whereas for individuals who were negative at baseline, experienced a 28.3-fold increase. These responders were higher than that -- than those observed in the comparator group receiving the origin vaccine, who saw only a 2.9-fold increase over baseline. There was not much difference between the groups who were negative or positive at baseline in the comparator arm.\n\nThe reference strain neutralization titers were at least as high as that observed in those who received the original vaccine. Overall, adults saw a substantial increase in response with the bivalent vaccine compared to the original vaccine, and the improvements were most pronounced in those over age 55 and those who were baseline negative prior to vaccination. Given that omicron BA.4/BA.5 and their sublineages continued to be the dominant circulating strains, these data provide strong evidence of the protection that boosting with the bivalent vaccine can provide to adults, particularly the elderly. Slide 17.\n\nThe second pillar of our innovation strategy includes our collaboration with Pfizer to develop a COVID-19-influenza combination vaccine based on BioNTech's validated mRNA technology. A phase 1 clinical trial has been initiated to evaluate the safety, tolerability, and immunogenicity of an mRNA quadrivalent influenza vaccine candidate in combination with our omicron BA.4/BA.5-adapted bivalent vaccine. We are building on the experience made in the BNT161 program partnered with Pfizer developing an influenza mRNA monovalent vaccine for which a phase 3 trial was initiated by Pfizer in September. In the combination trial, the quadrivalent influenza vaccine candidate contained two Type A strains and two Type B strains that have been selected for the current season's traditional flu vaccine.\n\nOne hundred and 80 people aged 18 to 64 will be enrolled across six trial arms to test various combinations of the influenza vaccine candidate and the omicron-adapted vaccine at 30 and 60 microgram doses. The influenza vaccine candidates individually and the standard licensed influenza vaccine as the comparator. Slide 18 details our two development tracks to create next-generation vaccine. One track our engineered spike protein vaccine candidates designed to elicit growth-neutralizing antibody protection against a vast array of variants, including those which have not yet evolved.\n\nThe other track of the vaccine candidate is designed to enhance the T-cell response against SARS-CoV-2. Our first candidate for this program, BNT162b4, targets multiple highly conserved nonspike proteins that have been selected based on their potential to engage with T-cells arms the immune system. This approach has the potential to increase immune resilience, enhance and broaden T-cell response, and to provide memory T-cell persistence and durability of B-cell response. The clinical trial start in combination with our omicron BA.4/BA.5-adapted bivalent vaccine is expected in the coming weeks.\n\nSlide 19 highlights our infectious disease pipeline. In addition to the previously mentioned COVID-19 vaccine trial initiation from the first quarter, we expect the start of multiple first-in-human trials of our mRNA vaccine candidates over the coming months. This includes our shingles and HSV 2 vaccine candidates, which are expected to enter the clinic in the final part of this year.; our malaria vaccine candidate trial either in the fourth quarter of 2022 or early '23, and our tubercolosis vaccine candidate expected to dose the first patient in early 2023. These programs are based on our validated data platform of nucleoside-modified mRNA LNPs with optimized backbone design to address diseases with a significant growth in [Inaudible].\n\nMoving to our oncology program update. Slide 20 provides an overview of our oncology pipeline that is grounded in our multimodality toolbox and advanced for focused execution. We now have a total of 19 oncology product candidates across four different drug classes and 24 ongoing clinical trials, five of which are randomized phase 2 trials. Our programs address areas of high unmet need and have the potential to tackle tumors using complementary strategies by targeting tumor cells directly or by modulating the immune response against the tumor.\n\nMany of our product candidates have the potential to be combined with other -- with other pipelines. In the third quarter of 2022, three preclinical programs advanced to phase one clinical testing. This includes our FixVac candidate, BNT116, for second-line treatment of nonsmall cell lung cancer; and our bispecific RiboMabs product candidate, BNT142, for solid tumors. In collaboration with Genmab, we recently initiated a phase one study evaluating BNT313, our anti-CD27 HexaBody product candidate in solid tumor.\n\nAt the ESMO Immuno-Oncology Congress in December 2022, we expect to have two presentations. One is about preliminary safety data from the safety run, in part, of the study that precedes randomization in the ongoing phase 2 trial of our FixVac program, BNT113. This trial is evaluating BNT113 in combination with [Inaudible] in patients with HPV16 positive, PD-L1 positive head and neck squamous cell carcinoma. The other is preliminary efficacy and safety data from another Genmab collaboration, the phase one trial of BNT312, a CD40 4-1BB tumor body in advanced solid tumor.\n\nFinally, we have BNT211, our next-generation CAR-T cell therapy product candidate designed to overcome first-generation CAR-T cells European indication in patients with solid tumors. We recently presented follow-on data for BNT211 at the ESMO annual conference. A phase 1 dose-escalation data continue to show encouraging clinical activity and safety. Turning to Slide 21.\n\nBNT211 is a chimeric antigen receptor directing T-cells against the novel target Claudin-6 that is tested alone and in combination with a CAR-T cell-amplifying RNA vaccine called CARVac, encoding Claudin-6. CARVac is based on our uridine mRNA lipoplex technology used in other cancer vaccine candidate programs. Claudin-6 CAR-T cells are exclusive second-generation chimeric antigen receptor of high sensitivity and specificity for the carcinoembryonic tumor-specific antigen Claudin-6. Claudin-6 is existent in healthy adult tissue yet frequently expressed in high medical-need cancer, making this tumor antigen an ideal candidate for CAR-T cell therapy.\n\nThe ongoing first-in-human phase 1/2 trial is evaluating the safety and efficacy of Claudin-6 CAR-T cells as monotherapy and in combination with CARVac in patients with Claudin-6 positive relapsed or refractory advanced solid tumor. Our dose escalation study is testing two dose levels of Claudin-6 CAR-T cells as monotherapy, as well as in combination with a fixed dose of the RNA vaccine. The expansion cohorts include patients with ovarian, testicular, and endometrial cancer and reoccurred in six positive cancer types. Slide 22 provides a summary of the ESMO presentation that included data from 21 heavily pretreated patients who received Claudin-6 CAR-T cells at two dose methods, 10 -- 10 to the seventh and 10 to the eighth, alone or in combination with CARVac.\n\nPatients received medication respond treatment with BNT211 with the exception of two testicular cancer patients. The CAR-T cells as monotherapy and combined with CARVac were well tolerated. Adverse events included manageable cytokine release syndrome and one transient Grade 1 [Inaudible] dose-limiting toxicities were observed in two patients, both were manageable, and the patients fully recovered. One was prolonged pancytopenia in the dose levels two monotherapy group and a patient with testicular cancer after lymphodepletion.\n\nThe second one was hemophagocytic lymphohistiocytosis in the dose as a two-combination group prior to application -- administration of CARVac. The maximum tolerated dose has not yet been reached. We observed dose-dependent expansion of CAR-T cells in all patients. As of August 16, overall response rate was 33% and disease control rate was 67%.\n\nThis includes one complete response, six partial responses, and seven patients with stable disease. We are particularly encouraged by the observed activity in patients with testicular cancer receiving retentive aid for CAR-T dose levels after lymphodepletion. Of seven evaluable testicular cancer patients included in the analysis, one had a confirmed complete response, three had partial responses, and two stable diseases, resulting in a disease control rate of 85% and an overall response rate of 57%. Slide 23 shows engraftment and expansion of infused CAR-T cells in all patients with persistence for more than 100 and, in some cases, 200 days, including in the patient with a complete response shown in blue.\n\nIn cases of CAR-T cell redosing, the tests expanded successfully, as shown here in 10 to the seventh dose levels. Slide 24 highlights testicular cancer patients where we saw encouraging signs of activity with impressive tumor shrinkage, as you can see in these CT scans. For 11 patients with testicular cancer who received lymphodepletion regimen, their response rate reached 45% and even 57% when looking only at the 10 to the eighth CAR-T level. The disease control rate was 85% as for 10 to the eighth CAR-T dose level.\n\nOne patient at the 10 to the eighth CAR-T dose level was assessed by the investigator as having a complete response after 12 weeks. This complete response continued and was confirmed at the 18-week and 52-week timepoint. We are very encouraged by the safety and clinical activity data from this promising program. Turning now to Slide 25 and our next-generation immunomodulators partnered with Genmab.\n\nThis program, which aimed to prime and activate anti-tumor T-cell and natural killer cell function are continuing to advance. Abstracts to [Inaudible] this conference were just announced earlier today. We will present a poster highlighting preclinical results supporting BNT311, our bispecific antibody designed to elicit conditional 4-1BB co-simulation concurrent with PD-L1 blockade. Additionally, an abstract of preclinical data demonstrating the mechanism of action of BNT313 has been accepted for poster presentation at SITC.\n\nBNT313 is an anti-CD27 antibody that carries the hexamerization-enhancing domain to support antibody hexamer transformation that drives CD27 clustering on the T-cell surface necessary for activation. BNT313 is designed to induce CD27 agnostic activity without binding to Fc gamma receptor-bearing cells and thus circumvent T-cell depletion. A phase 1 clinical trial of BNT313 was initiated this month. As previously mentioned, for our BNT 3 thread program, an abstract has been accepted for a presentation at the ESMO Immuno-Oncology Congress in December.\n\nOverall, the progress of these programs is very encouraging for us. I look -- I look forward to providing additional program updates in the coming -- coming months. I will now pass the presentation to our CFO, Jens Holstein, who will present all financial results.\n\nJens Holstein -- Chief Financial Officer\n\nThank you, Ozlem. And a warm welcome to those of you on the phone. I would like to begin by presenting the key financial highlights for the third quarter of 2022, which you can find on Slide 27. Our total reported revenues for the third quarter reached 3.5 billion euros.\n\nTogether with a strong first half year, we are in line with our prior-year revenues for the year-to-date figures. I will elaborate on this shortly. Given this top-line number, we delivered operating income of 2.4 billion euros and generated earnings per share on a fully diluted basis of 6.98 euros. With respect to the company's liquidity position, we ended the third quarter of 2022 with 13.4 billion euros of cash and cash equivalents, as well as trade receivables of around 7.3 billion euros.\n\nThe trade receivables are primarily derived from our collaboration with Pfizer and remained outstanding due to the contractual settlement of the gross profit share under the collaboration. As of October 15th, we collected 3.2 billion euros in cash from our outstanding trade receivables at September 30th, improving our cash position and in turn reducing our trade receivable position subsequent to the end of Q3. Continuing with Slide 28. We recognized 3.4 billion euros of COVID-19 vaccine revenues during the third quarter and 12.9 billion euros during the first nine months.\n\nRevenues for the first nine months are in line with our expectations. We believe the development of the pandemic has been and remains dynamic, causing a rephasing of orders and with this fluctuations in quarterly revenues. Let me give you some more details on the revenue streams. And our COVID-19 vaccine collaboration territories have been allocated between us, Pfizer, and Fosun Pharma based on marketing and distribution rights.\n\nOur COVID-19 vaccine revenues included 2.5 billion euros for the third quarter and 9.1 billion euros for the first nine months that are related to our share of gross profit from COVID-19 vaccine sales in the collaboration partners' respective territories. These revenues represent a net figure, which means we generate 100% gross margin of those revenues. As we have mentioned in the past and explained in more detail in our financial statements, in filings with the SEC, our profit share is, to some extent, estimated based on preliminary data shared between our collaboration partner, Pfizer, and us. A gross profit share is also impacted by write-offs.\n\nSo, for example, for vaccine doses produced by our collaboration partner, Pfizer, those write-offs to reduce the gross profit share between the two companies and therefore reduce by on tax revenue figure, but not those of our partner, Pfizer. Our COVID-19 vaccine revenues from direct COVID-19 vaccine sales to customers in our territory were 0.6 billion euros for the third quarter and 2.3 billion euros for the first nine months. Those revenues were significantly driven by the orders that were placed in late 2021 following the then-emergent omicron variant and the omicron-adapted vaccine launches started beginning of September 2022. Also included in our COVID-19 vaccine revenues were up to 0.3 billion euros for the third quarter and 1.5 billion euros for the first nine months of revenues from sales to our collaboration partners.\n\nNow, I'd like to move on to our detailed financial results for the third quarter and first nine months of 2022, as shown on Slide 29. As I discussed revenues on the previous slide, let me move to cost of sales that reached approximately 0.8 billion euros in the third quarter of 2022, compared to 1.2 billion euros for the comparative prior year period. For the first nine months of 2022, the cost of sales reached approximately 2.8 billion euros, compared to 2.3 billion euros for the comparative prior-year period. The change in cost of sales resulted mainly from the recognition of costs related to our COVID-19 vaccine revenues in our own territories, including the share of gross profit that we owe to Pfizer.\n\nIn addition, cost of sales were impacted by expenses arising from inventory write-offs and expenses for production capacities derived from contracts with contract manufacturing organizations. Research and development expenses reached 341.8 million euros for the third quarter of 2022, compared to 260.4 million euros for the comparative prior year in 2021. For the first nine months of 2022, research and development expenses amounted to 1 billion euros, compared to 0.7 billion euros for the comparative prior-year period. The increase was mainly due to the increased headcount and higher expenses in the context of the share-based payments.\n\nGeneral and administrative expenses reached 141 million euros for the third quarter of 2022, compared to 68.2 million euros for the comparative period in 2021. For the first nine months of 2022, general and administrative expenses reached 361.8 million euros, compared to 154.9 million euros for the comparative prior-year period. The increase in G&A was mainly driven by the planned increase in headcount and increased expenses for purchased external services. Income taxes were accrued with an amount of 0.7 billion euros for the third quarter of 2022, compared to 1.5 billion euros for the comparative period in 2021.\n\nFor the first nine months of 2022, income taxes were accrued with an amount of 2.6 billion euros, compared to 3.2 billion euros for the comparative prior-year period. It derived effective income tax rate for the first nine months of 2022 was 26.8%. In the third quarter of 2022, net profit reached 1.8 billion euros, compared to 3.2 billion euros for the comparative period in 2021. In the first nine months of 2022, net profit reached 7.2 billion euros, compared to 7.1 billion euros for the comparative prior-year period.\n\nOur diluted earnings per share for the third quarter of 2022 amounted to 6.98 euros, compared to 12.35 euros for the comparative period 2021. For the first nine months of 2022, our diluted earnings per share was 27.70 euros, compared to 27.46 euros in 2021. Now, let's move to Slide 30 for the outlook for the 2022 financial year. We are updating our 2022 financial guidance, raising our COVID-19 vaccine revenue estimate for the full year to the upper end of the original range, 16 billion to 17 billion euros from 13 billion to 17 billion euros previously.\n\nThe narrow guidance reflects delivery on the omicron-adapted bivalent vaccine booster, which started early in September and is expected to continue throughout the fourth quarter of 2022, as well as higher prices and a positive foreign currency effect. We reiterate our planned expenses and capex, which we have summarized for you on the slide. We also update the estimated annual effective income tax rate from previously 28% to approximately 27%, which is a further improvement to previous year. I'll be moving to the completion of the first tranche of our share repurchase program, as shown on Slide 31.\n\nThe share repurchase program approved by the management board and the supervisory board permits the repurchase of ADSs for a value of up to $1.5 billion over two years. Our intention is to use some or all of the repurchased ADSs to meet pending obligations from share-based payment arrangements. The first tranche of the repurchase program had a value of up to $1 billion and began on May the 2nd, 2022, and ended October the 10th, 2022. As shown on the slide, a total of 6,945,513 ADSs will be purchased at an average price of $143.98, representing 2.8% of the shares issued as of April the 30th, 2022.\n\nIn addition, we had paid out a dividend of approximately 0.5 billion euros to shareholders in 2022. In November, the second tranche of the repurchase program with a value of up to $0.5 billion has been approved, commencing on December the 7th this year. More information and an overview of the buybacks can be found on our IR website. With that, I would like to turn the call over to our chief strategy officer, Ryan Richardson, for an update on our outlook for 2022 and concluding remarks.\n\nThank you.\n\nRyan Richardson -- Chief Strategy Officer\n\nThank you, Jens. Turning to Slide 33, our COVID-19 vaccine continued to play a major role in addressing the pandemic with the launch of our variant-adapted BA.4/BA.5 vaccine. We and our partners have received approval in over 45 countries and territories since our first approval in August this year and have rapidly deployed approximately 300 million doses of our variant-adapted vaccines as of mid-October. We have updated our full year 2022 order book and now expect to invoice up to 2.1 billion doses this year, reflecting some rephasing of deliveries to early 2023 due to supply availabilities and projected uptake of our variant-adapted vaccines.\n\nBy year-end, we expect to fulfill both our existing contract with the United States government for 105 million doses and our contract with the European Union for 650 million doses. As we turn to 2023, we anticipate that the COVID-19 vaccine market will start to shift toward a hybrid public-private market, with some geographies, namely the United States, likely shifting to a commercial contracting model in 2023. In the United States, we and our partner, Pfizer, expect the list price for a single dose vial of adult vaccine to be in the range of $110 to $130 per dose, reflecting both the cost-effectiveness and public health value of our vaccine. In the future, we expect seasonal demand to be weighted to the second half of the year, consistent with other seasonal respiratory infectious disease vaccines.\n\nAs shown on Slide 34, we continue to make progress against our 2022 clinical milestones. As we enter the final months of the year, we expect a number of additional updates, some of which are shown here and on the following two slides. In infectious diseases, we expect continued expansion of our COVID-19 vaccine pipeline, with multiple next-generation vaccine constructs entering the clinic before year-end. We also expect data updates from our ongoing clinical trials evaluating our variant-adapted vaccines.\n\nOutside of COVID-19, we plan for multiple mRNA vaccines to enter the clinic this year and early next year. By the end of 2023, we expect to have up to five new clinical trial starts in infectious diseases. Turning to Slide 35, in oncology, alongside the first patient dosed in the phase 1 trial evaluating BNT313, our anti-CD27 HexaBody partnered Genmab, which we announced today. By year-end, we also expect to have the first patient dosed for a second phase 1 trial evaluating BNT116 in first-line NSCLC.\n\nWe also will present a clinical data update at the ESMO IO annual meeting in December for BNT312, our CD40 4-1BB DuoBody partnered with Genmab. As we look ahead to 2023, we expected a busy year for our oncology pipeline, with as many as 10 clinical trial updates across a diverse range of programs. Concluding on Slide 36, we expect 2023 to be a momentous year for BioNTech. We will continue to invest for the long term and our next-generation COVID-19 vaccine pipeline as we continue to deliver our variant-adapted vaccine around the world.\n\nWe will continue to expand and accelerate our innovative oncology and infectious disease pipelines in anticipation of multiple late-stage data readouts and clinical trial starts. And we expect will fuel future growth. And with increasing balance sheet strength, which we expect into next year, we will continue to reinvest in the company to build world-class capabilities and accelerate our growth. We will also continue to look for additive both on BD and M&A opportunities that fit with our strategy.\n\nWe remain as optimistic as ever in our ability to continue to create long-term value for patients, our shareholders, and society. I would like to take the opportunity to thank our shareholders for their continued support, and we'll now open the floor for questions.\n\nOperator\n\nThank you. [Operator instructions] We will now go to our first question. One moment, please. And your first question comes from the line of Tazeen Ahmad from Bank of America.\n\nPlease go ahead.\n\nTazeen Ahmad -- Bank of America Merrill Lynch -- Analyst\n\nHello. Good morning. Thanks for taking my question. Can I just get some color from how long do you think that the current BA.4/5 bivalent shot is going to be in use? Should we expect it to have any coverage of the newer variants, like, for example, the BQ.1 or BQ.1.1? And if it doesn't, how should we think about some of the shipments that you mentioned in your prepared remarks that have been shifted into 2023? Would those be delayed until later next year to the -- to the parties that have ordered it have the right to delay shipment for a newer version of the vaccine? Thanks.\n\nOzlem Tureci -- Chief Medical Officer\n\nI would like to respond to your first question, Tazeen, with regards to how long the BA.4/5 omicron-adapted vaccines would -- would allow us to respond to the pandemic? That will really depend on how the virus further evolves. The -- some of the currently emerging variants of -- of concern are closely related with BA.4/BA.5 are from the BA.2 lineage, and there is some probability that there will be cross-neutralization and cross-protection against these variants. We will continue to -- to test this by cross-neutralization assays, which are ongoing, and can then say more. But it really depends on how the virus provides further evolves.\n\nUğur Şahin -- Chief Executive Officer\n\nRyan, do you want to take the second question, or should I give an answer?\n\nRyan Richardson -- Chief Strategy Officer\n\nYeah, absolutely. I can start over. So, on the question of shifting of doses, Tazeen. A significant portion of those doses that were shifted for delivery next year were actually donation doses to a variety of countries around the world.\n\nSo, really, we see that dynamic as -- as not specifically related to the -- the variant vaccine in question. And generally speaking, these contracts are flexible. So, while we see some of those doses shifted to 2023, you know, we still have -- expect a significant proportion of contracted doses next year and -- and beyond. And that could be those contracts can still be served by, again, either the current vaccine or future vaccines if a future variant vaccine was needed.\n\nTazeen Ahmad -- Bank of America Merrill Lynch -- Analyst\n\nOK. Great. Thanks for the color.\n\nOperator\n\nThank you. We will now go to our next question. One moment, please. And your next question comes from the line of Matthew Harrison from Morgan Stanley.\n\nUnknown speaker\n\nHi, this is Steve for Matthew. Thanks for taking my question. My question is, as you think about the PCP data next year, what kind of -- what kind of PFS difference would you like to see to think about moving in ahead? Thank you.\n\nRyan Richardson -- Chief Strategy Officer\n\nSo, just to clarify the question, you -- you referenced the PCP. So, you're talking about the INS program.\n\nUnknown speaker\n\nAnd melanoma. Yes.\n\nRyan Richardson -- Chief Strategy Officer\n\nYeah. And melanoma. And your question is, just to clarify, your question is, what PFS improvement are we looking for?\n\nUnknown speaker\n\nYes. Yes. Thank you.\n\nRyan Richardson -- Chief Strategy Officer\n\nOK. Ugur, Ozlem, do you want to address this?\n\nUğur Şahin -- Chief Executive Officer\n\nYeah, I think -- I think this -- this is too early to-to give a -- to define a threshold. We are working with several issues. They have to understand that any type of improvement is in line with the further progress in the field that was made in the first melanoma. Yeah, we have to align this -- this -- this understanding also with the progress that we have made in the -- in the manufacturing of our INS platform.\n\nYeah, so we, in the meantime, improve the algorithm and -- and reduce the turnaround time for the vaccine and came up with process improvements. And this would also require discussions with the authorities to make the final decision better that we will progress and can -- can just use the study to expand the clinical trials for potential accelerated approval or to have confirmatory trial.\n\nUnknown speaker\n\nThank you.\n\nOperator\n\nThank you. We will now go to our next question. And your next question comes from the line of Chris Shibutani from Goldman Sachs. Please go ahead.\n\nChris Shibutani -- Goldman Sachs -- Analyst\n\nYes. Thank you very much. Recent media reports suggest the potential for distribution of your COVID vaccine in China, with the initial target population being expats. And we're trying to better understand the potential scope of this opportunity, thinking in terms of units and pricing.\n\nCould you, number one, give us any updates on development when perhaps your vaccine might be approved in China? Number two, would this be an approval that might enable broader distribution to Chinese nationals? And then on the price front, help us at all with anything that we can understand about the potential pricing In that market. Thank you.\n\nRyan Richardson -- Chief Strategy Officer\n\nYeah. Thanks for the question, Chris. I think it's a little too early, actually, to give some specifics there. We have seen some -- some positive reengagement, as was -- has been reported.\n\nAnd we can confirm that we have been taking part in some discussions, which are very positive. However, it's still too early to say or to try to predict to what extent an approval for -- for the expat population could be granted, when it might be granted, what that would mean commercially. So, at this stage, we're continuing to monitor the situation very, very carefully and hope to provide updates in the near future.\n\nOperator\n\nThank you. We'll go to our next question. One moment, please. And your next question comes from Jessica Fye from J.P.\n\nMorgan. Please go ahead.\n\nJessica Fye -- JPMorgan Chase and Company -- Analyst\n\nHey, there. Good morning. Thanks so much for taking my question. On the COVID-19 vaccine market, Moderna has talked about how they expect the COVID booster market to be in the range of 500 million to 600 million doses per year, not unlike flu, but potentially a bit below that in 2023 and working up to that 500 million to 600 million thereafter.\n\nDo you share that view that COVID vaccine volumes could trail that 500 million to 600 million range next year, but then increase in '24 and beyond to something closer to the flu range? Thank you.\n\nJens Holstein -- Chief Financial Officer\n\nYeah, maybe I'll start. This is Jens Holstein. I'll be answering the question of why might [Inaudible]. You know, I think we all know that the pandemic has evolved well this year, and how it will evolve in the future is -- is really very difficult to predict.\n\nBut we all know that COVID is a deadly disease, it's much more deadly than the flu. We've seen much higher death rate that cases than we know from flu. And elderly people and high-risk patients will be, for sure, the population that -- that need vaccinations. But of course, everyone else, too, who feels, you know, he or she needs to be protected against severe disease.\n\nSo, that's -- that's maybe the base first. Going forward, I mean, all depends on if and how often additional variants will pop up and how severe those variants will be going forward. At some point, it's -- it is -- there is a high likelihood, of course, that there could be a flu-like business model coming up. It remains based on what -- what I said before, on the on -- the fact that COVID is a deadly disease and a large multibillion-dollar market going forward, and specifically with -- in such an endemic scenario that the private market opens up, we know that pricing will be very different to the current pricing that we had.\n\nSo, there is -- there is upside at that end. And in addition, maybe last comment from my end, I think BioNTech and Pfizer together have shown and have proven that we are well-placed in the market. We have, I think, a very good market position, and we have been able over the time to defend that market position very well. So, we are very confident, you know, that going forward, this remains a very sizable, very good market for us.\n\nAnd, Ryan, you maybe want to add something?\n\nRyan Richardson -- Chief Strategy Officer\n\nNo, I think you covered most of it. I would just -- I would just second the notion that, you know, in 2023, it's not -- we're not going to yet be into a true endemic market because it will be -- it will be a hybrid market with significant contracted volumes. And also, we expect emergence of a private market on top. I think the volume numbers that you've said, you know, are plausible.\n\nWe have still seen evidence of higher uptake in the booster segment than, for example, we see with flu. And so, there's one -- that's one data point there. And obviously, here, we do expect a very different price point versus the flu market. So, I think those -- those factors combine to -- to create the multibillion long-term market opportunity that we expect that you just outlined.\n\nOperator\n\nThank you. We will now go to our next question. And your question comes from Daina Graybosch from SVB Leerink. Please go ahead.\n\nYour line is open.\n\nDaina Graybosch -- SVB Leerink Partners -- Analyst\n\nHi. Thanks for the question. I want to ask about some academic publications that were posted as preprints from the [Inaudible] labs recently, and they were on their own looking at the immunogenicity of the bivalent boosters versus another booster of wild-type monovalent. And their data showed pretty modest increases in antibody titers with the bivalent booster, much more modest than what you today have shown in the greater than 55 population.\n\nI wonder if you can talk about how you interpret their data. And if their data, let's say, is correct, and that you get a very modest difference with the bivalent, let's say, for younger people under 55, what does that tell you about the bivalent booster, whether boosters will be needed, and what kind of booster we may need in the future? Thank you.\n\nUğur Şahin -- Chief Executive Officer\n\nHi, Daina. Thank you for the question. And so, first -- first of all, to the -- to the preprint, of course, the -- the study, the preprint. And we see -- we see that the study is missing -- missing to differentiate between -- between individuals who had prior infection and without prior infection.\n\nAnd we have seen in our dataset that this is very important to come to conclusions since individuals without prior infections have a much higher -- higher increase with regard -- with regard to the overall -- overall offered neutralizing in titers and as compared to those who have been -- who had -- had prior infections. And so, our data, we have we have published seven-day data and -- and one-month data. And the data are very consistent within the groups, with homogeneous -- homogeneous findings. We are confident that -- that the report that we made also with the larger number of subjects, even not -- not very large, with the larger number of subjects, that'll be -- will turn out to be -- to be -- to be the -- the real findings.\n\nSo, just to -- to repeat, the key finding is that, so far, in the elderly population, we have a fourfold higher increase in neutralization patterns as compared to BioNTech vaccine. And they are talking here about -- about the immediate antibody response. But we have also to consider that every vaccination, variant-adapted vaccine has a second effect. The second effect is the induction with a -- was a clear delay of immune responses and forming of de novo T-cell responses that come up later in the time frame of the three-plus months.\n\nSo, I believe that -- we believe that in -- as in the flu case, we will need to have a booster market with variant-adapted vaccine to retrain the immune system to the new variant sequence. And -- and -- and this can't be addressed by sticking to the existing -- existing wild-type vaccine. Just to also repeat findings that were generated with the BioNTech vaccine, even the booster with the BioNTech vaccine reduces the -- the severe disease phase and reduces the mortality. So, that means we got this -- that we are immunizing, boosting with wild-type or with this variant-adapted vaccines, we have a reduction of severe disease rate, yeah.\n\nAnd -- and with the variant-adapted vaccines, we have now an evidence that the neutralization titer appears to be significantly higher with the wild-type.\n\nOperator\n\nThank you. We will now go to our next question. And your next question comes from the line of Akash Tewari from Jefferies. Please go ahead.\n\nYour line is open.\n\nUnknown speaker\n\nHey, good morning. And this is Ivy on for Akash. Thanks for taking our question. We have one on COVID vaccine sales.\n\nSo, how many of the total 300 million you contracted doses remain to be delivered in 2023? Also, you mentioned some of your shipments have been pushed to next year. So, in total, how many confirmed orders are there for next year? Consensus models 2023 total vaccines sales are for 110 billion. Do you still you will be able to hit that number with [Inaudible] orders signed for 2023? Thanks.\n\nRyan Richardson -- Chief Strategy Officer\n\nWell. So, yeah, thank you for the question. I think I'll start and then I think Jens Holstein would chime in. And so, I think you first asked about next year and the EU contract.\n\nAnd I think what we announced in our prepared remarks was that we plan to -- to deliver the -- the planned doses for the EU this year, that we plan for 2022, and also complete the US -- existing U.S. contract that was announced earlier this year. We were not disclosing an order book number for next year. What we can tell you is that, of course, our signed -- overall signed orders have continued to grow throughout this year, overall, regardless of the delivery time period.\n\nBut we're not guiding at the moment to a future order book because we think it's premature to do so, and frankly, not relevant or not as relevant now given that the -- the demand picture continues to be dynamic, that we continue to expect the emergence of a private market in some geographies next year, as we mentioned. So, it's really more of a hybrid market next year. But overall, we feel very good about overall demand and how we're tracking to be able to serve that. Jens, maybe you want to answer.\n\nJens Holstein -- Chief Financial Officer\n\nYeah, I guess. Sorry, Ryan and myself had a little bit of problem to understand you because of the line. The connection was not that good. But as you pointed out correctly, we deliver according to -- to the plan for 2022 for the EU.\n\nWe're not expecting any shift here. We had, as you know, contractual agreements signed for -- for '23 with the EU, 450 million doses and an option of 450 million doses. But as Ryan correctly said, I think, maybe for the EU, that might be at a later point in time. But overall, I think we've got to move away from this thinking on the order book because what we have seen is there are certain shifts.\n\nIt all depends on market demand, on the evolvement of variants that are coming up, and -- and specifically, as Ryan correctly said, there will be markets that morph into a private setting going forward, assuming that, you know, this is seen as an endemic market going forward. And it will take probably a few years. And then I think the danger really is to draw the wrong conclusions from -- from some number on an order book. Yeah.\n\nAnd therefore, we're moving away from, you know, giving some guidance on this.\n\nUnknown speaker\n\nGot it. Thanks.\n\nOperator\n\nThank you. We will now go to our next question. And the next question comes from Yaron Werber from Cowen. Please go ahead.\n\nYour line is open.\n\nUnknown speaker\n\nHi, this is Brendan on for Yaron. Thanks very much for taking the question. Congrats on a strong quarter. Just a quick one from us.\n\nWhen we think about maybe the emergence of future variants and look at kind of the timeline from the first omicron wave in December and then BA.4/5 maybe around April or so, and then the rollout by September of, yeah, your BA.4/5 booster, do you think this is more or less a reasonable timeline we can expect for future variants in terms of your interactions with FDA and materials and data you need to get them really to get you to boosters authorized or are there important considerations we should really be keeping in mind as the landscape inevitably shifts over the coming months and years?\n\nRyan Richardson -- Chief Strategy Officer\n\nUgur, do you want to take that?\n\nUğur Şahin -- Chief Executive Officer\n\nYes, I can -- I can take that. I think the future vaccine adaptation and booster process will depend on two aspects: one, the regulatory landscape; and the second one is how fast we can respond to new variants. Starting with the second part is, as you know, the BA.4/5 variant emerged -- emerged only recently, and the FDA -- after the FDA decision, we were able to come up with an adapted vaccine and able delivery within about two months. But that means our processes -- internal processes for vaccine adaptations are now even -- even faster than what we had indicated beginning 2022.\n\nAnd we are going to further optimize the vaccine adaptation process to be able to respond quickly to a new variant. And the second thing, what is important is and we have now the case with the FDA and with the EMA, we got -- we got an authorization of the vaccine based on pre-existing clinical data on multiple variants. And just to remind everyone, we have done multiple clinical trials for different variants, and the safety profile that we have identified was always consistent for all variant-adapted vaccines. And the second aspect is that we found that -- that preclinical data and clinical data and breakthrough -- breakthrough -- subjects of breakthrough infections are very predictive on what we are seeing in the clinical setting.\n\nAnd the authorization now of this variant-adapted BA.4/5 vaccine followed this logic, and -- and abled a rapid authorization and availability of a BA.4/5adapted vaccine. And we believe that this will become also in future, the model -- the working model. That means once new variants emerge that require a boosting, we will be able to respond quickly and there will be a regulatory process to allow that such variant-adapted vaccines can get -- can be -- can be delivered within -- within a few months after -- after the emergence of the variant.\n\nUnknown speaker\n\nOK, great. Thanks very much.\n\nOperator\n\nThank you. We will now go to our next question. And the question comes from Ellie Merle from UBS. Please go ahead.\n\nYour line is open.\n\nEllie Merle -- UBS -- Analyst\n\nHey, guys. Thanks so much for taking the question. Just a financial one. Given you book the gross profits from the Pfizer collaboration, can you comment, I guess, on your latest thoughts on how you're thinking about the profit margin and the Pfizer collaboration COVID business longer term and how you see that changing and also how this could change if there were to be a combination COVID-flu vaccine, for instance? Thanks.\n\nJens Holstein -- Chief Financial Officer\n\nYeah. Thank you, Ellie, for the question. Not an easy -- and not easy -- not an easy question to answer, I have to say. Well, in terms of the gross margin, I think you have seen pretty stable gross margin development throughout the year.\n\nI mean, in the quarters, you have some up -- up -- some ups and downs once in a while given that we had some write-offs, and we have elaborated on this in the documentations that we have published. Going forward, I mean, with the higher pricing, of course, it depends then what the costs are, what the costs will be that we have to deduct. It's a bit too early to -- to really give you, you know, clear guidance on this, what that means for our gross margin for '23 and the years beyond. And specifically then when -- when flu comes in, which, you know, will take a while, we will -- we will see that at a later point in time.\n\nSo, there will be some -- some mixture that we will -- that we will see going forward. And therefore, you know, you've got to bear with us a little bit until we're able to really give you some -- some more clarity on the impact.\n\nEllie Merle -- UBS -- Analyst\n\nGot it. Thanks.\n\nOperator\n\nThank you. We will now go to the next question. And your next question comes from the line of Simon Baker from Redburn. Please go ahead.\n\nYour line is open.\n\nSimon Baker -- Redburn Partners -- Analyst\n\nA question on pricing, if I may. You very helpfully gave us the -- the list price range for the U.S. of around $110 to $130 per single dose. And I appreciate it's not the same thing, but I just wondered how we -- how we should think about contrasting that number with the $64 per dose that CMS talked about in April.\n\nObviously, yours covers a far broader remit and -- than the CMS was talking about, but just how we should think about how those numbers triangulate together. And on a similar point, could you give us any early indications for pricing outside the U.S. for 2023? Thanks so much.\n\nRyan Richardson -- Chief Strategy Officer\n\nYeah. Thank you. Thank you, Simon. I mean, as you know, we're expecting this market to be a heavily tiered priced market like for any other vaccine.\n\nAnd so, the price that we've quoted there is a U.S. -- is a U.S. list price. We would expect, of course, that, sometimes, there can be differences depending on the segment that you're in.\n\nThat's pretty much all we can tell you at this point. You know, in terms of the dynamic, you know, we do think that this market will have some important differences to some of the other vaccine markets like flu in the sense that it's, you know, we expect that this will not be -- this will be a branded market for the foreseeable future. And -- and there's also a very different market structure here than you have in some of the other vaccine markets where you have many, many players. I think we're -- we do feel like we're in a good position here by virtue of having a very strong product with a very strong product profile both on safety and efficacy and have continued to build up our safety database and have a strong brand.\n\nSo, I think we feel -- we feel good about our -- about the price that we put out there, but that's pretty much what we can say at this point. In some geographies, there could be differences and there's likely to still be a link to volumes on some level, as you would expect in a heavily contracted market like this where you have purchases in bulk.\n\nJens Holstein -- Chief Financial Officer\n\nAnd maybe to add to what Ryan just said, I mean, you've read what Pfizer said to -- to the topic. You know, their pricing has been said given or in relation to what sort of benefit, you know, we see that we bring with a product. And of course, as Ryan said, you know, it's also a question of volume. So, I mean, we have signed huge contracts with various government, contract size with other parties in the U.S.\n\nmarket to use that example is, of course, a totally different one, and that will -- that will have an implication. Overall, I mean, how the pricing will develop over time is to be expected to go up, of course, because more and more countries, if it becomes endemic, of course, that's the base assumption for this, you know, will then have similar sort of developed -- developments and what the pricing that means in Japan or in Europe. You know, when the European contract runs out, that has to be seen. It's a bit early to really be -- well, to be -- to be able to give you more precise indications here.\n\nBut that's the sort of broad direction that we see.\n\nSimon Baker -- Redburn Partners -- Analyst\n\nOK. Thank you very much.\n\nOperator\n\nThank you. We will take one more question. And the question comes from the line of Zhiqiang Shu from Berenberg. Please go ahead.\n\nYour line is open.\n\nZhiqiang Shu -- Berenberg Capital Markets -- Analyst\n\nGreat. Thanks for taking the question. And I want to ask broadly on the mRNA cancer vaccine. And obviously, there's some skepticism around the cancer vaccine phase.\n\nSo, maybe, Ugur, can you discuss a bit of your confidence on this modality in the -- the cancer vaccine space and maybe some updated thoughts on where -- where this modality will play the most significant -- significant role. And quick follow-up to BNT211, the CAR-T. Can you also discuss the potential registration path for -- for this program, given you have seen quite encouraging data from early trials? Thanks very much.\n\nUğur Şahin -- Chief Executive Officer\n\nYeah, thank you, Zhiqiang. So, let's -- let's start with the cancer vaccine question, and Ozlem will take the questions related to the Claudin-6 CAR. And so, of course -- of course, there are the -- the discussion about cancer vaccine is the same. Why do you believe that cancer vaccines will work in -- in the background of so many as in the past? My answer is always the same.\n\nWe believe that cancer vaccines must be positioned in a -- in a way that they can do the job. And we believe that -- that the best market and the best indication and clinical setting for -- to address cancer vaccine is post-surgery, where tumors -- tumors are in a micrometastatic may not left. So, this is a minimal residual disease or ctDNA-positive patients after surgery. And we know that in this -- in this setting, there's a huge medical need.\n\nTo give you just examples, in colorectal cancer, about 30% of patients after surgery have a relapse in the -- in the time of two to three years after surgery. In triple-negative breast cancer, this is also in the range of 30% to 40% in the first four years after surgery. In pancreatic cancer, it's even about 70% of patients relapsing after surgery. And the same is similar data are discussed for -- for stomach cancer, GI cancers, and so on.\n\nThat -- that's the -- that's where we want to position our personalized cancer vaccines, allowing us to induce neoantigen-specific immune responses T cell. We know now from -- from clinical data -- the clinical data in pancreatic cancer, in melanoma patients, and also from publications of other academic groups that this could be an ideal setting to induce T-cell responses that could -- could help to control and eliminate your tumor cells. And, Ozlem, would you like to take the second question?\n\nOzlem Tureci -- Chief Medical Officer\n\nYes, this was about our CAR-T cell program, BNT211, and the -- the regulatory path which we would foresee there. Let me remind you that in this program, we are still actually in the dose-finding part of our phase 1/2 trials, which means that we have only tested the first two dose levels or three dose levels of our CAR-T cells and are also still in the process of exploring whether adding to this new CAR-T cell product vaccine makes a difference or not and how the treatment regimen should be. Having said that, we are also very excited as you about the data which we already see at this early stage, namely manageable safety plus exciting clinical activity, in particular, in the patients with testicular cancer. Therefore, we are also -- I have also started about thinking about the best regulatory path here.\n\nWe have not made any positions and cannot speak about that at this timepoint, but we'll, for sure, do next year.\n\nZhiqiang Shu -- Berenberg Capital Markets -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you. I will now hand the call back for closing remarks.\n\nSylke Maas -- Vice President, Investor Relations\n\nThank you for joining today's call. We look forward to talking to you soon. Stay safe. Thank you.\n\nBye bye.\n\nOperator\n\nThank you. [Operator signoff]\n\nDuration: 0 minutes\n\nSylke Maas -- Vice President, Investor Relations\n\nUğur Şahin -- Chief Executive Officer\n\nOzlem Tureci -- Chief Medical Officer\n\nJens Holstein -- Chief Financial Officer\n\nRyan Richardson -- Chief Strategy Officer\n\nTazeen Ahmad -- Bank of America Merrill Lynch -- Analyst\n\nUnknown speaker\n\nChris Shibutani -- Goldman Sachs -- Analyst\n\nJessica Fye -- JPMorgan Chase and Company -- Analyst\n\nDaina Graybosch -- SVB Leerink Partners -- Analyst\n\nEllie Merle -- UBS -- Analyst\n\nSimon Baker -- Redburn Partners -- Analyst\n\nZhiqiang Shu -- Berenberg Capital Markets -- Analyst\n\nMore BNTX analysis\n\nAll earnings call transcripts"
}