{
  "companyName": "Brilliant Earth Group, Inc.",
  "companyTicker": "BRLT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/brilliant-earth-group-inc-brlt-q2-2022-earnings-ca/",
  "content": "Brilliant Earth Group, Inc. (BRLT 4.36%)\nQ2 2022 Earnings Call\nAug 11, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Brilliant Earth second quarter 2022 earnings call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Allison Malkin with ICR.\n\nPlease go ahead.\n\nAllison Malkin -- Investor Relations\n\nThank you. Good afternoon, everyone. Thank you for joining us for our second quarter 2022 earnings conference call. Joining me today are Beth Gerstein, chief executive officer; and Jeff Kuo, chief financial officer.\n\nFor this morning's call, Beth will begin with highlights of our second quarter financial and operational performance and the drivers of our future growth. Jeff will follow with more details on the second quarter financial results and guidance. Following this, the operator will begin the Q&A session with our presenters, Beth and Jeff available to answer the questions you have for us today. Before we start, I would like to remind you that management will make certain remarks today that are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995.\n\nThese future forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially. Please refer to our SEC filings for a description of the risks that could cause our actual performance and the results to differ materially from those expressed or implied in these forward-looking statements. These forward-looking statements reflect our opinion only as of the date of this call. And we undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements in light of new information or future events.\n\nAlso, during this call, we will discuss both GAAP and non-GAAP financial measures. You will find additional information regarding these non-GAAP financial measures and a reconciliation of these non-GAAP to GAAP measures in today's earnings release, which is available at the investor relations section of our website at investors.brilliantearth.com. A live broadcast of this call is also available at the investor relations section of our website. With that, I'll turn the call over to Beth.\n\nBeth Gerstein -- Chief Executive Officer\n\nGood afternoon, everyone, and thank you for joining us today. As we approach our one-year anniversary as a publicly traded company, we are pleased to report our fourth consecutive quarter of strong profitable growth. It's been an incredible year for our company, one in which we've grown the reach and impact of our mission to cultivate a more transparent, sustainable, compassionate and inclusive jewelry industry. We are proud of the progress our outstanding team has made to date, and we're intently focused on the future.\n\nWith a clear mission, a proven track record and significant opportunities for expansion, we are excited about our near- and long-term potential. We are pleased with our second quarter results as they demonstrate our continuing ability to navigate in a rapidly changing macroeconomic environment. By staying focused on nimbly and prudently executing our strategy while optimizing our asset-light business model to grow the brand, we are in a strong position to continue to take share in a fragmented industry and to prudently manage our costs so that we continue to deliver profitable growth. A high-level review of our Q2 results demonstrates the effectiveness of this approach.\n\nWe grew revenue 18% to $108.8 million. We delivered record gross margin of 53.1%, a 460-basis-point improvement over the prior year. And we delivered $9.6 million in adjusted EBITDA, representing an adjusted EBITDA margin of 9%. Recent highlights include the continued expansion of our omnichannel strategy with the opening of showrooms in Bethesda, Columbus, Houston, Minneapolis, Cleveland and Detroit to bring our reach to 21 showrooms in which our customers can experience a personalized joyful shopping experience.\n\nWith each new showroom opening, we bring more consumers to our brand, while also deepening our relationships with both new and returning customers. Technology is a big part of delivering an exceptional omnichannel customer experience. Our continued investment in technology and data is helping us in multiple ways. Our seamless experience allows customers to shop how and when they want.\n\nFor example, we've recently launched an online waitlist to ensure customers can get the right appointment for their schedules, even if we are fully booked. Equally important, our showrooms deliver strong ROI. Going forward, we are maintaining our line of sight to nearly doubling our showrooms this year. Our showroom strategy has been and will continue to be a major catalyst for building our brand.\n\nWhether in our showrooms or on our website, in Q2, we continued to deliver design-led proprietary products that our customers love across our period assortment. But today, I'll start with fine jewelry, a fast-growing small percentage of our total mix with huge growth potential. As a reminder, for us, fine jewelry consists of earrings, necklaces, bracelets and fashion rings. For Mother's Day, we enjoyed strong success, delivering over 350 basis points of growth in fine jewelry mix over the prior year.\n\nWe also launched men's fine jewelry, including necklaces, bracelets chains and cufflinks to an enthusiastic response. This is a new collection we launched in time for Father's Day, and customers were so excited, they found the products on our site even before we marketed them. When we did launch our strategy included key influencers, media and social content and generated nearly 80 million impressions while introducing new consumers to our brand. One of the drivers of this enthusiasm for our brand is how we are executing on social platforms where our customers are, including TikTok to extend our brand reach.\n\nAnd while millions of views are impressive, it's our engagement and community building that we're most excited about. In fact, in a recently conducted brand survey, 13% of customers indicated they learned about Brilliant Earth on TikTok. And you've heard me say it for the past two quarters, 2022 is the year of wedding and we continue to capitalize on this. Both men's and women's wedding bands have grown faster than our overall business year to date, led by the strength of our product assortment and a record number of weddings that have driven demand.\n\nAs you know, bridal and wedding are highly considered purchases where consumers normally shop with a budget. During the quarter, our AOVs were generally in line with past quarters, and we continue to consistently realize profit on first purchase and see growth across our price points. As our brand grows, new and returning customers look to us for trend-leading proprietary product, design and craftsmanship in concert with our deep supplier integrations and technology, we added thousands of new lab and natural color diamonds, offering our customers an even broader on-trend assortment of colors, shapes and price points from which to choose. We know that consumers want choice.\n\nOur ability to leverage data to understand our customers' preferences and then to optimize the breadth and depth of our diamond assortment which today includes over 200,000 lab and natural beyond conflict-free diamonds enables us to effectively serve the broad needs of our customers. And finally, true to our mission, we launched Truly Brilliant an expertly curated collection of diamonds with the perfect balance of cut, color and clarity and verified sustainable sourcing. The assortment includes natural diamonds with blockchain-powered mine-to-market traceability for industry-leading transparency. This collection is targeted for the discerning luxury consumer, one who we are increasingly attracting, who is seeking premium quality and highly differentiated characteristics.\n\nThese products and brand stories and the results that they drove illustrate what makes Brilliant Earth special, our mission, our brand, our unique and powerful business model and our team, one whose hard work and commitment is truly exceptional. In fact, the number one reason employees join Brilliant Earth is because of our mission. In any environment, and as we have since our founding in 2005, we focus on creating the future by serving our customers joyfully and responsibly, creating trend-leading sustainable products and delivering profitable, sustainable long-term growth. We are pleased that we are able to profitably grow and increase market share in a volatile environment and remain confident in our outlook for the full year.\n\nAs we look ahead to the rest of the year, we will remain cognizant of ongoing macroeconomic uncertainty, and you can expect that we will continue to manage the business as we always have, in a nimble fashion to deliver profitable growth and extend our leadership in the fine jewelry industry. And now, I'll turn it over to Jeff.\n\nJeff Kuo -- Chief Financial Officer\n\nThanks, Beth, and good afternoon, everyone. We are pleased to share our second quarter fiscal 2022 results with you today. During the quarter, we continued to execute our mission-driven growth strategy focused on scaling our business and building our brands to be the jeweler for the next-generation consumer, while simultaneously delivering strong, profitable growth. Our second quarter results demonstrate the disciplined execution of our approach.\n\nRevenue grew to $108.8 million, which represents 18% year-over-year growth and up 31% on a three-year CAGR compared to Q2 2019. Gross margin expanded to 53.1%, a 460-basis-point increase compared to Q2 2021 and our highest quarterly gross margin percentage on record. And adjusted EBITDA was $9.6 million or 9% of revenue. These results again illustrate and reinforce the power and distinction of our brand, growth across our product lines and our agile, highly efficient business model.\n\nQ2 revenue grew 18% year over year, which was consistent with our expectations in Q2's rapidly changing macroeconomic environment. This was driven by new and repeat customers, reflecting the increasing strength and awareness of Brilliant Earth, which led to growth across our product lines. We continue to see outsized performance within our fine jewelry assortment with growth that far outpaces the business as a whole. Wedding band sales were also particularly strong in Q2 this year as the strength of our product assortment and historically robust year of the wedding fueled sales.\n\nThe outperformance of fine jewelry and wedding bands led to a mid-single-digit percentage decline in our total company blended AOV for Q2, as both fine jewelry and wedding bands have a lower average price point than our overall business. As Beth mentioned, we recently opened our 21st showroom reflecting the ongoing successful execution of our omnichannel growth strategy. As we have shared in the past, our showroom strategy continues to perform well. In addition to providing customers with even greater access to our unique and joyful shopping experience, our showrooms continue to generate robust uplift in metro bookings after opening.\n\nAs we look ahead to expanding our showroom presence in additional cities, we will continue to do so with a sharp focus on delivering strong ROI. Consistent with the plans we shared since our public offering almost one year ago, we see tremendous opportunities for our business to grow and for our brand to lead in the highly fragmented jewelry industry. Our showroom rollout and further expansion into fine jewelry, both show encouraging results in driving financial performance, customer loyalty and lifetime value. Turning to gross margin.\n\nQ2 gross margin expanded to 53.1%, which is up 460 basis points versus the prior year. Growing demand for the Brilliant Earth brands, our premium and differentiated product offerings, pricing engine optimization and procurement efficiencies once again drove strong gross margin expansion across our product assortment. As I said last quarter, what we hope will become a well-understood refrain from us is that these results illustrate how our asset-light, data-driven business model is a competitive and financial advantage. It enables us to nimbly adapt our supply chain and product pricing to changing market conditions to optimize both margin and revenue.  This is particularly evident for us in Q2, a period that, as we all know, saw significant macroeconomic volatility.\n\nOur strong gross margin performance is a testament to the strength of our model and our brand. And this quarter, it afforded us the flexibility to continue to invest in prudently scaling the business. In the second quarter, SG&A increased to 47.9% of net sales, compared to 35.1% of net sales in Q2 2021, an increase of 1,280 basis points. Approximately 130 basis points of this increase was related to net changes in add-backs to adjusted EBITDA, including equity-based compensation and new showroom preopening expenses, which are added back in our presentation of adjusted EBITDA.\n\nThe remaining approximately 1150-basis-point increase over the prior year reflects investments we've made to support our growth. Marketing costs as a percentage of sales grew by approximately 400 basis points year over year. Our investments in building the Brilliant Earth brand continue to drive growing awareness of the unique and differentiated Brilliant Earth experience and expand market share. In addition, we are continuing to invest in our fine jewelry assortment which we see as a significant growth opportunity.\n\nDuring the quarter, employee costs were higher by approximately 390 basis points year over year. Consistent with the drivers from last quarter, Q2 2021, again, represented a low comp for employee costs as we were coming out of the initial months of the COVID pandemic, with employee costs at a comparatively low run rate in Q2 2021. In Q2 2022, we continue to build our team to support our strategic initiatives, new showrooms and operations as a public company. Other G&A as a percentage of sales increased by approximately 360 bps, with one of the largest drivers being increased public company operating costs, which, as you know, we will not anniversary until late Q3 and Q4 2022.\n\nAs a growth company, we are also strategically investing in scaling Brilliant Earth for the long term. The combination of strong revenue and gross margin growth, balanced by strategic investments in the business delivered $9.6 million in adjusted EBITDA in the second quarter. Profitability, positive free cash flow and a capital-efficient operating model continue to differentiate us among direct-to-consumer companies, and we continue to operate the business in an asset-light fashion. We ended the second quarter with $155.5 million in cash.\n\nAs we look ahead to the balance of the year, we remain confident in our long-term growth goals. As you may recall, our aim over the long term is to see revenue growth in the high 20s to low 30% range, with growth across our product lines and our omnichannel model. Our long-term gross margin target is in the mid-50% range, driven by our premium products and brands, our price optimization engine, procurement efficiencies and growth of higher-margin fine jewelry. Our long-term marketing spend target is in the mid- to high teens as a percentage of revenue as we continue to grow our brand awareness and to roll out our showroom experiences to drive conversion and repeat customer behavior.\n\nAnd we are targeting a 15% to 20%-plus long-term adjusted EBITDA margin, driven by several factors: gross margin expansion, improved effectiveness of our marketing spend, and leverage in our G&A expenses. As I said last quarter, these long-term targets guide our approach as we also navigate the ebbs and flows of a dynamic market. For the balance of the year, we remain confident in our ability to deliver on the full year 2022 outlook we established last quarter. We continue to expect net sales in a projected range of $450 million to $470 million.\n\nThis represents 18% to 24% growth versus fiscal year 2021 and a three-year CAGR of 31% to 33%. We also expect continuing year-over-year improvement in our gross margin. However, the rate of year-over-year gross margin growth is expected to moderate from the first half of the year as we begin to anniversary improved gross margins from last year. We also anticipate continuing to make prudent investments and allocating spending across areas of the business that generate a strong ROI, consistent with our goal to deliver long-term sustainable, profitable growth.\n\nAs a result, we continue to expect adjusted EBITDA for the year to be $30 million to $40 million, or an approximately 7% to 9% adjusted EBITDA margin. Historically, we have seen slightly higher year-over-year growth rates in Q4 than in Q3, and we expect a similar pattern this year -- an important contributor is the strong outperformance we've seen in fine jewelry and that historically, fine jewelry sales are the highest in Q4. Additionally, we will have a greater number of showrooms opened in Q4 as we continue our successful rollout of new showrooms. In closing, we are pleased with our results this quarter.\n\nWe remain focused on executing our initiatives to build and scale our business and brand and to deliver long-term, sustainable, profitable growth for our shareholders. With that, we'll be happy to take your questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Thomas Nass with Cowen. Your line is now open.\n\nThomas Nass -- Cowen and Company -- Analyst\n\nHi. Thank you. the gross margins were really impressive. Would love your thoughts on pricing optimization opportunities in the back half and what you see there, as well as inflation and cost of goods sold and materials, if that's a factor as you think about your own pricing strategies, as well as cost of goods sold.\n\nThank you.\n\nBeth Gerstein -- Chief Executive Officer\n\nI can start that off. We were really pleased by our gross margin expansion. And as a data-driven company, we're always looking at opportunities to be able to maximize the benefit of our premium brand, as well as the exclusive and unique product offering that we have. And both of these are important to driving our strong margins.\n\nAnother thing to consider is we're not a discount-oriented brand. And so, that also, I think, plays a role in how we're able to take advantage of the premium positioning that we have. In terms of our overall inflationary environment, Jeff, maybe you can speak a little bit more to that, as well as our optimization engine.\n\nJeff Kuo -- Chief Financial Officer\n\nSure. So unlike other retailers. We haven't -- we've been fortunate that we haven't seen broad-based inflation pressure. For example, gold and platinum prices have recently come down a bit.\n\nAnd so, that's something that we haven't seen. As you know, we do have our pricing optimization engine, as well as a light asset -- an asset-light model that allows us to adapt very nimbly to changing conditions. And so, we've been able to manage that. You see that in the results that we've delivered with our strong gross margin, and we believe that we continue to have opportunities to optimize, as well as take actions like optimize on procurement efficiencies and as we have done in the past.\n\nAnd so, I think that's something that we do see a lot of continued strength for us in our gross margins.\n\nThomas Nass -- Cowen and Company -- Analyst\n\nThank you.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThis is Oliver Chen, by the way, from Cowen. On the revenue growth, it's potentially conservative on the guidance. Would love your thoughts on what you're seeing with upside drivers or downside drivers and how that may relate to marketing efficiency. We are seeing different things across the sector where digital marketing efficiency has been volatile.\n\nThank you.\n\nBeth Gerstein -- Chief Executive Officer\n\nYeah, I would say kind of starting from the overall revenue growth, we continue to see strong demand and the performance that we have has remained consistent. So while they're going to be some fluctuations, we're confident in our ability to deliver on our full year guidance. As it relates to how we think about our marketing efforts, the digital environment, we do recognize it's very dynamic, it's highly competitive. And as such, our costs have increased in certain areas.\n\nThat said, our marketing spend remains efficient, and we continue to drive profitable growth. We are continuing to also look at opportunities to be able to invest in marketing to support our strategic initiatives. So investing in brand building for us is incredibly important to be able to drive awareness to continue to take market share. Word of mouth for us is a big sales contributor.\n\nSo it's really important for us to invest here, and we've seen those investments paying off. We are also continuing to invest in line jewelry. This is a category that has massive potential, and as we're investing, we are also seeing some strong results there as well. So we'll continue to keep a strong eye toward maximizing ROI.\n\nBut really, thoughtful about our approach to maximizing revenue and profitability.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nVery helpful. Best regards. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Dana Telsey with Telsey Advisory Group. Your line is now open.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGood afternoon, everyone, and congratulations on the results. Wanted to get some more color on fine jewelry and wedding bands given the strength that you saw there, how you're projecting that going forward in regards to the AOV. And then I believe last time that, you mentioned that the consumer was taking a longer time to make their decisions given the environment. What are you seeing now? Has that changed? And has it changed at all by category? Thank you.\n\nBeth Gerstein -- Chief Executive Officer\n\nHi, Dana, thanks for your questions. Starting with the consumer and the overall behavior there. As I mentioned, the performance is relatively consistent. As it relates to bridal, while bridal has moderated slightly, it does continue to experience strong growth.\n\nWe continue to gain share. We recognize that an engagement ring is a higher price point, a more considered purchase, so it's not surprising to us that it's taking a bit longer for them to make these purchases. But overall, I would say that generally, we're seeing consistent performance. As it relates to fine jewelry, we're really excited about our opportunity there.\n\nGrowth is far outpacing the business, and we're really well-positioned for the upcoming holiday season. So see this being a nice growth driver, especially as we're entering Q4 being a premium gift giving occasion, just like we saw with Mother's Day being a real strong performance for us. So I think that's going to be a nice tailwind for us. We are continuing to invest in marketing, in our assortments, in the digital experience in creative imagery, a lot of, I think, important investments there that are really helping to drive that category.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGot it. And the impact on gross margin from the increased fine jewelry, how do you see that go forward?\n\nBeth Gerstein -- Chief Executive Officer\n\nJeff, do you want to take that one?\n\nJeff Kuo -- Chief Financial Officer\n\nSure. You think there's significant gross margin expansion potential in fine jewelry, fine jewelry is a strong gross margin part of the business, and it's growing quickly. So that, we see as it becomes a bigger and bigger part of our mix, and we gain scale efficiencies in that area of the business, we see there's opportunities to grow our margin there in addition to some of the other initiatives and levers that we've been able to pull historically.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Matthew Boss with J.P. Morgan. Your line is now open.\n\nMatt Boss -- J.P. Morgan -- Analyst\n\nGreat. Thanks. So Beth, could you expand on the excitement that you cited regarding the second half of the year? Any specific categories or product assortment launches you see as drivers of momentum in the back half? And maybe specifically, could you speak to the progression of demand trends that you've seen from the initial moderation in April through early August?\n\nBeth Gerstein -- Chief Executive Officer\n\nYeah, absolutely. Thanks, Matt. In terms of the progression of demand, as I mentioned, there's some fluctuations. But for the most part, it has been consistent for us.\n\nDemand continues to be strong. And so, we're excited to be able to capitalize on the resonance that we've had with our customer base. And as it relates to the second half, we have, I think, a very compelling product offering, both in really across our product portfolio. I think, you know we take a very data-driven and thoughtful approach to expanding our assortment, and that's been very successful.\n\nWe see success in our personalized offerings. For example, in our Zodiac collection. We see strength in the offerings that really reinforce our mission positioning like our Fairmined gold collection. And we're continuing to remind the customer that this is a premium product with collections like our Truly Brilliant collection.\n\nAnd I think, we have a lot of success that we've been demonstrating. And I'm really excited, especially as we're opening new showrooms and reaching more and more customers that we're seeing such strong results.\n\nMatt Boss -- J.P. Morgan -- Analyst\n\nGreat. And then, Jeff, could you speak to comfort with your current inventory position exiting the quarter? Or just help break down the composition of the build into the back half of the year.\n\nJeff Kuo -- Chief Financial Officer\n\nYeah, thanks, Matt. So as you know, we operate the business very facet-efficient way. And I think, maybe just maybe providing a little bit of context and how we see that for the latter part of the year. We operate a really technology-enabled and data-driven supply chain with tight integrations with our suppliers that we've worked with for many years.\n\nAnd what that really allows us to do is to closely manage our working capital and inventory levels as we grow. And like if you look at it in ways such as our inventory that we have on a per showroom level is very efficient relative to the industry as a whole. We also manage our fine jewelry inventory in a very efficient way. So I think, the overall approach that we take is to really have a lot of insight into the trends, insight into our supply chain, manage things tightly, and we expect that will continue to be the case in the upcoming quarters.\n\nMatt Boss -- J.P. Morgan -- Analyst\n\nBest of luck. Thanks.\n\nBeth Gerstein -- Chief Executive Officer\n\nThanks, Matt.\n\nOperator\n\nThank you. Our next question comes from the line of Edward Yruma with Piper Sandler. Your line is now open.\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nHey, guys, thanks for taking the question. I guess, just on gross margin, obviously, nice continued benefits from pricing optimization. As you think about the go-forward benefit, I know you indicated the comparisons get more difficult, but how should we kind of think about where you are in that evolution with the pricing engine and how much more incremental benefit is still possible?\n\nJeff Kuo -- Chief Financial Officer\n\nSure. We think that there continues to be room to run with the pricing engine. I think, this really starts just to set the context from the premium brand, premium differentiated proprietary products that we have that allow us to have that premium gross margin. That's something that we continue to invest in.\n\nWith the pricing engine, we've talked through our longer-term target of mid-50s in terms of gross margin. We continue to pull levers as we've talked about with pricing engine, procurement efficiency. And as we get more data, we input that into our algorithms, and we continue to refine. So it's a living approach to how we continue to optimize margin.\n\nSo we believe that there continues to be a lot of room to run with that.\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nGreat. And a follow-up, if I may. Good to hear the success on fine jewelry. I guess, when you're finding a customer that comes into fine jewelry.\n\nAre they generally someone that's purchased engagement before and this is a follow-up purchase? Or is fine jewelry successful in kind of introducing people to the brand? Thank you.\n\nBeth Gerstein -- Chief Executive Officer\n\nYeah, I would say both actually. We are seeing a lot of success in customers that are already loyal to Brilliant Earth customers, perhaps they've come into a showroom and they already have a really strong connection. And we're also seeing new customers come in, which I think is also really exciting that we're expanding our customer base. So really seeing, I think, strong results also with self-purchasers in addition to gifting.\n\nAnd so, I think, our efforts are really successful there.\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nThanks so much.\n\nOperator\n\nThank you. Our next question comes from Noah Zatzkin with KeyBanc. Your line is now open.\n\nNoah Zatzkin -- KeyBanc Capital Markets -- Analyst\n\nThat's been a great quarter, and thanks for taking my question. Just on the showroom rollout. I think, you'll be adding about nine more in the second half, if I'm thinking about that correctly. Can you remind us how you think about the timing and the P&L impact from showrooms as they roll out?\n\nBeth Gerstein -- Chief Executive Officer\n\nI can start that off. We talked a little bit about how we're planning on doubling the number of showrooms. We are really excited about the metros and how well they've been performing, as well as the upcoming ones that are on our road map. There are some timing fluctuations just based on things that are out of our control like permitting, for example.\n\nSo we haven't been very specific about how the rest are going to roll out.\n\nNoah Zatzkin -- KeyBanc Capital Markets -- Analyst\n\nThank you. And then, just quickly on the Truly Brilliant Collection, as well as Moissanite, just any color on trends there and how you're thinking about both of those opportunities over time. Thank you.\n\nBeth Gerstein -- Chief Executive Officer\n\nYeah, so Truly Brilliant is a newer collection for us, and we think that this is really nicely targeting for that discerning customer who is looking for premium characteristics, both in terms of our blockchain-enabled natural diamonds, it uses renewable energy for a lab created. So a lot of, I think, really exciting premium sustainability, as well as quality characteristics. So we're expecting, I think, a really strong reception, but I would say it's early in terms of what we've seen there. And then, as it relates to Moissanite, want remains a nice alternative for customers in terms of an engagement ring.\n\nSo continue to see strength in the overall category.  But we usually don't get too granular as it relates to subcategories.\n\nNoah Zatzkin -- KeyBanc Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Randal Konik with Jefferies. Your line is now open.\n\nRandy Konik -- Jefferies -- Analyst\n\nThanks a lot. I just want to go back to the fine jewelry kind of strategy. Can you give us some perspective on how we should be thinking about the SKU count or kind of that you're offering to the consumer, I guess, on the website and in-store, and how we should be thinking about how that kind of evolves over the next 12 to 24 months? Like how is that going to kind of be illustrated, how much of it is the consumer going to see and so on and so forth. Just want to get an understanding there.\n\nAnd then, how do you change -- or how much will this change the inventory kind of needs on the balance sheet if -- probably not in a big way, but just how should we be expecting that to kind of change the inventory model going forward? Thanks, guys.\n\nBeth Gerstein -- Chief Executive Officer\n\nGreat. So in terms of how we think about SKU count, we're really looking at productivity across different assortments to make sure that as we're introducing new products, we're continuing to see that productivity level remain strong. And that's what we've seen so far as we've been introducing our assortment and increasing the number of SKUs, we're seeing very strong performance. So I would say, like as we think about 12 to 24 months out, we're really taking a very dynamic approach there.\n\nWe are also taking approach that is more curated. So our approach is not to introduce an incredibly wide selection at all cost, it's really to take a more design-driven tailored approach, which is more curated. And as we see that productivity, we'll continue to be thoughtful about how we drive that increased SKU count. Jeff, do you want to talk a little bit about the inventory model?\n\nJeff Kuo -- Chief Financial Officer\n\nYeah, sure. Thanks, Randy. We are well-positioned to manage our inventory efficiently. As we expand into fine jewelry, I talked earlier about how we really take a data and technology-driven approach and integrate tightly with our suppliers.\n\nAnd it's really in our DNA to operate in an asset-light fashion. I think, just also the way that we operate is just efficient, in that if you look at a traditional jeweler, they might need to bring in thousands of pieces of a given SKU just to get something started and to have something in every single location. We operate in a different way where we can test and learn, start with limited allocations of inventory, see what's doing well, again, use that data to see where we want to make those investments in inventory. And so, I think, we're well-positioned to continue to have an efficient and capital-light model.\n\nBeth Gerstein -- Chief Executive Officer\n\nI think, one thing I would just add is we also have the ability to rapidly introduce new products. And I think that's a real competitive advantage for us as we're seeing strength in the assortment to be able to expand on what we're seeing as trends in the marketplace very quickly.\n\nRandy Konik -- Jefferies -- Analyst\n\nGot it. Very helpful. And then, lastly, you've done a great job with the gross margin, and part of that is due to the fine jewelry penetration. Any kind of color you can kind of give us on just where we are with fine jewelry penetration today where we might think it might be two years from now and where you're two years from now and where you might want to be five years from now, just to give people some kind of thought process on how that penetration kind of grows long term because it's, obviously, a nicely margin accretive opportunity for you guys.\n\nJust curious there. Any color numerically or just qualitatively you can provide us would be great. Thanks, guys.\n\nBeth Gerstein -- Chief Executive Officer\n\nI think, just on a qualitative standpoint, it's still quite small for us. And if you look at most and jewelry representing the majority of their sales, that's really, I think, what we're targeting in the future. So while we're not providing specific numbers, we do have, I think, a lot of investment in this area and are trying to accelerate to the extent that we're able to do it in a profitable way.\n\nRandy Konik -- Jefferies -- Analyst\n\nUnderstood. Thanks, guys.\n\nOperator\n\nThank you. Our next question comes from the line of Rick Patel with Raymond James. Your line is now open.\n\nRick Patel -- Raymond James -- Analyst\n\nGood afternoon, and congrats on the strong results. Can you help us understand what you're seeing in the industry in terms of independent jewelers closing doors. I think, typically, when the economy hit a soft patch, the number of mom-and-pop jewelers tends to shrink. I'm hoping you could frame what you're seeing and to what extent you see that as a revenue and market share opportunity in the back half and beyond.\n\nBeth Gerstein -- Chief Executive Officer\n\nYeah, I think, the recent numbers that I have seen do indicate that there's an acceleration there in terms of independents closing doors, Typically, there is a bit of a lag -- so I think that's what we've seen in previous more challenging times, and I think that you're right on to think of the fact that we're probably going to see increased consolidation more generally. As it relates to the opportunity, we continue to see this highly fragmented industry as ripe for disruption. And we think we offer tremendous value relative to the independent jeweler. We have strong supplier relationships, our mission-driven values and the resonance that our brand has, I think, is very compelling.\n\nSo we think we're definitely poised to be leaders here and really take advantage of some of the dynamics that we see in the industry.\n\nRick Patel -- Raymond James -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you. Our next question comes from the line of Oliver Chen with Cowen. Your line is now open.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nHey, thanks for taking my question. You're positioning Brilliant Earth with being premium and branded and mission focus is quite differentiated. Would love to hear your thoughts as the industry consolidates a little bit and your positioning relative to other competitors such as Blue Nile, how would you say about [Inaudible] are you most different? Thank you.\n\nBeth Gerstein -- Chief Executive Officer\n\nWell, while we're not going to comment specifically on one particular competitor, we think that we are very differentiated in the industry. As you mentioned, our premium positioning, we don't have a discount orientation. We really invest in providing a luxury distinguished experience for the customer overall. The mission behind, really, everything that we do is really important for us as a company, the same way is that it's important for our customers.\n\nI think that the products that we offer are also very distinctive. We are constantly introducing new trend-driven collections, and those resonate as well with our customer base. So we're really very focused on our own strategy and how we can resonate with the millennial and Gen Z audience and are seeing great success there.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThanks, Beth. Lastly, it's Oliver Chen from Cowen and Company. The supply chain, what are your thoughts on vertical integration or the future, and what may evolve, especially as you continue to make such encouraging progress in fine. I would love your thoughts.\n\nBeth Gerstein -- Chief Executive Officer\n\nWe don't have any immediate plans there. I think, we have a really attractive model as it relates to our inventory light, capital-efficient a more agile, flexible model. That's not to say we won't be opportunistic as we see opportunities to continue to drive an improved customer experience and to lower costs, but do recognize that there are trade-offs as it relates to inventory there. So I think, we're comfortable with our current model and feel really good about the supply chain partners that we've had.\n\nThey're very long term. And I think, we see a lot of benefit in terms of those long-term relationships.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nOK. And last question. On the consumer, the consumer has become much more considered and kind of disappointed in some ways. What are your thoughts about what's happening going forward with the health of the consumer, given the cross currents of low unemployment yet the obvious pressures of high inflation.\n\nBeth Gerstein -- Chief Executive Officer\n\nWell, I don't think we necessarily have the crystal ball there. What we can say is that bridal is typically quite recession resilient overall as a category. The consumer continues to drive strong demand for our products as it relates to fine jewelry and other categories. So overall, I think, even though there have been some macroeconomic headwinds there, we're continuing to perform really well.\n\nOperator\n\nThis concludes the question-and-answer session. I would now like to turn the call back over to Beth Gerstein for closing remarks.\n\nBeth Gerstein -- Chief Executive Officer\n\nGreat. I appreciate everyone's participation, and we look forward to talking to you in the next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAllison Malkin -- Investor Relations\n\nBeth Gerstein -- Chief Executive Officer\n\nJeff Kuo -- Chief Financial Officer\n\nThomas Nass -- Cowen and Company -- Analyst\n\nOliver Chen -- Cowen and Company -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nMatt Boss -- J.P. Morgan -- Analyst\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nNoah Zatzkin -- KeyBanc Capital Markets -- Analyst\n\nRandy Konik -- Jefferies -- Analyst\n\nRick Patel -- Raymond James -- Analyst\n\nMore BRLT analysis\n\nAll earnings call transcripts"
}