{
  "companyName": "Clear Secure, Inc.",
  "companyTicker": "YOU",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/clear-secure-inc-you-q2-2022-earnings-call-transcr/",
  "content": "Clear Secure, Inc. (YOU -0.15%)\nQ2 2022 Earnings Call\nAug 15, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the CLEAR second quarter 2022 earnings conference call. We have us here with us today, Ms. co-founder, chairman, and chief executive officer, co-founder, chairman, and chief executive officer; Ken Cornick, co-founder, president and chief financial officer. [Operator instructions] I would also like to remind you that today's discussion will contain forward-looking statements relating to future events and expectations.\n\nYou can find factors that could cause the company's actual results to differ materially from these projections in our most recent SEC filings. In addition, we've included some non-GAAP financial measures in our discussion. Reconciliations to the most directly comparable GAAP financial measures can be found in today's 8-K. With that, I'll turn the call over to Caryn Seidman-Becker, co-founder, chairman, and chief executive officer.\n\nCaryn?\n\nCaryn Seidman-Becker -- Co-Founder, Chairman, and Chief Executive Officer\n\nHello, and welcome to our second quarter 2022 earnings call. We were certainly expecting a very busy summer travel season, which we at CLEAR had termed Travelpalooza. Needless to say, the global secular demand for travel, combined with the significant industry challenges, have exceeded our already high expectations. This travel environment has highlighted the imperative for future facing innovations and collaboration among all stakeholders to ensure travelers have the frictionless experience they rightfully deserve and enjoy in so many other settings.\n\nWe are laser-focused and deeply committed to accelerating our network expansion, partnerships, and innovation around new products to help travelers navigate an increasingly difficult global travel environment. We at CLEAR spend each day envisioning and creating safer and easier travel experiences. When we say transforming the journey from home to gate, we mean it. From stepping out of your front door to reaching your final destination, it is just too hard today.\n\nFear is on the side of the traveler and obsessed with making the journey better. Our results continue to be fueled by our strong network and our evidence of the power of the network effect we spoke about in our shareholder letter. As we've continued to add new nodes, the value proposition increases exponentially. In the second quarter, we experienced strong bookings growth of over 75%.\n\nSome of our earliest markets opened over a decade ago are among the fastest growing in our network. We were able to fuel our growth in a highly capital efficient manner, reflecting not only the network effect, but the obsession with customer experience, yielding both strong word of mouth and high NPS. New products and innovation will further our network expansion and the continued increase in our total addressable market. We have just launched our new Powered by CLEAR verification SDK, available for mobile web experiences or native mobile application.\n\nThis low-code integration creates a single-app solution for our partners, enabling frictionless experiences for their customers in both digital and physical environment. We are excited to welcome new partners to our network, creating new nodes for our over 13 million existing CLEAR members and ensuring rapid adoption for our partners. Since our IPO, I am pleased with the continued obsession and improvement of our member experience. The growth of our network, new product introductions, and our solid financial performance, and free cash flow generation.\n\nWhat has propelled us at CLEAR and will continue to fuel our innovation, growth, and culture is the strong leadership team we have built. Just this month, we are excited to welcome Nick Peddy as our new chief technology officer. Nick joins us most recently from J.P. Morgan, where he was the CTO of payments for consumer and community banking.\n\nAnd before that, Nick was part of strong engineering cultures at Uber, Capital One, PayPal, and Amazon. Before I turn it over to Ken, a quick comment on the economic climate. These are still early days at CLEAR. And while there is plenty of discussion in the market about a recession, our business has not experienced any evidence of a travel or economic slowdown.\n\nWe have an appropriately aggressive plan in front of us as identity, holistically speaking, and frictionless experiences have never been more important, and we are well-positioned to lead. We are also well-equipped to manage through various economic environments as evidenced by CLEAR's financial performance during the pandemic, when travel declined by almost 100%. Our bookings declined by about 10%, while our margins and free cash flow expanded. I'm excited about the opportunities in front of us.\n\nOur strong free cash flow and balance sheet, which positions us incredibly well in this environment. With that, I will turn the call over to Ken.\n\nKen Cornick -- Co-Founder, President, and Chief Financial Officer\n\nThanks, Caryn. Good morning, everyone. Our financial performance in Q2 was better than we expected with revenue up 86% and bookings up 76%, driven by growth in CLEAR Plus, as well as new platform deals and renewals. As Caryn alluded to, this level of growth is not just about the return to travel post-COVID.\n\nIt's a reflection of CLEAR's significant growth opportunity. Our bookings CAGR for pre-COVID 2019 levels is approximately 30%, with same-store bookings accounting for roughly 80% of this growth. As we discussed on the last two earnings calls, our focus remains on growing members, bookings, and free cash flow. We generated 41 million of free cash flow this quarter, bringing the year-to-date free cash flow to 61 million and last 12 months free cash flow to 114 million.\n\nWe expect to remit the approximately $55 million payable to American Express in the third quarter related to the very successful first year of our Platinum partnership. Even with this outflow, we expect to generate positive free cash flow in the second half of 2022. Excluding the working capital benefit from American Express over the last 12 months, we generated approximately 50 million of free cash flow, which is up over four times the prior-year LTM amount of 11.6 million. Next quarter, once we anniversary the payable to American Express, we'll be speaking more about LTM free cash flow.\n\nWe're also focused on operating leverage. Since inception, we have been methodical about expense growth, and we embody a scrapping-at-scale culture. As previewed in our Q4 21 earnings letter, year-over-year operating expense growth will continue to moderate as we progress through 2022. In the quarter, total opex grew less than 25%, roughly a third our revenue growth rate, driving significant margin expansion.\n\nAdjusted EBITDA turned positive in Q2 and is now positive on a year-to-date basis. In addition, adjusted net income turned slightly positive in the quarter. We reported 94.3% net member retention in the quarter, which was higher than our expectations and remains above our long-term expectations of the upper 80s. In our quarterly letter, we included some additional detail on underlying drivers of our net retention metrics.\n\nSpecifically, as utilization has grown with our network, retention levels for newer cohorts of members continue to improve. We see that in our retention curves which have shifted up into the right. This should provide a healthy tailwind to retention over time, which we now expect to settle above pre-COVID levels. Our cash equivalents balance as of June 30th was 703 million.\n\nAs mentioned, we expect to generate additional free cash flow in the back half. Our Q3 guidance expects GAAP revenue of $111 million to $113 million and total bookings of $128 million to $132 million, excluding any contribution from TSA PreCheck. We're making good progress in our launch timeline, and we do expect a Q4 launch. We will now go to Q&A.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Dana Telsey with Telsey Advisory Group. Please proceed with your question.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGood morning, everyone, and congratulations on the nice results. I'd like to word Caryn of the Travelpalooza. And can you expand upon how you're thinking about the Travelpalooza going forward, potentially into the third and fourth quarter, and what you're seeing on the cohorts of the membership retention? It certainly seems like the year one retention is going very nicely. Any other qualitative thoughts on other -- of the other years' membership and their retention? And then just lastly, on American Express and on TSA PreCheck, any updates there? Thank you.\n\nCaryn Seidman-Becker -- Co-Founder, Chairman, and Chief Executive Officer\n\nHi, Dana. So, I'll take the Travelpalooza concept, and then I'll turn it over to Ken on retention and PreCheck timing and AmEx. You know, as I said in in my words at the beginning, we continue to see very strong travel trends and expect them to continue for CLEAR because these are still early days. We are opening new airports, right, which drives new enrollment and drives retention and utilization.\n\nWe're launching new products. And I think it's really important, never had a frictionless experience, been more valuable to travelers. All you have to do is turn on any TV station or, you know, online streaming to see how challenged the travel experience is and how people expect the predictable experience they have in other settings to happen in airports or in travel in general. And that's what we're really focused on.\n\nSo, whether it be Home to Gate, whether it be our announced partnership with Uber, whether it be our reserve products, whether it be, what, you know, some new products that we're testing in the market that have been written about, we're on the side of the traveler and really obsessed with their experience from the time they leave their house to the time they board their plane. And I think that's deeply valuable. So, we continue to see great strength in CLEAR and the opportunities in front of us.\n\nKen Cornick -- Co-Founder, President, and Chief Financial Officer\n\nSo I'll start with PreCheck. PreCheck is -- you know, we're progressing on the launch timeline very nicely. We still expect a Q4 launch. And we're gearing up marketing and ops to support that.\n\nOn the AmEx piece, I don't know if you had a specific question, but as we sort of alluded to in the commentary, we were very pleased with the year one performance of the Amex partnership. We'll be remitting the $65 million, as we called out, in the free cash flow area of our of our letter. And we think there's a lot of opportunity on this AmEx partnership for continued growth, not only on the Platinum side, but, you know, potentially adding other card portfolios within that family. Retention.\n\nLook, we wanted to give some additional detail in some of the drivers behind, you know, the KPI that we report, the net member retention number. And we are very pleased with how the cohorts are progressing. Typically, you see that, you know, most companies would see a degradation over time and the quality of the joins, but we see the opposite. And we're really focused on, you know, the LTV and the LTV to CAC.\n\nAnd, you know, the younger cohorts are actually performing better than our older cohorts, and that's really attributable, we think, to the network effect and the utilization.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Paul Chang with JPMorgan. Please proceed with your question.\n\nPaul Chang -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks for taking my question. So, just on bookings strength, could you kind of expand on any pricing uplift there? I know you did some price increases. And where are you seeing, you know, new enrollment momentum? Any comments on particular regions? And then are there any kind of card programs or airline partnerships you should be thinking about over the next six to 12 months? And I have one follow-up.\n\nKen Cornick -- Co-Founder, President, and Chief Financial Officer\n\nSure. So, in terms of the bookings strength, it really is fairly broad-based. And certainly, the pricing that we took in Q2 went through successfully and is a contributor to the growth. But if you recall, we raised prices for new members only, not existing.\n\nWe grandfathered existing members in. And so, you know, it is a small contributor to the bookings growth and, but not all of it is fairly broad-based from a geography perspective. I would echo that comment as really broad-based as well.\n\nCaryn Seidman-Becker -- Co-Founder, Chairman, and Chief Executive Officer\n\nThe only thing I would add to that, Paul, is that you are starting to see strength on the coasts. And so, that's something we had commented on earlier in the year was coastal weakness, if you will, between international travel and business travel, and you are starting to see strength there. So, I think that's important to think about as travel comes back, both on the leisure side, but then as well as the business and international side, which have obviously been very slow to rebound.\n\nPaul Chang -- JPMorgan Chase and Company -- Analyst\n\nGotcha. And then my follow-up, you know, free cash flow has been excellent. It's already exceeding all of, you know, 2021, and it's mostly on bookings growth. But anything else you want to point out there? You mentioned the 65 million going out in 3Q.\n\nBut as we look beyond 3Q, how do we think about kind of the normalized pace of free cash flow? And does that cash outflow kind of occur every year in 3Q, or is it kind of more spread out in smaller magnitude as well? Just any comments there as we think about modeling next year.\n\nKen Cornick -- Co-Founder, President, and Chief Financial Officer\n\nYeah, with respect to the cash outflow, that'll be every year in Q3 for Platinum. In terms of the free cash flow profile of the company, you know, a couple of things to point out. Number one is, as we've sort of repeated every quarter, there is a discrepancy between GAAP and bookings, so cash and GAAP lag behind bookings as we grow the business. And so, that is, you know, a main contributor to the free cash flow generation relative to the GAAP financial metric.\n\nBut I would also point out, you know, we are hyper-focused on capital efficiency in a very capital-efficient business. And, you know, we expect that to continue as just the feature of the business.\n\nCaryn Seidman-Becker -- Co-Founder, Chairman, and Chief Executive Officer\n\nI think it's also a feature of our culture and who we are. So, when you look at the, you know, the IPO letter that we wrote, we talked about it. It's how we've grown up. It's how we've built the business that we believe you can have growth and free cash flow and can talk about a scrapping-at-scale culture that's embedded through our now over 3,000 team members around the world.\n\nAnd so, it's a great business. And I think we have very strong leaders who are focused on economic efficiency, as well as investing appropriately in the business. And now, 13 years into this, that's what we've done from the beginning.\n\nPaul Chang -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thank you.\n\nKen Cornick -- Co-Founder, President, and Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Michael Turrin with Wells Fargo Securities. Please proceed with your question.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\n[Audio gap] where we're modeling. It looks like it calls for continued 30% growth as a baseline. You mentioned the rebound in summer travel you're seeing. Anything you can add just around how to think about or how we should think about normalized growth for the business and some of the drivers there as we maybe reach a point where some of the bigger spikes and ebbs and flows we've seen over the prior periods start to settle a bit here?\n\nKen Cornick -- Co-Founder, President, and Chief Financial Officer\n\nWe missed the first part of your question, but I think the gist of it -- I think we got the gist of it, which is the normalized growth rate over time. And, you know, we're not guiding to long-term growth rates, but we did point out -- you know, we wanted to highlight the CAGR of the business in 2019 just to show you this is not just about the travel rebound. This is a strong, you know, secular grower. And we're not going to, you know, give you guidance specifically on the long-term growth rate.\n\nBut we did want to point out the CAGR in 2019 as many companies are doing in this environment.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nSure. No, I mean, I think the CAGR is helpful just for us in trying to model just some of the subtle impacts it could play through. Maybe just one more, Ken, if you could just remind investors the relation between free cash flow and EBITDA. Clearly, we saw the bigger spike to 40% margin on free cash flow this quarter.\n\nAnything for us to be mindful of just between -- in the relation between those two metrics and thinking through the trajectory there?\n\nKen Cornick -- Co-Founder, President, and Chief Financial Officer\n\nSure. So, as a reminder so with the subscription business, since we're an annual biller, we have GAAP revenue which lags behind our cash receipts. If a member pays us $189 today, that's a booking of $189. The GAAP implication of that gets amortized or deferred over the 12-month period of the subscription.\n\nAnd so, that's why you see, you know, free cash flow exceed the GAAP metrics. Adjusted EBITDA, while not a GAAP metric in and of itself, is based on GAAP revenue. And most -- basically, all of our costs, cash and GAAP are the same. So, we recognize all the costs upfront cash and GAAP while the revenues are deferred.\n\nAnd that's why the adjusted EBITDA, again, is based on GAAP revenue and our free cash flow is in excess. And in terms of, you know, capex, we're fairly a capital-efficient business. And so, over time, as GAAP catches up to two bookings, those would converge. But since we're, you know, growing today, that is -- there is that lag.\n\nAnd therefore, free cash flow is higher than the GAAP metrics.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Brian Essex with Goldman Sachs. Please proceed with your question.\n\nBrian Essex -- Goldman Sachs -- Analyst\n\nHi. Good morning, and thank you for taking the question. Maybe, you know, for Ken or Caryn, can we get a sense of -- given the enrollment growth that we've seen on the platform, I mean, across the company, can you give us a sense what conversion rates might be in the non airline business and how that's driving kind of the kind of robust growth you're seeing in the enrollment lines? So, you know, if you go to a conference or something and you're downloading the app and you're getting that, you know, participants' information. How are those conversion rates? And how do you see the trajectory of, you know, paying enrollments going forward based on that trajectory?\n\nKen Cornick -- Co-Founder, President, and Chief Financial Officer\n\nYeah. So, you're referring to the upgrade rate from the platform to CLEAR Plus.\n\nBrian Essex -- Goldman Sachs -- Analyst\n\nGot it.\n\nKen Cornick -- Co-Founder, President, and Chief Financial Officer\n\nAnd that is an exciting area for us. And I think we mentioned last call, we haven't done a lot to specifically market to those folks. But we're getting, you know, very strong organic rate rates there, and we think there's a lot of opportunity there. It is a contributor to the growth but not a major contributor yet.\n\nBrian Essex -- Goldman Sachs -- Analyst\n\nGot it. That's very helpful. And then maybe just from a can-expect perspective, as we think about the potential of this platform, you know, the aggregate business together, how should we think about international opportunities both on platform and CLEAR Plus? Is that something that's potentially on the horizon? Or is that, you know, kind of a ways away?\n\nCaryn Seidman-Becker -- Co-Founder, Chairman, and Chief Executive Officer\n\nIt is not a ways away. I would say it's today and on the horizon, in that when we bought Whyline, it was a business that had revenues in Latin America. And so, not only are we expanding the reserve product to other international markets, but that is also bringing platform opportunities to those markets as well. And so, it is, today and on the near horizon, not in the distant future.\n\nAnd areas that we're specifically focused on are really the Americas, so going from Canada down, you know, through South America. as well as some places in Europe\n\nKen Cornick -- Co-Founder, President, and Chief Financial Officer\n\nWestern Europe.\n\nCaryn Seidman-Becker -- Co-Founder, Chairman, and Chief Executive Officer\n\nWestern Europe.\n\nBrian Essex -- Goldman Sachs -- Analyst\n\nAnd is that -- that's super helpful. Is that primarily for platform business? Or is that kind of on the airline side as well?\n\nCaryn Seidman-Becker -- Co-Founder, Chairman, and Chief Executive Officer\n\nSo, you should think about that as the platform business. But reserve is, you know, aviation-focused. It is sooner on the platform in the reserve side than it is on the CLEAR Plus side.\n\nBrian Essex -- Goldman Sachs -- Analyst\n\nGot it. Super helpful. Thank you very much.\n\nKen Cornick -- Co-Founder, President, and Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from the line of Ananda Baruah with Loop Capital Markets. Please proceed with your question.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nYeah. Thanks, guys. Good morning, and thanks for taking the questions. Congrats on the consistent results here.\n\nI guess a few, if I could. To start, Caryn, sort of top of your prepared remarks, you mentioned your sort of ongoing network expansion and new products and features on the horizon. Is there anything there you can share with us or, you know, sort of not specific maybe give us, at least at a higher level, some of the things you have, some of the ways you're thinking about getting at some of this new stuff? And I have a couple of follow-ups.\n\nCaryn Seidman-Becker -- Co-Founder, Chairman, and Chief Executive Officer\n\nSure. So, the new Powered by CLEAR SDK that we talked about, the low-code integration for partners to embed CLEAR technology in their user flow. So, you should think about two parts of the business, right? The travel side of the business and the platform side. I would think of travel as owned and operated.\n\nWhat you see CLEAR Plus lanes or reserve. And then what you think about is the platform, which you'll see partner announcements over time is a single-app solution so that the CLEAR enrollment and verification experience can be embedded in partners' apps. And so, that's really a very powerful product introduction on the platform side and a significant milestone for our company so that the frictionless experience that people have come to expect, partners can bring to their customers. And so, that is a huge unlock for us, number one.\n\nAnd then the other thing that you might have read about, right, is a CLEAR premium pilot going on in Orlando. And so, that's us testing different services, connecting our digital assets like our app or our reserve technology with our physical assets. In this case, it's our ambassadors in airports, to create services, furthering the frictionless experience, where you could go on to the app and ask for an ambassador to come meet you and truly help you go curb to gate. So, those are premium products.\n\nWe have different assets that we can put together in different ways, whether it be for us or for our partners. So, that -- you know, those are just two examples.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nYeah. That's really interesting and helpful. So, for the pilot that's going on in Orlando, is that is that a live pilot? So, you, actually, in Orlando, could do that having investor, would you?\n\nCaryn Seidman-Becker -- Co-Founder, Chairman, and Chief Executive Officer\n\nIt is a live pilot that we are testing.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nInteresting. OK, cool. That's helpful. And, Ken, 80% -- you said there's 80% same-store sales growth embedded in the 30% bookings CAGR.\n\nI think in the past, you've talked about -- in recent past, that you've talked about some of those things that you have done. You guys have done to do that, continue to upgrade the talent. I think you talked about moving some of the stronger general managers around the country to replicate performance. Is there anything incremental that you've been doing over the last 90 days or so that could continue to help catalyze this growth? Are you guys sort of -- I don't want to say set with what you're doing, but is it going to be sort of more of the same? I'm just -- I'm wondering if there's anything that you're doing to continue to lend to the consistent same-store sales volume?\n\nKen Cornick -- Co-Founder, President, and Chief Financial Officer\n\nYeah, we're continuing to refine our hiring practices. We're continuing to refine our training. We're continuing to refine the technology that our ambassadors have, you know, in their app, in their hands to track performance. So, yeah, we continue -- we're at a continuous improvement philosophy and continuing to hire additional, you know, training resources and management resources as we grow the business.\n\nSo, you know, I think it's more of the same but continuing to refine and improve.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nYeah. Improving it across the board. OK. Super helpful.\n\nAnd then last one for me, TSA Pre, thanks for the update. Are you guys thinking any differently about the contribution from TSA Pre than you were doing the IPO process? Or should we generally think of it as being relatively similar?\n\nKen Cornick -- Co-Founder, President, and Chief Financial Officer\n\nYeah, I think it's very consistent with what we've communicated in the past. We think there's a very large opportunity to drive new enrollments for PreCheck, as well as renewals, and no change to our thought process.\n\nCaryn Seidman-Becker -- Co-Founder, Chairman, and Chief Executive Officer\n\nThe only thing I would add to that is, you know, I think many people have enrolled through global entry historically. And I think that those appointments are even harder to come by these days. And so, it might create even a bigger total addressable market for PreCheck enrollment.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nCool. That's helpful. Awesome. Thanks guys.\n\nAppreciate it.\n\nKen Cornick -- Co-Founder, President, and Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. Ladies and gentlemen, that concludes our question-and-answer session. I'll turn the floor back to Caryn for any final comments.\n\nCaryn Seidman-Becker -- Co-Founder, Chairman, and Chief Executive Officer\n\nThank everybody for joining us today. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCaryn Seidman-Becker -- Co-Founder, Chairman, and Chief Executive Officer\n\nKen Cornick -- Co-Founder, President, and Chief Financial Officer\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nPaul Chang -- JPMorgan Chase and Company -- Analyst\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nBrian Essex -- Goldman Sachs -- Analyst\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nMore YOU analysis\n\nAll earnings call transcripts"
}