{
  "companyName": "Frontline",
  "companyTicker": "FRO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/25/frontline-fro-q2-2022-earnings-call-transcript/",
  "content": "Frontline (FRO 0.66%)\nQ2 2022 Earnings Call\nAug 25, 2022, 9:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to a Q2 2022 Frontline Limited earnings conference call. At this time, all the participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session. [Operator instructions] I would now like to turn the conference over to CEO, Lars Barstad.\n\nPlease go ahead, sir.\n\nLars Barstad -- Chief Executive Officer\n\nThank you very much. Good morning, and good afternoon to everyone. Welcome to Frontline's second quarter earnings call. As mentioned in our release, this is the quarter where the LR2s took center stage.\n\nThe market tends to forget that close to a third of our vessel days come from this asset class. We started to see the displacement of Russian crude and products also affecting the Suezmax this year in the second quarter. And finally, the VLCC got a pulse as the second quarter came to an end. Before we get to the Q2 financials and what lies ahead.\n\nLet's have a look at the highlights on Slide 3 and the deck. So in the second quarter Frontline achieved $16,400 per day on LR2, $26,500 per day on our Suezmax fleet, and a very impressive $38,600 per day on our LR2/Aframax fleet. So far in the first quarter of 2022, we have the 73% of our VLCC days of $28,100 per day, 73% of our Suezmax days of the solid $45,000 per day, and 62% of our LR2/Aframax days, at even more impressive for $46,200 per day. All numbers in this table are on a load-to-discharge basis and may be affected by the amount of ballast days we end up having at the end of Q3.\n\nThis is more relevant to the VLCCs that normally tend to go on longer voyages, it occasionally affects Suezmaxes and to a lesser degree LR2. With that, I'll now let Inger take you through the financial highlights.\n\nInger Klemp -- Chief Financial Officer\n\nThanks, Lars. And good morning, and good afternoon, ladies, and gentlemen. Let's then turn to Slide 5, and look at the income statement. This quarter, Frontline achieved total operating revenue of $159 million and an adjusted EBITDA of $98 million.\n\nThe reported net income of $47.1 million, or $0.23 per share, and adjusted net income of $42.5 million, or $0.21 per share in this quarter. On the right-hand side of the slide, we show the adjustments made this quarter, which consist of an $8.9 million gain on derivatives, a $6.1 million share results of associated companies, a $1.3 million amortization of acquired time charters, a $0.8 million gain on an insurance claim, $12 million loss on marketable securities, and $0.4 million loss on termination of leases. The adjusted net income in the second quarter increased by $44.1 million compared with the first quarter. And the increase in interest in net income was driven by an increase in our time charter equivalent earnings due to the high TCE rates in the quarter, but just partially offset by an increase in ship operating expenses of $7.5 million, mainly as a result of higher drydocking costs and other movements in income and expenses.\n\nThen let's take a look at the balance sheet on Slide 6. Total balance sheet numbers have increased with 304 million in the second quarter compared to the first quarter. The balance sheet movements in the quarter are primarily related to taking delivery of the two new buildings of VLCCs, Front Alta and Front Tweed, together with the acquisition of Euronav shares in exchange for Frontline shares in addition to ordinary debt repayments and depreciation. As of June [Inaudible], Frontline had $351 million in cash and cash equivalents, including undrawn amounts under our senior unsecured loan facility, marketable securities, and minimum cash requirements.\n\nLet's turn to take a closer look at Slide 7. Keeping costs down has always been in Frontline's DNA, and core values of the Frontline tax form are keeping it simple and focused, and maintaining lean and efficient management teams. This slide shows that Frontline [Inaudible] on opex, G&A, and interest expense. And this together with our performance of peers on revenues for at least two out of three segments this quarter explains the superior operational performance of Frontline in the second quarter of 2022.\n\nThen, I think we should look at Slide 8. That is the cash for our breakeven cash generation potential slide. We estimate the average cash cost to breakeven rates for the remainder of 2022 of approximately $24,900 per day for the VLCCs, $20,000 per day for the Suezmax tankers, and $17,200 per day for the LR2 tankers. This gives the fleet an average estimate of about $20,700 per day.\n\nThe fleet average estimate includes drydock of six vessels in the remainder of 2022, with an impact of about $530 per day. The distribution of these six vessels is two VLCCs, one Suezmax tanker, and three LR2 tankers. In the second quarter, we recorded opex expenses, including drydock of $8,100 per day for the VLCCs, $10,400 per day for the Suezmax tankers, and $8,400 per day for the LR2 tankers. And in the second quarter, we have drydocked six vessels, four Suezmax tankers, and two LR2 tankers.\n\nThe graph on the right-hand side of this slide shows the free cash flow per share of the debt service and free cash flow yield basis the current fleet and share price on August 24th alternative TCE rates. Based on historic Clarkson TCE rates for non-ECO vessels in the period 2000 to 2021, adjusted book premiums on scrubber and ECO vessels Frontline has a free cash flow per share of $2.34, and a free cash flow yield of 20%. Free cash flow yield potential increases with higher assumed TCE rates and fully delivered basis. With this, I leave the word to Lars again.\n\nLars Barstad -- Chief Executive Officer\n\nThank you, Inger. So let's move on and have a look at Slide 9. And to recap the second quarter. I have a basic limited title here called the pivotal point for tankers, Q2 is normally as of this quarter also referred to as the shoulder quarter.\n\nBut you see on the graph at the bottom left something happened as we went into Q2 this year. So global all demand came in 700,000 barrels per day lower in Q2 compared to Q1, averaging up to 98.4 million barrels, and supply came in 99.1 million barrels per day up a modest 0.2 million barrels per day in the quarter. It's basically the volatility we've seen in the markets in Q2 and the first and foremost on the LR2s is a ton-mile story, and we're currently reaping the benefits of that story that started during the second quarter. We're seeing highly inefficient trading patterns developing and this is to the benefit of oil in transit and utilization, as we can see on the graph at the bottom right.\n\nToward the end of the second quarter, we saw all Frontline asset classes, including the VLCC, start to move up. Asian and in particular Chinese demand was still subdued during this, but the current level of activity paints an interesting picture for the future thus to come. Let's move on to Slide 10. So global exports, and what you are looking up here are two charts where basically it is the tracked output of oil and products split from basically every producing country in the world, and every producing -- or product producing region in the world.\n\nWe've seen a dramatic change in demand and trading patterns for refined products developing during Q2 this year. I think people tend to forget that it's a bit overshadowed by the situation in Ukraine that most of the Western world has actually fully come out of COVID, of the COVID-19 pandemic with the effects that have on demand. And at the same time refining capacity, particularly in Europe and to some extent in the US, was reduced quite dramatically during the pandemic, where these regions experienced horrific refining margins. And in addition to that, we've had the situation with the sanctions on Russia making Russian oil and products more difficult to move.\n\nSo basically, what we see is that global clean product exports are actually approaching the highs we've seen, and this takes us back to 2017. If we go further back AIS tracking is not as efficient as it has been in this period, but we are reaching an all-time high in clean products exports globally. Global crude oil exports are improving. It's lagging, though on the product side this is but a bit of the appreciation in the global crude oil exports.\n\nIt's primarily caused by US releases, US production, and their export capabilities growing. US production has increased by 1.4 million barrels year-to-date, according to the EIA. And as most of you would know, the US is releasing what's equivalent to almost 1 million barrels per day of their SPR, or from the SPR. In -- I would say, writing, but in speaking, we currently see very high demand for tonnage, both in the Middle East and in the US Gulf, indicating that this positive development for freight looks to continue.\n\nLet's move them to Slide 11. And the order book continues to dwindle in particular on the crude side. There have been no orders for VLCCs or Suezmaxes in the last 12 months. I have to correct myself there a little bit because I saw reports this morning that there were VLCCs ordered or rumored to be ordered in Japan, but we will get back to that.\n\nIn order to get a significant change to this picture, we need far more. On the VLCC side, we have seen 27 vessels delivered year-to-date, and there are still 21 to come. Some of those will obviously move into '23. But the total order book is 41 vessels.\n\nWe have a fleet of 861 vessels, of which 81 during this year will be over 20 years old. Once this order book is finished and delivered, 114 VLCCs will be above 20 years old. On the Suezmaxes, it's even more pronounced, we've seen 25 Suezmaxes delivered this year. There are eight more to come, six next year, and two in 2024.\n\nThat's the 16 total in the order book, and we have 65 Suezmaxes that will pass this 20-year threshold this year. And looking at the time the order book delivers, it's a total of 111 Suezmaxes that would effectively be disqualified from the commercial trading oil market. On the LR2s, we have, in fact, seen some orders placed this year. The broker of course varies, but we've landed on identifying 13 orders placed.\n\nAnd, but still, I would argue that that's not an alarming development. There are 20 LR2s or at least vessels that are registered as LR2s that are going to be over 20 years this year. But if you, kind of heightened the threshold a little bit and put it at 15 years, which for anyone that trades clean products, no is a more relevant yardstick. You have more than 70 LR2s built prior to 2008.\n\nSo basically by this order book has -- when this order book has delivered, this will come to age. So we're not really that alarmed about the development of LR2s side either. I think if we look at the chart on the top left side here, this has become quite repetitive over the quarterly presentations that we have. And the blue line is the absolute deadweight size of the tanker order book, and the yellow one is a percentage of the fleet.\n\nAnd as we can see in absolute deadweight, we're back to 2000, and 2001 period, and we all know that the oil market is much larger now than it was in 2000. In the percentage of the fleet, it's even more pronounced where we need to go back to 1996 and even before. I actually don't have a history prior to 1996 on this. So it's difficult for me to gauge whether we are early 90s, the mid-90s, or in the '80s.\n\nBut this is an alarming development, I would say. And we're starting to see the early signs that tankers could become a bottleneck in the energy logistical chain. And I'd like to add, though, for those of you, not that familiar with freight and tankers that not every country in the world is blessed with oil. And there is also an asymmetrical relationship between population growth and oil resources.\n\nSo this transportation need is actually real. So let's see how this develops. Let's then move over to Slide 12. And I find this quite exciting.\n\nThe time charter market has almost erupted over the last month. The time charter of the period market is an old-school bellwether for large oil transporters' expectations. These are, as we referred to as the big guys, the Shells, the Equinors, the BPs, the Chevrons, the big boys in the game that has equity crude have substantial transportation needs are in the market, all of them for up to 3-year commitments on time charters. And to them -- even for them, a 3-year commitment is significant.\n\nWe have seen earlier kind of in the reporting season, even 5-year charters being concluded. And this is extremely interesting and extremely encouraging. This is obviously in line with the spot, but it's not that often that you -- after a relatively short period of firm spot markets, it is a kind of activity in the long-term time charter market. So this basically means that our analysis might be in line with some of these guys' analyses.\n\nFrontline will remain a spot-focused owner with the objective to offer our investors stock market returns. However, a certain degree of secured revenue and margin plays a part in our long-term vision. And as we have reported, we are actively looking at the time charter market for some of our asset classes. So let's move over to Slide 13.\n\nWe are -- although it's been fairly quiet from Frontline in this respect for the last couple of months, or actually not months last month, I would say, the Frontline and Euronav combination is on rails. We are moving forward, basically, the part of the process we are in now is led by legal and it's more a regulatory job toward the regulators, and we're working toward a Frontline relocation filing to further relocation of Frontline from Bermuda to Cyprus. That will be followed by a tender offer. We expect that to happen in Q4 this year.\n\nThere is always also been discussions around the various outcomes of this tender offer. I've left the achieving less than 50% acceptance out of this. But obviously, if that should happen, we don't believe it will. We think this is an industrial solution the market wants, but I just left that out.\n\nIf we get above 75% acceptance among the Euronav shareholders, we will go directly to a merger with Euronav. Should we, in this case, end up between 50.1% and 75%, the outcome is more or less the same. Frontline gains control of Euronav and a combination of the two complementary platforms will be created and will perform basically as one company, although Euronav will be veridically a subsidiary of Frontline. So let's -- with that move to Slide 14 and a summary.\n\nSo Q2 '22 was a shoulder quarter in the terms of oil demand. And in fact, Q3 should have been the same, that's if you follow normal seasonal patterns. This is currently a turmoil story with sanctions on Russia being a catalyst, but we may face a structural catalyst when it comes to products. I mentioned earlier in the presentation the dislocation between refining capacity and demand.\n\nGlobal crude oil exports are approaching pre-COVID levels and oil in transit is already there. Order books continue to dwindle, and there is currently no incentive present to invest in new capacity interest yet. Also, there is a question of when this capacity can be ready for the market should the ordering start now. The other question then is, are we starting to feel the structural bottlenecks of oil transportation that may come? Frontline has a modern, efficient spot-exposed fleet, and the stars are looking to align and I might add, winter is coming.\n\nI'd like to draw your attention to the chart at the bottom, which is different from the last three quarters, and it's basically a seasonal chart of the average weighted earnings of all tankers. It's not Frontline tanks, it's all the tankers, basically all the tanker indices. And as you might notice, it's a very unseasonal pattern evolving. And with that, I'll open up for questions.\n\nOperator\n\n[Operator instructions] The first question is from Jonathan Chappell from Evercore ISI. Please go ahead.\n\nJonathan Chappell -- Evercore ISI -- Analyst\n\nThank you. Good afternoon. Lars, two quick questions on capital allocation. First of all, it's good to see the dividend renewed for the first time.\n\nIf we do the math, it looks like maybe a 70% payout ratio has just been so long. Just want to get confirmation on a rough range. And then, the second part to that question is, as we're going through the final steps of consummating the Euronav transaction, are there any restrictions on the amount of dividends, or any other corporate actions you can take until that process finalize?\n\nLars Barstad -- Chief Executive Officer\n\nFirst of all, Inger just handed me a note here. I believe it's up 79%.\n\nInger Klemp -- Chief Financial Officer\n\nYeah, because we need to calculate the dividend basis to 222.6 million shares.\n\nJonathan Chappell -- Evercore ISI -- Analyst\n\nOK.\n\nInger Klemp -- Chief Financial Officer\n\nAnd outstanding at the end of the quarter -- second quarter, I mean. So then you will come to that is 79%.\n\nJonathan Chappell -- Evercore ISI -- Analyst\n\nThat's helpful.\n\nInger Klemp -- Chief Financial Officer\n\nYes.\n\nLars Barstad -- Chief Executive Officer\n\nAnd back to your --\n\nJonathan Chappell -- Evercore ISI -- Analyst\n\nSo that's the right -- go ahead.\n\nLars Barstad -- Chief Executive Officer\n\nAnd back to your other question, there is the combination agreement was made public in July and the exchange ratio is set and it's within that exchange ratio that the dividend has been -- is being paid. But for future dividends, it needs to be basically adjusted either via the exchange ratio, which is very unlikely. And then, via the amount of shareholders that Frontline will have post-merger.\n\nJonathan Chappell -- Evercore ISI -- Analyst\n\nMy second question for you Lars is, you mentioned in the presentation that you haven't really seen China come back to the market yet. It feels like Russia is still pretty reliant on -- I am sorry, Europe is still pretty reliant on Russian crude and the sanctions clearly haven't gone into effect yet. Is it then -- is there any way to quantify or even qualify what's driven this VLCC spike before you are really seeing the impact of these two potential big catalysts into the market?\n\nLars Barstad -- Chief Executive Officer\n\nWell, first, I would like to say that the European and US sanctions on Russian crude have not affected the Russian flows per se, but it's altered the trading pattern. So, basically, what we see right now is that Russian crude oil and Russian products are sailing past Europe and to Asia. And at the same time, Europe has had to change its purchase patterns and is importing to a much larger degree feedstock and products from the Middle East, West Africa, and the US. So -- and this is what created this highly inefficient trading pattern.\n\nSo, it has -- kind of the sanctions has stopped Russian crude to enter Europe just as far as we see it. With regards to the VLCC, that's a very kind recent development. And I think it's more related to the US production and the US SPR release and their export capacities. So -- and as you know, and as I have described this before, on previous calls that the oil market is a bit like a toothpaste tube.\n\nIf you press it, the toothpaste will pop out somewhere. And basically, US [Inaudible] has then priced itself to go far east, basically by the share [Inaudible] volume being offered. So that, I think is the game changer here. I also think not to be too technical, the flattening of the oil curves in a very, very steep backwardation market, it's quite expensive to hold large volumes of crude oil over a long voyage is basically unhedgeable.\n\nBut obviously, with the flat structure of the crude oil market. It's easy to hedge your exposure over the 60 days you need in order to transport crude from say US Gulf to China.\n\nJonathan Chappell -- Evercore ISI -- Analyst\n\nOK. That's all very helpful. Thank you, Lars, and thanks, Inger.\n\nOperator\n\nThank you for your question. We are now taking our next question. The next question is from Chris Tsung from Webber Research.\n\nChris Tsung -- Webber Research -- Analyst\n\nHi. Good afternoon. How are you?\n\nLars Barstad -- Chief Executive Officer\n\nThank you. Very good.\n\nInger Klemp -- Chief Financial Officer\n\nVery good, yeah.\n\nChris Tsung -- Webber Research -- Analyst\n\nGreat. Thanks. Just to follow up on that last question. So, are you saying that you will continue to see VLCCs/Suezmaxes for the near term, is that right?\n\nLars Barstad -- Chief Executive Officer\n\nSo basically, what we are seeing is that at least the VLCC -- when these large trade lanes open up as we have seen US Gulf to Asia, or to North Asia. You utilize the vessels for over a very, very long period of time. So, it takes away the capacity for a long time. So -- and we also see the activity continue.\n\nWhen we fix VLCCs now, we fix them in late September. So basically, the oil will be lifted in September and delivered to China sometime in late October or early November. And this, we see continue as October dates are already being addressed. This does, however, create a bit of a hole in the Suezmax program, because they are fixed closer to the loading dates.\n\nBut at the same time, the Suezmax has a lot of support from the flow of crude from both the Middle East, but primarily West Africa into Europe. So, we basically see -- this seems to be maintaining or maybe even firming.\n\nChris Tsung -- Webber Research -- Analyst\n\nOK. Great. Yeah, thanks for that color. That's really helpful.\n\nJust on to your fleet mix, I know in the presentation, you guys are not looking at new capacity to ship, but with these delivering into early next year and the potential merger with Euronav fleet, which is heavily be-weighted. I just wanted to understand, is there a desire to rebalance your fleet mix, or how should we think about that?\n\nLars Barstad -- Chief Executive Officer\n\nYou are absolutely correct. It is to rebalance our fleet mix. And historically, Frontline has been a predominantly VLCC company, secondary having Suezmaxes. And the LR2 additions to our fleet are actually kind of in the long-term, fairly new.\n\nWe do see them obviously as very efficient trading vehicles, and I think this quarter has a story of that. But no, it's a simple analysis, which we have repeated a few times, but I am happy to repeat it again. If you look at the average cash break-even Frontline has per vessel class, you also then think of the economies of scale in oil transportation. You will find that the lid on -- or the kind of where the VLCC peaks are so much higher than, for instance, for the VLCC, and Suezmax, or compared to an LR2.\n\nSo, it means that you get to put a bit in a variable on the more bang for the buck owning VLCCs in a good market. And this has basically been from clients' philosophy all along. We are also quite good at running VLCCs and have a good client base in that segment. And so, this has basically been kind of where the bread and butter over the years have been gained from Frontline.\n\nSo, the Euronav transaction is a part of that kind of continuing that story.\n\nChris Tsung -- Webber Research -- Analyst\n\nGot it. Great. Thank you. And just if I can squeeze in one last modeling question just noticed your admin costs have been shift a bit this quarter.\n\nIs this a one-time thing associated with the time merger with Euronav versus something else?\n\nInger Klemp -- Chief Financial Officer\n\nYeah, and you are right. We do have some more professional fees of -- expenses related to professional fees and legal costs in this quarter than we usually have related to this merger.\n\nChris Tsung -- Webber Research -- Analyst\n\nOK. So, it wouldn't be like the run rate going forward is just slightly elevated this quarter and maybe into next?\n\nInger Klemp -- Chief Financial Officer\n\nSorry, I didn't catch your question.\n\nChris Tsung -- Webber Research -- Analyst\n\nOK. I was just saying that this shouldn't be looked at as a new run rate for admin expenses, and it's just this quarter and next, is it just going to be slightly elevated?\n\nInger Klemp -- Chief Financial Officer\n\nWell, I mean as long as we are in the process of let's say, combining the companies, I guess you could assume that we will also have higher professional fees and legal expenses in the next quarters to come.\n\nChris Tsung -- Webber Research -- Analyst\n\nAll right. Yeah, no, it makes sense. Thank you, Inger. Thank you, Lars.\n\nLars Barstad -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you for your question. We are now taking our next question. Please stand by. The next question is from Omar Nokta from Jefferies.\n\nOmar Nokta -- Jefferies -- Analyst\n\nHi there. Hey, guys. I have a couple of questions for you just on the Euronav transaction. Obviously, in the second quarter, you did a few share deals that took your stake up to around 20% in Euronav.\n\nIs there anything that prohibits you from doing more, assuming the opportunity exists to take your position higher ahead of the tender offer?\n\nLars Barstad -- Chief Executive Officer\n\nIt is in fact -- and this leads to kind of transactions, you can call them, were bilateral, and they were kind of driven by incoming to put it that way. There is a regulatory kind of mechanism called the creeping tender offer. If you continue to do this, at least the US legislators will kind of arrest you not like physically, but you will -- they don't mean it the correct way of going about this. So, that's why we kind of stopped there.\n\nAlso, there are limitations to -- when you become a related party and so forth. That's not necessarily a big issue for us as we are very much related through the combination agreement already. But there is no kind of big incentive for us to continue that path. Or it is in that path --\n\nOmar Nokta -- Jefferies -- Analyst\n\nOK.\n\nLars Barstad -- Chief Executive Officer\n\nContinue those -- or do more of those transactions.\n\nOmar Nokta -- Jefferies -- Analyst\n\nYes. Got it. That makes sense. Appreciate that.\n\nAnd I guess this is maybe sensitive I understand if you are not able to respond, but are you having any discussions with the Euronav shareholder that has been vocal in his opposition to the deal, maybe reaching an amicable solution, or does it just simply come down to how the tender offer comes about later in the year?\n\nLars Barstad -- Chief Executive Officer\n\nIn the end, it comes down to how the tender offer -- what happens when we count the shares at the end of the tender offer.\n\nOmar Nokta -- Jefferies -- Analyst\n\nUnderstood. OK. All right. Thanks, Lars.\n\nLars Barstad -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you for your question. [Operator instructions] There are no further questions at the moment, I will hand back the conference for closing remarks.\n\nLars Barstad -- Chief Executive Officer\n\nOK. Thank you very much for calling in. Again, these are exciting times. We are quite excited both by the market developments and our ambitions with regards to the combination of Euronav.\n\nSo, with that, thank you, and have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLars Barstad -- Chief Executive Officer\n\nInger Klemp -- Chief Financial Officer\n\nJonathan Chappell -- Evercore ISI -- Analyst\n\nChris Tsung -- Webber Research -- Analyst\n\nOmar Nokta -- Jefferies -- Analyst\n\nMore FRO analysis\n\nAll earnings call transcripts"
}