{
  "companyName": "Realty Income",
  "companyTicker": "O",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/realty-income-o-q3-2022-earnings-call-transcript/",
  "content": "Realty Income (O -0.55%)\nQ3 2022 Earnings Call\nNov 03, 2022, 2:30 p.m. ET\n\nOperator\n\nGood day, and welcome to Realty Income third quarter 2022 earnings conference call. All participants will be in listen-only mode. [Operator instructions] After the presentation, there will be opportunity to ask questions. Please note this event is being recorded.\n\nI would now like to turn the conference over to Ms. Andrea Behr, corporate communications manager. Please go ahead.\n\nAndrea Behr -- Corporate Communications Manager\n\nThank you all for joining us today for Realty Income's third-quarter operating results conference call. Discussing our results will be Sumit Roy, president and chief executive officer; Christie Kelly, executive vice president, chief financial officer, and treasurer; and Jonathan Pong, senior vice president, head of corporate finance. During this conference call, we will make certain statements that may be considered forward-looking statements under federal securities law. The company's actual future results may differ significantly from the matters discussed in any forward-looking statements.\n\nWe will disclose in greater detail the factors that may cause such differences in the company's Form 10-Q. We will be observing a two-question limit during the Q&A portion of the call in order to give everyone the opportunity to participate. If you would like to ask additional questions, you may reenter the queue. I will now turn the call over to our CEO, Sumit Roy.\n\nSumit Roy -- President and Chief Executive Officer\n\nThank you, Andrea. Welcome, everyone. At Realty Income, we pride ourselves in having a consistent and dependable business model. For 53 years as an operating company, we have persevered through a variety of macroeconomic climates, and our track record of stability, notably during periods of volatility, is particularly relevant during current times.\n\nWe sit here today well-positioned and operating very well across all areas of our business. We are grateful for all of our team members who make the success possible. To start off, we capitalized on opportunities to bolster our balance sheet in the third quarter, including raising over $2 billion of equity on the ATM, with approximately $700 million of proceeds received during the third quarter, as well as over $1.3 billion remaining, subject to our settlement on a forward basis in alignment with our capital strategy. In addition, we issued $750 million of 10-year senior unsecured notes in October to further increase our liquidity.\n\nBetween cash and cash equivalents, our availability under our credit facility, our liquidity as of the end of the third quarter was over $2.5 billion, which, when combined with the $1.3 billion of our unsettled forward equity and approximately $744 million in net bond proceeds, equates to liquidity of approximately $4.6 billion had the forwards and net bond proceeds being received at quarter-end. Moving on to acquisitions. During the quarter, we acquired approximately $1.9 billion in high-quality real estate, bringing us to approximately $5.1 billion in acquisitions year to date. A significant portion of the properties purchased in Q3 were part of portfolio deals or large transactions.\n\nWe believe these deals were accessible to us because of our size, scale, relationships, ability to close access to and cost of capital, together with our research and technology-driven analytics capabilities. For Realty Income, our competitive advantages allow us to design and execute on strategies that benefit all those we serve, including our clients. The pending $1.7 billion Encore Boston Harbor transaction, which we continue to expect to close this year, remains an example of this dynamic. Based on our current total portfolio annualized base rent, the transaction would comprise approximately 3% of our total portfolio annualized contractual rent once closed.\n\nFurther leveraging our international capabilities, we made our advent into Italy last week, investing approximately 165 million euros in seven high-performing wholesale clubs operated by Metro AG in major Italian cities like Rome and Florence. Metro is a pan-European leader in the wholesale club industry and operates almost 700 stores across Europe. Metro is publicly listed and investment-grade rated and has continued to perform well during and since the pandemic. We are delighted to add them as a client and hope we will be able to add to this initial portfolio over time.\n\nDuring the third quarter, we did experience cap rate expansion, registering a 6.1% cash cap rate on investments, which compares favorably to the 5.7% cap rate we realized our investments in the second quarter. This resulted in a third-quarter investment spread of 165 basis points based on actual capital raised, which is higher than our year-to-date total of 161 basis points and above our historical average. As we move toward year-end, we continue to see cap rates push higher as capital costs increase. This is consistent with the historical correlation we've come to expect, which has tended to preserve investment spreads as the market adjusts.\n\nTransaction flow remains strong, with sourcing volume totaling approximately $18 billion this quarter, bringing year-to-date sourcing volume approximately $78 billion. We remain selective as we have acquired approximately 6.5% of sourced volume year to date. The international market continues to be an important part of our strategy, and it remains an active component of our volume, representing approximately 33% of investment volume in the third quarter. Capital recycling continues to be a strong component of our funding strategy, which also has the dual purpose of culling noncore properties from the portfolio.\n\nDuring the third quarter, we sold 34 properties, generating net sale proceeds of $142 million at an unlevered IRR of 12.8%, illustrating the full cycle attractiveness of owning net lease real estate under long-term leases. We intend to continue to act opportunistically to dispose of assets at moments in time when we can obtain attractive risk-adjusted returns. In addition to the disposition of properties on our balance sheet, we also sold our interest in seven properties owned in an industrial JV that we assumed as part of our VEREIT merger. The gross purchase price totaled $905 million at a low 4% cap rate.\n\nOur share of net sale proceeds was approximately $113.5 million. Our core portfolio continues to perform, and by and large, our clients have generally continued to perform very well despite the cyclical market changes and shifts in consumer behavior. A point to note, as previously publicly announced, one of our clients, Cineworld, commenced Chapter 11 bankruptcy in September. Despite being one of its largest landlords, Cineworld represented only 1.5% of our total portfolio annualized base rent as of Q3.\n\nWe'll continue working closely with Cineworld as this process continues toward resolution. For some color regarding theaters, for the third quarter 2022, we collected approximately 85% of the contractual rent across our theater portfolio as Cineworld Group plc was not yet required to pay rent for the month of September. For the month of October 2022, we have collected 100% of the contractual rent across our theater clients, including Cineworld. For some specifics, our Cineworld portfolio consists of 41 properties, 17 of which are subject to a single master lease agreement, and 22 of which have been accounted for under cash basis accounting since the third quarter of 2020.\n\nThrough September, we have recognized $23.5 million of cumulative reserves on these properties, representing primarily contractual rent and expense recoveries that have not been collected dating back to the beginning of the COVID-19 pandemic in 2020. These 22 properties on cash basis accounting currently account for approximately $1.6 million of monthly contractual base rent or 40% of our total exposure to Cineworld. Based on current public information and our internal analysis, we continue to believe our portfolio of Cineworld assets are generally comprised of the stronger performance in the operator's portfolio. Our locations are freestanding single-tenant assets typically with large land areas and close proximity to population centers, supporting potential conversion to residential, industrial or life science uses.\n\nWe have received reverse inquiries from multifamily and industrial developers exploring opportunities on these sites. We believe there is alternative and adaptive reuse potential if Regal were to vacate any locations as part of bankruptcy. Moving on to some of the most important key operational metrics delivering value that continue to demonstrate a consistent well-positioned real estate portfolio. At the end of the third quarter, our occupancy was 98.9%.\n\nIn Q3, we released 169 leases and achieved a rent recapture rate of 108.5%, bringing our year-to-date recapture rate to 106.7%. As we look forward, less than 4% of our contractual base rent comes due through the end of 2023, providing strong visibility into our near-term portfolio performance. At quarter-end, approximately 43% of our portfolio's total annualized contractual rent was generated from investment-grade-rated clients. Our properties leased to clients in our portfolio watch list represented less than 4% of our portfolio's annualized contractual rent.\n\nLastly, our same-store rental revenue increased 1% during the quarter and 2.4% year to date, and we continue to expect full-year same-store growth to be approximately 2%. At this time, I'll pass it over to Christie, who will further discuss results from the quarter.\n\nChristie Kelly -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nThank you, Sumit. Put simply, it was another productive quarter for us. In the third quarter, our business generated $0.98 per share of AFFO, representing 7.7% year-over-year growth. Our net debt to annualized adjusted EBITDAre was 5.3 times or 5.2 times giving effect to the annualization of net investment activity during the quarter.\n\nThese ratios do not reflect the $1.3 billion in outstanding equity forwards we had at quarter-end. As Sumit previously mentioned, we were both active and prudent in our capital-raising efforts since the end of the second quarter. In addition to raising over $2 billion during the quarter at an initial weighted average price of approximately $68 per share, subsequent to quarter-end, we completed a $750 million bond transaction, the majority of which served as a synthetic euro offering to take advantage of favorable foreign exchange dynamics while also allowing us to return to the U.S. dollar public fixed income market, which we last accessed in 2020.\n\nIn conjunction with this offering, we executed a $600 million to euro 10-year cross-currency swap, resulting in the receipt of approximately $612 million in euro proceeds, an effective fixed rate euro-denominated semiannual yield to maturity of 4.7%. Additionally, giving effect to $500 million of interest rate hedges, which were terminated with the off-rating, we generated a $72 million cash settlement gain at pricing, which, when amortized over the 10-year tenure of the note, is expected to result in an effective semiannual yield to maturity of 3.93%. Financial flexibility has long been a hallmark of our strategy, and our ability to move between various financing markets given our international capital needs is a competitive advantage. As previously reported in the third quarter, we upsized our U.S.\n\ncommercial paper program from $1 billion to $1.5 billion and established a euro commercial paper program with a capacity of $1.5 billion. The combined $3 billion commercial paper program, which is backstopped by our multicurrency $4.25 billion revolving credit facility, gives us the flexibility to efficiently match fund our short-term funding needs in various currencies at much lower rates than comparable U.S. facility borrowings. As we look forward, we have limited near-term refinancing risk as only $23 million of mortgage debt comes due through the end of 2023 and our next unsecured debt maturity is not until 2024.\n\nWith continued stable and consistent results in the quarter, we tightened our AFFO guidance range by $0.06 to $3.87 to $3.94, maintaining the midpoint at a 9% year-over-year growth rate, consistent with what we initially provided a year ago. As a monthly dividend company, Realty Income's dividend will remain sacrosanct to our mission. This is a testament to our confidence in the time-tested consistency of our business model supported by a conservative balance sheet and diverse real estate portfolio leased to clients that are leaders in their respective industries. In September, we increased the dividend for the 117th time and for the 100th consecutive quarter, representing a 5.1% increase compared to the dividend declared one year ago.\n\nWe are proud of these accomplishments and the work our talented colleagues perform every day to help drive this consistent track record. Earlier this week, we celebrated the one-year anniversary of our VEREIT merger. We've grown together as one team over the last year, and I'm pleased that we remained on track to realize over $50 million in run rate annual cost synergies that we estimated when we announced the merger. And with that, I would like to pass the call back to Sumit.\n\nSumit Roy -- President and Chief Executive Officer\n\nThank you, Christie. Our strengths have been accentuated in this quarter's result. While we cannot control the macroeconomic forces that periodically introduce volatility in the capital markets, I am regularly reminded that the resiliency of this team and the inherent stability of our business model allows us to look to the future with confidence. I'm pleased that we are able to lean into market conditions when it's advantageous to serve our shareholders, and I believe that the best is still ahead of us.\n\nAt this time, we can open it up for questions. Operator?\n\nOperator\n\nThank you. And we will begin the question-and-answer session. [Operator instructions] First question comes from Brad Heffern, RBC Capital Markets. Please go ahead.\n\nBrad Heffern -- RBC Capital Markets -- Analyst\n\nHey, good morning out there, everyone. Cap rates on acquisitions were up 50 basis points quarter over quarter. Looks like some of that's related to the mix of industrial and investment grade, but can you talk about how much of that was underlying market cap rates moving? And was there a particular goal to pursue higher cap rates to preserve accretion?\n\nSumit Roy -- President and Chief Executive Officer\n\nIt's more the former than the latter. We are definitely seeing movement in cap rates. If we were to compare it to what -- where the environment was at the beginning of the year, which is what I would say we saw over the last couple of years, and compare it to cap rates that we are seeing today and what we experienced in the third quarter, I would say retail cap rates have moved circa 100 basis points. And it's a story of basically two ends of the credit spectrum.\n\nIf you think about the high investment-grade grocery assets, those at the beginning of the year were trading in the low-four cap rate range, and those have moved the most. I would say today, they are in the 5.5%, maybe even in the 5.6% ZIP code. So, that's about 150 basis points. And then on the other end of the spectrum, it was the higher-yielding cap rates that had compressed quite a bit over the last few years that also saw similar movement.\n\nBut the stuff that was in between has seen movements circa of 100 basis points, and that's really what is starting to translate into actual realized cap rates that you noticed for the third quarter. Having said all of that, things don't happen at the spur of the moment. I mean, a lot of these transactions -- we started to have discussions with our potential clients about the movement that we were seeing in our cost of capital, which was quite brutal and quite immediate. And thanks to the relationships, thanks to our ability to close all of the things that I enumerated in my prepared remarks, some of the more institutional-type clients were also experiencing similar dynamics and were more than willing to adjust cap rates to continue to do business and continue to fund their respective businesses.\n\nAnd I think that's what you sort of saw translating to the 40 basis points of increased cap rate that we were able to realize in the third quarter. But it is a timing thing. I just want to be very careful that depending on -- if, for instance, if the gaming asset in Boston, if that were to have closed in the third quarter, that's already been sort of -- it's a transaction that's going to have a 5.9% cap rate, that's going to sway the overall cap rate. So, it really is a question of when did those transactions get under contract and what is the timing of close that's going to dictate what the quarter results are.\n\nBut having said all of that, I think we are definitely seeing movement, and it is in the quantum that I described earlier. It's a similar story on the industrial side. I would say that industrial cap rates have also moved considerably, and this is something that we started seeing even in the early part of the year. I think in my first quarter comments, I had talked about maybe seeing a 25 to 50 basis point movement.\n\nThis was on the heels of Amazon announcing that they are no longer going to be big takers of industrial assets. They accounted for about 20% of the volume over the last few years. That started to see some movement -- that resulted in some movement on the industrial side. And then that movement continued through the second quarter.\n\nAnd I'll say today, despite what we quoted in our joint venture that we sold in the low 4s, I would say similar assets that we were pursuing are in the 5.5 ZIP code today. So, there's clearly movement. And the hope is that the movement will continue in the right direction over the next coming months. And our portfolio is a testament -- our portfolio, as well as our pipeline, is a testament to that.\n\nBrad Heffern -- RBC Capital Markets -- Analyst\n\nOK. I appreciate the detailed answer. Christie, I was hoping you could walk through the puts and takes on the new guide. Obviously, you had headwinds from FX and from higher rates.\n\nI'm curious what the offsetting factors were they kept the midpoint the same. Thanks.\n\nChristie Kelly -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nYou know, I think, Brad, you captured the headwinds together with the strengthening U.S. dollar. I think in terms of where we see opportunity is, first, as it relates to the determination on our AFFO per share is the overall developments and as it relates to our clients that are on cash accounting. I just want to note that for Regal, we have no change associated with the status of Regal, and in the midpoint of our guidance are expecting full collection.\n\nA couple of other things is also just our access to the international borrowings, which are a nice tailwind, and you can see that demonstrated in what we were able to do with the euro commercial paper program. And as Sumit articulated, our relationships with clients, our ability to pivot in the marketplace, together with our strong pipeline and the timing of the Encore transaction, which could be a positive or a negative. Hope that helps, Brad.\n\nBrad Heffern -- RBC Capital Markets -- Analyst\n\nYep. Thank you.\n\nOperator\n\nThank you. Next question will be from R.J. Milligan of Raymond James. Please go ahead.\n\nR.J. Milligan -- Raymond James -- Analyst\n\nGood afternoon. I'll start with my boilerplate question for the quarter and certainly appreciate the attractively priced capital you guys were able to source in 3Q, but I'm curious how you view your current weighted average cost of capital and what kind of spreads you've been able to achieve here quarter to date.\n\nSumit Roy -- President and Chief Executive Officer\n\nYeah. So, the spread we were able to achieve third quarter year-to-date was right around 161 basis points, and this is based on actual capital raised throughout the year. And for the quarter, it was closer to 165 basis points. And one of the things I'll point to is that in our investor deck, I believe it's Page 26, we do lay out precisely how we calculate our cost of capital.\n\nAnd there are basically three components to it, one of which is the free cash flow that we are generating, as well as the cost of equity, loaded for the cost of raising that equity and our bond prices. But there was a strange thing that played out in the third quarter, and I don't know if I've got this fact 100% right. But we reached our 52-week high, as well as our 52-week low during the third quarter. That was the level of volatility that we experienced.\n\nAnd we will call it luck, call it Jonathan Pong doing his thing. We were able to raise a lot of our equity capital on a forward basis with an average price of $68 and that's $2 billion worth of equity, $700 million of which we obviously was able to -- we were able to close and settle at the end of the third quarter, and $1.3 billion of which we will settle at the end of the fourth quarter. And so, that's the reason why I want to be very precise around the actual realized spread versus what traditionally has been a calculation of average WACC over a given period. This is the first quarter where we felt like there was a massive diversion precisely driven by the volatility that I just spoke about.\n\nBut yes, that's how we calculate our WACC.\n\nR.J. Milligan -- Raymond James -- Analyst\n\nThank you. That's helpful. And so, given the fact that cap rates in general are starting to move higher, but probably not as quickly as the cost of debt, how are you thinking about acquisition volume as we move into 2023? Is it time to maybe tap the brakes, sort of keep the pace? Or do you think there's going to be more opportunities to potentially even accelerate the pace?\n\nSumit Roy -- President and Chief Executive Officer\n\nYeah. R.J., it's going to be a function of how quickly the cap rates adjust. Clearly, there are mechanisms available to us on the capital side and on the financing side that we are going to avail of, but that's limited in terms of what is the ultimate spread that we can realize. And we are being incredibly disciplined around making sure that the team is pivoting to hurdle rates that we need to achieve on the cap rate side in order to continue to maintain spreads that we feel like represents the right spread for the kind of risk that we are taking based on the acquisitions that we are pursuing.\n\nAnd I think I mentioned this in the second quarter, but I'll say it again: I have been pleasantly surprised with how quickly cap rates have moved. And again, based on some of the transactions that we are seeing in our pipeline, we are very optimistic that we'll be able to continue to maintain the spreads that we have historically maintained. And we see that over the continuing next few quarters. But timing will be of the essence.\n\nLike I said, if there are certain transactions that we entered into, especially on the development side, that was -- that's 12 months ago, those are going to not be quite as accretive transactions that we are entering into today, which will potentially close in the fourth quarter, and some of which will close in the first quarter, that have spreads that are more in line with what our historical spreads have been. So, timing is going to be of the essence in terms of what we report at the end of a given quarter.\n\nR.J. Milligan -- Raymond James -- Analyst\n\nMakes sense. Thank you for the color.\n\nSumit Roy -- President and Chief Executive Officer\n\nThank you, R.J.\n\nOperator\n\nNext question will be from Greg McGinniss, Scotiabank. Please go ahead.\n\nGreg McGinniss -- Scotiabank -- Analyst\n\nHey, good afternoon. Sumit, sourcing is still significant, but it's also slowed each quarter in 2022, even while potentially casting a wider net internationally. What are the drivers of that trend? And do you expect it to continue that way into Q4 in 2023? And how might that declining investment opportunities impact acquisition levels and cap rates?\n\nSumit Roy -- President and Chief Executive Officer\n\nYeah. It's a good question, Greg. And it goes back to having sticky sellers, sellers who haven't quite embraced the changing cost of capital environment who are hoping for this to have a shorter duration disruption and starting to recognize that given what the Fed is doing, given what they're seeing on the inflation side, that this may be a longer process than what they had anticipated. I think that is part of the reason why you saw a tailing off on the sourcing side.\n\nWe were averaging around $30 billion per quarter. Third quarter, I would still claim, was quite robust with $18 billion worth of sourcing, you know, one-third of which was from the international market. And so, on a relative basis, yes, there was a bit of a slowing down, and it's largely being driven by the time it takes for sellers to adjust to the new environment. And there, too, it really is a story of those that are institutional sellers, they are able to adjust to it a lot quicker than some of the noninstitutional, more private owners of real estate for whom it has taken and will take a little bit more time to adjust.\n\nGreg McGinniss -- Scotiabank -- Analyst\n\nGreat. That's fair. Then just going back to the portfolio deals or transactions that you mentioned in your opening remarks. Can you provide a little more detail on the size of some of those deals, asset types, and whether that's maybe trend that you expect us to move into, maybe that seller is just more willing to accept the current financing environment for what it is?\n\nSumit Roy -- President and Chief Executive Officer\n\nYeah. I think the way I'll answer that question is to say, in large portfolio deals, which tend to be owned by institutional owners, they're far more receptive to the changing cap rate environment and far more accepting of the changing cap rate environment. And so, it will come as no surprise to you that over 70% of what we did were portfolio deals in the third quarter. It should also come as no surprise to you that some of the institutional owners of real estate were far more willing to enter into sale-leaseback as an alternative source of raising capital, especially given their traditional sources of capital, which may have been the leverage finance market or the high-yield market and the disruption that they saw there.\n\nAnd so, about 50% of what we did in the third quarter were largely -- were sale-leaseback transactions. And so, I think that will give you a flavor for some of the transactions that we did. It was still mostly, I want to say, 94% was retail, and there was about 4%, 4.5% of industrial assets that we did, but largely driven by what we are seeing on the retail side.\n\nGreg McGinniss -- Scotiabank -- Analyst\n\nGreat. Thank you.\n\nSumit Roy -- President and Chief Executive Officer\n\nSure.\n\nOperator\n\nThank you. Next question will be from Michael Goldsmith, UBS. Please go ahead.\n\nMichael Goldsmith -- UBS -- Analyst\n\nGood afternoon. Thanks a lot for taking my question. International acquisitions represent about 33%, maybe lighter than what we've been seeing. The opportunity set just larger in the U.S.\n\nnow relative to Europe. Or are you seeing anything in Europe that you want to highlight in terms of pricing or sentiment and recognize that also comes at the time when you moved into Italy?\n\nSumit Roy -- President and Chief Executive Officer\n\nI'll tell you, Michael, I mean, we were doing north of 50% in the international markets in the first quarter. We did north of 50% in the second quarter. We are at one-third of the total volume in the third quarter. Again, it really is a function of the timing of close, etc.\n\nHaving said that, I will say that the sellers in the U.S. are far more accepting of the changing financing environment than perhaps in Europe. And Europe is -- by country, it's a smaller market. And so, it does take a little bit longer for things to adjust.\n\nHaving said all of that, we are finding very good opportunities in the U.K. And now with the advent into Italy, I believe that momentum will continue. Because for precisely some of the reasons that I think we touched on during the second quarter, the debt markets are very unsettled. It has a very high cost associated with it.\n\nAnd that's driving some of the transactions actually on both sides of the pond. But one of the additional dynamics that we are seeing play out in Europe is some of the pressures that some of the funds are feeling. And in order for them to raise the appropriate level of capital, monetizing real estate is creating opportunities for us. And so, I wouldn't read too much into it.\n\nThere is still a very, very healthy pipeline that we have within Realty Income. And the sourcing volumes continue to be, yes, lower than what we saw in the first half but still very healthy.\n\nMichael Goldsmith -- UBS -- Analyst\n\nThank you. And as a follow-up, grocery is in your top 10 industries. Kroger is one of your top 10 clients. Does consolidation in the grocery industry give you any pause or change your opinion about kind of the future of this sector and as a product type within your portfolio? Thanks.\n\nSumit Roy -- President and Chief Executive Officer\n\nSure, Michael. Look, I mean, anytime you have consolidation, the question needs to be asked, who is doing the consolidation? If Kroger is going out there, and this is a publicly announced transaction with regards to Albertsons, Kroger is still BBB-rated. S&P reaffirmed the rating, although they did put it on a negative outlook. And they're acquiring Albertsons, which is a BB-rated credit, still solid-rated.\n\nBut I don't necessarily see that as a bad thing. Now there are obviously a lot of other social issues that we have to also address and take into consideration. But from a pure credit standpoint, it's actually -- it's a stronger outcome for us that suddenly 30 basis points that we have of Albertsons that has a BB credit associated with it is now going to get enhanced to a BBB rating. So, from a purely credit perspective, that's not necessarily a bad outcome for us, but that obviously doesn't address a lot of other issues that should be addressed and, I think, is percolating through the markets today around the viability of this combination.\n\nBut by and large, there isn't a standard answer that all consolidation is good. It really does depend on the specific situations.\n\nMichael Goldsmith -- UBS -- Analyst\n\nGot it. Thank you very much.\n\nSumit Roy -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Next, we have a question from Wes Golladay of Baird. Please go ahead.\n\nWes Golladay -- Baird -- Analyst\n\nHey, everyone. Just a question on the hedging. A lot of the forex volatility and interest rate volatility, is that making it easier or harder for you to hedge cost-effectively?\n\nJonathan Pong -- Senior Vice President, Head of Corporate Finance\n\nHey, Wes, it's Jonathan. Look, it's been a very volatile FX environment as we certainly saw in the third quarter. I wouldn't necessarily say that's been harder to hedge. I mean, these are all very liquid currencies that we're looking to hedge going out very short term.\n\nAnd so, from that dynamic, yes, it's difficult to understand where these rates might be going, but the mechanism itself, nothing has really changed. On the hedging front, I would say that when you look out the next 12 months, we are around 50% hedged at this point on earnings. And we aspire to get to our hedging program where, hopefully, going forward, rates aren't the story -- FX rates aren't the story of any quarterly earnings. So, rest assured, we're very mindful of that.\n\nWes Golladay -- Baird -- Analyst\n\nGot it. And I want to touch upon Regal. It sounds like you're pretty optimistic under an adverse scenario for the cash-basis tenants. So, I guess question No.\n\n1, do you overall expect a positive outcome here? And then question -- part 2 of the question was for the master lease asset. That's -- and all I have known typically is how we view it. In your history, is that typically the case where do these ever get negotiated for a modest haircut? I guess what should we brace for based on historical precedent?\n\nSumit Roy -- President and Chief Executive Officer\n\nSo, Wes, there isn't one single answer that can address the master lease question. It is very much jurisdictionally dependent depending on where the bankruptcy is playing out. And in this case, I think I believe it's in Texas. It's a function of how they're going to interpret the strength of the master lease.\n\nBut yes, having a master lease certainly does accrue certain benefits to us, and it should be viewed as an all-or-nothing situation. But we can't guarantee that going forward. We'll see how it all plays out. With regards to Regal and the ultimate outcome, you read a fair amount of optimism into some of our prepared remarks and when we have answered questions directly.\n\nThat is a true read. I'm not saying that Regal will continue to run 41 assets when they emerge from Chapter 11, but what I am telling you is the ultimate economic outcome on this portfolio, we feel very comfortable about. And a lot of it has largely been driven by unsolicited inbounds that we have been receiving, even on some of the assets that we recognized to be not very good performers and recognizing that the best use for these assets perhaps may not be a theater asset going forward, but something totally different. And when you start to look at where these are located, the amount of land, in some cases, north of 10 acres, creating a mixed-use or a multifamily makes it tremendous amount of sense.\n\nAnd the value creation opportunities for us to partner with some of these developers can create a lot of value for us. Yes, it's going to take time, but we feel fairly optimistic that the ultimate economic outcome on this portfolio will be one that we will be very comfortable with.\n\nWes Golladay -- Baird -- Analyst\n\nGot it. Thank you very much for that.\n\nSumit Roy -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nNext question will be from Ronald Kamdem, Morgan Stanley. Please go ahead.\n\nRonald Kamdem -- Morgan Stanley -- Analyst\n\nHey, just a couple of quick ones. Just back to sort of the tenant health. You sort of talked about Regal, which was really good disclosure. But any sort of other tenants that are of material size, whether it's 50 basis points, 100 basis points, on the watch list that we should be thinking about? And how are you guys look and can you just update us on what the reserve for bad debt is looking like so far year to date? Thanks.\n\nSumit Roy -- President and Chief Executive Officer\n\nYeah. I'll take the question around do we have more than 50 basis points or 60 basis points for any other clients outside of Regal, and the answer is no, we don't. Our total watch list is less than 4%. It's actually 3.9%.\n\nAnd we don't have any large clients on this watch list outside of Regal. Regal is the largest one. We do have some other clients on this, in the health and fitness industry, etc. But again, from an overall perspective, we feel pretty good about it.\n\nIn terms of -- I'll have Christie answer the other part of your question.\n\nChristie Kelly -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nIn terms of reserves, Ron, total reserves are $33 million. And just dovetailing with what Sumit said in regards to the watch list and what we've already made publicly available, it's really primarily a story around Regal and the reserves that we have on the books associated with Regal.\n\nRonald Kamdem -- Morgan Stanley -- Analyst\n\nGreat. And if I could sneak in -- my second one was just, look, if you take a step back and you think about sort of the company, the balance sheet when the rest of the capital markets are sort of challenged, it seems like this should be the environment where you guys can thrive, and I think you sort of mentioned some of that in your opening comments. But I guess my question is just going back to sort of the acquisition volumes and the cap rate, just trying to get a sense of how much sort of pricing power, how much can you guys actually ask for higher cap rates, right, thinking could this be 25, 50, 75 basis points cap rate higher given that you do have such sort of advantaged cost of capital when others are looking for it? Thanks.\n\nSumit Roy -- President and Chief Executive Officer\n\nRon, I don't want to overstate the environment. You just need one other competitor to come in and undercut what the normal situation would dictate in terms of cap rates to continue to keep a lid on cap rates. Having said all of that, if you look at the trend lines, there is no doubt that cap rates are moving, and they're moving much faster than -- and I've said this before -- than what I expected. It is also true that clients with whom we have relationships, we've been able to enter into contracts with them where we've asked even from where we first started and didn't have a contract to when they came back and reengaged with us and said, look, the cost of capital environment has changed for us.\n\nThis is what we'll be able to do. They're still chosen to work with us exclusively, and these tend to be larger transactions. So, there is no doubt that having fewer competitors out there who have the cost of capital, to be able to transact that spreads that would be acceptable to their investors, creates an opportunity for us. And this is a relative gain.\n\nWe have been able to move cap rates, but I think it would be overstating if I were to tell you that everything that happens going forward, we are going to be the beneficiary of. That's not the case. But we will do better than our share. I think that, Ron, you can take away from what I'm saying.\n\nRonald Kamdem -- Morgan Stanley -- Analyst\n\nAll right. Thanks so much.\n\nSumit Roy -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Next question will be from Harsh Hemnani of Green Street. Please go ahead.\n\nHarsh Hemnani -- Green Street Advisors -- Analyst\n\nThanks. Going back to the portfolio transactions piece, your peers have pointed out that there's a trade-off between acquisition volume in cap rates. You can always drive higher volume on cap rates and the size. But it seems like because of the ability to drive larger portfolio deals, you can drive both higher volumes than them at higher pricing.\n\nSo, I guess could you point out how much of -- how many basis points of pickup you can get on a portfolio transaction versus maybe a one-off single transaction deal? And how long you think it will take for these higher cap rates to show up in the single transaction market?\n\nSumit Roy -- President and Chief Executive Officer\n\nYeah. Harsh, that's a very difficult question. But if you are forcing me to answer that question, I would say anywhere in the region of 20 to 30 basis points, 35 basis points. And if that -- if the transaction size continues to be bigger and bigger, you're going to start going beyond that is how you should think about it.\n\nThere is a dearth in this particular environment of potential buyers being able to write large checks, and that is our single biggest advantage today, along with the fact that, obviously, on a relative basis, our cost of capital has held up. But it is going to be very much an asset-by-asset, portfolio-by-portfolio discussion in terms of what is that delta between the one-off market and the portfolio market. In terms of how long is it going to take, I'll tell you that a Chick-fil-A -- 15-year Chick-fil-A will still trade in the 4s today. There is enough buyers -- private buyers who can write a check for $5 million or $4 million who don't necessarily need to rely on the debt markets in order to do so.\n\nAnd so, it's a tough question to answer in terms of how quickly the one-off market is going to adjust. There will be an adjustment, there's no doubt because even a lot of the private buyers would lean on the debt markets to finance some of their asset purchase. But it's tough for me to -- I mean, I saw this Chick-fil-A example literally a week ago, and I asked the team what is the ask and what do you think it's going to trade at. And the answer was mid-4s.\n\nAnd so, how long will it take for that to adjust? Who knows? The good news here is it helps us on the disposition side. And if we have one-off assets that we feel like we can take advantage of this market, we'll certainly do so. It's not a big part of our business. But like I said, more than 70% of what we buy are portfolio deals.\n\nAnd so, there, I think we are getting the kind of differential that it warrants. And so, we continue to focus on that side of the business.\n\nHarsh Hemnani -- Green Street Advisors -- Analyst\n\nThanks. And then just considering the timing of moving into Italy, you mentioned that cap rates in Europe haven't reacted as much as those in the U.S., and it feels like the economic outlook do might be slightly worse for Europe than it is in the U.S. Given that backdrop, what caused you to enter Italy today? And I guess, more importantly, what prompted the debt swap that was swapped into euros, which suggests that maybe you're expanding more into Europe?\n\nSumit Roy -- President and Chief Executive Officer\n\nWell, certainly, a part of that swap was to help finance the transactions that we have in Europe, including the one that we did with Metro. Look, that's a fantastic transaction. We started having conversations around this transaction if I want to -- maybe at the beginning of this year, perhaps even late last year. And it's a very interesting geography, Italy is.\n\nIt's the fourth largest GDP in Europe. It is one that we feel like we can find these types of transactions with investment-grade rated or highly rated operators executing very good businesses who are looking for real estate partners. And that's the reason why we find Italy to be very fascinating. The -- and we haven't disclosed the cap rates.\n\nBut suffice it to say, it was a very healthy cap rate. And even in this environment, is allowing us to capture spreads that are very acceptable to us. The point about Europe that I want you to take away is not so much that cap rates taking longer to adjust. It is adjusting.\n\nIt will take longer. But to your point, I think the pain in Europe is going to be a lot longer than the pain that we are planning on experiencing here in the U.S. And therefore, it will create opportunities. And we want to be front in line to take advantage of those opportunities.\n\nAnd I think under Neil's tutelage, the team is very comfortable, continuing to cultivate the relationships that they have established and in some of the areas that we would like to grow our business. That work is already being -- is already underway. And so, this is going to continue to be a very important area of growth for our business. And I want to remind you, Harsh, when you think about when we first went into the U.K., this was in 2019, retail was not in favor.\n\nBrexit has dominated the conversation, and we were able to do deals that subsequent to us having done those deals, cap rates compressed to the tune of 70 basis points, 80 basis points, perhaps even more. And so, we are going to be opportunistic. We are going to position ourselves and use our inherent competitive advantages to execute transactions where it makes sense. But yes, we will be very diligent and very selective.\n\nBut we didn't enter into Europe to shy away when things got rough. We believe the exact opposite that it's going to be at times like this and what we believe will happen in Europe over the next 12 months that will create opportunities for us.\n\nHarsh Hemnani -- Green Street Advisors -- Analyst\n\nThank you.\n\nSumit Roy -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Next question will be from Linda Tsai of Jefferies. Please go ahead.\n\nLinda Tsai -- Jefferies -- Analyst\n\nHi. Thank you. Just a point of clarification. So, in terms of the $31 million and outstanding receivables from Regal, is that all factored into your reserve of $33 million?\n\nChristie Kelly -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nIt's – you know, from the perspective of the reserves, Linda, we took reserves on Regal as we had communicated of $23 million. And there, another $30 million of outstanding receivables associated with Regal to clarify.\n\nLinda Tsai -- Jefferies -- Analyst\n\nOK. But then your -- the reserves you have right now for just tenants on your watch list are $33 million?\n\nChristie Kelly -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nIn terms of the total, we have for the watch list is $33 million, of which $23 million is Regal. And the remainder, as you would understand, is primarily health and fitness.\n\nLinda Tsai -- Jefferies -- Analyst\n\nOK. Thank you. And then just in terms of the recapture rate that was very strong, the 108%, could you just talk about what's driving this overall? It's been strong pretty much all year.\n\nSumit Roy -- President and Chief Executive Officer\n\nYeah. Linda, I think it's a testament to the team. It's a testament to us controlling more assets for given operators. There is certainly a backdrop of -- switching costs have gotten much higher for a lot of our clients.\n\nOne of the things that we would compete with is the ability for our clients to basically say I'm going to go and build a new asset down the road. And that's going to be a better outcome. But now given the inflationary environment, given the construction costs, the switching cost hurdles have certainly crept up. And the fact that we do have 11,700 assets, we tend to control a lot more of the assets for a given client.\n\nAnd so, not talking about leverage, but we can have a much more holistic conversation with clients that not only take into account near-term resolutions, but midterm resolutions as well and come up with a win-win situation, and therefore, be able to get the kind of releasing spreads that we have. Having said all of that, it is quite -- I'm very happy that we were able to do a 108%, but it is -- I want to view it as an outlier. But if you look at the history of the company, since we've been reporting this, we've basically been right around 100%, 101% net of releasing spreads. So, this, on a proportion basis, is certainly higher, and I think it's a testament to the environment we find ourselves.\n\nLinda Tsai -- Jefferies -- Analyst\n\nDo you think this continues for next year?\n\nSumit Roy -- President and Chief Executive Officer\n\nI think near term, you can expect us to continue to be in this particular ZIP code. The one thing that I will say that we are looking into is especially in an environment like this, we will be a little bit more receptive to looking at clients. And look, this is an analysis that we do across the portfolio, what is the best economic outcome. Renewing with an existing client based on the 5% increase, engaging with an existing client that is asking for a 10% reduction from where it's closing, and then looking at the alternative of selling the assets and putting the proceeds to use in the current cap rate environment.\n\nOnce we go through that decision tree, and let's also throw in repositioning of the asset as a fourth variable, we decide what is the most favorable outcome. And so far, the outcome that -- for the last few years has been resulting in north of 103%, 104%, 105% of releasing spreads, but it is possible that it might revert back to 100% or 101% because it is more favorable for us to keep an existing client while taking a bit of a haircut. But over the next six to eight months, I still believe that we'll be north of 100% in terms of recapture rate.\n\nLinda Tsai -- Jefferies -- Analyst\n\nThank you.\n\nSumit Roy -- President and Chief Executive Officer\n\nSure.\n\nOperator\n\nThank you. Next question will be from Nick Joseph from Citi. Please go ahead.\n\nNick Joseph -- Citi -- Analyst\n\nThanks. Sumit, you talked about the volatility, obviously, in your shares, but also really across the space. And so, at this point, there's some diverging multiples in cost of capital. So, hoping to get your thoughts on M&A broadly within the sector and then your appetite for it.\n\nSumit Roy -- President and Chief Executive Officer\n\nYes. Nick, if you can point to candidates who'd be willing to engage in conversations around M&A today, this can be a very interesting time to discuss that. But I suspect that a lot of the management team, Nick, would be very focused on trying to run their business, trying to make sure that they emerge from this particular economic environment stronger so that they can engage in M&A transactions. But theoretically speaking, M&A is something that one should absolutely consider, especially if it's a 100% stock deal and you don't have an overreliance on the public markets on the debt side to help finance.\n\nAnd if your relative cost of capital is stronger, which, in our case, under most circumstances, it is, and that is something that would be very attractive to us. It's just -- it'll be difficult, and I'm just -- it's a hypothetical comment I'm making. It'd be difficult to see management teams of potential companies wanting to engage in that sort of discussion in this environment.\n\nNick Joseph -- Citi -- Analyst\n\nCompletely understand that it takes two there, but that's helpful. And then just -- I know we've talked a lot on cap rates. You called out the casino deal that is still expected to close later this year. I think you mentioned a 5.9 cap rate that was struck earlier.\n\nWhere would that be struck today, do you think? How much cap rate expansion would you expect kind of on the casino cycle?\n\nSumit Roy -- President and Chief Executive Officer\n\nYeah. You know, you tell me, Nick. You cover all the gaming companies. And what I'm seeing is that they've all gotten repriced.\n\nAnd I don't know if we did them the favor or what, but they're trading at levels that I don't know if there'll be a lot of movement from where we entered into the win -- the Encore Boston Harbor asset. But look, I still think that that is a wonderful asset. We underwrote it about a year ago now -- well, not quite, almost a year ago, with a profile of about $210 million in EBITDA, and it is already performing at a $250 million EBITDA, and I still don't believe that it has fully stabilized, especially with gaming -- sports betting, sorry, being legalized. So, I don't know if I would say to you, Nick, that 5.9 would be dramatically different today, but we haven't seen an asset like that yet.\n\nSo, difficult for me to opine on that.\n\nNick Joseph -- Citi -- Analyst\n\nThanks. And where do you think it closes?\n\nSumit Roy -- President and Chief Executive Officer\n\nWe are hopeful, you know, and that's one of the things that we talked about on the earnings guidance. We are expecting to close in the fourth quarter. That remains our conviction. But really as to when in the fourth quarter remains a bit of a question mark, but we still believe that it will close in the fourth quarter.\n\nAnd I have a very high conviction on that front.\n\nNick Joseph -- Citi -- Analyst\n\nThank you very much.\n\nSumit Roy -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nNext question will be from John Massocca, Ladenburg Thalmann. Please go ahead.\n\nJohn Massocca -- Ladenburg Thalmann -- Analyst\n\nGood afternoon. It's been a long call, so just a quick one for me. It sounds like you were surprised by how kind of receptive cap rate environment has been to interest rate changes. Have you seen that kind of same receptiveness to maybe higher escalators, particularly on retail transactions?\n\nSumit Roy -- President and Chief Executive Officer\n\nYes, we have. It's still difficult here in the U.S. to get untethered or uncapped CPIs, especially given the environment that we are in, and retail tends to be a low-margin business, but there is far more receptivity to getting higher interest rate -- higher – what --\n\nChristie Kelly -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nEscalators.\n\nSumit Roy -- President and Chief Executive Officer\n\nEscalators, thank you. Higher escalators in our leases today than it was perhaps 12 months ago. The same discussion on escalators in Europe. It is a lot more easier for us to engage and get CPI-type adjustments.\n\nAnd in fact, the Metro transaction that we talked about has CPI escalators built into the lease. And so, I think those are easier in Europe than it is here, but we are starting to see the seller being more willing to give us higher escalators than what we have traditionally seen in this space.\n\nJohn Massocca -- Ladenburg Thalmann -- Analyst\n\nIn terms of the fixed escalators on kind of U.S. investments, particularly retail, any kind of brackets on how much they've increased maybe versus last year or even pre-pandemic?\n\nSumit Roy -- President and Chief Executive Officer\n\nYeah. John, again, it's going to be a function of the type of retail. The higher-yielding stuff is going to tend to have higher elevation, higher escalators. The investment-grade guys -- it's still going to be tough.\n\nMaybe they'll be willing to give you fixed bumps every five years, which perhaps they wouldn't have 12 months ago. But I mean it's difficult for me to quantify the exact amount of increase in this environment. What I can tell you is we are seeing increases.\n\nJohn Massocca -- Ladenburg Thalmann -- Analyst\n\nUnderstood. That's it for me. Thank you very much.\n\nSumit Roy -- President and Chief Executive Officer\n\nThanks, John.\n\nOperator\n\nThank you. [Operator instructions] Next question will be from Chris Lucas, Capital One Securities. Please go ahead.\n\nChris Lucas -- Capital One Securities -- Analyst\n\nSorry for the long call. Just two quick ones for me, Sumit, and you sort of talked a little bit about or actually frequently about the Encore transaction. The question I have is just are you just waiting for regulatory approval? And once that occurs, you can close immediately? Or is there some other timing issue related to the close?\n\nSumit Roy -- President and Chief Executive Officer\n\nThat is it, Chris. It really is waiting on the regulators to give us a thumbs up. And once we have that, then we'll be in a position to close.\n\nChris Lucas -- Capital One Securities -- Analyst\n\nOK. And then, Christie, just a quick one from me. The -- I guess the other adjustments was about $0.04 a share, which is huge. Not a lot of detail there.\n\nCan you sort of give me some color as to what that breakdown was? I know foreign exchange is a big one. I just don't know how much of it is.\n\nChristie Kelly -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nYeah. The other adjustments was really related on the income statement to noncash-oriented translation loss of about $20 million.\n\nChris Lucas -- Capital One Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. That concludes our question-and-answer session. Now, I'd like to turn the call back over to Mr. Sumit Roy for closing remarks.\n\nPlease go ahead.\n\nSumit Roy -- President and Chief Executive Officer\n\nThanks, Nick. Thank you all for joining us today. We're looking forward to ending 2022 strong and in seeing many of you at the NAREIT conference in two weeks. Good evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAndrea Behr -- Corporate Communications Manager\n\nSumit Roy -- President and Chief Executive Officer\n\nChristie Kelly -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nBrad Heffern -- RBC Capital Markets -- Analyst\n\nR.J. Milligan -- Raymond James -- Analyst\n\nGreg McGinniss -- Scotiabank -- Analyst\n\nMichael Goldsmith -- UBS -- Analyst\n\nWes Golladay -- Baird -- Analyst\n\nJonathan Pong -- Senior Vice President, Head of Corporate Finance\n\nRonald Kamdem -- Morgan Stanley -- Analyst\n\nHarsh Hemnani -- Green Street Advisors -- Analyst\n\nLinda Tsai -- Jefferies -- Analyst\n\nNick Joseph -- Citi -- Analyst\n\nJohn Massocca -- Ladenburg Thalmann -- Analyst\n\nChris Lucas -- Capital One Securities -- Analyst\n\nMore O analysis\n\nAll earnings call transcripts"
}