{
  "companyName": "FiscalNote Holdings, Inc.",
  "companyTicker": "NOTE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/fiscalnote-holdings-inc-note-q2-2022-earnings-call/",
  "content": "FiscalNote Holdings, Inc. (NOTE 13.85%)\nQ2 2022 Earnings Call\nAug 15, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the FiscalNote earnings call. All lines have been placed on mute to prevent any background noise. After the speakers' remarks, there will be a question-and-answer session. [Operator instructions] As a reminder, today's call is being recorded.\n\nI will now hand today's call over to Sean Hannan, investor relations. Please go ahead, sir. \n\nSean Hannan -- Investor Relations\n\nThank you, operator. Good afternoon, and thank you for joining us today to review FiscalNote's second quarter 2022 financial results. With me on the call today are Tim Hwang, chief executive officer; and Jon Slabaugh, chief financial officer and chief investment officer. After prepared remarks, we will open up the call for a question-and-answer session.\n\nDuring this call, we may make statements related to our business that are forward-looking statements under federal securities laws. These statements are not guarantees of future performance but rather are subject to a variety of risks and uncertainties. Our actual results could differ materially from expectations reflected in any forward-looking statements. For a discussion of material risks and other important factors that could affect our actual results, please refer to our SEC filings available on the SEC's EDGAR system and our website, as well as the risks and other important factors discussed in today's earnings release.\n\nAdditionally, non-GAAP financial measures will be discussed on this conference call. Please refer to these tables in our earnings release and the Investor Relations portion of our website for a reconciliation of these measures to their most directly comparable GAAP financial measures. With that, I'd like to turn the call over to FiscalNote's chairman, chief executive officer, and co-founder, Tim Hwang.\n\nTim Hwang -- Chief Executive Officer\n\nThanks, Sean. I'd like to start by thanking all of you for joining us today on our first earnings call as a publicly traded company. FiscalNote recently completed a business combination with Duddell Street Acquisition Corp., a publicly traded special-purpose acquisition company, and are excited to now be a newly listed public company trading on the New York Stock Exchange. After founding the company in 2013 and over nine years of hard work, we are so excited about becoming a public company with the resources and capital to fuel our ongoing organic and inorganic growth and enable us to execute on our long-term business strategy.\n\nThe capital from the business combination and our concurrent senior debt financing provided gross proceeds of $425 million in capital, including an incremental $100 million accordion on our senior term loan. We believe the company now has substantial liquidity and dry powder to execute on our business plan and is fully funded to achieve its goals as a company. And I'll credit this important milestone to the hard work of our global team members, the invaluable guidance of our board throughout the process, our customers, our existing investors who believe in our business and mission as a private company, and our new shareholders joining us today. With that, we're happy to get into it.\n\nWe are excited to share results for the second quarter and our outlook for the remainder of 2022. Our increasing scale, successful acquisition strategy, compounding recurring revenue, and market expansion have allowed us to grow our total revenue 41% year over year. We are proud of the many achievements we have accomplished. In Q2, our consolidated run rate revenue, a key management metric, continued to grow and reached $115 million, up from 109 million exiting 2021.\n\nWe remain quite enthusiastic that our ability to execute against our M&A and organic strategy will continue to build a sustainable baseline for future growth. Net revenue retention was also 99% in Q2. As we look toward our performance at the end of the year, we wanted to reiterate and reaffirm our guidance for consolidated run rate revenue of 173 million as we exit 2022. To exit run rate growth of 59% would constitute a mix of organic and inorganic growth strategies that we will go into later in the earnings presentation.\n\nSubsequently, we continue to make meaningful progress against our path to profitability, and we expect to achieve positive adjusted EBITDA within the fourth quarter of 2023. While we intend to focus on growth, we want to do so efficiently and sustainably as we enter 2023 and beyond. We believe that sustainable growth is achievable through a combination of growth initiatives and efficient allocation of resources, particularly as we gain more scale. Jon, our CFO, will talk in a few moments to our Q2 financial results in detail.\n\nAs this is our first earnings call as a public company, we'd like to take a moment to share with everyone about who we are, what we do, and our efforts as both a market leader and category creator. The problem that we're trying to solve for our customers is the management of the overwhelmingly large amounts of information that executives, corporations, government agencies are facing every single day when it comes to understanding the impacts of public policy, geopolitical, legislative, and regulatory changes throughout the world. We live in a complex and fast-changing world today. And whether you're talking about a plastic bag ban in a specific municipality, geopolitical or supply chain challenge due to a war or regime change, a major infrastructure piece of legislation in Congress, or major public policy change coming out of a particular central bank, our customers need to navigate these challenges every day and need critical information to do so.\n\nToday, they need to sift through trillions of dollars in government spending and dense budget books, policy statements by elected officials around the world, and millions of pages of legal and regulatory text, a large and tremendous amount of information. At the same time, CEOs and boards, in particular, are under a significant amount of pressure to respond and comply with these political changes. FiscalNote uses AI and cloud-based workflow software to build products that automatically sift through these documents and help our customers understand the impact of policy in governments to their organizations. Given the state of the world and the significant geopolitical uncertainty that exists, our mission-critical, need-to-know products and solutions are better positioned now more than ever to help navigate the global risks and uncertainty organizations are facing.\n\nNot only do we have a comprehensive suite of solutions to monitor the present state and help our customers understand what's going on in the world, we also have the additional essential insights, data, and workflow software that helps clients anticipate future outcomes from a geopolitical, economic, and brand reputation perspective to help our customers understand what is going on in the world and what they can do about it. Additionally, with regards to the macro environment, our products are becoming more and more relevant. For instance, the more Congress is gridlocked when the Supreme Court enacts major policy changes, time is of the essence for organizations to make their voices heard, advocate, or come into compliance before it's too late. Our tools can help them do that.\n\nSimilarly, with elected officials at the state level, upcoming legislative sessions will have an increased spotlight and will need to be ready to respond with what is [Inaudible] communication in court. Today, FiscalNote is a crucial technology and embedded workflow on the desk of the world's most important decision-makers, servicing thousands of organizations from hundreds of government agencies, from Congress to the White House, the CDC, and the Department of Defense, to over half the Fortune 100 who looked at FiscalNote to help them navigate these challenges. Just in the second quarter of 2022, FiscalNote entered into new, renewed, or expanded relationships with leading global brands and government entities such as Nestle, Boeing, Paycom, and a number of leading U.S. and global government institutions.\n\nWe've built a talented global workforce across the U.S., Europe, Asia, and Australia to support the needs of our customers. And so, it was back in 2013 that my co-founders and I embarked on this journey to create a technology platform to help us solve these modern-day challenges. We built this company step by step from our initial idea in a Motel 6 room in Silicon Valley to what it is today. Our technology delivers critical legal, policy, and economic information in an uncertain world.\n\nThis can be in a similar manner in which you might use an S&P Global CapIQ, IHS Markit, FactSet, Avalara Tax Research, or Bloomberg Terminal. So how does it all come together? We've invested in our technology since 2013, and it built a robust technology stack for the ingestion, storage, processing, access, and delivery of this large amount of policy and regulatory data that forms the foundation of our business. Additionally, our patented AI-enabled core technologies offer trend identification, discovery and alerting, entity extraction, and predictive analytics. And we've leveraged our technology to provide users with curated data for analysis and present them with relevant mission-critical golden policy information and market intelligence within the context of tailored SAS cloud-based workflows to guide our customers across a complex information ecosystem.\n\nThese intuitive and embedded workflow products, combined with our data network effects and analytics, form the basis for a highly sticky and defensive product over time. We believe we have a massive $37 billion global market opportunity that we're chasing, which is a wide-open space driven by clear market tailwinds. These tailwinds are driven by a couple of things. Number one is the proliferation of regulatory complexity.\n\nAs the complications of regulations continue to increase, they drive more impact. From a public policy perspective, we strongly believe that that's going to continue to drive demand for our products. That's augmented by the need for demand in terms of workflow efficiency and automation in the legal space and the need for aggregation and standardization when it comes to legal and policy information, in particular. We are still extremely early in the adoption of cloud and AI-enabled tools for understanding geopolitical updates and believe we are well-positioned to win in the space.\n\nIn order to capture this growing opportunity, we need to increase the growth trajectory of the business by increasing our sales capacity and continuously acquiring more customers. From there, we tactically drive broader land-and-expand, effectively looking at our existing customer base and being able to upsell the more. Simultaneously, we're looking at incremental growth opportunities and new customer segments such as sustainability and ESG professionals and geographies such as our continued growth in the European and APAC markets. We've had great historical success driving increase in average contract values through our larger deals and bundles of products, as well as multiyear engagement support base of our renewals.\n\nThis is the result of our multiproduct value proposition and our market leadership that we've established through our product portfolio. We see further expansion of our TAM as you grow our suite of products to offer solutions for regulated industries of the future, such as gig economy, autonomous vehicles, ESG, or cryptocurrency. From a customer's standpoint, we are quite diversified with a high-quality blue-chip customer base touching heavily regulated industries and expect those characteristics for our business to continue. Our growing scale and customer base is anchored by various government entities that collectively comprise about a quarter of our revenue and consistently and reliably deliver the foundation of our revenue, while the rest of our verticals include industries like healthcare, finance, energy, retail, business services, and others.\n\nThis customer base spans multiple geographies, sizes, and industries, and we're proud of the growing ubiquity of our products. We're largely an inside sales model, and our buyers are not only very senior executives of companies but also senators, members of Congress, and elected officials at the federal, state, and local levels. M&A is also an important part of our value creation. We leverage M&A to build, buy, and grow a number of different assets within our product portfolio.\n\nOur strategy enhances the number of content and datasets we're delivering for our customers, as well as builds new workflow or software capabilities that add more value collectively to our customers and subsumes more of our client's workflow over time. The investments that we made in cloud and artificial intelligence technologies enable us to rapidly ingest new datasets into our platform and bolt on new workflow capabilities to enrich our customer experience. Our M&A strategy revolves primarily around identifying new content or datasets we can bring into our platform or new workflow capabilities that enhance the usability of our customer experience over time. A recent acquisition of Aicel is a prime example of the type of business we seek to bring into the FiscalNote family.\n\nAicel is a rapidly growing alternative data company collecting and selling information pertaining to macroeconomic conditions through the use of credit card transaction data, e-commerce activity, etc. They're based in Seoul in South Korea, and the company greatly enhances the breadth and scope of our offerings that we provide and enriches a new way of getting information on macroeconomic performance. The addition of their business also accelerates our market leadership not only in that macroeconomic information space but also in the APAC region as a whole, catalyzing increased opportunities for our growth, access to a wider base of customers, and the addition of key engineering, AI, and R&D talent. Particularly when we perform M&A, we're extremely stringent and disciplined about transaction structure, price, and about the alignment to our core competencies, whether they be around government or some form of emerging regulated issue, or around our commercial competencies as defined by our business model, selling information and workflow on a recurring subscription basis.\n\nHistorically, our sweet spot has been companies that are between 5 million and 15 million recurring revenue, have deeply embedded customers, and are sizable for us to bolt on and manage appropriately within our growing base of customers. This helps us efficiently manage our executives' attention, drive quick and decisive acceleration of growth while preserving and protecting the organizational culture we developed over time. As such, we have developed an organizational playbook for acquisition and integration and a track record of value creation that involves bolting on products and rapidly accelerating growth through commercial execution. The completion of our listing and the fortitude of our balance sheet will only accelerate our historical pace of M&A.\n\nWe have a robust M&A pipeline and are very excited about these prospects as we look forward to providing you further updates around our efforts through 2022 and beyond. Overall, for FiscalNote, we are excited about our targeted investments and new high-growth opportunities such as global geopolitical insights and macroeconomic market intelligence that will continue to provide a sustainable competitive advantage and solidify our position as a category creator. For instance, we recently launched our ESG Solutions business, further enhancing our emerging ESG business that provides carbon, climate, and ESG data management software, as well as news, research, and analysis for ESG professionals, and continue to make investments in products like Curate that offers local information on the activities of municipalities, counties, and now school boards around the United States, the organizations and businesses who sell into these trillions of dollars in local and state government spending. Further, our expanding product portfolio continues to position us to more efficiently deliver incremental value to our customers and increase retention through cross-sell opportunities to help them navigate current hot topics such as inflation, supply chain issues, and emerging ESG challenges.\n\nAs a result of all these characteristics and our continued financial performance, we strongly believe that we are a long-term growth compounder and are well-positioned to grow in both good times and bad. Finally, we believe we're building a disruptive global data company in a new era of technology that will position FiscalNote to gain greater scale and drive significant shareholder value over time. We are aligned in our mission to build the next great technology information business, and I'm confident that our experienced and talented management team will continue to deliver and execute toward this goal. Thank you for your time.\n\nAnd with that, I'll hand over the call to Jon Slabaugh, our chief financial officer and chief investment officer.\n\nJon Slabaugh -- Chief Financial Officer and Chief Investment Officer\n\nThank you, Tim. It's great to connect with both existing and prospective shareholders in FiscalNote's first call as a public company. As Tim mentioned, we're excited about the listing for many reasons. One of them is the simplification of our capital structure.\n\nWe have entered the public markets with approximately $92 million of cash on the balance sheet and a senior term loan of $150 million with additional availability of up to $100 million. Accordingly, we have the liquidity to execute on our M&A strategy and make all the necessary investments to achieve year-end run rate revenue of $173 million. Our capital position fully funds FiscalNote's path to positive adjusted EBITDA within the fourth quarter of 2023. In summary, FiscalNote has a strong and durable organic growth profile, and we will realize increasing margins as we scale and drive operating efficiencies.\n\nCombined with our current M&A pipeline, we are confident in the run rate revenue guidance for the year. Q2 was a solid quarter for the company on many fronts. I'm excited to share these results and update our 2022 expectations. Before jumping into second-quarter results, I want to point out that I will reference some KPIs and non-GAAP financial metrics.\n\nYou can find a reconciliation of GAAP to non-GAAP financial measures in the financial statement tables included in the earnings release issued earlier today. For the second quarter, GAAP revenue was $27.2 million, up 41% versus $19.3 million for the same period last year. In Q2, GAAP revenue was affected by currency fluctuations, a shift in timing for a few large enterprise and government contracts, and in this year, the timing of a public listing. Overall, we're proud of these results.\n\nThe year-over-year growth demonstrates strong customer demand for our products and continued execution of our inorganic growth strategy. Subscription revenue, which makes up approximately 90% of our revenue, was $24.3 million, up 40% and $17.4 million a year ago. This growth is attributed to new logo acquisition, as well as the successful integration and cross-selling of the 2021 acquisition cohort. For Q2, advisory, advertising, and other revenue was $2.8 million as compared to $1.9 million a year ago.\n\nTotal adjusted revenue for Q2, factoring in deferred revenue adjustments, was $27.9 million, up 42% from $19.7 million in the same quarter last year. As Tim mentioned, FiscalNote's run rate revenue exiting June was $115 million, up from $109 million exiting 2021. For context, run rate revenue is a key management metric defined as ARR plus nonsubscription revenue earned during the last 12 months. On a pro forma basis, FiscalNote's ARR rose to $103 million as of June 30, 2022, compared to $89 million on June 30th, 2021.\n\nNet revenue retention, or NRR, measures our success in retaining and growing ARR from our existing customers. NRR was 99% for the quarter ending June 30th, 2022 versus 101% for the same period in 2021. The net revenue retention can fluctuate from quarter to quarter, especially as we fold in results from prior-year acquisitions. Moving down the income statement.\n\nCost of revenue in Q2 was $7.7 million, up from $5.1 million in the same quarter last year. Adjusted gross profit for the quarter was $22.2 million, up 39% from 15.9 million a year ago. The increased cost relates to integrating acquisitions, and the overall adjusted gross profit margin remains relatively consistent at 80% in Q2 when compared to 81% a year ago. We continue to invest in our sales force.\n\nSales and marketing costs were $10.4 million in Q2, up 49% from $7 million in Q2 2021. R&D expenses were $3.8 million, down 37% from $6 million a year ago. Please note that the decline in R&D expenses was in part due to increased software capex. Editorial costs in Q2 were $3.3 million, down 10% from $3.7 million in Q2 2021.\n\nG&A expenses were $10 million, up 32% from $7.6 million a year ago. The G&A increase was primarily related to the cost of becoming a public company. Net loss for Q2 2022 was $37.8 million, compared to $34.1 million a year ago. Adjusted EBITDA for Q2 was a loss of $5 million, a 24% improvement from a loss of $6.6 million a year ago.\n\nTurning to our guidance for 2022. FiscalNote is a growth company, and management measures success through the growth of our run rate revenue and ARR KPIs. We feel these metrics best capture revenue growth and provide insight into future performance. At this stage, we do not provide forward-looking GAAP revenue guidance.\n\nFor our business, GAAP revenue is a lagging measure of performance, often affected by currency fluctuations, the timing of large enterprise and government contracts, and in this year, the timing of our public listing. FiscalNote has a track record of strong second-half sales, and we have confidence in achieving our year-end organic run rate revenue target of $136 million. With a robust M&A pipeline and the capital to execute our acquisition strategy, we're confident in achieving our year-end total run rate revenue target of $173 million. As always, management will prioritize these strategic acquisitions to drive the highest return for FiscalNote's shareholders.\n\nFiscalNote will fund acquisitions with a combination of existing cash, equity grants, and increases in our senior debt accordion. Our capital allocation strategy will optimize for the lowest weighted average cost of capital. FiscalNote has been very successful using private stock to attract entrepreneurs and business owners who want to be part of a larger growth story. FiscalNote's public equity will be even more attractive in this regard.\n\nOur adjusted EBITDA loss is expected to be approximately $23 million for 2022 as we continue to make progress in driving efficiency toward our reiterated goal of positive adjusted EBITDA within the fourth quarter of 2023. In summary, we are very pleased with our performance in the second quarter. FiscalNote looks forward to building on this track record of success as we move ahead. In closing, we're very excited about the future and continuing Tim's mission to build a sustainable, high-growth business.\n\nWe are a category creator addressing the critical need for geopolitical and market information. FiscalNote's growth is accelerated by the adoption of workflow software. We continue to invest in our people, innovation, and customer relationships to drive growth. FiscalNote is a first mover in a massive market opportunity.\n\nWe capitalize on our strong market leadership position, and we believe FiscalNote is very well-positioned for the long term. With that, I will now open it up to questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] We'll pause for just a moment to compile the Q&A roster. Your first question is from the line of Mike Latimore with Northland Capital.\n\nMike Latimore -- Northland Capital Markets -- Analyst\n\nAll right. Thank you. Yeah. Congrats on being public and the strong outlook out of the gates here. \n\nTim Hwang -- Chief Executive Officer\n\nYeah. Yeah. Great to be on and great to be public here.\n\nMike Latimore -- Northland Capital Markets -- Analyst\n\nSo, I guess to start, a couple of things. You know, part of strategy is obviously to cross-sell and upsell. And I guess can you talk a little bit about how your deal sizes are trending? And also, you know, you have price increases kind of embedded in these current contracts. You know, how do you deal with kind of price increases?\n\nTim Hwang -- Chief Executive Officer\n\nYeah, yeah, absolutely. So, obviously, as we've continued our strategy to diversify our product lines, both through organic and inorganic strategies, we have been, you know, fairly successful at driving that cross-sell and upsell approach. And, you know, that has resulted, generally speaking, in increasing average contract values relative to what they were in prior years. So, it's something that we'll continue to monitor as an organization.\n\nYou know, part of that is driven by some annual price increases, which I think are potentially in line with inflation and other things. But those are subject to our desire, of course, to also drive multiyear engagement with our customers as part of our ongoing negotiations. I guess, Jon, I don't know if there's anything else you wanted to add there as well.\n\nJon Slabaugh -- Chief Financial Officer and Chief Investment Officer\n\nThe other thing I would add is this year, it might have, you know, increased inflation. We have been diligent about putting minimum and inflation-indexed inflators into the contracts.\n\nMike Latimore -- Northland Capital Markets -- Analyst\n\nOK. And then in terms of the sales headcount, I know that's part of the investment here. Maybe can you give an update on just the quota-carrying sales headcount and how fast you expect to grow that this year?\n\nTim Hwang -- Chief Executive Officer\n\nYeah. We don't disclose, in particular, the number of sales capacity heads that we have on any given basis. But what we will say is that we have continued to increase that capacity, you know, quarter to quarter and year over year. You know, on top of that, you know, it is an ongoing part of our strategy on a growth perspective to continue to get new customers and new logo and in addition to driving that cross-sell/upsell.\n\nSo, you know, in particular, I think we have talked about this in the prepared remarks but also in prior presentations. We're very excited about, you know, new customer growth categories in places like Europe and Asia in addition to kind of these regulated sectors of the future ESG or compliance or state and local governments that require a little bit of specialization in terms of our sales capacity hires. But, you know, we're obviously -- you know, continue to make good progress and expand that capacity. \n\nMike Latimore -- Northland Capital Markets -- Analyst\n\nOK. Great. Thank you. Best of luck for the rest of the year. \n\nTim Hwang -- Chief Executive Officer\n\nGreat. Thank you.\n\nOperator\n\n[Operator instructions] Your next question is from the line of Rudy Kessinger with D.A. Davidson.\n\nNima Rad -- D.A. Davidson -- Analyst\n\nHey, guys, this is Nima on for Rudy. Congrats on the good quarter and your first quarter as a public company. I was wondering, of the 2021 acquisition cohort, do you have any that you would call out as being the most success? And then any way to quantify that success? \n\nTim Hwang -- Chief Executive Officer\n\nYeah. Well, appreciate the question. So, we don't disclose the individual performance of our acquired companies, and that's largely because we effectively fold the company into some product categories or some bundling strategy that makes it fairly difficult to pull those things out overall. Generally speaking, I would say, in line with what's going on in the world today, some of the fastest-growing elements of our business, which we've kind of bolstered on over the course the last couple of quarters, are places like really helping our customers understand geopolitical risk or macroeconomic risk as it pertains, you know, to the conflict in Eastern Europe, you know, monetary and fiscal policies by policymakers around the world, and ongoing kind of political challenges in the United States.\n\nAnd so, the general kind of product lines that kind of support those types of initiatives, I think, have been fairly successful. So, I'll call out, you know, two as the kind of most recent examples. Curate, which we called out in our earnings release, is a kind of local and state government monitoring platform that obviously bolstered our capabilities in looking at municipalities and county governments and school boards and the like. That, of course, has been very successful in terms of, you know, bolstering on our existing policy-monitoring capabilities.\n\nThe other, I would say, is FrontierView, which has quite a significant amount of information helping decision-makers and customers navigate ongoing macroeconomic challenges or investment decisions in emerging markets as it pertains to policymakers and the decisions that they're making on a day-to-day basis. Those are obviously in line with, you know, general macro trends and, to my earlier remarks, you know, are – kind of have been a great success in terms of, you know, kind of plugging into our existing go-to-market machine and really being able to drive acceleration. \n\nNima Rad -- D.A. Davidson -- Analyst\n\nGot it. That's very helpful. Thank you. And then, I was also curious with regard to the VoterVoice product.\n\nDo you guys expect any tailwinds in the second half as a result of the midterms coming up?\n\nTim Hwang -- Chief Executive Officer\n\nYou know, it's a good question. You know, I would say, as a general rule, you know, whenever there is increased political activity and political focus, many of our customers, you know, do use our VoterVoice product line to effectively go out there and, you know, go to the membership bases and, you know, try and, you know, rally them up or, you know, contact members of Congress or whatever the case may be. And so, you know, we do see, generally, increases in activity or, you know, usage of the individual product line. But, you know, given the elevated rate of political activity, particularly in that over the course of the last couple of years, I wouldn't say that there's a significant level of fluctuation only because there's just been such a increased rate of political activity.\n\nAnd so, hard to say. You know, with respect to any particular elections, that's obviously been great beneficiaries of that political activity over time.\n\nNima Rad -- D.A. Davidson -- Analyst\n\nGot it. And then one last one for me. So, I see you guys in the outlook for '22 that you reiterated, you're calling out organic run rate revenue to accelerate to 136 million. And I was just wondering, is it possible to get that number for this quarter to see where you guys are at?\n\nTim Hwang -- Chief Executive Officer\n\nAre you talking about Q3 -- the upcoming Q3 or Q2?\n\nNima Rad -- D.A. Davidson -- Analyst\n\nFor Q2.\n\nTim Hwang -- Chief Executive Officer\n\nSo, we do call it out in our earnings release. You know, with respect to -- you know, just as we think about sort of quarter-to-quarter kind of run rate guidance, I would generally say that, you know, because of the way in which we kind of book our contracts, you know, some makes kind of fluctuate from quarter to quarter. But, you know, we do have very strong visibility as you look toward the end of the year. And so, that's what gives us a pretty significant level of confidence as we kind of go into the reaffirmations we made.\n\nBut I'll kind of defer to Jon to talk about this quarter and, you know, kind of ongoing trends for the rest of the year.\n\nJon Slabaugh -- Chief Financial Officer and Chief Investment Officer\n\nSure. Hi, Nima. The press release highlights $115 million this quarter. And as Tim said, you know, we're on pace and review the pipelines weekly with the teams here.\n\nAnd that's what gives us confidence in kind of the continued ramp toward the end of the year.\n\nNima Rad -- D.A. Davidson -- Analyst\n\nGot it. Thank you very much for taking my questions.\n\nOperator\n\nAt this time, there are no further questions. I will now hand today's call over to the presenters for any closing remarks.\n\nTim Hwang -- Chief Executive Officer\n\nGreat. Well, thanks, everybody. Obviously appreciate everybody jumping on here. We're very excited about our -- you know, the beginning of our life as a publicly traded company, so you know, absolutely looking forward to continuing to post great results.\n\nDuration: 0 minutes\n\nSean Hannan -- Investor Relations\n\nTim Hwang -- Chief Executive Officer\n\nJon Slabaugh -- Chief Financial Officer and Chief Investment Officer\n\nMike Latimore -- Northland Capital Markets -- Analyst\n\nNima Rad -- D.A. Davidson -- Analyst\n\nMore NOTE analysis\n\nAll earnings call transcripts"
}