{
  "companyName": "Global-e Online Ltd.",
  "companyTicker": "GLBE",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/16/global-e-online-ltd-glbe-q3-2022-earnings-call-tra/",
  "content": "Global-e Online Ltd. (GLBE 1.32%)\nQ3 2022 Earnings Call\nNov 16, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Global-e third quarter 2022 earnings call. This call has been simultaneously webcast on the company's website, in the Investors section, under News and Events. For opening remarks and introductions, I'll now turn the call over to Eric Mannion -- Erica Mannion at Sapphire Investor Relations. Please go ahead.\n\nErica Mannion -- Investor Relations\n\nThank you, and good afternoon. With me today from Global-e are Amir Schlachet, co-founder and chief executive officer; Ofer Koren, chief financial officer; and Nir Debbi, co-founder and president. Amir will begin with a brief review of the business results for the third quarter ended September 30, 2020. Ofer will then review the financial results for the third quarter ended September 30, 2022, followed by the company's outlook for the fourth quarter and full year of 2022.\n\nWe will then open the call for questions. Certain statements we make today may constitute forward-looking statements and information within the meaning of Section 27A of the Securities Act of 1933, Section 21E of the Securities Exchange Act of 1934, and the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995 that relate to our current expectations and views of future events. These forward-looking statements are subject to risks, uncertainties, and assumptions, some of which are beyond our control.\n\nIn addition, these forward-looking statements reflect our current views with respect to future events and are not a guarantee of future performance. Actual outcomes may differ materially from the information contained in the forward-looking statements as a result of a number of factors, including those set forth in the risk -- set forth in the section titled Risk Factors in our prospectus filed with the SEC on September 13, 2021, and other documents filed with or furnished to the SEC. These statements reflect management's current expectations regarding future events and operating performance and speak only as of the date of this call. You should not put undue reliance on any forward-looking statements.\n\nAlthough we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee that future results, levels of activity, performance, and events and circumstances reflected in the forward-looking statements will be achieved or will occur. Except as required by applicable law, we make no obligation to update or revise publicly any forward-looking statements, whether as a result of new information, future events, or otherwise, after the date on which the statements are made or to reflect the occurrence of unanticipated events. Please refer to our press release dated November 16, 2022, for additional information. In addition, certain metrics we will discuss today are non-GAAP metrics.\n\nThe presentation of this financial information is not intended to be considered in isolation or as a substitute for or superior to the financial information prepared and presented in accordance with GAAP. We use these non-GAAP financial measures for financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe that these measures provide useful information about operating results, enhance the overall understanding of past financial performance and future prospects and allow for greater transparency with respect to key metrics used by management in its financial and operational decision-making. For more information on the non-GAAP financial measures, please see the reconciliation tables provided in our press release dated November 16, 2022.\n\nThroughout this call, we provide a number of key performance indicators used by our management and often used by competitors in our industry. These and other key performance indicators are discussed in more detail in our press release dated November 16, 2022. I will now turn the call over to Amir, co-founder and CEO.\n\nAmir Schlachet -- Co-Founder and Chief Executive Officer\n\nThank you, Erica, and welcome, everyone. We report to you today our results for the third quarter of 2022, which represents another very strong quarter for Global-e. Despite various headwinds in the form of prevailing and complex macroeconomic conditions in the market and the ongoing war in Ukraine, Global-e continues its high pace of growth across all business parameters. We delivered revenues of $105.6 million in Q3, representing 79% growth year on year.\n\nAnd our GMV for Q3 totaled $621 million, growing 77% year on year. Both GMV and revenues came in over our forecasted range, beating the midpoint of the range by 2.3% and 4.5%, respectively. Our adjusted gross profit for the quarter was $43.8 million, representing a very strong growth of 92% year on year, outpacing our revenue growth as we continue to pursue economies of scale benefits and realize COGS synergies with flow. Our adjusted gross profitability was 41.5%, up from 38.6% in Q3 of 2021.\n\nAs Ofer will elaborate on later in this call, it is important to note that this is the first quarter in which we include in our results the figures from the Borderfree activity, which we acquired in July of this year. In terms of our operational expenses, we continue to reinvest in growing the business across all business lines and departments, but at the same time, continue to maintain strict cost control over all discretionary spending to ensure our ability to continue delivering strong profitable growth. As such, our adjusted EBITDA came in at $12.5 million, compared to $7.7 million in Q3 of last year. Adjusted EBITDA margin quarter was 11.9%.\n\nMoving on from the financial results, I would like to give you some updates regarding the many exciting developments in our business during the last quarter. On the merchant activity front, demand for our services continues to remain strong as more and more brands around the world put direct-to-consumer and cross-border sales at the crosshairs of their growth strategy. During the third quarter, we continued to launch with many new brands, among which were the U.S.-based toy brand Mattel Creations, part of the Mattel group of brands; the fast-growing T-shirt brand, True Classic; the online store of the prominent fashion designer, Karl Lagerfeld; the classic high-end London-based brand Drakes; as well as the merchandise store of the famous italian Football Club Inter Milan further expanding our reach into the football clubs vertical. We also went live during Q3 with the innovative sportswear brand, Squatwolf, our first-ever merchant based in the United Arab Emirates.\n\nWe continued our expansion in the luxury segment as well from the high-end shoes by Spanish designer Manolo Blahnik to Buccellati of the Richemont Group to three additional LVMH Maisons, KVD, Ole Henriksen, and Stella by Stella McCartney, all going live during the third quarter. In addition, during the quarter, several brands expanded the list of their lanes operated by Global-e, including Suunto, which once again added additional names, Anine Bing which opened up its European site, Hugo Boss, and others. While we continue to grow our business in our bookings pipeline across our existing product lines and geographies, I'm also happy to share that we are continuing to make significant progress in several of our business development initiatives, which we have shared with you in the past. For example, the leading consumer electronics brand Jabra, expanded its suite of services with Global-e, launched its presence on Amazon Japan through Global-e's marketplace connectivity offering, which is a pilot phase.\n\nAnother example is Global-e's demand generation offering, which is already serving over 40 merchants. Over the next few quarters, we expect these initiatives to gradually expand to more merchants and geographies, as well as others to start and take shape. Turning to our indirect go-to-market channels. Our ecosystem of partners around the globe continues to support our robust bookings in the markets we are already established in, as well as our international expansion efforts.\n\nWe continuously strive to expand this ecosystem with Google being the latest partner with whom we signed a referral partnership agreement. Our strategic partnership with Shopify also remains very much on track with great product advancements and high engagement between the respective teams on all levels. On the direct side, the stream of merchants going live using our new native integration is continuing to accelerate as this is now the default integration for any new Shopify-based merchant. On the white label solution front, alpha trials were successfully completed with Shopify recently granting early access to the solution, Shopify Markets Pro for a small subset of relevant merchants.\n\nWe continue hand-in-hand with Shopify down the planned road toward general availability next year. We remain highly optimistic regarding the long-term potential of our strategic partnership with Shopify. With regards to our corporate development efforts, with the slow post-merger integration done, our team's attention is focused primarily on integrating Borderfree into the organization. By now, all of Borderfree teams have been integrated into the relevant teams within Global-e.\n\nWork is currently on its way to write many possible COGS synergies to gradually migrate Borderfree's merchants onto the Global-e platform and to put into use several models, assets, and capabilities that have been built by Borderfree as part of our future platform development. We expect this integration work to continue over the next several quarters with synergies gradually realized along the way. In parallel, we are working on building our road map for the growth of the marketing and demand generation capabilities we acquired as part of the transaction, as well as the extended partnership with Pitney Bowes advanced logistics solutions and joint approach to merchants. In summary, and taking all of the above into account, we are very pleased with how the first three quarters of 2022 have unfolded.\n\nWe believe this strong performance, in spite of the unusually volatile conditions in the market, is a true testament to the robustness of our model, our clear market leadership position, and our execution capabilities. Moreover, as we look toward next year and beyond, we remain extremely enthusiastic regarding the global e-commerce market's long-term growth potential, compounded by the growing adoption of direct-to-consumer as a key channel for brands on a global scale. However, and in order to err on the side of caution, we have decided to slightly lower our GMV and revenue forecast for 2022 by 2.5% and 2% at the midpoint of the range, respectively, in order to take into account two extraordinary factors which we anticipate will have an unusually large adverse effect on our Q4 results. First is the effect of the unusually large foreign exchange swings, which worsened through the third quarter and into November, especially those of the U.S.\n\ndollar vis-a-vis other major currencies. The other factor is the go-live of a very large merchant, which was originally planned for Q4, but at the last minute was postponed to Q1 of 2023. At the same time, though, we have decided to update our full-year adjusted EBITDA guidance upwards by 3.4% as we have managed to progress more than we initially expected on cost optimization, including a move to reduce workforce headcount as part of synergy realizations post the Borderfree acquisition. At the midpoint of the range, our 2022 annual revenue forecast represents a massive 66% growth year on year.\n\nWe believe that such fast growth, well above the growth rates of the e-commerce market itself, represents the immense greenfield opportunity which lies ahead of us for years to come as more and more merchants around the globe put the cross-border direct-to-consumer channel front and center in their future strategic plans. And with that, I will hand it over to Ofer, our CFO, to dive deeper into our quarterly financial results and provide some additional details regarding our outlook for the full year of 2022.\n\nOfer Koren -- Chief Financial Officer\n\nThank you, Amir, and good afternoon, everyone. This has been another strong quarter on all fronts as we continue to demonstrate fast growth, coupled with healthy margins amid the macro environment, which continues to be challenging and volatile. Despite the macro headwinds, the fundamentals of our business model remains strong and durable, and we continue to see a clear path of rapid profitable growth. Before moving to the numbers, please note again that this is the first quarter in which we incorporate Borderfree into our financial statements.\n\nAs Amir already mentioned, our fast growth in GMV continued in Q3 as we generated $621 million of GMV, an increase of 77% year over year. While the overall e-commerce market growth has slowed down in 2022, our cross-border opportunity remains massive as merchants are continuing to put direct-to-consumer in the front-end center of their strategy which results in cross-border direct-to-consumer continuously gaining share over other channels and growing. In Q3, we generated total revenues of $105.6 million, up 79% year over year. Service fees revenues were $47.8 million, up 108% and fulfillment services revenue were up 60% to $57.8 million.\n\nService fee revenues continued to grow faster compared to fulfillment services revenue, driven by growth of our multi-local offering and the revenue mix of Borderfree, which is characterized by a higher share of service fees. U.S. outbound revenue continued to grow rapidly. In Q3, U.S.\n\noutbound revenue was up 184% year over year, driven by strong growth of the Global-e platform U.S. outbound business coupled with the high share of U.S. outbound on the Borderfree platform. Our penetration efforts into new markets are continuing to show positive signs.\n\nAPAC and the Middle East outbound revenue, which are 3% of the total revenue, have grown 496% year over year. Our non-GAAP gross profit growth continue to outpace top-line growth. In Q3, non-GAAP gross profit was $43.8 million, up 92% year over year, representing a margin of 41.5%, compared to 38.6% in the same period last year despite Borderfree's lower margin. This was primarily driven by the positive impact of higher share of service fee revenues, the realization of Flow and Borderfree cost of goods sold synergies, and continuous optimization efforts.\n\nGAAP gross profit was $40.8 million. Moving on to operational expenses. We continue to invest in the development of the Global-e enterprise and SMB platforms with emphasis on the new white label offering to power Shopify markets grow. R&D expense in Q3, excluding stock-based compensation, was $16.6 million or 15.7% of revenue, compared to $6.4 million or 10.8% in the same period last year.\n\nTotal R&D spend in Q3 was $22.2 million. The increase of R&D expense as a percentage of revenue is primarily driven by the consolidation of Flow and Borderfree. We continue to invest in sales and marketing, enabling us to generate a robust and diversified pipeline while maintaining efficiencies. Sales and marketing expense, excluding Shopify warrants-related amortization expenses, amortization of acquired intangibles, and stock-based compensation, was $9 million or 8.5% of revenue, compared to $5.2 million or 8.8% of revenue in the same period last year.\n\nShopify warrants-related amortization expense was $37.4 million. Total sales and marketing expense for the quarter, including Shopify warrants and related amortization expenses, were $52.9 million. General and administrative expenses, excluding stock-based compensation, acquisition-related expenses, and acquisition-related contingent consideration, were $6.2 million or 5.9% of revenue, compared to $3.6 million or 6.1% of revenue in the same period last year. Total G&A spend in Q3 was $18.9 million.\n\nAdjusted EBITDA continued to be well on track. Adjusted EBITDA totaled $12.5 million, representing an 11.9% adjusted EBITDA margin increasing from $7.7 million in the same period last year despite the continued reinvestment into the business. We continue to focus on optimization and synergies realization to further support adjusted EBITDA growth. Turning to the balance sheet and cash flow statements.\n\nWe ended the quarter with $191 million in cash and cash equivalents, including short-term deposits and marketable securities. Net operating cash flow used in Q3 was $4.2 million, compared to generated cash flow of $5.5 million in the same quarter a year ago. Net operating cash flow in the quarter was negatively impacted by one-off Borderfree transaction-related expenses of $7.2 million and out-of-the-ordinary financial expenses of $10.9 million mainly due to the impact of USD revaluation on non-USD balances held as part of our day-to-day cash management. Moving to our financial outlook and guidance for the full year 2022.\n\nAs Amir mentioned, due to the unusually high FX headwinds, as well as a very large merchant postponing its go-live by quarter, we have updated our full-year GMV and revenue outlook by 2.5% and 2%, respectively. We now expect 2022 GMV to be in the range of $2,419 million to $2,459 million. At the midpoint of the range, this represents a growth rate of 68% versus 2021. Of this, Borderfree is expected to contribute $125 million to $135 million of GMV for the full year.\n\nWe expect 2022 revenue to be in the range of $404.7 million to $410.7 million. At the midpoint of the range, this represents a growth rate of 66% versus 2021. Meanwhile, we are updating our adjusted EBITDA outlook upwards by almost 3.5% at the midpoint, and it is now expected to be in the range of $43.5 million to $46.5 million for 2022. This is driven by the continued realization of cost synergies with Borderfree, which includes some workforce rightsizing activities.\n\nIn conclusion, we continue to focus on strong execution and profitable growth in our journey to enable and accelerate global direct-to-consumer cross-border e-commerce, we will continue to further enhance our offering and add value to merchants to support their direct-to-consumer growth. We believe this will enable us to tap into the massive and growing opportunity in front of us. And with that, Amir, Nir, and I are happy to take any other questions. Operator?\n\nOperator\n\nThank you. We will now be conducting a question-and-answer session. [Operator instructions] One moment, please, while we poll for questions. Our first question is from the line of Samad Samana with Jefferies.\n\nPlease proceed with your question.\n\nSamad Samana -- Jefferies -- Analyst\n\nGood evening, and thanks for taking my questions. So, maybe first on the quarter, growth was quite good. You exceeded your guidance. Can you maybe help us understand how much of that was better spending trends versus the timing of go-lives in the quarter? And how much of a headwind was FX in the quarter over?\n\nNir Debbi -- Co-Founder and President\n\nSo, Q3, in terms of the bid, we have seen, I would say, relatively stable demand from the consumer side. So, our growth of existing merchants was in line with our projections. We did see a bit over expectation in the launch of merchants within the quarter. Some of them launched earlier within the quarter than what was expected, and this gave us a bit of a -- a bit of a tailwind versus our guidance.\n\nHopefully, I answered your questions in full.\n\nSamad Samana -- Jefferies -- Analyst\n\nYeah. And then maybe just understanding -- I know it's just one customer, but it's large enough to impact the fourth quarter guidance. So, can you help us understand maybe why the merchant would delay? I would think that the holiday season is typically a pretty strong quarter for any company's GMV and to push out to 1Q '23. Maybe what drove that decision? And are you seeing other customers think about delaying go-lives? And how is it factored into maybe your early thoughts on 2023?\n\nAmir Schlachet -- Co-Founder and Chief Executive Officer\n\nYeah. Samad, it's Amir. So, actually, it wasn't, I would say, a conscious decision to delay, obviously, either on our side or on the merchant side, as you rightly noted, the holiday period is coming. So, the --both merchant and us would have liked to be live.\n\nHowever, unfortunately, in this specific project, there was a dependency on a third party that didn't manage to complete their side of the integration in time. So, while everything else was ready, we and the merchant were forced to delay the launch into Q1 because both of us went into a code freeze. So, other than that, we don't see any movement to delay anything, if else, on the contrary. So, I wouldn't expect any impact on next year.\n\nSamad Samana -- Jefferies -- Analyst\n\nGreat. Maybe I'll squeeze one more in. Ofer, can you just clarify how -- what FX -- the FX impact of the 4Q guidance or to the revised 2022 guidance? I think that it's been so volatile. Just what were you guys assuming before? Or how much of a headwind is it? I think that the constant-currency number would just help everybody out.\n\nOfer Koren -- Chief Financial Officer\n\nYeah. There was -- since we report in USD, but obviously, over 50% of our revenue is in other currencies, mainly euro and GBP, we got hit in the previous quarters as well, but this accelerated since we guided in the previous quarter till November with the revaluation of the USD versus all currencies, but mainly for us, the main impact was versus the euro and the GBP. And basically, the impact is taken into account in the Q4 guidance. And as we mentioned, this along with the merchant that didn't go live is the reason that we are updating our top-line guidance.\n\nSamad Samana -- Jefferies -- Analyst\n\nOK. Understood. Thanks again for taking my questions.\n\nNir Debbi -- Co-Founder and President\n\nThanks, Samad.\n\nOperator\n\nThank you. Our next question is from the line of Will Nance with Goldman Sachs. Please proceed with your question.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nHey, guys. Appreciate you taking my questions. I just wanted to ask on some of the spending trends that you guys are seeing. I mean, I think, specifically, the overseas exposure and the exposure to e-commerce, particularly some things like luxury and apparel.\n\nI think just a lot of people are curious on what you guys are seeing with the boots on the ground in terms of consumer spending behavior, how has that trended over the course of October and the first parts of November? And just in general, when we talk about the revision of the guidance being due to FX and due to this implementation delay, what gives you guys confidence that we don't see a deceleration in kind of underlying spending levels for the remainder of the quarter? Just maybe talk around some of the macro assumptions and what you're actually seeing on the ground?\n\nNir Debbi -- Co-Founder and President\n\nHi, Will. It's Nir. So, for the first part of your question, we did -- we do see different trends around different parts of the world in terms of consumer spending. We did see, in the recent quarters, a larger hit with European client spending as they're more affected or were more affected by the macroeconomics, especially, interest rates and CPI increases.\n\nHowever, in Q3, what we started to see, especially in the second part of Q3, is also some slowness in APAC region, mainly Australia and New Zealand that we've seen a decrease in consumer spending, while U.S. is still holding relatively strong. So, still, we see growth. When we look at our existing merchants, we do see growth, but it is a softer growth than what we've seen in previous quarter, but this was basically already built in, and this trend is starting even prior to reporting our Q2 results.\n\nOfer Koren -- Chief Financial Officer\n\nYeah.\n\nAmir Schlachet -- Co-Founder and Chief Executive Officer\n\nYeah. Sorry, go ahead.\n\nOfer Koren -- Chief Financial Officer\n\nNo, please go ahead.\n\nAmir Schlachet -- Co-Founder and Chief Executive Officer\n\nYeah. I just wanted to add that I think it's always important to note that the consumer spend, and consumer sentiment mostly affects our performance, I would say, in the shorter term. When we look at the longer term, it is much more impacted by the demand of our services from the merchant side. And on that front -- because as we mentioned, we believe it's a massive greenfield opportunity, and we are in prime position to pursue it.\n\nWe believe that this is the main deciding factor when you look at long-term growth. And on that, we're not seeing any softness whatsoever.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nGot it. Makes sense. I guess at risk of asking another short-term question, can I just circle back to the FX commentary? I was just wondering if you could kind of clarify when you guys are striking FX rates in this guidance. I mean, unfortunately, seven days sort of matters, you know, given what FX markets have done mobile over the past week.\n\nJust wondering if you could sort of provide a little color in terms of what's baked into the guidance for the fourth quarter.\n\nOfer Koren -- Chief Financial Officer\n\nYes. I think regarding FX, the best assumption always is to assume that it's stable because no one knows the direction of FX. So, basically, we looked at the average of the last two days, and this is what we incorporated in our guidance for Q4.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nGot it. That's helpful. Appreciate you taking all my questions.\n\nOfer Koren -- Chief Financial Officer\n\nThanks, Will.\n\nOperator\n\nThank you. Our next question is from the line of Brian Peterson with Raymond James. Please proceed with your question.\n\nUnknown speaker\n\nHi. Thanks for taking my question. This is John on for Brian. On the pipeline and new deal activity, are you seeing any changes in your pipeline build metrics, including demos? I think last quarter, you mentioned it was stronger than Q1.\n\nHas that continued? Or what indicators are you tracking there?\n\nNir Debbi -- Co-Founder and President\n\nSo, basically, on the new bookings and the pipeline development, we are very optimistic. We continue to see very solid build of the pipeline, and our signings to date is significantly higher than what we had last year. So, year over year, we see a very significant growth even higher than our revenue and GMV reported growth. And this should fuel our growth into the future.\n\nWe also start to see the contribution into the pipeline and also into the signed deal out of the APAC region where we started to invest late last year and earlier this year in Australia, Japan. So, we do see that starting to contribute, and we do affect -- and we do expect it to be significant part into our sales next year.\n\nUnknown speaker\n\nPerfect. That was great color there. And then one more if I may. How are the expansion trends progressing? And any notable changes in the cadence of geo or brand expansion.\n\nI'm just curious how merchants are approaching these efforts in this macro, maybe accelerating or decelerating. Thanks.\n\nNir Debbi -- Co-Founder and President\n\nI think -- and what we see much more with our success management team is, I would say, discussions with our merchants on how can we grow the business in current regions or in new regions with minimum additional investment. So, we are taking and we are doing more discussions on growing your business with better usage of our smart insights based on our data model, so how can I optimize my proposition versus product price versus returns offering to best-in-class shipping offering? And we do see a lot of interest related to that. And as any geographies we can add with significant investment where Global-e opportunity for the merchant. So, we have much more of those calls currently with our success management team.\n\nUnknown speaker\n\nThank you very much.\n\nOperator\n\nThank you. Our next question is from the line of James Faucette with Morgan Stanley. Please state your question.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nThanks very much. Just following up on the FX as we continue to try to sensitize ourselves there. How much of an incremental drag was FX on third-quarter results versus when you had originally formulated that outlook? Ofer, any idea?\n\nOfer Koren -- Chief Financial Officer\n\nYeah. Versus the formulation, the additional drag was still around 3% versus the formulation, and we see it deepening into Q4.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nGot it. Got it. And then, you know, talking about margins in both near and medium term, how should we be thinking about the mix shift aspect, whether it be fulfillment? Or are we seeing other parts of the gross margin expanding independently? And can you -- if we are seeing kind of margins expand independent of mix, can you talk about what's driving some of that contribution?\n\nOfer Koren -- Chief Financial Officer\n\nSo, regarding the margins, we have been able to gradually move the margins over a long period of time. So, it has been a very clear trend of improvement. However, as we previously said, we don't expect to get 200 or 300 basis points every quarter. Over time, we think that we can continue to expand the margins.\n\nIn terms of the mix, service fees have been growing better for several reasons. However, margins were improved on both revenue generation pillars. So, we have been able, over time, to improve margins on the services side but also on the fulfillment side.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nGot it. And then in the medium term, and I appreciate you probably aren't going to be expanding margins a few hundred basis points per quarter. But how should we think about the appropriate rate of margin expansion, say, on an annual basis, etc., that you think you can bring to bear going forward?\n\nOfer Koren -- Chief Financial Officer\n\nI think that it's still early to put a number on next year. However, we do think that we can maintain the margins that we got to just last quarter. And again, and over time, also see improvement, but we will guide on that, you know, coming into next year.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nOfer Koren -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nThank you. Our next question is from the line of Koji Ikeda with Bank of America. Please proceed with your question.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Hey, guys. Thanks for taking the questions. You know, I definitely appreciate all the color earlier on the go-live push, so thank you for that.\n\nAnd I wanted to ask you kind of a question in the way that your end market is viewing the importance or maybe the strategicness of cross-border as a growth category for these businesses heading into next year. Is there any change in the way that the end market is doing the important or strategicness of cross-border?\n\nAmir Schlachet -- Co-Founder and Chief Executive Officer\n\nI think -- Koji, this is Amir. I think in general, it's no different than the trend that we have seen over many years now. This is not a new trend. Businesses are moving into direct-to-consumer.\n\nIt both benefits for both the brands and the consumers alike. So, we are seeing a continuation of that trend. We're seeing more and more merchants, more and more verticals that are adopting direct-to-consumer on a global scale as a key pillar of their strategy going forward. I think we mentioned in the past that brands like Adidas that have put this as a key part of their strategic plan, their kind of five-year plan in other prominent brands, and others are following suit.\n\nSo, we are seeing definitely a continuation of that trend in the market across all geographies, basically.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thank you. And then just one follow-up for me. I wanted to ask you a question on Borderfree.\n\nMaybe help us understand the contribution of Borderfree for total revenue? And then also, I noticed and you mentioned U.S. outbound revenues definitely up 184% per -- up 184%, so great number there. But maybe help us understand how much of a contribution was Borderfree to U.S. outbound.\n\nThanks, guys.\n\nOfer Koren -- Chief Financial Officer\n\nYes. So, you know, as we guided, the Borderfree is expected to contribute this year $125 million to $135 million in GMV with a similar take rate to our average take rate. So, this gives you a very good indication of the revenue contribution. Regarding U.S.\n\noutbound since Borderfree is very biased toward the U.S., most of its activities U.S. outbound. And then obviously, it has a significant contribution. However, even putting Borderfee aside, the Global-e -- the business, U.S.\n\noutbound on the Global-e platform has grown very fast this quarter and for the last nine quarters and previous years as well.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nOK. And maybe just last follow-up. Just the Borderfree GMV for the third quarter. Did it come in maybe at the range, below the range, or above the range of the guide for the third quarter of the $50 million to $54 million? Thanks, guys.\n\nOfer Koren -- Chief Financial Officer\n\nIt came in slightly above the range.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thank you.\n\nOfer Koren -- Chief Financial Officer\n\nThank you, Koji.\n\nOperator\n\nThank you. Our next question is from the line of Josh Beck with KeyBanc. Please proceed with your question.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nThanks for taking the question. I wanted to ask a little bit about the market backdrop within e-commerce. I think what we've heard from some of the domestic companies is -- U.S. was maybe up a tad in Q3 flattish.\n\nI think the view on Europe is that likely declined in Q3. And you've seen a lot of people backing off effectively either market forecast for domestic. So, I'm just kind of curious when you double-click in the cross-border sector, what you're seeing maybe at a sector level and how you're thinking about the growth algorithm for cross-border at a market level going into next year?\n\nNir Debbi -- Co-Founder and President\n\nAs we mentioned -- Josh, it's Nir. As we mentioned earlier, we did see the growth rate slightly lower Q3 and the beginning of Q4 than what we've seen previously. However, we do see our merchants continue to grow. The merchants are still growing.\n\nWe don't see a decrease. We can see specific regions that are trading slightly lower on year on year. But overall, for merchants, we do see -- and this is where we differentiate from regular merchants, our global reach is making it, I would say, variant, but we do see on the overall aggregate of it, we do see a positive effect. So, regardless of different regions trading lower, we do see a stronger effect.\n\nFor us, what we see and mainly in the U.S., when you look at U.S. domestic, the shoppers in the U.S. actually see global shopping cheaper. Because of the strength of the USD, it's cheaper for them to source externally, and is more than 50% of our sales are coming from merchants outside the U.S.\n\nIt's actually growing for us. So, U.S. still looks very solid on the aggregate for Global-e due to the strength of the consumer spending due to the weakening of the currencies in other regions.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nOK. That's helpful. And then maybe a follow-up on Shopify. Certainly, you had some constructive updates there.\n\nI think there was an acceleration in the go-lives on the direct side. Is that something that you think can be more material to revenue? I respect that you may not disclose that because that's obviously one partnership. But is that something that we should be thinking about kicking into the model next year? Is it more of a multiyear opportunity? How should we be framing that in our heads?\n\nNir Debbi -- Co-Founder and President\n\nOur current expectation -- and we haven't finalized the budgeting for next year with Shopify. But we do expect that for us, for Global-e, there will be a positive effect as of Q3 and -- with building up of the demand for the white label solution. However, we do believe that on the growth rate -- on the overall company growth rate, the main effect would come on in 2024 onwards as the bulk of merchants, I would say, launch sometime and start along sometime within late Q3 -- late 2023 and affect our 2024 growth rate.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nVery helpful. Thank you.\n\nOperator\n\nThank you. Our next question is from the line of Pat Walravens with JMP Securities. Please proceed with your question.\n\nPat Walravens -- JMP Securities -- Analyst\n\nGreat. Thank you. So, as I look at next year, and I heard you haven't finalized it yet. But, you know, the consensus is at $606 million, and the midpoint of your new guidance is $407 million.\n\nSo, that's like 49% growth. It seems like a lot. So, I just thought maybe this would be a good opportunity to comment a little bit about what's a reasonable expectation for people to have for next year.\n\nOfer Koren -- Chief Financial Officer\n\nSo, as we said, although there are obviously some headwinds and a lot of volatility, the segment that we focus on, which is cross-border and even more important, the direct-to-consumer is still growing very, very fast. We expect to continue the fast growth into next year. And we think that taking into account the fact that the market is huge, and we are just starting to tap into it, we will be able to grow fast for the next few years. And then this is our target.\n\nPat Walravens -- JMP Securities -- Analyst\n\nOK. Great. Great. Super helpful.\n\nAnd then just very roughly on the FX impact. So, if I look at Q4, the consensus previously was at $150 million. Midpoint of the guidance now is around $138 million, so that's like a $12 million delta. Is it fair for us to assume that's basically $6 million of FX and $6 million of the -- of that one merchant being delayed, is that about right?\n\nOfer Koren -- Chief Financial Officer\n\nAs a ballpark direction, I think you're not far off. Before we move on, I would just like to clarify one item in our press release as we've gotten a couple of questions. Our prior full-year revenue guidance was $406 million to $426 million. There was a typo in the release.\n\nSo, prior guidance, again, for revenue of $406 million to $426 million.\n\nOperator\n\nThank you. Our next question is from the line of Scott Berg with Needham and Company. Please proceed with your question.\n\nScott Berg -- Needham and Company -- Analyst\n\nHi, everyone. Congrats on good quarter. Apologize any background noise on the airport. But in Amir's pre-scripted remarks, I know you talked about the Shopify white-label partnership and some excitement around there.\n\nBut just wanted to clarify, is that progressing this year kind of in line with your expectations? Is it ahead of your expectations over the last 90 days? Or is it behind? Just trying to get a sense of where you are in that rollout relative to maybe where your thoughts for three or six months ago. Thank you.\n\nAmir Schlachet -- Co-Founder and Chief Executive Officer\n\nScott, first of all, good travels. And yes, we are advancing, I would say, very much on track in terms of that part of the partnership with Shopify.\n\nScott Berg -- Needham and Company -- Analyst\n\nGot it. Very helpful. Thank you. And then from a follow-up perspective, was on the new customer bookings.\n\nSomeone else's question earlier was on the pipeline commentary. But if you look at your new bookings, your new customer signings in Q3, were there any regions or areas that were materially different than what your expectations going into the quarter, what have been?\n\nNir Debbi -- Co-Founder and President\n\nYeah. I think that on the new bookings, we continue to see good momentum though with hundreds of millions signed within the quarter, and we do expect it to continue. We are positively surprised with the expansion in the pipeline of Australia and also with the improvement in the last couple of months of the pipeline in Japan. We do expect to see a contribution there -- significant contribution into 2023, but even contribution, we didn't sign agreements that would most probably come in even in Q4 this year.\n\nWe are very positive about it.\n\nScott Berg -- Needham and Company -- Analyst\n\nGot it. Very helpful. Thank you for taking my questions.\n\nOperator\n\nThank you. Our next question is from the line of Brent Bracelin with Piper Sandler. Please proceed with your question.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nThank you. Good afternoon. I wanted to go back to the -- maybe the primary driver for new merchants to adopt Global-e. I totally get the benefits of capitalizing on that international traffic and driving higher international cross-border growth.\n\nBut given the recessionary backdrop, given merchants' desire to actually reduce cost, have you seen any new or existing merchants now looking to Global-e to actually help lower costs? Or is it still all about driving incremental growth? Thanks.\n\nNir Debbi -- Co-Founder and President\n\nYeah. That's a great question. Thanks, Brent. It's Neil.\n\nWe see both, to be honest. When we speak to merchants, growth comes first, merchants want to grow the top line and want to have a profitable growth and international expansion is a route for it. However, Global-e allows them to do it in a cost-effective manner. We reduced a lot of the complexities that would require a significant capex on the merchant side to develop versus whether it be a local payment method and integration to multiple PSPs or currencies management or duty management, etc., etc.\n\nWe have a lot of it, actually, we are giving out-of-the-box savings and development, as well as efficiencies of scale that we have using our logistics services, which you see in the growth and the adoption of our logistics services as we do have economies of scale that can actually save money for many of our merchants. So, the combination of both the efficiency and the ability to expand the top line, we see it combined. And the discussion is usually combined on both points with new merchants.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nGot it. Helpful color there. And then just one quick follow-up on Borderfree. This has now been part of the operations here for four months.\n\nAre there any new products or customer cross-sell opportunities that you're optimistic could actually materialize next year? Or is it kind of a little too early to discuss?\n\nNir Debbi -- Co-Founder and President\n\nWe are very optimistic with the build that we're advancing on the back of the base we bought in demand generation. So, part of the rationale for the transaction was actually a demand generation assets that Borderfree had related to registered users, international buyers, assets, as well as international portal. We are advancing in our plan to utilize it across all the globally group merchants, which is more than 10x bigger than that the group of merchants of Borderfree stand-alone, and we do believe we will be able to utilize it some time, I would say, second half of next year.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nHelpful. Thank you.\n\nNir Debbi -- Co-Founder and President\n\nThanks, Brent.\n\nOperator\n\nThank you. This brings us to the end of our question-and-answer session. I would like to turn the floor back over to Amir for closing comments.\n\nAmir Schlachet -- Co-Founder and Chief Executive Officer\n\nThank you, and thank you, everyone, for joining us today, for your interest and your questions, and for your continued support during what was another very strong quarter for us. As you heard from us today, there are a lot of exciting developments in our business and a bright future ahead of us. And as such, we very much look forward to seeing you again on our future earnings calls. Let's now goodbye and take care.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nErica Mannion -- Investor Relations\n\nAmir Schlachet -- Co-Founder and Chief Executive Officer\n\nOfer Koren -- Chief Financial Officer\n\nSamad Samana -- Jefferies -- Analyst\n\nNir Debbi -- Co-Founder and President\n\nWill Nance -- Goldman Sachs -- Analyst\n\nUnknown speaker\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nPat Walravens -- JMP Securities -- Analyst\n\nScott Berg -- Needham and Company -- Analyst\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nMore GLBE analysis\n\nAll earnings call transcripts"
}