{
  "companyName": "SiTime Corporation",
  "companyTicker": "SITM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/sitime-corporation-sitm-q3-2022-earnings-call-tran/",
  "content": "SiTime Corporation (SITM -0.67%)\nQ3 2022 Earnings Call\nNov 02, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to SiTime's third quarter 2022 financial results conference call. [Operator instructions] As a reminder, this conference call is being recorded today, Wednesday, November 2, 2022. I would now like to turn the call over to Brett Perry of Shelton Group investor relations. Brett, please go ahead.\n\nBrett Perry -- Investor Relations\n\nThank you, Bella, and good afternoon. Welcome to SiTime's third quarter 2022 financial results conference call. On today's call from SiTime are Rajesh Vashist, chief executive officer; and Art Chadwick, chief financial officer. Before we begin, I'd like to point out that during the course of this call, the company may make forward-looking statements regarding expected future results, including financial position, strategy and plans, future operations, the timing market and other areas of discussion.\n\nIt's not possible for the company's management to predict all risks nor can the company assess the impact of all factors on its business or the extent to which any factor or combination of factors may cause actual results to differ materially from those contained in these forward-looking statements. In light of these risks, uncertainties and assumptions, the forward-looking events discussed during this call may not occur, and actual results could differ materially and adversely from those anticipated or implied. Neither the company nor any person assumes responsibility for the accuracy and completeness of the forward-looking statements. The company undertakes no obligation to publicly update forward-looking statements for any reason after the date of this call to conform the statements to actual results or to changes in the company's expectations.\n\nFor more detailed information on risks associated with the business, we refer you to the risk factors described in the 10-K filed on February 25, 2022, as well as the company's subsequent filings with the SEC. Also during this call, we'll refer to certain non-GAAP financial measures, which we consider to be an important measure of company performance. These non-GAAP financial measures are provided in addition to and not as a substitute for or superior to measures of financial performance prepared in accordance with U.S. GAAP.\n\nThe only difference between GAAP and non-GAAP results is stock-based compensation expense and related payroll taxes. Please refer to the company's press release issued this afternoon for a detailed reconciliation between GAAP and non-GAAP financial results. I'd now like to turn the call over to SiTime's CEO. Rajesh, please go ahead.\n\nRajesh Vashist -- Chief Executive Officer\n\nThank you, Brett. Good afternoon. First, I'd like to welcome you, as well as existing investors to the SiTime Q3 2022 earnings call. For those of you that are new to our business, SiTime is the leader in a dynamic new product category called precision timing.\n\nIn electronics, timing is ubiquitous and ensures reliable functioning. SiTime created precision timing to service the accelerating need for higher performance, smaller, lower power and more reliable timing chips for applications like automated driving, 5G and data centers. We are early in our growth trajectory as we transform the $10 billion timing market. We have shipped 3 billion units of our precision-timing chips to 20,000 customers in 300 applications across all electronics.\n\nAs many of you have heard from others in the semiconductor industry, the current market conditions we are experiencing are unprecedented. In 40 years of industry experience, I have not seen a downturn as rapid or as deep as this one. We see this as a result of multiple unusual and simultaneous macro events, making it more difficult to forecast than ever. Last quarter, we saw a significant change in market conditions, which has reduced our expectations for the year.\n\nWhile our Q3 revenue, gross margin, and EPS were all solidly within our guidance range, we have seen end customer demand slowing: first, in consumer, then in industrial markets and now in comms data center for fourth quarter '22 and first quarter 2023. This is because while we continue to see normal inventory levels at our distributors, it appears that customers have built inventory at their contract manufacturers. We expect that in all segments, our customers will need to spend the next two quarters working through this buildup. Despite this, our long-term growth story in precision timing and SiTime's leadership remains intact.\n\nI'd like to discuss four key points: design win growth, increasing ASPs or average selling price, increasing our single-source business and higher quote activity, all of which give us confidence in the future. First, our funnel of design win continues to grow. Design wins are central to the growth of our business. When customers commit to our products, it gives us visibility into their deployment and, thus, our future revenues.\n\nAs we have stated before, SiTime's unique feature of programmability allows us to give customers the exact function that they want. In Q3 2022, we doubled the number of design wins over the same period last year. Not only is our number of design wins and dollar value significantly higher than in 2021, our focus segments, automotive, comms, aerospace, defense, constitute the large majority of these design wins. We expect that these design wins will start generating revenue in 2023 and beyond.\n\nThe second bright indicator is ASPs, average selling prices. SiTime's precision-timing products offer premium performance at a premium price. And our products performance cannot be matched by legacy quartz-based competitors. This is reflected in the consistent increase of our average selling price.\n\nQ3 2022 was our eighth consecutive quarter of ASP increase. Additionally, ASPs have been rising consistently and significantly throughout 2022 and will be higher in Q1 2023 than a year ago. Note that we are not seeing any loss of business to competitors or business that we want. Even though availability of the competitors has increased, lead times have shortened and quartz prices are lower.\n\nA third indicator of our long-term growth is the strength of our single-sourced business. 80% of SiTime's business is now single-sourced. That is customers buy only SiTime solutions in that design and will buy only from us. We see this as a unique position of trust, and so it's a relationship that we value and spend a lot of time strengthening.\n\nA point to note is that this single-source position exists independent of segments -- excuse me, that it exists across all types of customers, including, for example, the consumer segment. Our fourth and final positive indicator is the rise in our quote activity, which is another indicator of our future business potential. We provide price quotes on our products based on the function and estimated annual usage to our customers. Our core dollar value in 2022 is an average of three times higher than 2021.\n\nWe believe that this is a consequence of highly differentiated and category-creating products that we launched in this period and a greater reach with larger number of customers. While these positive indicators are, indeed, quite positive, we are still striking a cautious tone with respect to near-term sales results due to the challenges and headwinds we have seen. We believe that the inventory buildup at customers' contract manufacturers, for example, will take a couple of quarters to return to normal. As we have stated before, to capture the tremendous opportunity in the timing market, we have set a target to expand our SAM, or served market, from $1 billion in 2021 to $4 billion in 2024, with the introduction of new timing products that -- and we are on track for this.\n\nWith the changes in market conditions, we are still continuing to be prudent about our spending, while ensuring that our product rollout remains on track. By the end of '22, we will have introduced six new products, which will expand our SAM in automotive and comms. In 2023, we expect to introduce at least five new products in both oscillators and clocks with the same end market focus. To summarize, our continued strength in design win funnel ASP growth, single-sourced business and increased quote activity, give me tremendous confidence in the future of SiTime.\n\nWe're delivering strong value to our customers, and there are significant opportunities ahead of us. We're building at an even stronger and resilient organization and are committed to building a bright future for SiTime. I will now turn it over to Art Chadwick, our CFO.\n\nArt Chadwick -- Chief Financial Officer\n\nGreat. Thanks, Rajesh, and good afternoon, everyone. Today, I'll discuss third quarter results, and I'll provide guidance for Q4 and make some comments on 2023. I'll focus my discussion on non-GAAP financial results and refer you to today's press release for a detailed description of our GAAP results, as well as a reconciliation of GAAP to non-GAAP results.\n\nRevenue in the third quarter was $73.1 million, up 16% from the third quarter of last year but down 8% from Q2. Sales into our mobile, IoT and consumer segment were $24.2 million, or 33% of sales, down 10% from Q2. Sales to our largest customer, which is included in this segment, were $18.2 million, or 25% of sales. Excluding sales to our largest customer, sales into this segment were $6.0 million, down 62% from Q2.\n\nSales into our industrial, automotive and aerospace segment were $25.1 million, or 34% of sales, down 22% sequentially. Within this segment, sales into auto were sequentially flat, but sales in the broadband industrial were down more than 35%. Sales into our communications and enterprise segment were $23.8 million or 33% of sales, up 17% sequentially. Non-GAAP gross margins were solid at 65.2%.\n\nNon-GAAP operating expenses were $28.0 million as we held spending essentially flat with Q2. Expenses were $16.1 million in R&D and $11.9 million in SG&A. Non-GAAP operating margins were 26.8%. In addition, we earned $2.5 million in interest income this quarter, up substantially from prior quarters, as interest rates have recently increased.\n\nNon-GAAP net income was $21.9 million or $0.97 per share. On the balance sheet, accounts receivables were $44.9 million with DSOs of 55 days. That's up from $38.7 million and DSOs of 44 days in Q2 as customers are paying just a little more slowly than before. Inventory at the end of Q3 was $45.4 million, up from $34.4 million in Q2.\n\nWe consciously made the decision to increase inventory this quarter as we bought additional wafer safety stock. This additional wafer inventory will provide a cushion in the event of any geopolitical or other supply chain issues and to give our customers additional comfort since 80% of our sales is single-source. The increase in inventory and accounts receivables essentially consumed our free cash flow this quarter. Cash generated by operations was a negative $0.4 million.\n\nWe spent $10.3 million in equipment and assets and ended the quarter with $564 million in cash, cash equivalents and short-term investments. I'd now like to provide some financial guidance for Q4 and beyond. The macro environment remains challenging, and we all know the news. Inflation is high in both the U.S.\n\nand Europe. Interest rates continue to rise. The war in Ukraine continues. China is facing a number of economic challenges.\n\nEnergy prices are increasing in Europe and so on. These events are clearly having some impact on semiconductor demand. We first saw softening demand in the consumer markets this last summer, and we talked about that on our last conference call. We are now seeing a slowdown in broad-based and industrial markets.\n\nLooking forward, we see slowing sales in comms and data center. We have gone from a semiconductor supply constrained world a year ago when over-inventoried world today. These higher-than-normal inventory levels, coupled with lower demand, is leading to a classic semiconductor down-cycle, and we are not immune. As a result, our revenue expectations for the year have come down.\n\nWe've called it the way we see it, but the world has changed. We now expect sales in the fourth quarter will be down between 15% and 20%, sequentially, which would be approximately $60 million at the midpoint. Gross margins will be impacted by the lower sales and will likely be around 63%, plus or minus a point. We are maintaining our level of investment in new process and product development and, thus, will hold operating expenses relatively flat.\n\nIn addition, we expect to earn at least $3 million a quarter in interest income. Diluted share count will be approximately 23 million shares, and the resulting Q4 non-GAAP EPS should, therefore, be somewhere between $0.50 and $0.60 per share. Though we don't normally provide guidance two quarters out, we believe we have enough visibility to provide a few comments about Q1. We currently believe sales in Q1 will likely be down 20% to 25% from Q4 for two primary reasons.\n\nFirst, we expect the usual seasonal slowdown with our largest customer. And second, we see a coming lull in comms and enterprise sales as our customers in that space work through higher-than-normal inventory. Since Q1 is still more than a quarter out, sales could, obviously, be higher or lower than that, but that's how we see it right now. At these lower sales levels, gross margins will also decline and will likely be in the low 60s.\n\nWe do, however, believe Q1 will be the low quarter next year and the sales increase sequentially each following quarter. So having said all of that, as Rajesh mentioned, we firmly believe our long-term growth story is intact. Our process and product development continues as planned, and we expect to introduce more than five significant new product platforms next year, and each will spawn numerous derivative products. This will continue to expand our SAM from about $1 billion last year to about $4 billion this year -- or $4 billion by 2024.\n\nDesign win activity has been strong, as Rajesh mentioned, and that, coupled with new product introductions and an expanding SAM, should lead to continued long-term growth for the company once we get through the semiconductor downturn. And with that, I'd like to turn the call back to the operator for Q&A. Thank you, everyone.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Alessandra Vecchi with William Blair. Your line is now open.\n\nAlex Vecchi -- William Blair -- Analyst\n\nHi, guys. Thanks for the candor on the environment and what you're seeing. I guess, just one question to circle back is, what is it that you're hearing from your customers that are giving you the confidence that inventory levels will be worked out in Q1 and that you can start to grow from there? Kind of what are the puts and takes we should be looking out for?\n\nRajesh Vashist -- Chief Executive Officer\n\nRight. So thanks, Alex. Obviously, with the caveat that we don't know exactly what's gonna happen, we see that the inventory and demand are, of course, correlated quite a bit, right? The lower demand there is, the lesser inventory comes through. I think, what we see is that the inventory buildup has been in a somewhat unusual place in the contract manufacturers, which is typically not the case.\n\nWe see the demand at comms and enterprise, which is one of the larger declines, that continuing, albeit at a slower pace. And while we factor in the reduced demand and the inventory that they have to work through, that is what we begin to hear. In many cases, I think some of them are significantly over-inventoried. Some of them are very likely over-inventoried.\n\nBut given the breadth of our customers, I think the broad view is that the next two quarters, Q4 and Q1, are gonna definitely needed for all that to come through. So that's what we've learned. We've also learned that in talking to our -- to looking at the channel, including the CMs, and we see that in many, many cases, that to be true.\n\nAlex Vecchi -- William Blair -- Analyst\n\nOK. That was really helpful. And then, if I can do one follow-up. Just on your commentary about the ASP growth over the last eight quarters and seeing ASPs up even in Q1 of '23, how much of that is a function of the decline in consumer versus a function of the newer products gaining traction versus a function on ASP increases on an apples-to-apples basis on some of the legacy products?\n\nRajesh Vashist -- Chief Executive Officer\n\nYeah. So the ASP increases on the legacy product is probably the least component of it. I would say that our mix is probably the most influential piece where we are selling more in comps, more in automotive, more in high-end industrial. And finally, I think the introduction of the new products is having an impact.\n\nAs you know, in many cases, the new product introduction takes a little while to come through for revenue from design wins. But in this case, I think there has been a significant growth of new products, in particular, the Aetna product line and the Elite product line, which has contributed significantly to it. So this is a long-term transition of SiTime. Last time, I commented on how our ASP had grown 30% year on year, Q2 '21 to Q2 '22.\n\nAnd I had anticipated that ASPs would be flattish. I think ASP growth has exceeded my expectations, and I think it continues to be higher. Now it may come down in Q1 a little bit over current numbers because of lesser on the mix side, but it will still be higher than what it used to be a year before that.\n\nArt Chadwick -- Chief Financial Officer\n\nAnd Alex, I'll add just a few comments. We've always talked about our strategy being developing much higher performance, higher ASP products. And that's what you're seeing here. Our newer products, again, higher performance, higher ASPs, generally higher gross margins, and that's exactly what we're seeing here.\n\nAlex Vecchi -- William Blair -- Analyst\n\nOK. Perfect. That was very helpful. With that, I'll go back into queue.\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Suji Desilva with ROTH Capital. Your line is open.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nHi, Rajesh. Hi, Art. Can you give us some sense of what the different segments might look like in 4Q? I was curious particularly about automotive. You said it was flat.\n\nIs that one gonna hold up better than the others, given the design win ramp?\n\nRajesh Vashist -- Chief Executive Officer\n\nYeah. I think automotive is gonna hold up pretty nicely from Q3 to Q4 and well into next year. When we look at our forecast for automotive, that's definitely a growth segment for us. Our consumer sales will be relatively flat from Q3 to Q4, starting with our largest customer.\n\nOur largest customer is 25% of sales in Q3, and it's probably gonna be pretty similar to that in Q4. But we are gonna see a decline in comms and enterprise. Again, for the most part, it's because they are over-inventoried. And that was my comment also on Q1.\n\nWe're really gonna see a lull in new shipments to our comms and enterprise customers in Q1. So that trend will continue until they work through some of that inventory. Then we think we get back on a growth path.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nAnd are industrial that bottoming given the sharp follow-up or not?\n\nArt Chadwick -- Chief Financial Officer\n\nIt should flatten out, yes.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nOK. Good. And the other question I had is with the inventories on the balance sheet, now that you've built up buffer stock and can return to more positive working capital, do you feel like you've built sufficient buffer stock there in inventory?\n\nArt Chadwick -- Chief Financial Officer\n\nYes. I mean, we had a pretty good step-up from Q2 to Q3. As I mentioned in my commentary, that was a very conscious decision. All of last year, people were kind of hand-to-mouth on wafers.\n\nAnd of course, we procure our wafers from both Bosch for our MEMS wafers and TSMC for our CMOS wafers, and both of those are sole-sourced. So just to provide some cushion in there, we increased our buffer stock. I expect our inventory levels to remain kind of at this level for the next couple of quarters.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nOK. Thank you.\n\nRajesh Vashist -- Chief Executive Officer\n\nAnd Suji, I think you rightly said that as buffer stock because that's how we are seeing it increasingly. In a continuing uncertain world of shortened of supply of both CMOS and analog chips and MEMS chips, we think it's prudent for us to have significant inventory to support our customers who, as I mentioned, are, in fact, significantly single-sourced with SiTime. So I think it's very important. We're also moving into some areas like automotive and aerospace where it becomes even more critical to our customers to have these.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nGot it. Thanks.\n\nArt Chadwick -- Chief Financial Officer\n\nThanks, Suji.\n\nOperator\n\nYour next question comes from the line of Quinn Bolton with Needham & Company. Your line is now open.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nHi, Rajesh and Art. I guess, for just the first question, last quarter, you talked about sort of the split between precision timing and nonprecision timing. And as you look into the second half of the year, I'm wondering if could you give us some sense how much of the portfolio, either in Q3 or maybe for the Q4 guide, would be from your higher-end precision timing parts, and how much of the business would still be more legacy nonprecision timing where quartz might be much more competitive.\n\nRajesh Vashist -- Chief Executive Officer\n\nYeah. So what we have found more and more is that most -- there's very little business of ours, which is so-called multisource. In other words, where we can be easily substituted because the customers either don't want their performance or don't want the supply chain benefits or the quality benefits of SiTime and where they can substitute us readily. I think that portion of our business has declined significantly through this year.\n\nAnd when we exit the year, a large portion of it will be that 80% single-sourced that we talk about. So it's an interesting idea where we can have a customer in the consumer segment that is also single-sourced and also not going to be substituting quartz-based crystal easily. Most of our single-sourced, of course, goes in automobiles, goes in industrial, and it goes in comms and enterprise. And that's a significant portion of our business.\n\nOur design wins in consumers are also -- as we look out into the new year, are also at a lower level than design wins in all these other markets that we have spoken about. So I see that trend continuing where single-source of sideline products, and also don't forget that we're introducing six new products this year, which will likely be single-sourced with customers, and we're gonna introduce five new products next year, which will be also significantly single-sourced next year. So that trend is a long-term trend of SiTime's because of essentially a functionality and/or quality and reliability.\n\nArt Chadwick -- Chief Financial Officer\n\nAnd Quinn, I'll try to -- I'm sorry. Go ahead.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nOh, go ahead, Art.\n\nArt Chadwick -- Chief Financial Officer\n\nI was gonna just quantify this just a little bit. If you recall on our conference call a quarter ago, we estimated that about 70% of our business was precision, 30% nonprecision timing, and a bulk of the nonprecision timing business was in our consumer space, not our largest customer, but the remaining consumer business. And if you recall my remarks a few moments ago, that piece of the business declined 62% from Q2 to Q3. So that piece of the market is getting squeezed out pretty quickly here.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nYes. So I was gonna say it sounds like it's 80% or north of 80% is sort of precision timing, and 80% sole-sourced or single-sourced. And it sounds like that percentage you would expect goes higher as you introduce new products into 2023.\n\nArt Chadwick -- Chief Financial Officer\n\nYup. Absolutely.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nGot it. Perfect. And then, Art, just a clarification on your comment about the largest customer, you said would be flat quarter to quarter. I wasn't sure if you meant flat on a dollar basis or flat on a percentage basis.\n\nArt Chadwick -- Chief Financial Officer\n\nYeah. Excellent question. It's gonna be flattish on a dollar basis.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nPerfect. Thank you.\n\nArt Chadwick -- Chief Financial Officer\n\nWhich is kind of what we expect with them.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nYeah, no, makes sense.\n\nOperator\n\n[Operator instructions] Your next question comes from the line of Tore Svanberg with Stifel. Your line is now open.\n\nJeremy Kwan -- Stifel Financial Corp. -- Analyst\n\nYes. Good afternoon. This is Jeremy calling for Tore. I guess, a question first on the comms data center weakness here.\n\nIs there anything to call out within like any subsegments kind of any insights you have whether comms or the data center versus the enterprise segment is doing particularly --\n\nRajesh Vashist -- Chief Executive Officer\n\nRight.\n\nJeremy Kwan -- Stifel Financial Corp. -- Analyst\n\nThank you.\n\nRajesh Vashist -- Chief Executive Officer\n\nYeah. Yeah. Hi, Jeremy. Yeah, I think the particular areas, if you were to look at it, would probably be the data center and enterprise.\n\nI think, in general, those have been the hot markets. And I think, those are the ones that have been muting slightly as we go forward based on the over-inventory situation we talked about.\n\nJeremy Kwan -- Stifel Financial Corp. -- Analyst\n\nGot it. Thank you. And can you give us any color on the kind of your lead times? It seems like you guys have been pretty consistent, pretty low relative to the rest of the industry. And can you talk about how that's compared maybe anything -- any changes in the last 90 days or so and how you see this going forward?\n\nRajesh Vashist -- Chief Executive Officer\n\nYeah. We don't see --\n\nArt Chadwick -- Chief Financial Officer\n\nSo if you recall in prior conference calls, we talked about lead times going out two quarters or so. Lead times have definitely come in from that during the last number of months. So to answer your question without quantifying it, lead times are absolutely coming in -- coming down.\n\nJeremy Kwan -- Stifel Financial Corp. -- Analyst\n\nGot it. Thank you. And maybe just one last question. Looking at the -- your focus segments, can you rank order some of that for us? Like how you see it playing out in 2023? As the recovery happens, which of these segments do you expect to kind of drive the near-term return to growth? Thank you.\n\nArt Chadwick -- Chief Financial Officer\n\nSo I'm not sure I wanna call out any particular segment. But I think the segments that we have always talked about being strategically important to us are comms and enterprise, as we mentioned, that is somewhat soft today. But what's really declining in that area is the fact that they're over-inventoried. So we've got to work through the inventory in that area.\n\nIf you look at our new product introductions, again, higher performance, higher ASPs, higher gross margins, that's generally in comms, enterprise and for us, aerospace, most definitely, and auto is gonna be strong. So those are really the key growth drivers that we see long term.\n\nJeremy Kwan -- Stifel Financial Corp. -- Analyst\n\nVery good. Thank you very much.\n\nRajesh Vashist -- Chief Executive Officer\n\nYeah And ex our largest customer, I don't think it's gonna be consumer. We don't -- ex our largest customer, I don't think it will be consumers that will be needing it. So that's on the other side of that story.\n\nJeremy Kwan -- Stifel Financial Corp. -- Analyst\n\nUnderstood. Thank you very much, guys.\n\nArt Chadwick -- Chief Financial Officer\n\nThanks, Jeremy.\n\nJeremy Kwan -- Stifel Financial Corp. -- Analyst\n\nYeah. You're welcome.\n\nOperator\n\nAnd we have no further questions at the queue. I will now turn the call back to the management for closing remarks.\n\nBrett Perry -- Investor Relations\n\nIn that case, we want to thank everybody for joining us on today's call, and I hope everybody has a great afternoon. Thank you.\n\nRajesh Vashist -- Chief Executive Officer\n\nThank you, all.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrett Perry -- Investor Relations\n\nRajesh Vashist -- Chief Executive Officer\n\nArt Chadwick -- Chief Financial Officer\n\nAlex Vecchi -- William Blair -- Analyst\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nJeremy Kwan -- Stifel Financial Corp. -- Analyst\n\nMore SITM analysis\n\nAll earnings call transcripts"
}