{
  "companyName": "Plug Power",
  "companyTicker": "PLUG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/plug-power-plug-q3-2022-earnings-call-transcript/",
  "content": "Plug Power (PLUG 1.15%)\nQ3 2022 Earnings Call\nNov 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Plug Power third quarter earnings conference call. [Operator instructions] As a reminder, this conference is being recorded. It is now my pleasure to introduce your host, Teal Hoyos, director marketing communications. Thank you.\n\nPlease go ahead.\n\nTeal Hoyos -- Director of Marketing Communications\n\nThank you. Welcome to the 2022 third quarter update call. This call will include forward-looking statements. These forward-looking statements contain projections of our future results of operations, or of our financial position or other forward-looking information.\n\nWe intend these forward-looking statements to be covered by the Safe Harbor provision for forward-looking statements contained in Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. We believe it is important to communicate our future expectations to investors. However, investors are cautioned statements, and such statements should not be read or understood as a guarantee of future performance or results. Such statements are subject to risks and uncertainties that could cause actual results or performance to differ materially from those discussed as a result of various factors including, but not limited to risks and uncertainties discussed under Item 1A Risk Factors in our annual report on Form 10-K for the fiscal year ending December 31, 2021, as well as other reports we file from time to time with the SEC.\n\nThese forward-looking statements speak only as of today in which the statements are made, and we do not undertake or intend to update any forward-looking statements after this call or as a result of new information. At this point, I would like to turn the call over to Plug's CEO, Andy Marsh.\n\nAndy Marsh -- Chief Executive Officer\n\nWell, thank you, Teal. So we have published an investor letter today that provides details about the quarter, status of our projects and a summary of our midterm ambitions. I noticed some of our company is tough to financially understand in the near term. It really comes down to two reasons, the cost of hydrogen and selling more equipment.\n\nThe equation for success really comes down to building out our green hydrogen platform, which will transform a negative margin hydrogen business to a growing positive margin business just by turning on the plants. We've already demonstrated this in Tennessee. We can generate hydrogen at one-third of the cost we're paying from the industrial gas companies today. We won't be discussing this issue within a year.\n\nThey'll be in the rearview mirror and the issue will be how to accelerate the plans. Equipment sales, even for our new electrolyzer business gross margins are already over 15%. And we're just starting to scale. We've made fuel cells profitable and material handling and now doing this again in electrolyzers and stationery.\n\nYou put these two items together with the real improvements in service, the 2023 targets of $1.4 billion in revenue, and exiting the year at breakeven operating margins is achievable. The long-term business prospects are even more attractive and all starts with Plug doing real things. I know many of you were at the symposium and you saw a real gigafactory, real electrolyzer systems, real vehicles, real liquid hydrogen trailers, real fueling stations. You were able to touch and feel the hydrogen ecosystem, not in some distant future, but today.\n\nNow for the future. Plug is a leader and will continue to be a leader in the energy transition. We have first-mover advantage in the fuel cell and hydrogen industry that we do not intend to see. We will have first green hydrogen network across the United States by 2025.\n\nAnd when we look out to 2030, we'll have the most commercial vehicles on the road through our Renault JV, Hyvia. We'll have the largest deployments of PEM electrolyzers. We'll be selling fuel cell peaker plants at scale using our hydrogen and many, many more activities will be engaged with. Finally, there are short-term challenges, but we have a clear, well-defined plan that is being demonstrated.\n\nAnd long term, we are building out our hydrogen ecosystem by ourselves and partners that, quite honestly, is unmatched in the industry. Paul and I are now ready to take your questions.\n\nOperator\n\nThank you. [Operator instructions] The first question is coming from Colin Rusch of Oppenheimer. Please go ahead.\n\nKristen Owen -- Oppenheimer and Company -- Analyst\n\nHi. Good afternoon. Thank you for taking the question. This is Kristen on for Colin.\n\nSo the first question, just with the substantial pipeline of opportunities, can you discuss how you are down selecting opportunities to pursue and to commit to, particularly for electrolyzer sales and potential hydrogen offtake agreements?\n\nAndy Marsh -- Chief Executive Officer\n\nSure. I'm going to take the electrolyzer sales, and Sanjay is sitting here with me, and he works the hydrogen offtake agreements every day. So with electrolyzers, there are a few questions we ask right upfront. There are these huge opportunities.\n\nAnd does the customer really have access to renewable electricity or electricity at the scale that's required to generate hydrogen? It may seem like a simple question, but it actually is an important one. The second one is, do they have real projects? And do they have fundamentally land to be able to build an electrolyzer plant with? So we really make sure we understand what is the application, what are they doing with the hydrogen. And the third one is in an industry like this, you have to always be asking the question, how is the customer going to quite honestly pay you? And how are they funded? And that's kind of the first three items we look at when we think about doing a deal and working with the customer. When that no hunt, Sanjay, how do you think about hydrogen itself, selling?\n\nSanjay Shrestha -- Chief Strategy Officer\n\nSure. Hey, Kristen. A couple of things on that, right? So as we mentioned in our shareholder letter, the plan that we're about to build in Europe, we got 6x demand for that and we're just about to break ground, right? So I think the inbound on offtake for the hydrogen is actually pretty substantial, but this is how we think about it, right? We've told you in the past that, we do not want to commit more than 80% of the capacity because we want to leave 20% of that capacity to meet sort of peak demand, all the planned outages that we've seen in the industry to be able to support our customer, as well as a broader hydrogen economy, number one. Number two, we have a lot of activity going on here.\n\nWe're looking at some very, very sizable offtake agreements that are five to seven years in term, that are focused on mobility market application. And we look forward to actually really updating you all here in not-too-distant future on some of those activity we got going on. Second, we're also working with some of the industrial gas companies where it could actually be either like a swap-type agreement or those that are not as heavy on the hydrogen side of the business. We're doing some of that work with them as well.\n\nSo -- and then another thing we're really prioritizing is, as Andy touched on the activity in our stationery business, that's a huge demand driver for our green hydrogen as well. We want to make sure that the capacity that we're building is going to be available to support those apps and many of our customers as well. And as you guys know, we also have deals already with some of our pedestal customers as well. So the way we are looking at it right now, out of that 500 tons, probably about 200 tons of that is going to be for supporting internal activity, internal customer and another 200 tons of that is likely going to be the third party, partly speaking, largely in the mobility, as well as in some of the industrial gas type customers as well.\n\nAndy Marsh -- Chief Executive Officer\n\nKristen, did that answer your question?\n\nKristen Owen -- Oppenheimer and Company -- Analyst\n\nThat's incredibly helpful and I appreciate that detail. So then if we think about just the incremental scale-up needed for the supply chain for fuel cells, are you seeing suppliers scaling to support the additional platforms beyond Plug? Or are they really focusing on just you? Just any color on the supply chain scale-up. Thank you. \n\nAndy Marsh -- Chief Executive Officer\n\nThat's another good question. I think many folks on the call were to our gigafactory, and you can see how Plug is thinking about scaling our own manufacturing operations. I think when you take a step then look at our Vista plant, which is 400,000 square feet, which we were able to build in less than a year to support our business activity. So from our own internal capability, we feel very comfortable with.\n\nAs you know, we hired people who''ve scaled the Tesla business to run both our operation, and he has reporting into him, folks who worked into Tesla's supply chain. We are looking -- we are very focused on some critical items. Some of those items are, I'll say, critical to the performance of the products. Things you may not think a lot about, things like humidifiers, hydrogen tanks.\n\nAnd we have efforts not only to support strongly our present suppliers, but we really had a focus on diversifying our supplier base. And like many people, we're very focused on semiconductors to make sure we have the appropriate semiconductors that meet our needs. I think there's a lot of excitement about this industry. Lots of folks are looking and trying to understand how they can enter.\n\nAnd look, we have volume today, and that makes us attractive.\n\nKristen Owen -- Oppenheimer and Company -- Analyst\n\nThat's really helpful. Thanks so much, Andy. I'll pass it on.\n\nAndy Marsh -- Chief Executive Officer\n\nThanks, Kristen.\n\nOperator\n\nThank you. The next question is coming from Bill Peterson of J.P. Morgan. Please go ahead.\n\nBill Peterson -- J.P. Morgan -- Analyst\n\nYeah, hi. Good afternoon. Wanted to talk about the, I guess, the electrolyzer business merchant. It doesn't seem the backlog has grown.\n\nAnd I'm wondering if this is a function of maybe more your side or if customers are delaying FIDs, perhaps trying to get a better understanding of policy support benefits of the, maybe renegotiating PPAs. Just I recognize it's probably transient, but I'm just kind of curious on what's happening with the backlog. And I guess maybe looking ahead to, where do you see more of the interest coming from as you discussed with your sales folks, ammonia, refining, smaller projects, large scale? Just kind of get a feel for how we should think about it into next year?\n\nAndy Marsh -- Chief Executive Officer\n\nSo Bill, I think that, first, I think that the funnel has changed. We probably -- we're modest in the investor letter. I think that when you take a look at it, the key areas we're seeing activity in is more in the industrial applications, where you're looking specifically at opportunities with things like fertilizer, e-methanol are real areas we see lots of activities. As far as scale, and I'm going to separate scale into what projects will be the big projects to ship next year.\n\nI can tell you and you may have -- you saw at the symposium, Bill, the five-megawatt platform. We're seeing -- in many ways, it's kind of almost a starter kit. But we see a lot of interest also in things like bottle manufacturing. We think next year, just to give you a gauge, we'll probably ship about 400 megawatts of that platform.\n\nOn top of that, there will be a lot of work done on the development of more larger scale plants. But that's kind of how we see it rolling out. So the big numbers for backlogs will roll off more in the '24-'25 time frame, though there'll be some upfront charges that you'll see. But it really so much of it's in the industrial markets where is you show as shown in our investor letter, things like ammonia, methanol, steel, even mixing a natural gas pipeline, there's a lot of activity going on there at the moment.\n\nWas that helpful, Bill?\n\nBill Peterson -- J.P. Morgan -- Analyst\n\nYeah. Yeah, I was just trying to see if this very near-term delays, but it feels like in any case, you pretty feel good about '23.\n\nAndy Marsh -- Chief Executive Officer\n\nYeah.\n\nBill Peterson -- J.P. Morgan -- Analyst\n\nSo just the second question I have is stationary power. Thanks for giving us the color around how you see '23 and '24 evolving. Can you give us a broad feel for how we should think about sort of pricing per megawatt and how should we think about making the margin structure? I presume at low scale, the margins are not going to be coming corporate average. But how should -- how should this evolve over the next few years?\n\nAndy Marsh -- Chief Executive Officer\n\nYeah. I'll make some comments, and I'll let Paul -- Paul's in London at the moment. I'll let him add to my comments. I think that those projects will primarily next year be more geared toward really two applications.\n\nOne is where grid is not available in charging EVs, where I think half of what we ship next year will fall into that category. I think the second category that is really more with our traditional customers at their distribution centers, where we'll be deploying stationary products. And I think, Jose, our VP of Sales in that area, is projecting between 20 to 30 megawatts. We have the capacity, and we're driving the supply chain to make sure we could support 60 megawatts just to give you a gauge.\n\nWe think that business overall because there's more to that business than just the stationary products. You have to build hydrogen infrastructure. We see that business next year when you include everything that needs to be included, probably somewhere between $125 million to $150 million in revenue. Paul, I know -- would you like to add to what I said?\n\nPaul Middleton -- Chief Financial Officer\n\nYeah. I just would comment on the margin side. The real big benefit for Plug is that there's a lot of commonality and components in these products and leveraging what we already established as the base for supply chain and manufacturing. So that is a great platform to kick off from.\n\nAnd then two, because the sales opportunities and the funnel is growing surpass, it will scale faster than other businesses sort of from early on. So all of those factors help mitigate some of the -- maybe some of the start-up effect you have of ramping newer products. So we absolutely expect that product will -- we're targeting north of 30% on that product line as we are on any equipment product line. And I think it will absolutely scale fast in that direction.\n\nSo we expect it to be accretive next year, and we expect it to grow quickly thereafter.\n\nAndy Marsh -- Chief Executive Officer\n\nHey, Bill, I would have one other right is that I think about our ProGen module, a lot like a solar panel. So that ProGen module, which we're selling to Hyvia, is essentially the same ProGen module from an architecture point of view, especially that we're going to be using in stationery. So there's a lot of -- if you think about there's a lot of economies that come from the fact that those product lines are complementary. And just like the solar industry, how solar panels dramatically reduced in cost because you were building the same thing over and over again.\n\nIn reality, what we're doing in mobility and what we're doing in stationery for the fundamental platform is exactly the same, which should really help our cost position next year, but especially long term.\n\nBill Peterson -- J.P. Morgan -- Analyst\n\nYeah, thanks. That makes sense. Thanks for the color.\n\nOperator\n\nThank you. The next question is coming from P.J. Juvekar of Citi. Please go ahead.\n\nEric Petrie -- Citi -- Analyst\n\nHi. Good afternoon. This is Eric Petrie on for P.J. Could you just give us a little bit of essence as to Amazon's $2.1 billion portfolio deal going from forklifts and kind of what's next for them looking at either fuel cell trucks, fuel cell power generation, electrolyzers? What's the next thing that they're looking at?\n\nAndy Marsh -- Chief Executive Officer\n\nYes, yes, yes. Why don't we start with green hydrogen, Sanjay?\n\nSanjay Shrestha -- Chief Strategy Officer\n\nSo as you saw in the Shareholder Letter, right, with did do a 30 tons per day green hydrogen offtake agreement with Amazon. So again, that's just the beginning of many portfolio sales opportunity we can have. That's the value of what we talked about, our vertically integrated model and all the efforts that we've put into positioning the company to where we are. So with that, why don't I turn it to you, Andy?\n\nAndy Marsh -- Chief Executive Officer\n\nYeah. So if you look at what Amazon said to symposium, they really highlighted the need for hydrogen across a wide variety of applications, everywhere from stationary products to on-road vehicles, to electrolyzers. And obviously, we are engaged in all those areas with Amazon. Obviously, I can't say too much more because of nondisclosure agreements.\n\nBut I can tell you from -- if you listen to what Dean says, who runs over 30,000 people in the logistics group at Amazon. They are committed to green hydrogen. They're committed to Plug. We've been their partner now for a long time, and they're really looking to scale this business with us.\n\nAnd obviously, the size of what we're looking at with them, I think you can -- the kind of that $2.1 billion gives you a feel for the scale.\n\nEric Petrie -- Citi -- Analyst\n\nThank you. And then just turning to like commercial vehicles, Hyvia. When should we expect kind of going from pilot to commercial orders? And we've seen some delays on the truck side as well. So just any thoughts there.\n\nAndy Marsh -- Chief Executive Officer\n\nSo, first, I'd like to say Renault had their Investor today, and Hyvia was presented at a model of how they would like to think about their future. But we have built a facility with them that can support deployment of 800 vans next year. We have already identified nine customers, which we've named and others who are looking to start using these vehicles. I can tell you we expect that facility to be -- Hyvia expect that facility to be sold out next year and the scale from there.\n\nEric Petrie -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question is coming from Joe Spak of RBC Capital Markets. Please go ahead.\n\nJoe Spak -- RBC Capital Markets --- Analyst\n\nThanks. So look, I know you sort of led off here talking about some of the modeling difficulties and the issues impacting the near term and how you don't think that persists in the future. And I can appreciate all that. And in the letter, again, you talked about a step change in fuel margins, for instance.\n\nAnd I know at the Symposium, you guided that minus 35%, I think, for the year, which obviously would be a big step change from where you're at now. But with all due respect, I mean we're going on over a year about hearing about step changes and the margins continue to drag. So I guess I really want to understand your level of confidence there. You also sort of talked about, or I think earlier today in response to another question, some of the some charges for industrial application.\n\nI'm not sure if you meant that was for you or for your customers and if that was contemplated. So I guess what I'm really giving you an opportunity to do maybe is -- maybe add a range or some sort of sensitivity around how you feel about the gross margins at the fuel level and the overall company for next year?\n\nAndy Marsh -- Chief Executive Officer\n\nSo Joe, I think you've misunderstood us on two levels here. And so I'll let Sanjay address the hydrogen margins because he's a little perplexed. So let me -- let him explain. And I'll ask -- and then after you get done, I'll ask you more about the industrial components.\n\nSanjay Shrestha -- Chief Strategy Officer\n\nYeah. So Joe, I think -- look, I appreciate the question, right? And as Andy mentioned in his prepared remarks, there's really two factors to drive this margin, hydrogen and equipment, right? So let me take the hydrogen one first. So, so far, other than our plant in Tennessee, we have been buying hydrogen from the third parties, as you very well know. And that hydrogen price has been a function of the price of natural gas.\n\nAnd we know what has happened to the price of natural gas, right? Price of natural gas went up almost 61% in Q2 of this year. And there was a lag in terms of what the hydrogen fuel cost for us in Q3, which is why you're seeing the margin deteriorate from Q2 to Q3 as it relates to what happened to that natural gas prices. But now fast forward, right, now we are commissioning our plant in Georgia before the year is over. We will start our commissioning of our plant in St.\n\nGabe, Louisiana before the year is over. We're expanding in Tennessee, right? We have multiple other plants that we're starting to break ground on. We're starting to make progress on, but we'll have that about 200 tons of plant being commissioned by the end of 2023. So as this plant start to produce hydrogen, that plants come online.\n\nAs Andy said, the cost is going to be one-third of what we're paying for that third-party hydrogen cost. And even lending some of the legacy contract that we have, all of them taper off by 2025 with the blend of what we're going to be producing and servicing our customer third-party sales that we're going to have, we absolutely feel very confident that as you go to the end of 2023, we will exit the year with operating breakeven performance with our fuel business. That will create a step change in our margin profile. And with that, Andy, why don't I turn it over to you how that confluence with the equipment margin and expansion and how that plays.\n\nAndy Marsh -- Chief Executive Officer\n\nYeah. When Sanjay, as I mentioned, in start, Joe, it's really pretty simple. Simple and it's hard to do. But you look at Tennessee, which is about one-fifth our capacity, we already are producing hydrogen at one-third of the cost that we have to buy it for today.\n\nWe're going to have a lot more hydrogen which is our own. I think we're looking at 60 tons of our own next year just for our own customers. That's going to be a very healthy, profitable business for. And also with the production tax credit.\n\nSome of that will keep, some of that will give to customers. And that combination will actually drive a lot more equipment sales. So I guess, we're -- when I take a look at the hydrogen portion of this is really easy to see if you live it every day, but I know that -- I can understand your thought process, Joe. In your other question, Joe, I really didn't understand.\n\nI didn't really think I said anything. I must really miss it -- I must have really misspoken or said something that --\n\nJoe Spak -- RBC Capital Markets --- Analyst\n\nYeah. Also, let me -- I guess, first of all, I totally get what you're talking about on the cost of hydrogen coming down. I guess my -- the point of my question is that underneath that are embedded in that assumption is clearly some glide path on the ramp of plants, right, to sort of be able to produce our own hydrogen. And I wanted to -- that's what I want, I guess, to better understand because clearly, if that doesn't occur, then the margins will continue to suffer.\n\nSo I guess I wanted to -- sort of a point estimate seems just a very defined, and I wanted to understand maybe like a little bit more of a range of outcomes as you see it. On the -- I thought you had mentioned, Andy, that when you're talking about in response to another question, some of the industrial applications for hydrogen, you mentioned -- I thought you had mentioned there might be some upfront charges. I didn't -- I didn't know if you meant for your customers or for you on those charges.\n\nAndy Marsh -- Chief Executive Officer\n\nJoe, I have no idea what I, Joe. But I didn't -- if I said that, there are no upfront charges, I think -- I don't know. I must have not been clear. There's no upfront charges.\n\nSo on the plants, Joe, Georgia, if you go look at our investor letter, it's pretty clear where we are in Georgia. We'll have that commission by the end of the year. The equipment is there. We're already producing hydrogen there as low -- at low volume with our first electrolyzers that have been deployed.\n\nThat will be scaling up and putting out hydrogen for production at scale within three months. If I look at what we're doing with Olin, that plant is an exact copy of what we're doing in Tennessee. The equipment is there. And I think we scaled additional capacity at Tennessee in three months.\n\nSo I guess we don't see maybe the risk that I understand you may see. So I guess we don't see that -- I guess, the challenged levels we see, Joe, are less than you may think.\n\nJoe Spak -- RBC Capital Markets --- Analyst\n\nOK. Fair enough. If I could squeeze one more in here. It looked like there was a little bit of another inventory build.\n\nI'm wondering how much of that is because of some of the project delays you mentioned or how much is maybe some buffer to be able to meet demand because of supply chains? And like what -- how should we think about the right level of inventory for what the business is today?\n\nAndy Marsh -- Chief Executive Officer\n\nI'm going to let Paul take that one, Jeff. Paul?\n\nPaul Middleton -- Chief Financial Officer\n\nYeah. One thing to keep in context, when you look at the timing of the volume is and the sales and context of our guidance, the volume in Q4 will be -- could be in the upper ends of double Q3. So -- and maybe even more in the range of possibilities. We're working every day to deliver all of those programs.\n\nAnd so there's a lot of buildup for that. And that's really the drive. What I would also say is that when you look at the mix of things that we're doing, there's a lot of new platforms between on-road ELX or electrolyzers, stationary new, programs in Europe. I mean it's just a broad -- all of the companies that we've acquired, all of them have different mix and supply chain and scaling opportunities that we're working through quickly.\n\nWe have the fortunate problem of a big growing backlog and opportunities scale to meet all those. So we're focused mainly on delivering and growing that and then you optimize. We've turned on the factory up in Rochester. We literally just last weekend turned on production in the new Vista facility and that scale up in that facility was another record time kind of scale up.\n\nSo short answer to your question is I'm a big believer in no inventory. I think just in time is the best answer, but you will see it come down, and you will see it optimize in the near term as we work through scaling each of those individual businesses and volume helps a lot. So third quarter should be a big -- we'll put a big dent in it -- sorry, fourth quarter will put a dent in it.\n\nJoe Spak -- RBC Capital Markets --- Analyst\n\nYeah. Thanks for that color.\n\nOperator\n\nThank you. The next question is coming from Alex Kania of Wolfe Research. Please go ahead.\n\nAlex Kania -- Wolfe Research -- Analyst\n\nHi there. Maybe just one simple kind of clarifying question just on the shareholder letter. It's just thinking about interpreting the kind of average fuel molecule cost chart. Is that based on -- I guess it assumes what your expected level of hydrogen sales or production is going to be over the course of next year.\n\nBut does that also assume something roughly close to natural gas forward curve? So we're kind of looking at kind of peak, let's say, margin tightness next quarter and then it ends up falling even just based on -- are we looking for gas prices on top of the swap to green?\n\nAndy Marsh -- Chief Executive Officer\n\nI'm going to let Sanjay answer that, Alex.\n\nSanjay Shrestha -- Chief Strategy Officer\n\nYeah. Alex, short answer is yes. We have looked at the future of the natural gas prices to blend what we buy from the third party on that, right? So obviously, that's why you see the peak here. Hopefully, this is a peak here in Q3 from the third-party purchase perspective.\n\nAnd it takes into consideration what we expect our production cost to be from all of these different green hydrogen plant. And again, we do have the incremental benefit of the production tax credit as well. So that's why with the PTC, with our production despite this third-party existing contract in place is what gives us the confidence why we believe that exiting next year, we'll be able to get to that operating breakeven performance in our business.\n\nAlex Kania -- Wolfe Research -- Analyst\n\nOK. Great. Thanks. And then this was -- you talked about maybe a little bit in the prepared remarks, but just could you elaborate maybe a little bit more on discussions with some of these other industrial gas companies.\n\nAm I assuming that that will be beyond Olin? And then maybe just really with respect to Olin, if you could maybe talk about -- there's also a discussion in the investor letter about exploring other sites and things like that. But just kind of what kind of -- given Olin's kind of inherent hydrogen, kind of production for the chemical processes, kind of how big could you see that partnership ultimately getting to?\n\nSanjay Shrestha -- Chief Strategy Officer\n\nSo Alex, we're just getting the partnership started, right? But obviously, we've been working with Olin for a long time, right? Tennessee is the plan that is also a feed gas coming from. So it's been successful in Tennessee. We expect that success to continue also in Louisiana. And as you rightfully pointed out, they certainly do have a lot of feed gas available in the market.\n\nThere's a lot of discussion going on. Give us some time, we'll be happy to share with you a lot more incremental updates. And we're in a discussion and dialogue with a partner right now, but I do want to have some time here before we can get into more specifics on that. But I think you're thinking logic is the right one here because they certainly do have a lot of feed gas available, and we're in discussion with them in terms of how can we rapidly expand this partnership into something much bigger than just the Tennessee and Louisiana as well.\n\nThat's on Olin side, right? And when we were referring about some of the industrial gas opportunity. Look, I mean, over time, this hydrogen should enter into some sort of a swap agreement. If you're looking for a green hydrogen, if you don't have it and if Plug has it, we're happy to provide that green hydrogen industrial gas company as well because it's a big market. We all have to work together, number one.\n\nNumber two, there are some of the smaller industrial gas companies that actually don't have a lot of hydrogen capacity, probably would like to have that as a part of your portfolio offering as well. And that's where we have some of those discussions going on at a pretty advanced stage as a matter of fact, and that's really what we're referring to.\n\nAlex Kania -- Wolfe Research -- Analyst\n\nGreat. Thanks.\n\nAndy Marsh -- Chief Executive Officer\n\nThanks, Alex.\n\nOperator\n\n[Operator instructions] The next question is coming from Eric Stine of Craig Hallum. Please go ahead.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nHi, everyone. So I have been jumping between calls. Apology if probably already been asked. But just curious.\n\nI mean, I know when you provided the updated guidance back, I mean it was a couple of weeks before the Symposium, you certainly contemplated a third quarter, fourth quarter split that was going to be magnified. And I'm just curious how the split actually played out? Is that -- I mean, was that in line with your expectations? And as we think about, I think Paul just referred to potentially fourth quarter being 2x the third quarter. It's very -- I'm just wondering, are there -- what are the things that kind of dictate that? I mean, are there large projects? Is it -- what are the things that could either be upside or potentially slip to '23?\n\nAndy Marsh -- Chief Executive Officer\n\nPaul, I'm going to let you take that one.\n\nPaul Middleton -- Chief Financial Officer\n\nYeah. Well, the first thing is we've been pretty transparent about scaling the electrolyzer plant in Rochester, and the volume is dramatically increasing every month. And so it's just by the nature of that scaling activity, a lot of that volume happens in Q4. The second thing is a lot of these new programs that we -- new products that we've been winning and developing and launching, a lot of them stem from, I'm going to call it, big lumpy sum -- lumpy contracts.\n\nAnd those were in -- certainly within our expectations in terms of timing when they would close and it's playing out as we thought, and we're closing those now and -- or have closed them, and we're working on delivering them. So those are in line. And then the third thing is just material handling. Every year, it tends to flip.\n\nSometimes Q3 is bigger in terms of timing. And sometimes Q4 is bigger in terms of timing. And so these big pedestal customers, they kind of -- it just -- it varies with them. But we've actually been -- as we announced back in the symposium.\n\nWe've launched and completed a number of new pedestal customer programs, which we knew would be kind of the Q4 timeframe for those to close, things like the ranger programs we've talked about, those are all underway as we speak. That's the first time we've done things for them at scale. It's exciting. And things like the Lidl program that we won and other new pedestal customers, so those are in line.\n\nSo I'd say, by and large, it's consistent with what we thought in context of the updated guidance we gave.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nOK. That's helpful. I will jump back in the queue. Thanks.\n\nAndy Marsh -- Chief Executive Officer\n\nThanks, Eric.\n\nOperator\n\nThank you. The next question is coming from George Gianarikas of Canaccord. Please go ahead.\n\nGeorge Gianarikas -- Canaccord Genuity -- Analyst\n\nHi. Good afternoon, everyone, and thank you so much for taking my question. So just first, when you talk about back leveraging plans to recycle capital, to build your hydrogen network. Are you assuming you'll be doing that all on your own? Or are you looking for more partners? Or do you need more partners to help finance that build? Thank you.\n\nAndy Marsh -- Chief Executive Officer\n\nGo ahead, Sanjay.\n\nSanjay Shrestha -- Chief Strategy Officer\n\nHey, George. How are you? So look, I mean, I think two things, right, on that. So obviously, we always explore and see what is the right structure a partnership can look like, right, whether it's a partnership with the likes of infrastructure fund or partnership with the likes is just strategic funds, that's always an option. But given where we are, there are two things that will happen, right? One is as these plants come online, we'll be able to demonstrate what is the cash flow from this plan is first thing, right? So there'll be a track record of a, let's say, for 12 months, number one.\n\nNumber two, now with the production tax credit, you do have a view on a 10-year forward cash generation just without PTC as well, depending on what the split of that is between us versus the customer. That part is really getting refined here at this point in time. But can we do the back leveraging on these plans on our own? Answer is yes, we can. Is that the pathway go down? Frankly, we're having a lot of discussion at this point in time.\n\nIt depends on what is the optimal solution for us. But this is no different, though, right, than what really happened in the solar and in the wind space when it first kind of got started, call it, about 10 years ago, right? So first, you have the DOE loan guarantee program for three mega solar project, which then led to the back leveraging those projects. You basically had ITC in the solar space that began 30% of the capital stack ITC. We have production tax ready in the wind industry, which then became 50% to 60% of capital stack in the wind industry.\n\nSo there should be no change or no difference in terms of how the capital stack will unfold in the green hydrogen industry as well. But once we actually start to really generate cash from these plans and with the PTC now as a part of this Inflation Reduction Act, we absolutely believe that we will be able to back leverage there'll probably be some sort of a tax equity at some point, fast forward several years out. And we will be really able to not have to do this green hydrogen plant with 100% equity, balance sheet financing, but we should be able to do that out of the gate, probably it's 40% equity. There is a scenario where you can envision that eventually goes down to 20%.\n\nAnd that's what we mean when we say we should be able to get four to five times multiple of available capital to really execute on the green hydrogen generation network that we're looking to build.\n\nGeorge Gianarikas -- Canaccord Genuity -- Analyst\n\nThank you. And if I could just ask one follow-up. I'd love to get your thoughts on recent traditional energy activity in renewable natural gas. And I'm curious as to how you see that potentially extending more into hydrogen over time and how you see that potentially playing out? Thank you very much.\n\nAndy Marsh -- Chief Executive Officer\n\nYou want to give your view, Sanjay?\n\nSanjay Shrestha -- Chief Strategy Officer\n\nNo, you can start as well. Yeah, it's an interesting question.\n\nAndy Marsh -- Chief Executive Officer\n\nIt's an -- I think ultimately as renewable electricity comes to scale, I think the local carbon footprint of using green energy, coupled with electrolyzers, is the long-term solution. I think RNG is an interesting niche market, which supports the transition but it's not going to be ultimately the winner. And I would put in an analogous to blue hydrogen. I was talking to one of the large funds in the Middle East on the sovereign funds.\n\nAnd I asked them, why are you talking to me when you could be generating blue hydrogen all day long? And their answer to me, once green hydrogen is shown to be competitive with blue hydrogen, no one's going to use blue hydrogen. And I think the same holds for RNG versus hydrogen.\n\nSanjay Shrestha -- Chief Strategy Officer\n\nAbsolutely, Andy, right. Again, just to add to what Andrew has said, George, I think it's really a question of scale. We believe that the green hydrogen is scale much, much bigger going forward, leveraging off of the renewable asset.\n\nAndy Marsh -- Chief Executive Officer\n\nYeah. Not that again -- so I'm not against anything that helps accelerate the transition. And I think RNG helps accelerate the transition.\n\nGeorge Gianarikas -- Canaccord Genuity -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question is coming from Sam Burwell of Jefferies. Please go ahead.\n\nSam Burwell -- Jefferies -- Analyst\n\nHey, good afternoon, Andy. Wanted to dig in on kind of the gross margin trajectory a little bit. So I guess, first off, for 4Q and Paul already touched on it a lot like the equipment sales should be up a lot, maybe almost a double in 4Q. So that should probably drag the companywide gross margin up.\n\nBut I'm curious how high should it or can it go in 4Q, assuming like roughly 20% equipment gross margins? Are there any other material uplift you should expect, whether it's fuel or service or PPA?\n\nAndy Marsh -- Chief Executive Officer\n\nI will let Mr. Middleton take that one, Sam.\n\nPaul Middleton -- Chief Financial Officer\n\nYeah. I think -- so the short answer is you hit the nail on the head. It's a significant delta in equipment sales in the quarter, right? That's really -- I mean, the recurring revenue, think about it like a layer that you layer in comes over time. But in short instance like this one where there's a significant step function change in the volume and the sales volume largely driven by equipment.\n\nSo that will certainly have a very significant positive impact. There are other things like the scaling I mentioned a minute ago on electrolyzer. So if you think about volume out of that facility, driving up substantially in the quarter from previous quarters. That means substantial leverage on those investments that we weren't getting those run rates are real near.\n\nSo those are very positive. We expect -- we're seeing big improvements. We see continued improvements in our service offering, which affects our service revenues and our PPA. We have a number of programs we've launched this year, and you're just starting to see the benefits of those part terms.\n\nIn some cases, some of the sites where we launched the upgrades, we're seeing 70% to 80% reduction in part cost. So those benefits are just starting to really manifest and play through our numbers. We think the service cost on a unit basis will be down in the fourth quarter, about 10% to 15% compared to where we were in Q1 as an example. And then there's a bigger step function that almost as you saw by the chart, is forecasted to be cut almost in half in the course of next year as those programs continue to pay benefits and new units roll out with that better mix offering.\n\nSo there's a whole host of things that are playing in our favor that we'll start to see some of those benefits certainly in Q4 and then you see it really starting to magnify into next year. There are headwinds. I mean, like fuel and, as Sanjay alluded to, natural gas prices and other things, but those positive events really help put more of a positive tailwind to that margin trend.\n\nSam Burwell -- Jefferies -- Analyst\n\nOK. That's certainly helpful. And then maybe shifting to look at 2023. And recall from the update that you guys gave on the guidance back in October, you said that some projects were pushed out to next year.\n\nSo is it right to think that there might be less of a quarter-on-quarter decline in revenues in 1Q versus 4Q than like typically, you see because of seasonality? I'm just trying to get a sense of what we should expect for the trajectory of sales on the equipment side through 2023? And then also, how should we think about the margin trajectory for that segment in 2023? Is there any fixed cost absorption that should really improve through the year? Or should it be fairly consistent around that 20% mark in all four quarters?\n\nAndy Marsh -- Chief Executive Officer\n\nPaul, that sounds like a question for you.\n\nPaul Middleton -- Chief Financial Officer\n\nYeah. I would say, in general, I would expect still  a one-third, two-third kind of phenomenon in our sales next year for the -- in terms of the first half, second half. We have a number of -- the material handling dynamic still is still the same, where there's still a heavy push for new facilities and even renewals to happen starting kind of the June-ish timeframe and leading into the busy period. So that dynamic hasn't changed.\n\nYes, some programs may slide and that certainly helps Q1. Overall volumes are up. So that helps. So you'll certainly see year-over-year growth from Q1 of next year to Q1 of '22.\n\nBut I don't know that -- I guess the best math I would use is just using a similar split, if you will, of this year as a proxy for how the quarters may play on a percentage basis into next year. I think, having said that, Q4 is going to be a big quarter for us. I mean it's just the timing of the way the programs have flown and how this particular year has flown with material handling timing, and that certainly makes Q4 big. So it's nothing surprising to us.\n\nAnd as we move into next year and work toward hopefully over delivering, we certainly -- that will compound second half activities with all the things that we're chasing to try and, as I said, over deliver on the volume. So for all those reasons, I expect that to -- it will certainly be lower most likely than Q4, but substantially higher than last year's Q1 and compounding thereafter.\n\nAndy Marsh -- Chief Executive Officer\n\nYeah. Sam, I'm trying to ship everything I can this year.\n\nSam Burwell -- Jefferies -- Analyst\n\nSorry, just quickly though. What about the margin trajectory in equipment? Should that be fairly consistent? Or are there a lot of fixed costs that get absorbed just as you ramp up electrolyzers and improve through the year?\n\nPaul Middleton -- Chief Financial Officer\n\nYeah. I think we gave 10% as a holistic number for next year. And because it goes consistent with volume, you'll see much stronger margin profile in the second half, both from fuel activities and from the equipment sales. But again, I expect Q1 to be a better margin profile than Q1 of this year, and I expect it to be every quarter to be better next year given the build of equipment activities and moving on.\n\nSo I think directionally, that's probably -- that's certainly how it will play.\n\nSam Burwell -- Jefferies -- Analyst\n\nOK. Great. Thanks, guys.\n\nAndy Marsh -- Chief Executive Officer\n\nThanks, Sam.\n\nOperator\n\nThank you. The next question is coming from Greg Lewis of BTIG. Please go ahead.\n\nGreg Lewis -- BTIG -- Analyst\n\nHey, thank you. And good evening, everybody, and thanks for taking my call. Just one question for me. Sanjay, I guess, congrats on bringing on FreezPak, met those guys at the Symposium, super nice guys and they're super pumped about the use and Plug solutions.\n\nOne of the questions I had, and I know you've talked to in the past is about the ability to kind of go in the mid-end of the market. I guess I'm wondering, any update there on the penetration on the mid and small ends of the market? And really, as you look ahead to 2023, how are you thinking about that opportunity? Thanks.\n\nAndy Marsh -- Chief Executive Officer\n\nSo Greg, this is Andy. I spent a lot of time with Jose, who runs that business. I think probably the interesting mix in the fourth quarter is customers, which are smaller, probably represent 35% of the shipments this quarter. I think that's a dramatic change.\n\nAnd some of that will continue to improve. And I think the -- I've made reference to, can you share a bit of the production tax credit to make the value proposition more attractive and let us sell more equipment? And I think you'll see more and more of that. So the answer is we're doing much better in smaller applications. And I can tell you -- so we are also looking at and there's work going on for much smaller hydrogen infrastructure.\n\nAnd I can tell you that I have it -- we do have solutions that we've developed for Europe and that we're looking to bring them to the United States. It's one of the reasons Jose has been able to be successful to start bringing along more pedestal customers in Europe.\n\nGreg Lewis -- BTIG -- Analyst\n\nAnd then I guess I'll just follow up on that, Andy, thanks. Is there any way to think about the margins on in versus larger? I mean, I would imagine they have to be at least a little better. Is that kind of a fair way to think about that?\n\nAndy Marsh -- Chief Executive Officer\n\nSo they're listening, Greg.\n\nGreg Lewis -- BTIG -- Analyst\n\nWell, they need to buy more than.\n\nAndy Marsh -- Chief Executive Officer\n\nYeah. I would just say -- I have Paul comment if he has any changes. Yes, obviously, if you buy more, the price is lower than if you buy less across the board for other elements, hydrogen fuel and service. And I would think we kind of look like any of the companies you follow that I've had that experience.\n\nGreg Lewis -- BTIG -- Analyst\n\nSuper helpful. Thank you.\n\nAndy Marsh -- Chief Executive Officer\n\nOK.\n\nOperator\n\nThank you. The next question is coming from Ameet Thakkar of BMO Capital. Please go ahead. [Operator instructions] The next question is coming from Craig Shere of Tuohy Brothers.\n\nPlease go ahead.\n\nCraig Shere -- BMO Capital Markets -- Analyst\n\nGood afternoon. So first, I just want to make sure I understand the rough next year revenue trajectory we're talking about. It sounds like maybe in the ballpark of $450 million to $500 million in the first half with every quarter improving sequentially from first to second to third. And then as usual, third and fourth quarter being kind of a toss-up as to what's the top for the year.\n\nAndy Marsh -- Chief Executive Officer\n\nPaul, do you want to take that?\n\nPaul Middleton -- Chief Financial Officer\n\nYeah, I think that's right. I think I -- because we're chasing programs, as I said, our goal is to over deliver. I mean we're focused on beating our numbers every year. And certainly, this year will be the strong press to push that.\n\nSo we expect a lot of programs to come in, in the second half, as they always do. And between the material handling dynamics and landing those big programs and working through the timing of volume, will probably make Q3 or Q4 a little bit of cost up, but most likely, Q4 will be a little bit heavier.\n\nCraig Shere -- BMO Capital Markets -- Analyst\n\nGotcha. OK. And then one for Sanjay. I think, Sanjay, that coming out of the Symposium, there's a little confusion.\n\nI mean there's been a little horsetrading to optimize some of your hydrogen plants and get the most scalability, the best returns. And it sounds like you're still targeting like a nameplate commissioning capacity at year-end about the same, but it's possible that the production that was previously anticipated actual H2 production through 2023 might be a little less than was thought a couple of quarters ago? And that may restrain the ability to raise guidance, but margins beyond '23 should then proportionately benefit with the combination of the stale fuel and the IRA PTC?\n\nSanjay Shrestha -- Chief Strategy Officer\n\nYeah. So let me maybe take a step back, right? So Craig, as you know, when we -- I think you know this pretty well, right? When we talk about commissioning the plant to full production, there's about a three to four month lag, right? And it depends a bit on whether it's essentially our electrolyzer plus liquefier or it's just the feed gas and the liquefaction technology, right? And if it's just a feed available sort of like this Olin JV in Louisiana and what we do in Tennessee, the commissioning of that actually could even be faster than that. So I don't know if I would say that we're necessarily tweaking or adjusting the view. We've always said that we wanted to be at 200 tons of commissioning by the end of 2023.\n\nAnd look, and you know that we're looking at 70 tons of commissioning this year, but we've gone through a lot of detail on why we are going to be at that 45 to 50 tons of commissioning by the end of 2022. But from -- by the end of 2023, our goal always was to get to that 200 tons of commissioning and that was a mix of project in New York, project in Texas, right, expansion in Georgia, expansion in Tennessee and ongoing work that we're doing in Louisiana. So -- and from a cadence standpoint, right, the way you should think about is -- as you go into Q2 of next year, you should start to see the contribution of that low-cost hydrogen from Georgia. And again, in Q2, you should also start to see the contribution of that low-cost hydrogen coming from Louisiana, some gases hydrogen coming out of Tennessee.\n\nThen as you go into the Q4 of 2023, you should start to see some contribution coming from New York and Texas. Some incremental contribution, again, coming from Georgia because we have told you that we're really looking to get that plant to be 30 tons by the end of the year. There was an existing infrastructure, that will be actually a faster moving. And by the way, Craig, we also have some of the projects in the hopper that we're working because it's a development business, and we want to make sure that we're thinking about optimizing and balancing if one project is a month or two behind then we have something else that we can actually backfill that with, if you would.\n\nSo that's how I would think about it in terms of the cadence of that and how things will play out in 2023.\n\nCraig Shere -- BMO Capital Markets -- Analyst\n\nGotcha. Thank you.\n\nOperator\n\nThank you. The next question is coming from Greg Wasikowski of Webber Research. Please go ahead.\n\nGreg Wasikowski -- Webber Research -- Analyst\n\nHey, good afternoon, Andy. A couple of quick ones on the pedestal customers. And apologies, I've also been hopping back and forth. So sorry if already asked, yeah.\n\nSo I noticed --\n\nAndy Marsh -- Chief Executive Officer\n\nWe were not that fascinating that you spent a whole hour with us.\n\nGreg Wasikowski -- Webber Research -- Analyst\n\nI wish you were the only ones I covered. On the pedestal customers, just noticed since the Symposium, Lidl is now officially named Pedestal. So just curious, any color on what has developed since a Symposium to now if it's just as simple as executing an agreement or if there's anything interesting for us to know there? And then also if you could comment on just the relative size of where that stands versus the rest of the stationary power customer -- or sorry, the pedestal customers without giving numbers, but kind of where, relatively speaking, it may rank among the others, that would be great. Thanks.\n\nAndy Marsh -- Chief Executive Officer\n\nSure. So Greg, yes, we signed contracts after symposium. So that was pretty exciting. So it happened about two days after the symposium.\n\nAnd Lidl has about 150 distribution centers in Europe. So you can kind of start thinking about them as the size of Home Depot.\n\nGreg Wasikowski -- Webber Research -- Analyst\n\nOK. Great. Very helpful. And then one more, just on pedestal customers, one that we haven't heard about as much over the last year and a half since the original announcement was GM.\n\nSo just wondering if there's any broad-based updates there. Any appetite for expansion or different types of applications, whether it be stationary power or etc.? Any update would be great?\n\nAndy Marsh -- Chief Executive Officer\n\nSo we are doing deployments with GM this quarter. We've been continuing to work with GM. Certainly not as many opportunities there as Home Depot and Walmart and Amazon or Lidl. But it's -- I'm pretty pleased with the progress.\n\nGreg Wasikowski -- Webber Research -- Analyst\n\nOK. Great. Thanks, Andy.\n\nAndy Marsh -- Chief Executive Officer\n\nOK.\n\nOperator\n\nThank you. The next question is coming from Ameet Thakkar of BMO Capital. Please go ahead.\n\nAmeet Thakkar -- BMO Capital Markets -- Analyst\n\nLet's try this again. Sorry about that. I'll make it quick because I know it's been a long evening. But just -- it's more of a housekeeping question, but I noticed in the investor letter, you guys reaffirmed your kind of 2026 and 2030 revenue and margin targets and did the same for 2022 revenues.\n\nShould we still be thinking about the 10% gross margins for 2023 in explicitly?\n\nAndy Marsh -- Chief Executive Officer\n\nYeah, Paul, I'll let you answer. But I think we're standing -- the chart that you presented on margins and performance for '23, 2030 --\n\nPaul Middleton -- Chief Financial Officer\n\n'26.\n\nAndy Marsh -- Chief Executive Officer\n\n'26, there's no changes to that.\n\nAmeet Thakkar -- BMO Capital Markets -- Analyst\n\nGreat. And then -- go ahead, Paul.\n\nPaul Middleton -- Chief Financial Officer\n\nNo, I was just saying, yes, I agree, it's a 10% still our target next year. And yes.\n\nAmeet Thakkar -- BMO Capital Markets -- Analyst\n\nAnd just real quick. And then thinking about like a lot of the electrolyzer contracts your equipment you're selling in Europe. Is there going to be like a service revenue part of that as well that's going to kind of grow as you deploy more capacity out there?\n\nAndy Marsh -- Chief Executive Officer\n\nYeah. That's actually a good question. And what we -- so the answer is yes. What we really haven't talked a lot about is the opportunity for service with electrolyzers, which when I review with the team, maybe much more attractive than material handle.\n\nSo we are -- a lot of the work we're doing in Europe, as you know, will be associated with electrolyzers and the service business. When we look at it, we think could be very, very attractive.\n\nAmeet Thakkar -- BMO Capital Markets -- Analyst\n\nThank you, guys.\n\nAndy Marsh -- Chief Executive Officer\n\nAll right. Well, thanks, everyone. I appreciate everyone who is on the call today. Looking forward in January to provide you the annual update, which will happen probably at the end of January.\n\nWe'll schedule. And thank you again. Bye now.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTeal Hoyos -- Director of Marketing Communications\n\nAndy Marsh -- Chief Executive Officer\n\nKristen Owen -- Oppenheimer and Company -- Analyst\n\nSanjay Shrestha -- Chief Strategy Officer\n\nBill Peterson -- J.P. Morgan -- Analyst\n\nPaul Middleton -- Chief Financial Officer\n\nEric Petrie -- Citi -- Analyst\n\nJoe Spak -- RBC Capital Markets --- Analyst\n\nAlex Kania -- Wolfe Research -- Analyst\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nGeorge Gianarikas -- Canaccord Genuity -- Analyst\n\nSam Burwell -- Jefferies -- Analyst\n\nGreg Lewis -- BTIG -- Analyst\n\nCraig Shere -- BMO Capital Markets -- Analyst\n\nGreg Wasikowski -- Webber Research -- Analyst\n\nAmeet Thakkar -- BMO Capital Markets -- Analyst\n\nMore PLUG analysis\n\nAll earnings call transcripts"
}