{
  "companyName": "Ontrak, Inc.",
  "companyTicker": "OTRK",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/ontrak-inc-otrk-q2-2022-earnings-call-transcript/",
  "content": "Ontrak, Inc. (OTRK 2.37%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to Ontrak 2Q '22 earnings call. [Operator instructions] I would now like to hand the conference over to your host, Caroline Paul, investor relations.\n\nCaroline Paul -- Investor Relations\n\nThank you, and thank you all for participating in today's call. Joining me today are Terren Peizer, chief executive officer; Brandon LaVerne, chief operating officer; Mary Lou Osborne, chief commercial officer; and James Park, chief financial officer. Earlier today, Ontrak released financial results for the quarter ended June 30, 2022. A copy of the press release is available on the company's website.\n\nBefore we begin, I would like to make the following remarks concerning forward-looking statements. All statements in this conference call other than historical facts are forward-looking statements. The words anticipate, believes, estimates, expects, intend, guidance, confidence, targets, projects and to other expressions typically are used to identify forward-looking statements. These forward-looking statements are not guarantees of future performance but may involve and are subject to certain risks and uncertainties, other factors that may affect Ontrak's business, financial condition and other operating results, which include, but are not limited to, the risk factors described in the Risk Factors section of the Form 10-K and Form 10-Q as filed with the SEC.\n\nTherefore, actual outcomes and results may differ materially from those expressed or implied by these forward-looking statements. Ontrak expressly disclaims any intent or obligation to update these forward-looking statements. With that, I'd like to turn the call over to Terren.\n\nTerren Peizer -- Chief Executive Officer\n\nThanks, Caroline. Good afternoon, everyone, and thank you for joining us. As chief executive officer of Ontrak Health, my belief in the mission of Ontrak Health and our people is unwavering. It's why we are remaining true to our business strategy and while I have committed financing to help the company grow.\n\nWe are continuing to refine and market our AI-infused enhanced clinical model. Our evidence-based approach to integrated care is exactly what prospects have told us they need and what we think differentiates us in the marketplace. I've asked Brandon LaVerne and Mary Lou Osborne as co-presidents to build on the excellent work they've been doing and run the day-to-day operations and growth activities of the company. You will also hear from our new chief financial officer, James Park, who has seamlessly stepped into the role.\n\nI have full confidence in them and our leadership team. I will focus on capital formation and long-term strategy, and I'm excited to see our progress materialize into new customers and growth. Now I'd like to turn the call over to Mary Lou Osborne, our co-president.\n\nMary Lou Osborne -- Chief Commercial Officer\n\nThank you, Terren. I'm grateful for the opportunity to help lead Ontrak Health. My top priorities are supporting our current health plans and employer customers in achieving their growth goals and new business development to drive Ontrak's growth strategies. In my prospect meetings, it's clear, we have a compelling and innovative solution for health plans, value-based provider groups and self-insured employer groups.\n\nThese prospects are searching for solutions that improve the health of their members with behavioral health and physical health comorbidities, provide prompt behavior health network access and availability, and decrease medical expenses by reducing avoidable emergency room and inpatient utilization. In our current conversations with prospects, we are encouraged by their interest and engagement with Ontrak Health. I will provide an update on our pipeline progress, outlining the major categories of our prospects, which include health plans, large self-insured employer groups, value-based provider groups and LifeDojo prospects. First, we continue to have a very robust pipeline of 19 health plan prospects representing national, regional and local health plans in all lines of business across the U.S.\n\nOne large state plan has shared with us over 1.2 million lives in their data feed, from which we were able to ascertain a significant opportunity greater than our existing customer base to improve the apparent unmet behavioral health needs of their members, which include a significant cohort of first responders. The data received includes all lines of business, and we are currently awaiting a final data feed from which we will make our final pricing proposal. Our discussions with this prospect indicate a potential launch date of Q1 2023. A second large multistate plan with over 1 million Medicaid members remains in the data exchange phase.\n\nI'm optimistic about this opportunity moving to a clinical and financial proposal soon. The remaining health plan pipeline features a variety of prospects in early to mid stages of development, which, combined with the prospects mentioned earlier, cover approximately 6 million members. This translates to a potential outreach pool between 125,000 to 200,000 members. In addition, we are working on three expansions with two of our current health plan customers, which include a new state expansion, a customer's own employee base, and a new line of business.\n\nWe are encouraged by these conversations that highlight the unique value proposition Ontrak delivers to these customers. We believe these expansions will contribute to revenue beginning in Q1 2023. In our second category, we have several active self-insured employer group prospects with whom we are in discussions. One of these is a large union with 500,000 members that includes frontline healthcare workers who are dealing with depression, anxiety and the effects of COVID-19.\n\nThe next step is for this -- for member data sharing and providing a clinical and financial proposal. Our third prospect category is a large value-based provider groups where we have three active prospects including a partnership that would allow us to improve access and availability to more behavioral health providers for their patients through our behavioral health network, covering multiple cities across two states. Our fourth prospect category is our LifeDojo well-being digital solution where we have four active prospects across a variety of employer organizations. One of these prospects is currently evaluating our financial proposal for at least 600,000 lives and their dependents after completing a successful pilot.\n\nTo summarize, our pipeline is progressing and robust across each of our prospect categories as we expand our outreach and engagement with a variety of health plans, employers and provider groups located across the U.S. Our Ontrak Health Plan opportunities continue to represent most of our revenue growth potential beginning in Q1 2023 and remain the focus of our sales efforts. Now I'd like to turn the call over to Brandon LaVerne.\n\nBrandon LaVerne -- Chief Operating Officer\n\nThanks, Mary Lou. I also want to thank Karen for the opportunity to co-lead Ontrak Health alongside you. My focus is on our operational, technological and clinical delivery. To that end, we've made some important appointments beginning with James Park as CFO; and Dr.\n\nJudy Feld as chief medical officer. I'm really excited about the new team structure and have full faith that James and Judy's decades of experience will bring significant value to Ontrak Health. We have also immediately centralized our cross-functional operational leadership under one roof to ensure seamless development, delivery and integration of our AI-infused evidence-based clinical model while maintaining deep collaboration with the clinical teams. Our model places an emphasis on a series of innovative elements that we believe differentiate us versus app-based solutions, managed behavioral health organization offerings and care management within health plans themselves, such as, number one, the use of augmented intelligence throughout the entire program, not just upfront in identification and eligibility.\n\nThis is a proprietary orchestration of different technologies into our advanced engagement system, the platform that all of our activity rests on. Use cases include enhanced engagement capabilities such as optimal time to call, natural language processing prompts and sentiment analysis to help our coaches maximize their conversations with members and AI-generated notes for coach and provider visits. Number two, evidence-based techniques and strategies like motivational interviewing, smart goal setting, research-based, tailored content, standardized behavioral health assessments and measurements of progress. Number three, measurable and consistent engagements like continuous coaching sessions, therapists, psychiatric and medication-assisted provider visits and other meaningful care team interactions.\n\nAnd number four, enhanced provider relationships to promote quality, access and availability, bidirectional communication and effective treatment plans. Taken together, this blending of technology and human interactions focused on a whole person approach represents a competitive advantage for Ontrak Health that we are proud of and excited to bring to the market. It's a high-tech and high-touch approach to integrated care that we believe makes a huge impact not only to our health plan customers and prospects, but also to the lives of the members we serve. Now I'd like to turn it over to our new chief financial officer, James Park.\n\nJames Park -- Chief Financial Officer\n\nGreat. Thanks, Brandon. I want to thank you, Mary Lou and Terren for the opportunity to step in some big shoes and I'm very excited for the opportunity. On to the second quarter.\n\nWe reported revenue of $3.9 million, an 85% year-over-year decrease due primarily to the loss of two large customers we previously discussed. At the beginning of the quarter, we have 2,867 enrolled members and ended with 2,094 at the end of the quarter or a simple average of 2,481. The decrease in enrolled members was driven by the greater number of members that either graduated or disenrolled during the quarter compared to the number of newly enrolled members during the quarter. That equates to revenue of about $524 per enrolled member per month for the quarter, compared to $685 per enrolled member per month in Q2 of 2021, and $526 per enrolled member per month in Q1 of 2022.\n\nWe expect the revenue per enrolled member per month to continue at the current rate in the near future. To go a bit deeper into Q2 enrollment, we enrolled a total of 364 members during the quarter compared to 3,152 in Q2 of last year. Dividing Q2's gross enrollment by the outreach pool, which average approximately 3,750 for the quarter, it annualizes to a 29% enrollment rate compared to a 28% annualized rate we saw in 2021, and 38% in Q1 of 2022. While we expect these rates to continue for our existing and mature customers, as we bring on new customers, we expect the enrollment rates to be higher in the first three months following launch as we are able to effectively work through the initial outreach pool that would be targeted for the first time.\n\nOur average monthly disenrollment rate was 8%, which is consistent with the improving trend over the past few quarters. Further, we graduated 549 enrolled members during the quarter, which equated to about 19% of the enrolled numbers in the program at the beginning of the quarter. The net impact of all that was a net enrollment decrease of 773 members in the second quarter. Our gross margin for the second quarter was 43.5%, which decreased sequentially from 45.9% and decreased from 67.8% in the second quarter of last year.\n\nThe decrease in our gross margin is due to the decrease in our revenue related to the loss of two of our customers, as well as the new pricing model previously discussed. We expect our gross margin to normalize in the low 50s by end of the year. We ended the quarter with 70 team members included in our cost of revenue, down 20% sequentially from 88 at the end of Q1, which is in line with the decrease in our enrolled members. Turning to the balance sheet and cash flow.\n\nOur cash flow from operations in the second quarter was negative $4.2 million, compared to negative $3.3 million in the second quarter of last year. We ended the quarter with cash and cash equivalents of $10.1 million, down from $27.2 million at the end of the first quarter 2022. Including restricted cash, total cash was $14.5 million, down from $31.7 million at the end of the first quarter this year. Of the decrease in cash $11.7 million was related to principal note payment to our former lender during the quarter.\n\nWith our agreement that we closed on during the current quarter, we have access to $25 million, of which we drew down $5 million subsequent to quarter end and have paid off our remaining balance of $7.5 million of the existing debt with our former lender. We also have recently raised a net $3.5 million last week and continue to work on improving our capital structure to allow us to execute upon our sales pipeline. Regarding our outlook. Our pipeline is a large and diverse as it has ever been.\n\nAnd as Mary Lou outlined, we expect to have new clients signed during this year that we believe will go live in Q1 of 2023. To provide some context into the potential impact of the health plan prospects that Mary Lou mentioned, based on historical experience, each 1 million health plan members would equate to approximately 25,000 members in our outreach pool, which at our current enrollment rate would equate to 7,000 enrolled members. And at our current revenue per enrolled member per month, this would equate to a revenue opportunity of approximately $11 million per quarter. However, given how the timing and the budget cycle of these large health plans has evolved, we do not currently expect our pipeline to contribute to revenues materially in Q3 and Q4 as we had previously anticipated.\n\nAs such, we will be updating our revenue guidance for the year to be in the range of $14 million to $16 million and continue to believe that 2023 will show triple-digit growth. I'd now like to open our call for any questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] At this time, I'd like to turn it back to the speakers for any further comments.\n\nTerren Peizer -- Chief Executive Officer\n\nThank you, everyone, for your time today and your interest in Ontrak. Have a great rest of your day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCaroline Paul -- Investor Relations\n\nTerren Peizer -- Chief Executive Officer\n\nMary Lou Osborne -- Chief Commercial Officer\n\nBrandon LaVerne -- Chief Operating Officer\n\nJames Park -- Chief Financial Officer\n\nMore OTRK analysis\n\nAll earnings call transcripts"
}