{
  "companyName": "StarTek, Inc.",
  "companyTicker": "SRT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/startek-inc-srt-q2-2022-earnings-call-transcript/",
  "content": "StarTek, Inc. (SRT 0.27%)\nQ2 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, everyone, and thank you for participating in today's conference call to discuss StarTek's financial results for the second quarter ended June 30, 2022. Joining us today are StarTek's global CEO, Bharat Rao; the company's global CFO, Nishid Shah; and the company's head of business transformation, Ronald Gillette. Following their remarks, we'll open the call for your questions. Before we continue, we would like to remind all participants that the discussion today may contain certain statements which are forward-looking in nature, pursuant to the safe harbor provisions of the federal securities laws.\n\nThese statements are based on information currently available to us and are subject to various risks and uncertainties that could cause actual results to differ materially. StarTek advises all of those listening to this call to review the latest 10-Q and 10-K posted on its website for a summary of these risks and uncertainties. StarTek does not undertake the responsibility to update any forward-looking statements. Further, the discussion today may include some non-GAAP measures.\n\nIn accordance with the Regulation G, the company has reconciled this amount back to the closest GAAP-based measurement. The reconciliations can be found in the earnings release on the investors section of their website. I would like to remind everyone that a webcast replay of today's call will be available via the investors section of the company's website at www.startek.com. Now I would like to turn the call over to StarTek's global CEO, Brahat Rao.\n\nSir, please, you may proceed.\n\nBharat Rao -- Global Chief Financial Officer\n\nThank you, Renan. Good afternoon, everyone, and thank you all for joining. Our second quarter results were in line with our internal expectations as we operated against the backdrop of shifting market conditions. While we experienced soft year-on-year declines in revenue, the prior-year quarter received a large benefit of one-off revenue opportunities with the CDC as well as general market tailwinds.\n\nOur priority during the second quarter was the ongoing ramp-up of client services in several verticals by training and hiring additional agents to expand our capacity. While this process inevitably comes with a margin compression, we expect to recapture the profitability impact in the coming quarters. Both our core telecom and financial and business service verticals continued to perform well and show consistent year-over-year growth through the expansion of services we drove to our existing clients. Through our telecom vertical, we deepened our relationships with our clients across the U.S.\n\nand South Africa as these territories represent valuable growth opportunities for our company. Travel and hospitality has proved to be slowly returning to pre-pandemic levels, showing consistent growth for the past few quarters and for this last quarter as well. Whilst still soft compared to pre-COVID, we do expect the vertical to continue on its consistent trajectory based on normalized activity levels. Our healthcare vertical showed a large decline, though this is due to the prior-year quarter, netting a one-off vaccination support program that contributed an outsized portion of our revenue to our mix.\n\nOur sales ecosystem showed improvement through the quarter as we added 7 new logos with several more in advanced discussions. Our investment in our sales team and marketing initiatives have greatly bolstered our existing sales pipeline with the greatest effect occurring in our U.S. territory. Driven by our brand awareness campaigns, we are beginning to receive an influx of incoming calls and requests for proposals by prospective clients all across the U.S.\n\nOur redefined marketing strategy has provided immense value in bringing greater awareness and visibility to StarTek, while our revamped sales team tangibly build our sales pipeline for future expansion. As one of the three main pillars of growth we have identified, we will continue to lean upon our sales ecosystem to expand our footprint across the industry. As we continue to expand our platform, we are ensuring that our capabilities remain at the forefront of the industry. Last quarter, we entered into a partnership with Genesys to leverage their leading technologies in cloud software, customer experience services and call center capabilities.\n\nAt StarTek, our goal has been to provide highly empathetic customer experience solutions to our clients, and we will continue to identify and partner with emerging technologies that allow our agents to effortlessly do so. Genesys and their seamless contact center experience is a natural fit for our platform and has meaningfully streamlined our agents work processes to allow them to better focus on personalizing their conversations with customers. We look forward to continuing our partnership with Genesys and further leveraging the technology to provide best-in-class services to our customers. Alongside our digital partnerships, last quarter, we announced the launch of StarTek Agent AI, a modular platform that combines AI-powered solutions to enhance and deliver a superior agent and customer service experience.\n\nOur platform supports our agents across the globe and will allow us to onboard faster, cultivate new skills more efficiently and reduce the burden of repetitive manual tasks. As mentioned earlier, we are focused on providing the necessary tools to allow our agents to provide best-in-class services to all our clients. StarTek Agent AI builds upon the success of our award-winning StarTek cloud platform, and with combined capabilities, our customers can be confident that they can deliver a world-class customer experience through our platform. In the second quarter, StarTek was named the winner of the Comparably Award for Best CEOs for Diversity, an award that I was honored to accept on behalf of the company.\n\nIt has been an incredible privilege to work with our diversity, equity and inclusion committee to foster a diverse and inclusive work environment for our 46,000 associates around the globe. I am proud of the culture that we have built for ourselves, and we will continue our commitment in nurturing an environment that promotes the voice of all our employees. We continue to evaluate our hybrid work structures and our mix of physical contact centers as the macro environment evolves. To ensure we remain a lean and efficient organization, we recently exited one more site in the U.S.\n\nand will continue evaluating our physical infrastructure across all geographies. We also remain committed to optimizing our fixed cost structure to eliminate excess expenditures and reallocate those savings toward sales, marketing and digital efforts. Overall, we had another exciting quarter where we continue to capitalize on our investments and position StarTek for growth. The work we have done this quarter was necessary in preparing our platform for the ongoing ramp-up with new and existing clients.\n\nAs we continue to invest within our sales ecosystem and marketing teams, we must be prepared for the future demand that we are aggressively generating. While we do not achieve our year-on-year top-line and bottom-line growth, our focus on preparing our platform for the future has positioned StarTek to return greater value back to shareholders. Just to note that we are not going to discuss today the nonbinding proposal made by Capital Square Partners. For the latest statement by the Special Committee, I direct everybody to the press release dated June 21, 2022 that is available on our website.\n\nI would now like to turn over the call to Nishit Shah to provide further details on our second quarter financial results. After Nishit concludes his review of our financial performance, he's going to turn over the call to StarTek's head of transformation, Ron Gillette, to provide more insights into our strategic initiatives for the remainder of the year and beyond. Thank you all for joining us, and I'll be available to answer any questions you may have during the Q&A session at the end of this call. Nishit, I'll now pass over the call to you.\n\nThank you.\n\nNishit Shah -- Global Chief Financial Officer\n\nThanks, Bharat. Starting on the top line. Net revenue in Q2 was $167.6 million, compared to $189 million in the year-ago quarter. On a constant-currency basis, net revenue decreased by 9% compared to year-ago quarter.\n\nThe decrease was primarily driven by the aforementioned one-off COVID vaccination program, contributing an oversized benefit to our revenue in the prior-year quarter. We also experienced a decline due to termination of our e-commerce client in the first quarter of 2022, offsetted by the continued strength of our core verticals. Gross profit was $16.7 million, compared to $24.6 million in the year-ago quarter. Gross margin was 10%, compared to 13% in the year-ago quarter.\n\nThe decline was driven by multiple factors. First, inflation had a material impact. As informed in the previous quarters, we had taken wage increases in some of our geographies to factor decade-high inflation levels. Furthermore, this quarter saw some significant client work ramp in India, where we needed to hire and train resources in advance.\n\nThese resources will be billable from next quarter. This also impacted our margins in the current quarter. We expect to claw back some of the current margin decline in the second half of the year as some of the above factor normalize. Selling, general and administrative, SG&A, expenses for the second quarter was $13.7 million, compared to $12.3 million in the year-ago quarter.\n\nAs a percentage of revenue, SG&A was 8.2%, compared to 6.5% in the year-ago quarter. The increase is primarily due to our ongoing investments in sales and marketing initiatives. Please also note that expenses accrued on account of ongoing take-private offer is also booked under SG&A expenses. These expenses are, however, added back to adjusted EBITDA.\n\nNet income attributable to StarTek shareholders for Quarter 2 was $1.9 million, or $0.05 per share, compared to net income of $6.9 million, or $0.17 per share, in the year-ago quarter. Adjusted net attributable -- income attributable to StarTek shareholders for Q2 was $5.2 million, or $0.13 per diluted share, compared to $9.9 million, or $0.24 per diluted share, in the year-ago quarter. Adjusted EBITDA in the second quarter was $11.1 million, compared to $19.6 million in the year-ago quarter. As a percentage of revenue, adjusted EBITDA was 6.6%, compared to 10.4% in the year-ago quarter.\n\nThe decrease was primarily a result of an increase in investments in sales, marketing and digital assets, as well as aforementioned decline in gross profit. From a balance sheet perspective, at June 30, 2022, our cash and restricted cash balance stands at $55.8 million, compared to $52.2 million at March 31, 2022. Total debt at June 30, 2022 was $170.7 million, compared to $169.5 million at March 31, 2022. Net debt, excluding restricted cash, at June 30, 2020 was $123.5 million, compared to $126.2 million at March 31, 2020.\n\nThis concludes my prepared remarks. I will now turn the call over to Ron. Thank you.\n\nRon Gillette -- Global Chief Executive Officer\n\nThanks, Nishit. I'm going to use this time to discuss our strategic focus going forward. For the back half of the year, we'll be focused on growing and capitalizing on our bolstered sales pipeline to drive new logos. With our capacity and footprint ready to handle additional ramp-ups, we look forward to expanding our services and acquiring new customers across the U.S.\n\nand India. We plan to add new sales leaders to our U.S. team this current quarter as we make an aggressive push on our sales efforts in the U.S. We will also continue our work in deepening our existing relationships and expanding our services to clients.\n\nIn fact, we are working to strengthen our program management and account management teams who can focus on deepening our client relationships while also increasing awareness about our integrated digital solutions that can provide greater benefits to our clients, both in delivering better services and reducing cost of delivery. Additionally, we have accelerated our marketing efforts as we aim to increase our brand awareness across markets. In the past quarter, we sponsored Customer Contact Week, Las Vegas, as part of the world's largest customer contact event series, where we also cohosted a networking event with one of our digital partners. Our focus on sponsorships will continue in Q3 when we will also see our thought leadership approach come to life.\n\nThis will include presenting research results conducted in association with HFS and a collaboration with Everest Group. These two initiatives will be showcased through our webinar series, which kicked off in Q2 and explores emerging trends in the digital customer experience space, in partnership with thought leaders, vendors and clients. As we expand our platforms, we'll be focused on continuing our strategy of having a best-in-class service platform for our customers. While our internal teams are proactive in developing new technologies to refine our platform, especially in cybersecurity, we will also continue to drive new digital partnerships to enhance our existing offerings and remain ahead of our competition.\n\nOur focus continues to remain on disruptive, innovative innovation in voice and increasing use of AI within contact centers to enhance both agent and customer experiences. We expect the second half of the year to be slightly better than our first half. Part of this is due to our natural seasonality that occurs throughout our business. For example, in our Saudi region, a highly productive territory for us, we will have some pass-through on costs that we were not able to unlock in the first quarter due to Ramadan.\n\nWhile second half revenues will be relatively similar, we expect to recapture some of the margin compression that we incurred this quarter through the ramp-up of services with clients through our onboarded service agents. The logos we won this quarter will begin to have a material impact on our financials starting in 2023. And as Bharat discussed earlier, we are already in advanced discussions with several more. We've continued to capitalize on the opportunities that we have identified through our revamped sales ecosystem, our refreshed market strategy and our expansion of services driven by digital partnerships.\n\nAs always, our first priority is sustainably growing our company to return value back to our shareholders, and we are ready to execute on our growth strategy to do so. With that, we will now open the call for questions. Operator, over to you.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Ethan Widell with B. Riley.[Unknown speaker]Hi. Thanks for taking my question.\n\nSo I was wondering if you could provide a little additional color into your gross margin. Specifically, you address inflation, wage increases and other trading costs, I think. And I was wondering if you could highlight kind of the relative breakdown of those costs.\n\nBharat Rao -- Global Chief Financial Officer\n\nSure. Thanks, Ethan, for that question. And I can start off, and then we can provide a little more color on the kind of breakdown. See, typically, if you take a step back and if you see our Quarter 2 margins as business starts ramping up, etc., it's normally less than Quarter 1.\n\nSo that's no different in '21 -- or '22 versus that in '21. Now, if you look at our margins in the first quarter of 2022, they were circa 12.5%, about 12.6%. And as ramp-up start, you get to about 10% that we have in this quarter from a margin perspective. And we, of course, Ron talked about the festivities in the Middle East, which kind of dampens the margins as well in terms of additional costs we need to incur but pretty much seasonal.\n\nAnd that -- those kind of ramps in any of these seasonal items even out as we go into Quarter 3 and Quarter 4, as you would have seen. So if I look at Quarter 1 of '21 and Quarter 2 of '21, you had a circa 2% difference between the gross margins in those two quarters. Very similar to what you see in Quarter 1 and Quarter 2 for 2022. Now in Quarter 1 of '22, you would recall, Ethan, we had talked about some margin pressure, obviously, just with the inflationary pressures, and we had talked about some of that kind of continuing into -- for a quarter or two.\n\nSo we are working in situations where we are getting contracts that are coming up to have a proper conversation around those to look at just adjusting those to the right level. So to that extent, there's nothing significantly different we have in Quarter 2 that of 2022 versus Quarter 1 of 2022. Apart from the ramps, the significant ramps that we have seen, which is a positive, and Ron talked about that in terms of the longer-term impact to shareholder value and creating shareholder value. So the ramp costs that we have in this quarter will get relatively offset in the next two quarters.\n\nI'll just take a pause and see if you -- if that kind of has any -- provide any more color. And if you want any specific areas, we can kind of peel the layer and then get into the next level of detail.[Unknown speaker]Certainly. No, that's very helpful. So do you expect for this to sort of be the trough for margins?\n\nYou mean to get back to the levels in Quarter 3 and Quarter 4 that you saw in Quarter 1, I think that would be a reasonable estimate.[Unknown speaker]OK. That's all on my end. Thank you.\n\nThanks, Ethan.\n\nOperator\n\nAt this time, this concludes our question-and-answer session. I would now like to turn the call over back to Mr. Rao for closing remarks. Please proceed.\n\nBharat Rao -- Global Chief Financial Officer\n\nThank you, Renan. And thank you all for joining us this afternoon and for your continued support of StarTek. I look forward to speaking with you next when we report our third quarter results.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBharat Rao -- Global Chief Financial Officer\n\nNishit Shah -- Global Chief Financial Officer\n\nRon Gillette -- Global Chief Executive Officer\n\nMore SRT analysis\n\nAll earnings call transcripts"
}