{
  "companyName": "PagerDuty",
  "companyTicker": "PD",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/pagerduty-pd-q2-2023-earnings-call-transcript/",
  "content": "PagerDuty (PD -0.71%)\nQ2 2023 Earnings Call\nSep 01, 2022, 5:00 p.m. ET\n\nTony Righetti\n\nThank you, operator, and good afternoon, and thank you for joining us to discuss PagerDuty's second quarter fiscal year 2023 results. With me on today's call are Jennifer Tejada, PagerDuty's chairperson and chief executive officer; and Howard Wilson, PagerDuty's chief financial officer. Before we begin, let me remind everyone that statements made on this call include forward-looking statements based on the environment as we currently see it, which involve known and unknown risks and uncertainties that may cause our actual results, performance or achievements to be materially different from those expressed or implied by the forward-looking statements. These forward-looking statements include our growth prospects and future revenue, among others and represent our management's beliefs and assumptions only as of the date such statements are made and we undertake no obligation to update these.\n\nDuring this call we will discuss non-GAAP financial measures, which are in addition to and not a substitute for or superior to measures of financial performance prepared in accordance with GAAP. A reconciliation between GAAP and non-GAAP financial measures is available in our earnings release. Further information on these and other factors that could cause the company's financial results to differ materially are included in filings we make with the Securities and Exchange Commission, including our most recently filed 10-K and 10-Q, as well as our subsequent filings made with the SEC. With that, I will turn the call over to Jennifer.\n\nJen Tejada -- Chief Executive Officer\n\nThanks, Tony, and thanks everyone for joining us today. We continue to execute well in Q2, exceeding the high end of both our top and bottom line guidance ranges. In another quarter of strong growth and improving efficiency, revenue grew 34% year over year and non GAAP operating margin improved by more than 1,000 basis points. This is the fourth consecutive quarter at or above 32% growth and an improvement in year-over-year operating margin for PagerDuty.\n\nThese consistent results illustrate the durability of our growth, our multibillion dollar market opportunity and our adapt -- our ability to capture efficiencies as we scale. At a moment when our customers must ensure seamless digital experiences while improving operating efficiency, PagerDuty's Operations Cloud is essential infrastructure that enables developers to balance both priorities. Our platform accelerates their journeys toward greater digital maturity in service of their business goals. We remain on track to deliver non-GAAP profitability in Q4 this year and for the full -- and full year profitability for next year, FY '24, thanks to continued demand and trust from our customers and partners, as well as the dedication and focus on continuous improvement from our teams around the world.\n\nWe are incredibly proud of the trust our customers place in us. ARR churn remained below 5% and we achieved the seventh consecutive quarter of dollar based net retention above 120%. The combination of rapid implementation, high return on investment, and an average payback period of two months puts PagerDuty in a position of strength, especially in an uncertain macro environment. Our land and expand motion drove accelerated year-over-year growth in total paid accounts, as well as in accounts spending more than $100,000 annually with PagerDuty.\n\nEven with the current macro uncertainty, we see strong demand and in a favorable competitive environment as our teams generated a healthy pipeline across our customer segments and regions. We saw longer sales cycles for some larger deals, often in process automation, and we did experience more diligence on contracts in EMEA. The digital operations business, however, which includes incident response and AI ops performed exceptionally well, growing faster year-over-year. Our primary growth driver remains our high velocity land and expand business which grows consistently and reliably quarter after quarter.\n\nDevelopers continue to champion PagerDuty as the DevOps platform of choice inside their companies. Our long term tailwinds, digital acceleration, cloud adoption, and DevOps transformation remain top priorities for enterprises. Digital infrastructures are increasingly complex, interdependent, and central to key business priorities. We have set the enterprise standard for digital operations management, and we continue to expand our competitive advantage through product innovation.\n\nDuring our hybrid Summit Series in June, I highlighted the rise of interrupt work across the enterprise. Our core developer user base is already familiar with the challenges of keeping digital services running, customer experiences intact, and finding time to innovate. Today, PagerDuty's Operations Cloud is uniquely capable of detecting, orchestrating, and automating all types of interrupt work across our customers' digital operations. We connect to tech stacks in every corner of the enterprise, making our platform indispensable for our customers from developers to IT, security, and customer service.\n\nThe three recent product announcements demonstrate the power of the Operations Cloud for modern enterprise. First, we made service standards generally available to PagerDuty customers. Service standards enable organizations to rapidly advance their digital maturity by easily adopting best practices for incident response. Developers, SREs, service owners, and those responsible for availability and reliability can set up and monitor operational quality standards for service.\n\nSecond, we announced incident workflows, making our platform more flexible and extensible by enabling rapid design and deployment of no code flexible automated steps for major incident response. Many of our customers have asked to customize their incident processes. For instance, creating an incident specific Slack channel or starting a Zoom call and then sending a status update every 15 minutes. With incident workflows, customers can use an out of the box process or define their own with the building blocks we now provide.\n\nFinally, automation actions are now integrated across the entire PagerDuty platform. Automation capabilities are available at the time when events are first processed and available to all PagerDuty users, including customer service teams, to validate, diagnose, and remediate issues without additional human intervention and without needing to wake up the experts to run their specialized scripts. As businesses seek efficiency in their digital operations, while confronted with increasing incidents and leader teams, intelligent automation is essential. Both automation actions and incident workflows will be generally available later this year.\n\nThe PagerDuty ecosystem continues to grow, now above 700 integrations. In August, we launched AWS plugins for automated diagnostic actions. These out of the box automations install in minutes and can gather deep telemetry into PagerDuty's incidents for AWS services. We also launched automation actions applications for Salesforce and Zendesk.\n\nYou'll hear a lot more about the expansion of our customer service operations offering later this month at Dreamforce. In Q2, a global online travel shopping platform renewed and expanded its relationship with PagerDuty after realizing an ROI in excess of 300% in the first year. Travel continues to trend up 75% year over year in 2022. For travel companies that means opportunities for revenue growth, you have higher stakes in the event of outages and disruptions.\n\nAs the company navigates the post pandemic rebound in travel, they renewed for a three year term with more than 5,000 users and joined our customer cohort spending more than $1 million annually. Automated incident response enables increased developer productivity and improved availability to ensure great customer experiences. We saw similar trends in global e-commerce, where a leading Australian retailer utilizes PagerDuty for its service delivery and reliability center of excellence. In Q2, the customer grew from 30 to more than 250 users across its e-commerce, data, and customer divisions.\n\nThe customer realized a $1 million benefit in productivity gains in just six months through more efficient interactions between employees and customers. With PagerDuty's process automation, the retail giant is now able to update thousands of Android devices across more than 2,000 stores every night, driving better customer experience and delivering a 400% return on their investment. The thousands of users across these two customers comprise a small portion of more than one million users on our platform today. We currently estimate our total global penetration to be below 5% with a large and growing total addressable market, compelling unit economics, and we continue to invest while improving both operating leverage and our business model.\n\nOur state of digital operations report released in June and recent research conducted by IDG, both underscore the demand for and benefits of our operations cloud. The problems we solve span the enterprise from developers to IT, to security, and customer service teams. Industry leaders and innovative start-ups alike across travel and hospitality, financial services, retail software and technology and telecom, all face increasing complexity, more incidents, more disruption and more off hours interruptions. The most digitally mature organizations are better positioned to manage this work and PagerDuty advances operations maturity to improve mission critical outcomes.\n\nMore mature organizations acknowledge incidents seven minutes faster on average, they mobilize responders 11 minutes quicker, they resolve incidents two hours sooner and they experience 14 fewer hours of downtime every month. For a typical top tier PagerDuty customer with an average of 2,500 responders, these time savings translate to better customer experience, annual savings of up to $9 million and a return on investment of 680%. Our customers tell us that investments in digital transformation remain mission critical rather than discretionary. We see companies across segments and verticals continue to invest in accelerating the resiliency and maturity of their operations, while improving employee productivity and efficiency in this economic climate.\n\nPagerDuty is the platform they trust to power their transformation. Tamping the customer leading through innovation, transforming inclusion diversity and equity and building trust are all cornerstones of PagerDuty's legacy. During the quarter we earned recognition on several fronts. GigaOm and PagerDuty are leader in its radar for AIOps solutions.\n\nG2 named PagerDuty the best Incident Response platform, including individual award for best usability, best results and best return on investment. Fortune magazine named PagerDuty one of the best places to work in the Bay Area. We also welcomed former Okta CFO, Bill Losch to the PagerDuty board. Bill brings financial expertise, deep enterprise background and an operational understanding of security and of Ops.\n\nThe shortage for technical talent continues, while demands on developers rise, all while enterprises are under more pressure than ever from customers. For PagerDuty this is manifesting a robust market opportunity. Our high return on investment solution designed to solve a mission critical problem where customers are losing revenue on every incident is essentially self-funding. We remain confident in our ability to execute, capture share and increase our operational resilience.\n\nWe remain focused on sustaining high growth, while accelerating our path to profitability as we progress to our goal of $1 billion of revenue. I want to thank our customers for their trust and loyalty, our partners for their support and our teams for their ingenuity, dedication and drive to solve our customers' greatest challenges. With that, I'll turn the call over to Howard and look forward to your questions.\n\nHoward Wilson -- Chief Financial Officer\n\nThank you, Jen, and good day to everyone joining us on this afternoon's call. Second quarter results demonstrated the strength of our digital operations platform and our operational agility. While sustaining growth of 34%, we accelerated progress against our plans to be profitable in Q4. We believe companies want to partner they can trust to innovate and perform at scale in order to enhance the competitiveness of their business.\n\nAnd that's one PagerDuty delivers. As I present our results for the quarter, unless otherwise stated all references to our expenses and operating results are on a non-GAAP basis and are reconciled to our GAAP results in the earnings release that was posted before the call. Revenue was $90 million in the second quarter, up 34% year-over-year, the modest acceleration over Q2 of the prior fiscal year. International revenues were 23% of total revenues.\n\nWe delivered dollar based net retention in Q2 of 124% compared to 126% in the same period one year ago. This marks the seventh consecutive quarter of [inaudible] above 120% and we expect to continue to be at or above 120% throughout this fiscal year. Q2 ended with 689 customers with annual recurring revenue or ARR over $100,000, up 38% from a year ago. Total paid customers increased by 7% annually to 15,174 compared to 6% in the year ago period.\n\nFree and paid companies on our platform grew to over 22,000, an increase of 23% year over year with free continuing to provide a funnel for future paid growth. Q2 gross margin of 84% remained within our target range of 84% to 86%. Our operating loss was $3 million or negative 4% of revenue, an improvement compared to a loss of $10 million or negative 15% of revenue in the same quarter last year. Compared to our second quarter guidance, operating margin outperformed as we accelerated our scaling initiatives and lower than expected in quarter program expenses.\n\nAs Jen noted, we expect to deliver a better than breakeven Q4 and a profitable FY '24. Now to cash, second quarter cash from operations was $3 million compared to a loss of $12 million in Q2 of last year. Free cash flow was $1 million, compared to an outflow of $13 million in the year ago period. Both cash measures were better than expected primarily due to three factors: a mixture of collections that have shifted from the first quarter to Q2, as well as modest reduction in DSOs, working capital favorability and lower overall expenses.\n\nFor the second half we expect free cash flow to be slightly negative in Q3 and breakeven or better in the fourth quarter. Turning to the balance sheet, we ended the quarter with $471 million in cash, cash equivalents and investments. Total deferred revenue ended the quarter at $170 million, up 27% year over year. Quarterly calculated billings were $92 million, which was an increase of 23% year over year, ending below the 25% to 30% range provided during last quarter's call.\n\nAn elongation of sale cycles reduced our initial expectations for bookings, which was more common with high dollar opportunities. Europe also experienced a bit more softness in other geographies. We expect billings growth for Q3 to be in the range of 20$to 25%. This range extrapolates July trends into Q3, which we feel is appropriate given the uncertain economic environment.\n\nOn a trailing 12 months basis billings were $361 million, an increase of 30% compared to a year ago and met the estimate previously provided. We expect trailing 12 months billings growth exiting the third quarter to be at or above 20% over last year. Turning now to our guidance and factoring in the current economic conditions. For the third quarter fiscal 2023, we expect revenue in the range of $92 million to $94 million, representing a growth rate of 28% to 31%.\n\nNet loss per share attributable to PagerDuty, Inc. in the range of negative $0.04 to negative $0.03 with basic shares outstanding of approximately $89 million. This implies an operating margin in the range of negative 4% to negative 3%. For the full fiscal year 2023, we now expect revenue in the range of $365 million to $370 million, representing a growth rate of 30% to 31%.\n\nWe are improving guidance for net loss per share attributable to PagerDuty, Inc. to $0.12 to $0.10 with basic shares outstanding of approximately $89 million. This implies an operating margin of negative 3% to negative 2%. Before I close, I would like to thank our customers for their continued partnership and for our teams across the globe who champion them.\n\nOur rapid pace of innovation is designed to actualize our vision to transform critical work and revolutionize operations. We remain confident in our business and performance as we continue to scale toward non-GAAP profitability. With that, I will open up the call for Q&A.\n\nOperator\n\nThank you so much, Howard. And we will bring Jen up on the screen with you. [Operator instructions] Keith Weiss, we are going to come to you first, you can go ahead with your question, please.\n\nUnknown speaker\n\nExcellent. Thank you guys for taking the question, very nice quarter. And really nice progress on profitability. Just kind of feel good to a positive free cash flow coming in [inaudible] system.\n\nI wanted to ask about the guide and sort of the conservatism in that guide. I think that's a key question a lot of investors are wondering about. Our numbers coming down low enough. So Howard, I was wondering if you could talk us through kind of the guidance methodology, where is there excess conservativism? How can we get comfortable that this is like the right guide for the full year is not going to come lower.\n\nAnd then on the other side of the fence, how much flexibility is there on opex to protect that path toward profitability and sustain that profitable stance for FY '24? Is there room to [inaudible] opex down further just to sustain that or you need these investment levels for the long term and this is kind of where you're going to be investing on a go-forward basis? Thank you.\n\nHoward Wilson -- Chief Financial Officer\n\nYeah. Well, thanks, Keith. There's a lot in that question. So I'll try to unpack that piece by piece.\n\nSo at the -- I think what I would say is, from a guidance perspective we haven't changed our approach. What we are looking at when we contemplate the rest of the year. We know that the tailwinds that have always driven our business remain the tailwinds. Weather that's digital acceleration, DevOps transformation or cloud adoption or cloud migration, those still remain true.\n\nAnd so, we are seeing a strong demand signal and we are balancing that with some of the elongation we're seeing in sales cycles for larger deals. So we have factored into our guidance for the full year from a -- sorry, as you can see from the billings perspective that there is some duration extension in terms of deals. And just as a reminder, most of our deals actually close within 90 days. Whereas the larger deals of course can take longer and those are the ones that we're seeing are being subject to increased scrutiny or may be high levels of diligence.\n\nThe deals are still there, but it's just the process of prioritization of that work is changing. So we're seeing a little bit of that and we factored that into the view that we've taken from a topline perspective. What I would say in terms of from an opex and from an efficiency perspective, this is not something new for us in terms of how we've been thinking about the path to profitability. We have been progressively over the last few quarters, and you've heard me talk about this, in thinking about how do we put in place structural change that helps us be more efficient.\n\nSo this is not just a one-off event. So we've been using an increasing amount of automation within our G&A functions. We've been creating incremental capacity through exploring options for lower cost like patients and we rapidly ramping in those areas. So that allows us to build capacity that we need to drive the business.\n\nSo a number of initiatives on that front too to help us have confidence in the view the we expense around Q4 being profitable on a non-GAAP basis and setting us up to be the profitable on a non-GAAP basis next year.\n\nUnknown speaker\n\nGot it. If I could sneak one in for Jen, just on the competitive environment. It seems like some of the IT operations management vendors and ITSM vendors out there are talking more about incidents response and trying to kind of close the loop and help close the loop for their customers. Is there any change that you're seeing in the competitive environment or is the digital operations platform that you guys are putting out that are just so far ahead of what the more basic functionality that some of these guys have, that is not really competitive environment as of yet?\n\nJen Tejada -- Chief Executive Officer\n\nI think the operative word in your question is talking, there is a lot of talking about participating in this market. There always has been and I say this -- I feel like I've said this every quarter going to say it again. I've never seen a more favorable competitive environment, because we continue to expand our lead from our product differentiation perspective and build on a long-standing foundation of trust around resiliency. And when you then look at our 700 integrations, we've just built a number of deep moats from purely a product perspective.\n\nIn this environment, I think that becomes even more important, because resiliency and availability of the customer service to capture every penny of revenue coming in the door matters as does productivity and efficiency of those workers. Because while I think retention for us has -- of employees and technical employees has improved, the talent market is definitely getting better. I would say technical talent for our customers is still at a huge shortage. And so they want to improve that productivity and make sure those folks are working on product, are working on customer facing initiatives and that they're not losing time, trust and revenue through major incidents.\n\nUnknown speaker\n\nOutstanding. Thank you so much.\n\nOperator\n\nOK. Next going to Joel Fishbein with Truist. Joel, we will bring you on.\n\nJoel Fishbein -- Truist Securities -- Analyst\n\nHey, thank you for taking my questions and excellent execution and congrats to you guys. I wanted to ask about the ROI story that you are telling Jennifer. I thought that was pretty intriguing and I know you called out two customers, but I think that there's probably a lot more that you can talk about. Can you talk about how you're measuring ROI and what they're using prior to beginning in PagerDuty and helping us with that, because I think that that really tells the story and the importance of maybe weathering through some of this choppy tape that none of us can control that would be helpful.\n\nJen Tejada -- Chief Executive Officer\n\nFor sure, and I think one of the appeals of SaaS platforms is that, they're easier to deploy, right? There are more intuitive. And in the case of PagerDuty were designed almost like a consumer application, but with an enterprise infrastructure and back-end sitting behind it. And I think where that lends itself in an environment like this is our customers see an incredible -- incredibly fast implementation. It's not like trying to deploy a huge traditional enterprise software platform over years, which is like pushing a wheelbarrow uphill.\n\nRight? This is more happens within hours, days, and weeks as opposed to years. We see almost immediate ROI. I mean, we recently ran a bake off against another competitor at a customer, and they saw an improvement in mean time to acknowledge and mean time to respond 50% over the other provider without doing any customizations in the first few days of having it up and running. And so that immediate ROI leads to a lot of trust.\n\nThe payback period is on average two months. The example that I shared with you there is based on our top 100 customers, our larger customers that have made significant investments that then see those very significant returns in a short period of time. And I think that lends itself to -- lends itself well to customers that are looking for immediate ROI, immediate improvement and efficiency, that they can measure and quantify. Right? So we're putting our money where our mouth is.\n\nAnd you tend to see that return come from a couple of different areas: One, just reducing the amount of manual work that developers have to undertake so they get back to innovation; Two, you reduce the time lost to incidents and the revenue risk during those outages. And we've as consumers who become heavily reliant on on-demand services have seen how quickly you can lose loyalty and lose money and lose subscribership when that happens. Right? And then I'd say the last area is we're also helping our customers consolidate some of their providers because we give them one view of all of their observability tools in an automated way to orchestrate work across their teams, and the ability to close the loop in not just responding to, but resolving an issue and learning from it. And that's really driven by all of the automation that we built into our platform.\n\nJoel Fishbein -- Truist Securities -- Analyst\n\nGreat. Thank you so much.\n\nJen Tejada -- Chief Executive Officer\n\nThank you. Nice to see you, Joel.\n\nOperator\n\nOK. Thank you. And next, we'll move to Matt Hedberg. Matt is with RBC.\n\nPlease go ahead.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nGreat. Thanks a lot. Jen, you said something interesting. You said we're part of the mission critical infrastructure for a lot of organizations.\n\nAnd I think in time maybe more IT scrutiny, can you can you double click on that? Just because I think it's a really important point.\n\nJen Tejada -- Chief Executive Officer\n\nMatt, I think what you asked is, you're hard to hear. I think you asked about my comments around being part of a mission critical decision. And I also have talked about essential infrastructure and drilling into what that means. Is that right?\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThat's correct.\n\nJen Tejada -- Chief Executive Officer\n\nOK. So when you think about incident response, right, it's become more and more important to our customers because their consumers, their end users demands have risen. They're less patient when something goes wrong. They will quickly switch the cost of change for them, particularly in the consumer space is much lower.\n\nSo they'll switch to a competitor if their experience is not good. And as I mentioned, to Joel's question, like, revenue can be lost very quickly. And so, availability and uptime, reliability of the digital products and services that really define your brand, but also deliver your revenue has become if not job one, job two, right up there with security is the way I would think about it. And it's getting harder and harder to manage, so most of our customers are seeing an increasing number of incidents because they're dealing with more complexity in their infrastructure, in their digital operations environment.\n\nAnd I'd even argue that with the great resignation of the past, there's also a lot of new employees in organizations, so ramping employees to understand the technology gets harder. So anywhere you can automate the work to detect issues before they become revenue impacting incidents, to manage those incidents well when they do occur, and to learn from them and prevent that very costly incident from happening in the future is a really important investment and not something that we're seeing our customers back away from at this moment. The second thing that I would say is, developers actually care deeply about the kinds of tools they're asked to use in their environment. And if you put them on a mission critical job and say, this product can never go down, this platform must be available all the time to our users to our customers.\n\nBut then you say, here's some crappy tools, we're going to have you manage this with an Excel spreadsheet and Phonetree. Like, they get very unhappy. So a lot of our developer community, champion PagerDuty, all the way through their senior management because they trust that they want to work with it, and it enables them to do their jobs more effectively. And so, again, in the talent war that we've been in it's really important to make sure that your technical community has the products and services they want to use and that will enable them to be more effective and more productive in their jobs.\n\nAnd the one thing I loved about PagerDuty when I first learned about it, when I joined over six years ago was how quantifiable the ROI is, how easy it is to identify the ways that we reduce in terms of employee productivity, the efficiency that we create in terms of how employees identify and address and learn from incidents that happen. But most important, the way it can improve revenue generation and protect revenue in terms of managing the customer experience.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThat's super helpful. And maybe it was a nice segue into my second question. You talked about the importance of uptime and reliability, and you also said the competitive environment has ever been better. I think one of your larger competitors had an outage at some point here not long ago.\n\nWhen things like that happen does that bring even more customer inquiry your way?\n\nJen Tejada -- Chief Executive Officer\n\nAll software is imperfect, and everybody has outages and incidents. And so, we try and live up on the high road when it comes to talking about these sort of issues. But for sure, trust in a platform like ours is paramount. And I think it only takes a single incident that isn't well responded to leave a customer wondering if they have the right partner and that, of course, creates opportunities for us.\n\nHaving said that, I think that there are other ways to identify customers and we've certainly seen customers coming to us because of the influx and demand for a platform that does more than just on call. Right? More than just moving the work around, actually automating the work itself, actually helping customers become proactive and prevent incidents from happening, not just responding from them -- responding to them faster, but truly resolving them and preventing them from causing new problems in the future. And that's where when I talk about expanding our lead through innovation, we started in in call many, many years ago, 13 years ago, we added automated incident response. We built on top of that AIOps, including analytics, and then deployed automation into almost every part of our platform.\n\nAnd this is the automation of complex challenges in a business. It's not like robotic process automation where you're simply automating workflows or mundane tasks. We're actually learning from the events that flow through those 700 integrations and enabling teams to get better and better with each incident that occurs.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThanks, Jen. Congrats on the results.\n\nJen Tejada -- Chief Executive Officer\n\nThank you, Matt.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThank you. And as we near Labor Day, we've got some folks on the road. [Operator instructions] Next, we're going to hear from Rob Oliver over at Baird. Rob, come on and join us.\n\nRob Oliver -- Baird -- Analyst\n\nGreat. Can you guys hear me OK?\n\nJen Tejada -- Chief Executive Officer\n\nYeah. Nice to see you. How are you, Rob?\n\nRob Oliver -- Baird -- Analyst\n\nOK. Great. I'm doing well. How are you? Just my question is actually for you.\n\nAnd just a little bit more color around some of your commentary relative to EMEA and some of those elongated sales cycles? There certainly appears like there's an element of counter cyclicality to your business, which is solid. On the other hand, you guys are not immune to some of these macro impact. So I'm wondering, in terms of more color, was that new logos? Was it expansions? And anything else you might add there? And then on top of that, obviously, in this time would you guys David Justice has done a great job. And are there any adjustments or changes on the flag that you're seeing your team make to adjust to this new environment?\n\nJen Tejada -- Chief Executive Officer\n\nWell, the first thing I'd say is, I'm super encouraged by the demand that we continue to see. Really strong demand and strong pipeline for all of our products and services. And I think that's a tribute to having a product led growth strategy, right? Where our product actually drives a lot of the demand. I'm excited because we welcomed a new CMO into the business, Katherine Calvert, and she's been with us for about a quarter.\n\nWe saw -- continue to see really great execution around our velocity of land and expand motion, that's become very predictable and reliable for us. And the digital operations business, the incident response and AIOps performed exceptionally well during the quarter. In EMEA what we saw is, some additional diligence on deals, and I think that's really driven by kind of the combination of inflation, a very strong US dollar and the ongoing conflict in Russia, which is creating just a lot of uncertainty there. From a large deal perspective, we still saw large deals closing and we didn't lose large deals, but what we saw was some of our large deals taking a little bit longer.\n\nAnd remember, that most of our typical sales cycles are around 90 days. So I know a lot of software companies are talking about longer. I'm not talking about months and years, I'm talking about days. So -- but it is notable and it is something for us to be aware of.\n\nI think in thinking about how our leadership team has responded to this, we really stayed on the court that we've been on since the early days of COVID. And by the way, I'll mention that this macro uncertainty, while it is, a little tricky, it's nothing compared to what we saw in the first quarter of COVID. Our customers have a plan in place, they know how to run in a hybrid environment, they've got products and services to sell and jobs to do, and they're still up against a pretty challenging talent shortage. And so, very different than that environment.\n\nAnd so our team is really staying the course with the plan that says we're going to continue to improve our efficiency, we're going to invest in sustainable high growth. We're going to continue to invest in innovation to expand the lead that we have today. And a lot of that is around the area of automation throughout the platform and including our process automation. So we're really -- I think the plans that we put in place over the last several quarters have put us in a very strong position, both from a competitive perspective and from the perspective of dealing with whatever is coming our way.\n\nRob Oliver -- Baird -- Analyst\n\nGreat. That's really helpful color. I just got a very quick follow-up, Howard, for you. Just -- I know you've already added some color around lowering quarter expenses.\n\nBut could you add maybe a bit more around some of those sources of margin leverage, where they're coming from, whether it be hiring buildings infrastructure, other areas where you guys have the ability to kind of accelerate that path to profitability nicely? Appreciate it. Thank you, guys.\n\nHoward Wilson -- Chief Financial Officer\n\nRob, so the areas that we've seen, as I mentioned, the one is really being a focus around sales productivity, how do we make it easier for our salespeople to sell and how do we create capacity globally to be able to support that sales motion. And getting the balance right between quota and non-quota carrying folks is the way that we look about that -- look at that. So in fact, Q2 was a record hiring quarter for us, so we've continued to hire, but we've been doing so with a very intentional approach. We're certainly gaining leverage through the use of automation within a number of our functions, particularly within the G&A functions, which is certainly helping us get the work done without having to add headcount at the same rate.\n\nSo that's a positive for us. And also our location strategy opening up and the offices in Lisbon and in Chile, those have also helped us have access to a broader talent market and also allowing us to use and follow the sun model more effectively. And all of these are little elements of efficiency that are structural that are there for the long term. And so, the changes that we're seeing and that we've been making around making our organization more resilient, our organization structures more agile are really setting us up for the future.\n\nRob Oliver -- Baird -- Analyst\n\nThank you both.\n\nOperator\n\nOK. Thank you. We will go next to Chad Bennett with Craig Hallum. Chad, welcome.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nGreat. Thanks for taking my question. So just following up on the last question, I'm not sure if I heard the answer or not, Just on -- Jennifer on the elongated sales cycles on the enterprise side and then maybe the EMEA issues [inaudible] additional kind of sign offs you saw there. But again, was that more new logo driven or expansion driven?\n\nJen Tejada -- Chief Executive Officer\n\nNo. Generally, I think on the expansion side of things, I mean, that's where our sales team spends the vast majority of their time. But again, I just -- for context, when we talk about some of our larger deals taking longer to close, it doesn't necessarily mean they're an enterprise. Right? Because we do a lot of -- some of our biggest enterprise customers grow by starting small and seeing multiple POs over time.\n\nAnd I think that is one of the benefits of our business that makes us resilient in this environment as we don't need huge deals in any segment to be successful.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nYeah. And it just -- because if you look at the 100,000 plus customer growth, it's -- I'm not sure kind of what internal expectations were, but it looked pretty solid year over year. And so just trying to reconcile and also if you think about not that you guide for quarterly billings or you guide for quarterly billings, but we don't know what your guide would have been for this quarter, all else equal. I mean the 20% to 25% growth versus maybe a 25% to 30% in normal times, is that kind of 5% delta.\n\nAgain, you don't guide, but 5% delta. Is that encompassing kind of everything you're seeing today or you saw in the quarter? Or is it assuming things get even a little bit worse. Is there any color there? Thank you.\n\nHoward Wilson -- Chief Financial Officer\n\nYeah. So Chad, I'll jump in on that one. The approach that we've taken there is that, in the back half of the last quarter we started seeing a little bit of this effect for some of these deals. And to Jen's point, a lot of those customers -- we saw 38% growth in customers above 100,000, a lot of those customers get above 100,000 if they are doing lots of smaller deals.\n\nSo our high velocity transaction business across all segments remained strong. What we did see is that some of those larger deals took longer. And so, in coming up with our estimate with respect to billings for this quarter, we did extrapolate some of the extension in duration that we had started to see into the view that we have given.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nGot it. Thanks for the color. I appreciate it. Nice job on the quarter.\n\nJen Tejada -- Chief Executive Officer\n\nThanks, Chad.\n\nOperator\n\nOK. Next, we have Andrew Sherman with Cowen. Andrew, please go ahead.\n\nAndrew Sherman -- Cowen and Company -- Analyst\n\nHey, guys. How are you doing?\n\nHoward Wilson -- Chief Financial Officer\n\nIt's Andrew on for Derrick. Nice corner. So, Jen, you're going to sell mostly into developers, but also customer service. Does it feel like budget priority within the developer and DevOps arena is more resilient than other buying centers? And what's your sense on where budget priorities are the highest right now?\n\nJen Tejada -- Chief Executive Officer\n\nI don't think we've seen like a shift in demand or budget across our different personas. But I think that's more about the problems we solve per se than the personas themselves. Because I think one of the things that's really changed in the last few years is our customers really understand all the way up to the CEO and in some cases the board, the audit committee, that incidents cost them a lot of money. Some that's really measurable in the immediate term and some that's measurable in the long term.\n\nAnd when I think about this, the long term tailwinds that we've always talked about have remained well intact in this environment. And that's digital acceleration, cloud adoption and DevOps transformation. No one is stopping or slowing their projects in those areas because they remain critical to the business. The other thing is because of the more than 700 applications and monitoring systems, observability, cloud providers that we connect to, we're really well stitched into our customers.\n\nWe become essential infrastructure. And I think that shows up in our gross retention and in our low churn and increasingly in our net dollar retention. And as I mentioned before, unlike in COVID where we saw a lot of different buying centers just freeze to try and take stock and recover in the early days of this sort of COVID market impact. We're not seeing that behavior.\n\nNow having said, I've worked in ERP, I've worked in supply chain, I've worked in a lot of other parts of software over my career. I would not want to be selling discretionary apps or apps that are a feature, not a not a product, not a platform, and don't solve, like I said, these mission critical problems. I think things related to incident response, security, customer service, like customer experience are going to continue to be really important in this environment because most of our customers' revenue generation has moved to their digital products and services. And so it's just become more important for them.\n\nAndrew Sherman -- Cowen and Company -- Analyst\n\nGreat. Thanks. And then Howard, I wanted to ask about the price hikes and if there's any contribution from that in the back half implied in guidance. And I think 20% of customers are billed monthly.\n\nSo did that have any impact to Q2? And how should we think about the impact of those rolling in over the next few quarters?\n\nHoward Wilson -- Chief Financial Officer\n\nSure. So on the pricing side, there are three dimensions to this, we introduced a price increase back in March, which was primarily for new customers to the platform, so related to new customer acquisition and that is fully in play and has had a positive impact. We also introduced modest increases on renewal, which we spoke about last quarter and that's again in process and working well and that's factored into our view through the end of the year. And I think then on your -- what is your final point there? Final question that you had, Andrew.\n\nAndrew Sherman -- Cowen and Company -- Analyst\n\nThe impact of how the roll out over the next two quarters?\n\nHoward Wilson -- Chief Financial Officer\n\nYeah. So I think those are both in train. They're continuing to -- they make a business that are working well. And the value that we deliver to our customers is really obvious, the ROI information that Jen shared in her prepared remarks means that the value we deliver to customers is high and so we're not seeing any resistance.\n\nAndrew Sherman -- Cowen and Company -- Analyst\n\nGreat. Thank you.\n\nJen Tejada -- Chief Executive Officer\n\nThanks, Andrew.\n\nOperator\n\nOK. Thank you. [Operator instructions] Matt Stotler, we're going to come over to you. Matt with William Blair.\n\nPlease go ahead.\n\nMatt Stotler -- William Blair -- Analyst\n\nVery good to see you. Thanks for taking the questions. Maybe just one to start off with on the kind of free to pay customer conversion. Obviously, you guys have talked about specific rates, but are you seeing any change in that rate of conversion or the ability to convert customers in this environment? Do you have any thoughts on how it's going to turn going forward?\n\nHoward Wilson -- Chief Financial Officer\n\nYes. So, Matt, this has always been like a long term program for us in terms of how we thought about free and the conversion, capturing developers early in their use of PagerDuty or other potential responders and then making sure that they have such a good experience if they convert. And we've seen -- in terms of new customer acquisition, we've seen good healthy trends. And so that funnel is still working for us.\n\nWe take a long term view on that though, because we know that our expectation isn't that we've seen like rapid transition in terms of free. But when we look at our mid-market and enterprise segments, which free has allowed us to focus on, we saw really strong customer acquisition in the mid-market and the enterprise with this last quarter.\n\nMatt Stotler -- William Blair -- Analyst\n\nGot you. That's helpful. And then maybe just a quick follow-up on the partner ecosystem. Obviously, not a huge contributor today, but something that you guys have talked about as being a place where you're investing.\n\nAs you kind of look forward and look to be maybe a little, I guess, look for efficiencies as you continue to invest in and go to market going forward, how does the partner channel fit into that? And what are you prioritizing in this environment on that side of things?\n\nJen Tejada -- Chief Executive Officer\n\nSure. I mean, I think we've talked in the past about our partnerships with AWS and Salesforce, particularly around DevOps for AWS and then our customer service ops solution for Salesforce. Those will continue to be both product and go to market partners that are important to us and that we're spending a lot of time with. I mentioned Dreamforce, I think on the call, and we'll also be spending quite a bit of time at Reinvent.\n\nI always tell Andy and Adam that Reinvent is like where our people are. It's like coming into our own village, all the developers there. But we also think about our technology partners, so we talk about integrations every quarter. I think sometimes it's easy to underestimate how expansive that is for our ecosystem.\n\nThe fact that we don't have to build all those integrations that a customer may have a use case and use our API to build their own integrations which then opens opportunity up for other customers and users. And so that will continue to be an important area of investment for us. And then increasingly as we look at expanding into new regions and new verticals, partners become more and more important. So we have put a venture together with a partner in Japan to try and accelerate our expansion into that market for instance.\n\nBut I would say that we try to be very focused in this area as opposed to sort of the spray and prey model, because in my experience, a lot of a lot partner efforts have been measured by activity, not output. And I'm really looking to figure out how we impact our overall customer experience and grow the effectiveness and efficiency of our go to market organization by having the right blend between direct and channel partnership.\n\nMatt Stotler -- William Blair -- Analyst\n\nVery helpful. Thank you.\n\nJen Tejada -- Chief Executive Officer\n\nThanks, Matt.\n\nOperator\n\nOK. It looks like we have exhausted our questions today. I want to thank everybody for your participation. Howard -- thank you, Jen.\n\nCan I pass it over to you for any final thoughts for this quarter?\n\nJen Tejada -- Chief Executive Officer\n\nYes. Well, I just want to say thank you everyone for joining us. We remain very positive on the demand that we see going forward and very proud of our execution and we just appreciate the trust that our customers place in us. And I want to thank all of PagerDuty employees for all of their hard work in which everybody is safe and long holiday weekend.\n\nThank you.\n\nDuration: 0 minutes\n\nTony Righetti\n\nJen Tejada -- Chief Executive Officer\n\nHoward Wilson -- Chief Financial Officer\n\nUnknown speaker\n\nJoel Fishbein -- Truist Securities -- Analyst\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nRob Oliver -- Baird -- Analyst\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nAndrew Sherman -- Cowen and Company -- Analyst\n\nMatt Stotler -- William Blair -- Analyst\n\nMore PD analysis\n\nAll earnings call transcripts"
}