{
  "companyName": "Infinera",
  "companyTicker": "INFN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/infinera-infn-q3-2022-earnings-call-transcript/",
  "content": "Infinera (INFN 0.15%)\nQ3 2022 Earnings Call\nNov 02, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the Infinera Corp. third quarter 2022 earnings call. All lines have been placed on mute to prevent any background noise. After the speaker's remarks, there will be a question-and-answer session.\n\n[Operator instructions] Thank you. Amitabh Passi, head of investor relations, you may begin your conference.\n\nAmitabh Passi -- Head of Investor Relations\n\nThank you, operator, and good afternoon. Welcome to Infinera's third quarter fiscal 2022 conference call. A copy of today's earnings and investor slides are available on the investor relations section of the website. Additionally, this call is being recorded and will be available for replay from our website.\n\nToday's call will include projections and estimates that constitute forward-looking statements, including but not limited to, statements related to our expectations regarding business plans, model and strategy, including product road map and products, sales, growth, market opportunities and trends, manufacturing operations, technology, the shift to open architectures, market adoption of coherent optical engines, competition, customers, expectations regarding industrywide supply challenges, the macroeconomic environment and ongoing COVID-19 pandemic impacts and statements regarding our future financial performance, including our financial outlook for the fourth quarter of 2022. These statements are subject to risks and uncertainties that could cause Infinera's results to differ materially from management's current expectations. Actual results may differ materially as a result of various risk factors, including those set forth in our annual report on Form 10-K for the year ended on December 25, 2021, as filed with the SEC on February 23, 2022, and it's quarterly report on Form 10-Q for the quarter ended June 25, 2022, as filed with the SEC on July 28, 2022, as well as subsequent reports filed with or furnished to the SEC from time to time. Please be reminded that all statements are made as of today, and Infinera undertakes no obligation to update or revise any forward-looking statements to reflect events or circumstances that may arise after the date of this call.\n\nToday's conference call includes certain non-GAAP financial measures. Pursuant to Regulation G, we've provided a reconciliation of these non-GAAP financial measures to the most directly comparable GAAP financial measures in our earnings release and investor slides for this quarter, each of which is available on the investor relations section of our website. And finally, as a reminder, we will allow for plenty of time for Q&A today, though we ask that you limit yourselves to one question and one follow-up, please. I'll now turn the call over to our chief executive officer, David Heard.\n\nDavid?\n\nDavid Heard -- Chief Executive Officer\n\nThanks Amitabh. Good afternoon, and thanks for joining us today. I'll begin with a review of our results for the quarter and then turn the call over to Nancy to cover the details of our financial performance. Given everything that's going on in the world with the markets and the economy, I'll try to be concise today.\n\nOverall, our message today is our overall Q3 non-GAAP financial results beat consensus estimates. Our outlook for Q4 is in line with consensus expectations. We're delivering against our product strategy to drive market share gains as evidenced by our 17% year-over-year product revenue growth, and we strengthened our balance sheet. Financially in Q3, we delivered revenue and non-GAAP operating margin at the high end of our outlook range with non-GAAP gross margins near the midpoint of the range and up 170 basis points sequentially.\n\nOn a year-over-year basis, we expanded operating margin by 270 basis points, grew product revenue 17%, which represented an acceleration from 11% growth that we posted last quarter and grew total revenue by 9%. Furthermore, we generated free cash flow in the quarter and improved our balance sheet. Demand in the quarter remained healthy with bookings continuing at a steady pace for most of the quarter, especially in the Americas and ICPs. In fact, four of our top 10 customers based on bookings were ICPs.\n\nWe did have a few large orders that slipped from the last week of the third quarter, given the September 24 quarter end into the first week of our fourth quarter, resulting in a very strong start to Q4. Our backlog is healthy, setting us up well for the fourth quarter and for the full year 2023. From a supply perspective, the environment was tougher than our expectations from 90 days ago, but our team effectively navigated the challenges in the quarter, Supply costs, including expedite fees and freight remained elevated and adversely impacted gross margins incrementally by over 100 basis points relative to our projections coming into the quarter. The total impact to gross margins for the quarter was approximately 400 basis points above normalized levels, without which, our gross margins would have been above 40% in the quarter.\n\nWhile we're seeing some broad-based relief in overall supply chain, we expect supply conditions to remain challenging for some critical through at least the first half of next year before easing in the back half of 2023. During the quarter, we continued to ramp new products, win deals with major ICPs and Tier 1 service provider customers. Our progress in the quarter spanned our entire portfolio, reinforcing our confidence in our 8x4x1 strategy. Specifically, within our systems business group, we had two key developments.\n\nFirst, we ramped ICE6 to over 30% of product revenue in the quarter and secured key design wins with several large customers, including at Tier 1 global cable operator with significant operations in the US, a Tier 1 ICP as we expanded into their long-haul network and a major telecommunications service provider in Asia Pacific. ICE6 remains on track to ramp to 20% to 25% of total product revenue for the full year of 2022, in line with our prior commitments. Second, we had another strong quarter for our metro platforms with revenue for the flagship GX 30 product line up in the double-digit percentage range on a year-over-year basis. Our metro footprint continues to diversify as we expand service provider -- with service provider customers, both domestically and internationally.\n\nWithin our subsystems group, there were three notable accomplishments for the quarter. First, our 400 gig ZR+ pluggable is industry-leading and ahead of our expectations. We are starting to vertically integrate it into our own metro platforms, which should begin to positively impact gross margins as we exit 2023. During the quarter, we concluded a successful field trial with a large North American Tier 1 service provider in which we demonstrated industry-leading results in reach, power and performance, all of this was accomplished in the industry's first 400 gig ZR+ software-defined pluggable.\n\nSecond, we're pleased with the progress we're making on the development of our own 100 gig point to multi-point coherent pluggables based on the open multi-source specifications being developed in the Open XR forum. We believe these pluggables will revolutionize networks and open up a new multibillion-dollar addressable market for us. Membership in the Open XR form continues to expand and there's a growing pipeline of interested service providers and equipment manufacturers ready to sign up for the forum. In fact, during the quarter, American Tower, Telcom Italia Mobile, joined as members of the forum, along with additional network equipment manufacturers, including DriveNets, UfiSpace and Furukawa Electric.\n\nThird and finally, the development of our next-generation 800-gig pluggables is progressing well, and we intend to lead the industry in this category as well. I'm encouraged by our business execution across the board, while being mindful of an uncertain macroeconomic environment. Our product portfolio is in great shape, and we're winning major deals and gaining market share. We are prioritizing our investments in sales and marketing in the most strategic R&D programs to capitalize on the insertion opportunities we see globally.\n\nIn addition, as an optical semiconductor manufacturer, we have been positioning ourselves over the past couple of years with all branches of the US government, including the Department of Commerce as an intended beneficiary of the government-sponsored CHIPS and Science Act. Infinera is unique in our US based capability and compound semiconductors with production and packaging facilities located in the United States. We intend to use any government funding that may be made available to us to accelerate R&D leadership in this critical technology, invest in our core business capability and potentially expand into new markets, while strengthening supply chain resiliency and national security interests. Looking ahead into the fourth quarter, we're planning for another quarter of above-market revenue growth, while fighting the remaining acute supply chain challenges to get toward non-GAAP gross margins of 40%.\n\nWe expect the fourth quarter to benefit from the continued ramp of ICE6 momentum in the metro business and additional operating leverage. Our fourth quarter outlook also implies product revenue growth of greater than 10% for the full year and significant operating income expansion in 2022 over 2021 results. This financial performance is remarkable, especially in an environment where we expect to absorb more than $50 million in elevated supply chain cost for the year and further demonstrates the value of our vertical integration. As you've heard today, we're extremely focused on executing against our strategy and meeting our commitments.\n\nOur 8x4x1 strategy is working. Our products are winning in the market and supply chain disruptions are actually creating new opportunities for us and our customers as they look to mitigate their supply chain risks. We are relentlessly driving toward our target business model and $1 per share in annual earnings power. While there are several adverse macroeconomic factors at play, the underlying demand drivers for our products and services are healthy.\n\nI continue to be impressed with the innovation, execution and resilience of our Infinera team, the high degree of engagement of our partners and suppliers and the collaboration of our customers. As we look forward to diving deeper into our company's strategy and our product portfolio at our upcoming Investor Day that we are planning for March 7, 2023, at the OFC Industry Show in San Diego, California. I will now turn the call over to Nancy to cover the financial details of the quarter and our outlook for the fourth quarter. Nancy?\n\nNancy Erba -- Chief Financial Officer\n\nThanks, David. Good afternoon, everyone. I will begin by covering our Q3 results and then provide our outlook for Q4. My comments reflect non-GAAP results and outlook.\n\nFor your reference on our investor relations website, we have posted slides with financial details, including our GAAP to non-GAAP reconciliation to assist with my commentary. I'm very pleased with our performance in Q3. The Infinera team executed well to deliver revenue and operating margin at the upper end of our outlook range and revenue in the third quarter was $390 million, up 9% on a year-over-year basis with product revenue growth of 17%. This growth was largely due to the continued ramp of ICE6 to over 30% of product revenue in the quarter, along with the continued momentum in our metro business.\n\nService revenue was stable sequentially, but still down on a year-over-year basis as we continue to build our professional services backlog from the impact of delayed customer deployments earlier in the year. Geographically, we derived 57% of our revenue from domestic customers, a level higher than normal due to the strength at ICP and other service providers in the US. During the quarter, one customer contributed to greater than 10% of our revenue, which was an ICP customer. Gross margin of 37.8% was near the midpoint of our outlook range and up 170 basis points sequentially.\n\nWe delivered this margin while absorbing approximately 400 basis points of supply chain-related headwinds in the quarter, 100 basis points higher than our expectations from roughly 90 days ago. Operating profit in the quarter was $20 million, equating to an operating margin of 5.2%, which was at the high end of our outlook range. On a year-over-year basis, we more than doubled both operating profit dollars and operating margin in the third quarter. Operating expenses of $127.5 million are below our outlook range of 131 to 135 as we tightly manage spending in the quarter.\n\nThe resulting EPS in the quarter was $0.05 per share. Moving on to the balance sheet and cash flow items. We ended the quarter with $210 million in cash and restricted cash, up from last quarter. Our cash balance benefited from cash flow from operations of approximately $20 million, which resulted in free cash flow of $9 million, and we reinforced our balance sheet further as part of the refinancing of a substantial portion of our 2024 notes.\n\nDuring the quarter, we paid off the $40 million outstanding on our ABL facility, ending the quarter with a zero balance drawn. As a reminder, we will continue to utilize our ABL facility strategically for short-term working capital needs. Despite the tough macroeconomic conditions in 2022, we continued to make meaningful progress toward our long-term target business model, while strengthening our financial position. Through the first three quarters of 2022 and compared to the same period in 2021, we grew company revenue by 6% and product revenue by 11%, well ahead of the 4% growth rate for the optical market, netting in an expected gain in market share.\n\nWe expanded operating margins, while absorbing higher supply chain costs throughout the year, and we successfully ramped ICE6 consistent with our commitments. Turning to the outlook for the fourth quarter. We are encouraged by the demand environment, the ramp of ICE6 and our strong backlog. At the same time, we are cognizant of the uncertain macroeconomic environment and expect supply challenges to persist through at least the first half of 2023, albeit with some moderation.\n\nTaking these factors into account, we expect Q4 revenue to be in the range of $435 million, plus or minus $15 million, representing approximately 8% growth on a year-over-year basis at the midpoint of the range. We are planning for year-over-year product revenue growth of greater than 10% in Q4 and a sequential improvement in services revenue. We expect gross margin to be in the range of 40%, plus or minus 150 basis points, up 220 basis points at the midpoint of the range on a quarter-over-quarter basis. The primary driver of projected sequential margin improvement is a higher percentage of vertical integration and our mix from the ongoing ramp of ICE6.\n\nEmbedded in the gross margin outlook is our assumption that we will continue to absorb approximately 300 basis points of supply chain impact from elevated costs tied to components, materials and freight. We are forecasting Q4 operating expenses to be in the range of $140 million to $144 million, up sequentially, as we pay annual commissions and continue to prioritize investments in both sales and marketing and R&D. The resulting operating margin in Q4 is expected to be 7%, plus or minus 200 basis points, in line with consensus at the midpoint of the outlook range and up 270 basis points on a year-over-year basis. Below the operating income line, we assume $7 million for net interest expense and $4 million for taxes.\n\nFinally, we are anticipating a basic share count of approximately 221 million shares for Q4 and a fully diluted share count of 260 million shares. As I close today, I want to reiterate how proud I am of the Infinera team's accomplishments over the last couple of years, as we have ramped new products, won new customers, accelerated growth and expanded margins. The team has delivered these solid operational results, while navigating through a tough external environment. We remain confident in our 8x4x1 strategy, as we drive toward our long-term business model and focus on generating $1 per share in earnings power.\n\nFinally, I'd like to extend my thanks to our partners, customers and shareholders for your continued support and cooperation. Josh, I'd like to turn the call over for questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Catharine Trebnick with MKM Partners. Your line is open.\n\nCatharine Trebnick -- MKM Partners -- Analyst\n\nThank you for taking my question. Thank you and first time I'm actually on the call with you guys. So my one question is you -- it looks like Europe is down 9% quarter over quarter. Can you talk to some of the issues going on there? Is it still pretty much -- yeah, just explain what's taking place in Europe and why that's down.\n\nThanks.\n\nDavid Heard -- Chief Executive Officer\n\nYeah, it's a good question, Catharine. Good to have you online. Q3 typically, seasonally has been a bit of a down quarter in Europe, over the pandemic, not as much travel this year. I think we saw a travel plus we had quite a concentration here in the US and with ICPs and the way we count some of that revenue of global ICP it falls in the US bucket.\n\nBut nothing out of the ordinary, nothing systemic, we still see strong demand and good prospects in Europe going forward.\n\nCatharine Trebnick -- MKM Partners -- Analyst\n\nYeah. And the only thing I wanted to press upon is subsea has always been a strong area of upgrades for 800 gig in. Can you pretty much pinpoint where you are against some of the competitive landscape with that opportunity?\n\nDavid Heard -- Chief Executive Officer\n\nYeah, I think we're winning lots of routes. And then with -- when we look at the technology, there aren't many, with 800-gig technology out there. So that business for us has been growing year over year, not only in revenue bookings but also pipeline opportunity, so it's going to be an exciting -- the lots of new tables going in to take advantage of interconnecting these data centers and handling the growth on a global basis.\n\nCatharine Trebnick -- MKM Partners -- Analyst\n\nAll right. Thank you.\n\nAmitabh Passi -- Head of Investor Relations\n\nThanks, Catharine.\n\nOperator\n\nYour next question comes from the line of Dave Kang with B. Riley. Your line is open.\n\nDavid Heard -- Chief Executive Officer\n\nHey, Dave.\n\nDave Kang -- B. Riley Securities -- Analyst\n\nHi, thank you. Good afternoon. My first question is I don't know if you disclose RPO, just how much was it? And how much of that is really for immediate shipments, say, less than three months?\n\nNancy Erba -- Chief Financial Officer\n\nSo we do disclose the RPO and the detailed schedule is in the Q that was filed today. So RPOs were up $300 million year over year at $909 million. It was down $45 million versus last quarter. But I can say that in the first week of Q4, we more than offset that in some bookings that literally just pushed over into the first week of Q4.\n\nDave Kang -- B. Riley Securities -- Analyst\n\nSo, is it fair to assume -- actually, that was my next question is orders that were set to fourth quarter. It sounds like it's about maybe $90 million to $100 million. Is that about right?\n\nNancy Erba -- Chief Financial Officer\n\nI'm not going to give you the amount, but it's more than $45 million. I'll leave it there.\n\nDavid Heard -- Chief Executive Officer\n\nYeah. Yeah, all that came in -- our third quarter closed on September 24, just the way the days fell and sometimes getting customers and folks to realize, it's not October 1 is a challenge. So yeah, those orders all came in, in Q1 well over the $45 million number.\n\nDave Kang -- B. Riley Securities -- Analyst\n\nAnd my first question actually was about how much of that RPO is for immediate shipments?\n\nNancy Erba -- Chief Financial Officer\n\nFor immediate shipments?\n\nDave Kang -- B. Riley Securities -- Analyst\n\nYeah, like within -- yeah, you expect this quarter, almost like -- how much can you -- should if you have like plenty of component.\n\nNancy Erba -- Chief Financial Officer\n\nYeah, the remaining of the $99 million, the remaining to go in 2022 is $426 million.\n\nDave Kang -- B. Riley Securities -- Analyst\n\nAren't we thinking about first -- OK. Thank you.\n\nOperator\n\nYour next question comes from the line of Alex Henderson with Needham. Your line is open.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nSo looking at the same basic question, RPO is little bit of an upward terms for backlog. And I guess the answer is the backlog came down by $45 million in the quarter and now it's been fully refreshed. If I'm going to look at that backlog, how do we think about the way it plays out into the first half of next year? And specifically relative to the first quarter, because normally, you have a seasonality in the first quarter that drops quite significantly, I know you don't want to give guidance that far out. But is there enough of that backlog that at this point we would have a different than normal seasonality and maybe a lesser decline in product sales sequentially than have had in the past?\n\nDavid Heard -- Chief Executive Officer\n\nIt's possible, but we're not going to call it yet. That RPO number and backlog number, just to remind everybody, it's supply limited and has been for the last 18 months. So, Alex, at this point in time, we're kind of continuing to believe we'll have the typical seasonal fall-off from Q4 to Q1. Too early to call that ball, given how dynamic the supply environment is.\n\nAs I mentioned earlier, while things have gotten easier for some broader parts, there's still probably in acute 8 to 12 parts and suppliers with kind of each a handful of parts that are really holding up the industry, very familiar names that many CEOs like myself, have been muttering.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nOK. If I going to look at it as take the $45 million assuming that that had been a normal September quarter and it sounds like you have around $900 million of RPO for the fourth quarter and into 2023. Is it reasonable to think of that as a straight backlog, and therefore, you've already got in hand well over 50% of CY '23 product sales in hand, or is there a large portion of that related to service?\n\nNancy Erba -- Chief Financial Officer\n\nA portion of that is related to service. I would say, we feel good about our expected backlog going into 2023 and that it gives us although we're not giving full guidance for '23 at this point, we do expect to grow ahead of the market in '23 and our backlog gives us that comfort.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nAll right. Thank you. I'll leave the floor.\n\nDavid Heard -- Chief Executive Officer\n\nYeah. I just want to clarify for those, because I want to make sure, Alex, we get your question on the backlog and RPO. So again, we ended the quarter September 24, there were a couple of orders that slipped over into the following week, which ended before October 1 that were in excess of $45 million. So the RPO number, I think, reported that Nancy just went through was without those bookings included.\n\nSo that number would have been -- the $909 million would have been up by over $45 million -- well over $45 million.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nRight. So the RPO is something in excessive of 9, 10 that you would have had -- that you had coming into the quarter, if you make that one-week adjustment?\n\nDavid Heard -- Chief Executive Officer\n\nCorrect.\n\nNancy Erba -- Chief Financial Officer\n\nCorrect.\n\nAmitabh Passi -- Head of Investor Relations\n\nThanks, Alex.\n\nOperator\n\nYour next question comes from the line of Mike Genovese with Rosenblatt Securities. Your line is open.\n\nMike Genovese -- Rosenblatt Securities -- Analyst\n\nGreat. Thanks very much. I guess, I want to understand, I think I heard you said, Nancy, you're not giving '23 guidance right now, and I don't -- I guess, does that mean we're not talking about 8 to 12 anymore for next year?\n\nNancy Erba -- Chief Financial Officer\n\nNo, it doesn't mean anything. It's just right now, we're focused on Q4 -- executing Q4, and we're not going to make any update to '23 at this point.\n\nDavid Heard -- Chief Executive Officer\n\nYeah. No updates to what we've said prior, Mike. So we're not backing off anything, we just want to get through this quarter and make sure we see where the stability in the market ends up.\n\nMike Genovese -- Rosenblatt Securities -- Analyst\n\nOK. I'm looking at the presentation which says bookings continued at a steady pace. I think prior quarters this year, they were up I think, double digits year over year. Is that -- did that continue in the third quarter, or is there a steady means sort of flat year over year?\n\nDavid Heard -- Chief Executive Officer\n\nYeah. So I think what we're seeing is the forecast that we had for the back half of the year is holding strong with steady growth. The timing of that week of ending the 24 to October 1 was the only change that we saw, Mike. So we still see that kind of growth rate as we look at the back half of the year and positive book-to-bill.\n\nOur book-to-bill, just to be clear, was just under one. And if you take that week into was definitely over one and consistent with what our thoughts were as we entered the back half of the year.\n\nMike Genovese -- Rosenblatt Securities -- Analyst\n\nOK. So a couple of more questions, if you don't mind. First of all, on the ICPs, really good quarter for ICP is it sounds like you had one 10% customer. but we the strength from other customers now as well, or was it primarily driven by one?\n\nDavid Heard -- Chief Executive Officer\n\nNo, there isn't -- those -- as I mentioned in the last call, where we used to only engage one ICP or two at a time, we're now kind of positioned with the top seven going forward and some of those are ramping. You heard in my comments where we're ramping different applications with each of those ICPs. So while there was one 10% ICP, there were a couple of very large contributors to the quarter as well.\n\nMike Genovese -- Rosenblatt Securities -- Analyst\n\nGreat. And then I'm going to ask us two at once, that will be it for me. The supply -- I mean, the supply chain, I think like a lot of people have said still bad and even a little worse than we thought. But you still managed to come in with what I call in-line gross margins, in-line gross margin guide.\n\nDoes that mean that the mix shift to ICE6 is even more powerful than you thought? And then secondly, unrelated, what's the driver of the share count dropping in 4Q from 3Q? Thank you.\n\nDavid Heard -- Chief Executive Officer\n\nYeah. So first question, yeah, look, 400 basis points was not what we expected on the supply chain drag. That is going to eclipse a $50 million extra cost for us this year. The positive piece of our margin performance is, as we said in the script, was ICE6 was over 30% of product revenue for the quarter.\n\nSo, that powerful mix and margin of that product line and vertical integration did help us mitigate some of that supply chain costs and will continue to in Q4 and into 2023. And that same vertical integration in our pluggables as we move into the metro with our own pluggables will help us in the future.\n\nNancy Erba -- Chief Financial Officer\n\nYeah. And on the share count, it's somewhat of an unusual quarter, because of the new 28 converts, which are an instrument fee, meaning we intend to pay those back in cash, so they are not included in the fully diluted share count. We actually have a bridge for you in the material that's on the website that walks you through the share count calculation. But I can go into more detail later if you want, but that bridge is actually out there.\n\nBut it's one of the attributes of an instrument fee, you would not include those shares in the fully diluted count.\n\nMike Genovese -- Rosenblatt Securities -- Analyst\n\nThanks.\n\nAmitabh Passi -- Head of Investor Relations\n\nThanks, Mike.\n\nOperator\n\nYour next question comes from the line of Simon Leopold of Raymond James. Your line is open.\n\nSimon Leopold -- Raymond James -- Analyst\n\nHey, thanks for taking the questions. So David, I feel like I heard you say something or suggest something, and I want to just make sure this isn't my imagination running away from me, but it sounds like you suggested that you're taking some extra share and doing a little bit better in part because competitors are having issues, perhaps with supply chain and -- so part of your ability to grow faster market is coming from your supply chain execution relative to others. If you could maybe elaborate on what you were talking about?\n\nDavid Heard -- Chief Executive Officer\n\nNo, you actually -- I wasn't intimating or that is a fact. So, you got that right. That was a good translation. We are seeing in a number of markets where maybe people have been waiting or had orders placed and they're hitting traffic limits, where they need to bring in an alternative with open line systems and open transponders or lead times on those transponders, given we had planned for a big ramp and wanted to have extra ability to take share, number one.\n\nAnd number two, the vertical integration puts more of that supply chain in our own hands. And so that has provided us in many cases, where we can deliver transponders in 12 weeks or 16 weeks, compared to somebody else that might have been waiting for a couple of quarters or a year.\n\nSimon Leopold -- Raymond James -- Analyst\n\nAnd I guess the follow-on to that is, how sticky is that? Does that reverse at some point when supply chain uses for everybody, or does it give you some advantage?\n\nDavid Heard -- Chief Executive Officer\n\nWell, the way I think about it is, when I talk to our customers, any time you experience a shock like this, whether it's Y2K or any of the initiatives that have gone across corporations and then to boardrooms, supply chain has been a huge discussion in everybody's boardroom. And so I think people have just looked at the concentration on where they have their spend in each category, including optical. And as somebody who is a share taker, it provides us for more opportunity where maybe some of the customers have been more concentrated, not just temporarily, but permanently.\n\nSimon Leopold -- Raymond James -- Analyst\n\nThank you. And then just a quick clarification. I think in the past, you give us the target for ICE6 to be 20% to 25% of revenue, I believe, for the full year. And given the 30% you achieved in this quarter and your outlook for the fourth quarter, do you have a revision for the full year target or is it still that 20% to 25%?\n\nDavid Heard -- Chief Executive Officer\n\nNo, it's still 20% to 25%, and then somebody had the question on full year guidance. That's why on this call, we also mentioned we're having our Investor Day, March 7 at OFC. So we'll try to give you all those metrics like we did. I think for this year, we did a nice job of saying, hey, here's what we're going to ramp i6.\n\nHere's what's going to happen with pluggables. Here's what's going to happen with operating margins. Here's what we believe the supply chain drag will be. We will give the same kind of detail on March 7 in San Diego.\n\nSimon Leopold -- Raymond James -- Analyst\n\nGreat. I'll be there. Thank you.\n\nDavid Heard -- Chief Executive Officer\n\nAll right. We look forward to it.\n\nOperator\n\nYour next question comes from the line of Meta Marshall with Morgan Stanley. Your line is open.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thanks. Maybe just bearing in on the supply chain a bit for a minute. Just what formed the kind of a more complicated supply chain take this quarter? Just trying to get a sense of where the products that became -- were there different products that became unavailable during the quarter, where they're just higher broker fees than expected? Just a little bit of context about kind of what happened versus what you were expecting? And then second, the international business is obviously a little bit weaker.\n\nI understand that there's lumpiness in project-based up there, but you did mention macro in your script. And so just wondering if kind of the strength of an dollar had any impact with kind of your European customer base? That's it for me. Thanks.\n\nDavid Heard -- Chief Executive Officer\n\nNo, both excellent questions to go through. I think on the macro basis, back to demand. Now so far, we haven't seen anything significant. We're service providers in general, maybe I'll make a comment about spend.\n\nI think ICPs are continuing to grow in their data center. I think you saw what Meta's capex numbers are. We expect data center growth to continue in the subsea cables has to continue. We have very good insight into that as we've been partnering with our client base.\n\nAnd because those are long projects when you're planning cables under the sea, we get to see those. So that gives us a little bit more confidence that our capex will be prioritized. When you think of the CSPs in prepared remarks from the largest CSPs, most of them have said, look, they're going to continue to spend capex primarily focused on fiber, on the implementation of fiber and 5G. 5G tends to be a very radio heavy first implementation.\n\nAnd so that means the intensity of the spend we're seeing is really on that fiber implementation if you've seen Corning announced too, they're a very conservative company. They announced two factories, one in Arizona one and Warsaw to actually make fiber, which means, this is going to be a continued trend be a little bumpy with the economy, but the investment thesis is strong there. From a supply chain perspective, I'll tell you this. Supply chain costs went up in terms of expedite fees and transportation fees big time broker fees.\n\nObviously, we grew product revenue 17% year-over-year. So in order to do that, we had to make our supply available. The good news was it was also a large portion of our ICE6, which is a lot more under our own vertical integration. So a little bit of our own control.\n\nWe continue to see again this eight to 12 parts or eight to 12 vendors that are still ramping up their fab capacities in older geometries and analog technologies. Those still are biting on the industry, and we expect those to ease in the back half of next year.\n\nNancy Erba -- Chief Financial Officer\n\nYeah. And on the FX impact on both a quarter over quarter and a year over year, I would say modest on the revenue, certainly quarter over quarter, call it, $5 million-ish, but we have a natural hedge in terms of our expenses there. So net-net, it was almost neutral to $1 million impact. So not anything that would ensure -- not change.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nDavid Heard -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Fahad Najam with Loop Capital. Your line is open.\n\nFahad Najam -- Loop Capital Markets -- Analyst\n\nHey, thank you for taking my question. Clarification first, David, if you guys are taking share, then why are you still not -- why are you still maintaining your ICE6 revenue contribution to the 20% to 25%. Is it that the most of the share wins are not in ICE6, are they more in legacy products?\n\nDavid Heard -- Chief Executive Officer\n\nNo. I mean, I think if you do the weighted average math, I mean, again, you follow this stuff probably even closer that when I look at the competition, most of the competition on a year-over-year basis is down in terms of revenue and significantly down in terms of their gross profit percentages. So all I know is we're up in revenue by 9%, up in product by 17%, and I don't believe the competition is there. So when the DOs and others report their market share gains.\n\nIf the major competitors are down and we're up, I think we'll be gaining share. And that's, by the way, both on our long-haul ICE6, as well as in the metro, and we haven't even unleashed our own pluggables yet.\n\nFahad Najam -- Loop Capital Markets -- Analyst\n\nGot it. If I take a step back to the real question, if I look at your R&D spending, you managed to bring it down sequentially even in the face of worsening inflation, and you mentioned that you plan on taking a leadership role in 800-gig VR development. You've got a number ahead of you, yet your R&D spend is coming down in the face of an adverse inflationary environment. How are you managing to sustain this R&D and still think that you're going to keep ahead of competition?\n\nDavid Heard -- Chief Executive Officer\n\nYeah. We're vertically integrated. We develop our own systematically integrated circuits. Those same integrated circuits can do big transponders like ICE6, 800 gig or 1.6 terabit 2x800 gig, which is what our product is, as well as that's how we build the transmit receive optical assembly or the TROSA, which is the largest portion of the pluggable.\n\nSo that kind of platform development allows us to be efficient in our development. Now, on the other side of that, we have had some relief because we do some of our development for some of our system software and others in FX positive jurisdictions, but not a tremendous amount. Next year, again, we've said we will continue to invest in R&D in those critical areas. And we've taken our product portfolio in a much more simplified set, as well as we're going to expand our go-to-market investments.\n\nWhy? Again, if you're going to gain share, it's not just about having the product, but it's about being there to be able to have the relationships and sales channel with the customer.\n\nFahad Najam -- Loop Capital Markets -- Analyst\n\nI realize you're going to give your full year outlook for 2023 at BOFC, but that does lead to the question, do you think that the intensity of your spending on R&D and sales and marketing is likely to increase as you look at all these new projects and your ambitions on sustaining leadership role?\n\nDavid Heard -- Chief Executive Officer\n\nYeah. I think overall, you're going to see it increase. And by the way, there's some inflation going on too as well. So yeah, both in terms of where we invest, as well as the inflationary impact, good news being operating leverage, good news being Nancy mentioned earlier that we intend to grow faster than the market.\n\nGood news is you'll probably see margin accretion on the gross level and the bottom-line level, and that's what we've been doing for the last three years, and that's what we intend to do. We're just not ready in this market to nail down the specific numbers, but we feel good about our position growing faster than the market.\n\nFahad Najam -- Loop Capital Markets -- Analyst\n\nAppreciate the answers. Thank you.\n\nOperator\n\nYour next question comes from the line of Jim Suva with Citigroup. Your line is open.\n\nJim Suva -- Citi -- Analyst\n\nThank you. In your prepared comments, you talked about supply chain. Have they actually gotten worse than or better? And I'm just trying to help get a better understand, or is it just like different things that are is final parts\n\nDavid Heard -- Chief Executive Officer\n\nYeah, both. The costs went up in Q3 more than we expected by 100 basis points, and that was just in order -- again, late breakers that we needed to pay expedite fees to get through to make sure we meet the big demand of that 17% product revenue growth. We did see some lightning of the overall supply chain environment like general components are beginning to free up as the consumer demand lightens. And as people work through what was the backlog a more robust economy.\n\nWe still see where there was expansionary requirements again in a very focused number and acute number of components for line systems and other things with older geometries that are in the process of building out that capacity. And we expect that capacity to be in place and effective for us so that, call it, three quarters from now in the back half of next year. We don't see the same dynamic.\n\nJim Suva -- Citi -- Analyst\n\nOK. Then my follow-up is on more for Nancy probably. Interest expense going forward, is this current run rate that you have this quarter a good number or the Fed of course increased rates by 75 basis points so modeling interest expense upward as we continue on.\n\nNancy Erba -- Chief Financial Officer\n\nNo. In fact, we're really glad we got the refinance done of the 24 converts when we did. So those interest rates, you should keep as they are. The only ebb and flow would be there is if we utilize the ABL, but that would be on a temporary basis for working capital needs, but as of today and at the end of the quarter, we don't have anything drawn on that ABL.\n\nJim Suva -- Citi -- Analyst\n\nGreat. Thanks so much for the clarifications.\n\nDavid Heard -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of George Notter with Jefferies. Your line is open.\n\nGeorge Notter -- Jefferies -- Analyst\n\nHi. Thanks a lot, guys. I wanted to ask about the mix of vertically integrated products. I think you said the ICE6 was greater than 30%.\n\nBut do you have an overall number for the mix of vertically integrated products?\n\nNancy Erba -- Chief Financial Officer\n\nYeah, it was close to 50.\n\nGeorge Notter -- Jefferies -- Analyst\n\nOK. Great. And then --\n\nNancy Erba -- Chief Financial Officer\n\nYeah.\n\nGeorge Notter -- Jefferies -- Analyst\n\nI also -- I wanted to ask also about you guys kept referencing the September 24 quarter end. Are you suggesting it was a 12-week quarter? Was it in the 13-week quarter, or what's unique about that?\n\nNancy Erba -- Chief Financial Officer\n\nIt was just the timing. It was a 13-week quarter. We are going into a 14 weeks this quarter. So this quarter will end December 31.\n\nGeorge Notter -- Jefferies -- Analyst\n\nGot it. OK. Super. Thank you very much.\n\nI appreciate it.\n\nOperator\n\nYour next question comes from the line of Samik Chatterjee with J.P. Morgan. Your line is open.\n\nAngela Jin -- J.P. Morgan -- Analyst\n\nHi. This is Angela Jin on for Samik Chatterjee. I just have one question. So just thinking ahead to sort of, 4Q in 2023.\n\nCould you maybe rank order how you expect revenue growth to trend for your customer verticals?\n\nDavid Heard -- Chief Executive Officer\n\nThat one is going to be probably pretty tough to do. I'll tell you, ICPs are going to continue to be very strong for us. I do believe that you'll continue to see not just in Q4, but next year, Tier 1 service provider US beginning to scale up as we have a number of certifications underway. But nothing out of the ordinary for Q4, Q1.\n\nA lot of that has to do with revenue recognition when projects get complete and we've contemplated that kind of normalized mix in Finance's guidance for the quarter.\n\nAngela Jin -- J.P. Morgan -- Analyst\n\nOK. Thank you.\n\nOperator\n\n[Operator instructions] Your next question comes from the line of Alex Henderson with Needham. Your line is open.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nGreat. Thank you. So I wanted to go back to the comment about $50 million worth of absorbed supply chain cost increases over normal. I certainly get that the math for this year, but I also understand that prices are going up.\n\nSo, as you look out into the next three, four, five quarters, will we see when the supply chain improves but that 400 basis points falls through to the gross margins, or are there price increases that you're anticipating that would cause the effective normalized costs to go up and offset some of that benefit.\n\nDavid Heard -- Chief Executive Officer\n\nYeah, it's a good question. When that happens, our job is to offset it in our plans, I think we've mentioned this in prior calls, we've added in $30 million of contemplated excess supply chain costs for next year. So, remember, we said we thought it would be, go from $50 million to $55 million this year to 30-ish next year. But Alex, you're absolutely right.\n\nSome suppliers are going to go ahead and up to price here or there. Our job is to continue to drive that down. We do have annual cost reduction initiatives with our suppliers that I do expect if the supply chain begins to turn, we can go get those back. We've also made commercial arrangements, i.e., pricing adjustments and things like that in the marketplace that we're not going to go into in detail on this call.\n\nthat should be able to mitigate. And we'll contemplate all of that into our guidance for next year when we go through March 7.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nOK. So, conceptually, if hypothetically, we were to see the majority of that 400 basis point hit to gross margins in 3Q fall out, say, three quarters of a fall out in the third quarter of next year, would the expected strategy be to take that to the bottom line, or would you take some of that and reinvest it into R&D, sales and marketing and other expenses.\n\nDavid Heard -- Chief Executive Officer\n\nYeah. That's a good question that we'll go through, right. I mean, yeah, conceptually what we said --\n\nAlex Henderson -- Needham and Company -- Analyst\n\n[Inaudible] forecast.\n\nDavid Heard -- Chief Executive Officer\n\nNo, no, it's OK. Conceptually what we said, we are increasing our R&D because we've got this vertically integrated US based again, asset that we view this vertical integration for 800-gig pluggables, 100-gig pluggables and 400-gig pluggables is going to be pretty powerful. So you will see us continue to invest there, as well as transponders for subsea and long-haul, as well as you're going to see a step up in sales and marketing. And we've never had the confidence to go do that, because honestly, the product line has never been in better shape and the industry dynamics have open and the need for supply chain diversity has never been there.\n\nSo our contemplation is that, yes, we'll continue to grow sales and marketing and R&D, while we do that. And we have to continue year after year to expand margins while we do it. And some of that will come from operating leverage, but some of that's going to come from more products vertically integrated. And then in 2024, so see that I won't give any 2023, but I will talk about 2024.\n\nAs the pluggables become more of our metro platform of our own system products, you're going to see the next kick point of margin there as well, as well as continued operating leverage. But we do have to continue that investment in sales and marketing as well as R&D. I'd say, sales and marketing with more intensity than R&D though.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nAnd just one clarification on the R&D comment from earlier. While I guess it's down sequentially and actually down year over year, you have a lot of prototype costs and things of that sort that caused from big declines when they fall out. As I look at the December quarter, it looks like the spend will go up quite a bit sequentially. And I assume a good chunk of that is in R&D, which would put you at meaningful increase in R&D for the year.\n\nIs that the right way to think about the R&D here in the fourth quarter?\n\nDavid Heard -- Chief Executive Officer\n\nIt is. It generally trends as you get -- we said we were splitting samples out in the back half of the year and beginning to go through certification. So you nailed it on the head that happens in Q4. It's not a start of an increase as everybody probably expected.\n\nAgain, we got a little bit of a benefit from FX, but it will continue to increase as we get into next year, albeit still while we increase our operating income and increase our gross margins for next year.\n\nNancy Erba -- Chief Financial Officer\n\nIn Q4 also with commissions with the planned bookings for Q4, you'll also see that step up as well.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nSo commissions are in the sales and marketing line, am I right?\n\nDavid Heard -- Chief Executive Officer\n\nThey are.\n\nNancy Erba -- Chief Financial Officer\n\nCorrect. We were talking about opex in total.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nYeah. OK. I understand\n\nDavid Heard -- Chief Executive Officer\n\nThanks, Alex.\n\nOperator\n\nThere are no further questions. I'd like to turn the call back to CEO, David Heard, for closing remarks.\n\nDavid Heard -- Chief Executive Officer\n\nNo, I appreciate it. Really good, solid questions. I know it's a difficult market out there, a lot going on. So we're trying to keep things relatively concise.\n\nOverall, we had a quarter that beat expectations and delivered 17% product revenue growth which is tremendous given the supply chain environment. And our Q4 guidance met the midpoint of prior expectations. So our heads down and get ready to execute to that. We delivered three strong quarters for the first three quarters of the year and a tough macro backdrop, total revenue growth, while the services drag, was there with 6% still in that environment with total product revenue growing at 11%.\n\nWe've expanded our operating margins, like you saw this last quarter, over double year over year while we do that. So we're really trying to drive that efficiency while we do that and drive things to the bottom line. So look, our strategy is working. We are laser focused, no pun intended on driving that $1 per share of earnings power, and that makes lots of things go well.\n\nAnd I really want to thank the Infinera team for their dedication. I mean we've gone through pandemics. We've gone through wars. We've gone through -- we are now in a recession that we're going through.\n\nBut the great news is there's demand for what we do. The capex seems to be very focused on fiber and fiber build-outs, that's our specialty. We have vertical integration that matters there. And we've got an environment where Huawei stepping away, there's an open architecture for us to insert to.\n\nSo you're going to see our heads down, call it helmets on, not pieces in and heads down to execute. And look, we look forward to diving deeper into the strategy and answering all the detailed questions you're going to have in our Investor Day on March 7. So we hope to see you there at OFC San Diego. Thanks.\n\nTake care of yourselves and your families. We appreciate your support.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAmitabh Passi -- Head of Investor Relations\n\nDavid Heard -- Chief Executive Officer\n\nNancy Erba -- Chief Financial Officer\n\nCatharine Trebnick -- MKM Partners -- Analyst\n\nDave Kang -- B. Riley Securities -- Analyst\n\nAlex Henderson -- Needham and Company -- Analyst\n\nMike Genovese -- Rosenblatt Securities -- Analyst\n\nSimon Leopold -- Raymond James -- Analyst\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nFahad Najam -- Loop Capital Markets -- Analyst\n\nJim Suva -- Citi -- Analyst\n\nGeorge Notter -- Jefferies -- Analyst\n\nAngela Jin -- J.P. Morgan -- Analyst\n\nMore INFN analysis\n\nAll earnings call transcripts"
}