{
  "companyName": "TechnipFMC",
  "companyTicker": "FTI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/technipfmc-fti-q3-2022-earnings-call-transcript/",
  "content": "TechnipFMC (FTI 1.08%)\nQ3 2022 Earnings Call\nOct 27, 2022, 8:00 a.m. ET\n\nOperator\n\nThank you for holding, and welcome, everyone, to the TechnipFMC third quarter earnings conference call. [Operator instructions] I would now like to turn the call over to Matt Seinsheimer, senior vice president of investor relations and corporate development. Mr. Seinsheimer, please go ahead.\n\nMatt Seinsheimer -- Vice President, Investor Relations\n\nThank you, Jack. Good morning, and good afternoon. And welcome to TechnipFMC's third quarter 2022 earnings conference call. Our news release and financial statements issued yesterday can be found on our website.\n\nI'd like to caution you with respect to any forward-looking statements made during this call. Although these forward-looking statements are based on our current expectations, beliefs, and assumptions regarding future developments and business conditions, they are subject to certain risks and uncertainties that could cause actual results to differ materially from those expressed in or implied by these statements. Known material factors that could cause our actual results to differ from our projected results are described in our most recent 10-K, most recent 10-Q and other periodic filings with the U.S. Securities and Exchange Commission.\n\nWe wish to caution you not to place undue reliance on any forward-looking statements, which speak only as of the date hereof. We undertake no obligation to publicly update or revise any of our forward-looking statements after the date they are made, whether as a result of information, future events, or otherwise. I will now turn the call over to Doug Pferdehirt, TechnipFMC's chair and chief executive officer.\n\nDoug Pferdehirt -- Chairman and Chief Executive Officer\n\nThank you, Matt. Good morning, and good afternoon. Thank you for participating in our third quarter earnings call. Total company revenue in the period was 1.7 billion.\n\nRevenue was in line with the second quarter and our outlook, a solid achievement given the foreign exchange headwind experienced during the period. Total company adjusted EBITDA was 200 million with a margin of 11.5%, which excludes a foreign exchange loss. Both Subsea and Surface Technologies achieved sequential improvement in adjusted EBITDA margin in the quarter. Total company inbound orders were 1.9 billion.\n\nSubsea inbound was 1.4 billion, with year-to-date orders now totaling 5.2 billion, exceeding the level achieved in all of last year. Project awards inbound in the period included TotalEnergies' Lapa Northeast development offshore Brazil, where we will install umbilicals and flexible pipe in a new configuration to further secure the production of the field. This award highlights the diversity of work scope and customer opportunity in the region. We also received a contract from Shell for the Jackdaw development.\n\nThe project will use our pipe-in-pipe technology for the tieback from the new Jackdaw platform to Shell's existing Shearwater hub, supplying much-needed gas to the region. Additionally, we received an award for the ExxonMobil gas-to-energy project in Guyana, which will be included in future inbound once the project receives FID and government approvals. This project will enable Guyana to shift a portion of its power generation to cleaner natural gas sourced from nearby offshore fields. Beyond our announced awards, inbound orders in the quarter reflected strong tieback activity in the Gulf of Mexico, the North Sea, and West Africa.\n\nDuring the quarter, we also renewed our technology alliance with Halliburton, where we have demonstrated strong collaboration since the creation of TechnipFMC in 2017. The alliance accelerates the development and commercialization of new technologies that deliver integrated production solutions that span Subsea and Subsurface applications. An example of this is a digital technology, Odassea Subsea Fiber Optic Solution, which we first introduced in 2020 and has already been deployed in key subsea developments. The alliance continues to develop innovative and disruptive technologies that can be used in all-electric subsea field development, subsea well intervention, and carbon capture and storage.\n\nNow, looking ahead, we are confident that offshore will provide significant volumes of oil and gas with attractive returns that, in many cases, are among the most compelling opportunities available to our customers. Project economics have improved, driven by lower cost and accelerated time to first oil, providing solid support for continued development activity. This is supported by the fact that approximately 90% of estimated subsea capital expenditures through 2025 are based on breakevens of less than $40 a barrel. Our subsea opportunity list remains at a record level.\n\nThis strong project pipeline and the active dialogue with our large and expanded customer base give us continued confidence that our full year subsea orders will be up as much as 40% versus the prior year, with orders approaching $7 billion in 2022. And if we extend the outlook into 2023, we believe orders over the next five quarters will be at least $9 billion. Moving to Surface Technologies, inbound was strong at 449 million, representing a book-to-bill of 1.4. Importantly, inbound activity in the period benefited from the acceleration of orders from Aramco, a significant portion of which will result in revenue in future periods.\n\nThe resulting growth in backlog also provides us with increased visibility for continued growth in our international revenue in 2023. Investment in oil and gas resources will continue, and we are confident that offshore and subsea will be critical enablers for the energy transition. Opportunities in greenhouse gas removal, hydrogen, and floating offshore renewables, including wind, wave and title energy, are accelerating. We have made several announcements regarding strategic agreements and partnerships, and we have already achieved notable commercial wins.\n\nWe have secured two title energy contracts in the U.K. through our partnership with Orbital Marine Power. The multi-turbine projects will be capable of delivering 7.2 megawatts of predictable tidal energy, positioning us as the leader in floating tidal energy. And we have signed the option-to-lease agreement for the ScotWind N3 area through our partnership, Magnora Offshore Wind.\n\nThe project scope would include the installation of 33 floating wind turbines, which, when combined, can provide enough energy to power more than 600,000 homes in the United Kingdom. Our growing presence in commercial wins in these particular offshore renewable markets are creating new opportunities across an expanding list of potential partners and geographies. We are confident that as the energy transition accelerates, so, too, will the opportunity set for our company. In summary, we remain focused on meeting our commitments in 2022.\n\nAnd looking beyond the current year, we continue to see the potential for strong growth in EBITDA, cash flow, and returns as evidenced by our stated objective to achieve more than 1 billion of Subsea EBITDA by 2025. Further demonstrating our confidence in this outlook, we announced a new 400 million share buyback program in July, which we quickly put into action with the repurchase of $50 million of our shares in the quarter. We have also reaffirmed our commitment to a dividend, which we intend to initiate in the second half of 2023. This outlook is enabled by the fundamental changes we have made to our company and the continued strength in the markets we serve.\n\nThe next leg of growth in oil and gas will be fueled by offshore in the Middle East. The bold steps we took five years ago to create TechnipFMC have resulted in a pure-play technology company that is uniquely levered to both of these markets. Our portfolio of innovative products, solutions, and disruptive commercial models has further strengthened our leadership position, and we are now taking full advantage of the market growth that lies ahead. I will now turn the call over to Alf.\n\nAlf Melin -- Chief Financial Officer\n\nThanks, Doug. Total company inbound orders were 1.9 billion in the quarter with Subsea inbound of 1.4 billion and Surface Technologies of 449 million. Total company backlog decreased 2% sequentially to 8.8 billion due to a foreign exchange impact of just over 300 million in the period. Revenue in the quarter was 1.7 billion.\n\nAdjusted EBITDA was 200 million when excluding a foreign exchange loss of 14.5 million. Third quarter income from continuing operations was 5 million, which included after-tax charges and credits that netted to an expense of 8 million. When excluding the impact of charges and credits, our adjusted income from continuing operations was 13 million or $0.03 per share. Now, turning to segment results.\n\nIn Subsea, revenue of $1.4 billion benefited from higher project installation activity in Brazil and Guyana, which was offset by the negative impact of foreign exchange. Adjusted EBITDA was $184 million, an increase of 4% sequentially. Results benefited from improved margins in backlog and increased installation activity. Adjusted EBITDA margin was 13%, up 60 basis points versus the second quarter.\n\nIn Surface Technologies, revenue was 318 million, up 5% from the second quarter. We experienced revenue growth globally with particular strength in the Middle East. Adjusted EBITDA was 41 million, a 26% increase sequentially. The increase was primarily due to higher international activity, including the progressive ramp-up in Middle East volume and timing of associated costs.\n\nAdjusted EBITDA margin was 12.8% up 210 basis points versus the second quarter. Turning to corporate and other items in the period. Corporate expense was 25 million, net interest expense was 31 million, and tax expense was 43 million. Cash flow from continuing operations was 212 million.\n\nCapital expenditures were 31 million. This resulted in free cash flow of 181 million in the third quarter. We ended the quarter with cash and cash equivalents of 712 million. Net debt was 655 million, which was a reduction of 135 million from the second quarter.\n\nIn July, we announced our intention to begin shareholder distributions with an authorization to repurchase up to $400 million of our common stock, which, at the time, represented 14% of the company's outstanding shares. In the third quarter, we repurchased 5.8 million shares amounting to 50 million. We remain committed to returning cash to shareholders, and we believe that our shares represent attractive value. Moving to our guidance.\n\nFor full year 2022, we continue to expect Subsea revenue and adjusted EBITDA margin to be at the midpoint of the guidance range. In Surface Technologies, we now expect full year revenue to be at the midpoint of the guidance range with adjusted EBITDA margin at the low end of the range. Moving to corporate expense, we expect full year expense to be at the midpoint of the range. Taken together, 2022 full year EBITDA is expected to be between 650 million and 670 million.\n\nI want to reiterate that adjusted EBITDA guidance does not include the impact of foreign exchange. Beyond our operating segments and corporate expense, all other guidance items remain within their respective ranges with the exception of capital expenditures. We have reduced our guidance for capital expenditures by 50 million to approximately 180 million for the full year, primarily driven by timing of vessel recertifications. Now, looking to 2023, we are increasing our view of total company EBITDA to around 825 million, and we will give our complete full year 2023 guidance in February.\n\nAdditionally, we foresee a material improvement in free cash flow in 2023, with our current expectation that we will convert approximately 35% of EBITDA to free cash flow. In closing, I will share with you my key takeaways from the quarter. First, free cash flow generation improved as expected in the period, totaling 181 million. Second, we repurchased $50 million of stock, taking advantage of the recent buyback authorization to repurchase our shares at an attractive valuation.\n\nAnd third, we remain focused on improving our financial returns. Based on the outlook we have provided today, we see the potential for a 25% increase in EBITDA in 2023 when compared to the midpoint of our updated guidance for the current year. Operator, you may now open the line for questions.\n\nOperator\n\n[Operator instructions] Dave Anderson with Barclays, your line is open.\n\nDavid Anderson -- Barclays -- Analyst\n\nHi. Good morning, Doug. So, at your analyst day last year, you laid out a number of medium-term targets, including margins for 2025. A lot has changed in the last year.\n\nSo, I guess my question is, have the assumptions around those targets also changed in terms of, say, expected volumes and pricing? Maybe this is already in those targets, but I'm just wondering if maybe we should now be thinking something higher than the 15% EBITDA margins in Subsea by 2025?\n\nDoug Pferdehirt -- Chairman and Chief Executive Officer\n\nGood morning, Dave. Thank you very much for the question. Indeed, the assumptions have evolved in a very favorable way since what is now almost one year ago at our analyst day in November of 2021. At that point, you know, there were a few things.\n\nObviously, the commodity price, but also the focus on energy security and the need to accelerate the development of energy sources, all energy sources, but in the immediate term. And that's what we're really seeing in the marketplace today. With that, indeed, there is a pricing element that then evolves as a result of that. So, our -- you know, when we gave the 15% guidance at the time, we were at 10.5% margin for Subsea going to 15% margin.\n\nWe had revenues growing to $7 billion. We had inbound coming in at $8 billion. As you heard in my prepared remarks, the inbound has certainly accelerated. Inbound then translates into revenue, which translates into EBITDA.\n\nSo, it is reasonable to assume that the 15% guidance for 2025 could be achieved earlier. And I'll also emphasize, it's reasonable to assume that the 15% margin it is no way an indication that that is the upper end of our potential for our Subsea business.\n\nDavid Anderson -- Barclays -- Analyst\n\nRight. You're obviously well above 15% kind of life cycle and even just a couple of years ago, so I would imagine you should definitely be able to get higher than that. Doug, kind of a different subject here, but maybe this is a simplification, but it seems like Subsea projects are sort of falling into two buckets these days. On the one hand, we have these kind of larger multibillion-dollar projects, integrated projects with majors.\n\nOn the other hand, we have these smaller, I don't know, let's call them 3-4-3 jobs that are often with an independent. My question is what's better for FTI? What would you prefer? Would you rather have one large integrated project? Or would you rather have several smaller ones that make up that same size? I was just wondering if you could maybe compare and contrast the two. And then, would you expect higher margins in the smaller projects?\n\nDoug Pferdehirt -- Chairman and Chief Executive Officer\n\nDave, that's a very astute question and one we contemplate often as we're looking at what opportunities we're going to pursue, or, for that matter, what opportunities we do not pursue. We -- the size and the scale does matter, and you always want to kind of have a balance of the two where you have some larger, longer-term projects but, obviously, benefiting from supporting those with the smaller, shorter-cycle projects as well. If you look at really what's transpired over 2022, you can see that those smaller projects are really becoming a significant portion of our inbound. And, you know, historically, I would say it almost doubled the historical rates for that matter.\n\nAnd you saw it again this quarter. We only had two announced awards, neither of which, you know, were very large. They were not -- they were large but not very large. And we posted 1.4 billion of inbound, which tells you that, that underlying market for those smaller projects, as well as our Subsea services business continues to grow and be very robust.\n\nNow, the kind of the prioritization that we look at when we're working through opportunities is, first of all, partner. We always treat our partners with making sure that we have the capacity to be able to serve their needs. And as you know, we have a significant number of partners from the largest IOCs in the world and many new operators that are emerging in the market today and making up that group of the smaller orders with 40-plus different operators that we're now working for. The second one is iEPCI.\n\nClearly, we believe the way that we can generate the greatest value for our customers is by improving their subsea project economics. The best way to do that is to use -- to do it through an integrated project or our iEPCI model, which typically can save nine to 15 months or shorter time or accelerate oil, first oil by approximately one year. And that is a material implication, obviously, to the project economics. The next is 2.0.\n\n2.0 for us and for the industry for that matter is quickly becoming the standard. So, 2.0 is what -- when I say 2.0, I know you know. But for everyone on the call, that's the next generation of subsea architecture that is unique to our company that we introduced into the marketplace a few years ago. It's now the majority of our orders.\n\nIt's certainly almost all of what we're doing in terms of our early engineering studies and the market is rapidly moving in the direction of 2.0. That allows us to create leverage and move into a configure-to-order or a CTO model versus an ETO model. This is very important for us in terms of ensuring that we're capturing a fair and representative portion of the value -- economic value that we create. So, it's really that combination.\n\nSo, you know, when you see us announce an, you know, iEPCI 2.0 for a partner, well, let's put it this way. You shouldn't be surprised to hear us announcing a lot of iEPCI 2.0 for our partners because that opportunity pipeline is very rich for us right now.\n\nDavid Anderson -- Barclays -- Analyst\n\nSorry, Doug, if I could just sneak one more in here. You talked about 40 customers earlier this year. I guess the question is when you look out over those next quarters, are those 40 customers ordering again? I guess that's what I'm kind of wondering about is, is it just a one -- I guess there's a concern is it just one and done or do you need to keep backfilling this with smaller -- are those going to be repeat customers? I guess that's the question.\n\nDoug Pferdehirt -- Chairman and Chief Executive Officer\n\nLook, most of these have taken on either existing leases or developing new leases, and they all have multiyear, multi-project opportunity set.\n\nDavid Anderson -- Barclays -- Analyst\n\nOK, thanks, Doug.\n\nOperator\n\nArun Jayaram with J.P. Morgan, your line is open.\n\nArun Jayaram -- JPMorgan Chase and Company -- Analyst\n\nYes, Doug, I wanted to start. I was wondering if you could give us your thoughts on perhaps some of the near-term and longer-term implications of the much-needed consolidation that looks to be taking place in the subsea space and thoughts around what this means for FTI.\n\nDoug Pferdehirt -- Chairman and Chief Executive Officer\n\nSure, Arun, good morning. Thank you for the question. We had a vision seven years ago of what the market needed to really make subsea projects, the most attractive economics in our customers' portfolios, which we believe we've achieved today. We put that into -- initially studied it through a joint venture where we worked on the front end.\n\nAnd then we consummated the relationship five years ago, creating the only integrated subsea company. So, as far as we were -- as far as we're concerned, you know, that is behind us, and that's what we're benefiting from and the market is benefiting from and our customers are benefiting from. And that's what's most important. You know, in terms of further consolidation in the subsea space, that's really not -- that's not something we'll be participating in.\n\nBut we don't need to because of what we've already created. And we talked a minute ago about Subsea 2.0 and configure to order, that also allows us to double the throughput capacity through our facilities. And if we're able to double the capacity through our facilities, there's no need to consolidate or buy more of the same. There's just no advantage for us to do that.\n\nInstead, we invested in the technology and the development of the technology that allowed us to really optimize and double again our capacity. And then, as you know, on the vessel side, we're developing very important relationships with companies like Allseas and companies like Saipem that we built a vessel ecosystem where they can benefit from participating in our integrated projects, and we can benefit from having access to their vessels. So, as far as, you know, other consolidation, I think -- it clearly is a validation that the subsea market is both strong and very durable. I think it's acknowledgment of the integrated commercial model, again, that we pioneered and introduced five years ago.\n\nAnd then, finally, these things are what is driving potential market realignment around this new reality.\n\nArun Jayaram -- JPMorgan Chase and Company -- Analyst\n\nGreat. And just my follow-up, a few essentially blessed the street EBITDA number for 2023 at 825 million. Street, I think, is just around that number. I did want to see if you could give us a little bit more color around the fourth quarter.\n\nMidpoint is slightly below the Street, maybe that's seasonality. I'm wondering if you could give us -- just some thoughts on any impacts in terms of 4Q, even the 2023 looks to be bang on where the streets at.\n\nAlf Melin -- Chief Financial Officer\n\nSure. I'll do that. So, first of all, you are right that, you know, we reiterated guidance for Subsea at the midpoint, and we did indicate that Surface would be a little bit lighter on the full year guidance for the EBITDA. If you look at Subsea first, it was a strong quarter for us.\n\nWe had high installation activity, and we also had some completion on several key projects that kind of took a little bit of an advantage for us in the quarter. And when you take that into consideration, this, you know, timing of project completions, as well as some of the seasonal slowdown that, is kind of more normal for the Subsea as we see a slowdown both in installation and services activity, that's kind of what is impacting the Subsea business. So, that -- in summary, that's why full year guidance is still intact, but you see a little bit of a shift between Q3 and Q4. We have some similar dynamics going on in Surface, where, you know.\n\nWe had, you know, a good quarter with strong margin performance. But we do have some timing of certain expense that we expected to land in the third quarter, and that now is landing in the fourth quarter. So, again, that's why full year guidance, not a lot of change, but there are some dislocations between Q3 and Q4, as you correctly point out.\n\nArun Jayaram -- JPMorgan Chase and Company -- Analyst\n\nAll right. Thanks a lot.\n\nOperator\n\nChase Mulvehill with Bank of America, your line is open.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nHi, good morning or afternoon if you are in Europe. I guess a quick follow-up on some of the discussion around kind of the unannounced orders. Obviously, it was pretty strong this quarter. It looks like it was kind of in the $1 billion range.\n\nAnd the last time you kind of hit that was kind of pre-COVID and you kind of did that in the back half of 2019. But I guess maybe kind of a couple of questions? I guess, first, could you talk about the mix of that, you know, kind of billion dollars of orders this year between kind smaller SPS and vessel-based and some other stuff. I know that you announced the tidal energy stuff. So, I'm not sure how material that was.\n\nAnd then could you just talk to kind of how sustainable this billion-level is of unannounced orders and if that's kind of the new run rate. And if it's not, then like how should we think about the run rate of unannounced orders over the next, you know, 12 to 24 months?\n\nDoug Pferdehirt -- Chairman and Chief Executive Officer\n\nThanks, Chase. Always a little more difficult to forecast the unannounced awards because they are -- sometimes they come at us and very short order timeframe versus obviously the larger awards that are going through a tender process and you have a bit more visibility. Many, many of these smaller awards are direct awarded to our company. And some of those are actually customers that we have that have moved to our Subsea 2.0 standard, that are basically, if you will, building trees on specs so that they have those available so that they can benefit from very short-cycle tiebacks in the period of 12 to 14 months, which is, you know, half the time it has taken historically to do that type of work, and they get a huge benefit.\n\nSo, you know, what I would say is this quarter was probably a bit stronger than I would expect in future quarters, but we had a similar quarter back in Q2. So, it is definitely moving in that direction. And remember, it's a combination of these smaller awards, but also the strength of our underlying Subsea services business. So, certainly, it's going to be stronger than in the past, but I would say that this level and maybe a bit elevated to what I would model going forward on a more average basis.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nOK, perfect. Unrelated follow-up, I just want to kind of talk through some of the FX impacts. You know, there's obviously a few components here. I mean, obviously, you point to the FX, you know, in some of the cost here, but the 14.5 million is just balance sheet translation as I understand it, not cash.\n\nBut there's, also a couple of other translation FX impacts that I just kind of want to ask. You know, backlog, it looks like there was some negative backlog translation. And then, obviously, you've got the EBITDA, which is a function of revenue and cost translation. So, maybe could you just kind of talk to what the revenue and cost and ultimately EBITDA translation impact was if you have that in the quarter.\n\nAnd then what FX rates should we be focused on as we kind of look forward and think about revenue and cost translation?\n\nAlf Melin -- Chief Financial Officer\n\nNo, thank you for the question on this topic. So, first of all, the 14.5 million, which you correctly characterized, you know, mostly that is unhedged positions on cash or asset positions that are denominated in a currency that we cannot really hedge. So, that's where the majority of that is. There is also an element of some increase in cost of hedging as the volatility in the market and the higher interest rate environment we're in, it's impacting some of that and creating some fluctuation.\n\nBut then going to your second topic of backlog, that's clearly the biggest, you know, impact for the quarter. And this is true for both revenue and backlog when you think about Subsea. We do have a large portion of our revenue denominated in non-U.S. dollar currencies.\n\nAnd as the dollar moves in one direction or another, that does impact our top line, as well as our earnings, as you point out. So, the backlog impact was 300 million a little bit north of that. And -- but maybe to quantify the numbers that you might be looking for in the revenue and earnings, I would say that it's around 5% impact if you look at Q2 to Q3. And obviously, going forward, we are more balanced at the current level.\n\nBut -- so that's 5% on Subsea revenue and EBITDA, basically.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nOK. Just could you close the loop on that and just as we look forward, what, you know, FX currency should we be focused on when we think about hopefully maybe positive translation over the next 12 months, but who knows?\n\nAlf Melin -- Chief Financial Officer\n\nWell, I'll say this. First of all, we don't take a view on where the currency is going. So, it's important. So, basically, we recalibrate our forecast based on where we land with the rates at the quarter end, basically.\n\nSo, that's -- you can kind of say that that's the jump-off point for looking forward, what are the rates at the end of this quarter.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nOK. I was just trying to figure out which currencies you were mostly exposed to so we could track those?\n\nAlf Melin -- Chief Financial Officer\n\nOK. Well, so, let me go back then to Subsea again. The major currencies that we're exposed to is real in Brazil because we have a large portfolio in Brazil, and as well as Norwegian kroner and some pounds, a little bit of euro, but mostly Norwegian kroner and pounds.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nOK, perfect. Thanks Alf. Thanks, Doug. I'll turn back over.\n\nOperator\n\n[Operator instructions] Guillaume Delaby with Societe Generale, your line is open.\n\nGuillaume Delaby -- Societe Generale -- Analyst\n\nYes, good morning, Doug. Good morning, Alf. Just maybe on -- a quick question regarding the Inflation Reduction Act in the U.S. Do you see, as a consequence of this new legislation, some intensification with your clients? And to what extent should we expect a positive move on your CO2 activities over the next quarters given this new piece of legislation? Thank you.\n\nDoug Pferdehirt -- Chairman and Chief Executive Officer\n\nGood afternoon, Guillaume. Look, the real impact it has on our company is on the second portion, which is what you mentioned, which is the carbon capture sequestration opportunities. As you know, we've developed an integrated carbon transportation and storage system. We highlighted that back at our analyst day a year ago.\n\nIt has been fully qualified. And again, I want to emphasize the, believe that for carbon transportation and storage, we can just reverse the flow. It's simply not the case. It's going to require a very specific set of equipment and, in many cases, designed to a much different standard than we use in traditional oil and gas development.\n\nSo, we're there. We have it. As you know, we've developed the technology. We built our partnerships, where we're working with Talos in the Gulf of Mexico and others in other places around the world.\n\nBut in reference to the IRA, I'll highlight the relationship with Talos and the impact it has on the 45Q regulation, which we believe is very favorable and will certainly help accelerate the development of the various projects that we are working on at this time, so --\n\nGuillaume Delaby -- Societe Generale -- Analyst\n\nOK. I'll turn it over.\n\nOperator\n\nMarc Bianchi with Cowen, your line is open.\n\nMarc Bianchi -- Cowen and Company -- Analyst\n\nHi, thanks. I wanted to first ask about the $9 billion of awards over the next five quarters. Can you tell us how much is subsea services? How much would be unannounced and how much would be large?\n\nDoug Pferdehirt -- Chairman and Chief Executive Officer\n\nThanks, Marc. I appreciate the question. We don't really break that down. We have an idea that Subsea services typically comes in, you know, that one, two range.\n\nWe've indicated that we want to grow the inbound of subsea services to 1.5 billion by 2025. Going all the way back to Dave's original question, as other metrics that we laid out at that time or mouse or objectives, that, too, may be achieved earlier than 2025. But you kind of have a range there on the Subsea services. And in terms of the unannounced awards, as we talked about earlier, I think, you know, you want to try to find kind of a midpoint between some of these peak quarters like Q2 and -- yeah, Q1 and Q3, Mark.\n\nAnd kind of versus where we have been historically, the historical average, I'd probably go to the midpoint kind of in between the two of those. But look, let me be very clear. The 9 billion, we have a clear line of sight. I'll repeat.\n\nWe have a clear line of sight. The vast majority of that will be direct awarded to our company. This is the magic, and this is what makes us so proud of our company.\n\nMarc Bianchi -- Cowen and Company -- Analyst\n\nGreat, thanks for that, Doug. And I guess maybe just related to that, as I think about the -- that order rate was above what we had in our model. It seems to be above what is reflected in consensus. However, the guide that you're giving for 2023 is essentially in line with consensus.\n\nIs there -- is that the FX that we were talking about before with Alf? Is there conservatism in there in terms of backlog conversion? I just would have thought that there'd be some upward bias to the outlook if you've got such strong orders.\n\nDoug Pferdehirt -- Chairman and Chief Executive Officer\n\nSo, Marc, I just want to make sure I'm following your questioning. I'm talking about the inbound orders. That doesn't really translate, you know, in the current year. That takes some time for it to translate into revenue and EBITDA.\n\nBut what it shows is obviously, we've got the backlog coverage already pretty much for 2023. So, when you think about it, it really sets up 2024 and beyond.\n\nMarc Bianchi -- Cowen and Company -- Analyst\n\nGot it, super. And then just one more, if I could, for Alf. On the capex here, any thoughts on what's embedded in that 35% conversion for 2023 and how we should be thinking about capex longer term?\n\nAlf Melin -- Chief Financial Officer\n\nSure, so, capex, obviously, first it's -- this year, we have experienced a little bit lower run rate than normal. So, that's an important statement. You saw us take down the capex guidance by 50 million from 230 million to 180 million. But capex in fourth quarter is still going to be around 85 million.\n\nThe vessel certifications that I mentioned in my prepared remarks are taking place in the fourth quarter rather than earlier in the year as we plan these activities around our operations. But looking forward ahead, really, we remain very focused on managing our capital intensity. And when you look into 2023, where we are really still committed to being at the low end of the range that we have expressed before, which is really 3.5% of revenue. So, we feel very comfortable that we are -- we have reached a place where the capital intensity is simply lower in our business than it has been historically.\n\nDoug Pferdehirt -- Chairman and Chief Executive Officer\n\nAnd I think that's really, you know, what's so unique about how we've changed our operating model where we wouldn't be able to do that. We'd see capex levels increasing quite dramatically. But with the vessel ecosystem that we've developed and with the benefit of the CTO, we can stay at that low end of the range.\n\nMarc Bianchi -- Cowen and Company -- Analyst\n\nYup, great. Thanks so much, guys. I'll turn it back.\n\nOperator\n\nI will now turn the call back over to Matt Seinsheimer for closing remarks.\n\nMatt Seinsheimer -- Vice President, Investor Relations\n\nThank you, Jack. This concludes our third quarter conference call. A replay of the call will be available on our website beginning at approximately 8:00 p.m. British Summer Time today.\n\nIf you have any further questions, please feel free to contact the investor relations team. Thanks for joining us. Jack, you can now end the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMatt Seinsheimer -- Vice President, Investor Relations\n\nDoug Pferdehirt -- Chairman and Chief Executive Officer\n\nAlf Melin -- Chief Financial Officer\n\nDavid Anderson -- Barclays -- Analyst\n\nArun Jayaram -- JPMorgan Chase and Company -- Analyst\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nGuillaume Delaby -- Societe Generale -- Analyst\n\nMarc Bianchi -- Cowen and Company -- Analyst\n\nMore FTI analysis\n\nAll earnings call transcripts"
}