{
  "companyName": "Zenvia Inc.",
  "companyTicker": "ZENV",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/zenvia-inc-zenv-q2-2022-earnings-call-transcript/",
  "content": "Zenvia Inc. (ZENV)\nQ2 2022 Earnings Call\nAug 16, 2022, 10:00 a.m. ET\n\nCassio Bobsin\n\nHello, everyone, and welcome to Zenvia's Q2 '22 earnings call. I'm Cassio Bobsin, founder and CEO. Today, we're going to present the key highlights of our second quarter results, demonstrating that we are on track to deliver guidance for the year. Let's start with Slide 4.\n\nDuring our investor day at the end of July, we disclosed to the market how we unified our portfolio of customer experience solutions after accelerating R&D investments and concluding all planned acquisitions in this first year as a public company. We're now able to provide a complete end-to-end customer experience journey to support the companies to attract leads, convert into customers, service them when needed and guarantee a successful relationship. Zenvia Attraction, former Zenvia Campaign, is our SaaS solution that allows companies to create valuable communication campaigns for their prospects and customers in an easy, connected, and fast way by using data intelligence and automation across multiple channels. It allows companies to communicate with customers at the right time with the right channel.\n\nCompanies using this solution can segment their campaign by audience, profile or behavior, managing and enriching their contact base with data captured from multiple sources. Zenvia Conversion comes from Sirena, is our SaaS solution that allows companies to improve sales through intelligent and multichannel conversations while ensuring better performance of the sales team through data and integrations. For example, companies can optimize their entire sales process by starting with lead generation from digital ads, then all the way through the lead qualification process, sales engagement, sales closing, and even payment collection along the same conversation with the customer. Zenvia Service comes from Movidesk, is our SaaS solution that enables companies to provide amazing customer service with the structured support across multiple channels.\n\nIt is deployed to ensure a consistent experience for a long-term relationship while improving team performance and efficiency. As an example, companies can manage performance with several KPIs, establish multiple customized service-level agreements, control tickets across internal teams, and much more. Zenvia Success, which comes from SenseData, is our SaaS solution for the customer success phase, enabling companies to continuously engage customers based on their individual context, promoting healthy and long lasting relationships. With this solution, companies can connect to multiple data sources to create a 360 degree understanding of their customers, including customized KPIs and behavior tagging, so actionable insights are generated and transformed into proactive and highly contextualized customer interactions.\n\nLet's move to slide 5, where you can understand exactly how our platform is structured. In addition to the solutions I have presented, our platform also provides CX Tools that companies can use to integrate and automate their customer experiences in various ways. Our main tools are APIs, Bots, NLU, and Docs. We're building a new world where experiences become more personal, engaging, and fluid for all humans.\n\nOur platform enables companies to break down the barriers that exist in customer experiences today. Quantum is the essence of our platform. It connects all of our solutions and tools with the company's systems and processes. Quantum remembers your name, your latest interaction, and even your sentiment toward brands at any point of the journey.\n\nIt consists of four core components. Quantum Connect enables companies to bring customer data and events from other software into our platform, allowing highly contextualized interactions. For example, when a customer enters a physical store and buys a product, it is possible to immediately communicate with the customer by reading the data from the back systems with Zenvia Connect. Quantum CDP, our customer data platform, stores end customer information from either the platform itself or from Quantum Connect, and assists in enriching both automated and human-based interactions according to the customer history with the company.\n\nWith Quantum CDP, a company can define the best channel to impact an end-customer by accessing this end-customer's previous behavior in terms of communication channels. Quantum Abstraction enables communication with customers through various channels in a simple way, streamlining processes and enabling the end-customer to switch channels while keeping the conversation going. For example, the end customer can start a conversation for support on Instagram, and on the next day, continue it on WhatsApp. And finally, Quantum Cognitive automates predictive data analysis to unlock value from customer relationships based on their behavior, conversations, and transactions, enabling highly contextualized and proactive experiences.\n\nFor example, by analyzing the profile of a particular end customer, we can identify that they always buy a certain product during a certain period, but this period is about to end and the end customer has not made the purchase yet. Maybe we can trigger a reminder for them or create a promotional campaign. This is how our platform connects all the dots along the customer journey, providing multiple ways for companies to create unique experiences that are more personal, engaging, and fluid. Companies can start working with us by subscribing to any solution or tool, and as they go deeper into adopting multiple parts of the platform, we can break down all CX barriers and unlock the true potential for end customers.\n\nFor you to see how all this really works, we prepared a short video that presents the journey of a fictitious end-customer, Johnny. We call it Johnny's Journey. Right after the video, Shay will discuss our key financial metrics in more detail. And I will be back after that for the Q&A.[Commercial break]\n\nShay Chor -- Investor Relations\n\nHello, everyone, and thank you for being with us today. I've got to say, I love this video. The first time I saw Johnny's Journey was back in December '21. At that point, I was with Zenvia for less than three months.\n\nAnd that was the moment when I understood what we do and where we are going. So I hope this video was enlightening to you as it was for me a couple of months ago. Now, before I jump specifically into Q2 numbers, I would like to highlight that this is the fourth quarterly earnings we publish post our IPO. So it's important for us to emphasize the improved results quarter after quarter after quarter reflects how the proceeds from our IPO were critically allocated to M&A and R&D, which puts us exactly where we planned to be, contributing to our accelerated transformation into a SaaS company.\n\nThat's what this snapshot of our Q2 and first half '22 numbers show. It has been a strong quarter both in terms of organic growth and acquisitions integration into our results. These numbers have already consolidated two months of Movidesk since the transaction closed in May. We recorded 204 million reais in revenue for Q2, an increase of 50% YoY due to a solid client base expansion of 37% and the consolidation of Movidesk over the past two months.\n\nThe growth in the first half was even better, with a 55% YoY increase, totaling 402 million reais in revenues. Of this total, 70 million came from the three recently acquired companies. The acceleration of our transformation into a SaaS company is also already positively impacting our margins. The gross margin for Q2 stood at almost 38%, a solid increase of 5 percentage points from Q2 '21, while for the first half, the gross margin was 35.8%, up 5.6 percentage points from the year before.\n\nAs you will see further in the slides, these numbers are all within the guidance range for the year. As of Q2, we are starting to report results under a new breakdown, one that is more aligned with our decision-making process and will make it easier for you to understand what we do and where we are going. The format change is also driven by the announcement we made in mid-June on the evolution of our business areas, CPaaS and SaaS. While the CPaaS business still generates 71% of our revenues, over half of our gross profit is already coming from SaaS, which actually makes us a SaaS Company.\n\nSo let's take a deeper dive into our SaaS numbers. Revenues originated from our SaaS business, which is now headed by Raphael Godoy, our former CMO, totaled 115 million reais, with a monthly revenue recurrence of over 80%. This means that we are talking about an annual recurring revenue of this business, including full consolidation of Movidesk at almost 230 million reais as of June and almost 280 million reais as of December 2022. We currently serve over 6,500 SaaS customers, generating an adjusted gross margin of 66.5%.\n\nOther important metrics are the NRE of 120% and a CAC Payback of approximately 11 months. Keep in mind, that these numbers are just a fraction of the Total Addressable Market for SaaS services in Latin America, which is expected to reach 29 billion reais by 2026, according to IDC. Out of this. almost 30 billion reais is TAM, 60% is white space.\n\nAnd we have jumped from zero to slightly over 2% market share in just one year. So there is a huge opportunity for us to continue growing our SaaS revenues at the 50% level we have been growing, bringing Zenvia to another level of size and profitability. Our CPaaS business, now headed by the CRO, Cris Franco, is also very healthy and continues to expand. Although the future growth of the company will be coming mostly from our SaaS business, there is value in our CPaaS business that cannot be ignored.\n\nFor 2022, this business is expected to reach around 600 million in revenues, with a gross margin of approximately 23%, generated by almost 9,000 clients. CPaaS is a fast growing market in Latin America, which is expected to multiply by 3.5 times in the next five years, from a total market size of 3.5 billion reais to nearly 19 billion reais according to IDC. Moving on to Slide 11, you can see that in this quarter, half of the growth came organically, and the other half from acquisitions. These results fully consolidate D1 and SenseData, and consider only two months of Movidesk.\n\nTogether, the three companies contributed approximately 70 million reais to our consolidated net revenues, while the organic growth brought 73 million reais. This combination of solid organic growth with M&A positively impacted our adjusted gross margin, which went up almost 6 percentage points to reach 35.8% in the first half. And in the second quarter, our margin has already reached 38%. All these metrics are within the guidance range for the full year, as we can see in the next slide.\n\nOur total revenue growth and adjusted gross margin for the 6 months of the year are both within the guidance range. For the second half of the year, we expect to continue to focus on integrating our M&As and improving profitability, as we add a full 6 months of Movidesk gross margins into our numbers. We expect to generate positive EBITDA during the second half of the year, while our operating cash flow should already be at break even in the next 6 months. Finally, I would like to say that we know that funding gap is a concern.\n\nWhile this issue does not prevent us from sleeping, we do not live in denial. We have been working on several different alternatives and we expect to be able to announce something to you in the coming months. With this in mind, we can now move to the Q&A session.\n\nOperator\n\n[Operator instructions] Our first question comes from Lucas Chaves, sell-side analyst, UBS. Please, Lucas, you may go ahead with your question.\n\nLucas Chaves -- UBS -- Analyst\n\nSo hi, guys and thank you for having my question. SO how you're seeing the organic growth in client terms? And could you provide more information on the integration of Movidesk clients, please? And if I am allowed a second question and in line with the first, how was the price dynamics in this quarter? Thank you.\n\nShay Chor -- Investor Relations\n\nThanks, Lucas, for your question. So I'll start on a more quantitative view and Cassio, you can add from a qualitative view and how competitive dynamics are especially on the CPaaS business. As you know, we've been focusing our results and our operations on profitability. And specifically, this year, what we've done in first half and the second half of this year -- in this first quarter and second quarter of this year was to pass on to prices the higher cost that the telco operators are charging us.\n\nSo we did have an impact, especially in Q2. We lost approximately 500 clients on the CPaaS business. And that's related, as I mentioned, to profitability. The flip side of it is that we're still growing our business organically about 30% a year in terms of revenues.\n\nAnd the positive, obviously, is that gross profit expanded more than expected. It was a good quarter even in terms of EBITDA, when we clean out one-offs from EBITDA, we generated and EBITDA, there was negative only 2 million reais, so practically breakeven. And we're already running when we look into the second half of this year as we've been guiding that we're already running with a positive EBITDA margin. So it has an impact when we pass on to prices.\n\nBut we've decided that at this moment with all the difficulties that tech companies are having in terms of funding, we decided that we need to focus on profitability. Cassio, I think, you can go ahead on a -- with a more qualitatively.\n\nCassio Bobsin\n\nYeah. In terms of small customers, I mean, very, very small customers. We do have some that are more transactional prepaid that don't create lots of value for the long run. So we're focusing on customers that we can upsell and cross-sell continuously.\n\nThus, the amount of customers can vary depending on how we are focusing more on recurrent than transactional customers. So that's what we've been doing. And looking from up I guess about Movidesk, right? So we're already working together with Movidesk integration as being part of a Zenvia portfolio, that's why we rebranded it for Zenvia Service, and we are generating customers from both ways, both customers coming from Movidesk and getting other products from Zenvia and the other way around as well. So they're doing pretty well in that sense even though was pretty very -- weeks of integration going on.\n\nThat's why we have a very interesting perspective looking forward to the end of the year and 2023 in terms of combined growth of all the SaaS solutions.\n\nLucas Chaves -- UBS -- Analyst\n\nThank you. That was very clear. Thank you. \n\nShay Chor -- Investor Relations\n\nAnd I think you had also a question Lucas on Movidesk integration, right? Cassio, if you want to...\n\nCassio Bobsin\n\nYes, that's what announced integration coming in terms of client generation from both ways.\n\nOperator\n\nOur next question comes from Diego Aragao, sell-side analyst for Goldman Sachs. Please, Diego, you may go ahead with your question.\n\nDiego Aragao -- Goldman Sachs -- Analyst\n\nYes. Good morning, guys. Thanks for taking my question. I guess the first question, I just wanted to understand the organic growth in the second quarter, especially because if I'm not mistaken here, it seems that you have like a massive deceleration in the quarter relative to the first quarter.\n\nSo if you don't mind just commenting on that, that would be great.\n\nShay Chor -- Investor Relations\n\nThanks, Diego, and you're right, the organic growth decelerated in Q2 versus Q1. And the main reason, as we mentioned, is that we decided to take a more conservative stance and generate more gross profit, gross margin and more EBITDA. So you're right, it has decelerated. It will depend on how the competitive dynamics go -- moves forward.\n\nWe reiterated our guidance. We continue to expect organic growth to be slightly above 30% for full year. But that will depend ultimately on the competitive dynamics going forward. And obviously, we can move prices up and down depending on how aggressive we want to be in terms of revenues.\n\nBut again, as of now, it's important for us to emphasize that while we continue to see total revenue growth still at about 50% a year, we decided that, that we need to focus on profitability and generating cash flow rather than simply growing. So if we need to decelerate slightly in terms of organic growth and total growth that will be done as long as it generates more EBITDA. By the end of the day, we are focusing on generating cash flow and EBITDA rather than focusing on revenue, especially because, as you know better than we do, investors are not paying any more an EV to sales. They are paying on EV to EBITDA, if not EV to or PE, sorry.\n\nSo that's why we decided that it's more important for us to generate gross profit and EBITDA than to focus solely on revenue growth.\n\nDiego Aragao -- Goldman Sachs -- Analyst\n\nUnderstood, Shay. Thank you. Thank you. I really appreciate your transparency here.\n\nSo look, the second question is related to your balance sheet. I mean you mentioned in the call that you are trying to find some options from here, but you have roughly 380 million in debt, almost 200 million reais in current liabilities related to acquisitions and that. So can you just comment on the options you are considering from here? And also, if you can just provide like the reason to revise down the earnouts related to Movidesk because we saw in the filings that the number expected right now, it's a little bit lower than what we saw last quarter. Thank you. \n\nShay Chor -- Investor Relations\n\nOK. So let me start with that now. So those things are very fluid, right? So obviously, we track on a quarterly basis how the business are doing and we do adjustments. There was a reason, for instance, if you look at our reported EBITDA of minus for the first half of minus 22 million reais versus the 9 million that we say it's the underlying recurring EBITDA for the first half, that has to do with the fact that we need to do adjustments in the earnout.\n\nSo for instance, in the second quarter, we booked an adjustment of almost 10 million reais for SenseData and 4 million reais for Sirena because they delivered more than we -- they were delivering up to that point. So we need to do adjustments. And from an accounting perspective, all those adjustments, they do impact EBITDA. So that's very fluid, and it goes up and down depending on how the companies are running versus the business plan.\n\nAs to the funding gap, we are discussing several different alternatives from debt to equity instruments. So all of them are available to us. We've been discussing what's the most interesting for us in terms of cost, what generates more value for all the stakeholders. So it's a complex negotiation with several moving parts.\n\nAnd as I mentioned, I believe that we are close to be able to announce some of those instruments working. And unfortunately, at this point, Diego, we cannot discuss specifically as you can imagine. But we are confident in the next couple of months, we'll be able to announce. And I think that the funding gap will be an issue that is behind us in a couple of months.\n\nSo there is a question here on the web. On the cash flow side, it looks like we generated 21 million reais in positive operating cash flow due to prepayment and supplies. Could you elaborate a bit more on this? So yes, we did generate a decent operating free cash flow. It has to do with some of working capital tools that we have.\n\nFor instance, client prepayment with no cost so anticipation at zero cost, some negotiations with suppliers to pay longer. So basically, improvement of the -- both improvement of DSO and improvement of DPO practically with no cost. And those two will continue to be used as we focus now more on cash flow. We'll continue to use all tools available to us to improve our working capital.\n\nThis business is not a business that has a lot of working capital requirements. Actually, we get paid by our clients faster than we pay our suppliers, but it doesn't mean that we cannot continue pursuing to improve working capital. So we've been focusing on all tools available to us to generate more cash.\n\nOperator\n\n[Operator instructions]\n\nShay Chor -- Investor Relations\n\nI have a question, another question here on the -- from the web. So on the margin side, does your full year '22 guidance imply a margin contraction in the second half? It does not. In the first half of the year, we delivered a gross profit of 35.8% accumulated. And we do have a guidance for the year between 35% and 36%.\n\nSo as we reiterated this guidance, the second half gross margin should be pretty much in line with the first half gross margin.\n\nCassio Bobsin\n\nIf I can add, Shay, here, it's also because and in fact of revenue mix, we still expect growth of our margins. But as we go, we have the fourth quarter as if I have a natural seasonality due to Black Friday and also Christmas, we expect to have revenue, the CPaaS revenue represents a little bit more than when we compare to the first half of the year. So due to this revenue mix, you may seem that, OK, if you're delivering a bit more high here and you expect to start to grow faster, yes, that's all true, but we have a revenue mix between half -- first half of the second half and surpass due to natural seasonality.\n\nShay Chor -- Investor Relations\n\nAnother one from the web. On your new positioning, can you tell us how was that received by clients? Do you have early stages evidence of how things are going? I think Cassio, can you go ahead on this one?\n\nCassio Bobsin\n\nYeah, sure. We're getting lots of feedback from customers that they are getting to know all of our products now that it's easier for them to understand how they can apply the real businesses. So we're starting to get cross-sell opportunities because it became easier to understand what each product is aimed for in terms of processes. It's a bit early to get that quantified, but we do see that happening with customers when we are engaging with them.\n\nWe're also structuring better ways for customers as they enter our sales process to be clearly identified in their needs, so they can be -- start using the best products for them. We're doing that with both former systems and also the new acquired companies that are also part of this portfolio. That's what I answered in the former question about Movidesk and also SenseData now being labeled as Zenvia Service and Zenvia Success. So we're getting these better understanding of the portfolio working not just on cross-sell, but also in customer acquisition and we expect them in the following quarters to have that quantified.\n\nOf course, it's not that easy to try to understand if that's exactly the reason why we are seeing those moving in terms of customer acquisition in cross-sell, but we are seeing that happening. So we expect to see positive results of that unification of our portfolio position.\n\nShay Chor -- Investor Relations\n\nAs a follow-up to that, there's another one here on the web. Can you comment on the specific competitive dynamics on the SaaS and if you're seeing any of the global players playing differently more aggressive or not versus your new position?\n\nCassio Bobsin\n\nYeah, in terms of SaaS competition, we do have two kinds of competitors. We have global players and we have a small niche players. We see that global players, they tend to move pretty slow in terms of adjusting their offerings for specific parts of the world, which gives us a very interesting dynamics of becoming more present in the markets that were solely being served by global players, and now we're entering those markets and getting pretty interesting to get some big customers using our SaaS systems. So it's doing pretty well in that sense.\n\nLooking at SMBs, it's a pretty open space. Most of these customers are still a very simple digital solutions, meaning mail plus website kind of dynamics. And then we bring all of these structured solutions that can leverage different ways for them to sell more and to serve better their customers. They see that value and they start using that kind of solution.\n\nSo we're pretty much opening up the market for SMBs across the region. And we don't see a very strong competition from the small niche players on the much respective market.\n\nOperator\n\n[Operator instructions] This conclude our question-and-answer session. I'd like to turn the conference back over to Mr. Cassio Bobsin for his closing remarks.\n\nCassio Bobsin\n\nWell, thank you very much all for spending the time here to get to see with the evolution of the business. We're very optimistic about everything that we've been delivering in this first year as a public company. We're doing pretty well in terms of growth, in terms of market expansion and portfolio now being unified combining both R&D initiatives and M&A operations that we did over the last couple of months. So all of these have been combined to create a very strong and competitive platform for customer experiences and the way we're seeing that companies are transforming their customer journeys using digital, and we are making that transition happen.\n\nSo thank you very much for your time and see you in the next release. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCassio Bobsin\n\nShay Chor -- Investor Relations\n\nLucas Chaves -- UBS -- Analyst\n\nDiego Aragao -- Goldman Sachs -- Analyst\n\nMore ZENV analysis\n\nAll earnings call transcripts"
}