{
  "companyName": "Citigroup",
  "companyTicker": "C",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/14/citigroup-c-q3-2022-earnings-call-transcript/",
  "content": "Citigroup (C 0.15%)\nQ3 2022 Earnings Call\nOct 14, 2022, 11:00 a.m. ET\n\nOperator\n\nHello, and welcome to Citi's third quarter 2022 earnings call with the chief executive officer, Jane Fraser; and chief financial officer, Mark Mason; today's call will be hosted by Jen Landis, head of Citi investor relations. [Operator instructions] Also as a reminder, this call is being recorded today. [Operator instructions] Ms. Landis, you may begin.\n\nJen Landis -- Head of Investor Relations\n\nThank you, operator. Good morning, and thank you all for joining us. I'd like to remind you that today's presentation, which is available for download on our website, citigroup.com may contain forward-looking statements, which are based on management's current expectations and are subject to uncertainty and changes in circumstances. Actual results may differ materially from these statements due to a variety of factors, including those described in our SEC filings.\n\nWith that, I'll turn it over to Jane.\n\nJane Fraser -- Chief Executive Officer\n\nThank you, Jen, and thanks, everyone, for joining us today. Well, we are certainly still living through interesting times. And overall, I am pleased with how our bank is navigating through them. As you'll hear from me shortly, we continue to focus intensely on executing our strategy and our transformation as we outlined at Investor Day, while supporting our clients in this complex environment.\n\nSo before I get into the quarter, let me highlight some observations about what we see going on around the world, given our unique vantage point. The global macro outlook that we shared with you over the last couple of quarters has been borne out. There is accumulating evidence of slowing global growth, and we now expect to experience rolling country-level recession starting this quarter. The severity and timing of these recessions depend where in the world you are.\n\nAlthough persistently high inflation is driving a global softening of consumer demand for goods. In the Eurozone in the U.K., the supply shocks are most severe. Growth prospects have deteriorated sharply, and headline inflation is running at nearly 10%. All eyes are on this winter's weather forecast and the energy supply.\n\nThe U.S. economy, however, remains relatively resilient. So while we are seeing signs of economic slowing, consumers and corporates remain healthy as our very low net credit losses demonstrate. Supply chain constraints easing, the labor market remains strong.\n\nSo it is all a question of what it takes to truly take persistently high core inflation. Now history would suggest that, that will be quite a lot and for some time. Therefore, we could well see a mild recession in the second half of '23. We believe the U.S.\n\neconomy is well-positioned to expand it all else being equal in the geopolitical arena, that is. Finally, in Asia, we continue to be concerned with China's COVID lockdowns, which took a bigger bite out of economic activity than I anticipated, exacerbated by a lack of intensified macro stimulus. It is geopolitical risks and rates that dominate discussions with our corporate clients worldwide. And I'd say we're more focused on market liquidity generally and counter party risk than our credit risk in the near term.\n\nNonetheless, we are planning conservatively, and we are prepared for all environments. Against this backdrop, today, we reported net income of $3.5 billion, EPS $1.63, and an ROTCE of 8.2%. We grew revenues by 6%, including a gain on sale of our consumer business in the Philippines. While we had excellent performance in some areas, our results could have been better in a few others.\n\nServices delivered another very strong quarter. TTS saw revenues up 40% year over year with growth in each business and in fees. Key drivers of our strategy such as wallet share, trade loan originations, and cross-border transactions are all trending strongly in the right direction and are ahead of our plan. Security Services was up 15% and despite assets under custody being impacted by the declines in equity markets.\n\nWe have onboarded over $1 trillion in AUC and AUA since the beginning of the year and we're seeing good momentum in issuer services, in particular. Markets, on the other hand, came in lower with revenues down 7%. In fixed income, we matched last year's particularly good showing through our long-standing strength in FX, offsetting a weaker quarter in spread products. In equities, reduced activity in derivatives, which is a core part of our platform, led to lower revenues compared to last year's exceptional performance.\n\nAnd we continued to optimize RWA in market consistent with our strategy. Banking, with the business most adversely impacted by the macro environment across the industry with geopolitics and fears of recession significantly reducing deal flows and the appetite for M&A. We continue to invest in building out our teams for long-term growth opportunities, including healthcare, technology, and energy. And I'm really pleased with the high-caliber bankers who are attracted to both our platform and our culture.\n\nThe environment for wealth management continued to be less than ideal our revenues were down only slightly and meaningfully up outside of Asia. Our strategy to capture the synergies with our businesses, such as the wealth referral initiatives between commercial banking, retail banking, and investment banking is progressing well. We also continue to steadily attract new clients and increase the ranks of our client advisors, as you will see in our KPIs. Nonetheless, we are slowing the pace of some of the investments in this business given the environment.\n\nU.S. personal banking further solidified its growth trajectory, card sales, ANR, interest-earning balances, and customer acquisition all saw good growth and we continued to increase digital uptake. Retail Services joined branded cards and having double-digit revenue growth this quarter. Retail banking also grew contributing to a 10% overall revenue increase for the business.\n\nAs you can see in the presentation, our cost of credit reflects the quality of our loan portfolio in both ICG and PBWM. There were effectively no credit losses in ICG, and U.S. consumer NCLs remain well below the pre-COVID levels. Consumer loan growth together with the worsening of our macroeconomic assumptions drove a modest ACL build this quarter.\n\nWhile our expenses are elevated as we continue to invest in our businesses, and in our transformation, we are managing them closely, and we remain on track to meet the full year guidance. As you know, the transformation is a multiyear effort, and we're committed to meeting the expectations of our regulators given the paramount importance of safety and soundness. We continue to be in constructive dialogues with them and are updating our execution plans as appropriate. Stepping back, I'm generally pleased with the advances we're making in the key drivers of the strategy we laid out for you in March and these are laid out on Page 3.\n\nWe're seeing good momentum in realizing client synergies and in attracting talent to grow the franchise. In terms of simplification, we continue to make progress on the divestitures of our international consumer businesses and the elimination of their associated stranded costs. We closed the sale of the Philippines during the third quarter and are on track to close Bahrain, Malaysia, and Thailand during the fourth quarter. We also announced the wind down of our consumer franchise in the U.K.\n\nto focus fully on the wealth franchise there. I would also note, we're ahead of our plan in our Korean consumer wind down. We continued to shrink our operations in and exposure to Russia. To be clear, our intention is to wind down our presence in that country.\n\nIn August, we announced the wind down of our consumer and local commercial banking businesses. While we have been supporting our multinational clients in Russia, we are now informing them that we will be ending nearly all of the institutional banking services we offer by the end of the first quarter of next year. At that point, our only operations in Russia will be those necessary to fulfill our remaining legal and regulatory obligations. Turning to capital.\n\nWe returned $1 billion to our shareholders through common dividends during the quarter. while buybacks continue to be on hold. We will keep evaluating that decision on a quarterly basis as due to increasing regulatory requirements, we build our CET1 ratio to 13% or so by mid-next year, and that includes a management buffer of 100 basis points. We ended the quarter at a CET1 ratio of 12.2% as we actively managed our RWA usage throughout our lines of business.\n\nLastly, our tangible book value per share increased to $80.34. So the bottom line is that while the environment is a challenging one, and we expect it will remain so we continue to focus relentlessly on executing the strategy we presented to you at our Investor Day and on making steady progress. Now I'd like to turn it over to Mark and then we'd be delighted, as always, to take your questions.\n\nMark Mason -- Chief Financial Officer\n\nThank you, Jane, and good morning, everyone. I'm going to start with the firmwide financial results, focusing on year-over-year comparisons for the third quarter, unless I indicate otherwise, and spend a little more time on expenses, credit, and capital. Then I will turn to the results of each segment and end with full year 2022 guidance. On Slide 4, we show financial results for the full firm.\n\nIn the third quarter, we reported net income of $3.5 billion and EPS of $1.63, with an ROTCE of 8.2% on $18.5 billion of revenues. Embedded in these results are pre-tax divestiture-related impacts of approximately $520 million, largely driven by a gain on the sale of the Philippines consumer business. Excluding divestiture-related impacts, EPS and ROTCE would have been $1.50 and 7.5%, respectively. In the quarter, total revenues increased 6% on a reported basis.\n\nExcluding divestiture-related impacts, revenues were down 1% as growth in net interest income was more than offset by lower noninterest revenues. Net interest income grew 18%, driven by the impact of higher interest rates across the firm and strong loan growth in PBWM. Noninterest revenues were down 12% on a reported basis and 28% excluding divestiture-related impacts, largely reflecting declines in investment banking, markets, and investment revenues in well. Total expenses of $12.7 billion increased 8% and 7%, excluding divestiture-related impacts, largely driven by transformation inflation and other risk and control initiatives.\n\nCost of credit was $1.4 billion, driven by net credit losses of approximately $900 million and an ACL build of approximately $500 million primarily driven by loan growth in PBWM. At the end of the quarter, we had $18.7 billion in total reserves with a reserve to funded loan ratio of approximately 2.5%. On Slide 5, we show net interest income, loans, and deposits. In the third quarter, total net interest income increased by approximately $600 million on a sequential basis and approximately $1.9 billion on a year-over-year basis across the firm, driven by higher interest rates, management of deposit repricing, and loan growth in PBWM.\n\nAverage loans were down by approximately 2%, largely driven by the impact of foreign exchange translation and lower balances in legacy franchises. Excluding FX, loans were largely flat. And average deposits were down by approximately 2%, largely driven by declines in legacy franchises and the impact of foreign exchange translation, partially offset by the issuance of institutional CDs as we continue to diversify the funding profile of the bank. Excluding FX, deposits were up roughly 1%.\n\nAnd sequentially, our net interest margin increased by seven basis points. On Slide 6, we show an expense walk for the third quarter with the key underlying drivers. As I mentioned earlier, expenses increased by 8% and 7%, excluding the impact of divestitures. 2% of the increase was driven by transformation investments with about two-thirds related to the risk controls, data, and finance programs, and approximately 25% of the investments in those programs are related to technology.\n\nAs of today, we have over 10,000 people dedicated to the transformation. About 1% of the expense increase was driven by business-led investments as we continue to hire commercial and investment bankers as well as client advisors in wealth, and we continue to invest in the client experience as well as front-office onboarding and platforms. 1% was due to higher volume-related expenses across both PBWM and ICG and approximately 3% was driven by other risk and control investments and inflation, partially offset by productivity savings and the impact of foreign exchange translation. Across all these buckets, we continue to invest in technology, including systems and hiring people, resulting in our technology-related spend of approximately 16% for the quarter.\n\nOn Slide 7, we show key consumer and corporate credit metrics. Over the last several years, we have been disciplined with our loan growth and consistent with our risk appetite framework. This framework includes credit risk limits that consider concentrations, including country, industry, credit rating, and in the case of consumer FICO scores. And importantly, these limits apply across the firm in aggregate and we continuously analyze our portfolios and concentrations under a range of stress scenarios.\n\nAs a result, we feel very good about our asset quality and reserve levels. As I mentioned earlier, our reserves to funded loan ratio was approximately 2.5%. And within that, PBWM and U.S. cards is 3.7% and 7.5%, respectively, both right around day one CECL levels.\n\nIn PBWM, the majority of our card portfolios skew toward higher FICO customers. And while we have started to see signs of normalization in both portfolios, NCL rates continue to be less than half of pre-COVID levels. In our ICG portfolio, of our total exposure, over 80% is investment grade and nonaccrual loans remain low and are in line with pre-pandemic levels at about 40 basis points of total loans. So we are well reserved for a variety of scenarios, and we continuously evaluate our scenarios to reflect the evolving macro environment.\n\nOn Slide 8, we show our summary balance sheet and key capital and liquidity metrics. We maintained a very strong balance sheet of our $2.4 trillion of assets about 23% or $557 billion are high-quality liquid assets, or HQLA, and we maintained total liquidity resources of approximately $967 billion. The combination of earnings generation, capital from exits, and RWA optimization drove our CET1 ratio up by about 25 basis points to approximately 12.2% on a standardized basis, which remains our binding constraint. And our tangible book value per share was $80.34, up 2% from a year ago.\n\nOn Slide 9, we show a sequential CET1 walk to provide more detail on the drivers this quarter and our target over the next few quarters. First, we generated $3.2 billion of net income to common which added 27 basis points. Second, we returned $1 billion in the form of common dividends, which drove a reduction of about eight basis points. Third, the interest rate impact on AOCI through our AFS investment portfolio drove a five basis point reduction.\n\nFourth, changes in the DTA drove a three-basis point reduction. And finally, the remaining 14 basis point increase was largely driven by net RWA optimization. In light of our increasing regulatory capital requirement, we ended the quarter with a 12.2% CET1 ratio 25 basis points higher than last quarter. Importantly, 12.2% is above our current regulatory requirement of 11.5% as of October 1st and above 12%, which will be our regulatory requirement as of January 1st of next year.\n\nAs we said last quarter, we continue to gradually build to a CET1 target of approximately 13% by midyear 2023, which includes the current 4% SCB and a 100 basis point management buffer. On Slide 10, we show the results for our Institutional Clients Group, revenues were down 5% as strong growth in services was more than offset by lower revenues across markets and banking. Expenses increased 10% driven by transformation business-led investments and volume-related expenses, partially offset by productivity and foreign exchange translation. Foster Credit was driven by a reserve build of $86 million.\n\nWhile deterioration in certain macro variables did lead to a build, it was mostly offset by the release of a COVID-19 related uncertainty reserve and a release related to direct exposures in Russia. This resulted in net income of approximately $2.2 billion, down 30%. Average loans were up 1%, driven by 9% growth in TTS loans, partially offset by the impact of foreign exchange translation. Average deposits were down 2%, also largely driven by foreign exchange translation.\n\nAnd ICG delivered an ROTCE of 9%. On Slide 11, we show revenue performance by business and the key drivers we laid out at Investor Day, which we will show you each quarter. In services, we continue to see a very strong new client pipeline and deepening with our existing clients and expect that momentum to continue. In Treasury and Trade Solutions, revenues were up 40% and driven by 61% growth in net interest income as well as 8% growth in NIR across all client segments.\n\nWe continue to see healthy underlying drivers in TTS and that indicate consistently strong client activity with U.S. dollar clearing volumes up 2%, cross-border flows up 10%; commercial card volumes up roughly 50%, and average loans up 9%. So while the rate environment drove about 40% of the growth this quarter, business actions drove the remaining 60%. This includes continuing to manage deposit repricing and deepening with existing clients and significant new client wins across all client segments.\n\nThrough the first half of the year, based on the industry data that we see, we estimate that we gained over 60 basis points of share with large corporate clients and client wins are up approximately 20% across all segments, including wins with financial institutions which are up almost 50%. These include marquee transactions where we are serving as the client's primary operating bank. In addition, which allows clients to connect their liquidity and funding to their operating flows days a week. In Securities Services, revenues grew 15% as net interest income grew 73%, driven by higher interest rates across currencies, partly offset by a 6% decrease in noninterest revenue due to the impact of market valuations.\n\nWe continue to be pleased with the execution in Security Services as we onboarded approximately $1 trillion of assets under custody and administration so far this year from significant client wins, and we feel very good about the pipeline of new deals. And we estimate that we have gained about 60 basis points of share in security services through the first half of this year, including in our home market. As a reminder, the services businesses are central to our strategy and our two of our higher-returning businesses with strong linkages across the firm. Markets revenues were down 7%, largely driven by spread products, equities, and RWA actions as we continue to focus on returns.\n\nFixed Income Markets revenues were up 1% and as strength in rates and FX was largely offset by continued headwinds in spread products. And through the first half of the year, we gained approximately 40 basis points of share. Equity markets revenues were down 25%, primarily reflecting reduced client activity in equity derivatives relative to a very strong quarter last year. The actions we took to optimize RWA in markets are in line with the strategy we discussed at Investor Day, and we are making solid progress on our revenue to RWA targets so far this year.\n\nAnd finally, banking revenues, excluding gains and losses on loan hedges, were down 49%, driven by investment banking as heightened macro uncertainty and volatility continue to impact client activity. Also embedded in the results is an impact of approximately $110 million related to marks on loan commitments and losses on loan sales. So overall, while the market environment remains challenging, we feel good about the progress we are making as we continue to deepen existing client relationships as well as acquire new clients. Now turning to Slide 12.\n\nWe show the results for our personal banking and wealth management business. Revenues were up 6% as net interest income grow was partially offset by a decline in noninterest revenue driven by lower investment fee revenue in wealth and higher partner payments in retail services. Expenses were up 13%, driven by transformation, other risk and control initiatives business-led investments and volume-driven expenses, partially offset by productivity savings. Cost of credit was $1.1 billion which included a reserve build primarily driven by card volume growth.\n\nNCLs were 13% higher year over year from near historically low levels, reflecting normalization, particularly in retail services. Overall, we continue to see strong credit performance across portfolios. Average loans grew 5%, driven by strong growth across branded cards, retail services and retail banking. Average deposits grew 1%, driven by growth across retail and wealth, partially offset by foreign exchange translation.\n\nPBWM delivered an ROTCE of 9.7%. On Slide 13, we show PBWM revenues by product as well as key business drivers and metrics. Branded cards revenues were up 10%, driven by higher net interest income. We continue to see strong underlying drivers with new account acquisitions up 10%, card spend volumes up 14% and average loans up 12%.\n\nRetail services revenues were up 12%, also driven by higher net interest income, partially offset by higher partner payments. So despite payment rates remaining elevated, the investments we've been making contributed to growth in interest-earning balances of 9% in branded cards and 7% in retail services, and we expect to continue to grow these balances in the fourth quarter. Retail banking revenues were up 2%, primarily driven by interest rates and deposit growth. Wealth revenues were down 2% as investment fee headwinds and particularly in Asia, more than offset net interest income growth.\n\nExcluding Asia, revenues were up 4%. Client advisors were up 5%, and we are seeing net new investment inflows and strong new client acquisitions across our wealth business with new clients in ultra-high net worth and wealth work of 7% and 27%, respectively, for the quarter. And we're also leveraging our retail network, which has driven almost 50,000 wealth referrals so far this year. While the environment continues to remain challenging, we are seeing strong underlying business drivers as we execute against our strategy.\n\nOn Slide 14, we show results for legacy franchise. Revenues increased 66%, primarily driven by the Philippines gain on sale in the quarter and the absence of the Australia loss on sale in the prior-year period. Excluding these items, revenues were down about 12% and largely due to the loss of revenues from the Australia and Philippines closing as well as the impact of the Korea wind down. Expenses increased 6%, driven by divestiture impacts in Asia and Mexico.\n\nLoans and deposits decreased as a result of the reclassification of signed exits to other assets and other liabilities, the closing of the Philippine sale and the impact of the Korea wind down. On Slide 15, we show results for corporate/other. Revenues increased, largely driven by higher net revenue from the investment portfolio, partially offset by the mark-to-market on certain derivative transactions and expenses were down. On Slide 16, I'll briefly touch on our full year 2022 outlook.\n\nWith one quarter remaining in the year, we continue to expect full year revenues to be up in the low single-digit range. Excluding divestiture-related impacts. And within that, we continue to see a shift with higher net interest income, offset by lower noninterest revenue. So for the fourth quarter, we expect net interest income, excluding markets to be up in the range of $1.5 billion to $1.8 billion year over year.\n\nClearly, where we land within that range will be a function of a number of factors, including rates, loans and deposit volumes, deposit betas and currency impacts. Regarding full year expenses, we continue to expect expenses to grow by 7% to 8%, excluding divestiture-related impacts. In terms of cost of credit, it will be a function of the evolution of the macro environment, normalization that we continue to expect in the cards businesses and loan growth. And keep in mind that loan growth tends to be higher in the fourth quarter versus the third given typical holiday spending.\n\nBefore we move to Q&A, I'd like to end with a few key points. We continue to execute on the strategy that we laid out at Investor Day. We are seeing solid momentum in the underlying drivers of the majority of our businesses. And as we said at Investor Day, the financial path will not be linear, but we are confident we can achieve our medium-term targets in a variety of scenarios.\n\nAnd with that, Jane and I would be happy to take your questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question will come from Glenn Schorr with Evercore. Your line is now open.\n\nGlenn Schorr -- Evercore ISI -- Analyst\n\nHello. Thanks very much. So definitely a good performance rates help a ton, but I see loan growth and fees and I heard your comments about growth across all kind segments. I wonder if we could pull back the -- back in a drop and talk about those two in separate pieces.\n\nOne is 61% year-on-year NII, how do betas factor in and go forward over the next year in terms of higher rates and how that factors through? And then two, what specifically it's growing within TPS across those client segments to drive that high single-digit growth.\n\nMark Mason -- Chief Financial Officer\n\nGood morning, Glenn. Why don't I take that and kind of take it in two pieces, the two pieces that you laid out. So as you know, Glenn, when we think about our business just in aggregate, there's obviously a split between the institutional and the consumer side. Our TTS business, which is on the institutional side, and these corporate clients, they tend to have higher betas in general than obviously, the retail banking side.\n\nWhat we've seen is that the betas have been increasing. They are still running lower than what we had expected. But again, they have been increasing. And with continued expected rate increases, I would expect that those betas will continue to rise in the coming quarters.\n\nWe have been actively managing deposit pricing and repricing with our clients on an ongoing basis. You know that this is more than just a deposit-taking business. This is a business where we are looking to manage the operating accounts of our clients and bring the breadth of what we offer in our franchise to them. And so those -- that's the type of conversation we've been having with them, and we'll continue to do that with an eye toward growing the volume of deposits with both the existing as well as with new clients.\n\nAnd so we, again, expect to see betas rise but also expect to see continued contribution to the NII. The other aspect of your question is what else has been driving the activity I mentioned a couple of those things. So it's not just deepening with existing clients, but it's also onboarding new clients. We've seen cross-border transaction value up about 10%.\n\nThe commercial card spend is up meaningfully trade originations are up 27%. And so a lot of active engagement with our clients. We've been winning new mandates. We've seen an uptick in client wins of about 20% and we've been gaining share across those client segments.\n\nAnd so hopefully, that gives you a little bit of example of examples of where the benefits or momentum is coming from on the NIR side. The NIR growth of 8% is driven really by the cards, the payments and receivables as well as trade.\n\nJane Fraser -- Chief Executive Officer\n\nAnd I'd just jump in and say, I think there's a bit of a miss at the moment that the global environment is detrimental to activity. We see quite the opposite volatility is something in which we're very active in helping our multinational clients around the world manage the local footprint we have and the global network we have is a tremendous asset right now so we're seeing a lot of positive momentum, which may not always be intuitive to everyone, but I think it's what makes the network, the crown jewel of Citi.\n\nGlenn Schorr -- Evercore ISI -- Analyst\n\nNo doubt. I appreciate all that. A quick one on markets, not quite as good as the years, but that comes and goes. I know that's a function of last year was really strong.\n\nIt's a function of mix in any given quarter. What I really want to focus on is your comments on RWA optimization, what specifically are you doing? I know it's in the banking book, but I did see you taking down our capital call it redemption facility line. But in markets, what are you pulling back on RWA, just which pieces of that business be that interesting?\n\nMark Mason -- Chief Financial Officer\n\nSure. So, Glen, you'll remember at Investor Day, we talked not only about RWA optimization broadly, but specifically as it relates to markets. And we talked about the idea of increasing our revenue to RWA ratio for markets to about -- to about 5.5% over the course of that Investor Day period. So we've been actively working across the markets business in equities, in fixed income and spread products and looking for opportunities where there are low returning uses of RWA to either increase the returns on that or to actually kind of exit it.\n\nAnd that includes a host of different structures. It includes working with clients to post additional collateral in some instances and other types of structures like that, that improved the RWA, including hedging and like I said, posting collateral and taking a look at margin that we have and ensuring that we are, in fact, getting the most for that use of RWA.\n\nOperator\n\nThank you. Our next question will come from John McDaniel -- McDonald with Autonomous Research. Your line is now open.\n\nJohn McDonald -- Autonomous Research -- Analyst\n\nYes. Hi. Thanks for taking my question. Mark, I wanted to just clarify what I think the expense guide is for fourth quarter.\n\nIt seems like the guidance for the full year implies a fourth quarter step-up to maybe 12.8% and change from 12, 7.5% this quarter. Is that the right read, a little bit of a step-up in the fourth quarter? And is that just a pull-through of investments? And what would be driving that?\n\nMark Mason -- Chief Financial Officer\n\nYep. So again, the guidance on full year expenses hasn't changed. It's the 7% to 8% ex the impact of divestitures that would imply a bit of an uptick there. It is on the heels of the continued investments that we're making and that's flowing through as well as how we -- how revenues kind of play out and the associated compensation activity that goes along with that.\n\nSo nothing extraordinary and consistent with the guidance given.\n\nJohn McDonald -- Autonomous Research -- Analyst\n\nOK. And I know it's too early to give formal guidance for next year. But if we look at the Investor Day slides, it seems to imply that expenses go up for a few years until you get to the medium term. Is that the slides at $51 million or so next year as a starting point.\n\nI mean is it fair when I read the Investor Day slides and think about your investments that directionally expenses probably do go up next year?\n\nMark Mason -- Chief Financial Officer\n\nJohn, I'd say, as you know, right, we'll give guidance for 2023 next quarter. But I think if you think back to the Investor Day and you think about some of the things that we just commented on with regard to our services business, we'd expect to see continued tailwinds as it relates to net interest income. We would expect to get to the heart of your question that we will continue to invest in the franchise that in the transformation, excuse me, that, that would obviously peak and then we would start to see the benefits start to play out from that in that medium-term period. And so yes, you can probably expect some type of a tick up, but I'll give you more details on that when we talk about the '23 outlook in the next quarter.\n\nOperator\n\nThank you. Our next question will come from Erika Najarian with UBS. Your line is now open.\n\nErika Najarian -- UBS -- Analyst\n\nHi. Good morning.\n\nMark Mason -- Chief Financial Officer\n\nGood morning.\n\nErika Najarian -- UBS -- Analyst\n\nThank you. I just wanted to take a step back. Your 11% to 12% medium-term ROTCE target had contemplated an 11.5% to 12% CET1 versus the 13% that you're targeting to by midyear next year, also that you laid out on that same slide that you're targeting 2% Fed funds over the medium term, which seems kind of cute right now. I guess I'm wondering, your confidence and you said you're confident you could hit medium-term targets even with this creep in capital.\n\nIs it really that shift in the rate environment that's helping you get there despite the higher denominator?\n\nMark Mason -- Chief Financial Officer\n\nSo thanks for the question. Look, I think there are a couple of things to kind of think back on that still hold true, which is the strategy that we've built, I think, is a resilient strategy and it really spoke to top-line momentum that we expected not just through rate increases, but also through share gains and also through the business-led investments that we that we're making and better leveraging the synergies and linkages across the franchise. All of those things still hold true to the top line. You're right, the Fed funds assumption has changed.\n\nBack in March, I think we all were looking at a Fed funds rate at the end of the year that was closer to 1.5% or so. And so now here we are with the hikes that we've seen and looking at something certainly north of 4%, 4.5%. And so that's changed meaningfully. But there are a number of other drivers that contribute to achieving that return, including -- it's the medium term, so call it 3 to five years, I think, is how we characterized it and starting to see some of the benefits from the transformation investments that we're making.\n\nTo your point on capital, we are building to the 13%. Remember, that is a byproduct of a 4% SCB for this particular CCAR cycle and the strategy that we described includes a mix in our shift of revenues and earnings over time, a mix toward more stable PPNR and more fee revenues that will contribute to, I think, a balance sheet and a mix that is -- that generates fewer losses -- stress losses than our balance sheet might today. So the contribution of those things, we think, will drive that return target that we've set, and we still remain confident about that. Now with that said, there are unknowns that are out there.\n\nI just spoke to many of the Nobles. And so what happens with further capital requirements and the current regulatory regime and what have you, it's hard to predict. But we'll manage to that as we learn and know more about it.\n\nErika Najarian -- UBS -- Analyst\n\nGot it. And my follow-up question is given Citi's valuation on book I think your current and prospective shareholders are waiting for buybacks to potentially return. I guess a two-part question here. Number one, especially if you think you could stabilize your PPNR in the stress test, why 100 basis point management buffer versus one of your peers at 50 that reported today, and secondarily, as we think about impact the timing, as I recall, there's a currency translation adjustment that could be negative upfront at announcement to CET1, but you get that all back during close.\n\nSo I guess the real big question here is how should we think about -- what are the mile markers for the return of buyback activity at Citi?\n\nMark Mason -- Chief Financial Officer\n\nOK. Thank you, Erika. There's a lot bit unpack if I forget anything, just please remind me. But it started at the beginning, which is I know where we trade in terms of book value.\n\nAnd I'd love to be in a position where we were buying back given that valuation. With that said, we're going to take it quarter by quarter, as I think you've heard us say and evaluate what buyback decisions and capital actions make the most sense in light of the environment that we're managing through, we're clearly managing through an uncertain environment. We do -- as I just said and as you kind of mentioned as well, we do see our business mix shifting over time on the heels of our strategy. I do think that over time, that will contribute, as I said, to the capital requirements that we have, but that's over the medium term.\n\nAnd we do still see a fair amount of volatility in the stress capital buffer. And part of the reason that we have the management buffer is to deal not only with that uncertainty in the SCB, but also in interest rates. And we're seeing volatility in both, frankly. And so we'll continue to evaluate the management buffer as well to see what makes sense as we move toward that medium term.\n\nIn terms of the Mexico transaction, you're right in terms of we have mentioned before, the CTA component to that. That is a timing difference. We have factored that in to the path to our 13% by middle of next year and factor that into achieving the longer-term targets that we set for ourselves.\n\nOperator\n\nThank you. Our next question will come from Mike Mayo with Wells Fargo Securities. Your line is now open.\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nHi. Can you hear me?\n\nJane Fraser -- Chief Executive Officer\n\nYes. We can, Mike. Good morning.\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nLook, I look at the global network as a curse and a I guess the curse part is simply the complexity and the expenses. And Mark, you said expenses should go up higher next year. You're not going to tell us for a few more months, but I'm just wondering when you think you can grow revenues faster than expenses. Again, it's not new news, the revenue, and expenses.\n\nYou guided it and you're within that range. It's just we have to wait a year or three years or how long for that complexity to get more simplified so revenues can catch up to that expense growth? And then on the blessing side, Mark, you mentioned you said gain share in those client segments. I thought that was a little vague. I mean, you talked about trade, you talked about other activity connecting multinational corporations in the period of volatility.\n\nSo if you could put a little more meat on the bone as far as when you talk about market share and those tailwinds on the revenues while you have the headwinds on the expenses from the global network.\n\nJane Fraser -- Chief Executive Officer\n\nHey, Mike. It's Jane. Jumping in because I do want to talk a bit about your point on the global network here. I have to tell you, I'm hard pressed to find a negative to the global network.\n\nWe start off with the vision for the bank that we laid out in March. It is to be the preeminent banking partner for clients with cross-border needs. Who are those clients? It is 5,000 multinationals on the subsidiaries, it's institutional investors and the ultra-high net worth clients with a heavy tilt to family offices. And we serve them on FX, on liquidity management on their payroll, on their supply chain as well as strategic advice financing, etc.\n\nThat's $4 trillion in daily volume. 80% of that credit portfolio is investment grade. So when we're looking at it, it's the multinational to take a higher risk country. It's the client base we're serving there of the global multinationals much more than the local players.\n\nAnd so this is not a -- this is a relatively simple high returning, very well growing as we're seeing at the moment, capability that is exceedingly hard to replicate. So let me pass over to Mark in terms of what are some of the examples of different areas of the drivers of growth? This is, as I said at the beginning, this is a crown jewel. It's not a source of complexity for the bank.\n\nMark Mason -- Chief Financial Officer\n\nSo, Mike, I'd say a couple of things. One, what I said was that we continue to gain share, and I referenced specifically about 60 basis points of share with large corporate clients. And we obviously or not obviously, we're also winning mandates and gaining share with other client segments as well. You know that the commercial banking client segment is one that we are focused on, given the strength of our platform and its applicability to those sized clients as well.\n\nI mentioned that our wins are up and specifically, they're up 20%, the mandates that we're winning across all client segments. And that specifically with FIs, they're up almost 50%. So hopefully, that gives you some sense of where the revenue growth is coming from. The takeaway there is it's both existing as well as new clients as we kind of continue to build out the platform and build out our capabilities to reach them.\n\nSo the second part of your question was around expenses and expenses growing and when will we have top-line growth that exceeds the expense growth. And I'd remind you that the work we're doing on the transformation as well as the business-led investments are multiyear almost by definition and important in order to derive savings in our structural cost base over time. And at Investor Day, I think I pointed to by the time we got to that medium-term period, we would see our operating efficiency go down to less than 60%. I think we've been very deliberate about trying to give you guidance and update you on guidance for the full year and along the way and we'll be consistent in that discipline.\n\nAnd I can certainly give you more color on '23, as I mentioned earlier to John, the next -- in the next quarter.\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nI guess one clarification. When you say you've gained 60 basis points of share with large corporate clients, what do you mean by share, share of what?\n\nMark Mason -- Chief Financial Officer\n\nWallet, 60 basis points, not 50 60. So market share with them.\n\nOperator\n\nThank you. Our next question will come from Ebrahim Poonawala with Bank of America. Your line is now open.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nGood morning. I guess one, just Mark, I wanted to clarify your NII guide for 1.5 to 1.8 billion is just total NII, right? It's not ex-markets or anything.\n\nMark Mason -- Chief Financial Officer\n\nIt is x markets.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nIt is x markets. Any perspective of view on where you see markets heading in fourth quarter, just given what's happened with the rate backdrop?\n\nMark Mason -- Chief Financial Officer\n\nI don't -- very intentionally don't forecast markets NII in a rising rate environment, you would normally see the markets NII come down. It tends to be liability sensitive. But we tend to focus on, as you probably heard me say a number of times, total revenues for this business and I guess what I'd highlight is that in periods of uncertainty and lots of market volatility, our businesses tend to perform well. And so we'll see how the fourth quarter plays out.\n\nThere's obviously some seasonality to it that has taken place historically. And so we have to kind of factor all those things in, but we'll have to see how it further evolves.\n\nOperator\n\nThank you. Our next question will come from Betsy Graseck with Morgan Stanley. Your line is now open.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nHi. Good morning.\n\nMark Mason -- Chief Financial Officer\n\nGood morning.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nJust two things. One, just another question on the expense side. I just wanted to follow up with regard to Mark, I think on the stranded costs that you had talked about at the Barclays conference. And I'm wondering if I got the message right there, which is when you exit the consumer businesses there's 25% that is generally managed through a TSA.\n\nSo it's a service agreement and that expense will come off over time. And then there's another 25%, which is likely not to come off. Is that fair? Or is there a different message that I'm missing on that?\n\nMark Mason -- Chief Financial Officer\n\nYes. That's not fair. But I appreciate the answer clarity. So I bucket into three buckets.\n\nSo one is when we do these transactions, both Jane and I have deep experience in this. We tend to see about half of the costs go away to the buyer. So when we do the transaction, when we do the sale. As you pointed out, about 25% is often in place as part of a transition service agreement.\n\nAnd so there's revenues that we get paid to offset that expense until things have totally transitioned and then that goes away. And then the third bucket is what I call potentially stranded cost and what Jane calls not stranded call, right? And that is -- I say potentially because their regional expenses that get allocated to countries, for example, they're global expenses that get allocated to the region and to the countries, for example, and what we have to do and what we're doing is we're attacking what would otherwise be stranded cost. And we're attacking that by telling each of the functions in the business. And here's your portion of that 25% and come back and tell me how you're going to rethink your org structure, simplify your processes in order to drive that cost out of the company.\n\nRight? And so that's what we've been doing. Remember, the expense base here is probably $7 billion. So you can break down kind of the population that we're talking about. We've already stood up a team work with each of the businesses and each of the functions around getting in front of that cost so that we can drive that down over the near-term period of time.\n\nJane Fraser -- Chief Executive Officer\n\nAnd as a Scotsman, I just can't help myself but jump in here. I think as Mark [Inaudible] at Mark here, Mark and I are both pretty [Inaudible] focused around this. But I'd say at the moment, we've had a couple of the divestitures closed. We have another three next quarter, and this continues on.\n\nWe already started on Australia and the Philippines and getting those expenses down, as Mark said, there is going to be, and we will not be shy in capturing as an opportunity to simplify our organization further next year when we have more of the divestitures closed and streamlining more of our regional management structures, more of the expenses at the global level. So there is more to come on that, and we'll be looking to do that as I indicated at Investor Day that will be an important part once more of the divestitures are closed, starting in '23, going into '24.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nRight. So you were marks potentially stranded costs? And Jane, you are no stranded cost, the no stranded cost is in the guide medium term?\n\nMark Mason -- Chief Financial Officer\n\nIn terms of the time to get it out, is that -- yes.\n\nJane Fraser -- Chief Executive Officer\n\nYes. And I think as Mark talks about expenses, you've got to look at the various different dynamics that are going on. So yes, we've got investments into the transformation at the moment. Many of those translate into better efficiency as well as a safer, stronger firm the divestitures translate into lower cost, but also we eliminate the stranded costs, and we simplify the organization.\n\nYou've got a number of different factors that we will make completely transparent to you at play in our expense base from a more structural dimension in the quarters ahead.\n\nOperator\n\nThank you. Our next question will come from Matt O'Connor with Deutsche Bank. Your line is now open.\n\nMatt O'Connor -- Deutsche Bank -- Analyst\n\nHi. Can you guys talk about the pace of addressing some of the regulatory issues out there? On the one hand, you got out of the AML consent order earlier this year, which I think was a very big positive. But on the other hand, there was an article last month, suggesting regulators want you to go faster and I think we all know regulators always want things to go faster on these issues, but I did want to ask the question. Thank you.\n\nJane Fraser -- Chief Executive Officer\n\nYes. We all want things to go faster, both our clients, our shareholders the management team, regulators, the board all. So I think we're fully aligned there. Maybe if I take a step back on this one.\n\nTransformation is our No. 1 priority. It will be a multiyear journey and prioritizing safety and soundness is a very important global bank is a nonnegotiable for all of us. Where are we? I think we were delighted to see the AML consent order get closed with the OCC.\n\nWe continue to work on the regulatory orders we have. I have to say we have constant and constructive engagement with our regulators that personally, I find them to be very helpful and essential to our success. We have got a lot to get done. As you can see from the hiring numbers, we've been investing heavily in the talent and the resources that we need.\n\nAs we've also said, this is not only going to benefit our safety and soundness, but also in terms of our client excellence in delivery and ultimately, for our shareholders as well. I think the foundation that we need for this is largely in place. And so Mark and I and frankly, the whole management team, we're very focused on continuing to execute on the various plans we submitted and the overall transformation of Citi from a strategic and another dimension. We obviously can't give more details than that because this is confidential supervisory information, but I hope that gives you a good feel.\n\nMatt O'Connor -- Deutsche Bank -- Analyst\n\nAnd I guess when you say the foundation is largely in place, like what are some of the things that are missing? Or is it just a matter of, say, executing on the divestiture.\n\nJane Fraser -- Chief Executive Officer\n\nIt's timing. So some of the areas, for example, where we're making technology investments, those ones where we've had fragmented technology platforms, we're migrating them into a single platform or into an industry standard where we've not been on one that we -- that is going in pace for the future. Those things take some time to put in place. But you can see from the investments we've made, both headcount and the shift from consulting to much more of our own people.\n\nYou'll see the technology increase in that shift as well. So some of that is just a natural progression you'd expect over time.\n\nOperator\n\nThank you. Our next question will come from Jim Mitchell with Seaport Global. Your line is now open.\n\nJim Mitchell -- Seaport Global Securities -- Analyst\n\nHey. Good afternoon. Maybe just on deposits and behavior. You guys clearly have a different mix by geography and by business.\n\nDeposits ex currency were up 1%. Your peers were down close to 3%. So how do we think about deposit behavior going forward given your mix of geography and business? Is it just the overseas rate hikes have been behind the curve versus the U.S., but we'll start to see more deposit outflows over there? Or do you think your deposits can hold up a little better.\n\nMark Mason -- Chief Financial Officer\n\nIt's a great question. And so why don't I take that? So a couple of things, and you started to allude to it. The first is that when you think about our business, you've got about between ICG and our PBWM business of 65%, 35% split in terms of the deposits. You also have a U.S.\n\ndollar-denominated versus non-U.S. dollar-denominated split that is pretty meaningful as well. And then to your point, we've got different currencies and different rate hikes by different central banks around the world. And that then is juxtaposed against different beta behavior from customers.\n\nAnd so on the whole -- on the ICG side, we tend to see higher betas. And obviously, with rates increasing at a more rapid pace -- we expect those to get closer to our expectations in the near term. We're starting to see many more hikes around the globe outside of the U.S. And so again, we expect to see betas which move at a -- or operate at a much lower pace level outside of the U.S.\n\nbut start to tick up. And so over time, I think we will see continued tailwinds from an NII as the differences between U.S. and non-U.S. activity play out.\n\nAnd so that should play to our -- has played to our benefit, I think, and should continue to play to our benefit. If you think about what I've talked about before in terms of our IRE, our interest rate exposure and the cash flow approach that we are moving toward taking, in some ways, it captures exactly that point. And so this is -- if you see a 100 basis point move in the curve cross currencies, we're looking at as much as a $2.2 billion increase. And when you look at that increase, it skews more heavily toward the non-U.S.\n\ndollar than the U.S. dollar. And that is in part because of the different moves in rate curves by currency as well as the different betas by client type in U.S. versus non-U.S.\n\nJim Mitchell -- Seaport Global Securities -- Analyst\n\nRight. Right. OK. That's really helpful.\n\nAnd then maybe just a second question just on the impact in the fourth quarter. You have your best closing on three divestitures. How do we think about the P&L and capital impact of that in the fourth quarter?\n\nMark Mason -- Chief Financial Officer\n\nI think I talked about the idea of the divestitures contributing close to $3 billion for the full year, $3.1 or billion in terms of the capital impact for the full year 2022. The combination of Australia and the Philippines gets us to about $2.1 billion or so. And so the balance of the divestitures that we've scoped out for the fourth quarter should close that gap. Thailand, Malaysia, Bahrain, the signing of China, etc., should close that gap to getting us to that $3.1 billion.\n\nWith most of that is skewing toward the first three, Thailand, Malaysia, Bahrain.\n\nOperator\n\nThank you. Our next question will come from Gerard Cassidy with RBC. Your line is now open.\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nThank you. Hi, Mark and Jane. Good morning.\n\nJane Fraser -- Chief Executive Officer\n\nHello there, Gerard.\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nJane, you talked about your global footprint and the strength that gives you as an organization. And so maybe this question is very appropriate for Citigroup, which is the following. You guys have a real good window into the global financial markets there's been some disruption out there, we all know about what's going on in the U.K. pension funds.\n\nYou had the Swiss National Bank come into the New York Fed this week for $6.3 billion of currency swaps. We know there's a large broker having challenges over there. So can you guys give us a flavor, what are you seeing from a stress standpoint. What are the liquidity metrics that you're watching to see if some other stresses pop up how the global financial markets will handle that.\n\nJane Fraser -- Chief Executive Officer\n\nYes. It's a very good question. It's one we spend a lot of time on. And I think as Mark alluded, we're constantly doing different stress tests on the market, on clients on different areas.\n\nAnd as I said at the -- just in the opening remarks, we're more focused on the liquidity in the market at the moment and the impact on some counter parties much more than we are on our credit risk -- that could change over time, depending particularly what happens from a tail risk on the geopolitics here. What are we seeing going on? I think a lot of the focus is in Europe. Right now, which is sort of at the center of the storm. We're seeing some areas where there could be energy supply constraints are impacting some clients.\n\nSo we're watching industrial production moved to the U.S., for example, which are the places where the cost of production is lower, a potential buffer for some of the slowdown in U.S. manufacturing and the like because the demand for goods softened, for example. We're seeing areas where clients on the collateral on where there's a situation of intense volatility that hits a surprise drop as we saw in [Inaudible] is having an impact on liquidity and therefore, margining, which is what happens that has been happening with the U.K. pension funds with the derivatives.\n\nSo a lot of the areas we look at is what's the collateral behind different institutions as we have done with the commodity players earlier on in the year, we've been looking at some of the LDIs at the moment. And as we see different stresses, we're jumping on it. I think the central banks are also ready to jump in as needed and certainly attuned to the importance of agility in these situations as well. As our large global institutions like ourselves as to how do we help support the market the benefit for our bank is because we're in a strong position on all of our capital on liquidity, on balance sheet and the credit portfolio, as you can see, is extraordinary at the moment, zero losses in ICG this quarter, again, we're in a position to be able to jump in and play an important role.\n\nBut it's a bit of wack-a-mole, I would say.\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nVery good. And then, Mark, just as a follow-up. You touched on your investment banking numbers and your markets numbers. And yes, investment banking for everybody has been a struggle, obviously, this year.\n\nYour advisory numbers actually were better than your peers on a year-over-year basis in terms of growth, but DCM was quite a bit weaker. Can you kind of give us a little more color there? And also, how do the pipelines look going into the fourth quarter?\n\nMark Mason -- Chief Financial Officer\n\nYes. Sure. So look, as we've all seen, the wallets have been under meaningful pressure year-over-year down more than 50%. We did show some strong performance in parts of the business.\n\nWe've been hiring, frankly, as Jane has mentioned before and filling in gaps that we have across the portfolio in healthcare, tech, energy, etc., and feel good about that and are seeing benefits from having made those hires. DCM is really more of a function of low deal volume pretty much across the board. And there really isn't a whole lot more to it than that. But as you know, investment banking is part of the strategy that we discussed at Investor Day and a key part of that and we'll continue to invest in it and ensure we're getting the productivity out of it that the investment warrants, but really not a whole lot more in DCM beyond the low deal volume across the board.\n\nOperator\n\nThank you. Our next question will come from Vivek Juneja with J.P. Morgan. Your line is now open.\n\nVivek Juneja -- JPMorgan Chase and Company -- Analyst\n\nThanks. Thanks for taking my questions. Couple of questions for you. Firstly, Mark, I just want to clarify, you said NII ex markets to be up $1.5 billion to $1.8 billion year on year in the fourth quarter.\n\nYou were up $1.9 billion year on year in the third quarter. Given that there have been more rate hikes during the quarter and even later, in the quarter. Any color on what's driving that slightly lower NII accretion rather than actually being up at a faster pace?\n\nMark Mason -- Chief Financial Officer\n\nYeah. Again, the important factors here include volume, what we see in both the loan volume, the deposit volume and obviously, betas and how betas play out, and we talked about the idea that with the higher frequency and level of rate increases, that's going to put pressure on the beta in terms of seeing it increase across the board. And then the third factor is rates and what happens with the rates and the timing for which that happens right? When that happens, matters in the quarter in terms of whether you see that benefit in it or in subsequent quarters. And so those are the factors that drive that range that I've given you.\n\nAnd it's across both the PBWM portfolio as well as how it plays out in TTS. And given the world we're managing through quantitative tightening and the like. And I think the other factor is obviously FX and how that plays out. So those are the main drivers, Vivek, and the range reflects any variety of ways that they could play out in the quarter.\n\nVivek Juneja -- JPMorgan Chase and Company -- Analyst\n\nOK. Completely different question for both of you. Security services. You talked about $1 trillion in new business wins seems to be doing really well.\n\nAny color, if you can remind us on what client segments you're seeing this in? And I remember you're saying on the call that it's domestic also, but any more color into where you're growing and where you're seeing all this.\n\nJane Fraser -- Chief Executive Officer\n\nWe're seeing this in a number of different areas that the one that is most material was the win we had with BlackRock in a particularly sizable percentage of business there here in the states and in particularly important and accurate and attractive part of the security services business as well. But we have been winning some sizable business across the board. And part of -- a part of this, I think, comes from the fact that we're able to link the pre and post trade together to drive a lot of efficiencies for our clients and bring some insights that some of the other players are not able to do in helping them manage and get competitive advantage in their businesses. So we're an attractive one from that.\n\nMark, anything else to add?\n\nMark Mason -- Chief Financial Officer\n\nI mean we're very pleased with the growth here and the wind mandates that we've been seeing across the board, but particularly in the U.S., as Jane highlights. And some of it is a rate benefit, but a good portion of it is again, those new mandates, those new additional assets that we're bringing in. The final point that I'd make on it is that, and I'd reiterate it, I guess, is that this is not only one of our businesses that's growing quite rapidly, but it's also a high returning business for us as well. And so consistent with the strategy that we talked about at Investor Day and one that reflects linkages across the franchise.\n\nAnd so we feel very good about that.\n\nOperator\n\nThank you. Our next question will come from Ken Usdin with Jefferies. Your line is now open.\n\nKen Usdin -- Jefferies -- Analyst\n\nThanks. Afternoon. Just two quick ones. Mark, you talked about the capital impact of the legacy exits.\n\nIs there a way you can dimension how much in the fourth quarter from revenues and NII perspective comes out from the legacy?\n\nMark Mason -- Chief Financial Officer\n\nI do not have that in front of me, Ken. I can -- I guess if we I've got a page in here that reflects the Page 22 reflects some of the size of the exit markets, but I do not have that in front of me. I'd have to circle back with you can.\n\nKen Usdin -- Jefferies -- Analyst\n\nOK. I would assume that's been a part of the prior question about NII trajectory, right? There's a negative impact embedded in that in the fourth quarter as well, right? That's just part of the.\n\nMark Mason -- Chief Financial Officer\n\nYes. That is reflected in the NII guidance, but the major drivers are largely what I referenced. But yes, it would be reflected in.\n\nOperator\n\nThank you. Our next question will come from Mike Mayo with Wells Fargo Securities. Your line is now open.\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nHi. As a follow-up, why is Citi still banking in Russia when only every other major American company or most of them are out of Russia.\n\nJane Fraser -- Chief Executive Officer\n\nHey there, Mike. As I mentioned in my earlier remarks, we are now informing our multinational clients who are operating in Russia. So these are the U.S., European, and Asian core multinationals or the franchise that we are ending nearly all of the institutional banking services. We offer them by the end of the first quarter of 2023, the cost of which I would add is not material.\n\nAnd so at that point, our only operations in Russia will be those necessary to fulfill our remaining legal and regulatory operations there. It's been very important for those multinationals that we've helped support them as they look at exiting the country and their payroll and other elements as they do so. So they've been able to wind down or exit and a few of those who have remained, but we will be, as I said at the very beginning, our intention here is to wind down our operation in the country.\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nAnd then just if you could remind us, you mentioned more dispositions in the fourth quarter. So after 2022, what's left as far as the dispositions that you had mentioned? And how are you tracking with your plan?\n\nMark Mason -- Chief Financial Officer\n\nWe -- I mean, we are -- we feel very good about how we track with the plan. Obviously, Mexico is left. We've got Vietnam, India, Taiwan, and there's one I miss Indonesia, I think, is what I'm missing -- so those are the ones that are left in China, right? So those are the ones that are left in the balance of 20 -- or beyond 2022.\n\nJane Fraser -- Chief Executive Officer\n\nAnd I think those ones again, a couple of them have been rather than ones that use you have a legal day one, legal day two on. It's all close in one go on both, which is why a couple of them are later than we had originally thought. But they're going well. And the work around them and around the stranded costs that relate to them, as we talked earlier, is also going nicely.\n\nSo we're pleased with the pace, and we are acting on these with urgency because you would expect.\n\nOperator\n\nThank you. There are no further questions at this time. I'll now turn the call back over to Jen Landis for closing remarks.\n\nJen Landis -- Head of Investor Relations\n\nThank you, everyone, for joining us today. If you have any follow-up questions, please reach out to the IR team. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJen Landis -- Head of Investor Relations\n\nJane Fraser -- Chief Executive Officer\n\nMark Mason -- Chief Financial Officer\n\nGlenn Schorr -- Evercore ISI -- Analyst\n\nJohn McDonald -- Autonomous Research -- Analyst\n\nErika Najarian -- UBS -- Analyst\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nMatt O'Connor -- Deutsche Bank -- Analyst\n\nJim Mitchell -- Seaport Global Securities -- Analyst\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nVivek Juneja -- JPMorgan Chase and Company -- Analyst\n\nKen Usdin -- Jefferies -- Analyst\n\nMore C analysis\n\nAll earnings call transcripts"
}