{
  "companyName": "Plug Power",
  "companyTicker": "PLUG",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/plug-power-plug-q2-2022-earnings-call-transcript/",
  "content": "Plug Power (PLUG 1.15%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to Plug's second quarter 2022 earnings conference call. [Operator instructions] Please note that this conference is being recorded. I will now turn the conference over to our host, Teal Hoyos, senior director, marketing and communications. Thank you.\n\nYou may begin.\n\nTeal Hoyos -- Senior director, marketing and communications\n\nThank you. Welcome to the 2022 second quarter update call. This call will include forward-looking statements. These forward-looking statements contain projections of our future results of operations or of our financial position or other forward-looking information.\n\nWe intend these forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. We believe that it is important to communicate our future expectations to investors. However, investors are cautioned not to unduly rely on forward-looking statements, and such statements should not be read or understood as a guarantee of future performance or results. Such statements are subject to risks and uncertainties and that could cause actual results or performance to differ materially from those discussed as a result of various factors, including, but not limited to, risks and uncertainties discussed under Item 1A risk factors and the annual report on Form 10-K for the fiscal year ending December 31, 2021, as well as other reports we file from time to time with the SEC.\n\nThese forward-looking statements speak as -- only as of the day on which the statements are made, and we do not undertake or intend to update any forward-looking statements after this call or as a result of new information. At this point, I would like to turn the call over to Plug's CEO, Andy Marsh.\n\nAndy Marsh -- Chief Executive Officer\n\nThank you, Teal, and thank you, everyone, for attending Plug's second quarter conference call. The last week has been a monumental week for the world, the US, the fuel cell and hydrogen industry and Plug with the passing of the Inflation Reduction Act through the Senate. The recently passed Bill would enact a clean hydrogen production tax credit, the PTC, to incentivize the production of clean hydrogen, providing a major inflection for the world to achieve net zero by 2050 and for hydrogen, especially green hydrogen, to provide 20% of the world's energy. This bill provides a trifecta effect.\n\nIt's good for climate, it's good for jobs and it's good for national security. Our electrolyzer business has benefited from the push in Europe to become energy independent from corrupt regimes. We are seeing the benefit as our orders already have exceeded by 50% our projection for the year, with most of that coming from Europe. Now, the momentum will grow rapidly here in the states with the PTC as demonstrated by our deal with New Fortress Energy, a 120-megawatt order, which was announced last week, which can grow to 500 megawatts.\n\nWith the passage of the act, we expect a boom for our electrolyzer and green hydrogen business. All applications that use gray hydrogen today, such as fertilizing manufacturing, will now be able to buy green hydrogen at a competitive price with gray. Applications that are looking to move to hydrogen like steel and concrete manufacturing and natural gas heating will have a path to dramatically reduce their carbon footprint cost competitively. Everyone wants green hydrogen.\n\nNow, there is a path that always makes it competitive. We believe the first big markets for green hydrogen will be these industrial applications where it's simpler to substitute green hydrogen for other feedstocks. And remember, these applications represent 26% of the world's CO2 footprint. But cost-effective green hydrogen will also help us to expand our application business more rapidly.\n\nAs hydrogen becomes more plentiful and cost-effective, all of our applications like our Microsoft stationary product offering, HYVIA vans and, of course, powering material handling equipment becomes more attractive. This bill is good for all our stakeholders, including customers, shareholders, our employees and the communities. For our shareholders, as mentioned in our investor letter, will move up our path to profitability by six months. Finally, before Q&A, I'd like to highlight Plug's priorities beyond our revenue goals a $900 million to $925 million in 2022 and $3 billion in 2025.\n\nFirst, our first and foremost, our path to profitability in 2024. This includes the following key initiatives: one, commissioning 70 tons of green hydrogen in 2022 and 500 by 2025 in the US and 1,000 tons globally by 2028. Our hydrogen business will reach more than 30% plus gross margins in 2024. The math is quite simple via a combination of vertical integration and the PTC.\n\nObviously, we are reviewing the possibilities of building more plants sooner than later to leverage our leadership position. Two, and you can see it, our service business will be gross margin breakeven by year's end and growing to 30% gross margin by the start of 2024. We are already experiencing significant improvements with the latest versions of our products. And look, scale matters.\n\nSo our goal is sell more electrolyzers, sell more green hydrogen sell more fuel cells, especially for our stationary products, HYVIA and of course, our material handling business. And four, full deployment of our highly optimized and automated Gigafactory and Vista site that will drive down our costs of our manufacturing and improve our quality. These are showcase manufacturing sites, not just for the fuel cell industries but across all industries. And finally, success with our four JVs, SK, HYVIA, ACCIONA, and Fortescue.\n\nExecuting on these strategies alone will allow us to continue and expand upon our industry leadership position. Of course, we won't stop here, but my team knows executing the above is our top priority. Paul, Sanjay and I are now open for your questions.\n\nOperator\n\n[Operator instructions] And our first question comes from Colin Rusch with Oppenheimer. Please state your question.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nThanks so much, guys. I guess, this is maybe a question for Sanjay. Looking at the green hydrogen opportunity in the US, I'm curious about the maturity of the conversations with potential industrial users. And a sense of volume that you could start converting relatively quickly, as well as your land position for incremental facilities and maturity of conversations with power sourcing, which it looks like it could get pretty competitive fairly quickly.\n\nSanjay Shrestha -- Chief Strategy Officer\n\nYeah. So Colin, great question. Let me take the second part of the question first, right? So one of the things we've been spending a lot of time doing, and you've heard us say this before as well. One of our biggest focus is sourcing right location so that we can get the right price of power, which is renewable power.\n\nThe level of activity on that, both internally, as well as working with a third party, if anything, has picked up quite a bit. So you guys -- as Andy mentioned in his prepared remarks, we're actually looking to build more plants faster, not the other way around, No. 1. No.\n\n2, what we're really looking to do is, and we've taken this approach, right, where when the hydro is the best solution, we go for that hydro and then we think about how can we expand our facility even without hydropower electricity. Second, we then look at wind source, what are the right location for that? How do you get the complement power there. There's a lot of activity going on beyond some of the things we've talked to you all about in Texas. There are other locations that are pretty far along.\n\nPlease stay tuned. We'll be able to talk about that even more. And in terms of solar, obviously, we're looking at multiple locations in the regions that you can think about. And one of the things we're really doing is that how do you not only look at the land, but how can you expand that? How could you think about larger solar plant? How do you really think about approach like net energy meter and how do you really drive the cost of that electricity down? And we're even evaluating some of the options surrounding nuclear if the price of power is right.\n\nSo the discussion, both internal work, as well as with the third party is very, very robust. And Colin, as you can imagine, we are focused on one goal, and only one goal, and that is how do you drive that cost of renewable electricity to be down so that we can continue to drive the cost of green hydrogen down. And on the industrial front, as you saw in our shareholder letter, and as Andy touched on it, with this PTC, it really opens all markets for us. Green hydrogen is now economical versus gray hydrogen and every single one of those applications.\n\nYou have seen some of the announcements here even before the PTC was enacted, as Andy talked about this 120-megawatt electrolyzer opportunity. When you really think about the amount of the hydrogen that is a gray hydrogen being used in industrial application today, that really creates a very, very substantial opportunity for us. So now again, this is a recent event here. There's going to be a lot of activity.\n\nWe fully anticipate that. And even if only 20% of those application goes with on-site electrolyzer, you're talking about 10-plus gigawatts of electrolyzer opportunity in this industrial opportunity for us as well. Would you like to add anything?\n\nAndy Marsh -- Chief Executive Officer\n\nNo. Perfect. Anything else, Colin?\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nYeah. Now, I'd like to talk a little bit about supply chain for both the electrolyzer and the fuel cells. I mean, obviously, this is kind of a watershed moment for the industry and you've kind of stressed that in front of a lot of competitors in terms of scaling up. But I'm curious about your supply chain and their preparedness to really respond to how big this could get and how fast you guys want to move.\n\nI'm sure that you've kind of bounced those ideas around, and those conversations are going to get more concrete here. But I'm just curious what you can say about that at this point.\n\nAndy Marsh -- Chief Executive Officer\n\nYeah. Colin, I would kind of first take a step back and say there's actually three ingredients to that supply chain. One actually has to do with design. And when I think about our PEM electrolyzer design, we envision that sooner rather than later, a staff today will actually have about double the power, which actually simplifies, really, our supply chain.\n\nSo a lot of that happens with can you design the product simpler. And that's continuing to go through our business. Probably the more important one is, are we adding the right people. And I think the reasons that we don't -- not foresee supply issues this year is because the leadership we've put in place.\n\nAs you know, I've hired Dave Mindnich for Tesla who drove their Reno facility to make sure Tesla vehicles could be delivered. That same sort of mentality about how to develop those strategic relationships with suppliers, we've been working on for a long time. And third, look, a lot about this whole integrated supply chain is your own manufacturing capability. And the facility we built in Rochester, the facility we've built in Vista, which now we can occupy, I think, dramatically changes everything.\n\nSo we have sophisticated people who have been driving our supply chain for the past years. We have designs, which we're looking to reduce the number of parts, which help us with cost and supply chain. And third, we have the facilities. And look, our goal is to continue to have that leadership position.\n\nI don't want to downplay that -- and I'm not trying on this call, the downplay that we don't fight supply chain issues every day. We do. But that is -- the first item I get in the morning is what's going on and do they need me to make a call. So it is an everyday effort and it is more complicated.\n\nBut I would say that it's less intense than it was.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nPerfect. Thanks so much, Andy.\n\nAndy Marsh -- Chief Executive Officer\n\nThanks, Colin.\n\nOperator\n\nOur next question comes from James West with Evercore ISI. Please go ahead.\n\nJames West -- Evercore ISI -- Analyst\n\nHey. Good afternoon, guys.\n\nAndy Marsh -- Chief Executive Officer\n\nGood afternoon, James.\n\nJames West -- Evercore ISI -- Analyst\n\nSo Andy, clearly, a lot of game-changing action here recently. One of the things I wanted to hone in on, and this is before we even talk about the PTC is the data center, the successful test that you had with Microsoft and the opening up of that market. Could you maybe talk through what the next steps are and how that will evolve? And how do you get to that? I think you put out a $40 billion market opportunity number.\n\nAndy Marsh -- Chief Executive Officer\n\nAnd Colin -- I'm sorry, James, first, it was a big step. I mean that activity with Microsoft to design that product was a combined two and a half-year effort. And already, we have developed the next-generation product, which we'll be rolling out to Microsoft and others in the fourth quarter here. And I think in our letter, we really outlined numbers for this market.\n\nI think the numbers were in the next 12 months, Sanjay. Yeah. I think over the next 18 months, about 200 megawatts of activity. So the numbers are just starting, James.\n\nBut with that application, and we're talking -- we're engaged with all the data center operators. But it also is very applicable. And I was down in the City of Albany talking about this today, about the challenges many people are having with powering EVs. And I think our first big deployments, believe it or not, will be powering electric vehicles where hydrogen will be generated outside of town and brought into power stationary products, believe it or not.\n\nThat's one that's not as obvious, but it's actually probably will be the first biggest market for that opportunity. And third, this same product scaled as we scale it, and there'll be different continuous generation is what we plan for SK. And for SK by the end of '24, we'll be deploying 200 megawatts worth of product. So this is a huge opportunity for us and really just beginning.\n\nBut it's not only a huge op -- and when you think about it, these are really the beginning of the future peaker plants that combined with the work Sanjay's doing with pipelines and well as green hydrogen generation, that's really the bigger vision. The $40 billion really only represents what's going on at data centers.\n\nJames West -- Evercore ISI -- Analyst\n\nRight. OK. OK. Got it.\n\nThat's very helpful, Andy. And then, the other thing you announced earlier in the quarter, was the port and Antwerp and that you'll be building a large-scale facility there. That seems like another big deal, but also probably the first of maybe a series of port applications that you might look to exercise on. Is that fair?\n\nAndy Marsh -- Chief Executive Officer\n\nYeah. I would say, absolutely. And I think, James, if you look at that port, it is the second largest chemical port in the world. We're looking to add -- they're looking to add a green hydrogen pipeline at that port to feed all the chemical plants.\n\nAnd we certainly are looking to scale it. And what was it, 300 miles, there's like 60% of the population in Europe is close enough to that port. Boy, what ideal situation for Plug to really be building our HYVIA business, material handling business in Stationery. So that is -- and here in the states, James, I actually believe the best opportunities for these hydrogen hubs.\n\nI was meeting with Senator Ossoff in Georgia, and we talked a lot about the hydrogen hub possibilities in Georgia. And one of the biggest focus is the Port of Savannah. You think about the Port of Savannah, I guess, the Port of New York, New Jersey, even I know in West Virginia when we met with Senator Manchin, there is an opportunity to bring hydrogen from West Virginia into the Great Lakes. So ports and moving hydrogen is really, really a huge opportunity.\n\nJames West -- Evercore ISI -- Analyst\n\nGreat. Thanks, Andy.\n\nAndy Marsh -- Chief Executive Officer\n\nThanks, James.\n\nOperator\n\nOur next question comes from Alex Kania with Wolfe Research. Please state your question.\n\nAlex Kania -- Wolfe Research -- Analyst\n\nGood afternoon. Hi there. How's it going? Maybe like a philosophical question about how to think about the PTC with respect to pricing. I guess, in the near term, if you've got fixed price contracts, maybe the PTC is something that you're able to kind of pocket but then maybe over time, and obviously, that would help out with the near-term kind of margin headwinds.\n\nBut then over time, is it fair to assume -- or I'm just curious about how you're thinking about what the PTC means for how you negotiate green hydrogen deals moving forward?\n\nAndy Marsh -- Chief Executive Officer\n\nYeah. I think really good question, Alex. Look, I think that when you think about the near term and contracts we have, the company will be able to capture most of that PTC. I think that like other industries, I think there'll be some sharing along the line.\n\nObviously, those who invest the most, which is us, will capture the majority but I think that's how it will evolve.\n\nAlex Kania -- Wolfe Research -- Analyst\n\nGreat. And then, maybe a follow-up just to --\n\nAndy Marsh -- Chief Executive Officer\n\nI don't think it's much different than what you see with other credits. I think I think what shouldn't be forgotten, though, is a more competitive hydrogen price makes all our applications, and quite honestly, everybody's applications, more interesting. So it's a great opportunity for our apps. And it's a great opportunity for us to provide green hydrogen to others.\n\nAlex Kania -- Wolfe Research -- Analyst\n\nThat makes sense. And maybe just thinking about now the fact that the US is looking to have a pretty supportive policy environment. And it looks like Europe is aiming for something with REPowerEU. I mean how do you think about kind of balancing your focus? Do you think you can kind of scale kind of both of those continents and kind of the way that you hope, or now does this kind of maybe defer it a little bit more attention toward the US?\n\nAndy Marsh -- Chief Executive Officer\n\nThat's actually a real interesting question, Alex, and you must have heard my testimony in front of the Energy Committee because I mentioned without policy, our focus would move more radically to more rapidly to Europe. At the moment, we believe for Plug, the two best market opportunities for the US and Europe. And I think we will be leveraging our partnerships more newer, while most what we'll do here in The States, we'll do it by ourselves. In Spain, when you think about how to leverage solar, you couldn't have a better partner than ACCIONA.\n\nOur activity in the wind belt, up in Denmark with H2 Energy and with other activities we're looking at, I think that's where we'll be focused with -- obviously, with Renault JV, we're focusing on leveraging their capabilities. So in Europe, I think it will be much more partnership-oriented and people who can help lead us in Europe. Here in The States, we will take a leadership position. But quite honestly, without this bill, more and more of our focus would have turned to Europe.\n\nBut now I think it will be a much more balanced approach. But I always like to remind people of the pure-play hydrogen players, no one in the past two years have invested more in Europe than Plug. Plug is both an American company and a European company.\n\nAlex Kania -- Wolfe Research -- Analyst\n\nThank you.\n\nAndy Marsh -- Chief Executive Officer\n\nThanks, Alex.\n\nOperator\n\nOur next question comes from Bill Peterson with J.P. Morgan. Please go ahead.\n\nBill Peterson -- J.P. Morgan -- Analyst\n\nGood afternoon. It's good to see the Inflation Reduction Act passed after a couple of head fakes. But I wanted to actually follow up on that last question on Europe. We saw the IPCEI Hy2Tech come to EUR 5.4 billion in funding.\n\nWe see a lot of logos on there, but not Plug directly, we see a lot of your partners. I guess, is there a path for Plug to directly benefit in this? So does it entail local manufacturing? I'm just kind of dovetail on that last question, like how does Plug benefit from that? And what is taking me to do to benefit more?\n\nAndy Marsh -- Chief Executive Officer\n\nNo, I think that, first, our focus was our partnerships. And if you look at HYVIA, and I know the numbers haven't been announced, but the level of support HYVIA has received is significant. And that has been -- that was our major initiative for on-road vehicles. We obviously have activities as Plug alone going on in Belgium with support from the Belgium government.\n\nI think as we get viewed as more and more European, and I take a look at the fact that I was invited to France, I was at a dinner with Macron, Plug is beginning to be recognized more and more throughout Europe. And I think as our presence becomes clearer, we'll be able to participate more directly. But at the moment, we felt that to maximize the amount of cash to support our activities in line with our business goal that HYVIA certainly was the best vehicle. And I can just tell you, Bill, that has really paid off.\n\nBill Peterson -- J.P. Morgan -- Analyst\n\nTerrific. And the other side of the coin, you did kind of insinuate about electric cars and stationary as being the first big market. I believe you're actually seeing some of that later this year as part of the sort of back half weighted. Hoping you can size that opportunity, I guess, as a run rate actually this year, but more importantly, how does that business look over the next few years, given that it looks like it's one of the -- it's not the biggest stationary opportunity in the near term, certainly, one of the bigger ones.\n\nAndy Marsh -- Chief Executive Officer\n\nIf I was going to talk about from a Plug perspective, the stationary market will -- beyond electrolyzers, we see the state stationary market is really going to grow more rapidly than on-road vehicles in the next two to three years. And it's really because there's two big applications. One is, as I mentioned earlier in the call, powering electric vehicles. The second one is this data center market, which when you have people like Microsoft -- and obviously, if anyone has read the blog, we've developed a very, very close relationship that -- and really demonstrated, I think, what do they call it, a moon? Yes, it was a man's walking on the moon.\n\nThey're looking to eliminate all diesel by 2025 or 2030. We think that's going to be an incredible opportunity for Plug. If you think about 2024, for example, I think this business will be -- that portion of our business could be more than 20%, 25% of our business. And then, when I think about On-Road, HYVIA is looking to have 100,000 vehicles on the road by 2030.\n\nSo there's a real good road map for us with HYVIA. And the fact that we have 20 customers who are going to be piloting our products over the next six months, I think, which is double the number that we expected when we talked to you at the beginning of the year. I think that's a real sure clear sign that those business opportunities are large.\n\nBill Peterson -- J.P. Morgan -- Analyst\n\nThanks to lots of good activities on track.\n\nAndy Marsh -- Chief Executive Officer\n\nYeah. Thanks, Bill.\n\nOperator\n\nOur next question comes from P.J. Juvekar with Citi. Please go ahead.\n\nP.J. Juvekar -- Citi -- Analyst\n\nYeah. Good afternoon. Great news with PTC. And just a question on sort of levelized cost of hydrogen.\n\nWhere do you think that cost is today on the US Gulf Coast, which is the biggest market for hydrogen in the US? And where do you think it goes post PTC? I'm just trying to get how quickly with the heavy-duty industry like refining and steel would start converting to green hydrogen.\n\nAndy Marsh -- Chief Executive Officer\n\nI'm going to turn that over to Sanjay here, P.J.\n\nSanjay Shrestha -- Chief Strategy Officer\n\nSo P.J., as you know it very well, right, when we talk about gray hydrogen, we got to kind of put that in context with on-site gaseous gray hydrogen versus liquid hydrogen as well. So I mean, despite the sort of the commodity price volatility and all that, if you use us talking about on-site gray hydrogen supporting things like refining industry or the ammonia and things like that, the number would be probably around $1.50 a kilogram, give or take, OK? So if you're looking at that $1.25 to $1.50 kind of a number, now take a step back, right? Think about on-site electrolyzer, $0.04 a kilowatt hour electricity right, connected to that electrolyzer then you take into consideration 55-kilowatt hour of electricity when you got some capital cost there, then you layer on PTC. So all of a sudden, right, there is not a single application where the green hydrogen is not economical anymore. Obviously, it will take some time for the industry to evolve and grow as we move ahead, but that's what happens.\n\nNow, take that into the liquid hydrogen market and think about long sort of transportation application, mobility applications, when you start to think about the diesel parity, our view always has been, it's not about thinking about can we charge more than diesel because it's -- our system is more efficient. We want it to be at diesel parity, right? When you look at those numbers, all of a sudden, even from a liquid hydrogen perspective, so market can comfortably be in that $4 to $5 range delivered. And with PTC, that path becomes even that much more clear. And for folks like us, it actually allows us to provide that kind of a pricing, make return on our plant.\n\nAnd P.J. hope that folks do appreciate one point, which is we've been at it now for some time. And the fact that we've been building this green hydrogen plant, the work we have done, the learnings we have had, I think, really, really stands out as a big force mover and a competitive advantage for Plug.\n\nP.J. Juvekar -- Citi -- Analyst\n\nGreat. And clearly, you guys have been ahead in terms of building out this green hydrogen infrastructure. So congrats to you guys. I guess, my second question is with this PTC demand for green hydrogen takes off, which it will, your electrolyzer orders could also go up, just like what you've seen with Hydrogen Energy and New Fortress Energy.\n\nDo you have enough capacity at Rochester? Was Rochester built with PTC in mind or do you need to expand more, even more?\n\nAndy Marsh -- Chief Executive Officer\n\nI think that's a real good question, P.J. And I hope the answer is I have to expand more. But let me kind of give a picture where I think I mentioned earlier that we do think there's possibilities that we'll be at a rate of about one megawatt a month in -- I'm doing my math here, 100 megawatts a month by October in Rochester. I think there's a way to optimize that facility and push that probably up to 150, 160.\n\nI think there's an opportunity to make design improvements. But I do think especially in Europe, we'll be looking at opportunities to expand our manufacturing footprint to support that market. So we've already had, I'll say, some addition -- some initial discussion. So I think that's an opportunity.\n\nAnd one of the items, I think we did really well was that we designed that plant that we can take that design and duplicate it, duplicate it, duplicate it. So that the footprint and design we put together, it probably would take us 15 months to build another plant. I think when you look at that, I think that we will be probably giving that a lot more serious thought, especially for Europe, so that we're in great position to capitalize on this opportunity. But having built a plant and then just having to duplicate it, is a lot simpler than doing it for the first time.\n\nAnd I used to have a full head of hair, P.J., before we start to the plan.\n\nP.J. Juvekar -- Citi -- Analyst\n\nAll right. Well, thank you. I appreciate it.\n\nAndy Marsh -- Chief Executive Officer\n\nOK. Thanks.\n\nOperator\n\nAnd our next question comes from Eric Stine with Craig-Hallum. Please go ahead.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nHi, everyone.\n\nAndy Marsh -- Chief Executive Officer\n\nHello, Eric. How are you today?\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nHello. Doing well. So all the talk of the PTC and cost of hydrogen coming down, I know something that you've talked about for years is potentially expanding to smaller locations for materials handling. Just wondering what your thoughts are.\n\nIs that still an objective? And would that -- or how would that expand the market opportunity?\n\nAndy Marsh -- Chief Executive Officer\n\nAnd I don't talk about this much, Eric. But the acquisition of ACT and the trailers -- having controllers that are trailers actually makes smaller hydrogen facilities simpler. It reduces the cost of infrastructure, and we have done smaller sites and we're beginning to do more. And we do see that the combination of lower hydrogen cost, simpler on-site hydrogen infrastructure where it becomes much easier just to do swap outs of trailers, and you then think about our regional activity.\n\nJose and his team actually have quietly implemented a few of those. So we do think that's a great opportunity. And the fact that the fuel, which has dominated the cost, now will be significantly lower is a real, real benefit.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nAnd any thoughts on how that expands the market opportunity? Might be a tough question.\n\nAndy Marsh -- Chief Executive Officer\n\nSo I think at the plug symposium, Jose pointed out, the path to how that business could be a $3 billion to $4 billion business opportunity with smaller scale. And we really had that begin to ramp in the '25, '26 time frame. We haven't done any new projections. But obviously, when you can think about what Jose was pointing at and with the lower cost of hydrogen, you could see that being pulled in.\n\nThat's a real good question.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nGot it. That's helpful. And maybe just last one for me. In the release, you mentioned two pedestal customers in Europe that you are targeting.\n\nJust wondering if you can give any details there, whether it's potential timing, size, etc.\n\nAndy Marsh -- Chief Executive Officer\n\nYeah. We're in the final, final stages. And I was hoping -- I've actually been watching my phone to see if I could say anything. But we do have -- we've targeted three pedestal customers for this year.\n\nI would expect all those will be announced by -- before we speak in the fourth quarter. Two in Europe, one in the United States, Eric. Yes. And I think that the comment I made about us really looking more European.\n\nIn fact, we have probably in Europe today, over 300 people has really made a big difference in being able to convince customers we're serious.\n\nOperator\n\nThank you. And our next question comes from Chris Souther with B. Riley. Please state your question.\n\nChris Souther -- B. Riley Securities -- Analyst\n\nHey, this is my question here. Can you maybe talk a little bit about the $15 billion electrolyzer sales funnel? Curious if you could frame the activity by geography and maybe the timeline customers are looking for potential deliveries. And curious, does the PTC potentially change your strategy within the US around electrolyzer sales versus owning the infrastructure yourselves?\n\nAndy Marsh -- Chief Executive Officer\n\nYeah, a really good question. So Chris, probably 70%, 80% of that funnel today is Europe and the Middle East, and that is the heart of the funnel. There are -- just to give you a feel, there is about just for our smaller five-megawatt system, there's over 350 opportunities in our funnel. Everything from bottle manufacturing, which you wouldn't think a lot about, but folks are looking to run their furnaces with a percent of hydrogen to concrete manufacturing, the steel manufacturing.\n\nThere's a lot of smaller projects that, quite honestly, are easier to deploy rapidly because you don't have essentially, they're self-contained systems. And most of our shipments, which will be about $140 million of electrolyzers in the second half will be like five-megawatt containers. I think this time next year when we report the third quarter, I suspect about 30% to 45% of our revenue will be coming from our electrolyzer business. And I think by 2025, it could be as much of as that.\n\nChris Souther -- B. Riley Securities -- Analyst\n\nOK. And then, the PTC potentially change the strategy within the US, maybe around selling versus building out the infrastructure yourselves, or would you kind of just take the potential growth of the market as opportunity to do both?\n\nAndy Marsh -- Chief Executive Officer\n\nReally good question, Chris. And I have -- I mean, this management team has been thinking about that question a good deal. I think you could end up in circumstances where you could build a hydrogen plant to support a fertilizer facility, own a portion of that plant and be able to generate liquid hydrogen to support our customers. And without going into great detail, we actually see that with the proliferation of our electrolyzer business, we may develop a different model for partnerships and building some of the plants, which as I mentioned -- as we mentioned in the letter, could help us expand much more rapidly with partners.\n\nI was in a meeting today with someone looking to build a one gigawatt electrolyzer plant here in Texas. And one of the discussions we had was, could we own a portion of that plant so we could use as part of our offtake. It would reduce, obviously, our capital cost and provide us an opportunity to really expand and grow more rapidly. So the answer to your question is we have been giving that a lot of thought.\n\nChris Souther -- B. Riley Securities -- Analyst\n\nOK. OK. Appreciate it. And keep it up.\n\nAndy Marsh -- Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] Our next question comes from Sameer Joshi with H.C. Wainwright. Please state your question.\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nHey. Good afternoon, everyone. Thanks for taking my questions. The chart that you have in your letter on page three, does that take into account a delivered cost of hydrogen, or does it assume localized production?\n\nAndy Marsh -- Chief Executive Officer\n\nI'll let Sanjay take that. I'm just going to add, it doesn't really matter if you're delivering gray hydrogen or green hydrogen, the delivery costs are going to be the same. But go ahead, Sanjay.\n\nSanjay Shrestha -- Chief Strategy Officer\n\nThat's right, Andy. But Sameer, that is really on site, right? So that does not take into consideration the delivery cost that chart itself.\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nGot it. OK. And then, maybe this one for Paul. Can you just let us know what is happening with the inventory buildup over the last two quarters? Is that like planned inventory buildup, or is that some delay in sales?\n\nPaul Middleton -- Chief Financial Officer\n\nYeah. It's really anticipation for the second half. I mean, if you look at the sales as we've seen historically, we do about one-third in the first half, and we do two-thirds in the second half. It's going to be -- we're going to do more sales in the second half than we did almost -- well, all of last year.\n\nSo it's a big push. We're ramping up new facilities and production to support that, as well as what we anticipate after in the first part of next year. So that's -- I don't see that build continuing on in the second half. I think it will temper, we know it will temper, but it's really driven toward all that growth that we're building for to deliver in the second half.\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nUnderstood. And then, last one, also maybe for Paul. On the SG&A sequential increase has been almost $15 million, $16 million. Should we see this level over the next few quarters, or do you expect further increases in SG&A?\n\nPaul Middleton -- Chief Financial Officer\n\nNo. There was some -- I think I gave a number for the beginning of the year of $100 million to $110 million per quarter. I think this quarter was a little heavier just because of the Microsoft programs and some other new product launches. But I think that $100 million to $110 million is a good proxy for as we move forward.\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nGot it. Thanks, Paul.\n\nOperator\n\nOur next question comes from Ameet Thakkar with BMO. Please state your question.\n\nAmeet Thakkar -- BMO Capital Markets -- Analyst\n\nHey. Hi. And thanks for squeezing me in. Just real quick on the production kind of outlook of 500 tons per day kind of exit rate in 2025.\n\nShould we think about all of that as being kind of in the US, or is that going to be kind of global? Just kind of thinking about how the PTCs might kind of flow to the bottom line?\n\nAndy Marsh -- Chief Executive Officer\n\nI'm going to let Sanjay take that one.\n\nSanjay Shrestha -- Chief Strategy Officer\n\nThank you, Andy. So I mean, it does -- we've mentioned this in the prior calls as well, that 500 tons is really the number in North America. And by 2028, we said we want to be 1,000 tons, and that actually includes Europe as well. But you do bring up a good point, is there an opportunity for that 500 tons to be potentially higher given some of the activity we have going on in Europe.\n\nThe answer to that is yes, but that 500 tons number is strictly referring to North American production by end of 2025.\n\nAmeet Thakkar -- BMO Capital Markets -- Analyst\n\nOK. Super. And then, just now that you have a kind of line of sight on the PTC. I think you guys had talked about kind of looking for offtakers for about 70% of very green hydrogen production, the PTC kind of helps, I guess, seemingly kind of derisk some of this as well.\n\nAre you guys still thinking about that 70% level, or would you kind of willing to kind of keep more production for yourselves? Are you looking to maybe do kind of the opposite and actually ramp up percentage scrap takers?\n\nSanjay Shrestha -- Chief Strategy Officer\n\nYeah. So isn't that a great question, I mean, so a couple of points to highlight on that, right? One, I think -- so I just thought it's an important point to note here, which is with PTC, one other thing that it also does is capital formation, right? So that's another big benefit that we will get from source of financing type of capital that comes in, structure of capital. Right now, most of our investment has been largely focused on all equity investment. That's another added benefit that you will see as you go forward.\n\nBut look, and I think that's what we're going through right now. But I think our focus is really, we want to make sure that first and foremost priority, it hasn't changed for us, right? We want to make sure that our customers are taken care of. Obviously, our pedestal customer, we want to make sure that they never run out of hydrogen. We want to make sure that we're adding more customers to that mix.\n\nBut -- we really haven't changed the view on that 70% loading of the plant at this point in time. But as Andy touched on some of the opportunities that we're starting to see in the stationery market, that can really, really drive the demand for our hydrogen for some of our customers, and that would make that we only load some of these plants for 50% instead of 70%, but that's TBD at this point in time. We really haven't changed that view. But that number certainly is not going to go from being 70% of trying to sell out the entire plant given what we're seeing here.\n\nAmeet Thakkar -- BMO Capital Markets -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nNext question comes from Kashy Harrison with Piper Sandler. Please state your question.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nGood afternoon and thank you for taking the questions. So I was hoping if you could maybe just walk us through your margin expectations for the rest of the year. Gross margin, please?\n\nPaul Middleton -- Chief Financial Officer\n\nYeah. Well, the good news is it's going to be heavily concentrated with equipment. If you look at the mix of sales and the growth that we're experiencing. So I would say, we're definitely going to see margin progression.\n\nAnd I think it will -- even in the fourth quarter, it will move into positive range and could even hit double digits depending on final mix. There's a couple of big things happening. We're ramping -- as Andy mentioned, we're moving quickly to ramp the electrolyzer sales going from kind of scaling the plant is first half to max production in the short term, that's a big step function change. The other two things.\n\nThe fuel and the service, we continue to make big progress. But those -- in fact, in service, in particular, was -- today, I was working with the teams. It's really impressive some of the things we've been doing, including some of the enhancements of the field. We've seen, in some cases, 70% part reductions.\n\nSo we're starting to see that benefit really pay off. We think that will start paying off more in the second half, but you'll see a bigger step function as we move into next year. And then, the fuel, as we talked about, really kind of kicking in first part of next year as we start launching those facilities and we start -- and we play out with PTC. So progression through the year, but big step function changes in '23 as some of those big events start to play out.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nThat's great color. And then, it sounds like you have some new pedestal customers coming, which is great. But I was curious what you're hearing from your customers surrounding the slowdown in the global economy. Do you think that might temper demand for -- on the material handling side, or are you still getting positive indication from your pedestal customers that they're ready to continue to grow as you think about 2023.\n\nAndy Marsh -- Chief Executive Officer\n\nYeah. Good question, Kashy. I would say this, we have two advantages. One is that we are adding new customers that can help mitigate any slowdown that could occur.\n\nI think the second item too, is that we haven't really seen -- we may have seen slowdown at one customers and upticks and other customers. Sometimes during these times where it's difficult to acquire labor, it's difficult to find ways to reduce cost. You actually have an advantage in the selling process. So I can tell you one of our big customers who I've worked with for years is making the commitment to really dramatically change over the remnants of the older technology of batteries to move to fuel cells.\n\nSo we haven't -- what I've seen is some sloshing around but I have not seen a reduction. And I think that having lived through these tough times before, I've always noticed that you're actually in a much better position if you're in a business that is has a smaller market share of the overall opportunity plus your selling cost savings. That's a pretty powerful message when things are slowing down and laborers are tough to tough to acquire.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nThank you for that color. I appreciate it. If I could just sneak one last one in. I was wondering if you could maybe just give us a refresh on your capex outlook moving forward as you think about the US, European hydrogen build-out.\n\nWondering if you have any good rule of thumb for maybe thinking about capex on a per unit basis just for modeling purposes?\n\nPaul Middleton -- Chief Financial Officer\n\nYeah. Well, the bulk of our capex is in the green hydrogen platform. So we do have, as Andy mentioned, a number -- a couple of different facilities we're building out for production capacity expansion. As Andy mentioned, hopefully, the PTC drives the need for even more.\n\nWe'll see how that plays. But what we've talked about is kind of $1 billion a year is a good proxy. These plants are large scale. And to get to the 500 tons, it's in that range of about $1 billion a year in terms of run rate.\n\nAndy Marsh -- Chief Executive Officer\n\nI think Sanjay, you, Paul and I had a great conversation about why the PTC is going to make it easier to get capital. You want to comment?\n\nSanjay Shrestha -- Chief Strategy Officer\n\nHappy to do that, Kashy right? So I think -- so Paul, just to add to what you said here, right? I think with the sort of the PTC, it will probably likely follow what happens to the capital formation in the solar and wind industry, right? In the beginning, it was all about folks who are thinking about 10-megawatt solar project, equity financing. But all of a sudden, with the ITC and solar and PTC and wind, capital structure changing a way where equity was really only 20% of the capital stack, No. 1. No.\n\n2, return expectation on that equity went from mid-teens to single digit, thereby reducing the cost of renewable electricity, levelized cost of that electricity. We see exactly same pattern unfolding here with this PTC for green hydrogen as well. One, source of capital, type of capital, availability of capital will dramatically go up, and we wouldn't actually be in a position where we have to fund all this just with higher equity capital. It can be back leverage, it can be tax equity, all forms of capital will really help us.\n\nOne, accelerate our build-out. And two, keep driving the cost of green hydrogen down, very similar to what happened to the solar industry in the last decade.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nThank you. Excellent.\n\nSanjay Shrestha -- Chief Strategy Officer\n\nThank you, Kashy.\n\nOperator\n\nOur next question comes from [Inaudible] with BTIG. Please state your question.\n\nUnknown speaker -- BTIG -- Analyst\n\nHi. How are you? Thank you for taking my question. Great. So under the Inflation Reduction Act, PTC aside, is Plug able to take advantage of domestic content requirements for US Steel for additional subsidies? And just to make it two parts, if so, does that equipment need to be tied to a project like the 120-megawatt plant you just announced in Texas?\n\nAndy Marsh -- Chief Executive Officer\n\nSharif, there's a lot of work. And I would say this, one, the PTC will be able to capture the $3 a kilogram tax credit. Plug has a great deal of domestic content in our products today. And like most folks, not only to meet these kind of requirements, but also to shorten our supply chain.\n\nWe're doing more and more domestically. So we continue to take steps to make sure. And look, this is not unique to the United States. We spent a lot of time with HYVIA looking at European content and substituting European content.\n\nSo we are looking at ways to maximize our domestic content to make sure we can -- where it makes sense for our shareholders, take maximum advantage of what's most profitable to Plug.\n\nUnknown speaker -- BTIG -- Analyst\n\nGreat. Thank you for taking my question.\n\nAndy Marsh -- Chief Executive Officer\n\nYeah, great. Thank you.\n\nOperator\n\nNext quarter comes from Tom Curran with Seaport Research Partners. Please go ahead. Please go ahead\n\nTom Curran -- Seaport Research Partners -- Analyst\n\nGood evening. Hi, Andy. Across the Atlantic, we've recently heard some prominent industry voices, seasoned utility and energy executives express alarm that the European Commission isn't being realistic on the demand side for green hydrogen. Either with regards to which applications will prove economically viable and scalable or about how urgently they're doing enough to ensure announced projects actually make it to FID.\n\nYou just shared some encouraging updates on the HYVIA JV in hydrogen mobility, the stationary power TAM, progress on these two hoped for incremental pedestal customers for NH. But could you just take a step back and speak to these concerns? At a broader higher level, what is your view on the pace at which key infrastructure projects for adoption usage in Europe are reaching FID?\n\nAndy Marsh -- Chief Executive Officer\n\nSo Tom, first and foremost, they are going to be projects that make it to the finish line and projects that don't -- no doubt about it. I mean that's just a reality. So I'll take a look at Denmark, where I've spent some time with leadership there. They are serious about building 30 gigawatts of wind power, with the majority of that really headed toward generating a green hydrogen to support Europe.\n\nThey are serious. And I've met with the former Head of Parliament in Denmark, who's deeply involved in building the pipeline from Northern Denmark into Germany, that serious. There are projects which I sit there and say, that's not real. There's others which have a combination of government support industrial support application support, like HYVIA.\n\nNot to be controversial, I also would suggest that maybe some which are part of the old energy world may not want this to move as rapid.\n\nTom Curran -- Seaport Research Partners -- Analyst\n\nRight. And I thought you'd appreciate an opportunity to respond directly to some of those doubts and worries. And then, Paul, when it comes to the remainder of the territory that services needs to cover to reach breakeven by year-end, what should be the key drivers from a negative 32% gross margin for 2Q to breakeven as we exit this year?\n\nPaul Middleton -- Chief Financial Officer\n\nYeah. Labor leverage definitely will help. But to be honest with you, the biggest impact we're seeing is reducing the touch points, and that's with the reliability improvements. And so, we've launched different equations from different components and stacks and other configurations, new software upgrades, a whole lot of different solutions that both are going out into the new units that are getting deployed.\n\nSo we're already seeing out of the gate better performance. And more importantly, we're able to retrofit and apply to the installed fleet. And some of those improvements, as I mentioned earlier, we're seeing dramatic reduction in parts. So I think it's the combination of -- it's that and the labor leverage.\n\nI mean, we're -- next year could be 150 sites. So yes -- what's that?\n\nAndy Marsh -- Chief Executive Officer\n\nPlus more hardware.\n\nPaul Middleton -- Chief Financial Officer\n\nYeah. And so, it's -- we're going to see that continue to progress, but you're going to see some pretty good traction here very shortly as those start to play out.\n\nTom Curran -- Seaport Research Partners -- Analyst\n\nAs well as the accruing benefits of that ever-expanding newly installed base of the latest generation stacks, right?\n\nPaul Middleton -- Chief Financial Officer\n\nYeah, absolutely, exactly. And leverage on supply chain to leverage on the labor across the board, absolutely.\n\nTom Curran -- Seaport Research Partners -- Analyst\n\nGreat. Thank you for taking my questions.\n\nOperator\n\nOur next question comes from Joseph Spak with RBC Capital Markets. Please go ahead.\n\nJoseph Spak -- RBC Capital Markets -- Analyst\n\nHey, thanks. Andy, you mentioned a couple of times you think Plug will be able to hold on to the PTC. I'm just -- I just want to clarify, do you mean eventually or even initially, because if you're not passing the PTC through, how do you get to sort of initial competitiveness on green hydrogen?\n\nAndy Marsh -- Chief Executive Officer\n\nI think when you take a step back, there's different -- good question, Joe. The electrolyzer business, obviously, our customers take advantage of it. As I mentioned, I already have contracts with customers for hydrogen, Joe, that we can take full advantage of. And the third item, I did mention in my comments that we would be in a position where we'd be sharing some of the PTC with other customers.\n\nAnd I think that's how the mix comes out. And I thought that's what I said, but it's been a long call.\n\nJoseph Spak -- RBC Capital Markets -- Analyst\n\nIt has. I guess, maybe secondarily, I don't want to -- I know this is very early days and preliminary. But like functionally, how like -- I get the math on this $500 million of incremental cash flow, right? But like how does it actually work? Because you're not a taxpayer right now. So I think you need to set up some sort of entity to actually get that cash and maybe do some tax refining.\n\nAndy Marsh -- Chief Executive Officer\n\nI'll cut you off really quick for the first five years, it's direct pay.\n\nJoseph Spak -- RBC Capital Markets -- Analyst\n\nIt is. OK. So then is that actually -- so that $500 million would actually be revenue, not just sort of a cash inflow from selling credits or whatnot?\n\nAndy Marsh -- Chief Executive Officer\n\nI actually think it's -- correct me if I'm wrong, it's a reduction of costs.\n\nJoseph Spak -- RBC Capital Markets -- Analyst\n\nIt's a reduction in costs. OK. And then, lastly, I guess, maybe the big elephant in the room, but permitting, right, which can obviously be very difficult and take longer. Is that the biggest risk to timing that you see? And maybe if you could provide any sort of color on how you see that progressing?\n\nAndy Marsh -- Chief Executive Officer\n\nI'll let the guy who deals with permitting everyday answer that. Sanjay?\n\nSanjay Shrestha -- Chief Strategy Officer\n\nSo again, it's like any development business. Joe, right, as you can imagine. So look, I mean, there are areas where we're able to do things faster than expected, right? There is a situation where things can actually take a bit longer than expected. But what I would like to highlight here, though, is when you sort of think about when we're talking about 500 tons a day, it's not just a 500 tons opportunity, right? The opportunity is much larger than that.\n\nAnd look, and I think we also try to think about if plan A doesn't happen, how will our plan B and potentially plan C is going to get implemented here. to get to that goal. So needless to say, in light of some of the permitting dynamics, which is not going to go away. It's going to be real.\n\nIt's going to be there. In some cases, it's better than we thought. In some cases, it might not be as good as we thought, but our funnel to get to that 500 tons is obviously much larger than that.\n\nJoseph Spak -- RBC Capital Markets -- Analyst\n\nOK. Thank you very much.\n\nOperator\n\nOur next question comes from Praneeth Satish with Wells Fargo. Please state your question.\n\nPraneeth Satish -- Wells Fargo Securities -- Analyst\n\nHi, Andy. And two quick questions for me. I guess, the -- so the PTC will certainly help with green hydrogen adoption and cost. But I guess the other key variable for pricing is electrolyzer cost.\n\nSo I'm just trying to understand the trajectory for electrolyzer prices. Do you think they'll fall as you improved manufacturing efficiencies, or do you think the PTC has created so much demand that electrolyzer prices could hold steady?\n\nAndy Marsh -- Chief Executive Officer\n\nI can tell you with our plans today, 75% of it is the electrical feedstock. I mean I think that tells it all. So will electrolyze our price income costs come down? Absolutely. But it's so dominated by feedstock at cost that the key item is the output -- the PTC itself will dominate it.\n\nPraneeth Satish -- Wells Fargo Securities -- Analyst\n\nGot it. And you've talked about small green hydrogen facilities and the success there. But I guess I'm kind of wondering if you could talk through the puts and takes of going the other way and building large-scale green hydrogen facilities now with the PTC, making hydrogen prices lower, the market is a lot bigger. So, I guess, does it make sense at some point to concentrate electrolyzer capacity and then start gasifying the hydrogen and moving it through pipe versus liquefying it? There's a lot of industrial demand in the Gulf Coast.\n\nThere's a lot of pipeline capacity there. So it seems like a good fit, but curious for your thoughts.\n\nAndy Marsh -- Chief Executive Officer\n\nYeah, I'll give you -- I'm an engineer, so you're going to get a yes and yes answer. I think that -- I'll give you an example. We're dealing with one bottle manufacturer who has 80 bottling plants throughout the world. A five-megawatt electrolyzer on-site is ideal for him to be able to produce green bottles to satisfy his end customers, which are the beverage makers.\n\nThen in that case, and there's lots of applications like that, concrete manufacturing where you can see small scale. I'm a real believer in pipeline for hydrogen. I believe that the Infrastructure Bill for building out the hydrogen hubs, the best investments that can be made or building pipelines for hydrogen, which come off large-scale green hydrogen plants. The cost of those -- that hydrogen will be lower just because of scale of running and operating a plant doesn't change that dramatically.\n\nAll those costs are increased by going smaller. In those cases, pipelines are ideal. But I think today, we -- if you take a look at what we're doing with H2 Energy in Denmark, perfect opportunity where green hydrogen will be feeding a pipeline, which will be a public access pipeline for green hydrogen, no better way to do it. So -- but I think it really depends upon the application, the location and quite honestly, the time.\n\nReal good question. I am a big, big believer of pipeline, so.\n\nPraneeth Satish -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Greg Wasikowski with Webber Research. Please state your question.\n\nGreg Wasikowski -- Webber Research -- Analyst\n\nHey, guys. How are you doing? I'll keep it short. I'll keep it to one. And it's kind of a piggyback off of the last one here.\n\nSo can you speak a little bit more on what you're seeing on the development of the hydrogen midstream as a whole? You just talked about pipelines, which we spoke about in the past being a little bit more of a future conversation, at least in scale. But does the PTC change your thoughts on that and/or other means of transporting larger amounts of hydrogen over longer distances?\n\nAndy Marsh -- Chief Executive Officer\n\nI'm going to turn it over to Sanjay. And -- but I'll just add, the lowest cost way to move hydrogen is pipeline.\n\nSanjay Shrestha -- Chief Strategy Officer\n\nAbsolutely, Andy. So again, Greg, so we have a lot of activity going on in that front. So let me just give you a scenario, right? Think about the optimal wind location. where you can actually really be a very large-scale wind farm with a very high capacity factor and really get an optimal levelized cost of that wind electricity, which can actually be a very, very low number.\n\nThen you have a large-scale electrolyzer plant, which is what we're doing for our customers, and we can do that for ourselves as well. So we are talking to some of the major midstream companies to think through what is that right volume what makes the economics work because you don't want to do a pipeline for a small amount of hydrogen and the economics doesn't work. So the way this is probably going to unfold is no different than the existing energy infrastructure, right? Large scale renewable facility large scale electrolyzer, gaseous hydrogen, sent via the pipeline, so the economics gets really, really optimized. You can really take very large distances.\n\nAnd for the last-mile delivery to get to various customer, you probably would have liquid plans to supplement that network. That is going to unfold. We've got a lot of work going on there. We're then thinking through how do you do large scale storage in cavern and things like that.\n\nSo stay tuned. Hopefully, we'll have more to talk about it going forward.\n\nGreg Wasikowski -- Webber Research -- Analyst\n\nThanks, Sanjay.\n\nOperator\n\nThere are no further questions at this time. I'll hand the floor back to Andrew Marsh for closing remarks.\n\nAndy Marsh -- Chief Executive Officer\n\nSo thank you, everyone, for hanging in there for one hour, 15 minutes, and I look forward to seeing you at the Plug Power Symposium. Our fourth symposium will be October 18 and 19 from our Rochester, New York Gigafactory. This will be a hybrid event. So stay tuned for further event and registration details over the coming months.\n\nThanks, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTeal Hoyos -- Senior director, marketing and communications\n\nAndy Marsh -- Chief Executive Officer\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nSanjay Shrestha -- Chief Strategy Officer\n\nJames West -- Evercore ISI -- Analyst\n\nAlex Kania -- Wolfe Research -- Analyst\n\nBill Peterson -- J.P. Morgan -- Analyst\n\nP.J. Juvekar -- Citi -- Analyst\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nChris Souther -- B. Riley Securities -- Analyst\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nPaul Middleton -- Chief Financial Officer\n\nAmeet Thakkar -- BMO Capital Markets -- Analyst\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nUnknown speaker -- BTIG -- Analyst\n\nTom Curran -- Seaport Research Partners -- Analyst\n\nJoseph Spak -- RBC Capital Markets -- Analyst\n\nPraneeth Satish -- Wells Fargo Securities -- Analyst\n\nGreg Wasikowski -- Webber Research -- Analyst\n\nMore PLUG analysis\n\nAll earnings call transcripts"
}