{
  "companyName": "GreenPower Motor Company Inc.",
  "companyTicker": "GP",
  "quarter": 1,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/greenpower-motor-company-inc-gp-q1-2022-earnings-c/",
  "content": "GreenPower Motor Company Inc. (GP 0.29%)\nQ1 2022 Earnings Call\nAug 15, 2022, 9:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the GreenPower Motor Company's first quarter earnings conference call. All participants will be in a listen-only mode. [Operator instructions] Please note this event is being recorded. I would now like to turn the conference over to Michael Sieffert, chief financial officer.\n\nPlease go ahead.\n\nMichael Sieffert -- Chief Financial Officer\n\nThank you. This is Michael Sieffert, the chief financial officer of GreenPower Motor Company. I would like to welcome everyone to our call to discuss GreenPower's financial results for the period ended June 30, 2022. I am here today with our chief executive officer, Fraser Atkinson, and our president, Brendan Riley.\n\nDuring today's call, we may make comments or statements about our future expectations, plans and prospects, which may constitute forward-looking statements for the purposes of the Safe Harbor provision under the Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws. Actual results may differ materially from those indicated by these forward-looking statements as a result of various important factors, including those discussed in our quarterly interim results and MD&A filed on SEDAR and on EDGAR. In addition, these forward-looking statements relate to the date on which they are made. We anticipate that subsequent events and developments may cause the company's views to change.\n\nGreenPower disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Also, during the course of today's call, we may refer to certain non-IFRS financial measures. Reconciliation of these non-IFRS measures can be found in our MD&A filed on SEDAR and on EDGAR and is also located on our website at www.greenpowermotor.com. I will now pass the call over to GreenPower, CEO, Fraser Atkinson.\n\nFraser Atkinson -- Chief Executive Officer\n\nThank you. Thank you, Michael. I want to start off by talking about the challenges facing our business and what we're doing to address these. First, we've encountered unstable shipping, where some savings or routes have been canceled as well as a reduction of available slots.\n\nWe've started to split shipments, utilize ports on the East Coast for sales in that region and are exploring other means of reducing shipping times. Second, we are also encountering delays with the delivery of certain parts and components. For example, one of our suppliers for our onboard charging systems has been taking longer to ship as we ramp up production, with a robust supply chain with multiple suppliers, we are able to adapt where we see these trends that are going to lead to delays. This is not as simple as changing a vendor as we go through a rigorous testing and homologation process in order to incorporate alternatives.\n\nThird, increased funding for voter and incentive programs has led to longer approval periods. We prioritized our processes to optimize the timing of voucher approvals in terms of our delivery opportunities. Our team is doing a great job of meeting these challenges head on and adapting to the changing environment that we operate in. I believe that the steps we've been taking will be seen in the ramp-up of deliveries to customers disk in the next couple of quarters.\n\nLet's shift the discussion to our current strategy. As we outlined on our update call in early July, we've moved to a go-to-market strategy with the school bus group, commercial trucks and vans group and passenger vehicles and buses. We see multiple growth drivers for each of these. For our all-electric commercial vehicles, there are recent federal programs with funding that will help accelerate adoption of these vehicles.\n\nThis is really a first for the commercial side of the business, as many of the programs to date have focused more on school buses and transit process. For example, the recently passed Inflation Reduction Act features numerous programs that will benefit GreenPower. To highlight one of these commencing after December 31, 2022, there will be a $40,000 tax credit for Class IV vehicles or higher. The EV Star platform and models are all Class IV vehicles.\n\nOn July 11, 2022, Canada introduced over $500 million of incentives for medium, heavy-duty zero-emission vehicles. We have 13 of our commercial EV Star with shuttle buses listed as eligible vehicles by Transport Canada for this program, with point-of-sale incentives ranging from $75,000 to $150,000 per vehicle. They are also permitting that these can be stacked with other funding programs up to 75% of the purchase price of the vehicle, providing for a very compelling net sales price for the 13 vehicles listed under this program. Next, the School Bus Group is able to draw numerous funding programs, which we have talked about in the past.\n\nBut to quickly highlight a few of these, previously announced EPA school program with $500 million for the purchase of electric school buses kicked off this year for the first five years from 2022 to 2026. California's $130 million school bus set aside program for this year, with the next funding already allocated for the next two years. California Energy Commission or CEC funding for qualified air quality management districts, as well as the ongoing voucher programs with New Jersey, California, BC, to name a few. I'll now turn it over to Brendan Riley, president of GreenPower, to talk about the many highlights and current activities of the company.\n\nBrendan Riley -- President\n\nThank you, Fraser. Recently, we announced the acquisition of Lion Truck Body, a regional truck body company located in Torrance, California. This combination of GreenPower's EV expertise and the advanced body building experience of Lion Truck Body is giving GreenPower competitive advantage. This not only results in shortened lead time, but also truck bodies that are optimized for EV trucks.\n\nHere's an example, our soon to be delivered EV Star Cargo Plus refrigerated truck has more payload, longer range, lower cost factor and lower overall price of any competitive EV refrigerated truck on the market, as a result of this combination. This is just one example of what we can expect with a close relationship and collaboration between Lion Truck Body and GreenPower Motor Company. Our commercial truck strategy is selling our truck products through dealerships is being executed by bringing dealerships online. We have dealerships in California and are working on additional dealerships throughout the USA, and we are very close to making those dealerships active.\n\nAs we have already demonstrated with our Workhorse deal, we are also pursuing a wholesale approach in that we are selling our EV Star CCs to companies that need efficient, ready-to-go platforms upon which they can add their bodies and then market the completed vehicle themselves. Also, our EV Star Cargo, 22-foot delivery van, practically jumping off the shelves. We have just started deliveries and are already getting follow-on orders from these customers that have received at least one unit. We have 40 units already committed to customers with POs and that claim is the first tranche of vehicles that we built, and we are getting ready to start our next tranche of vehicles any day now.\n\nOur BEAST and our newly introduced Nano BEAST, our school buses, which are being received with amazing fanfare as we demonstrate these vehicles across the country in-person. We have multiple state contracts for both models and our Nano BEAST has recently received Best New Green Technology Award at the Student Transportation Network Expo in Reno just last July. Our dealer deliveries have started for both units and the GreenPower factory in West Virginia has been vacated by the previous occupant and we have taken possession of the building. We are currently busy outfitting it to produce school buses.\n\nAnd finally, GreenPower began manufacturing its first new tranches and of EV Star CCs for the 1,500 unit purchase and sale contract at Workhorse. During the quarter, GreenPower coordinated with our suppliers, for delivery of key components and initiated production of 100 vehicle tranches of EV Star CCs. By the end of the quarter, the first 100 EV Star CCs were near completion and the next tranche had already entered production and key components for additional tranches have been ordered. The first deliveries to Workhorse began in July with follow-on deliveries made in August.\n\nGreenPower's team is working closely with Workhorse to assist with the integration of the EV Star CCs. Now I'd like to turn it over to Michael Sieffert, CFO of GreenPower, to talk about our first quarter financial results. Over to you, Michael.\n\nMichael Sieffert -- Chief Financial Officer\n\nThank you, Brendan. For the first quarter ended June 30, 2022, GreenPower reported revenues of $3.9 million, which was an increase of 29% over the revenue of $3 million for the comparable quarter in the previous fiscal year. Revenue for the first quarter included the delivery of three BEAST Type-D all electric school buses, 2 EV Star Plus, one EV Star Cargo Plus, five EV Star-22-foot-cargoes, six EV Stars, and four EV Star Cab and Chassis. Gross profit for the quarter was $1.1 million or 28.8% of revenue, which compares to $850,000 or 28.5% of revenue in the first quarter of the last year.\n\nWe anticipate that our gross profit margin will be lower than this level for the remainder of the year as we expect that the majority of our sales for the rest of the year will be under higher volume contracts and that we will have increased sales of school buses, both of which will be at lower gross profit margins in the current quarter. Our cash expenses during the quarter were approximately $3.4 million, which was lower than our prior quarter cash expenses of $3.85 million. This was largely due to several one-time costs during the prior quarter. We anticipate that our cash costs will increase throughout the year due to an anticipated increase in salaries, rental expense and lease payments, interest expense and other costs, related primarily to our business expansion.\n\nWe finished the quarter with $28.3 million of working capital, including $5.4 million in cash and restricted cash, approximately $3.9 million in accounts receivable and approximately $0.8 million in land held for sale. As well, we had approximately $24.6 million of finished goods inventory at the end of the quarter, which was comprised of Type A and Type D school buses, a full range of EV stars and several Class 8 vehicles. Our increase in inventory during the quarter was, primarily due to investments in EV Star CCs that will be fulfilling our contract with Workhorse. As discussed previously, management remains focused on working toward securing a solution to our near and mid-term capital needs while managing current production requirements.\n\nWe've been prioritizing our working capital toward strategic projects that we expect to generate near-term cash flows and have been successful in improving terms with certain vendors to limit our working capital investments. With that, operator, please open up the call for questions.\n\nOperator\n\nThank you. We will now begin our question-and-answer session. [Operator instructions] And the first question will come from Chris Souther from B. Riley.\n\nPlease go ahead.\n\nChris Souther -- B. Riley Financial -- Analyst\n\nHi, and thanks for taking my questions you guys. Maybe just talk a little bit about -- it seems like the production ramp is going quite well across the board with lots of different vehicles that you've kind of now got in inventory. Can you talk a little bit about where we have visibility on some of the near-term vehicle deployments with purchase orders seem to stand that we have good visibility on the CC side with Workhorse. Maybe some of the BEAST customers are kind of waiting for some funding clarity in the back half of the year here, and also there's been kind of buildup of the EV Star kind of regular.\n\nSo maybe just kind of mixing -- matching kind of near-term visibility by product line, I think, would be helpful for us.\n\nMichael Sieffert -- Chief Financial Officer\n\nSo thanks for the question, Chris. I'll try and be brief. I probably spend half an hour going through each and every model line. But starting off with the school buses, both for the Type B and the recently introduced Type A Nano Beast, is that we have more than 40 vehicles in finished goods presently.\n\nAnd our priority is to ensure that our expanding dealer network, that we're in a position to sell the necessary vehicles that they require for their deployments and their demonstrations. So that's priority one, which we expect to substantially complete in the next couple of months. And then on the heels of that, with that finished goods inventory, we would then be focused on customer deliveries. So we have a number of vouchers and funding mechanisms or funding programs, supporting customer sales with our school buses.\n\nBut as we work through those, our initial priority was around getting those that finished goods inventory into the hands of our dealer network because that's what is going to be the big driver of sales for us down the road in that group. So we expect that to be substantially over the next two quarters being the quarter we're in, September 30 and the December 31 quarter. Cargo vans that Brendan referred to, we delivered five in the June 30 quarter and we have approximately 40 of the cargoes and finished goods inventory as of today that we're working at pushing out to customers over this current quarter with the balance of that 40 million or approximately 40 million into the December 31 quarter so over the next couple of quarters. And then for the cabin chassis as you referred to, there is the -- our primary focus is to ensure that we're able to deliver the EV Star cabin chassis to Workhorse and as quickly as we can.\n\nSo that's the priority for that component of our finished goods inventory. And then that leaves us with a number of regular EV Stars, either as we call them blanks where the CD hasn't been installed or with specific seating for our max seating, our VIP seating and our rear ADA configurations that we have in stock with many that are specifically allocated to vouchers and various programs for those. So in summary, the finished goods that Michael had summarized in our MD&A is in each of these different groups. We have several priorities in terms of where these will be deployed.\n\nBut for our go-to-market strategy in terms of our groups, the majority of these are going to be deployed in the next couple of quarters.\n\nChris Souther -- B. Riley Financial -- Analyst\n\nGot it. OK. That's helpful. Maybe just shifting gears to, let assume you know in the past you've come across at having done a break capital needs in order to kind of set up production and kind of get off to the races.\n\nMaybe just talk a little bit about where that stands as far as expectations for capital uses as you're setting up the facility and beginning to ramp production would be great for an update?\n\nFraser Atkinson -- Chief Executive Officer\n\nWell, the month of August is really more of a move in. We are working with the state of West Virginia and the city in terms of related opportunities, I should say, for such as ensuring that everybody gets their applications in with the EPA program, which the online applications close at the end of this week for the EPA funding, as well as ramping up a number of initiatives that will be talking about over the next number of weeks. But as far as production goals, our first, we will be doing the first round of production of Nano BEAST starting in September, that's fairly light in terms of the capex. We're not having to spend a lot of money to get that first tranche going.\n\nAnd then over this fall will be where the capex is deployed for the various equipment requirements, so we can expand into the production for the Type D later on this fall/winter. So that's the current plan. And as I say, we're expecting to get that production going in September for the Type A Nano BEAST.\n\nChris Souther -- B. Riley Financial -- Analyst\n\nGot it. So when would those Type A start to kind of roll off the line assuming that timeline?\n\nFraser Atkinson -- Chief Executive Officer\n\nWell, we're being careful about setting time lines on that until that production starts. And the reason, I say that is, we have the cab and chassis there for that initial production, but we're still waiting to get all of the components and assembly parts, body and so on that will allow us to commence the production for those vehicles. So the as soon as we start, then we'll be in a position that we can give a time line as to the expected first production run that will come off the line.\n\nChris Souther -- B. Riley Financial -- Analyst\n\nOK. That makes sense. And then just last one. As we're starting to get kind of more visibility from workhorse, some of these other agreements on the school bus side, when do we think we're going to be in a position to start giving kind of either quarterly or annual guidance here? Is that a quarter or two away, is that next year? Just any sense on kind of where we are as far as gaining more visibility there?\n\nFraser Atkinson -- Chief Executive Officer\n\nWell, the comfort level is – we're getting more comfortable with where we are with the finished goods, but not as comfortable in terms of what's – what's coming down the pipe in terms of the follow-on quarters into March and June. So with the deliveries that, I was talking about and the activities that Brendan was commenting on earlier is that, if we're able to get the substantial number of those Nano BEAST, BEAST deployed and the cargo vans as well as the CCs deployed with the principal focus on Workhorse and then a secondary focus on other opportunities with those cabin chassis. We're able to accomplish those three then I think this later on this fall, we'd have much better visibility on what we're able to forecast off of. I think our approach to date has been that until we can get there and to move through somewhat of the lumpiness of the customer orders, other approvals, deliveries, which has been a big impact for us in the past.\n\nThat with this higher level of deliveries across these different categories will give us the ability to provide for guidance on deliveries going forward.\n\nChris Souther -- B. Riley Financial -- Analyst\n\nThat makes sense. I appreciate the color there. I'll hop in the queue. Thanks, guys.\n\nOperator\n\nAnd the next question is from Craig Irwin from ROTH Capital Partners. Please go ahead.\n\nCraig Irwin -- ROTH Capital Partners -- Analyst\n\nGood morning, and thank you for taking my questions. Fraser, as we're talking to different school districts participants out there about the vouchers that we're expecting from EPA. One of the biggest concerns is time line for delivery of the buses from the different vendors out there. I'm hearing that, other vendors are talking about one year and possibly two-year lead times for delivery of electric school buses.\n\nCan you maybe discuss for us what a reasonable scenario would be if someone does get vouchers and select GreenPower for the BEAST or the mini BEAST and what your ability might be to flex to serve that given the issues that are still very real in supply chain?\n\nFraser Atkinson -- Chief Executive Officer\n\nGreat question. So I think we should break that down into two components. And the first being that the EPA program doesn't have the same level of certainty of many of the other school bus programs that we've been able to leverage or our customers have been able to take advantage of. And what I mean by that is that, for example, the California Energy Commission, or CEC funding with the air quality management districts once you've lined that up and that's been approved, then you have certainty in terms of your funding partner to be able to move forward with your purchases.\n\nWith the EPA program, they are taking these submissions. The expectation is that the submissions will exceed the available funding. So if -- and there is a requirement for the funding to hit to allocate to each and every state that has at least one applicant. So the expectation is that there won't be 100% receipt for the applications that go into that funding.\n\nSo you may get to your deal approved, you may not. And so that's the uncertainty with the EPA program that we won't know how it unfolds until we get to October, possibly November, in terms of when they start to push out the contracts for the fund, for the EPA funding. When they do push it out, if the applicant is successful and is moving forward with the GreenPower BEAST or Nano Beast under the program than the contracts once they're signed, the program allows for a two-year delivery cycle. What we thought -- what we view as being able to properly or fully leverage this program is being in a position to deliver those first couple of vehicles.\n\nAnd so an applicant that is lucky enough to get up to the maximum of 25 vehicles under the program is it doesn't make sense to deliver all 25 at once because they're not going to have the charging or the infrastructure set up, they're not set up to train that number of people across the organization. It will be much more of a staged process. So what we want to do is to make sure that for a lot of these customers, we're able to deliver those first handful. And if they don't materialize, we've got as alternative, the various other funding programs that are in place for sales that have been that were -- that we've been working on in other states such as -- or other jurisdictions such as for the state programs in California.\n\nSo the summary is that we're not -- we certainly understand that some of our competitors have backlogs or indicating that their delivery time is 12, 15 months or even greater. But in our case, our focus has been on communicating to our prospect of customers that, getting the first number of BEAST or Nano BEASTs deployed with them and sort of working out the kinks, if you will, is much more advantageous for both parties in terms of really optimizing a full rollout of the program and being in a position with finished goods inventory helps us achieve that goal where others can't.\n\nCraig Irwin -- ROTH Capital Partners -- Analyst\n\nUnderstood. That's a healthy position. So my second question is about pricing in the market for EV school buses. So Blue Bird has had to put through 25% pricing in the last year, just to get margins to hopefully breakeven over the next couple of quarters.\n\nThis is obviously due to the heavy steel content in their vehicles and component cost increases, which we all know have been really dramatic. Your vehicles are made differently, have different bill of materials and you use a very different manufacturing approach. Can you talk about the pricing in the market and whether or not you feel that it's necessary to put through 25% price? And maybe does this help you be more competitive out there in the market than some of your peers?\n\nFraser Atkinson -- Chief Executive Officer\n\nWell, in terms of the -- sorry, go ahead, Brendan.\n\nBrendan Riley -- President\n\nYes. I was just going to talk quickly to the strategy the GreenPower uses also. So Craig, a couple of the most expensive component in EV right now, if you break it up in the systems, let's say, the battery is the single most expensive thing in any one of these vehicles, typically comes to almost half of the vehicle cost, in some cases, not all, and not in school buses, but in some of the other vehicles with larger batteries. But what -- GreenPower only makes EVs and we have battery commonality, cell and module commonality across all of our platforms.\n\nSo that gives us a much better, let's say, purchasing advantage, lower cost factor and better manufacturability. We also -- we use one brand attraction motors across all of our lines, so we get more competitive pricing, because we just buy a lot more of them. So I would say there is some upward pressure on costs, if you look at what it cost us to build vehicles. But because we're not just getting into the EV space right now, GreenPower has been at it, managing our supply chain and our vendors for really much longer than these guys have been -- exponentially longer than these guys have even been making EVs.\n\nWe believe, at least for that, we have a better pricing cost factor. And we are -- we have not announced any price increases, and we do have statewide contracts that we are comfortable with our existing pricing right now on our school buses that we submitted to. The other thing, Craig, I think we should consider here is that our use of aluminum has really helped us out where steel prices have gone up immensely. And aluminum dip for a bit, especially on the LME and some of the other big exchanges, we're finding that aluminum stabilized relatively quickly.\n\nAnd with our Constellium, our aluminum supplier's costs being relatively stable, we've not had to make the increases some of our competitors have. I'll turn it over to Fraser, for his comments.\n\nFraser Atkinson -- Chief Executive Officer\n\nWell, thank you. I think the only thing I'd add is that -- and you probably brought up one of the most relevant aspects of our build, Craig, is that our BEAST and our Nano BEAST and our EV Star Plus for that matter, all three are built with the aluminum extruded aluminum body with a fastener approach that gives it an incredible strength and some additional flexibility you wouldn't normally get in terms of a traditional build. But the most important thing is its lighter weight. So, it's stronger but lighter.\n\nSo we don't have to use as much materials as our competitors do. And none of our competitors have a build like this. And so that does give us a bit of a competitive advantage on that. And as part of the reason that in the case of the BEAST, we're able to have a product that with a 40-footer can accommodate up to 90 seats for passenger seats, for in that vehicle, which is best of class for any school bus of that length.\n\nSo that's for the combination of those two has allowed us probably a more stable cost structure to manage than some of our competitors.\n\nCraig Irwin -- ROTH Capital Partners -- Analyst\n\nUnderstood. Thank you for that. So, next about the Cab & Chassis and your tranche with Workhorse, I am not to ask specifically about Workhorse because I'm sure there's confidentiality provisions there. But your deliveries of Cab & Chassis buses or Cab & Chassis units, I should say, are in the single-digits, right? And there's an opportunity for a few hundred a quarter, maybe more.\n\nCan you talk about the ability to ramp deliveries in Cab & Chassis? What would it take for us to start seeing a couple of hundred units a quarter? Where are we in that cycle? Is this something that's fair potentially toward the end of the calendar year?\n\nFraser Atkinson -- Chief Executive Officer\n\nWell, I'll start off with what actually Brendan was talking about earlier on the earnings call, which is we're building in tranches of $100 million. So -- and as far as your single-digit, you're quite correct, that I believe that was the delivery in July, but we also had follow-on in early August. So it's sort of double what that delivery in July was. But on a more macro level is we build in tranches of $100 million.\n\nAnd before we can actually -- or not before we can. But before we do build the actual Cab & Chassis is that we need all of the significant and key components in hand in our part supply on the production line before we start that. So then we have to back up to make sure we've got 100 battery packs and that we have the 100 tranches orders. And we have all the electronics all are there before.\n\nSo there's a multiple stage of production that is occurring is that there's one level that our team is managing when I say team, we've got a group of six people that are full-time focused on this, where the -- they are managing the -- all of the key components up to the build of the Cab and Chassis. And so as Brendan said, at the end of June, we were substantially complete on the first 100, we were starting the next 100 in terms of the actual Cab and Chassis build, but we're also on the third 100 working on battery packs and the key components and the fourth 100 tranche and the fifth 100 tranche with -- in terms of supply chain on electronics and many of the other key subcomponents that go into the ultimate build. So, it's very much a layered process that is -- that we're working through that will result in the increased deliveries over the next quarter or two.\n\nCraig Irwin -- ROTH Capital Partners -- Analyst\n\nUnderstood. Understood. Well, thank you for taking my questions. Congratulations on the progress and the great positioning.\n\nAnd I'll take the rest of my questions offline.\n\nOperator\n\nThank you. And the next question is from Tate Sullivan from Maxim Group. Please go ahead.\n\nTate Sullivan -- Maxim Group -- Analyst\n\nThank you. And then following up on the Workhorse. Brendan mentioned earlier in the call that integration of the Workhorse EV CCs, I mean on the Workhorse side, what does that entail just testing the cabin -- well, I mean I'm sure it's more putting the cabin on top of your chassis. Can there be any determination from Workhorse in terms of when taking delivery of those CCs as well, too, please?\n\nBrendan Riley -- President\n\nYes. Tate, that's a very good question. So the integration is -- Workhorse has developed a very compelling body for these vehicles. Their W750 is a Step Van similar to what you see UPS or FedEx and now Amazon and some other uniform delivery companies, what have you driving around delivering packages with.\n\nI mean that's a vehicle that allows the driver to get into the back of the vehicle, walking through the cab itself, and then has a roll-up door typically in the back or hinge door in the back and sliding doors in the front, so you can just drive around with the sliding door open and just kind of pop out. That product has been largely developed and the prototypes have been out there and well received. They're currently finishing up their assembly line and making sure that, that's ready for the vehicles themselves. And there's always tweaking here and there.\n\nWe've introduced a new shifter for the vehicle. That's a rotary knob shifter, they're incorporating those into their newest vehicles and some other improvements that have been requested by the Workhorse folks, including regen and some other things to make the vehicle more drivable for their duty cycles. But that's really the integration we're talking about integration into production line and integrating some new features or some features that they believe are going to be compelling for their customers. As far as deliveries are concerned, we have a delivery schedule that we've been keeping to for them, and we have a first small number of vehicles coming out that that they're getting -- that they've gotten actually already that they're starting the line with before they start kind of mass manufacturing as it were.\n\nSo that's where we are right now. They've gotten their first tranche of vehicles for the production of the W750. GreenPower is sending out some engineers and technicians to work with their teams, kind of go through all the things that they're doing, making sure we're all aligned with all the processes and procedures. And then we're off to the races.\n\nSo we expect to be -- very soon we expect their line to be running at full clip, but we will leave it to them to announce when and where they're going to be doing that.\n\nTate Sullivan -- Maxim Group -- Analyst\n\nThank you. And I mean you have meaningful ramps ahead for most product lines. And can you talk about the number of employees that you potentially have to add to get there? Is it -- I mean, both in South care -- both for the school bus facility in West Virginia and your facility in California?\n\nFraser Atkinson -- Chief Executive Officer\n\nWell, we try to do a relatively modest employee ramp, make sure we baseline everything we have employees that are in very, very essential positions with the appropriate training. So we've already started hiring our South Charleston facility, West Virginia employees. We expect to have 150 to 200 employees by this time next year, just for the manufacturing school buses. And our California facility as well as product inspectors for our supply chain and QA/QC folks for supply chain incoming quality control folks.\n\nSo I would expect our workforce to quadruple by this time next year and a nice steady ramp up to that number.\n\nTate Sullivan -- Maxim Group -- Analyst\n\nThank you.\n\nFraser Atkinson -- Chief Executive Officer\n\nYou're welcome, Tate. Thanks for the questions.\n\nOperator\n\nThe next question is from Tyler DiMatteo from BTIG. Please go ahead.\n\nTyler DiMatteo -- BTIG -- Analyst\n\nHi. Good morning. Thanks for taking the questions. I just wanted to follow-up on the inflation reduction comments and the $40,000 tax credit.\n\nI know you gave that as an example. Can you speak to some of the other benefits that you guys could potentially see, especially on the school bus side?\n\nFraser Atkinson -- Chief Executive Officer\n\nWell, we're still sifting through all of the different programs that the build offers, to build, by the way, 725 pages. So it's -- there's a lot of -- a lot that the act is pushing through, but there is funding for infrastructure that will be very beneficial in terms of -- on the school bus side over and above what the EPA program is bringing to market. But the big federal driver right now is more of the EPA program with the $0.5 billion a year over the next five years.\n\nTyler DiMatteo -- BTIG -- Analyst\n\nOK. So I guess following up on that then. So in terms of positioning of the EPA program, like how would you stack up so far in your experience the Canadian incentives versus the US incentives? Like how do those two compare for GreenPower?\n\nFraser Atkinson -- Chief Executive Officer\n\nWell, I think the big thing is that two months ago, there wasn't really a federal program that provided funding that was directed to the commercial space. And when I say commercial space in terms of like our EV Star Cargo+, our EV Star Cargo, there wasn't federal funding. And what we have found in the past is that a big -- a growth driver that really gets legs is one that is -- has some federal backing or federal support and isn't regionalized as it has been with the California programs, NY. So in the case of the Canadian program, there are only a couple of other Class 4 vehicles where the suite of EV Star Class 4s on that program, we're one of the dominant eligible vehicles listed by Transport Canada.\n\nAnd so that's a program that was just introduced July 11th. And we have really been engaged with a number of different fleet operators in terms of taking advantage of that program, as well as the fact that you can stack it. So for example, our EV Star could generate -- or utilize a $75,000 voucher incentive on the federal program and then get an additional voucher in the province of British Columbia up to 75% of the purchase price of the vehicle. So that's a near-end driver that we're able to utilize both of those programs today.\n\nOn the Inflation Reduction Act, the $40,000 credit doesn't kick in for purchases until after December 31, 2022. So it will be a program that becomes a great sales tool this fall for deliveries that can occur literally on January 1, 2023 to utilize that credit.\n\nTyler DiMatteo -- BTIG -- Analyst\n\nOK. Great. Thanks, Fraser. Really appreciate the color there.\n\nI'll turn it back to the queue.\n\nOperator\n\nAnd the next question will come from John Jay from private investor.\n\nUnknown speaker\n\nGood morning, guys. I'm showing a lot of signs of progress. But in view of the inventories you're going to have to build up, what sort of money are you going to have to get hold of? And in what form might it be in order to satisfy these inventory buildup?\n\nMichael Sieffert -- Chief Financial Officer\n\nWell, we're pretty happy with the current level of inventory in terms of the different groups or go-to-market groups. So as we talked about with the school bus side, we see more drawing down what we have, not adding to or maintaining an inventory level. Same with the cargoes is that that's more of a timing situation in terms of the vouchers are aligned with the cargos are ready to be delivered. So over the next number of months, we expect to deliver substantially all of the approximately 40 cargo vans that we have.\n\nAnd likewise, with the cabin chassis, the priority is with Workhorse. And then secondarily, there's the other market opportunities that we have to deploy cabin chassis. So across the different categories, we expect to be drawing down in a number of these as opposed to just continually adding or building up additional inventory. So that's the first part.\n\nAnd then the second part is that if there is a substantial uptick in additional orders on school buses, which will have much better visibility in the next two to three months. And with other categories of vehicles is, as Michael referred to in his comments earlier, we have been working on traditional financing structures that in terms of debt facilities that we could utilize with increased requirements this fall or this winter.\n\nUnknown speaker\n\nVery good. I get the sense that you satisfy with where you are in terms of capital and that as the sales unfold then you will act accordingly.\n\nFraser Atkinson -- Chief Executive Officer\n\nExactly.\n\nUnknown speaker\n\nVery good. Well, thank you. I appreciate it.\n\nOperator\n\nLadies and gentlemen, this concludes our question-and-answer session. I would like to turn the conference back over to management for any closing remarks.\n\nFraser Atkinson -- Chief Executive Officer\n\nSo thanks, everyone, for listening into Green Power's earnings call. We're very excited about our current position and we believe we have very strong product offerings in the different markets that we're addressing. And as the last caller just asked about, we believe we are well positioned with product that can be delivered to our customer base as we work through the balance of various vouchers requirements and take advantage of customers that now have approved vouchers that we can deliver product for. So exciting time for us in the next quarter too and we look forward to providing our stakeholders and shareholders with our next update.\n\nThanks for listening in to the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichael Sieffert -- Chief Financial Officer\n\nFraser Atkinson -- Chief Executive Officer\n\nBrendan Riley -- President\n\nChris Souther -- B. Riley Financial -- Analyst\n\nCraig Irwin -- ROTH Capital Partners -- Analyst\n\nTate Sullivan -- Maxim Group -- Analyst\n\nTyler DiMatteo -- BTIG -- Analyst\n\nUnknown speaker\n\nMore GP analysis\n\nAll earnings call transcripts"
}