{
  "companyName": "Elevance Health Inc.",
  "companyTicker": "ELV",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/19/elevance-health-inc-elv-q3-2022-earnings-call-tran/",
  "content": "Elevance Health Inc. (ELV 0.02%)\nQ3 2022 Earnings Call\nOct 19, 2022, 8:30 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. And welcome to the Elevance Health third quarter earnings conference call. [Operator instructions] I would now like to turn the conference over to the company's management. Please go ahead.\n\nSteve Tanal -- Vice President, Investor Relations\n\nGood morning, and welcome to Elevance Health third quarter 2022 earnings call. This is Steve Tanal, vice president of investor relations. And with us this morning on the earnings call are Gail Boudreaux, our president and CEO; John Gallina, our CFO; Peter Haytaian, president of Carelon; Morgan Kendrick, president of our commercial and specialty business division; and Felicia Norwood, president of our government business division. Gail will begin the call with a brief discussion of the quarter and recent progress against our strategic initiatives.\n\nJohn will then discuss our financial results and outlook in greater detail. After our prepared remarks, the team will be available for Q&A. During the call, we will reference certain non-GAAP measures. Reconciliations of these non-GAAP measures to the most directly comparable GAAP measures are available on our website elevancehealth.com.\n\nWe will also be making some forward-looking statements on this call. Listeners are cautioned that these statements are subject to certain risks and uncertainties, many of which are difficult to predict and generally beyond the control of Elevance Health. These risks and uncertainties can cause actual results to differ materially from our current expectations. We advise listeners to carefully review the risk factors discussed in today's press release and in our quarterly filings with the SEC.\n\nI will now turn the call over to Gail.\n\nGail Boudreaux -- President and Chief Executive Officer\n\nThanks, Steve, and good morning, everyone. Today, we're pleased to share that Elevance Health delivered another strong quarter. This morning, we reported third quarter GAAP earnings per share of $6.68 and adjusted earnings per share of $7.53, ahead of expectations and reflecting strong revenue and earnings growth across our businesses. Based on our year-to-date results and confidence in our momentum, we are increasing our full year adjusted earnings guidance to greater than $28.95 per share, representing growth of approximately 15% off of the adjusted baseline we provided at the beginning of the year.\n\nBefore we discuss the quarter in more detail, I want to spend a moment on the recent hurricane that have tragically impacted the lives of people in Florida and Puerto Rico, including some of our own health plan members and associates who live and work in the impacted areas. As an organization deeply rooted in our communities, the impact of these disasters is personal. I'd like to thank our associates who are leading efforts to provide water, food, durable medical equipment, transportation, and shelter, along with our clinical teams, social workers, and behavioral health specialists for their extraordinary commitment to support those in need. It's in times such as these that our culture shines through.\n\nAnd I am proud of our associates for the work they are doing to support their colleagues and communities. Turning to our business performance, we are pleased to report ongoing, broad-based momentum across Elevance Health, a testament to our integrated and personalized whole health approach to addressing the physical, behavioral, and social needs of our members and communities. Our focused efforts and investments in these areas are resonating with employers and state partners, driving strong organic membership growth in our commercial and government health benefit businesses, as well as rapid growth for Carelon and IngenioRx. While our business trends remain strong, we are mindful of the inflationary pressure and general uncertainty in the economic environment and are focused on delivering affordability and value for customers and consumers in all of our businesses.\n\nMedical membership grew 5% year over year to 47.3 million members. Over the past year, we've grown to serve 2.2 million more consumers, with both our commercial and government businesses delivering robust growth that solidifies our position as the largest carrier by U.S.-based medical membership. In the employer market, we continue to gain market share on the strength of our leading cost to care position and innovative consumer products, such as our total health connections suite of advocacy solutions. Total health connections is an example of where we're delivering an integrated whole health experience for consumers by guiding members to the next step in care through a simple, intuitive, and personalized experience.\n\nOur clinical advocates help members navigate the healthcare system, leveraging real time data analytics to identify health risks that enable our advocates to personally connect with members and help them proactively manage the medical, behavioral, and social issues impacting their health. Health connections has grown more than 60% over the past few years and will support more than 5 million of our members in 2023. In addition to advocacy solutions, our integrated digital offerings are also gaining momentum. Sydney Health, the digital front door for our members health needs, continues to rapidly expand the number of registered users and is now hosting more than 6 million visits every month.\n\nWe are also seeing strong members satisfaction with our virtual primary care offering, which is available through Sydney Health and integrated into our commercial products and is increasingly being used to support members with chronic conditions, such as hypertension and Type 2 diabetes. Our findings reflect that 62% of the top 10 diagnoses to date have resulted in the treatment of chronic conditions, demonstrating that virtual primary care can improve access to needed care with the potential to improve health outcomes and reduce overall costs. Turning to our Medicare business, we're well-positioned to achieve another year of above market growth in individual Medicare Advantage membership. For 2023, we expanded our Medicare Advantage offering to 145 new counties and added PPO plans in 210 counties, significantly increasing our reach into this important market as we continue to deliver differentiated value for seniors with strong core benefits and industry-leading supplemental offerings.\n\nWith widespread pressure on the cost of daily living, affordability and value are more important for seniors than ever, and our health plans are positioned to meet their needs. Nearly 75% of our Medicare Advantage plans will have a $0 premium and no co-pays for primary care in 2023. Our supplemental benefits include popular over-the-counter offerings, transportation, dental and vision, as well as in-home support and healthy groceries. Seniors on our plans will also now have a simplified way to access and keep track of their benefits with a single prepaid card that is customized with spending amounts for their unique benefits and can be used at thousands of participating retailers or on an online portal.\n\nMedicare star ratings remain a key focus area across Elevance Health. Many of our affiliated Medicare Advantage plans continue to earn high-quality scores, and we're particularly pleased with the performance of our HealthSun Health Plans in Florida, which received a five-star rating for the sixth year in a row in the recently released 2023 Medicare Advantage star ratings, which will impact the 2024 payment year. In aggregate, we did see a modest drop in the percentage of our members in four-star or higher-rated plans for the 2024 payment year, predominantly due to the end of COVID era relief. And while we will decline by less than the overall industry, we remain intensely focused on our long-term goal of achieving and maintaining star ratings at the high end of all Medicare Advantage plans in our markets.\n\nCarelon continues to accelerate its impact and drive differentiated value for Elevance Health plan members. In the third quarter, we began implementing and rapidly scaling the myNEXUS post-acute care management product, which is now serving our Medicare Advantage members in 15 markets with plans to add more markets in the coming quarters. This new product offering represents a major service line expansion that helps optimize appropriate levels of care post inpatient discharge by working with acute and post-acute facilities to safely manage patient transitions and thereby reduce hospital readmissions and average length of stay. Carelon is also delivering distinctive cost and quality results for our commercial business at scale.\n\nAs we discussed earlier this year, Carelon's AIM Specialty Health business expanded its risk-based contract with our commercial health plans to perform focused management of select clinical conditions, such as oncology, surgery, and diagnostic imaging to cover our entire 14-state footprint at the beginning of this year. AIM has been performing well year to date, benefiting our commercial members while producing stable, predictable costs of care for complex conditions for our commercial health plans and driving growth for Carelon. Our enterprisewide focus on health equity remains central to our strategy and continues to guide our business decisions and targeted investments. We were pleased that our Simply Healthcare Plans in Florida recently achieved health equity plus accreditation by the National Committee for Quality Assurance with an almost perfect score.\n\nSimilarly, Anthem Blue Cross' individual exchange plan in California achieved NCQA distinction in multicultural healthcare. Awards like these show our commitment and progress to identify and address local, social, and physical drivers of health with an emphasis on members who need us most. These results would not be possible without the dedication of our more than 100,000 associates. And I would like to thank them for the important work they do and the impact they make every day.\n\nTheir passion and commitment is reflected in our recent recognition as a great place to work for the third consecutive year and also in our inclusion on the 2022 Fortune Best Places to Work For and PEOPLE's Companies That Care. Our associates take pride in the work they do and the difference their contributions make to our company, our members, and the community. We see this every day; and most recently, in the results of our associate engagement survey, which showed that 96% of associates understand and are inspired by our purpose to improve the health of humanity. These strong results and national recognitions reflect our commitment to leadership and represent our employees experience defined by high levels of trust, respect, credibility, fairness, and pride, and help our efforts to recruit and retain top talent, a reflection of our culture.\n\nOur passion to improve lives and communities is unwavering, and we look forward to making a meaningful difference at Elevance Health. Now, I'd like to turn the call over to John for more on our operating results. John?\n\nJohn Gallina -- Executive Vice President and Chief Financial Officer\n\nThank you, Gail, and good morning to everyone on the line. As Gail mentioned earlier, we reported third quarter adjusted earnings per share of $7.53, an increase of approximately 11% year over year, driven by broad-based momentum across our enterprise. We are pleased to have delivered another quarter of double-digit growth in revenue, operating income, and adjusted earnings per share, driven by the disciplined execution of our strategy and ongoing growth of health benefits and services businesses, progressing us further down our path of transforming from a health benefits company to a lifetime trusted partner in health. We ended the third quarter with 47.3 million members, growing 2.2 million, or nearly 5% year over year, including growth of 232,000 members in the third quarter.\n\nOur industry-leading organic enrollment growth, which constituted nearly 90% of our total enrollment growth year over year, was led by strong sales in our commercial fee-based membership; growth in Medicaid, driven in large part by the ongoing suspension of eligibility redeterminations; and growth in excess of the overall market in our individual Medicare Advantage business, primarily driven by dual eligible members. We supplemented strong organic growth with the acquisitions of the Paramount and Integra Medicaid health plans, which, together, added approximately 300,000 Medicaid members earlier this year. Operating revenue in the third quarter was $39.6 billion, an increase of $4.1 billion, or approximately 11% over the prior year quarter, with strong growth in each of our businesses. We earned higher premium revenue driven by membership growth in Medicaid, including the acquisitions of Integra and Paramount, Medicare, and commercial risk and fee-based membership growth, and premium rate increases to cover overall cost trends in all of our health benefits lines.\n\nOur services businesses, Carelon and IngenioRx, produced very strong growth as we continue to execute against our long-term growth strategy. IngenioRx grew revenue 11% year over year, while the other segment, comprised primarily of Carelon, grew operating revenue 26%. Carelon and IngenioRx are delivering significant value to our commercial and government health plans. And consistent with our strategy, we continue to increase the breadth and depth of services Carelon is providing.\n\nRevenue eliminating consolidation, a proxy for affiliated business between our risk-based health plans and our services businesses, grew 17% year-over-year in the third quarter, representing approximately 21% of our consolidated benefit expense, up from approximately 20% a year ago. The consolidated benefit expense ratio for the third quarter was 87.2%, a decrease of 50 basis points over the third quarter of 2021. During the quarter, we realigned certain quality improvement expenses incurred since the beginning of this year, which had a favorable impact on our benefit expense ratio and an offsetting unfavorable impact on our SG&A expense ratio with no impact on operating earnings. Excluding the impact of the accounting realignment, our benefit expense ratio would have been approximately flat year over year and better than our expectations.\n\nWe were pleased to deliver operating margin expansion in our commercial business, driven in part by stronger medical underwriting performance in our commercial group risk business. The successful July 1 renewal process, where we repriced approximately 25% of our large group risk business, and the continued increases in penetration of services into our fee-based businesses contributed to the segment's performance. We were pleased with the retention of our July 1 renewals and have even more confidence as we approach the January 1 renewal date. Elevance Health SG&A expense ratio in the third quarter was 11.4%, an increase of 30 basis points over the prior-year quarter.\n\nThe increase was primarily driven by spend to support growth and the realignment of certain quality improvement expenses as previously described. Excluding the realignment, our SG&A ratio would have improved by approximately 20 basis points year over year. Third quarter operating cash flow was $4.9 billion or 3.1 times net income, driven primarily by the early receipt of certain fourth quarter premium revenue from CMS during the third quarter. We also paid our share of the Blue Cross Blue Shield Association's litigation settlement of approximately $500 million in the quarter.\n\nExcluding both of these items, operating cash flow would have been $3 billion or 1.9 times net income, another indication of high-quality earnings. Turning to our balance sheet, we ended the third quarter with a debt-to-capital ratio of 39.7% in line with our expectations and consistent with our target range. During the quarter, we repurchased approximately 1.2 million shares of common stock for $579 million. Year to date, we've been opportunistic with respect to share repurchases during periods of volatility in our share price and have already repurchased 3.7 million shares for $1.7 billion, exceeding our initial outlook of repurchasing at least $1.5 billion in 2022.\n\nWe continue to maintain a prudent posture with respect to reserves. Days and claims payable stood at 47.7 days at the end of the third quarter, a decrease of 0.1 day sequentially, but an increase of 0.9 days year over year. Given strong performance year to date, we are increasing our full year earnings outlook. We now expect adjusted earnings per share to be greater than $28.95, implying growth of approximately 15% off the adjusted baseline of $25.20 provided at the beginning of the year.\n\nOur businesses are continuing to perform well with strong momentum that we expect will carry into 2023. While we will not provide specific guidance for 2023 on this call, I would like to review some known tailwinds and headwinds worth considering as we continue planning for 2023. Starting with the tailwinds. The continued execution of our commercial margin recovery in 2023 through disciplined underwriting to cover our forward view of medical cost trends enhanced operating efficiencies and ongoing strategies to improve the productivity and profitability of our commercial fee-based business.\n\nThe growth we anticipate in our individual ACA and employer-sponsored membership as consumers transition coverage when Medicaid eligibility redeterminations resume. We expect strong earnings growth in Medicare Advantage, driven by membership growth in excess to the broader market and operating margin expansion that we expect will be driven by three primary factors: number one, having 73% of our Medicare Advantage members in four-star or higher-rated plans for the 2023 payment year, an increase of 15 percentage points year over year; number two, the continued recovery and risk adjustment as utilization has returned to more normalized levels; and number three, a relatively strong funding environment for the overall industry in 2023. Finally, we expect ongoing momentum in Carelon services and IngenioRx, which will carry in the next year. Our tailwinds will be weighed against one known headwind, and that is the membership attrition and related impacts on our Medicaid business, as eligibility redeterminations are conducted over the course of the next year.\n\nAlthough interest rates continue to rise rapidly, investment income is not expected to be a material tailwind or headwind. In 2022, we enjoyed significant outperformance in our alternative investments in the first half of the year. Rising interest rates are expected to benefit the second half, and we are anticipating a full year benefit from higher rates in 2023. While performance in both years is expected to be strong overall, I would not call out investment income as a material tailwind or headwind for either 2023 or 2022 at this point.\n\nWe're also mindful of the uncertain economic environment and the risk that business conditions could deteriorate. While the balance and resilience of our enterprise and the momentum we have across our businesses leaves us well-positioned for growth in the coming years, a more severe recession could create challenges. Our associates are prepared to adapt to any change in the business environment with detailed plans that ensure we will remain positioned to meet the unique needs of our clients and customers as they evolve with a commitment to affordability and value throughout. Accordingly, at this point in time, we expect to produce another year of growth and adjusted earnings per share in line with our long-term target compound annual growth rate in 2023, which is consistent with the current consensus estimate.\n\nWe look forward to providing more specific guidance on our fourth quarter earnings call. In closing, we continue to execute against the strategic priorities we mapped out at our 2021 investor conference and are pleased to have delivered another strong quarter, while also continuing to reinvest in our business, better positioning us to deliver strong growth for years to come. With that, operator, please open the line for questions.\n\nOperator\n\n[Operator instructions] For our first question, we'll go to the line of Justin Lake from Wolfe Research. Please go ahead.\n\nAustin Gerlach -- Wolfe Research -- Analyst\n\nHey, guys. Thanks for the question. This is Austin on for Justin here. On commercial margins, just focusing on that for a second, you guys showed some sequential improvement there.\n\nBut looks like you probably need around 300 basis points to kind of hit that 25 target range that you laid out there. Just curious on the pacing of that. How much are you expecting to come in '23 and '24? And then maybe a slight follow-up there. You mentioned retention, John.\n\nYou know, how did that track versus typical on those July 1 renewals? Thanks.\n\nJohn Gallina -- Executive Vice President and Chief Financial Officer\n\nYeah, no, thank you for the question. And maybe I'll start out and then turn it over to Morgan Kendrick to fine tune some of the comments on retention. But in terms of the pacing, you know, as I had stated, you know, 90 days ago, you know, we expect that, you know, that 300 basis points is a 2025 target. And it'll be a little bit more heavily weighted to the beginning half of the timeframe.\n\nSo, as you know, we just repriced about 25% of our large group fully insured business here on July 1st. We're going to reprice about 50% of that business on January 1st. The other 25% goes throughout the year. Obviously, it's going to take a couple of years for that to get to the point where it needs to get to.\n\nAnd then, the really nice trajectory and improvement we're having on upselling our fee-based businesses are 5-to-1 to 3-to-1 strategy. It's going very much accordance to our expectations and the plans that we laid out, which actually do have us going through 2025. So, I think the short answer to your question is a lot more of the improvements early on, but we will take till 2025 to get there. With that, Morgan?\n\nMorgan Kendrick -- President, Commercial Business\n\nYeah. Thanks, John. And thanks for the question, Justin. You know, as John said, this is going to be -- it's going to take a bit to get it completely turned.\n\nJuly came in actually as expected. Certainly, there was some attrition in the large group risk business. To give you some concept there -- context there as it relates to January, John said about 50% of that business is up for renewal. We have just released those in market, so it's a bit early to tell.\n\nBut our expectations are that there will be some attrition, which is would be natural when we're right pricing this business. And we are, you know, unmoved by anything being different than expected as we move forward.\n\nGail Boudreaux -- President and Chief Executive Officer\n\nThanks, Morgan. And thanks, Austin, for the question. And I think as you heard from both John and Morgan, we feel we're making really good progress in this business. And as I shared in my opening comments, we're seeing really strong uptake, particularly in our fee-based business, along with just one process and say, overall, it met our expectations on attrition to be real specific.\n\nSo, overall, feel very good about the quarter and where we're heading on commercial. Next question, please.\n\nOperator\n\nNext, we'll go to the line of A.J. Rice from Credit Suisse. Please go ahead.\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nHi, everybody. Thanks for the question. Maybe just get you to comment a little bit on the trends in the government business. I know you swung to a little bit of a decline in margin year to year in the government.\n\nCan you just parse out a little bit more what you're seeing there? And then, any read on the landscape files and your expectations around MA growth next year? I know you said, John, I think, solid growth. I'm just wondering if there's any way to flesh that out further at this early date.\n\nJohn Gallina -- Executive Vice President and Chief Financial Officer\n\nThank you for the question, A.J. So, you know, our government business division is actually performing very well. And for the year, you know, we're certainly going to be posting some very strong results. Both Medicaid and Medicare have been growing nicely.\n\nAnd I think that's evidenced by the excellent top-line growth we've seen of over 13% year over year. You know, Medicaid performance is strong. But, you know, for Medicaid, and we've said this in the past, on a quarterly basis, results can be a bit more variable and susceptible to swings. And when viewed in isolation, any one quarter could be misleading.\n\nYou know, Medicare is continuing to perform consistent with our expectations and, as you know, has significant upside for 2023. If you think about Medicare and improving star ratings that I talked about in my prepared comments, the more complete and accurate risk scoring that will allow us to enhance revenue in those areas. We feel very well-positioned for the future of our Medicare Advantage book. And, you know, in terms of '23 growth, it is premature to provide specifics associated with 2023 growth.\n\nBut our goal is to clearly grow faster than the industry. And we have done that on a percentage basis now for the last several years in a row and expect to do that for the next several years ongoing. So, thank you for the question, A.J.\n\nGail Boudreaux -- President and Chief Executive Officer\n\nYeah. And thanks, A.J. Maybe I'll ask Felicia Norwood, who leads our government business, to provide a little bit more color on our Medicare Advantage. You know, it's early.\n\nWe just started the AP process. And as John said, we feel confident about above market growth. But she can give you a little perspective on just how we're seeing in the marketplace. Felicia?\n\nFelicia Norwood -- President, Government Business Division\n\nYeah, thank you, Gail. And good morning, A.J. As Gail said, it is certainly very early in the Medicare Advantage annual election period. But, you know, we're pleased with what we've seen so far around our competitive positioning.\n\nYou know, when we think about our supplemental benefits, they really compare favorably with our competitors. And we really lead the industry in terms of our everyday extras, our over-the-counter offerings, transportation benefits, and certainly those things that are focused on addressing the whole health needs of our members and those social drivers of health. Additionally, as you know, we actually improved our footprint by expanding into 145 new counties on the HMO side and then 210 counties from a PPO perspective. So, while we're early in this process, based on the feedback we're getting from our distribution channel and others, we feel very good about how we are positioned as we head into AEP and look forward to continued growth in this business.\n\nThank you.\n\nGail Boudreaux -- President and Chief Executive Officer\n\nThanks for the question. Next question, please.\n\nOperator\n\nNext, we'll go to the line of Lance Wilkes from Bernstein. Please go ahead.\n\nLance Wilkes -- AllianceBernstein -- Analyst\n\nYeah. Thanks. And good morning. Can you talk a little bit about IngenioRx? And what I'm interested in is the progress in cross-sales for '23 that you're seeing thus far in the self-insured book.\n\nAnd then with the contract with CVS ending in '24, just wondering if you're entering into sort of a rebidding process, or what the strategy is on a go-forward basis for that. Thanks.\n\nGail Boudreaux -- President and Chief Executive Officer\n\nYeah, thanks. Thanks for the question, Lance. I'm going to have Peter Haytaian, who leads that business, give you a perspective on Ingenio. But overall, you know, just to say, we're really pleased seeing some really, really strong growth in Ingenio and, more importantly, integrating it into our 5-to-1 and 3-to-1 strategy.\n\nSo, I think Pete can provide you a lot more granularity on kind of what we're seeing in the market. Pete?\n\nPeter Haytaian -- President, Diversified Business and IngenioRx\n\nYeah, thanks a lot. I'll answer that question. We are very pleased with both the operating performance and the growth in Ingenio. Just to put a little bit more color on that.\n\nWe are, as you know, trying to be a different PBM. We're talking about the integrated whole health value proposition. And that does continue to play through nicely in the marketplace. This year, we're seeing, as it relates to your specific question on the ASO growth, the 5-to-1 to 3-to-1, about a 300% improvement year over year in terms of net new members that we're selling this year.\n\nWe're seeing good RFP activity. I'd say really strong performance in the middle and downmarket, where we perform very, very well financially. And work integration actually plays very well. Upmarket, as you would expect, there's a little bit more stickiness, especially in light of the economic situation we're in.\n\nBut overall, we feel very good about our growth and prospects as we move forward. As we head into next year, you know, we're already into the '23 selling season. It's well underway. We have good visibility on our growth.\n\nAnd again, we're seeing a lot of activity in the middle market and downmarket. The feedback we're getting right now from the brokers, from a distribution perspective, is our headline rates look really good. The other thing that we're very focused on as it relates to Ingenio is upselling additional products and services, so things like cost relief programs, specialty condition management programs, and digital adherence programs. So, it's moving in the right direction.\n\nGail Boudreaux -- President and Chief Executive Officer\n\nThank you. Next question, please.\n\nOperator\n\nNext, we'll go to the line of Scott Fidel from Stephens. Please go ahead.\n\nScott Fidel -- Stephens, Inc. -- Analyst\n\nHi. Thanks. Good morning. Was interested if you could just talk about the competitive environment and managed Medicaid a bit, particularly as we're in a pretty active RFP cycle right now and with a couple of other big states coming up and with a couple of the competitors having, you know, shown some improved momentum in some of the recent RFP results.\n\nSo, kind of interested just in the competitive backdrop and then what Elevance is doing right now strategically or tactically to try to keep your competitive edge of Medicaid. Thanks.\n\nGail Boudreaux -- President and Chief Executive Officer\n\nThank you. I'm going to ask Felicia Norwood to address your question.\n\nFelicia Norwood -- President, Government Business Division\n\nSo, good morning, Scott. In many respects, you know, the Medicaid space has always been competitive. But you're right, it's certainly become hyper competitive recently and we continue to be, I think, well positioned around our success. When I take a look at the RFP process, as you know, states really delayed part of the RFP process in the midst of COVID, but things have certainly wrapped up significantly over the past year or so.\n\nWhen I take a look at where we are, our focus has really been around health equity, population health. You heard Gail referenced earlier our NCQA distinction with respect to health equity. And our state partners are certainly looking at health plans who can help them improve outcomes and focus specifically on those health equity areas that we've been working on here at Elevance Health. So, I feel strongly about our ability to kind of elevate and advance health for our members and address the needs of our state partners at a local level.\n\nWhen I look at the RFP opportunities, we've been focused on -- you know, certainly, California was significant, a really big win for us. We won in every county, we were able to win in. And we actually picked up a county that was a new county for us, so a very strong performance there. We recently also reprocured our RFP in Puerto Rico coming in first, and that demonstrated to me continued strong momentum in terms of our ability to address the needs of our state partners.\n\nAnd most recently, yesterday, having the D.C. City Council approved a new win for us in the district. So, I continue to see momentum around our value proposition, being able to respond to the needs of our state customers, and meet our Medicaid members where they are, as we continue to focus on health equity, improved outcomes, and advancing those issues that we know are very important to our state partners.\n\nGail Boudreaux -- President and Chief Executive Officer\n\nThank you. Next question, please.\n\nOperator\n\nNext, we'll go to the line of Nathan Rich from Goldman Sachs. Please go ahead.\n\nNathan Rich -- Goldman Sachs -- Analyst\n\nGood morning. Thanks for the question. I wanted to ask on medical cost trend. I think the MCR was flat year-over-year, excluding the accounting adjustment.\n\nLast quarter, John, I think you had talked about medical cost trend being elevated in the back half of the year. But it sounds like that might have come in a little bit better than your expectations. So, what did you see play out by line of business? And as we think about your outlook for next year, how are you thinking utilization will trend into 2023? And if I could just add a quick clarification on the accounting adjustment, could you provide more details on what costs moved out of benefit expenses? And I guess, importantly, whether future periods will be impacted by this change? Thank you.\n\nJohn Gallina -- Executive Vice President and Chief Financial Officer\n\nThank you for the questions, Nathan. So, let me do the easy one first, and that was the accounting adjustment. So, during the third quarter, you know, CMS provided clarifying guidance on the types of cost that can be included in the quality improvement cost and, therefore, considered benefit expense versus those that need to be classified as SG&A. You know, in our GAAP presentations have historically always mirrored the CMS definitions and requirements.\n\nSo, when CMS clarified those definitions, we realigned our reporting accordingly. And so, just to be clear, the impact for the third quarter was to improve NOR by about a half of 1%, which would then make the negative impact on SG&A about one half of 1% with no impact on the bottom line, clearly a reclass. For the full year, there will be about a 20 basis point impact on each of those. And then in terms -- you know, and we always, always try to be fully transparent.\n\nSo, we wanted to ensure everyone was aware of the nuances in this reporting and what we will see by the end of the year of about a 20 basis-point benefit to NOR for this clarification that CMS provided that we aligned with. So, hopefully that helped from that perspective. And then, in terms of the of the trends and costs and utilization in general, you know, as you've stated, you pointed out without the reclassification, our NOR would've been flat, which is actually a nice improvement because of a mix on a mix adjusted basis, you know, since our government membership now is a higher percent of our fully insured membership than it was a year ago. So, third quarter did come in better than expected.\n\nBut the overall cost structure of the health system is still a bit higher than what it would've been had COVID never occurred. But I think the most important element of all this is that our trends continue to be in line with our expectations in each of our lines of businesses. So, you know, associated with lines of businesses, Medicaid is doing slightly better than historical levels. Medicare is very much in line.\n\nYou know, we're seeing outpatient a bit higher and inpatient a bit lower, helping offset to have a more normalized trend. And then commercial has been very consistent with our last several quarters, where outpatient continues to be higher, but even more so than the benefit that we're seeing in inpatient. And so, that's been all part of the process and all part of the guidance. So, we're obviously not going to comment on 2023 at this point in time.\n\nBut hopefully, that answers all your questions.\n\nGail Boudreaux -- President and Chief Executive Officer\n\nNext question, please.\n\nOperator\n\nNext, we'll go to the line of Steven Valiquette from Barclays. Please go ahead.\n\nSteven Valiquette -- Barclays -- Analyst\n\nGreat, thanks. Good morning, everybody. So, I guess just, you know, regarding the potential migration in 2023 of the ineligible Medicaid members into commercial and exchange plans, I guess I'm curious whether or not there's been any evolution in your key states that might allow Elevance to more directly funnel your own ineligible Medicaid members into your own exchange plans. So, could this be more of a controlled process for the industry now versus maybe, you know, where it stood a year ago? Or would you still just describe the Medicaid market environment for 2023 is really just kind of a big jump ball for all MCOs to try to grab the ineligible Medicaid members next year? Thanks.\n\nGail Boudreaux -- President and Chief Executive Officer\n\nWell, Steve, thanks for your question. I think just a couple of, I'd say, clarifications. As we go through this process, we've been working very, very closely with our states and across our enterprise. And a few things that I think are important that we've shared with you in the past.\n\nOne, we've had a long time to plan for this and a long time to discuss this with each of our specific states. And each state will have a bit of a different process, but where we can, we're sharing data that the states allow us to do that. We're also working with community organizations to make sure that first and foremost, that everyone who's eligible for coverage retains eligibility for coverage. And I think that's probably where we start in this whole process, is ensure that those, just because of administrative things, etc., that we ensure that they have the right eligibility for the right program.\n\nFor those that are not going to be eligible for Medicaid, again, we're working across our commercial business, as well as our Medicaid business to provide, I think, the most education and seamless transition. If you start just a little bit of facts for our business. If you think about our 14 commercial states, Medicaid membership in those states grew roughly 7.5 million beneficiaries in those states. We, as part of our exchange footprint, now cover pretty much all of the counties in our footprint of 14 states and also have incredibly strong market share, not only in the exchange, but also in our commercial benefits business.\n\nSo, we think there's an opportunity, obviously, with our brand recognition, our dedication to this membership, our community involvement, and the work we're doing, again, with community partners, educating our commercial business to be, quite frankly, well-positioned and don't see it as a jump ball. We think we're actually quite well-positioned in those states. And in terms of our own, you know, Medicaid membership, approximately 2.7 million members -- million of those members came in as a result of the PAG. And obviously, we know those members well.\n\nThey know us well, they recognize our brand. And so, again, based on the state rules, and regulations will be working very closely to help that transition. So, I feel like, you know, given the time we've had to plan, the guidance from the administration, our work with the states, that actually this is going to be a much more organized process than I would call it just to jump ball, with a real opportunity for those who lead in the market to have an opportunity to move those members and keep coverage, which again, is our primary goal here. So, again, thanks for the question.\n\nAnd we look forward to continuing to update everyone on our progress there. Thank you. Next question.\n\nOperator\n\nNext, we'll go to the line of Rob Cottrell from Cleveland Research. Please go ahead.\n\nRob Cottrell -- Cleveland Research Company -- Analyst\n\nHi, good morning. Thanks for taking my question. I guess, I just wanted to ask about the negotiating environment with health systems. You know, there's been some conversation in the market about financial pressures across health systems leading to increased value-based care adoption.\n\nAre you seeing that play out across your negotiations and your contracting team? And do you expect that to ultimately have a positive impact for you all over the next year or two?\n\nGail Boudreaux -- President and Chief Executive Officer\n\nYes, thanks to the question, Rob. A couple of things. One, you know, I think it's been well documented that, our contracts are on a three-year end duration, so we negotiate again about a third of them each year. So, that just gives you a little context to the sort of discussions.\n\nClearly, you know, there is more cost pressure in the system. But overall, I would say our deals are coming in within normal range. And we continually are proactively managing that contract and our products, obviously, to offer affordability, continuing to look at our clinical strategies, ensure we can maintain our long-term trends, while also, as we shared with you, maintain our underwriting discipline to price to our forward review of those costs. Ultimately, it's affordability that's paramount for our customers, particularly in this economic environment.\n\nWe take that very, very seriously. Specifically to your question about value-based contracts with our providers, we are having those discussions. And quite frankly, we've made a lot of progress on our value-based contracts. We've shared with you roughly 60% of our total contracts are in value-based.\n\nAnd our goal is to move a lot more of those at least a third by 2025 to downside risk. I'm really pleased to share that we've made really good progress even in this last year and in the last quarter. And in now where we -- we're in sort of low double digits now in high teens in downside risk. So, making great progress against our goal to get to more downside risk in our contracts, as well as value-based care.\n\nSo, back to your question, we do think that there is an opportunity to continue to move more of these to value-based care. We are seeing progress not just on the hospital side, but across the broader provider care continuum. And the other thing that I think's important in trying to be a good partner with our care providers is we're also looking at how to reduce the administrative burden that they face. So, how do we accelerate the work we're doing on data sharing, reduce some of the, I'll call it, administrative care review processes that, you know, may not have the highest value.\n\nAnd I think those are big opportunities for us as well, in addition to just trying to increase rates. So, we've seen progress there. And we're committed to continuing to work with care providers so that, you know, obviously, that we have a good long-term partnership with them. But overall, we're not seeing anything outside of our normal ranges right now and have been very successful with these strategies.\n\nSo, thanks very much for the question. Next question, please.\n\nOperator\n\nNext, we'll go to the line of Lisa Gill from JPMorgan. Please go ahead.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nThanks very much for taking my question. Again, I want to go back to your earlier comment today around Sydney Health and virtual healthcare. So, you talked about, 6 million visits per month. You talked about improving outcomes and costs.\n\nBut I'm really interested in, when we think about 2023, are you offering a product in the marketplace where you have a lower premium, where your primary care doctor is virtual? So, that would be my first question. And then secondly, is there a way to quantify when we think about the potential cost benefit of utilizing virtual primary care?\n\nGail Boudreaux -- President and Chief Executive Officer\n\nSo, thanks for the question, Lisa. I'm going to ask Morgan to add some commentary, but just an overview. Yes, we are. So, first, Sydney is our front door to healthcare.\n\nSo, we have really embedded all of our capabilities in Sydney. And what I shared with you are a couple things. One, that virtual primary care is one of the elements of our care delivery strategy. And Morgan talked about the product offerings that we have there as well.\n\nBut we're also seeing it, and you saw some of the early data around an opportunity to help us manage chronics in a much more efficient way. And so, we're seeing a lot of uptake in that. And it's also embedded into what our customers are selecting. So, we're adding a lot more capability inside of Sydney.\n\nSo, a couple of very important just quick facts, but let me turn it over to Morgan to share with you a little bit about the product strategy, which is an element of our affordability offerings for the market.\n\nMorgan Kendrick -- President, Commercial Business\n\nRight, and thanks, Gail. And thanks Lisa for the question. You know, when you think about the commercial group business, you know, you've got generational cohorts, four of them, with Boomers X, Y, and Z that are part of the actual the makeup. And of course, the way they engage certainly is indeed different.\n\nVarious modalities are very important to us. And as such, we have products that we are launching that have a virtual-first component where one can elect a primary care physician that would be a digital connection as opposed to a physical connection. But it also allows for the opportunity to move into the physical world within the value-based constructs that Gail described in our value-based network strategies to keep a tight closed loop integration, so to speak, on how this works. One in particular that we've already launched for January 1st is in our Nevada market, which is a combination of a partnership with a single entity, but layered with a digital-first front end.\n\nThe economics of that arrangement are quite attractive in the market, and we're expecting nice pull through as the enrollment period concludes. But, you know, this is the beginning of it. We've been adding the virtual components to all of our commercial self-funded business and risk business over the past year and a half. And as such, we'll continue to build products anchored around those assets.\n\nThanks again for the question.\n\nGail Boudreaux -- President and Chief Executive Officer\n\nYes, thanks, Morgan. And, Lisa, just sort of two important concepts that I want to reiterate. One that we've embedded virtual capabilities for our customers across the board. And we're also aligning those with our high-performance networks.\n\nAnd we talk about best costs in the marketplace and what's really driving a lot of our growth. It's that affordability. And again, it's not just virtual for virtual by itself, but it's aligned to our high-performance network strategy. And then second, as Morgan said, we're in -- I would say earlier days, but we have been beginning to launch a number of virtual-only products.\n\nBut again, they have tied to physical assets or high performance network. So, again, really trying to drive best cost and quality and outcomes for our members. Next question, please. Thank you.\n\nOperator\n\nNext, we'll go to the line of Kevin Fischbeck from Bank of America. Please go ahead.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nGreat, thanks. I guess I want to go back to a comment that John made in the prepared comments about the impact of a recession. I guess, the company historically has talked about, you know, the kind of the balanced business mix between commercial, Medicaid, and how the two businesses kind of offset each other during a recession. So, one, I guess first you didn't mention a recession either as a tailwind -- I'm sorry, as a headwind.\n\nSo, I assume -- does that mean that you don't assume a recession that the guidance. or you assume a modest one has no impact? And then, what exactly do you mean that if it's a severe recession, how should we think about how that impacts a company like Elevance given your business mix? Thanks.\n\nGail Boudreaux -- President and Chief Executive Officer\n\nYes. Thanks for the question, Kevin. I'll address that, and I think that there's a few things. One, we are mindful of the economic environment under which John in the headwinds and tailwinds, where he talked about, you know, one specific known Medicaid.\n\nHe also did reference the broader economic environment that we're planning for across a whole series of scenarios. But I want to take you back in terms of our business because we are a much more diversified business than we have been at any other time in our company's history. And just putting some facts around that, today, that 25% of our premium roughly is in our commercial business, whereas that number was 70% in 2008. And so, as you think about that, you know, the diversity of our businesses and in strong, we've been able to perform in both good and bad economic times.\n\nCertainly, in stronger economic times, the commercial business continues to grow. But we haven't seen any impact in terms of our commercial business today. And we're still seeing strong growth in ads inside of our fee-based business. But clearly, our focus is on, as you just heard in the last question, affordable products, driving a differentiated value for our consumers.\n\nWe've been able to demonstrate that. Just a quick fact that we talk a lot about in our own business. Our growth, as you've seen in the fee-based with some of our most discerning customers, we have been consolidating business from multi-carrier to single carrier over the last several years. We added another eight additional clients for January of this year that consolidate with us.\n\nSo, these are just a couple of proof points in terms of, I would say, the resiliency right now of our commercial business. And then obviously in more difficult times Medicaid businesses tend to grow well and take on some of that. We're also in a very different environment than we were in the last recession. In that recession, we didn't have the ACA and the opportunity for individuals to go in, in a subsidized manner.\n\nAnd as you heard from us, we also now have full coverage in our counties in ACA exchange business. And then we think the Medicare business, where we have zero premium plans, is also quite resilient. So, you know, across our book certainly we're mindful of an economic downturn. We're planning for it in our businesses.\n\nWe've been investing heavily in digital and trying to ensure that we can maintain our own cost structure. So, those are the kinds of things and playbooks that we have inside of our business. So, it's not that we're not planning and thinking about that business, but we do feel we have a much more resilient business and a much more diversified business that one business line is in dominating our company as it had in the past. So.\n\nAnd also, I would add that Carelon, in times, obviously adds -- we have a big roadmap for Carelon to add additional opportunities to impact the affordability of our health plan business and take on more risk. Just a couple of the examples I shared this morning between AIM and myNEXUS. We've got, I think, a long runway there, and that again is all about driving affordability. So, I guess in short, yes, we're planning for it.\n\nYes, we're being prudent and diligent. And second, we know that affordability and differentiated value is going to be critical in a market where customers are strained. And those are the kind of products that we're putting in the market. And we feel we've got a nice breath of those right now, much more so than we've ever had.\n\nSo, thanks very much for the question. Next question, please.\n\nOperator\n\nNext we'll go to the line of Gary Taylor from Cowen. Please go ahead.\n\nGary Taylor -- Cowen and Company -- Analyst\n\nHi, good morning. Had a quick clarification for John and then maybe a quick one for Felicia. John, just on the reclass of the quality improvement incentives to G&A. Just wondering if there's any rebate implications retroactively from that? And then, for Felicia, as we look at the 2023 Medicare benefits offering, I mean, one of the key places where it really looks like Elevance stands out as in special supplemental benefits for chronically ill, just in your individual MA offering your funding level there really looks substantially higher than many of your competitors.\n\nI was just wondering why the focus on that benefit specifically. And what percent of your individual MA will avail themselves of that particular benefit? Thanks.\n\nJohn Gallina -- Executive Vice President and Chief Financial Officer\n\nYes. Thank you, Gary. I'll answer the first part of your question, then turn it over Felicia for your second question. But in terms of the impact on rebates, it was de minimis.\n\nYou know, the vast majority of the reclassification impact that the commercial line of business and while we do have occasional rebates in commercial, they're not nearly as prevalent as they are in some of our -- in Medicaid at this point in time. So, that was really de minimis. That's why I said there's virtually no bottom-line impact. Felicia?\n\nFelicia Norwood -- President, Government Business Division\n\nSure. And good morning, Gary. You know, when I think about our Medicare Advantage business, we've been always very focused on a portfolio that takes a look at individuals who are complex and chronic. And our dual special needs plans have always been an area where we look to grow.\n\nToday, I think we represent probably the third largest footprint with respect to dual eligible individuals. And within our footprint, we're second. We believe that we have the capabilities as we sit within our Medicaid -- Medicare business and, certainly, as you take a look at Carelon to be able to deliver a value proposition to these individuals that's differentiated. So, when we take a look at how we are appropriately priced and competitive in the marketplace is certainly based on our strategy around playing to those stress and being able to partner and look to do those individuals or work with those individuals in a way that's differentiating.\n\nSo, I think our competitive cost structure and the way that we think about our duals products certainly gives us the ability to address their specific needs.\n\nGail Boudreaux -- President and Chief Executive Officer\n\nThank you. Next question, please.\n\nOperator\n\nNext we'll go to the line of Whit Mayo from SVB Securities. Please go ahead.\n\nWhit Mayo -- SVB Securities -- Analyst\n\nHey, I just wanted to go back to Carelon for a second. Any way to frame what percent of your post-acute spin for MA today is being delegated to MyNEXUS or any of your other assets? And then, kind of what are the targets for that business over time? Just any way to quantify and put some numbers around it. I think, you know, I may have underappreciated the tail around this.\n\nPeter Haytaian -- President, Diversified Business and IngenioRx\n\nYes, thanks Whit for the question. In terms of percentages specific numbers on that, we're not going to sort of get into that. But the goal here is for our post-acute offering via MyNEXUS to cover all of our Medicare advantage business from a post-acute care perspective. We started on this journey in the middle of this year launching in July.\n\nWe've seen really good success. We also had another integration in September. We will complete all the Medicare advantage markets in early '23. And so you can assume more broadly that as it relates to post-acute care management for the Medicare business, we will be covering the management of all that population.\n\nGail Boudreaux -- President and Chief Executive Officer\n\nYeah, thanks Pete. And a number that we do share more broadly is the percentage of spend that Carelon manages for Elevance Health. And that has continued to increase and it's around 21%. So, just to give you a little bit of perspective, and it's obviously a number that, you know, we will we continue to have a bigger impact on.\n\nNext question, please.\n\nOperator\n\nNext we'll go to the line of Dave Windley from Jefferies. Please go ahead.\n\nDave Windley -- Jefferies -- Analyst\n\nHi, thanks. I wanted to come back to the comments around commercial renewal. In John's prepared, you talked about being even more confident about Jan 1 than July 1, which was successful. Wondered if you could put a finer point on the factors that drive that confidence.\n\nAnd then to what extent do those same factors benefit growth beyond renewal and/or help your catchers met for catching Medicaid from redetermination?\n\nGail Boudreaux -- President and Chief Executive Officer\n\nThank you. I'm going to ask Morgan to address your question.\n\nMorgan Kendrick -- President, Commercial Business\n\nThanks Dave. You know, to express confidence, I think that July played out as we indicated exactly as we expected. The renewals that we needed we obtained. And of course, there was some attrition in the book that was certainly planned.\n\nThat same phenomenon, we're seeing and in we're the very beginnings of it for January 1. I think the confidence that was alluded to earlier is in the actual position in which we're pricing the business. You know, we sort of got in the spot last year, pricing early for '21 or '22, and then things reveal differently in the fall. That's sort of shaping up as planned as we see right now.\n\nSo, the confidence in the numbers in the market are there. When we think about this concept of a catcher's mitt with Medicaid redetermination, you know, there's business that stays on the Medicaid side, there's business that's going to move to the commercial side, be it group or individual. Gail alluded to the fact that we've done a really nice job in expanding our footprint to cover roughly 95% of the population of the geographies we serve from a commercial individual ACA perspective. And then, we have very strong penetration in the commercial risk.\n\nAnd nonrisk business would also be part of that catcher's mitt, so to speak, for the group side. So, all-in, we're confident in, a, the results from July, b, how we're lining up for January. And then, lastly, the catcher's mitt based on proven performance in share is going to serve us well. Thank you for that question.\n\nGail Boudreaux -- President and Chief Executive Officer\n\nThank you, Morgan. We have time for one more question.\n\nOperator\n\nOur final question comes from Stephen Baxter from Wells Fargo. Please go ahead.\n\nStephen Baxter -- Wells Fargo Securities -- Analyst\n\nYeah. Hi, thanks for fitting me in. Just wanted to ask one follow-up on the group risk business. I was hoping you could give us a sense of what the in-group membership trends were in the quarter.\n\nAre you starting to see those slow a little bit as maybe the economy gets a little bit more uncertain? I guess, basically, what I'm trying to get a sense of is whether we can attribute all the sequential decline to the attrition on the 7/1 renewals or whether the impact was larger, smaller than that, and maybe masked by some of those in-group trends. Thank you.\n\nGail Boudreaux -- President and Chief Executive Officer\n\nYes, thanks for the question. I think in total, I think I shared this in sort of the recession response. We really haven't seen a lot of change in in-group. And actually, it's been up a little bit.\n\nSo, I wouldn't necessarily call it a trend, but it's been running fairly stable. And I think as you think about, you know, where employers are, they're holding onto their employees. They've got a number of jobs still open. So, we're not seeing any impact yet across any of our commercial business on the attrition side and actually are seeing some net ads.\n\nSo, thank you very much for the question. And thank you, operator. In closing, we're pleased with the broad-based momentum across our businesses and are confident that our ongoing execution of our strategy positions us to continue delivering against the financial targets we shared with you at our investor conference last year. We'll keep executing with excellence and discipline to deliver an enhanced value to all of our stakeholders.\n\nThank you for your interest in Elevance Health, and have a great rest of week.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSteve Tanal -- Vice President, Investor Relations\n\nGail Boudreaux -- President and Chief Executive Officer\n\nJohn Gallina -- Executive Vice President and Chief Financial Officer\n\nAustin Gerlach -- Wolfe Research -- Analyst\n\nMorgan Kendrick -- President, Commercial Business\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nFelicia Norwood -- President, Government Business Division\n\nLance Wilkes -- AllianceBernstein -- Analyst\n\nPeter Haytaian -- President, Diversified Business and IngenioRx\n\nScott Fidel -- Stephens, Inc. -- Analyst\n\nNathan Rich -- Goldman Sachs -- Analyst\n\nSteven Valiquette -- Barclays -- Analyst\n\nRob Cottrell -- Cleveland Research Company -- Analyst\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nGary Taylor -- Cowen and Company -- Analyst\n\nWhit Mayo -- SVB Securities -- Analyst\n\nDave Windley -- Jefferies -- Analyst\n\nStephen Baxter -- Wells Fargo Securities -- Analyst\n\nMore ELV analysis\n\nAll earnings call transcripts"
}