{
  "companyName": "Kanzhun Limited",
  "companyTicker": "BZ",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/kanzhun-limited-bz-q2-2022-earnings-call-transcrip/",
  "content": "Kanzhun Limited (BZ -1.64%)\nQ2 2022 Earnings Call\nAug 23, 2022, 8:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the Kanzhun Limited second quarter 2022 financial results conference call. [Operator instructions] Today's conference is being recorded. At this time, I would like to turn the conference over to Ms. Wendy Wang, head of investor relations.\n\nPlease go ahead, ma'am.\n\nWendy Wang -- Head of Investor Relations\n\nThank you, operator. Good evening and good morning, everyone. Welcome to our second quarter 2022 earnings conference call. Joining me today are our founder, chairman, and CEO, Mr.\n\nJonathan Peng Zhao; and our director and CFO, Mr. Phil Yu Zhang. Before we start, we would like to remind you that today's discussion may contain forward-looking statements which are based on management's current expectations and observations that involve known and unknown risks, uncertainties and other factors not under the company's control, which may cause actual results, performance or achievements of the company to be materially different. The company cautions you not to place undue reliance on forward-looking statements and do not undertake any obligation to update these forward-looking information, except as required by law.\n\nDuring today's call, management will also discuss certain non-GAAP financial measures for comparison purpose only. For a definition of non-GAAP financial measures and a reconciliation of GAAP to non-GAAP financial results, please see the earnings release issued earlier today. In addition, a webcast replay of this conference call will be available on our website at ir.tgp.com. With that, I will now turn the call to Jonathan, our founder, chairman, and CEO.\n\nJonathan Zhao -- Chairman and Chief Executive Officer\n\n[Foreign language] Hello, everyone. Welcome to our second quarter 2022 earnings conference call. On behalf of the company and our employees, I would like to express our sincere gratitude to our users and investors for your ongoing trust and support. [Foreign language] First, I would like to share with you our performance for the second quarter.\n\nIn this quarter, we recorded GAAP revenue of RMB 1.11 billion. Our average MAU reached 26.5 million, representing a sequential increase of 5%, and this was achieved solely based on existing users. [Foreign language] Major cities in China experienced a severe COVID-19 outbreak during the past quarter. And we have been under new user registration suspension for almost four quarters.\n\nThese two factors have, to a certain extent, unfavorably affected both our users and revenue growth. [Foreign language] However, our persistent efforts in improving our service capabilities have proved effective despite the headwinds as evidenced by the increasing user activation of DAU to MAU and average achievements per MAU. [Foreign language] In terms of profitability, exclude share-based compensation expenses, our adjusted net income reached RMB 257 million in the second quarter, continuously demonstrating our enhanced operating efficiency. Now I would like to share some updates on our new users, which many of you may care about.\n\nOn June 29, we reopened the new user registration from that date until August 15, that is within 1.5 months. Our platform recorded more than 10 million new user registrations. The MAU and average DAU in July 2022 both reached record highs with MAU in July increasing by 16% compared with June. [Foreign language] Let's -- looking to the user type and region distribution.\n\nAt the end of June and beginning of July, the proportion of newly registered students users are higher since fresh graduates led the school during that period. Starting end of July, blue-collar user numbers have gradually picked up and the white-collar users grow steadily. From the perspective of the city tiers, the first and second-tier cities continue to contribute to majority of the user growth for this quarter. [Foreign language] In terms of the scale of enterprise, the number of SMEs quickly proliferating following the COVID outbreak recovery.\n\nThe average daily active users of blue-collar intermediaries in manufacturing industries and head-hunting consultants selling high-end professionals increased by more than double digits in July on a sequential basis. [Foreign language] With these metrics, on one hand, we see massive market growth potential. Moreover, on the other hand, they also proved that our innovative job-seeking and recruitment model has established a compelling influence and brand reputation among users. [Foreign language] We have also seen clear improvements in monetization with a continuous growth in daily active enterprise users.\n\nIn July, the number of newly posted drops on our platform increased 15% on a sequential basis. In August, the overall recruitment environment has revived further with better growth momentum in industries such as new energy, high-end manufacturing, real estate, media, medical and health as well as positions, including sales and marketing that clearly implicates business expansion. [Foreign language] Among all the industries, the blue-collar sector has shown a relatively more robust growth trend, especially in the urban service sector. The number of job posting in the urban industry during the first two weeks of August increased more than 20% on a sequential basis.\n\n[Foreign language] As for the recent job hunting needs of a large number of fresh graduates, we made a great effort to create more job opportunities for them including holding various online job sales through cooperating with our enterprise customers and participating in the live broadcast job for you initiated by CCTV news channel. [Foreign language] Furthermore, for those college students looking for summer internship and pattern jobs, we explored more potential opportunities on our platform that may accept short-term employment by utilizing our optimized recommendation algorithm to improve their experience and achievements. [Foreign language] In 2022, the Earth we inhabit has faced severe challenges, affecting both the natural environment and the life of human beings. Extreme high temperatures have swept many parts of the world with water levels deep into rare and historical lows in the Danube River in Serbia, Europe, and lake in Jiangsu, China.\n\nThe COVID-19 impact, which has persisted for two and a half years is still creating uncertainties for all of us. [Foreign language] However, by considering the present in the context of the longer -- history, we may be able to more fully understand the periodicity of these changes as well as the loss of evolution. The more difficult times are, the more deeply we should believe in the strength of ordinary people and the greater opportunity to test and prove the value of what we do. [Foreign language] There is one number I would like to share with you.\n\nIn July, job seekers and recruiters on our platform completes more than 100 million times of -- change following their one-on-one confirmation of initial intentions. Many of these people have since then able to find jobs, support their families and fulfill their dreams. [Foreign language] These achievements has convinced the new and more than 5,000 employees that our efforts must be worthwhile. In July, our team of over 5,000 employees worked 100,000 days in aggregate, which means that each of us helped 100 times people each day on average.\n\n[Foreign language] Some ordinary people helping other ordinary people along life journey. By leveraging the power of technology and the market, we, the few, can do such importance for so many others. This eases our minds, lift our power experience and make us incredibly proud of the work we do. With that, I will turn to our CFO, Phil, for the review of our financials.\n\nThank you.\n\nPhil Zhang -- Chief Financial Officer\n\nThanks, Jonathan. Hello, everyone. Thank you for joining our earnings call today. Before I begin, please note that all amounts are in RMB and all comparisons are on a year-on-year basis unless otherwise stated.\n\nDespite the macro uncertainties and the resurgence of COVID-19, our total revenues for the quarter decreased slightly by 5% to RMB 1.11 billion year on year, mainly due to the revenue decrease from small-sized accounts, partially offset by revenue increases from key accounts and midsized accounts, respectively. Calculated cash billings decreased by 32% to RMB 979 million in the quarter, primarily due to the negative impact of COVID-19 outbreak in several top-tier cities, which also are main revenue contributor to our business. Total paid enterprise customers in the past 12 months increased by 5.6% to 3.8 million, while decreased by 7% quarter over quarter due to the same reason. However, we believe the decline will be just temporary and expect it to bottom up starting second half this year.\n\nMoving on to the cost side. Total operating costs and expenses for the second quarter decreased by 60% year over year to RMB 1.04 billion. Excluding share-based compensation, total operating costs and expenses decreased by 4% year over year to RMB 892 million in the quarter. Cost of revenues increased by 22% to RMB 174 million, mainly driven by the headcount increase in second half last year, especially for security-related staff as well as higher server and bandwidth costs.\n\nOur gross margin remained stable at 84%, same as last quarter. Sales and marketing expenses decreased by 25% year over year to RMB 400 million in the quarter due to the decline in customer acquisition costs resulting from the reduced marketing activities. But meanwhile, our quarterly MAU held up at a healthy level quarter-over-quarter, up by 5%. R&D expenses increased by 23% year over year to RMB 308 million as we continue to invest in hiring R&D-related talents.\n\nG&A expenses decreased by 90% to RMB 160 million, which was mainly attributable to the one-off share-based compensation expenses related to the issuance of Class B ordinary shares to Tech Wolf Limited recorded in the second quarter of 2021. Excluding share-based compensation expenses, our G&A expenses increased by 34% year over year, resulting from the increased headcount. Looking ahead for our overall headcount budget. With the reopen of user registration and gradual recovery of recruiting industries, we are confident on our future business growth and we'll continue to invest in critical areas like algorithm engineers and high-profile product managers with other personnel-related costs showing more operating leverage.\n\nHaving said above, at the same time, we will pay attention to our overall HR efficiency. Despite the decrease in revenue, we achieved a net income for RMB 107 million compared with a net loss of RMB 1.41 billion for the same period last year. Excluding share-based compensation, our adjusted net income for the quarter was RMB 257 million, represent an adjusted net margin of 23%, once again proved the resilience of our business model. The net cash generated from operating activities was RMB 187 million for this quarter.\n\nAs of June 30, 2022, our cash, cash equivalents and short-term investments increased to RMB 13 billion, RMB 1-3 billion, which will support our sustainable growth in the long term. Before we go into the outlook for the next quarter, I would like to take some time to discuss the difference between our cash revenue and GAAP revenue. As far as enterprise service, our business nature is to receive cash payment before starting our service, while GAAP revenue will be recognized later on an accrued basis. As a result, management view cash collections as a main operating metrics and reflect company's growth momentum in a timely manner following our user growth.\n\nSo for the third quarter, we expect our total cash collections to be around RMB 1.3 billion, or RMB 1.22 billion as calculated cash billings, which is after business tax. We expect this cash collection and calculated cash billings with a 25% sequential quarter-over-quarter growth and back to the same level with the third quarter last year. Our GAAP revenue affected by the lower cash collection from previous four quarters is estimated to be between RMB 1.15 billion to RMB 1.16 billion, a slight year-on-year decrease of 5.9% to 4.3%. Lastly, we are pleased to be back on track with our user growth being a key business driver.\n\nWe expect the good trends we witnessed recently to continue in following quarters this year. No matter how the external environment changes, we believe that our superior user experience and an efficient business model will drive the continued growth of our user scale and further strengthen our monetization capabilities. We are confident in our long-term development. With that, concludes our prepared remarks.\n\nNow we would like to answer questions. Operator, please go ahead.\n\nOperator\n\n[Operator instructions] We will now take the next question -- the first question. Please stand by. And it comes from the line of Timothy Zhao from Goldman Sachs. Please go ahead.\n\nYour line is open.\n\nTimothy Zhao -- Goldman Sachs -- Analyst\n\n[Foreign language] I have two questions. First question will be on sales, marketing expenses in the second half this year. Could management share, our strategy, how to acquire -- customers? And what is our strategic focus in customer acquisition? And how should we look at the sales, marketing expenses versus the pace of customer acquisition in the second half? And secondly is about live streaming recruitment. Could management share some outlook or some thoughts about how live streaming can play the real in the climate industry, especially in the entry level, white collar and blue collar? And how is our live streaming different from other platforms in terms of the format or monetization? Thank you.\n\nJonathan Zhao -- Chairman and Chief Executive Officer\n\n[Foreign language] Thank you for your question. Regarding your first question on marketing expenses. We are -- first of all, on July, we haven't spent too much or more than June -- compared with June on marketing expenses. But overall, we are expecting more than 25 million newly verified users in the later half of this year, and we are expecting to achieve that under a normal marketing expense or input.\n\nIn terms of our revenue, we are seeing gradual recovery from July and August, and we are seeing a better recovery trend. And we are confident that we can meet the market expectation with what we promised in our earnings and what we just discussed, but we will achieve that on very reasonable expenses. We want to spend, especially -- we won't spend extra money to buy users or to buy our revenue. And regarding your second question for live streaming on recruitment -- on recruiting industry, I have not discuss the matter in detail in the past, but I would like to take your questions now because it's actually one person with multiple person pattern.\n\nAnd this pattern has been existing since the web edge, and now it increased in the form of live streaming. And on the one versus multiple pattern, the one means the recruiter and multiple person means the job seeker. And I believe that will be effective for certain jobs, which has a common requirement for people and certain brand, which has a very high branding reputation. But I will give you my prediction that in the future, one-on-one communication will be more suitable according to the recruitment industry trend, which is a job seeker will be more and more precious and rare in future.\n\nAnd technology, based on recommendation, will be more used and preferred under that circumstances which the recruiters and job seekers need to have a mutual consent and need to agree on both each other to have a successful hiring, and that's my opinion regarding the live streaming.\n\nPhil Zhang -- Chief Financial Officer\n\nOK. So I'll add one point regarding the marketing expenses. Since the resumption of the user registrations, in most of the time in July, we did not spend extra money, marketing dollars in July but we achieved a very healthy new user registration numbers in July and early August. So when we talk most of the time in July, we did not spend actual money, marketing dollars, in -- to spend our money.\n\nSo we would like to consider the overall efficiency as an important criteria. So our key message is that we would like to spend money wisely, and we won't overspend money in the second half.\n\nOperator\n\n[Operator instructions] We will now take the next question. Please standby. And it comes from the line of Wei Xiong from UBS. Please go ahead.\n\nYour line is open.\n\nWei Xiong -- UBS -- Analyst\n\n[Foreign language] My first question is around the user growth trends post the resumption of user registration. So it seems like when we first started to resume user growth, the job seeker growth is faster than the enterprise user growth. So have we seen similar trends when we enter into the August month? And what's our strategy to accelerate the growth of enterprise users as well as the conversion of paying users? And second, just on the blue-collar recruitment. What's our near-term and long-term strategy and goals for this business? If we want to achieve a rapid growth in the business for next few years, what's the contribution from blue collar in terms of users and revenue could be? Thank you.\n\nJonathan Zhao -- Chairman and Chief Executive Officer\n\n[Foreign language] OK. Thank you for your question. About your first question that you are quite smart and sensitive to have noticed that at current state or at the beginning of our user registration opens the job seekers were coming back sooner. And on the current macro environment, there will be relatively less people who want to hire people.\n\nBut actually, from the trend of July and early August, we have been witnessed that the recovery of our enterprise users are quite decent. As we just discussed, the newly posted jobs in July have increased by 15% compared to June. And the enterprise users number who have posted those jobs increased by 23%, which is a clear recovery trend and indicator. And in terms of the relatively higher ratio of job seekers to enterprise users because we have -- we already have a quite large user pool, we are capable to address our ecosystem through our technology to make people feel better in terms of both their user experience and their achievements.\n\nAnd that's for your first question. [Foreign language] OK. For your second question regarding how can we achieve a quick growth recovery for next year and the year after that, and what's the contribution of our blue-collar revenue. That's a quite detailed plan you're asking.\n\nI can answer you for this. Currently, we have accumulated users of around 100 million. And our last 12 months paid enterprise customer number is around 4 million and -- which is a relatively small portion and which means that even within the white collar users, our paid user penetration rate is still quite low. And we have stopped from relying on the blue-collar revenue to support our growth.\n\nSo that's not our view on our strategic point. We can see that we still have quite huge growth potential in terms of white collar users to either more lower tiers and further penetrate into more diversified industries, etc. And that's my first half answer to your question. [Foreign language] And about our strategy for the blue-collar growth.\n\nFirst of all, we will -- currently, we are still forcing on to make our ecosystem better, which is to continue as priority, which is continue to regulate all those blue-collar intermediary agencies before we can pursue a meaningful revenue growth. If we do our monetization too early, we will step into a potential trick, which -- it has been existing in the blue-collar industry for quite a long time, where the users have low tracks with the platform, and there are a lot of frictions between the -- for each transaction. So we need to clear the environment first, and that's what we have been talking for current projects for so many times. And on the basis of that, we will then grow our revenue.\n\n[Foreign language] That's my answer. Thank you.\n\nOperator\n\nWe will now take the next question. And the next question comes from the line of Natalie Wu. Please go ahead. Your line is open.\n\nNatalie Wu -- Haitong International Securities -- Analyst\n\n[Foreign language] And congratulations on -- results and resumption of the user registration. Hope all come back to normalization. I have two questions. The first one is regarding the 12-month total paid enterprise customers decline, which is the number declined to 3.6 million from 4.1 million in the first quarter.\n\nI'm just wondering how much of the decline could be attributable to pandemic lockdowns? And how much is related with the non-lockdown macro issue including real -- related stuff? And could you also share with us the chance of this metric in June, July and August, so that we can get a better sense? You mentioned the 15% yield position month-over-month growth in July. Just wondering, is that the similar growth for the paid enterprise customer number as well? And my second question is related with the industrial mix regarding -- paying enterprise customers. I'm just wondering which industries you witnessed with the highest growth recently and the related contribution? And also the Internet and real estate related pay and the prices customers contribution, what's the latest number? Thank you.\n\nPhil Zhang -- Chief Financial Officer\n\nOK. Thank you, Natalie, for the questions. So I'll answer your first question regarding the paid enterprise users decline. So if you look at the paid enterprise users versus the overall verified enterprise users, the paying ratio in second quarter showed a little bit decrease.\n\nMaybe you understand a little bit as our paying ratio dropped in the quarter. But the real situation was not that like that. Basically, our paying ratio with the online -- I mean, the active business users, online enterprise users, that paying ratio was quite stable in past most of the time. So the drop of the second quarter paid enterprise user, mainly because of the total online or active business users in second quarter dropped.\n\nAnd that's the overall pay, the enterprise customers dropped -- that number dropped. So in the second quarter, so because of the COVID outbreak, so some enterprise users, they didn't show up on platform. But meanwhile, because of -- we were under cybersecurity review and we cannot grow our new users, that means no business users can be added onto our platform. So because of that, online business users on our platform dropped.\n\nBut the paying ratio was relatively stable. That caused the overall paid customers in second quarter dropped. So I think the main reason should be the COVID outbreak and partially impacted with the new user registration. So that's our situation for the second quarter, paid enterprise users drop.\n\nAnd after second quarter, starting from like June 29, we were able to grow new users. And around that time, the total active like online business users was at the lowest level because of -- in the past nearly four quarters we were -- we cannot grow new users. So that means at the beginning of July, online business users, the overall number was at lowest level. So starting from that point on day by day, week by week, we witnessed the business user drops.\n\nSo especially after middle of July, we see acceleration of business users. And in the first two weeks of August, we see further accelerated growth. So that means as base of our paid enterprise users, as just mentioned, the overall paying ratio is quite stable. And along with the increase of online or active business users growth, so our paid enterprise users starting from through July and August grow as well.\n\nAnd that trend was quite healthy recently. So we are very confident that in next quarter and even in the following quarters, we would like to see the trends to continue, and that can help to let us achieve better revenue growth in probably the third quarter and even fourth quarter. So that's the situation of the business side growth recently.\n\nJonathan Zhao -- Chairman and Chief Executive Officer\n\n[Foreign language] OK. I will answer your second question regarding the recovery trend in recruitment industry. First of all, for Internet sector -- the whole Internet sector, the recovery trend is in line with our overall growth. And we have witnessed a much faster recovery pace for the blue-collar users like manufacturing sector, like logistics and especially for urban service sector, which is worth focusing on because we have certainly large portion of blue-collar users are in the urban service sector.\n\nAnd we saw that the momentum has accumulated in this subsector is quite healthy, and we will continue to help our ecosystem to expand. [Foreign language] And some other emerging industries like new energy, like electronic vehicle, by healthcare and high-end electronic manufacturing, we have witnessed a better growth. And for traditional industry, we can use the word recovery, like real estate and consumer. So that's our view in the industry trend of the enterprise customer side.\n\nOperator\n\nWe'll now take the next question. One moment, please. And it comes from the line Tian Hou from T.H. Capital.\n\nPlease go ahead. Your line is open.\n\nTian Hou -- T.H. Capital -- Analyst\n\n[Foreign language] So it's much more bigger picture question. When we look at the market, so the job market is much more related to the cycle of the economy. And if we look at today, economies in the downturn, and we have this business-to-consumer ratio is in balance. So at this point, beyond finding the job for the job seeker and give them comfort, I wonder what else company can do to add value to those job seekers' life? And if the company has any -- does the company have any plan for some kind of a business expansion? [Foreign language]\n\nJonathan Zhao -- Chairman and Chief Executive Officer\n\n[Foreign language] Thank you for your question. I would like to spend to you for something we have firm believe in, which is to utilize the power of technology to solve the development of human being. And currently, we are focusing on the career development of people, and that's what 5,000 employees of people are doing. [Foreign language] And at current stage, even though we have a very large team and heavily invested in technology, but we still need to focus our capabilities and that is to help the job seekers to resolve the most critical things of their job seeking.\n\nAnd we still have a lot of things to do on that front. For the graduate -- 10.76 million fresh graduates this year, majority of them doesn't know what they do or what they can do, what industries they need to try for, and that's the reality. So we are utilizing all of our technology power to better match their potential sectors, potential personal skills and in terms of their area, in terms of their social relationships and asset -- within well, they are viewing all of those potential opportunities on our platform, we will help them to figure out the best kind of jobs that are suited for them, and that's the most urgent since we need to fix at present. [Foreign language] And we have try to encourage the recruiters to posting jobs, which are available for fresh graduates and encouraging recruiters to post jobs in the -- in those area with severe COVID-19 outbreak like Beijing, Shanghai, and Jilin.\n\nAnd how we achieve that is we try to turn many of the job postings into free drops for those areas to increase the job supply and that can substantially help the job seekers. [Foreign language] We also try to subsidize through our operating, through our products. For example, we find some volunteering experienced professionals to guide those fresh graduates to find out what they can do. [Foreign language] And that's how we can improve our value to job seekers.\n\nAnd -- but currently, we still on an operating basis, but cannot substantially increase our revenue, but we are continually exploring that. Maybe until someday, with more capability and more certainty, we can help job seekers to secure a job. And by that time, we might be able to achieve some revenue from that job seekers. And by then, that's not at the current stage, we're still exploring.\n\n[Foreign language]\n\nOperator\n\nAt this time, I will turn the conference back to Wendy for any additional or closing remarks. Wendy? [Operator signoff]\n\nDuration: 0 minutes\n\nWendy Wang -- Head of Investor Relations\n\nJonathan Zhao -- Chairman and Chief Executive Officer\n\nPhil Zhang -- Chief Financial Officer\n\nTimothy Zhao -- Goldman Sachs -- Analyst\n\nWei Xiong -- UBS -- Analyst\n\nNatalie Wu -- Haitong International Securities -- Analyst\n\nTian Hou -- T.H. Capital -- Analyst\n\nMore BZ analysis\n\nAll earnings call transcripts"
}