{
  "companyName": "IBM",
  "companyTicker": "IBM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/19/ibm-ibm-q3-2022-earnings-call-transcript/",
  "content": "IBM (IBM -0.12%)\nQ3 2022 Earnings Call\nOct 19, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome, and thank you for standing by. At this time, all participants are in a listen-only mode. Today's conference is being recorded. If you have any objections, you may disconnect at this time.\n\nNow, I will turn the meeting over to Ms. Patricia Murphy with IBM. Ma'am, you may begin.\n\nPatricia Murphy -- Vice President, Investor Relations\n\nThank you. This is Patricia Murphy, and I'd like to welcome you to IBM's third-quarter 2022 earnings presentation. I'm here with Arvind Krishna, IBM's chairman and chief executive officer; and Jim Kavanaugh, IBM's senior vice president and chief financial officer. We'll post today's prepared remarks on the IBM investor website within a couple of hours, and a replay will be available by this time tomorrow.\n\nTo provide additional information to our investors, our presentation includes certain non-GAAP measures. For example, all of our references to revenue growth are at constant currency. We have provided reconciliation charts for these and other non-GAAP measures at the end of the presentation, which is posted to our investor website. Finally, some comments made in this presentation may be considered forward-looking under the Private Securities Litigation Reform Act of 1995.\n\nThese statements involve factors that could cause our actual results to differ materially. Additional information about these factors is included in the company's SEC filings. With that, I'll turn the call over to Arvind.\n\nArvind Krishna -- Chairman and Chief Executive Officer\n\nThank you for joining us today. The results we delivered in the third quarter reflect our continued focus on the execution of our strategy with over $14 billion of revenue and strong growth across the portfolio. Technology remains a fundamental source of competitive advantage, and we continue to see solid demand for our hybrid cloud and AI solutions. Continued double-digit revenue growth in IBM Consulting, capturing client demand for digital transformations.\n\nSoftware revenue performance was also strong with growth across all categories. And our Infrastructure business had another high-growth quarter in both zSystems and Distributed Infrastructure. Our revenue strength was broad-based geographically as well. When I talk with clients, it's clear there's a real opportunity to help businesses leverage technology in today's environment.\n\nClients are dealing with everything from inflation to demographic shifts, from supply chain bottlenecks to sustainability efforts. By deploying powerful hybrid cloud and AI technologies, IBM is helping businesses seize new opportunities, overcome today's challenges, and emerge stronger. We, too, are building a stronger company that is closely aligned to the needs of our clients. In line with our hybrid cloud and AI strategy, we have continued to focus our portfolio; invest in our offerings, technical talent, and ecosystem; and streamline our go-to-market model.\n\nWith strong performance through the first three quarters, we are taking up our revenue expectations for the year and now expect 2022 revenue above our mid-single-digit model. Let me now turn to the progress we are making in the execution of our strategy. Our point of view is clear. Hybrid cloud and AI are the two most transformational enterprise technologies of our time.\n\nHybrid cloud is already becoming the dominant architecture for enterprise. According to a recent survey by the Harris Poll, 77% of businesses surveyed that they have adopted hybrid cloud for their organizations with data located across multiple clouds, on-premise, or at the edge. Hybrid cloud is about offering clients a platform that can drive value across these different environments. Our platform based on Red Hat allows our clients to consume software driven by open-source innovation.\n\nIBM's software has been optimized to run on that platform and includes advanced data and AI, automation, and security capabilities. Our consultants offer deep business expertise and co-create with clients to accelerate their digital transformation journeys. And our infrastructure allows clients to take full advantage of a hybrid cloud environment. Our platform-centric strategy continues to have good momentum, adding a couple of hundred hybrid cloud platform clients in the third quarter.\n\nWe see more and more clients consuming across our portfolio of Software, Consulting, and Infrastructure capabilities. This quarter, clients such as Bank of America, Bharti Airtel, and Samsung Electronics have chosen IBM to realize the full potential of a hybrid cloud computing model. Let me now say a few words about our AI capabilities. As demographic shifts continue to add pressure to modern economies, coupled with wage inflation, companies are eager to deploy AI and automation capabilities at scale to boost their levels of productivity.\n\nThat is what IBM is helping companies bring to bear. In the context of enterprise, we are seeing four main use cases emerge: AI to interact and converse; AI to automate IT processes; AI to extract knowledge and insights; and finally, AI to automate business workflows such as HR, supply chains, and financial reporting. We are working to bring these capabilities to clients across all industries. For instance, this quarter, IBM Consulting partnered with the U.S.\n\nDepartment of Veterans Affairs to automate business workflows related to the delivery of pension benefits. This helps free up valuable time of VA staff and speed up the processing of claims made by the veterans most in need. Our partner ecosystem is a crucial element of our strategy. Each quarter, we continue to expand the work we do with partners to serve our joint clients.\n\nFor instance, we recently announced an expansion of our partnership with VMware to help clients in regulated industries more easily move workloads to the cloud, with IBM Consulting now serving as a GSI partner for VMware. We announced that Red Hat and Dell are launching a set of containerized solutions aimed at simplifying the management of multi-cloud environments on-premise. Gartner predicts that by 2026, 90% of organizations will use containers. These actions represent another step in our efforts to seize this opportunity through ecosystem relationships and our technology offerings.\n\nWe are actively working to introduce new innovations and shape the technologies of the future. Most recently, we unveiled the next generation of our LinuxONE server, a Linux and Kubernetes-based platform designed to support thousands of workloads within the footprint of a single system. As an example, Citibank is hosting MongoDB on IBM LinuxONE, leveraging the platform's security, resiliency, and elastic capacity, and helping Citi lower its overall carbon footprint. We also continue to make progress in quantum computing.\n\nWe remain on track toward our goal of building a 1,000-qubit system by 2023. To advance the security of our communication networks, IBM alongside Vodafone recently joined the GSMA Post-Quantum Telco Network Taskforce. This task force aims to introduce a framework for the telco industry to adopt new quantum-safe approaches. Complementing our organic innovation, we recently acquired Dialexa.\n\nThis brings our total number of acquisitions this year to seven, adding new capabilities in areas like hybrid cloud services, security, data observability, and sustainability. As the world takes on the challenge of sustainability and building a more circular economy, IBM has been building a portfolio of solutions to help companies make progress on this journey. This quarter, we received recognition, highlighting our sustainability efforts. The analyst firm HFS Research and Forbes both recognized IBM for its capabilities in the area of sustainability, including Envizi and our Environmental Intelligence Suite software.\n\nLet me conclude by reminding you that last October and just prior to the separation of Kyndryl, we held our investor briefing, laying out priorities for our portfolio and growth. Over the last four quarters, we have driven constant-currency revenue growth at or above our mid-single-digit model with solid free cash flow. And while there is always more to do, we are pleased with our first year's progress. As we look forward, we remain confident in our strategy and execution and feel we are well-positioned to address today's client needs.\n\nLet me now turn it over to Jim, who will provide more details on the quarter and our expectations for the balance of the year.\n\nJim Kavanaugh -- Senior Vice President and Chief Financial Officer\n\nThanks, Arvind. I'll start with the financial highlights. In the third quarter, we delivered $14.1 billion in revenue, $2 billion of operating pre-tax income and a margin of nearly 14%, and operating earnings per share of $1.81. For the first three quarters of the year, we generated over $4 billion of free cash flow.\n\nOur revenue was up 15%, which includes about five points of contribution from sales to Kyndryl. While we'll discuss our results today at constant currency, I'll mention that with the continuing strengthening of the U.S. dollar, currency translation impacted our reported revenue growth by more than eight points or nearly $1.1 billion. As Arvind said, our revenue growth this quarter was pervasive.\n\nSoftware revenue was up 14% and Consulting up 16%. These are our growth vectors and represent over 70% of our revenue. Infrastructure was up 23%, reflecting solid product cycle dynamics. Software and Infrastructure include about eight and nine points of growth, respectively, from the commercial relationship with Kyndryl.\n\nMore than half of our revenue is recurring, and this annuity content, which is driven by software, continues to grow. Performance was also broad-based by geography. Americas, EMEA, and Asia Pacific revenue were all up double digits, and we gained share overall. These revenue results reflect the execution of more focused hybrid cloud and AI strategy based on a platform-centric approach and leveraging a broad ecosystem of partners.\n\nOur full-stack capabilities across Software, Consulting, and Infrastructure delivered 20% growth in hybrid cloud revenue over the last year to over $22 billion. Looking at our profit metrics, operating pre-tax income was up and margin expanded by 180 basis points year to year. These profit dynamics reflect our portfolio shift toward higher value led by software. This mix shift is contributing to profit and margin.\n\nOur pre-tax profit also includes the contribution from incremental sales to Kyndryl. Like our clients, we are focused on digitally transforming our own operations, applying AI and automation to drive productivity and efficiency in the spend base. This provides flexibility to continue to invest in talent, innovation, and our ecosystem in an inflationary environment. Ninety days ago, we spent some time talking about currency dynamics.\n\nI'll remind you of a few of the key points. A stronger dollar impacts our revenue and gross profit dollars. We execute a hedging program, which defers versus eliminates the impact of currency. The gains from these hedging programs are reflected primarily in other income and expense.\n\nBut with the rate and magnitude of the movements and because we don't hedge all currencies, we do have a currency impact to our overall profit and cash flow. Wrapping up the discussion on profit dynamics. The currency impacts and a good amount of investments are in gross profit, while the mitigating hedging benefits and operational productivity are reflected primarily in expense. As a result, pre-tax income is a better indicator of our profit performance.\n\nOur operating tax rate was about 16%. Compared to last year, tax is a significant year-to-year headwind to operating net income and operating EPS growth, which were both down modestly year to year. Turning to free cash flow. We generated $4.1 billion in the first three quarters.\n\nThat's up over $900 million year to year. We're wrapping on payments related to the Kyndryl separation and the 2020 structural action and driving working capital efficiencies. In terms of uses of cash in the first three quarters, we invested over $1 billion in acquisitions, which was more than offset by proceeds from divested businesses. And we returned nearly $4.5 billion to shareholders in the form of dividends.\n\nFrom a balance sheet perspective, we issued debt in July to prudently get ahead of our 2023 maturities. Our debt balance is up since June but down nearly $1 billion since December. We ended the quarter in a strong liquidity position with cash of $9.7 billion. This is up over $2 billion from year-end and well in excess of the minimum cash required for our business.\n\nTurning to the segments. Software revenue grew 14%. This includes about eight points of Kyndryl contribution, both of our revenue categories, Hybrid Platform and Solutions, and Transaction Processing through this quarter. This performance reflects our strong and growing recurring revenue base, which is about 80% of our annual Software revenue.\n\nAnd Software's hybrid cloud revenue is now $9.2 billion over the last year, up 20%. In Hybrid Platform and Solutions, revenue was up 8%, including about a point and a half contribution from the Kyndryl commercial relationship. The growth was broad-based. Red Hat revenue all-in grew 18%.\n\nAs a leader in open-source technologies for the enterprise, Red Hat's performance was again fueled by market share gains across RHEL, OpenShift, and Ansible this quarter. With our enterprise incumbency and global scale, we continue to see an increase in large deals, as well as strong cross-sell and upsell across Red Hat solutions. Automation revenue grew 3%. This quarter's performance reflects continued adoption in areas like AIOps and management and integration, while we're also wrapping a strong acquisition content from last year.\n\nWe're bringing innovation to our clients this quarter such as new Instana observability capabilities for zSystems in a hybrid cloud environment. In data and AI, revenue was up 4%. Let me highlight just a few of the growth areas this quarter. Data management fuels advanced analytics.\n\nData fabric helps clients discover and unlock the value of their data wherever it resides, and information exchange enables the timely and secure flow of complex B2B information. And offerings like Envizi and Environmental Intelligence Suite are resonating with clients as they prioritize sustainability efforts. Security revenue was up 6%, with growth in both data security and threat management. In data security, we're seeing adoption of Guardium Insights as we continue to deliver new product innovation.\n\nThreat management growth was led by Cloud Pak for Security, which helps clients prevent and respond to modern threats across disparate security feeds. Across Hybrid Platform and Solutions, the annual recurring revenue, or ARR, is now $13 billion and up 9%. Transaction Processing revenue was up 33%, including about 26 points of Kyndryl contribution. The increase in zSystems' installed capacity over the last couple of cycles and continued strong renewal rates are recognition of the importance of this platform in a hybrid cloud environment.\n\nAs a result, the transaction processing annuity base is now growing. Looking at Software profit, we delivered operating leverage, given the solid revenue growth and new Kyndryl commercial relationship. Our pre-tax margin was up more than four points over last year. Consulting revenue grew 16%.\n\nThis is the fifth consecutive quarter of double-digit growth. This strong performance was again broad-based with revenue growing at double-digit rates across all business lines and geographies. Over the last year, our book-to-bill ratio is 1.05. Clients trust IBM's deep industry expertise and co-creation approach throughout their hybrid cloud and digital transformation journeys.\n\nAs IBM Consulting designs and enables enterprise hybrid cloud strategies, this business delivered $8.9 billion in hybrid cloud revenue over the last year. That's up 28%. Our Red Hat consulting practice continues to be a meaningful contributor to revenue growth, growing strong double digits as we add new engagements. Since IBM acquired Red Hat just over three years ago, Consulting has led nearly 1,400 Red Hat engagements with over $6.5 billion in aggregate bookings.\n\nStrategic partnerships also contributed to performance, continuing to grow revenue at a double-digit rate. Turning to our lines of business. Business transformation revenue grew 14% as clients look to IBM to help them transform critical workflows at scale. Growth in business transformation was pervasive, driven by supply chain, finance, data, and client experience transformations.\n\nWorking with our partners like SAP, Salesforce, and Adobe, we help our clients optimize their operations and improve the way they engage with their customers. In technology consulting, where we architect and implement clients' cloud platforms and strategies, revenue was up 17%. Once again, growth was led by cloud application development and cloud modernization, including our Red Hat practice, which as I mentioned, grew strong double digits. Application operations revenue grew 17%.\n\nIBM helps clients optimize their operations and reduce costs by taking over the management of clients' applications in hybrid and multi-cloud environments. We leverage AI to help predict problems before they happen and monitor our clients' different environments with dashboards, enabling action to be taken quickly. Moving to Consulting profit. Our pre-tax margin of about 10% is down year to year though up nearly three points from the second quarter.\n\nAs we've discussed in prior quarters, Consulting is most impacted by the labor cost inflation. Those dynamics continue to put pressure on the margin profile. However, coming out of the third quarter, we are seeing signs of progress. Our utilization rates are improving as we exited the quarter, our acquisitions are scaling and are on a path to margin accretion, and we've seen two quarters of price margin improvement year over year that will benefit our margin profile going forward.\n\nMoving to our Infrastructure segment. Revenue grew 23%. This includes about nine points from the incremental Kyndryl content. Hybrid infrastructure revenue grew 41% and infrastructure support revenue grew 5%, including about 11 and seven points of Kyndryl benefit, respectively.\n\nLooking at hybrid infrastructure, zSystem's revenue nearly doubled, driven by continued adoption of our newest program, z16. This latest program combines embedded AI at scale, cloud-native development for hybrid cloud, and cyber resilience security. In fact, z16 is the industry's first quantum-safe system, delivering 25 billion encrypted transactions per day for clients. And as Arvind mentioned, we just introduced our newest LinuxONE server, a highly scalable Linux and Kubernetes-based platform with capabilities to reduce clients' energy consumption.\n\nzSystems remains an enduring platform, playing an important role in a hybrid cloud environment. Distributed Infrastructure revenue was up 21%. Recent innovation across the portfolio enabled broad-based growth within both storage and power. These include the expansion of our Power10 server family earlier this quarter and refreshes to the flash storage solutions throughout this year.\n\nLooking at Infrastructure profit, pre-tax margin was up one point year to year, reflecting mix benefits from the growth in zSystems. Now, let me take it back up to the IBM level, and I'll shift the focus to the full year and the fourth quarter. Over the last year, we've continued to invest and make portfolio changes to advance our hybrid cloud and AI strategy, streamline our go-to-market and digitally transform our own operations. Our more focused strategy and portfolio is aligned to client needs.\n\nOur revenue performance so far this year demonstrates that. And based on this revenue performance in the first three quarters, as Arvind said, we now see constant-currency revenue growth above our mid-single-digit model for the year. On top of that, Kyndryl sales add about three and a half points of growth, primarily in the first three quarters of the year so it's essentially behind us. U.S.\n\ndollar continues to strengthen. And at mid-October spot rates, currency translation will now be about a seven-point headwind to growth for the year. As I mentioned earlier, this impacts profit and free cash flow as well. Looking at free cash flow, our other key metric, we continue to expect to generate about $10 billion for the year.\n\nThat's up over $3 billion from last year. A large part of that growth comes from the wrap on the Kyndryl spin-related and structural payments. But we're also driving working capital efficiency and improving operating profit profile. We expect strong free cash flow performance in the fourth quarter while we continue to face some external headwinds, including appreciation of the U.S.\n\ndollar and exit of our Russia operations. In terms of segment performance for 2022, our view of software has been consistent all year. We continue to expect revenue growth in line with our mid-single-digit model range, plus five to six points from sales to Kyndryl. And we still see Software pre-tax margin in the mid-20s range for 2022.\n\nOur IBM Consulting revenue growth has been great, and we're taking our view up to a mid-teens revenue growth rate for the year. While we're still operating in a competitive labor environment, we see some encouraging signs in our Consulting margin profile exiting the third quarter. We now expect a Consulting pre-tax margin for the year at the low end of our previous 9% to 10% range, which is up about one point year to year. Our Infrastructure revenue performance, as always, reflects product cycle dynamics.\n\nWith the strong launch of our z16 earlier this year, Infrastructure revenue performance will be above the model level for the year, and that's before the five to six points from sales to Kyndryl. We expect Infrastructure pre-tax margin in the mid-teens. Looking specifically at the fourth quarter, we expect all-in constant-currency revenue growth at the high end of the mid-single-digit range. At current spot rates, currency translation has increased to an eight- to nine-point headwind to revenue growth in the fourth quarter.\n\nThat's up two to three points from 90 days ago. And then I'll remind you, in a couple of weeks, we'll reach the anniversary of our separation of Kyndryl. While the external sales to Kyndryl will remain in our revenue and profit base, we've essentially wrapped around the year-to-year contribution to our revenue and profit growth and margin expansion. As we enter the fourth quarter, we look forward to closing out our first calendar year of today's IBM.\n\nAs always, we'll provide a view of 2023 during our fourth-quarter earnings report in January. Patricia, now let's go on to the Q&A.\n\nPatricia Murphy -- Vice President, Investor Relations\n\nThank you, Jim. Before we begin the Q&A, I'd like to mention a couple of items: first, supplemental information is provided at the end of the presentation; and second, as always, I'd ask you to refrain from multipart questions. Operator, let's please open it up for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question will come from Amit Daryanani with Evercore. Your line is open.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nThanks for taking my question and a really impressive set of numbers, especially from a revenue perspective over here. I guess, Arvind, maybe the question is for you, but there's a lot of anxiety, I think, among investors in the markets in terms of what the macro situation is and what it means for IT spending going forward. I'd love to get your perspective. What are you hearing from your customers as they think about their IT budgets going forward? How does that look? And are they focusing on different things going forward versus what they've done historically from an IBM's portfolio perspective? Would love to just get a sense on what are you hearing from your customers in aggregate.\n\nAnd then if you could even -- how does Consulting shake up in a more challenging macro environment, it will be really helpful because the growth rate so far there has been well above the long-term trends. Thank you.\n\nArvind Krishna -- Chairman and Chief Executive Officer\n\nYes. Amit, thank you. Thank you both for the comment and those questions. So, let me answer the first part, how do we feel about revenue and demand going forward? First, if you just look at the data going backwards, we see pretty strong demand and we saw double-digit growth in Europe, double-digit growth in Asia, and double-digit growth in the Americas.\n\nBut let me add some color on that as we look forward. And it is with a couple of contextual elements, as you said, on your portfolio. One, we are B2B. We have almost no B2C business, as if almost no, I could say none, but there is the weather business which has got a little bit of element of B2C in it, but it's tiny.\n\nSo, one is B2B. Second, we've done a lot of work over the last three years, and our portfolio is largely in mission-critical areas, areas that are around automation, areas that are about leveraging AI for enterprise productivity. And I think that that productivity theme is going to play out over actually not just this remaining part of this year but for the next half decade, maybe the full decade. Color, in the Americas, I find a very robust business environment.\n\nI find that most enterprises want to invest. They are leveraging technology to scale their business. If I go to Asia, it's very similar. Very little change from the past, I think going into the next few months, at least.\n\nIn Europe, I think we shouldn't put our head in the sand. I think that with the mixture of energy and inflation, you can sense that there is some caution creeping into the conversations, albeit not in the data and not yet in what we are doing as business there. But we'd be foolish not to prepare that there could be a bit of a downturn in Europe only. But let me now put all of that back into context.\n\nSo, you're saying Americas, Asia, fine. If I get to Europe, Western Europe, ballpark 20% of global GDP. Even if you have a massive impact, 5% to 10%, that's a 1% to 2% impact on a global level all-in. Technology is typically 3% to 4% ahead of GDP growth.\n\nThat says there's still a robust technology environment in there. So, I think, Amit, that's the sort of the two parts of your question that we're addressing with that.\n\nPatricia Murphy -- Vice President, Investor Relations\n\nThank you, Amit. Let's go to the next question, please, Sheila.\n\nOperator\n\nThank you. Our next question will come from Toni Sacconaghi with Bernstein. Your line is open.\n\nToni Sacconaghi -- AllianceBernstein -- Analyst\n\nYes. Thank you. You saw really strong strength in mainframe, which I think was not anticipated 90 days ago, and you also saw a really commensurately strong transaction processing quarter. And I'm wondering whether you saw some strong ELAs in the quarter and maybe you could put that in context in terms of what ELA percentage was in Transaction Processing.\n\nAnd then separately, Arvind, given how strong the cycle is and given your comments about Europe, are you still comfortable about delivering mid-single-digit growth in 2023? Thank you.\n\nJim Kavanaugh -- Senior Vice President and Chief Financial Officer\n\nOK. Toni, this is Jim. I'll take the first part of the question. Arvind can wrap up about our portfolio and the confidence we have in positioning 2023.\n\nWhen you take a look at our third quarter performance, we're obviously very pleased with the entire IBM team and what we've been able to execute, continuing to instantiate the value of today's IBM, which is a very focused hybrid cloud and AI platform company. But let's dial back 90 days ago. Ninety days ago, we said all in, we were going to be at high single-digit revenue growth, and we were going to generate about 200 basis points of operating leverage. When you now play that picture of what played out in the third quarter, we are capitalizing on that focused IBM hybrid cloud AI strategy and capitalizing on the accelerated demand from our clients that Arvind talked about upfront.\n\nAnd we're getting revenue dollar contribution that is falling to the bottom line. With regards to profit, our profit's up 23%. Now, with that said, when you look at the profile of the contribution, it was very pervasive and broad-based. It was double-digit growth across all three of our major segments and double-digit growth across all of our markets around the world.\n\nAnd within that, Software contributed about three points of growth ex-Red Hat to IBM, Consulting delivered about five points of growth, and Infrastructure delivered about three points of growth to IBM. And within Infrastructure, to your question on mainframe, mainframe basically came in about exactly what we guided to 90 days ago. Remember, we talked about at length the first time in 20 years that we announced a mainframe, new innovation in a second quarter, and how it was going to change the seasonality of that business. And we had a very strong second quarter, which by the way, we took up revenue guidance in April 4.\n\nWe talked about 90 days ago how third quarter was going to play out and fourth quarter, and we pretty much executed to that. So, we feel pretty good about our book of business. So, Arvind, turning over to you.\n\nArvind Krishna -- Chairman and Chief Executive Officer\n\nYes. Thanks, Jim. So, turning to sort of address the questions. Last October, we talked about that we are going to be in a mid-single-digit revenue growth model, and that we'll be increasing cash flow each year.\n\nAnd we have set out a target of $10 billion for this year and $35 billion over the period. There is nothing that we see right now to alter us from where we had said at that time. So, I'm going to say that those projections stay in place. As Jim pointed out, for 2022, we are saying that we will be above our revenue model.\n\nAnd that, we believe, will play out with the demand that you heard me talk about and then Jim just reinforced. Just a little thought, the third quarter is not typically a big ELA quarter, so we should just be -- it's kind of the normal seasonality. ELAs are really second and fourth, much more than first and third. So, just to give you a little bit of color and add to what you asked and what Jim said, mainframe hardware has had a strong start, so you would expect the capacity increases.\n\nAs the capacity increases, you expect that to follow with a tiny lag, sometimes a month, sometimes three months into our Transaction Processing portfolio. And that's why you kind of see the strength there.\n\nPatricia Murphy -- Vice President, Investor Relations\n\nOK. Thank you, Toni. Let's go to the next question, please.\n\nOperator\n\nOur next question comes from Wamsi Mohan with Bank of America. Your line is open.\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nYes. Thank you, and congrats on the solid results. Arvind, can you talk about what you're seeing in the more transactional parts of the business in the context of particularly Q4, which is your largest transactional quarter? Any change in pipeline or conversion rates of that pipeline? Any color there would be helpful. And if I could, maybe, Jim, on the cumulative free cash flow that you guys just endorsed.\n\nHow should we think about the step-up in cash flow? And what would be the key drivers of that outside of the top-line growth conversion? What are the other moving pieces that would help in bridging that gap? Thank you so much.\n\nArvind Krishna -- Chairman and Chief Executive Officer\n\nSo, Wamsi, let me start and then give it to Jim, but I'm also going to reinforce a couple of points that Jim made in his prepared remarks. On transactional business, look, I can't speak to the yield. I can speak to the yield about 10 weeks from now. The yield will come in over the next 10 weeks as opposed to right now.\n\nIf I look at our pipeline, pipeline indicates the strength that we are seeing. That does give us confidence to say that we see revenue coming in above our mid-single-digit growth model. We see the pipelines are strong across software and hardware. So, the very strong hardware growth in the third quarter that is captured in the infrastructure business, I think that all reflects the demand that is there and across geographies, so not any particular single market being strong.\n\nIf I look at the software, I expect that the overall growth will remain strong, but there'll be some puts and takes in a couple of small countries that's possible. But that is the advantage of having a business that goes across 170 countries where that tends to get absorbed into the overall. Right now, I'll tell you, good pipeline. Based on the first nine months of the year, we expect yields to remain good or even better than before, and that's the space.\n\nAnd I'll just make a comment. I would like to say, as Jim pointed out in his prepared remarks, that there is an impact on FX. That is probably the biggest impact to what we are seeing right now. I certainly, I'll say, hope that we are seeing the end of the dollar strengthening as opposed to another significant change.\n\nJim Kavanaugh -- Senior Vice President and Chief Financial Officer\n\nYeah. So, Wamsi, to that point, as you know, our two key measures of success since Arvind has taken over as Chairman and CEO has been revenue growth profile, converting this portfolio into a sustainable growth orientation; and second, free cash flow generation, so we can have the financial flexibility to continue to invest in our business. And on that, we said maintaining guidance of about $10 billion. I'll remind everyone, that $10 billion is up over $3 billion year to year, first.\n\nAnd it's up $2 billion from what we published as IBM's post-separation baseline when you normalize out all the Kyndryl-related activity. So, as we spoke about and Arvind just kind of concluded before he turned it over to me, 90 days ago, this takes into account the external headwinds we've been talking about this year: one, being the orderly wind down and the exit of our Russia business, which we've already taken into account and we've been transforming our business and cost structure to take into account losing that high-value profit and cash; and second is the continuing strengthening of the U.S. dollar. Now, the latter, let's be honest, it definitely puts pressure on our midterm outlook.\n\nBut we're three quarters into that midterm outlook right now. We do have a robust hedging program as we are not immune. I mean, we do business in 170 countries around the world, over 100 currencies. As we talked about 90 days ago, we do not hedge 100% of our currencies.\n\nAnd second, we don't hedge out more than 12 months, very important point. So, currency is a real impact to profit and cash overall. Now, we hedge to provide us time to take the operational actions. That's price, that's sourcing strategies, that's cost structure, and the productivity initiatives that Arvind and I have put within the business.\n\nSo, right now, it's early in this midterm outlook. We've got a headwind on the U.S. dollar until it stabilizes. We are taking the appropriate actions.\n\nBut let's be honest, we are all focused on completing 2022. We have a very big fourth quarter in front of us. We've got to do roughly $6 billion of free cash flow in the quarter. That's about 60% of our free cash flow.\n\nBy the way, to put that in perspective, from 2017 to 2020, we did at or better than $6 billion of free cash flow. So, we've got the right portfolio, we've got the right set of operational actions and that's what we're focused on. Where are we going to get that headwind/tailwind? One, we completed our structural action, so that's all behind us, and we'll continue to get the Kyndryl tailwind for the next three months. Second, we expect a very solid working capital quarter with regards to the mainframe cycle and the pure volume dynamics of what's happening with our accelerated revenue growth profile.\n\nAnd third, we're going to continue driving a higher revenue profile, get operating cash out of that by driving operating leverage in our business. So, that's what our focus is on, completing 2022, and we will talk in January about where we're at and where the dollar's at.\n\nPatricia Murphy -- Vice President, Investor Relations\n\nOK. Thank you, Wamsi. Let's go to the next question.\n\nOperator\n\nOur next question will come from Erik Woodring with Morgan Stanley. Your line is open.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nHey, guys. Thanks for taking my question. Congrats on a really nice quarter here. I wanted to talk about the Consulting business.\n\nI thought margins held up better than expected in the quarter. So, can you maybe just elaborate on where you found success repricing contracts, where you've maybe had some challenges, either by end market or by geography? Are those pricing increases keeping pace with dollar strength? Would love if you could just double-click on some of the pricing actions and the success that you're having and where and why and how. Thanks.\n\nJim Kavanaugh -- Senior Vice President and Chief Financial Officer\n\nYeah. Erik, thank you very much. I appreciate the question and I appreciate the compliments, and I'm sure the entire IBM team has worked extremely hard. Pleased with this quarter.\n\nBut let's talk about Consulting. We talked all year long. Remember, you dialed back to January. We were talking about what we were seeing in the marketplace about an accelerating demand profile driven by our clients' digital transformations journey to cloud and that we were going to invest upfront and get ahead of that demand profile, both in skills, capabilities, ecosystems, acquisitions.\n\nWhy? Because Consulting plays an integral part to our hybrid cloud thesis. It is that tip of the spear. It drives the multiplier effect. It drags the scale and adoption to our hybrid cloud platform, and it pulls our IBM technology.\n\nNow with that said, when you look at it, that investment profile, coupled with a highly inflationary environment, we've seen pressure on our gross margin level throughout the year. But we've been making that up on an operating pre-tax margin because Consulting, along with our Infrastructure and Software, are yielding the benefits of a much more focused streamlined G&A structure now post-separation of Kyndryl, and a much more effective and aligned streamlined go-to-market model that's playing out. But when you look at it, 3Q year to date, our revenue profile is growing high teens. We're getting dollar contribution and we're seeing 3Q year to date about 30 basis points worth of margin.\n\nNow as I said in the prepared remarks, we talked about three core actions throughout the year: acquisitions, utilization, price. And around those, we saw green shoots exiting third quarter. Our acquisitions right now, we're on a steady state where they're going to be margin accretive in the fourth quarter. Second, we exited the quarter in a pretty challenging seasonal quarter of a third quarter with higher utilization.\n\nThat's a great sign. And third, for the second quarter in a row, we got price optimization and price margins that are up. That has led to our sequential improvement in margins from 2Q to 3Q by three points, and by the way, we expect that to continue in the fourth quarter, margins up sequentially and year to year. And that price optimization really, as you would expect, always translates back into the value proposition of your offerings.\n\nWhere we have value in application modernization, Red Hat, our hyperscaler, and strategic partnerships, we're seeing a nice margin accretion that's playing out, and that's going to fuel the fourth quarter here and first half of 2023.\n\nPatricia Murphy -- Vice President, Investor Relations\n\nThanks, Erik. Let's go to the next question, please.\n\nOperator\n\nOur next question comes from Shannon Cross with Credit Suisse. Your line is open.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nThank you very much for taking my question. I'm curious, just from an acquisition perspective, you talked about the small acquisitions you've made during the year. How are you thinking about maybe a larger acquisition? It's been a while since obviously with Red Hat. And almost more importantly, I'm wondering, as you think about your capital allocation, and I know you committed to what you -- the $10 billion for this year, but how do you -- how does the higher interest rate environment play into how you're thinking about what you might do and how you expect your balance sheet to look on a longer-term basis.\n\nThank you.\n\nArvind Krishna -- Chairman and Chief Executive Officer\n\nShannon, let me start by this thing. First, let me explain our rationale and our principles for acquisitions because it's important to understand that it's not so much size. Number one, they've got to fit our strategy, our strategy being hybrid cloud and AI, and in Consulting, those which add to our ecosystem growth and our talent. So, that limits the universe of what we would look at.\n\nTwo, especially if it's going to be larger, it's got to be accretive. Whether we talk about at the end of the first year or definitely in the second year, it's got to be accretive to cash flow. Three, there's got to be synergy with IBM. Like Jim mentioned about the $6 billion in inception-to-date signings and the 1,400 projects that Consulting did with Red Hat, that's synergy, meaning that we would not have gotten that revenue and that book of business if we had not done that acquisition.\n\nSo then if I say that those are criteria, those will be a criteria that would open up if there is something that is larger, with the correct valuation and the correct economic returns for the company. Now to your point on interest rates. Certainly, interest rates have an impact, but we'd also like to say there are multiple vehicles on how to raise cash because the overall FINFLEX, and we had talked about, about $20 billion of FINFLEX over the period, but there are other vehicles for also raising cash when we are an attractive target for the acquisition to come into. Jim?\n\nJim Kavanaugh -- Senior Vice President and Chief Financial Officer\n\nYeah. No, I would just add to the last point on the interest rate environment. Shannon, as you saw during this year, we've been prudent, I think, in hindsight now. It's always better to be lucky and opportunistic because we went out to the market and basically have pre-funded all of our requirements, for the most part, in 2023 already.\n\nWe issued $4 billion of debt in February. And just recently in July, we issued $3.25 billion worth of debt. So, we feel pretty good about our capital structure. 2023 is pretty much taken care of, which is our largest maturity tower when you think about $6.4 billion and then it steps down from there in 2024 and 2025.\n\nSo, we feel pretty good about that.\n\nPatricia Murphy -- Vice President, Investor Relations\n\nThanks, Shannon. Let's go to the next question.\n\nOperator\n\nOur next question comes from Keith Bachman with BMO. Your line is open.\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nHi. Many thanks. And echo the congratulations on the strategic direction. Jim, I just wanted to see if you could provide a clarification.\n\nWhat was the M&A contribution this quarter? And if you could give any distinction on the M&A contribution to Software. And then my broader question is -- relates to going back to services. The signings was down about 2% in constant currency for the quarter. How do you anticipate signings unfolding? And what does that portend for next year's growth, particularly as we look at a bumpier economy, particularly in Europe? And so, Arvind, you mentioned that you're affirming the mid-single-digit total revenue growth.\n\nBut if you could just talk a little bit about the services business, in particular, which I think is -- perhaps has a bit more risk associated with some of the Consulting activities in a tougher economic climate. Thank you.\n\nJim Kavanaugh -- Senior Vice President and Chief Financial Officer\n\nHey, Keith. I'll take the front end of this, and then Arvind can talk about the environment and our services portfolio overall. Really getting right to it, our inorganic contribution in the quarter to IBM was about one point worth of growth overall. When you take a look at that, we grew six and a half at actual rates, roughly 15% at constant currency, five points of that being Kyndryl year to year contribution, so read that, about 10 points worth of growth.\n\nOne point of that came out of acquisitions. Underneath that, it's still about two points in Consulting, which we're seeing nice scale of the Consulting acquisitions. And again, as I said on the previous question, we do see margin accretion as we kind of get to a stabilized level of our acquisition. And to Software basically rounded to zero.\n\nIt's all organic growth. Software had a very strong quarter, 14% growth at constant currency. About eight points of that being Kyndryl. That is all organic because we wrapped on our Turbonomic acquisition, which, by the way, still has done extremely well.\n\nSo, the currency, the -- or excuse me, the inorganic component is pretty much on a sustainable basis right now overall. Before I turn it over to Arvind, let's just talk a little bit about what we see underneath signings. First of all, we still have, we believe, a solid book-to-bill on a trailing 12 months. It's 1.05.\n\nAnd remember, that's maintaining a book-to-bill in excess of one on very strong revenue contribution, five consecutive quarters of double-digit growth. And year to date, we're up in the high teens overall. So, what are we seeing underneath? Because I think as I've said many times before, all signings are not alike, and they all don't translate to revenue the same way. When we look at our strong demand, it's driven by application modernization, strategic partnerships.\n\nBy the way, the velocity of our strategic partnership signings are up trailing 12 months, almost 25% to 30%, and it's about 40% of our business now. We're capturing that. Red Hat inception to date, $6.6 billion, but it's really the small deal momentum. We're seeing the durations of our backlog come down a couple of months because our small deals, that's the volume-based business for six consecutive quarters in a row, we've had double-digit growth.\n\nAnd what does that mean? That has high revenue-yielding contribution end period. And that's what gives us the confidence, when we look at that backlog realization and how it plays out for fourth quarter, for us to commit the low double-digit revenue growth.\n\nArvind Krishna -- Chairman and Chief Executive Officer\n\nYes. Thanks, Jim. So, Keith, let me just maybe use the opportunity to remind everybody of what we had talked about as our midterm model, which was sort of the three-year model that we laid out last October. We had said that we expect Software to grow in mid-single digits, so think 4% to 6%.\n\nAnd we had said Consulting to grow in high single digits, and we had said that Infrastructure will be about flat. This year will be a good year because of the product cycle and then probably somewhere in late '23 or '24, we'll get the flip side of that, up from this year. So then you get into Consulting, our long-term model was not in the teens, which it has done this year. It was in the high single digits.\n\nSo, the book-to-bill, combined with the shorter-term signings, gives us confidence that we will be able to maintain that model. Look, I think Consulting to the point, I think you're all trying to ask, the nature of our Consulting business is very different than some others. The bulk of our Consulting business is in digital transformation, helping our clients move to cloud, not just our cloud, but AWS and Azure among it. It's on properties that I think are fairly essential to our clients.\n\nSAP, CRM, Adobe are great examples. As you begin to wrap around, help them move to cloud, both public and hybrid, help them do digital transformation, help them take advantage of these massive productivity SaaS properties that I just named. Even in an inflationary environment, even when the economy is not doing well, these tend to be the projects that stay the course, but maybe the signings come in smaller chunks, and as long as we deliver well, then people tend to sign up more and more going forward. And that's sort of a bit of color on what we're seeing play out already this year and we expect that to maybe increase next year.\n\nPatricia Murphy -- Vice President, Investor Relations\n\nThank you, Keith. Let's take one last question.\n\nOperator\n\nOur last question will come from David Grossman with Stifel. Your line is open.\n\nDavid Grossman -- Stifel Financial Corp. -- Analyst\n\nThank you. Thanks for squeezing me in. I know we've covered a lot of ground already. And Jim, you've done a very good job of summarizing how you're going to get to that $10 billion of free cash flow for the year.\n\nI was wondering if I could just follow one thing up there though. Last quarter, I think you talked about $500 million to $700 million of structural actions, I think, in the 2022 free cash flow guide, if I'm remembering right, which should not reoccur. And I think we need to add to that the exit from Russia and FX, which I think you highlighted both. However, any chance you could help to mention those last two items so we could get just a better baseline going into next year?\n\nJim Kavanaugh -- Senior Vice President and Chief Financial Officer\n\nYes. David, thank you, and thanks for the compliments. Really goes out to the entire IBM team overall. When you take a look at our free cash flow posture, one, I think we have quantified back in, earlier this year in April, about our Russia business.\n\nOrderly wind down, right decision, unfortunate humanitarian crisis that continues right now. But that was about a $300 million revenue profile and about a $200 million profit and cash profile overall. As I said, yes, that's been an impact this year, which is one of the reasons why we went down to about $10 billion as we stated. But again, we've been taking -- knowing that decision, we've been taking the right operational actions to drive the productivity knowing that '23 and '24, we won't have that.\n\nSo, that's point No. 1. Point No. 2, the structural actions, yes, north of $500 million.\n\nIt's behind us this year. Remember, that becomes a tailwind in 2023 and 2024. That's why I've said multiple times before, free cash flow is not going to be linear when we look at 2022, 2023, 2024. One, we will have the wrap on that in '23, plus second, the exit cost of getting rid of that stranded cost, you get ROI on that activity overall.\n\nThe big wildcard, if you want to use it, is what's going to happen to the U.S. dollar. Now you see what's happened to us this year. This year, third quarter, let's put it in perspective.\n\nAs I said, a little over eight-point gap between constant currency and actual rates, as you've seen in our backup charts, it's about a $1.1 billion revenue. By the way, that's about a $0.15 profit and EPS impact in the quarter that we've had to overcome operationally. Now, that, again, will continue to the extent the U.S. dollar doesn't devalue over time.\n\nWe are taking the appropriate measures. We're running our scenario models. We're stress-testing our business. We've got a long path into '23 and '24, but it's going to come from the actions I talked about: price, sourcing, and cost structure.\n\nEach of those pieces are going to have to overcome that. And the beauty of our hedging program is it buys us time to smooth out the volatility of earnings right now. So, we are focused on that. We'll talk a lot more about where we see the U.S.\n\ndollar 90 days from now and what that means for 2023 cash as we go forward. Now, one last thing I want to put in place. That fourth quarter cash is very important, that $6 billion, give or take, in us delivering that about $10 billion. That is going to come out predominantly out of our operational profit driven by: one, that revenue growth at the high end of our model all in.\n\nBy the way, anniversary of Kyndryl, we got two more weeks and we anniversary that. That is offset by basically Watson Health. So, all-in, high single-digit model is a good representation of today's IBM. Second, we expect two and a half points of operating margin in the fourth quarter.\n\nWhy is that important? Yes, it's going to deliver that free cash flow in the fourth quarter, but it also gives the investor a perspective now that we're basically anniversary-ing the year-to-year contribution of Kyndryl, you see the healthy operating leverage at this portfolio now that we reposition can deliver. So, with that, I'll turn it back over to Patricia.\n\nArvind Krishna -- Chairman and Chief Executive Officer\n\nOK. Thanks, Jim. And I think Jim gave you a lot of color in this Q&A on cash flow, the quarter, and how we think of our business going forward. Let me just wrap up the call.\n\nWe have made really good progress since we laid out our strategy in our Investor Day last October. We are well-positioned to meet our clients' needs going into the end of the year, and we look forward to taking you through our fourth-quarter performance and our view of 2023 in January. I look forward to speaking to all of you again soon.\n\nPatricia Murphy -- Vice President, Investor Relations\n\nSheila, let us turn it back over to you to close out the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPatricia Murphy -- Vice President, Investor Relations\n\nArvind Krishna -- Chairman and Chief Executive Officer\n\nJim Kavanaugh -- Senior Vice President and Chief Financial Officer\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nToni Sacconaghi -- AllianceBernstein -- Analyst\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nShannon Cross -- Credit Suisse -- Analyst\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nDavid Grossman -- Stifel Financial Corp. -- Analyst\n\nMore IBM analysis\n\nAll earnings call transcripts"
}