{
  "companyName": "22nd Century Group",
  "companyTicker": "XXII",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/22nd-century-group-xxii-q2-2022-earnings-call-tran/",
  "content": "22nd Century Group (XXII 3.01%)\nQ2 2022 Earnings Call\nAug 09, 2022, 10:00 a.m. ET\n\nOperator\n\nWelcome to the 22nd Century Group's second quarter 2022 earnings conference call. [Operator instructions] As a reminder, today's conference is being recorded. At this time, I would like to turn the call over to Joe Schepers, vice president of communications and investor relations. Please begin.\n\nJoe Schepers -- Vice President, Communications and Investor Relations\n\nThank you, Alex. Good morning and welcome to 22nd Century's second quarter earnings conference call. Joining me on the call today are; Jim Mish, our chief executive officer; Hugh Kinsman, our chief financial officer; and John Miller, who leads our Tobacco Business. Earlier today, we issued a press release announcing our results for the second quarter 2022.\n\nWe will start today's call with prepared remarks from Jim, John, and Hugh before moving into a Q&A session. During our prepared remarks, we will be referring to slides, which are available for viewing in the webcast and posted in Investors section of our website at xxiicentury.com under the Events subheading. We hope these files will serve as a framework for management's prepared remarks, reinforce key takeaways and provide additional transparency and insight into our business, strategy and objectives. Also, those of you joining by webcast can submit questions through the online interface which we may include during the Q&A section of today's call, time permitting.\n\nSlide 2. Before we begin, some of the statements made today are forward-looking. Forward-looking statements are subject to risks, uncertainties, and other factors that may cause actual results to differ materially from those contemplated by these statements. Additional information regarding these factors can be found in our annual, quarterly and other reports filed with the SEC.\n\nDuring this call, we also will discuss non-GAAP financial measures, including adjusted EBITDA, which we define as earnings before interest, taxes, depreciation and amortization as adjusted for certain non-cash and non-operating expenses. For more details on these measures, please refer to our press release issued earlier today. And with that, I'll turn the call over to Jim beginning on Slide 3.\n\nJim Mish -- Chief Executive Officer\n\nThanks, Joe, and good morning to everyone. I'm really excited to be joined today for the first time by John Miller, the president of our Tobacco business; and Hugh Kinsman, our CFO. I welcome these two leaders to deliver on our shareholders' request for more detailed tobacco commercial updates and insight into the execution of our business fundamentals as we grow. If you listen carefully, you're going to hear in much more detail than in the past and help connect the dots.\n\nThe second quarter was a major transformation that included the most significant developments in the history of the company. We continue to execute and deliver on our mission to improve human health through reduced nicotine content tobacco, improved Hemp/Cannabis plant technologies and advanced top plant science. In fact, we had major success in two key areas. First, we launched our highly anticipated VLN pilot program at more than 150 Chicago land Circle K stores starting in early April.\n\nWe have exceeded our key market expectations, and that was only through product distribution endpoint, in-store point-of-sale and general PR and media outreach supporting the launch. We now have a baseline set on market share and are testing several target offers designed specifically to accelerate further growth. In short, we are off to the races on VLN, and John will speak in much more detail on this topic. Second, we completed a major transaction on May 13, acquiring one of the top ingredients and CDMO providers in the hemp-derived active space, GVB Biopharma.\n\nIn addition to doubling our revenue on an annualized basis and improving our margins, GVB completes the vertical integration of our Hemp/Cannabis business from receptor science and plant genetics, all the way to finished white label goods on shelves for consumers. In addition to global scale facilities and a new advanced extraction unit, just about to come online, we also picked up a world-class management team, including our new CFO, Hugh, who will speak more about this. I couldn't be more pleased or excited about the progress we made in the quarter and the continued growth of our legacy business, but we're just getting started. Moving to Slide 4.\n\nWe now operate in three large alkaloid plant franchises, each with unique growth opportunities, Tobacco, Hemp/Cannabis, and Hops. In tobacco, we are building on the pilot program success, expanding our activities in Chicago and beyond. The results of the pilot program drove our decision to accelerate our launch plans and I'm pleased to say that we're going into Colorado where we can continue to increase our market footprint substantially, while benefiting from the MRTP state excise tax rate that favors our VLN products. This is a $600 million market in just one state, and we see a clear pathway forward as we continue to expand our reach.\n\nAgain, John will elaborate much more on this in just a few minutes. For hemp/cannabis, the acquisition of GVB accelerates our path to profitability in this exciting market. The new Oregon extraction facility will be coming online in the next few months with a commensurate scale-up of volumes from the business. We're also integrating our unique plant science to provide even higher yields and margins.\n\nCurrently, we are actively investing in a number of business development activities to further scale the business and have line of sight to rapid growth in cash positive operations. And finally, our Hops franchise is advancing well with our scientific teams now under the direction of Dr. Calvin Treat, who joined us earlier this year. We're hitting key technical milestones in this large global market that is ripe for disruption.\n\nAnd with that, I'll turn the call over to John Miller to talk about our reduced nicotine content tobacco products. John?\n\nJohn Miller -- Head, Nicotine Business\n\nThanks, Jim, and good morning. I'm pleased to be here on my first call with 22nd Century Group. I have been involved in the tobacco industry for more than 30 years, and this is potentially the most disruptive and impactful product I have seen in my career, a product that will help adult smokers to smokeless. Moving to Slide 6.\n\nOur Chicago pilot with Circle K is going very well. We started with an initial distribution launch in the more than 150 stores selected to participate, providing basic media support, in-store point-of-sale and for example, client [ph] training for in-store promotions. Our goal was to set a baseline market share, with the actual results exceeding our internal targets. Due to a commercial need for confidentiality, we can't share the Circle K numbers at this time.\n\nHowever, what we can share is that we are more than pleased with what we're seeing. Feedback in the stores and from consumer focus groups has been overwhelmingly favorable and has reinforced our confidence that VLN will be accepted and adapted by adult smokers through three key activities, education, awareness and trial. With help you smokeless is part of our FDA required label, smokers know exactly what our product is designed to do. And given that 60% to 70% of smokers want to quit and have even tried repeatedly to do so, we fill a need where they are actively seeking new tools to reduce their nicotine consumption.\n\nWe are now in Phase 2 of our pilot program, deploying targeted offers to drive increased share. By refining our approach, we will then be able to move into an expanded launch as part of the Phase III rollout. Given that we're talking about an $80 billion US retail market, capturing even a very small percentage of this market will be transformative for 22nd Century and our revenue line. Just extrapolating the math to illustrate the initial opportunity we see within the total national market, and you can pick your own numbers, but let's keep it really simple.\n\nEvery half a share point achieved in the US retail market would equate to approximately $400 million in retail sales, which is about $250 million in VLN revenue to 22nd Century. That's an exciting starting point for any company. And obviously, we want to move well beyond that starting line. Markets outside the US also provide exciting opportunities to drive further topline and bottom-line growth and create further value.\n\nMoving to Slide 7. How do we get there by expanding our launch? The success of our Chicago pilot showed us that our marketing mix was highly effective already. And so we've decided to accelerate our plans and launch our VLN products in Colorado, which we expect to have in place as early as next month. Colorado is the first of many exciting announcements we expect to make all centered around organic expansion and adding to our market opportunities.\n\nAnd I want to be clear none of these expansion opportunities we are presently looking at detract in any way from the ongoing expansion plans with Circle K and any other drugstore or channel partners we've previously mentioned. They're all additive and they're all accretive. As well as being a large market with excellent partners for retail, Colorado has a $6.50 per carton state excise tax savings for MRTP authorized products. This excise tax savings can be used in comprehensive programs, for example, to provide adult consumer incentives, expand store and brand distribution or to fund additional marketing to raise awareness among adult smokers of our unique products.\n\nA number of states actually offer this incentive. In fact, Michigan recently approved a similar $5 per carton MRTP state excise tax reduction. This is a good example of state actions that can benefit our market opportunity even ahead of federal action and recognizes the positive contributions our MRTP products can make the society by helping people smoke less. Key takeaway here is at Colorado was a $600 million market with a large number of dose smokers who VLN can be a game-changer.\n\nTurning to Slide 8. With thousands of stores across the state counting tobacco products, we have a great opportunity here. We've already identified 3,000 stores in the state that we intend to service. This is sizable.\n\nConsidering that going national with a single chain would be in the range of 4,000 to 5,000 stores, we are taking opportunities to open VLN to additional retail partners within the state. By combining these additional distribution points with our learnings from our pilot program in Chicago, we will be able to deploy multiple initiatives to build education, raise awareness, and drive trial for the brand. Additionally, some of these retailers are well placed to further partner on the VLN expansion and distribution into other states. To ensure we can support retailers and effectively stock stores of VLN, we are engaged with two top-tier CPG distribution partners that want to carry our products.\n\nThe first is a large CPG distributor that covers grocery, convenience store and drug stores with a variety of brands, making it a great partner to distribute our products. The second is a more specialized distributor with expertise in CPG and the other tobacco products category. We're finalizing agreements and readying for launch. And I look forward to sharing either further information with you all at that time.\n\nMoving to Slide 9. We are also executing on our strategy to ramp up our growing and manufacturing operations to support demand. Our manufacturing facility is a key strategic asset where we have built the capabilities needed to produce high-quality, reduced content cigarettes as well as our current VLN production. We've already produced tens of millions of research cigarettes used in the independent clinical studies that underlie our help to smokeless labor requirement and FDA's larger plans to ban menthol and require all cigarettes to be non-addictive.\n\nGiven the increasing demand we anticipate, our factory team has expanded capacity by 25%, including the addition of a new line and a second shift. To meet anticipated demand for our VLN products, we are working with highly experienced US tobacco growers to produce our largest ever VLN tobacco crop in 2022. This crop includes the company's second-generation reduced nicotine tobacco plants. Already this year, we are seeing higher yields, enhanced quality leaf, improved disease resistance and a reduction in nutrient inputs, positive developments from both the commercial and sustainability perspective.\n\nHarvest and leaf curing will occur throughout this fall. Our CMO tobacco revenue has helped cover the cost of our facilities to date. Looking ahead at VLN expands its rollout and ramps volume, we expect to transform this business into a high margin, higher volume operation. This includes the opportunity to license our technology and capabilities to other brands that want to join us in the reduced nicotine revolution, helping even more adult smokers to smokeless all while driving top line growth.\n\nFinally for me, Slide 10. The FDA has been clear about the critical role that reducing nicotine in cigarettes can plan tobacco harm reduction, which will bring even greater sign of benefits in the proposed menthol ban. A CDC survey a couple of years ago showed that high levels of support for reducing nicotine content in cigarettes with 80% of adults, including 80% of smokers supporting reducing nicotine in cigarettes. These facts and other data show that the adult smoker understands the potential value on a product like VLN, which can help them smokeless.\n\nObviously, we recognize that these policies won't happen overnight, but incremental progress help smokers take positive actions even more before the policies are fully realized. This includes policies being implemented by the number of cities and states to move in this direction even ahead of federal action. As part of the public comment period, we have submitted our response to the FDA proposals. And as we have stated before, our position is that we are in favor of the proposed menthol ban in highly addictive cigarettes.\n\nRegardless of whether the ultimate regulatory proposal for menthol survives the inevitable litigation we anticipate from the tobacco industry, our FDA authorized VLN King and VLN Menthol King products are on the shelf today, and will soon be even more accessible, giving more adult smokers around the US, a new tool to help them smokeless. I hope you can see that we've been incredibly active and are excited to finally bring VLN to market, and are moving ahead to open even more stores where smokers can buy these important products. I'll now pass it back to Jim for an update on our hemp/cannabis and hops franchises. Jim?\n\nJim Mish -- Chief Executive Officer\n\nThanks, John. It really has been an amazing second quarter in tobacco, and we are extremely excited for the path ahead. Let's turn to Slide 12 as we focus for a few minutes on our other two growth franchises, starting with hemp/cannabis. We remain absolutely committed to building our leadership position in the hemp/cannabis industry by developing superior plant lines and now superior extraction, ingredient and finished product capabilities.\n\nOur original mission was to optimize the plant genetics and hemp/cannabis to create stable improved varietals needed to move this industry to true commercial scale. In addition to better yield plant consistency for harvest, disease resistance, drought resistance and other key characteristics can be modulated to disrupt this industry. We've now taken it to a new level. On Slide 13, we acquired GVB Biopharma effective May 13.\n\nGVB is a global leader in the manufacturing of hemp-derived, active ingredients and finished products, servicing the nutraceutical consumer products and pharmaceutical industries. This acquisition positioned 22nd Century as the global leader in cannabinoid ingredients and leading CDMO for white label products across many end-use markets. It completed our vertical integration platform through which we can now monetize our deep intellectual property portfolio in hemp/cannabis and also doubled our revenue on an annualized basis, improved our gross margin profile, and accelerates our path to profitability in hemp/cannabis. Slide 14 should be very familiar to many of you, illustrating our upstream hemp/cannabis capabilities, you can quickly see the addition of GVB means we now own the extraction, purification products capability with a global leading CDMO facility.\n\nWe're now fully verticalized and able to bring together plant science, best-in-class ingredients and finished goods capabilities to help move this industry forward. Slide 15 gives you a feel for the facilities we picked up in the transaction, including a 30,000 square foot refinement facility, a 40,000 square foot manufacturing site and perhaps most exciting, a new world-scale extraction facility in Prineville, Oregon, that will start out at a 20,000 kilo per month capacity, but we believe we can produce far more when fully loaded. Slide 16 illustrates the diverse range of ingredients that make up the bulk of GVB's revenue today. As a global leading cannabinoid API supplier, 22nd Century and GVB cover potentially the broadest spectrum of products in the industry, all at exceptional levels of quality.\n\nFinally, I want to update you on our steady progress in specialty hops for the global market. This is a closely related alkaloid plant family, where we can leverage our alkaloid plant expertise and IP for new growth opportunities. Hops is an extremely large global market, and we believe our unique know-how and IP can bring exciting improvements to this industry. We are hitting key technical milestones and working with strategic partners to transform the hops plant and reduce the development cycle to reduce cost, risk and time required to create disruptive plant strains.\n\nThe addition of Dr. Calvin Treat to our team, bringing world-class ag science experience gained to some of the largest players in food crops. Has helped our team accelerate and focus these efforts, and I'm excited for the path forward in this large and underserved market. I'll now pass you over to Hugh to review our financial performance.\n\nHugh?\n\nHugh Kinsman -- Chief Financial Officer\n\nThanks, Jim, and good morning to everyone. Starting off on Slide 20 with the quarterly results. Net sales increased by 73% year over year to $14.5 million, primarily through the addition of a half quarter of GVB revenue and improved CMO manufacturing mix. We continue to generate new business and orders with additional customers, plus are now manufacturing VLN cigarettes for a pilot program and now Colorado.\n\nGross profit margin in the second quarter increased year over year to 6.1%. I would mention that that number is a result of purchase price accounting and does not reflect our projected gross margin for the business going forward. We expect to report a more typical gross margin starting next quarter, and I'll explain on Slide 21. Since we had a partial quarter for GDP, this slide should help level set and explain both revenue and gross margin more clearly.\n\nFirst on revenue, tobacco revenue increased to $10 million from $8.3 million for the second quarter year over year, a gain of 19%. Gross margin on tobacco sales increased to 10% through a combination of increased volume and favorable sales mix. On the GVB's side, we recorded approximately half a quarter of operations from the closing date of May 13. Revenue recorded in half a quarter was $4.5 million, while we reported negative gross margin due to a $1 million amortization step up tied to purchase price accounting for the acquisition.\n\nExcluding this one-time non-cash charge, GVB's gross margin was about 22%. And GVB's gross margin is typically 20% to 25% and will be reflected in consolidated operations going forward. Slide 22 illustrates the purchase price accounting in more detail. It should be noted that certain portions of the purchase price accounting will be adjusted in the coming quarters, in particular the goodwill and intangible sections.\n\nAs the footnote from our 10-Q explains, this preliminary allocation reflects provisionally estimated fair values as of the date of the acquisition. The fair values are determined using significant estimates and assumptions, and we are completing valuations required to allocate the purchase price in areas such as property and equipment, intangible assets, deferred taxes and goodwill. And as a result, we expect these allocations to change in the future. And last for me, on Slide 23, you'll see a few key highlights from our balance sheet.\n\nOf note, the total assets of more than $119 million, includes the $44 million of goodwill from the GVB acquisition. Also the $26 million of cash at quarter-end was supplemented by an additional $35 million in gross proceeds from our offering in July, which will help accelerate our VLN launch plans. I know that many of you are focused on our cash position and how we are using it to continue our steady progress toward profitability. The company is selectively deploying capital to accelerate the launch of VLN, expand tobacco manufacturing operations, invest in GVB's production capacity and increased inventory levels to meet growing demand for both hem cannabis and tobacco products.\n\n22nd Century's cash requirements and anticipated decrease reflecting higher sales volume for VLN products through fiscal year 2023 and continued organic growth of the GVB's operations. As a result, the company has adequate liquidity from the current balance sheet to complete strategic initiatives. And in fact, the acquisition of GVB was not only done at a very reasonable multiple of sales, it also transforms 22nd Century's hemp/cannabis business from a call center to an organically expanding and cash-generating business, which we expect to be fully realized in 2023 at the investments we are now making to meet market demand. I'll now pass it back to Jim.\n\nJim Mish -- Chief Executive Officer\n\nThank you. It's an exciting time for 22nd Century as we accelerate our US VLN launch with several major national C-store and pharmacy change placing our VLN products in front of customers. With our pilot exceeding our expectations and a massive market opportunity, even a relatively small share of that market is transformational to us, as John described. With the proposed menthol ban moving ahead as it should, plus state actions in advance of federal policies, there's never been a better time for a disruptive reduced nicotine content product.\n\nWe're ready to go, not just on our innovation tobacco products, but also in our hemp/cannabis products and new GVB platform that doubles our revenue now that is fully integrated and enhances our path to profitability as we plan to capture and leverage all of the synergies of our two companies in the months ahead. We have built the framework and foundation, and we are in a strong position to execute the next phase of our strategy to maximize the full potential of our tobacco and hemp/cannabis business now and hops in the future. And with that, operator, please open the call for questions. Thank you.\n\nOperator\n\nThank you. At this time, we'll be conducting a question-and-answer session. [Operator instructions] We will take questions from the approved list of analysts first. If we have time, Joe will read a question that was submitted via the webcast.\n\nOur first question comes from the line of Vivien Azer with Cowen.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nHi. Good morning.\n\nJim Mish -- Chief Executive Officer\n\nHi, Vivien. Good morning.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nHi. Good morning. I wanted to start on Chicago with the VLN pilot, please. I certainly appreciate that Circle K's metrics are competitively sensitive.\n\nI was wondering, if you could just offer some relative content, context perhaps, like, how would velocity an average door compared to a mainline combustible cigarette competitor? Just as one example. But just to help dimensionalize the performance. Thank you.\n\nJohn Miller -- Head, Nicotine Business\n\nGood morning, Vivian. This is John Miller. The best way to put it is we looked at our own internal goals set forth through several different KPIs and metrics. One of them is, obviously, historical performance of what new product introduction would do in a similar space.\n\nWe also looked at stores in different areas. So if you look at Chicago land as a market, all of our stores have some very different variables within them. Some of them are in Coke County; some of them are near schools, churches, whatever the different regulation. So the actual performance of the product does vary based on store neighborhood pricing.\n\nThere's different taxes in Coke County than in some of the other stores. But overall, we found that our sales and our share levels increased beyond what we set as targets were extremely favorable, and really, some of the keys of that were also the learning that we did in the focus groups about what drove that. That led to our decision to expand through Illinois and then move into Colorado, which different than Illinois has an MRTP tax basis that is $6.50 a carton less than traditional cigarettes. So I mean, in summary, a good, broad segment of stores in different variables achieved our results, looking at historical numbers in terms of what the space has provided for new products, I'm very, very happy with that, took those learnings and now we're expanding through Illinois into Colorado.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nUnderstood. Thank you for that perspective. If I could just follow-up, recognizing, of course, the demographic differences across the store base in the Chicago area. But any trends that are solid enough that you could call out in terms of average age of consumer or average relative income of consumer that's attracted to the VLN product? Thanks.\n\nJim Mish -- Chief Executive Officer\n\nI would say when you look at the -- I can't say that the demographics of VLN are going to be different than the demographic of a cigarette smoker. What I would say is this, though, the smoker that is looking to quit smoking that 60% to 70% of that population of 34 million to 40 million people, that's who this is attracting. 90 days into the program, I can't tell you household income numbers, things like that. But I can tell you who's interested.\n\nIt's the people who are trying to quit smoking. That was originally identified as the target consumer. That continues to be the target consumer, and that's where this message resonates. When you look at those three pillars of what we learned in the test and these are the critical pillars.\n\nWhen you look at education, awareness and trial, that is what the marketing platforms will be built off of. That's what people need to understand about this product. If someone's of Marlboro a smoker, it doesn't necessarily translate that this product is for them. Some of the Marlboro smoker who wants to quit, understands what the product is, sees it in store, understands what it does, how it performs.\n\nThat will be our target demographic. That's who we will attract.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nOK. That's helpful. Thank you. And then just pivoting last question, please, to Colorado.\n\nSome of your larger peers haven't had the ability to take advantage of some of these MRTP tax incentives or tax savings. So understanding that you can deploy those savings across a number of different consumer engagement initiatives, does the law mandate that, that's where that tax savings goes? Can you drop some of it to the bottom line? Just curious the mechanics of that tax law? Thank you.\n\nJohn Miller -- Head, Nicotine Business\n\nI'm not aware of it being mandated that it has to be put in any specific pricing or promotion or merchandising whatever. I'm not aware of the law saying that. Understanding the law and understand the benefit, what we've learned in the pilot our takeaways out of Chicago, what we've seen in our research moving forward, which is while in my comments I talked about specifically some things we can use that for. That savings certainly could be reflective in price, could be reflective in additional education and awareness programs, trial programs, enhanced margins for retailers for doing additional merchandising.\n\nWe are still working out some of those things and some of those decisions will be based probably on more on channel than anything else. But it does give us a bit of room to operate. There's no doubt about it.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nUnderstood. Thank you very much.\n\nJohn Miller -- Head, Nicotine Business\n\nDoes that answers your question?\n\nVivien Azer -- Cowen and Company -- Analyst\n\nIt does. Thank you.\n\nJohn Miller -- Head, Nicotine Business\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Aaron Grey with Alliance Global Partners. Please proceed with your question.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nHi. Good morning and thank you for the question. So kind of want to piggyback a little bit on what Vivien was saying in terms of Chicago again, I can appreciate how you cannot give exact numbers. But while it's still in the early days, any color you can provide in terms of retention versus trial that you're seeing, especially given that it is the user that you said was looking to quit conventional cigarettes? And then as well, what you're seeing in terms of like dual use with VLN versus traditional cigarettes or maybe to that on with some type of a patch or Easter any types of consumer trends without giving any exact data would be helpful? Thanks.\n\nJohn Miller -- Head, Nicotine Business\n\nSure. Thanks, Aaron. In terms of very specific connection to data on repeat purchases, previous purchase patterns, we just don't have that yet. One of the great -- several cases are a sophisticated retailer, especially in the convenience industry.\n\nOne of the best convenience marketers out there. They do have some loyalty programs. We're tying into their technology. And that's really what Phase 2 has been about getting into their Lyft program, DGP programs and kind of understanding how their consumers shop, so we're trying to get some of that data right now.\n\nBut again, we're looking at 150 store tests. And it's hard -- was the causation correlation about multiple purchases were they in the right stores? Do they understand the test stores. These are all things we're working through. So we understand the importance of that, certainly understand the importance of understanding how many times the consumer buys the product, stays in the category, stays with the brand.\n\nReasons for purchase path to volume, I mean, those are all things we're getting to. So that's why we're hoping expanding the launch going deeper into different states will help us get that type of information. In terms of dual use with a patch, probably the best I can tell you is that when you look at the research, the 22nd Century provided the FDA and some of the research that came out of this was actually a consumer, an adult smoker that uses VLN in combination with an NRT and whether that's a gum patch, whatever, it seems to help both of them. Both of those products get people off of nicotine. So right now, we don't have definitive data on a Circle K shop or also buying Nicorette, but we do know that through the data, both of those products work well together, which is a very interesting strategy moving forward.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nOK. Great. Thank you for that. And I wonder, if I can give numbers, just in terms of it exceeding your expectations.\n\nCould you just let us know in terms of maybe like the trends. So maybe month over month, have you continued to see an increase, or was there kind of an initial large uptake that is then trended down just in terms of whether or not it's continuing to trend upwards in terms of your sales, as well as market share will be helpful without giving the exact numbers? Thanks.\n\nJim Mish -- Chief Executive Officer\n\nYeah. No. Certainly trending upwards. Certainly, the first six weeks as some of the marketing Pete, that's what we call our Phase 1 timeframe.\n\nAs those things started to kick in, consumers started to understand what the product was, ramp up, so every store having sales Phase 2 now that we're starting to do more and more of it certainly continues to grow.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nOK. Great. Thanks very much, and I'll jump back in the queue.\n\nJim Mish -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Brian Wright with Roth Capital Partners. Please proceed with your question.\n\nBrian Wright -- ROTH Capital Partners -- Analyst\n\nThanks. Good morning. I was hoping, I think could you provide some color on consumer kind of trials as far as like following test groups or anything like that? Is the initial trials, or there's any work along those lines that you can speak to?\n\nJim Mish -- Chief Executive Officer\n\nBrian, just to clarify, are you saying about the research studies or actual in-store feedback?\n\nBrian Wright -- ROTH Capital Partners -- Analyst\n\nKind of in-store feedback following any initial users or groups of initial users or anything of that nature?\n\nJim Mish -- Chief Executive Officer\n\nWe do that now. We have two different things I can kind of report out. One is anecdotal feedback that we have perceived back from just store personnel or the occasional consumer we or our people may have run into. But that feedback, obviously, very positive from some of our brand ambassadors that have worked as store personnel, getting people to understand what this product is, having them try it, that's been very positive.\n\nOn the research side, we did an in-home use test, which was completed, have gotten the preliminary feedback from that. And again, when you start talking about education awareness trial, key pillars that I came out of that, but even the feedback on the product from the in-home use test, right, people said, it was great smoking experience. People said, it provided good tobacco taste and provided tobacco satisfaction. Some people said things like they never saw anything like this.\n\nWe got like 93% interest and purchase intent from focus group participants, great acceptance and usage, when you do an in-home use test, invariably some of the people fall out of the group. What we saw here was our first week, 100% of the participants stayed in the focus group. At the end of two weeks, we had 96% of the people still in the focus group. It was really, really interesting seeing what happened.\n\nNow again, as we stated, excuse me, as I already stated, this is a group of consumers that is interested in stopping smoking. This is a group of interest that want to get away from cigarettes. So that's why we know as we move deeper into these markets, and we continue to pursue this education awareness and trial platform, that's how we're going to get people to use the product. The other research we have going -- so that was our in-home use test.\n\nThe other one we have going is what's called the Capstone Project, which is more a perception post trial, but that research is still being done and I haven't gotten the results of that back yet. Again, about 90 days into this but we know how important it is to understand this about the consumer. We know how important it is to understand why they're using it, whether or not it's working and what their perception is of the product.\n\nBrian Wright -- ROTH Capital Partners -- Analyst\n\nNo. That's great feedback. Thank you so much. Could you also maybe provide us just a little more detail on kind of the increased Chicago Circle K stores or expansion outside of the Chicago land area and Illinois.\n\nJust any way to kind of think about what's next there?\n\nJim Mish -- Chief Executive Officer\n\nSure. And like any launch of a product, right? As you get into it, you start understanding where you want to go? What are the drivers of the volume? How are you sourcing your volume, where the consumers, right? We haven't pulled value from wanting to be a national brand. There's no doubt about it. I mean everything we talked about today, what we put in that presentation, in the press release, all of that is additive to what we want to do.\n\nThese are things we're going to continue to keep moving forward. We're seeing a change in the environment, right? Since we've launched this product, there's been a tremendous amount of PR on what's happening within low-content nicotine cigarettes. What's happening with the FDA? What's happening with Joe Biden and what he's saying about his policies. We're starting to get out in front of consumers' minds a little bit, but we know we have to get out there and explain to people what this product is.\n\nWe have to educate them, get awareness on this. So we're going to move through Illinois, where we already have a foothold. We're going to be moving into Colorado, which makes sense. It will be our first MRTP tax state.\n\nAnd we have multiple other things that we're working on right now, which I'm just -- I just don't want to announce right here on this call, but they are in process. The plans are being made, and we're going to continue. There's a lot of momentum behind this product right now and our activities to expand quick.\n\nBrian Wright -- ROTH Capital Partners -- Analyst\n\nNo. That sounds great. There are a lot more stores in Chicago? Is it too early to talk about kind of the next kind of tranche of the stores and kind of how to think about the size on that. You know, as investors, we love numbers.\n\nSo with something like that would be great.\n\nJim Mish -- Chief Executive Officer\n\nI totally understand it. I understand for your modeling and things like that. I'd rather not put a hard number on Illinois just yet because we are working on some things that i.e., just don't feel comfortable to announce, but Illinois is a fantastic.\n\nJohn Miller -- Head, Nicotine Business\n\nThere are some good stuff that's coming, and we just got to be patient.\n\nBrian Wright -- ROTH Capital Partners -- Analyst\n\nI got it.\n\nJohn Miller -- Head, Nicotine Business\n\nOK.\n\nJim Mish -- Chief Executive Officer\n\nI just want to be able to announce it, but I mean, to your point about Illinois, there's a lot of stores there. There's a lot of interest in the product now. I mean it's I think Illinois is a number 14 state in terms of sheer volume, very good change in addition to Circle pay very good customers. So we're moving forward to there.\n\nColorado, again, like it's the 24th biggest state. Not the biggest, but there's some very interesting things that go on in Colorado, and there's a reason why we picked it. Not only the MRTP tax savings but also you have Danbury, you have Colorado Springs. You have some different markets there to look at what's working, what's not working you have a real technology base of people.\n\nYou have a young energized base there that's moving into Colorado. There's a lot of people there that are looking for this solution. We have a firm out there we're working with who did some metrics for us about attitudes toward quitting smoking, understanding that flows right into our messaging. And again, what we're seeing is the importance is to get to -- be able to penetrate a market, get into a market, get the message out.\n\nI use the expression all the time about being an oil well or an oil slick. And for this product for people to understand what it does, you have to get into a market and penetrate it and go deep, which is why we're -- again, when you start talking about additive to your plans, certainly want to be a national -- have a national presence. But you know what, you've got to do it smart and you have to do it in the right way, so people know what's happening, what's happening with this brand going deep into a market, getting people understand it. I hope that answers you, Brian.\n\nBrian Wright -- ROTH Capital Partners -- Analyst\n\nYes. No. That's very helpful. Very, very helpful.\n\nThank you so much.\n\nOperator\n\nOur next question comes from the line of Jim McIlree with Dawson James. Please proceed with your question.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nThank you. Good morning. Given all that you've seen with the Circle K trial, can you -- it sounds to me like you're going to go multiple regional tests or trials or pilots or phase-ins over the, I don't know, next six to nine months before you go national. Am I hearing that correctly?\n\nJim Mish -- Chief Executive Officer\n\nJim, it's not that we're nearly not going national, but we are going in a smart sort of way to move through different markets. There are certain things that -- and again, I talk about the oil well oil slick, but also people have to understand what this product is. This product has only been -- we only got the MRTP designation since December. If you're launching another Marlboro line or you're launching another Copenhagen line or you're launching a new Snickers bar, everyone knows what that is.\n\nIn my old company, we could launch a new flavor amd last across the country. Don't have any problem with people understanding what the product is. What we're learning here is, we have to get people to understand what this product is. There has to be awareness.\n\nThere has to be education on what this is. If someone were to buy a VLN, a pack of VLN thinking they're getting a pack of Marlboro, they're going to have a different experience. When we have -- when we can connect with the 60% to 70% of that adult population that smokes that wants to quit, and we get them the solution, that's how we're going to be gaining momentum. Yes.\n\nI hope that makes sense. It's, again, additive. How do you expand through, what you know is important to this consumer base and moving along, it doesn't make sense right now to put it into 50 states and hope it sells. We have to be very smart about this and the momentum will happen.\n\nAnd we're starting to see it. I mean if you saw this week, there was another article in New York Times, there was another article again about low nicotine cigarettes, what's happening with this. So we're moving it forward.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nYes. Thank you. I appreciate that. I was just more trying to understand the timing of how these rollouts proceed.\n\nSo you've been in Chicago since April. And at least the Q says they are expanding there as well as into Illinois. And then the Q and in your remarks, you talked about expanding into Colorado. So again, it seems like you're going to do these state or citywide kind of initial campaigns for some period of time and use that to build up into a national rollout.\n\nAnd so, I'm just trying to figure out that some period of time is again, to me, it sounds like it's 6 to 9 months, maybe 6 to 12 months. Is that a reasonable assumption?\n\nJohn Miller -- Head, Nicotine Business\n\nYes. I hate to put it to just a number and say that it's going to be x number of months before you see something else. I mean we're going to continue to keep rolling this out and it's making sense to do it in a very pragmatic straight way about market penetration. There might be multiple markets at the same time.\n\nWe're working all of that out now. Again, we've only built 150 stores. So now we're starting to move this out and expand it. And for the tobacco, the tobacco world for new product, different products, right, that have been out there, right? When you look at something like that Swedish match out, they tested quite a while in one state like a Utah, Colorado test and they launched that seven, eight years ago, they were there for a while testing things, right? They're testing pricing flavors, product, packaging, seeing what works best before they went national.\n\nNot uncommon for a lot of brands to do this, right? Test it, get it right. Now we've tested it and now we're expanding it, seems like the right way to go, especially keeping the message consistent, getting to the consumer base making sure they understand what the product is, benefits, goals, things like that.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nAnd can you talk about the-yes, it does. Thank you. Can you talk about the cost of doing this type of rollout versus what your prior expectations might have been. This is a higher cost endeavor, the lower cost endeavor.\n\nIt's the same?\n\nJohn Miller -- Head, Nicotine Business\n\nYes. I mean when you look at this test that we started with rate, so you're starting basically from ground zero. So, you're building all the things and you are building websites, you're putting together apps, you're putting together point-of-sale plans -- we're testing multiple different coupon denominations. So, there's some costs that are upfront on this that will be utilized throughout all the other markets.\n\nI don't know that it was any more costly than anything else to launch. We did a lot of things. We had six different pieces of point-of-sale approved in Circle K will we use all of those in every store moving forward? Probably not. I mean, that's just not the way those things work.\n\nSo, there's costs associated with this, but the upfront costs are always your most expensive. The first store is always much more expensive than your 50,000 stores, just because you're trying to get it right. We're fine-tuning, we're getting things dialed in. And that's why you do pilot, that's why you do tests and that's why you keep expanding.\n\nWill the future programs look like exactly like the 150 stores in Chicago? Absolutely not. I mean as we continue to evolve and understand our learning of the consumer, what the messaging needs to be and how we get to them, this is not a traditional cigarette brand. And I think people have to understand that. This is like I say, this is not a Marlboro line extension, this isn't the Joe, The Camel campaign from 20 years ago.\n\nThis is a very, very unique product that is really all about public health, as you can see it. And it resonates in our brand. It resonates on our packaging, resonates in our point of sale. This will not be a traditional launch in terms of what people have seen in the past, this is very unique.\n\nWe've done some very unique things with it and we're continuing to elevate those things.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nAll right. Thank you. John, just a couple of things on GVB, when you acquired it, I think you were talking $45 million to $50 million in revenues for GVP on a stand-alone basis, not consolidated. Is that still a good number? And is that dependent upon the Oregon extraction facility coming online? Is that a big part of the ramp-up? And what impact does that have on gross margins that the extraction capacity coming online? Is that a higher or lower gross margin versus the 20% to 25% you talked about?\n\nJohn Miller -- Head, Nicotine Business\n\nYes. Go ahead, Jim.\n\nYeah. I will take it. I mean, the run rate's in line on those figures, we're still placing a focus on the 2023 plan or starting to get looking at the 2023 plan, but the run rates in that ballpark. And it doesn't -- it's not impacted by the extraction unit expansion.\n\nThe margins favorability certainly are, but we can keep up with the demand side in either case, but certainly, the margins show dramatic improvement, as that unit comes online in the next few months and on a calendarized basis in 2023?\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nAll right, very good. That's it for me. Thanks a lot. Good luck.\n\nJim Mish -- Chief Executive Officer\n\nSure.\n\nOperator\n\nOur next question comes from the line of Alex Berman with Craig-Hallum Capital Group. Please proceed with your question.\n\nAlex Berman -- Craig-Hallum Capital Group -- Analyst\n\nGreat. Thanks very much for taking my question and congratulations on what sounds like a very successful early launch of the pilot program. I wanted to ask about something that you mentioned on the call about your cash requirements expected to decrease. Wondering if you can give us a little bit more color on, when we should start to see that happen, I would think, just given the magnitude of the VLN launch, potentially taking a product here from zero to maybe hundreds of millions of dollars of revenue over the next couple of years.\n\nI mean, clearly, you're going to need to build inventory and spend on marketing. So is there not going to be a little bit more maybe short-term increase in the cash burn over the next couple of quarters and then things perhaps start to become closer to cash flow breakeven. Just considering all the moving pieces you've got going on here, if you could help to unpack that statement about cash requirements decreasing that would be very helpful.\n\nHugh Kinsman -- Chief Financial Officer\n\nSure. This is Hugh Kinsman. So I'm happy to answer that question. So I mean we're obviously going to use the cash that's on hand right now to -- we'll heavily invest the vast majority of those proceeds into continuous launch of the VLN product, not so much on capex, but obviously, sales and distribution channels, much to what John just alluded to.\n\nThere'll be some portion of those proceeds will be used to just build up the working capital for GDP's operations? Do you beat selling out into the perpetual market demand, so there will be a need for a marginal amount of mine to just build up their permanent working capital base and the permanent inventory levels. GDP on a stand-alone basis will eventually become self-sufficient in 2023, later just because of continued organic growth. And so you're right, there'll be a substantial amount of cash that's initially spent going through the launch process and progressive rollout strategy for the VLN product. But after a certain point in time, particularly if we reach a certain accelerated sales level, the overall enterprise becomes somewhat self-sufficient over the next 12 to 18 months and we have the adequate resources to meet these strategic goals and complete the corporate initiatives.\n\nAlex Berman -- Craig-Hallum Capital Group -- Analyst\n\nOK. That's really helpful then. So putting that all together, I mean, if we think about the $8 million adjusted EBITDA loss in Q2, when we start to layer in the full quarter for GVB and the acceleration of the VLN launch, I mean, should we expect the loss in Q3 and Q4 to be greater than that and then start to improve next year? Is that kind of a reasonable time line to think about?\n\nJohn Miller -- Head, Nicotine Business\n\nYes. That's probably the right way to think about it just because of simultaneous investments in both businesses and particularly VLN. So that probably is the right approach.\n\nAlex Berman -- Craig-Hallum Capital Group -- Analyst\n\nOK. That's really helpful. Thank you.\n\nJohn Miller -- Head, Nicotine Business\n\nSure.\n\nOperator\n\nOur final question is a follow-up from Vivien Azer with Cowen. Please proceed with your question.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nHi. Thanks for taking the follow-up. Just circling back to VLN in Chicago, the retail footprint opportunity is clearly much, much bigger than what you guys have done in the Chicago area to date. I'm curious, are you thinking about priorities? Do you want to kind of replicate a C-store model, so you've got apples-to-apples competitors or is that outside of your control entirely and that's going to be a joint decision with you in your distribution partner? Thank you.\n\nJohn Miller -- Head, Nicotine Business\n\nYes. Thanks, Vivien, for the follow-up. Yes. There's no doubt Chicago has -- and no, no, thousands of stores.\n\nWe are not married to a specific channel in terms of our willingness to want to market this to build consumers who are looking for a solution to smoking. Quite honestly, there's some very, very good channels outside of just convenience for this product. That's all being evaluated. It's going to be driven-off of consumer demand, it will be driven-off of where consumers live shop, all those things.\n\nSo it's yes, to your point, we are looking at standing this to a multiple partners and having much more of a statewide presence there. Hope that answers your question Vivien?\n\nVivien Azer -- Cowen and Company -- Analyst\n\nThank you. It does. Thank you.\n\nJohn Miller -- Head, Nicotine Business\n\nYes.\n\nOperator\n\nThank you. Ladies and gentlemen, we have reached to the end of the question-and-answer session. I will now turn the call over to James Mish for closing remarks.\n\nJim Mish -- Chief Executive Officer\n\nThanks, operator. And thanks, everyone, for joining us today and thanks for the great questions. Just to tie a bow around some things. What you heard today is that all the recent announcements are in addition to our original strategy and accelerating an expansion of VLN increases.\n\nThat's what you heard from John today, become efficient with that and to reach our objectives, which is to get this product into the hands of educated consumers as quickly as possible is really what you heard of today. We're going to be sharing more and more of that for the next coming weeks and laying out even more detail to that. But we are truly off and running. And despite all of the headwinds in the macroeconomics and in spite all the challenges of this tobacco industry, we are on a very successful pathway with the VLN expansion and rollout.\n\nNot to mention everything we're doing on the cannabis and hemp as well. So stay tuned for our next updates and press releases that will be coming shortly. As we continue to expand our VLN launch in the US and move ahead on our opportunities with GVB and hemp/cannabis. And we will be present in a number of investor and industry events coming this fall.\n\nYou'll hear more about that as well. If you'd like to range a meeting, please reach out to our Investor Relations team noted on the press release. With that, thank you again. Thank you for your support and continued interest, and we'll speak soon.\n\nHave a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJoe Schepers -- Vice President, Communications and Investor Relations\n\nJim Mish -- Chief Executive Officer\n\nJohn Miller -- Head, Nicotine Business\n\nHugh Kinsman -- Chief Financial Officer\n\nVivien Azer -- Cowen and Company -- Analyst\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nBrian Wright -- ROTH Capital Partners -- Analyst\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nAlex Berman -- Craig-Hallum Capital Group -- Analyst\n\nMore XXII analysis\n\nAll earnings call transcripts"
}