{
  "companyName": "AGNC Investment Corp.",
  "companyTicker": "AGNC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/agnc-investment-corp-agnc-q3-2022-earnings-call-tr/",
  "content": "AGNC Investment Corp. (AGNC -1.24%)\nQ3 2022 Earnings Call\nOct 25, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to AGNC Investment Corp.'s third quarter 2022 shareholder call. All participants will be in a listen-only mode. [Operator instructions] Please note this event is being recorded. I would now like to turn the conference over to Katie Wisecarver in investor relations.\n\nPlease, go ahead.\n\nKatie Wisecarver -- Investor Relations\n\nThank you all for joining AGNC Investment Corp.'s third quarter 2022 earnings call. Before we begin, I'd like to review the Safe Harbor statement. This conference call and corresponding slide presentation contain statements that to the extent they are not recitations of historical fact, constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Also, forward-looking statements are intended to be subject to the Safe Harbor protection provided by the Reform Act.\n\nActual outcomes and results could differ materially from those forecasts due to the impact of many factors beyond the control of AGNC. All forward-looking statements included in this presentation are made only as of the date of this presentation and are subject to change without notice. Certain factors that could cause actual results to differ materially from those contained in the forward-looking statements are included in AGNC's periodic reports filed with the Securities and Exchange Commission. Copies are available on the SEC's website at sec.gov.\n\nWe disclaim any obligation to update our forward-looking statements unless required by law. Participants on the call include Peter Federico, director, president, and chief executive officer; Bernie Bell, executive vice president, and chief financial officer; Chris Kuehl, executive vice president, and chief investment officer; Aaron Pas, senior vice president of non-agency portfolio management; and Sean Reid, executive vice president, of strategy and corporate development. With that, I'll turn the call over to Peter Federico.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nThank you, Katie. And thank you to everyone for joining our call today. Financial markets experienced broad-based weakness in the third quarter as macroeconomic and monetary policy uncertainty intensified both domestically and abroad. This led to a sharp decline in investor sentiment and significant repricing in both the equity and fixed-income markets.\n\nWith the S&P 500 index falling 17% and the unlevered Bloomberg Aggregate bond index falling 7.5% from their respective intra-quarter highs. In the early stages of market downturns, it is not uncommon for the US Treasury and Agency MBS markets to underperform other fixed-income products because these securities are the most liquid and thus easiest for investors to convert to cash. Bond fund outflows are an obvious example of this type of selling pressure. Agency MBS are the most liquid spread product across the entire fixed income spectrum.\n\nAs such in certain environments, particularly when investors favor liquidity, the selling pressure on Agency MBS can be greater than other asset classes. Further out the liquidity and credit spectrum. This was indeed the case in the third quarter. On Page 7 of the investor presentation, we show the spread or yield differential between the 30-year current coupon MBS and the 10-year Treasury, since January 2009.\n\nThis graph is helpful because it provides historical context for the recent spread widening. As you can see, this spread recently widened to the extreme of 190 basis points. A significant portion of this widening occurred late in September following an unforeseen episode of instability in the UK bond market that led to a significant repricing and risk-off sentiment, and our Treasury and Agency MBS markets. As we have discussed, wider spreads impact our business in two ways.\n\nFirst, as spreads widen the book value of our existing portfolio declines, as has been the case this year. On the positive side, however, wider spreads also enhance the future value of our business by improving the go-forward return on our portfolio. The supply outlook for Agency MBS has also continued to improve, with primary mortgage rates now well above 7%. Origination volume over the remainder of the year will likely be very limited, and the runoff of the Fed's portfolio will also be materially slower than previously anticipated.\n\nPutting this all together, Agency MBS is undeniably attractive. Spreads are at unprecedented levels. The supply outlook is very favorable. And finally, Agency MBS are guaranteed by the US government and thus do not have credit exposure in a recession scenario, which adds to their attractiveness relative to other fixed-income alternatives.\n\nThe recovery in valuation levels could happen rapidly. So as difficult as this year has been given the spread widening that has already occurred, it is important to understand the unique opportunity that we believe is on the other side of this historic repricing event. With that, I'll now turn the call over to Bernie Bell to discuss our financial results in greater detail.\n\nBernie Bell -- Executive Vice President, Chief Financial Officer\n\nThank you, Peter. For the third quarter, AGNC had a comprehensive loss of $2.01 per share. The economic return on tangible common equity was negative 17.4% for the quarter, comprised of the decline in tangible net book value of approximately 20%, and dividends declared of $0.36 per common share. Given the very challenging market conditions during the third quarter, we continue to prioritize risk management operating with a high-interest rate hedge ratio, lower leverage, and a strong liquidity position.\n\nIn addition, we opportunistically issued approximately 290 million of common equity through our aftermarket offering program at an average price of $10.10 per share and issued 150 million of fixed-rate reset preferred equity. Our average leverage for the quarter increased moderately to 8.1 times tangible equity from 7.8 times for the prior quarter. Our leverage at the end of the quarter was higher at 8.7 times, primarily as a function of book value declines late in the quarter. At quarter end, we had cash and unencumbered Agency MBS totaling $3.6 billion, or 54% of our tangible equity, and approximately 100 million of unencumbered credit securities.\n\nNet spread and dollar roll income, excluding the catch-up am was $0.84 per share for the quarter. The slight increase from $0.83 per share for the second quarter was the result of higher asset yields and our large interest rate swap position, which more than offset higher funding costs and declining dollar roll income. Lastly, our average projected life CPR as of the end of the quarter, decreased modestly to 7%, while actual CPRs continued to slow meaningfully averaging 9% for the quarter. I'll turn the call over to Chris Kuehl to discuss the Agency mortgage market.\n\nChris Kuehl -- Executive Vice President, Chief Investment Officer\n\nThanks, Bernie. As Peter discussed, Agency MBS spreads continued to widen during the third quarter and in particular in the month of September as rates and volatility surged, higher par coupon spreads to a blend of 5 and 10-year US Treasury debt ended the quarter at approximately 170 basis points. To put the degree of mortgage spread widening during the month of September into perspective, the Bloomberg Mortgage Index, which is an index of all Fannie Mae, Freddie Mac, and Ginnie Mae MBS experienced its worst excess return versus Treasuries on record going back more than 30 years. Agency spreads to Treasuries, swaps, and corporate debt are extraordinarily wide.\n\nHistorically, the few times that par coupon spreads reached levels beyond 150 basis points, it was short-lived, and importantly, the funding markets were in distress and prepayment risk was high, neither is the case today. On our last call, we discussed the increasingly hawkish Fed sentiment and elevated interest rate volatility as being the primary headwinds to Agency MBS performance, and those headwinds remain today. However, even adjusting for the current level of rate volatility spreads on Agency MBS are compelling. And when rate volatility ultimately settles, Agency MBS will materially outperform.\n\nMoreover, this recovery could be very rapid. The only way to reconcile current Agency spread levels is to infer a lack of sponsorship due to bond fund outflows, the large percentage of passive index-based management, and capital-constrained banks. As of September 30th, our investment portfolio totaled $61.5 billion. During the quarter, we continued to reposition our holdings across the coupon stack.\n\nToday's MBS market is particularly unique, with more than 10 actively traded 30-year coupons, which speaks to the magnitude of recent interest rate moves. Our hedge portfolio totaled approximately 69 billion at the quarter end, down about 3.5 billion from the previous quarter. Our duration gap as of September 30th was 1.2 years, and despite the 40 basis point increase in 10-year interest rates since quarter end, we have proactively reduced our duration gap to the inside of one year through rebalancing actions in both assets and hedges. I'll now turn the call over to Aaron to discuss the non-agency markets.\n\nAaron Pas -- Senior Vice President, Non-Agency Portfolio Management\n\nThanks, Chris. Spreads across the structure product space in the third quarter remain volatile, largely tracking the risk sentiment in broader markets. The repricing of the terminal rate and shifting expectations of the Fed's future path continue to drive the market's direction. After gradually firming up across the capital structure in the first six weeks of the quarter, the second half of Q3 largely reversed that spread tightening.\n\nAt this juncture, while credit spreads have leaked wider, trading has generally been quite orderly. However, some signs of stress are evident and liquidity is relatively low. These factors have in part caused the credit curves in many products to be flatter than one would expect given the deteriorating economic outlook. Housing activity has declined materially as significantly higher mortgage rates have stretched affordability to extreme levels while reducing mobility as more homeowners are locked into their current residences with low fixed-rate mortgages.\n\nWhile the structural supply imbalance will remain supportive of housing in the longer run, our expectation is that house prices will decline gradually and on relatively low transaction volume. This could reverse most of the prior year's gains over the coming 12 to 18 months. Importantly, due to the sharp run-up in house prices from Q2 2021 to Q2 2022, there's relatively little credit risk embedded in loans that originated more than a year ago. This, coupled with the high percentage of fixed-rate mortgage debt provide significant support for mortgage credit performance.\n\nWith respect to our holdings, the non-agency portfolio declined over the quarter and in Q3 at 1.7 billion. We reduced our AAA holdings and rotated out of fixed-rate RMBS AAAs in favor of floating-rate, commercial-backed AAAs. In addition, we repositioned some of our more credit-focused holdings. We believe our non-agency portfolio is well positioned for the current environment as a result of the seasoning of the loans back in our CRT and RMBS holdings, the average LTV across the portfolio is in the low 50s on a mark-to-market basis.\n\nAs such, we would expect credit performance to be relatively insensitive to even moderate changes in house prices for the majority of our portfolio. With that, I'll turn the call back over to Peter.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nThank you, Aaron. And with that, we'll now open the call up to your questions.\n\nOperator\n\nThank you. [Operator instructions] The first question comes from Doug Harter with Credit Suisse. Please, go ahead.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nThanks. Can you talk about how you're looking to balance risk management and maintaining leverage with the near-term risk versus the opportunity for the snapback in Agency MBS that you talked about?\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nSure, Doug. Good morning. Thank you for the question. It's a good place to start.\n\nWe ended the quarter with leverage at 8.7 and as we reported, which was up from the prior quarter. But as of last Friday, our leverage was around 8.4. And we really think that that's a good place to be if you think about the leverage level, which is sort of right in the middle of our normal operating range, a very comfortable position from a leverage perspective. But more importantly, I think it strikes the right balance, which I think is sort of at the heart of your question between the challenges that we face in terms of the overall bond market and the illiquidity and volatility, and we have to respect that.\n\nBut at the same time, we also have to respect the fact that we're looking at the best returns that we've ever seen in the Agency MBS market. So we've obviously gone through a really sharp repricing, a lot of illiquidities late in September, and the market's been challenged since then. But when you look at returns where they are today, you have to say this is potentially a once-in-a-lifetime return opportunity. So we like where we are right now.\n\nIt's a very comfortable leverage position. Our liquidity position is strong and we can talk about that in greater detail. But from just from an overall risk position we're trying to balance right now both offense and defense. And we think that that's really important given how attractive returns are.\n\nSo I'll pause there and let you ask for a follow-up.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nAnd just on the once-in-a-lifetime or the ability for them to snap back, I mean, I guess, are there enough buyers? Kind of -- yeah, you mentioned kind of the supply demand [Inaudible]. Who was the incremental buyer to kind of snap spread back?\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah, it's a great point. And what I would say when you're in these sort of really illiquid markets, like the like global bond markets have entered, you have the real risk of overshooting in both directions. And unfortunately for Agency MBS, because they are so liquid and because they are the most liquid spread product, they tend to lead in the overshoot and we certainly saw that. The flip side of that is also that you can have a really sharp recovery as well.\n\nOne of the issues that the sort of macro bond market and this is both Treasuries and Agency MBS are facing is that there's the preponderance of passive investors. So what we've seen as the Fed has tightened monetary policy is that the flows in both the Treasury and Agency MBS market are dominated by bond fund managers. And there's obviously been huge amounts of bond fund outflows as the Fed has tightened and rates have risen. It's a bear market in the bond market and you would expect that.\n\nAnd they are the source of selling pressure in the buying is relatively limited. You can also look at that and say the opposite is undoubtedly going to be the case because there are no natural sellers of either of the mortgages, once that flow stops. And, we've already begun to see, I think some of that with returns where they are both on an absolute and relative basis in the Agency MBS market, for example, on an absolute basis, investors could get a government-guaranteed par-priced bond at a 6% yield, 200 basis points over the Treasury for the same credit. In an environment where you're looking at a recession, that is a really attractive return.\n\nSo I think you're going to start to see inflows into the Agency MBS market. I noticed that, yes, last week when it was a Bloomberg story where the MBS ETF had its largest inflow in a single day ever. So as the market stabilizes, I think you'll see the opposite effect, which is there's going to be buyers emerging and there are no natural sellers because there's no natural supply of Agency MBS at this level of rate. So that's the technical that you're looking at, that will be really favorable once the bond market stabilizes.\n\nAnd I think ultimately, as we all know, it is going to stabilize and I think that there's a real opportunity ahead of us. We've seen that in the past and you may look at spreads where they are today and say 200 basis points over, that's not the worst that they've ever been because you can look back at the great financial crisis. But if you look at the great financial crisis versus today, it is nothing like the agency and the Agency MBS market is not the problem here, there are no liquidity problems, there are no selling problems, there are no prepayment risk problems, and there is no risk out of the Fed. In the great financial crisis, when spreads were wider, you had the GSEs at the heart of the problem.\n\nThe very credit of the Agency MBS was in question, bank capital was in question, and huge funding problems. So you could justify potentially wider spreads in that environment. When you look at spreads today at close to 200 off, I would say they're the best risk-adjusted returns that the Agency MBS market has ever seen.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nGreat. I appreciate that, Peter.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nSure. Thank you for the question.\n\nOperator\n\nOur next question comes from Bose George with KBW. Please, go ahead.\n\nBose George -- Keefe, Bruyette and Woods -- Analyst\n\nHey, everyone. good morning.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nHello.\n\nBose George -- Keefe, Bruyette and Woods -- Analyst\n\nGood. Thanks. Can I get your updated book value?\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nSure. Yeah. As of last week, our book value -- end of last week was down about 15%. And let me just sort of put that in context, because I think this particular month-to-date update, I think the market has been so volatile.\n\nI think it's challenging for people to sort of get a good handle on that. But if you look at like, for example, our stock performance, I think our stock performance has actually tracked our book value very, very well. So down about 15%, I think you can break that down into really two components. Is first, is you got to look at mortgage performance, obviously, and how much spreads have widened.\n\nI would say sort of on average spreads have widened probably about 15%. So you look at our sensitivity that's probably about 11% in book value. But it's really challenging because if you look at -- and most people do look at the performance of current coupons -- current coupon performance has actually been the best performance. But by the way, the current coupon at the end of September was a 5.5% coupon.\n\nNow it's a 6% coupon. So you have to look further down in the coupon stack and the performance is materially different across different coupons. If you look at the 2.5% coupon, for example, that was down 3.5 points to the 4.5% coupon was down around 2.5 points. And you look at the five-year Treasury, that was only down 1 point so far.\n\nSo when you look at it from that perspective, if you hedge your portfolio across the curve with two years and five years and 10 years like we do in the curve steepened as much as it did, the 10-year part of the curve was the best performing part of the curve. It is up 40 basis points. From a hedging perspective, you could have very different results based on where your curve and your hedges were across the curve. If you had all 10-year hedges, for example, which we wouldn't be uncomfortable with, given the size of our portfolio and our desire to hedge across the curve, you would have a much different outcome.\n\nSo from our perspective, hedging across the curve and particularly in the belly of the curve, the underperformance of the five-year really led to the overall underperformance. And then, based on our own disclosures that we put out, we had at the beginning of this quarter a duration gap, like we announced in our pre-release of about a year, given the fact that rates moved 20 basis points on five years and 40 on 10. So on average, maybe 30 basis points, that would translate to about a 3% hit to book value. So the combination of about 15 basis points wider and spreads, particularly in the belly of the coupon stacked lower the belly of the coupon stack plus that gives you about 15%.\n\nAnd that's why we're looking at returns today that is the best we've ever seen. So that's the update as we sit right now.\n\nBose George -- Keefe, Bruyette and Woods -- Analyst\n\nSo. OK. Great. Thanks.\n\nThat's helpful.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nSure. Thank you for the question.\n\nBose George -- Keefe, Bruyette and Woods -- Analyst\n\nGiven the current dividend above 44.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah.\n\nBose George -- Keefe, Bruyette and Woods -- Analyst\n\nOn your implied book value, which is I guess the high sevens you suggest the dividend yield is in the, I guess, very high teens.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah.\n\nBose George -- Keefe, Bruyette and Woods -- Analyst\n\nI mean, does your portfolio generate that to cover that dividend?\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah. Well, this is the really key point. Thank you for the question. Obviously, when we think about our dividend, we are constantly evaluating, a whole range of considerations, the composition of the portfolio, the volatility of interest rates, alternative uses of capital, things like that, general market conditions, and the expected leverage.\n\nBut what's really, I think, critical to understanding, I think is the heart of your question is you have to understand what drove the decline in our book value. And if you look at the performance of mortgages and you look at that graph that we show, I think it's clear to everybody when you look on Page 7, that mortgage spreads have gone in one direction only for the better part of the last 18 months, 65 basis points wider, if you will, from August to now. So the decline in our book value is driven primarily by wider spreads. So while it hurts your book value currently because the decline in book value came from wider spreads, it also enhances the go-forward return on our portfolio.\n\nSo said another way, as our dividend yield has gone up with the decline in our book value, the return on our portfolio has gone up in a commensurate way. So if you looked at our portfolio today, you sold it, bought it all back, and our portfolio is marked to today's valuations. So if you looked at that and you said, what are mortgages earned at this dollar price, at this spread, you would conclude that the go-forward return on our portfolio actually matches very nicely the current dividend yield. So that's one of the key things that we always look at, we've talked about that a lot.\n\nSo, going forward, I still believe that those two things are reasonably well aligned, and obviously, conditions change and markets are volatile and we're going to continue to be diligent about monitoring that. But to go forward, the return on our portfolio still is consistent with our dividend.\n\nBose George -- Keefe, Bruyette and Woods -- Analyst\n\nOK. Great. That's very helpful. Thanks a lot.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah. Thank you, Bose.\n\nOperator\n\nOur next question comes from Trevor Cranston with JMP Securities. Please, go ahead.\n\nTrevor Cranston -- JMP Securities -- Analyst\n\nHey. Thanks. Good morning.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nGood morning, Trevor.\n\nTrevor Cranston -- JMP Securities -- Analyst\n\nA question on the historical spread chart you guys have on Slide 7. Generally, I was just curious when you guys look at spreads versus historical levels. Have you guys sort of adjusted for the fact that either the Fed or the GSEs have been a sort of huge buyer and backs up for the market for --\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah.\n\nTrevor Cranston -- JMP Securities -- Analyst\n\nMuch of the last 20 years? And, how kind of comparable do you think spreads are today versus levels where those guys were put into the market?\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah. You're 100% right. I mean, obviously, the chart that we show doesn't really have any impact on the GSEs' portfolios. That was all prior to the great financial crisis in terms of any kind of meaningful impact.\n\nBut certainly prior to that, they did have an impact on the overall valuations. And then post the great financial crisis, there's no doubt starting with QE1 in 2008 or '09, whenever it was. The Fed has basically participated in this market for 11 out of 14 years or something like that, whether they're either buying mortgages or reinvesting their paydowns. So they did have an impact and they are obviously exiting the market.\n\nAnd the flip side of that, you could also conclude that the Agency MBS market is forever foundational to the Fed's monetary policy. They're not going to stay out of the market forever and they clearly care. And you can see that in the words that they communicated even as late as last week, where they are monitoring and paying attention to the functioning of both the US Agency and the US Treasury market. So they have had an impact.\n\nBut the flip side is when you think about the Fed's portfolio running off, it's really critical to think about the environment in which the portfolio is running off. If it's a low rate environment, then it would be much more challenging for Agency MBS because you would be facing the Fed running off its balance sheet and you would be facing an increasing amount of supply. Frankly, that was the risk that we saw at the beginning of 2022. At mortgage rates, at 7.25% there is effectively almost no supply of mortgages.\n\nAnd even though the Fed is running off, I don't think that that's going to be a material impact. So you're right that it's a factor and it's something that you have to think about. But I don't think the new norm is where we are today. It may be higher than the average, the 80 basis points that I've shown on this one, on this chart.\n\nAnd if you looked at this chart, I call it a sort of forever the maximum function. If you looked at this chart on Bloomberg, the average would be about 90 basis points since the 80s to now, and the range would be 75 to 125 basis points. We may settle out somewhere closer to the high point of the average range of 125. But I don't think we're going to settle out here at 200 basis points.\n\nIt's just too much absolute return for the same credit. I think you're going to get levered buyers and you're going to get unlevered buyers buying Agency MBS at these levels once market conditions stabilize. I know Chris wants to add something to that.\n\nChris Kuehl -- Executive Vice President, Chief Investment Officer\n\nI would just add, I mean, just to put into perspective how extraordinarily wide current spread levels are. The last time the Fed was running off its balance sheet in 2018 and 2019, its current spreads averaged levels about 100 basis points tighter than where they are today.\n\nTrevor Cranston -- JMP Securities -- Analyst\n\nYeah. OK. That's helpful.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nAnd the other -- one final point I forgot to mention, Trevor, is that you have to also look at, the ownership of the market, right? The Fed, even though it's one in its portfolio, the Fed owns 30% essentially of the Agency MBS market, and with rates, are where they are now you're looking at the end of next year, the Fed's runoff is going to probably be less than $15 billion a month. It's going to be back to essentially the level, that when they phased in the runoff. So the Fed's runoff is going to be really slow. They're going to own a huge amount of the stock for a long time.\n\nAnd then, of course, banks own another 40%. And that's, pretty much out of their trading supply as well. So those are two key points as well to consider going forward, even though they are backing out of the market.\n\nTrevor Cranston -- JMP Securities -- Analyst\n\nYeah, for sure. OK. And then the -- so in your prepared remarks, you sort of highlighted the two big headwinds for MBS. One was the sort of technical supply demand backdrop, which you talked a lot about.\n\nThe second piece was high volatility.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah.\n\nTrevor Cranston -- JMP Securities -- Analyst\n\nI guess so. The question is, I mean, do you guys see any catalysts for realized volatility to decline at all in the near term? Or do you think that piece of things is likely to stay pretty high for the near future?\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah. I do see catalysts and maybe we're starting to see them just in the last few days. Obviously, you need more data points and you have to really be respectful of the market conditions in the bond market. There's no doubt about that.\n\nThey are really challenging market conditions and have been now for some period of time. But we also can't lose sight of the fact that we're deep into the tightening process and sort of its always sort of darkest before dawn. And the Fed obviously wants to go a little higher. The market last week and still today, when you think about the Fed funds futures, which topped out at around 490 in March or April of next year.\n\nAnd the Fed may or may not get there. In fact, I think some of the comments out of the Fed was maybe the market has even overshot. They certainly seem to be starting to indicate that they might ultimately get to that level. But they also seem to be recognizing that a more measured path to getting there may be something that is appropriate.\n\nSo we have a Fed meeting, obviously, at the beginning of November, and we have one in December. It'll be really important to sort of hear what they have to say about the pace going forward. One of the things that sort of destabilized the markets so much as you had a bad inflation print that was followed by real sort of hawkish destabilizing comments from the Fed, and sort of the market lost confidence. Well, I think the Fed has done a lot to make monetary policy restrictive.\n\nThey will do a little bit more at this next meeting, probably 75, maybe even 50. And maybe they'll say at that time that, look, we're going to take a little bit more measured approach and allow the rate moves that we've already made, to have the full effect on the economy. So that's, I think, one of the key changes that will come over the next couple of months, which I think will be really positive for the market. And then, of course, we had a lot of international instability with what happened in the UK, and that was really sort of tumultuous for our bond market for weeks now.\n\nAnd maybe that has gained some footing with the new Prime Minister this morning. The market seems to like that bond levels are rallying across the globe and so you can get stabilization in a number of different ways. And I think while we're not there yet, I'm hopeful that we're going to be there soon.\n\nTrevor Cranston -- JMP Securities -- Analyst\n\nYeah. OK. Appreciate the comments. Thank you, guys.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nSure. Thank you for the question.\n\nOperator\n\nOur next question comes from the line of Vilas Abraham with UBS. Please, go ahead.\n\nVilas Abraham -- UBS -- Analyst\n\nHey, everyone. How are you? Just wanted to start with just the duration gap. You guys are up. It looks like, 1.2 years.\n\nHow are you thinking about that given where the rates are now --\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nSure.\n\nVilas Abraham -- UBS -- Analyst\n\nAnd you're looking at that down.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah. So you're right, our duration gap was what was there the last. Today, it's really around three-quarters of a year. So we've reduced our exposure a little bit, but we still think, the duration gap where seems to be reasonable -- reasonable place to be.\n\nPart of what goes into that is how we think mortgages are going to perform. And Chris can talk a little bit about this in a minute. I'll turn it over to him and talk a little bit about the sort of convexity profile that has improved. So obviously, that goes into our duration gap position, but also where we are and the sort of rate repricing process.\n\nAnd obviously, with 10 years at 4.25, two years at 2.5, while certainly higher rates are possible, we feel like those rates are probably pretty fairly priced right now. So maybe not, maybe not quite as much upside risk as we were facing a few weeks ago given where 10 years today. So we've reduced our overall sensitivity a little bit, but we kind of like where we are. Chris, do you want to talk about the convexity of the market?\n\nChris Kuehl -- Executive Vice President, Chief Investment Officer\n\nYeah. Sure. So, as Peter mentioned, given some of the actions that we took since quarter end on both the hedging side as well as on the asset side, our duration gap is currently around 3.25 of a year. The motivation for shortening the duration gap in the current environment is, as we expect mortgages to trade long for moderate moves in rates, widening into higher rates, and outperforming into lower rates.\n\nAnd this is just driven by overall sentiment around Fed policy and bond fund flows. The portfolio does still have more contraction risk than extension risk into very large rate moves. And so for that reason, we're still likely to carry a positive duration gap, just not as long as we were as of 9/30.\n\nVilas Abraham -- UBS -- Analyst\n\nOK. And just back on to leverage.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah.\n\nVilas Abraham -- UBS -- Analyst\n\nSounds like you are comfortable where you are now, for now. But, when we do see a lessening of volatility and potential Fed pause, what do you think the cadence of potentially moving that leverage up would be?\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah. Well, I think it's -- I think the cadence is probably faster than I guess, I would have expected one way or the other is that that's the thing with the market. I think we've hit levels where as I mentioned in my prepared remarks, I think that there's a greater risk now of a sharp move better in valuation. If we talked about this on the second quarter call where when mortgages were 125 to 150 spread, that, there was a chance that mortgages which statewide for a meaningful period of time just sort of stabilize at this sort of rate level.\n\nI don't know that we have that same sort of durability in the spread. So there is certainly a risk that just as quickly as mortgage spreads widened, they could tighten up. Clearly, there's a risk that they could go wider as well. There's just no doubt about that.\n\nSo we have to be really mindful of the moves in both directions. And I think I think the moves potentially could be a little bit sharper, which would mean that all other things equal leverage could move faster. But one of the things that I think is also a really important one, is that from a leverage perspective, it's important to remember that the investor experience for investors to make money doesn't have to coincide with us taking more leverage, right? At the end of the day, when you invest in AGNC today, for example, you are investing in a pool of Agency MBS at current valuation levels at the widest spreads on a risk-adjusted basis that I would say we've ever had. So the investment today stands on its own, that there is certainly a risk the spreads could widen further and there certainly risk spreads could tighten lot and the economic experience will be just as good whether we take more leverage or not.\n\nSo I don't think we can lose sight of the fact that you're investing today, our portfolio is mark-to-market. And like the question we had with dividends to go forward, a return profile just from a carry perspective is really attractive. And that doesn't take into account the potential upside that would follow a tightening scenario. If you look back in history, for example, obviously every environment is different, but if you look back in history and you say following in 2020, for example, what was our best period, it was following 2020 when we had a significant tightening.\n\nOr if you look back when spreads were 250 basis points, AGNC generates its best returns, as you would expect. There's nothing -- there's no science to that. You would expect us to generate our best returns following huge wide need events. And this obviously is one of the most historic widening events that the markets ever experienced.\n\nVilas Abraham -- UBS -- Analyst\n\nAnd you think that one of the big catalysts of that kind of snapback would be the bid, from money managers and bond fund managers coming back in quickly?\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nI think -- yeah, I think that's a really key one. And I also think that -- I think that there's sort of a rotation that's going to occur, right? And you can just turn on CNBC and you hear people talk about 60, 40 portfolios now going forward with bond prices where they are. I think real money investment back into bonds, whether it's insurance companies, money managers, or pension funds, you're getting returns that you just haven't had the opportunity to have for the kind of credit quality. So I think that there's real money investing, unlevered money that will come into the bond market in a number of different forms that I think will really benefit Agency MBS.\n\nAnd that, of course, is against the outlook of very little supply. Chris, do you want to add to that?\n\nChris Kuehl -- Executive Vice President, Chief Investment Officer\n\nI was just going to make that point. I mean, like it's 7% mortgage rates. There's been a ton of demand destruction on the housing market. And so from a supply perspective, we're about to enter a period of record low supply relative to the last two years, we're in 2021, we saw 850 billion of mortgage net supply organically.\n\nAnd last year or this year around 550 billion. Next year, it's likely to be around 200 to 250. And importantly, reduced, slower turnover, and a weaker housing market means that runoff from the Fed's portfolio is going to be much lower than where it's been running as well. And so to Peter's point, when bond fund flows do stabilize, it's not going to take much for mortgages to be incredibly well bid relative to the amount of supply that's available.\n\nVilas Abraham -- UBS -- Analyst\n\nGot it. Thanks, everyone. I'll hop back in the queue.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah. Thank you for the question.\n\nOperator\n\nOur next question comes from Kenneth Lee with RBC Capital Markets. Please, go ahead.\n\nKenneth Lee -- RBC Capital Markets -- Analyst\n\nHi. Good morning. Thanks for taking my question.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nGood morning.\n\nKenneth Lee -- RBC Capital Markets -- Analyst\n\nWondering if you could share your thoughts on your liquidity position. And perhaps talk about how AGNC handled the volatility that you saw in the quarter? And relatedly, what gives you comfort that you can handle the potential future volatility in the markets? Thanks.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah. Thank you for the question. It was the one I expected today. So, yeah, as we said sort of right now, I would say our liquidity position, if you think about it on a percentage of equity basis is basically unchanged.\n\nSo I would put our liquidity position this morning at about $3.1 billion. And if you think about that on a percentage basis of our tangible equity, it's probably 50% to 53% of our equity. And if you look back at that over the last eight quarters, you would see that that percentage has ranged right around there, somewhere between on average, probably about 55% over that time period. So what's important is you have to think about that liquidity position.\n\nSaid another way is our normal operating liquidity position. Now obviously, a lot has changed and the absolute dollars have come down, but on a percentage of our equity basis, it's still really, really strong and consistent with where we normally operate. And you have to think about that in the context of what's already occurred. If you think about the amount of book value decline and amount of spread widening, we've been able to maintain the same amount of percentage of liquidity, and that's really key.\n\nSo what that means is that obviously over time, as the environment changes, we take actions to change the composition of our hedge portfolio and the asset portfolio, and take steps to maintain a really strong liquidity position, to give us strength to continue to navigate through these difficult market conditions, and that's what we'll continue to do. But as we said today, we have basically a normal liquidity position.\n\nKenneth Lee -- RBC Capital Markets -- Analyst\n\nGotcha. Very helpful there.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah.\n\nKenneth Lee -- RBC Capital Markets -- Analyst\n\nAnd then in terms of the funding cost side --\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah.\n\nKenneth Lee -- RBC Capital Markets -- Analyst\n\nAnd then, given the rapidly rising rate environment, what's your outlook for funding costs? And perhaps you could just remind us again of the potential impact you have for locking in some rates using interest rate swaps. Thanks.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah. Well, you could see the benefit of our hedged portfolio, and obviously, from a cost of funds perspective, the type of hedges we have has an impact on our overall cost of funds. If you look at the amount of swaps that we have outstanding versus our repo, we actually have more than 100% swaps versus repo balance. So said another way all of our short-term debt in the form of our repo is synthetically converted to a longer-term debt through our swap portfolio.\n\nSo as our repo costs have gone up and they'll continue to rise as the Fed makes its last few moves the return leg on our swap, which is also indexed off of the OIS or Fed funds rate is going to move up in the same range. So overall, you're seeing a relatively stable cost of funds, and that relatively stable cost of funds are some timing differences in our cost of funds went up maybe 30 basis points from 18 to 50 last time. But what's important is overall that'll all sort of work out in the timing of those hedges that will be a relatively stable funding cost. And you layer that on to the repricing that's going on on the asset side.\n\nAnd that's what's leading to our margin, our net interest margin actually increasing to now up to 281 basis points. So I would expect general stability in our cost of funds as we go forward given the amount of swap hedges that we have.\n\nKenneth Lee -- RBC Capital Markets -- Analyst\n\nGot you. Very helpful there. Thanks again.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah, sure. Thank you for the question, Ken.\n\nOperator\n\nOur next question comes from Eric Hagen with BTIG. Please, go ahead.\n\nEric Hagen -- BTIG -- Analyst\n\nHey, thanks. Good morning. I think I just have a couple. In the rebalancing that you -- hey, good morning, guys.\n\nIn the rebalancing that you did in October, have you raised any capital this month? Or has the reduction in leverage been a function of asset sales? Can you say how big your portfolio is right now? And then how are you guys thinking about using TBAs as a substitute for repo in this environment? Like, what kind of relative value do you think investors are picking up from a heavier TBA position right now?\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah. Well, I don't want to talk about a month's activity with respect to capital markets. But we're always looking for opportunities to use the capital markets in a way that we believe is enhancing our shareholders. I think we've demonstrated that in the past and will continue to adhere to that, that philosophy.\n\nAnd, when you think about it from an asset portfolio perspective, I sort of gave you the book value and the leverage numbers. So I think you can conclude what the asset balance is. Now with respect to TBA, Chris can talk a little bit about the TBA because clearly there is an up in liquidity value there.\n\nChris Kuehl -- Executive Vice President, Chief Investment Officer\n\nYeah. Generally speaking, the role specialness moderated early during the third quarter to levels that are more in line with long-run historical norms. During the third quarter, our position averaged around 10 basis points or so through repo. And again, as I've said, in the past, I mean 10 basis points of a financing advantage relative to repo against the backdrop of an incredibly low prepayment risk environment is compelling.\n\nAnd so it's likely will continue to maintain a fairly large TBA position for the foreseeable future. I think, in the current environment, 5 to 10 basis points of specialness is a reasonable assumption with some potential upside to better levels. There's a huge range of tradable coupons within floats in the current environment. And so, with active Fed sales off the table for the foreseeable future and a large percentage of float and certain coupons tied up and held to maturity, classified accounts of banks, I think there's probably, if anything upside to those levels relative to, longer run historical averages.\n\nSo, it's likely we'll continue to maintain a pretty sizable TBA position.\n\nEric Hagen -- BTIG -- Analyst\n\nGot it. Appreciate you guys. Thank you.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah. Thank you for the question.\n\nOperator\n\nAnd our last question is a follow-up from Bose George with KBW. Please, go ahead.\n\nBose George -- Keefe, Bruyette and Woods -- Analyst\n\nHey, guys.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah.\n\nBose George -- Keefe, Bruyette and Woods -- Analyst\n\nJust wanted to ask about the Series C preferred shares, they switched to floating on the 15th. Historically, you've called converts when they switch but is the thought here just to hold on to that capital and then see what things look like when the market stabilizes?\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nYeah. Thank you for the question. That's exactly the way we sort of look at that is, obviously, it is effectively callable. But you can also -- just like we would evaluate any new preferred, you look at the returns factor, was the question you asked about sort of prevailing returns today are really attractive relative to that level, even though that is resetting at a higher rate.\n\nThere is a huge spread differential between the return that we can get at the margin right now and that cost of capital. So from a common shareholder perspective, that is significantly accretive, even though it's resetting at a higher rate. But as market conditions change, that will of course continue to evaluate that. But yes, thank you for that question.\n\nBut it's still, from that perspective relative to the return on Agency MBS really beneficial to our common shareholders.\n\nBose George -- Keefe, Bruyette and Woods -- Analyst\n\nOK. Great. Thanks.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThis does conclude the question-and-answer session. I'd like to turn the call back over to Peter Federico for concluding remarks.\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nThank you, operator. And thank you to everybody for your participation on the call today. I'll just leave you with one final thought, which was what I said in my prepared remarks, is while we know that this has been a very challenging year from an investor perspective given the spread widening that has already occurred, I think it's important that we continue to understand that we have, we believe, a very unique opportunity still ahead of us, given where Agency MBS are today. So we appreciate your participation and we look forward to talking to you again after our fourth quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKatie Wisecarver -- Investor Relations\n\nPeter Federico -- Director, President, and Chief Executive Officer\n\nBernie Bell -- Executive Vice President, Chief Financial Officer\n\nChris Kuehl -- Executive Vice President, Chief Investment Officer\n\nAaron Pas -- Senior Vice President, Non-Agency Portfolio Management\n\nDoug Harter -- Credit Suisse -- Analyst\n\nBose George -- Keefe, Bruyette and Woods -- Analyst\n\nTrevor Cranston -- JMP Securities -- Analyst\n\nVilas Abraham -- UBS -- Analyst\n\nKenneth Lee -- RBC Capital Markets -- Analyst\n\nEric Hagen -- BTIG -- Analyst\n\nMore AGNC analysis\n\nAll earnings call transcripts"
}