{
  "companyName": "Everbridge",
  "companyTicker": "EVBG",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/everbridge-evbg-q2-2022-earnings-call-transcript/",
  "content": "Everbridge (EVBG 3.68%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and welcome to the Everbridge, Inc. second quarter 2022 earnings conference call. [Operator instructions] Please note, this event is being recorded. I would now like to turn the conference over to Nandan Amladi, investor relations.\n\nPlease go ahead.\n\nNandan Amladi -- Investor Relations\n\nGood afternoon, and welcome to Everbridge's earnings call for the second quarter of 2022. This is Nandan Amladi, vice president of investor relations. With me on today's call are Dave Wagner, our new CEO; and Vernon Irvin, executive vice president and chief revenue officer; and Patrick Brickley, executive vice president and chief financial officer. After the market closed, we issued our earnings release, which can be accessed on the Investor Relations section of our website at ir.everbridge.com.\n\nThis call is being recorded, and a replay of the teleconference will be available on our IR website at the conclusion of today's event. During today's call, we will make forward-looking statements regarding future events or the financial performance of the company that involve certain risks and uncertainties. The company's actual results may differ materially from the projections described in such statements. Factors that might cause such differences include, but are not limited to, those included -- those discussed in our Forms 10-Q and 10-K, as well as other subsequent filings with the SEC.\n\nInformation provided on this call reflects our perspective only as of today and should not be considered representative of our views as of any subsequent date. We explicitly disclaim any obligation to update any forward-looking statements or our outlook. Also during today's call, we will refer to certain non-GAAP financial measures. A reconciliation of our GAAP to non-GAAP financial measures is included in our earnings press release, which you can find on our Investor Relations website.\n\nOur earnings press release, which crossed the wires after market close, included highlights from our second quarter in addition to the financial results and outlook. After we review our business and financial highlights, we will open the call to your questions. With that, let me call -- turn the call over to Dave.\n\nDave Wagner -- Chief Executive Officer\n\nThank you, Nandan. I am excited to join Everbridge as chief executive officer at this important moment in the company's evolution. Everbridge is a pioneer and is the clear industry leader in critical event management and public warning. Everbridge offers powerful solutions for positive change with the ability to keep people safe and businesses running smoothly.\n\nWe have opportunities ahead of us in both the near and long term to grow this business, improve our efficiencies and create shareholder value. I would like to take a quick moment to introduce myself. I have been working at B2B software companies for nearly 30 years, and I have been fortunate to be on teams that have created more than $2 billion in shareholder value. I have been part of an IPO, a go-private and two sales, two strategic buyers.\n\nMost recently, as CEO of ZixCorp, we grew revenue, EBITDA and enterprise value, each by more than 400% over less than six years. This growth was both organic and inorganic. We completed and integrated seven acquisitions successfully. In short, the teams I've led have created value in a range of ways, and I look forward to creating value with the team at Everbridge.\n\nIn the near term, the team and I continue to focus on executing four strategic priorities. First, we are simplifying our product offerings and our go-to-market channels to improve sales productivity and drive organic growth. Second, we are focused on extending our global leadership in public safety systems with our industry-leading platform to enable our proven network effect. Third, we are working on strategic product integrations, making it easier for customers to adopt new solutions while extending the differentiation of our platform.\n\nAnd finally, we are increasing overall efficiencies and increasing profitability across the company. Everything the leadership team and I are doing is focused on improving momentum, creating value for our customers, increasing profitability and increasing shareholder value. As Vernon and Patrick will share, the team is demonstrating progress on each of our focus areas. Our second quarter results are an affirmation that our strategy is working and that our execution is improving.\n\nAs I am quickly coming up to speed, I am impressed with the level of commitment our team members have to both our mission and to our customers. Enterprises and governments are increasingly focused on resilience. And as a result, our customers are relying on our solutions more than ever. I look forward to partnering with Patrick, Vernon and the entire Everbridge team to build on our commitment to growth improving profitability and increasing shareholder value.\n\nI will now turn the call over to Vernon to review our business highlights.\n\nVernon Irvin -- Executive Vice President and Chief Revenue Officer\n\nThank you, Dave, and thanks to all of you for joining us today. We delivered solid second quarter results and increased large enterprise deal momentum, demonstrating that our recent actions to streamline, integrate and reduce complexity across our product portfolio, are beginning to pay off for our customers. Our second quarter results came in ahead of expectations with revenue of $103 million, up 19% from a year ago; and adjusted EBITDA of $4.8 million. Let me give you a few examples of our success during the quarter.\n\nOur persona-based solution pillars are gaining traction with our enterprise customers. As a reminder, these four strategic CEM pillars are digital operations, business operations, people resilience and smart security. The breadth and depth of our platform is unmatched in our industry. We added 121 enterprise customers and 20 CEM customers and grew many more, including a leading Fortune 500 industrial firm, a leading pipeline company in the North America energy market and six major financial institutions.\n\nOur deal sizes continue to grow. We signed 63 deals over $100,000, five deals over $1 million, demonstrating our persona-based selling is gaining traction. In public safety, we demonstrated the power of network effect by growing business with several of our existing national customers. In Germany, we won the third major mobile network operator to deploy our public warning cell broadcast technology, expanding our reach to over 70% of mobile subscribers across Germany.\n\nIn Peru, we delivered a successful national test of their early warning messaging system. The system, which uses Everbridge's public warning platform was activated across more than 22 million mobile phones. In Iceland, the first country to win our best and resilience designation, the government uses our system to warn all hikers and travelers of dangers around volcanic eruptions. In higher education, we renewed and grew our presence in several top universities to better protect their student community at nationally ranked West Coast schools, including USC and UCLA and two Ivy League schools.\n\nAnd on the integration front, travel risk management and critical event management are now a single SaaS solution called Everbridge Assist, powered by Anvil. As the hybrid workforce redefines duty of care, we remain well-positioned with the markets, only end-to-end solution that combines people resilience and travel risk management. Another example is the launch of service intelligence part of the digital operations platform built around xMatters. We can now provide IT responders with advanced analytics and dynamic runbook automation for faster recovery and reduced business impact.\n\nAnd our risk guy team continues to execute well, bringing in several six-figure E911 deals with enterprises and state local agencies meeting through partners. Another focus area to drive our long-term growth is fostering our go-to-market programs by building out channel and reseller partnerships supplementing our direct sales with indirect sales. In the second quarter, over a third of our new and growth business during the quarter, particularly internationally, came through the expanded channel network, up from just around 10% a year ago. In fact, some of the largest deals are now being led by channel partners, including the German mobile operator and a leading industrial Fortune 500 firm.\n\nWe also expanded our channel presence in Mexico through a partnership with Grupo Siayec, a leading provider of digital and physical security solutions. Finally, on the industry front, our best resilience program now includes Humana, Exact Sciences, Johnson Controls and the latest brand to achieve this prestigious certification. A resilient organization ensures that employees assist resources and assets and resources and communities are protected from -- and prepare to migrate to the impact of critical events. Also during the quarter, our enterprise IT and cyber resilience solution, xMatters, was named the leader, and sole outperformer in the 2022 GigaOm Radar report for incident and task management solutions.\n\nThe report evaluated service providers based on a range of key criteria, including technical capabilities, product road map, innovation and ability to execute. In summary, we've made measurable progress on our priorities in the first half of 2022. As we look ahead to second half of the year, we expect that our simplification strategy to make our CEM bundles easier to buy while continuing to drive growth. Increasing profitability is being delivered by a combination of more efficient selling and larger deal sizes.\n\nNow allow me to turn the call over to Patrick for more details on our financial results, as well as our guidance for Q3 and the rest of 2022. Patrick, over to you.\n\nPatrick Brickley -- Executive Vice President and Chief Financial Officer\n\nThanks, Vernon. At the halfway point in the year, we have delivered on our growth and profitability targets, and we have achieved planned milestones related to our strategic realignment of resources. We are on track to achieve mid-teens adjusted EBITDA margins exiting this year, and we remain focused on driving sustainable revenue growth with increasing profitability. I'm pleased to see solid execution that produced revenue and adjusted EBITDA that were above our guidance range.\n\nRevenue in the second quarter was $103 million, up 19% from a year ago. During the quarter, we experienced over $1 million of revenue headwinds related to foreign exchange, and we anticipate those headwinds will continue for the remainder of this year. Adjusted EBITDA was $4.8 million, which reflects improving operating leverage, as well as execution of the strategic realignment program that we initiated in May. Through June 30, we incurred nearly $10 million of expense related to the strategic realignment, and we remain on track to hit our stated overall realignment targets of investing $13 million to $21 million in order to reduce annual run rate expense by $13 million to $18 million.\n\nWe ended the quarter with a cash balance of $475 million. For full details of our P&L and reconciliation of GAAP to non-GAAP measures, please refer to our press release. Total deferred revenue was $233 million, up from $210 million a year ago but down sequentially from $246 million at March 31, 2022, reflecting the usual organic seasonality of our business. Note that deferred revenue at June 30, 2021 was positively impacted by the acquisition of xMatters, which brought $34 million of deferred revenue on its opening balance sheet.\n\nTotal remaining performance obligations from subscription and other contracts was $443 million while current remaining performance obligations was $279 million. Our net retention rate continues to track at or above 110%, reflecting continued customer satisfaction combined with demand for additional Everbridge technology to expand within the existing customer base. Our momentum with large transactions continued in Q2, resulted in trailing 12-month ASPs that were again above $100,000. Additional business metrics can be found in our Investor Relations presentation posted on our website.\n\nNow I'll turn to guidance for the third quarter and full year. For the third quarter, we anticipate revenue of between $10.6 million and $111 million representing growth of 14% to 15%. Adjusted EBITDA will be between $13.5 million and $13.9 million, and we anticipate non-GAAP net income of between $7.5 million and $7.9 million or between $0.16 and $0.17 per diluted share. For the full year, we are reiterating our revenue guidance range of $428.2 million to $432.8 million representing growth of 16% to 17%.\n\nThis outlook assumes more than $1 million of foreign exchange impact in each of Q3 and Q4, similar to what we experienced in Q2. We anticipate adjusted EBITDA will be in the range of $37 million to $39 million, more than tripling from 2021 and representing an adjusted EBITDA margin of 9%. Further, we expect to exit the year with adjusted EBITDA margins in the mid-teens. We expect non-GAAP net income of between $15.7 million and $17.7 million or between $0.33 and $0.38 per diluted share based on 47 million diluted weighted average shares outstanding.\n\nIn summary, we delivered a solid performance in the second quarter. As we progress through 2022, we are very focused on execution, driving organic revenue growth and maximizing return on our investments. Looking further, we believe we can deliver sustainable top line growth with improving profitability and positive cash flow, which can generate significant long-term value for all of our stakeholders. Now operator, we are ready to open the call for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Michael Turrin with Wells Fargo Securities. Please go ahead.\n\nMichael Turrin -- Well Fargo Securities -- Analyst\n\nHey there. Thanks. Appreciate taking the question. David, congrats on joining.\n\nI think the first question for me is just I'm curious if there are any changes in buying behavior you're seeing or hearing, a number of software companies talk about elongation of sales cycles. We know there is a critical need for your solutions. So wondering if there's anything with the bundling strategy or anything you're seeing from a targeted industry perspective or elsewhere that could suggest any change there at all.\n\nVernon Irvin -- Executive Vice President and Chief Revenue Officer\n\nHello, Michael, this is Vernon Irvin. Thank you for the question. We've observed with our businesses that resiliency and business continuity continue to be at the forefront and concern of most of our enterprise and public sector customers, and we don't have and not seen any notable headwinds due to global economic conditions. So again, I think resiliency and business continuity seems to be top of mind for customers, but we keep a watchful eye in the marketplace.\n\nMichael Turrin -- Well Fargo Securities -- Analyst\n\nThat's helpful. Just one on the metrics if I may as well. I know billings is not the best indicator given you've talked about timing of earlier impacts. I appreciate the reminder on xMatters on the year ago compare, but it's down sequentially again here in the second quarter, which is maybe countered due to just some of the commentary around deal sizes and the increase there.\n\nSo just any impacts to be mindful of whether it's duration or transition-related impacts you can just bring our attention to and anything you could just add if there's any indication of where those could stabilize, I think, is helpful. Thank you.\n\nPatrick Brickley -- Executive Vice President and Chief Financial Officer\n\nYeah, that's the metric that we don't run the business to in terms of just sort of zooming out and looking at the progress that we're making. We're continuing to see signs of progress in sales productivity. We're also continuing to execute on a strategic realignment, which part of that is de-emphasizing and shedding noncore technology and customers and revenues that relate to that. So there are --\n\nDave Wagner -- Chief Executive Officer\n\nIf I could interrupt, Patrick. And I spoke, I think, about just remind you that the Q1 to Q2 is sequentially, that's sequentially organic, would be the way the billing cycle of our government customers work that being down sequentially organically, Q1 to Q2 is not inconsistent with the trend the business has had for a long time.\n\nMichael Turrin -- Well Fargo Securities -- Analyst\n\nHelpful. Thank you.\n\nOperator\n\nOur next question comes from Ryan MacWilliams with Barclays. Please go ahead with your question.\n\nRyan MacWilliams -- Barclays -- Analyst\n\nHearing about your strategy objectives, what would you say are some things Everbridge can improve on for the rest of this year? And how do you think about what a healthy growth profile for Everbridge can look like over time?\n\nDave Wagner -- Chief Executive Officer\n\nSo those are great questions. And when I talk to the board members, looked at the outside and things myself that the four strategic priorities that the team is already working on, I think, are the absolute right things to do, right? So simplifying our products to drive organic sales velocity, focusing on those networks of public safety with the network effect or engage some nice examples there, making it easier building paths to platform for more and more of our customers and then increasing our efficiency. So I think these are the right things to be focused on. These are things that I come to Everbridge with experience that hopefully are I'm expecting.\n\nI'm hoping and expecting to be able to help the team further improving in these areas. That's where we have our head down focusing on now. And as we do those, the sustainable growth opportunity, which I think remains strong, we'll get a much better indication of what that looks like in a couple of quarters in.\n\nRyan MacWilliams -- Barclays -- Analyst\n\nAppreciate the color. And then just on bookings linearity. Any changes to bookings as we move through the second quarter and then into July as well? And also, do you see any changes in churn in the second quarter? Thanks.\n\nVernon Irvin -- Executive Vice President and Chief Revenue Officer\n\nYeah. No, we track linearity pretty closely on bookings, and I think we continue to see that the strategy that Dave just laid out continues to provide us with the right strategy and the right runway to continue to maintain the momentum. So I don't have any further comment on that. And what was the second part of the question, I'm sorry?\n\nRyan MacWilliams -- Barclays -- Analyst\n\nAny changes in churn?\n\nVernon Irvin -- Executive Vice President and Chief Revenue Officer\n\nNo. I think we also see sort of continued trends in the business as well, but no additional comment on churn.\n\nRyan MacWilliams -- Barclays -- Analyst\n\nOK. Excited to see more details of what's coming next. Thanks, guys.\n\nVernon Irvin -- Executive Vice President and Chief Revenue Officer\n\nYup.\n\nOperator\n\nOur next question comes from Scott Berg with Needham. Please go ahead with your question.\n\nScott Berg -- Needham and Company -- Analyst\n\nHi, everyone. Congrats on the quarter, and thanks for taking my questions. And I echo the welcome Dave comments.\n\nDave Wagner -- Chief Executive Officer\n\nThank you, Scott.\n\nScott Berg -- Needham and Company -- Analyst\n\nYou bet. Vernon, I wanted to start with what you're seeing with your enterprise corporate customers today in terms of general demand trends. If you look at the business today versus maybe right before the pandemic, I know the customer or the contract [Inaudible] sizes are increasing a little bit. But how are those customers buying your solutions differently today versus maybe two and a half years ago?\n\nVernon Irvin -- Executive Vice President and Chief Revenue Officer\n\nYeah. Look, I think the importance of resiliency and business continuity is top of mind for lots of large corporations around the world, and that has given us the ability to be able to position our platform strategically with a lot of those large enterprise and public organizations. As a result of that, we obviously aligned our new pillar strategy to make sure we make a buying journey very simple for our customers to understand it, and we build it by persona. So from our perspective, we think that the importance of resiliency and business continuity aligned with the simplification of the strategy that Dave talked about and the pillar strategy, I think, is very timely.\n\nAnd as we were able to show this quarter and a little last quarter, we're starting to see early progress there, and it is early. It's only been a few months, but we are seeing early evidence that the platform and pillar strategy is allowing customers to see sort of their journey as they align the importance of resiliency and business continuity with Everbridge CEM.\n\nScott Berg -- Needham and Company -- Analyst\n\nGreat. And then from a follow-up perspective, I wanted to touch on the business coming out of EU with the mandate there around population alerting and such. How should we think about that opportunity today? Kind of where are we in the process? I think most of us understand that a lot of those selection cycles are supposed to be done this year with the original time frame. But as you sign another telco within Germany, is that opportunity may be 50%, 60%, 70% through the buying decisions for what those customers are doing? Or is there may be more to come here in the second half and into '23 for reference.\n\nThank you.\n\nVernon Irvin -- Executive Vice President and Chief Revenue Officer\n\nYeah. The public warning business for us in the EU, Everbridge, I think, has been able to demonstrate that its cell broadcast public warning platform is one of the best in the industry, particularly with our front end. We're proud that we were able to win the largest country in the EU with Germany in the recent win we announced in the second quarter. To give you sort of a feel for further opportunities, there are significant over 12 different European country RFPs and RFIs that we continue to compete for.\n\nBut many of the large companies like obviously, Spain, the U.K. and Germany have picked Everbridge as its ability to be able to warn its citizens in duty of care for his country. But there are still close to 10 other European countries that we are positioned with in the marketplace. And then because it's a global business, we also have a number of countries that are outside the EU that we'll continue to pursue as well in Asia Pac and Africa and the Middle East.\n\nScott Berg -- Needham and Company -- Analyst\n\nThanks. Congrats again.\n\nVernon Irvin -- Executive Vice President and Chief Revenue Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Koji Ikeda with Bank of America. Please go ahead with your question.\n\nLory Luo -- Bank of America Merrill Lynch -- Analyst\n\nHi. This is Lory Luo on for Koji. Thanks for taking my question. Just one from us.\n\nFirst, David, congrats on joining the team. Looking forward to working with you. So I was wondering how you are thinking about the current sales capacity in order to reach your near-term growth. Are you sticking with your hiring plans on the beginning of this year? Or has things changed? And are there any other changes on your go-to-market strategy that you are currently evaluating to drive the higher efficiency this year?\n\nVernon Irvin -- Executive Vice President and Chief Revenue Officer\n\nYeah. Look, our primary directive is to continue the growth of the company, and we continue to be active in making sure that we hire our go-to-market teams, particularly our sales organizations around the world. So that is a top priority. We also continue, as Dave talked about and Patrick talked about, continue to also want to improve bottom line.\n\nSo we're mindful of making sure we operate efficiently. But most of the growth in go-to-market, we continue to make those investments. One of the pivots that we have made, Lory, as I said in the prepared remarks, we continue to pivot more and more also to our indirect channels. We think there are more efficient cost structures there, more effective velocity in winning large deals around the world.\n\nSo you'll continue to hear progress as it relates to sort of making sure that indirect becomes a more prominent part of our business as we've seen some significant progress, particularly outside of the United States. So if there's a one point of clarification around go-to-market, it would be that I think that indirect will continue to strengthen and allow us to produce a more efficient bottom line on our go-to-market.\n\nLory Luo -- Bank of America Merrill Lynch -- Analyst\n\nYeah. That's helpful. Thank you.\n\nOperator\n\n[Operator instructions] Our next question comes from Brian Peterson with Raymond James. Please go ahead.\n\nBrian Peterson -- Raymond James -- Analyst\n\nHi, gentlemen. Thanks for taking the question, and David, welcome to the call. Look forward to working with you. So Patrick, I do want to follow up on billings.\n\nI know it's not a favorite topic. I know you don't run the business to that metric, but we've seen some quarters of volatility. Is there any way you could just comment on how maybe internal bookings compared versus expectations? Again, I know billings isn't the perfect metric, but like we just want to make sure we're getting the right kind of readthrough here because it sounds like a qualitative commentary on the enterprise and everything you're trying to do is really going well. So I just want to make sure we're on the same page here.\n\nPatrick Brickley -- Executive Vice President and Chief Financial Officer\n\nYeah. So seasonally, Q2 is the softest quarter for a number of metrics. Now we had a solid Q2. But when you look at externally calculated metrics like billings and you adjust for -- in the quarters where we have acquired deferred revenue when you adjust for that, looking back over time, you'll see that Q2 has historically been sequentially down from Q1 on that metric and then jumps back up in Q3 and Q4.\n\nSo that's -- that pattern has always been there, and we would anticipate that that will continue this year as well.\n\nBrian Peterson -- Raymond James -- Analyst\n\nGot it. And maybe just a follow-up on the guide, just clarifying. It sounded like the guide kind of embeds an incremental $3 million in FX headwinds. Is that right? And maybe any color on -- for the broader macro assumptions that you have in the updated outlook? Thanks, guys.\n\nPatrick Brickley -- Executive Vice President and Chief Financial Officer\n\nYeah. I'd say, Brian, at a high level, we're -- you heard Vernon talk about trends. Of course, we're trying to be prudent with our guidance as always. And we've got a few moving parts, but we're excited.\n\nWe think that we're on track, and we're making progress in terms of continuing to focus the business on long-term sustainable organic growth. Good progress to date. We've got more work to do.\n\nDave Wagner -- Chief Executive Officer\n\nYeah. Brian, thank you for the kind welcome. Look forward to working with you as well, and I appreciate you being clear on the FX headwinds that we've incorporated into the guide.\n\nOperator\n\nOur next question comes from Brian Colley with Stephens. Please go ahead.\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nHi, guys. Thanks for taking my question, and Dave, congratulations on the new position.\n\nDave Wagner -- Chief Executive Officer\n\nThanks, Brian.\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nSo Vernon, I'm curious, just as I look at the new bundles, kind of which categories are you seeing the most success today?\n\nVernon Irvin -- Executive Vice President and Chief Revenue Officer\n\nA couple of them, particularly in the interim was regionally, but certainly, people resilience is the one that we can point to. Also the business operations pillar is pretty strong for us. And then last but not least, we're seeing some nice momentum on our Smart Security platform. One of the largest financial institutions in the United States signed a pretty significant seven-figure deal with us.\n\nSo those are the three that are resonating pretty well. And we also have a mindful eye on digital opportunity, too, right? As companies are pivoting, more and more of their business operations where we think physical and digital are merging together. We think CEM for Digital is a very prominent place that we're excited about, obviously, leveraging the xMatters asset.\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nGot it. That's helpful. Thank you. And then I also want to ask about the EU.\n\nCan you just give an update on what you're seeing in terms of top-down network effect-type business in some of the larger countries that you've won recently?\n\nVernon Irvin -- Executive Vice President and Chief Revenue Officer\n\nYeah. As you know, we have -- when I think about the recent win in Spain, we also were able to win one of the larger financial institutions that are based in Spain. And that's a really good example of leveraging the network effects. We believe that the strategic relationship that we started in Germany with Siemens was instrumental in making sure that we were able to go to the country of Germany and leverage that significant win there, where we announced the latest country there.\n\nSo there are a couple of real good examples where winning the country helps pull in enterprise or winning the -- I'm sorry, winning in the country helps you with the enterprise or having a large enterprise helps you win in the country. So network effects is absolutely something that we'll stay focused on.\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nGot it. I appreciate that. I'll leave it there.\n\nVernon Irvin -- Executive Vice President and Chief Revenue Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Parker Lane with Stifel. Please go ahead.\n\nMatthew Kikkert -- Stifel Financial Corp. -- Analyst\n\nThis is Matthew Kikkert on for Parker. Thanks a lot for taking my questions, and Dave, welcome to the team.\n\nDave Wagner -- Chief Executive Officer\n\nThanks, Matthew.\n\nMatthew Kikkert -- Stifel Financial Corp. -- Analyst\n\nYeah. First off, I wanted to start with the competitive landscape. Have you seen any competitive challenges and pricing pressures continuing internationally? Or are you seeing these start to dissipate?\n\nVernon Irvin -- Executive Vice President and Chief Revenue Officer\n\nSo we operate -- if the question is specifically internationally and not domestically, I'll answer it, Matthew, internationally. We sort of run two product categories. Obviously, our world-class Everbridge CEM SaaS platform that we operate in, and we have a variety of products and capabilities that compete there in the marketplace. We don't see competition at the CEM level, where we're able to deliver the single pane of glass for resiliency and business continuity.\n\nAt the individual product level, call it mass certification or our risk intelligence, there are a number of individual players that we compete with in those marketplaces. And then as I speak about the public warning platform, Everbridge has been very successful and dominant in our win rate and in our ability to be able to address the EU mandate on public warning. So we don't see any big competitors. There are some smaller competitors that are very, very price-oriented.\n\nBut the reality is when we're able to speak to customers about our LBAS and our public warning platform with cell broadcast, plus the front end, it does provide a nice competitive moat for us. But there are very small public warning competitors, and there are also smaller competitors in the resiliency business continuity but not at the CEM level if that makes sense.\n\nMatthew Kikkert -- Stifel Financial Corp. -- Analyst\n\nOK. That makes sense. Thank you. And secondly, I want to zoom out a little bit.\n\nWhat changes in new perspectives do you expect coming from the addition of Dave as the CEO? And then specifically for you, Dave, what attracted you to the position at Everbridge?\n\nDave Wagner -- Chief Executive Officer\n\nYeah. So I'll take that, both half of it. In terms of changes, I see the strategy that we're on improving, improving go-to-market efficiency, tightly integrated products, making these paths to platform through product and easier-to-price integration, improving our profitability. These are things that need to be done.\n\nThe team is on the right track. We're making progress against these objectives, and we're going to continue to focus on moving those forward. I'm really excited to join Everbridge. It's a clear leader in an important part of the market with a very clear mission and purpose that ultimately results in saving lives, and so I'm finding a really deep commitment among the employee base to mission.\n\nI'm deeply committed to that mission as well. And then I look at it from when I'm joining the shareholder value creation opportunity here, I think, is really good. And so we're going to continue to focus on driving the growth and making sure that we're increasing our profitability at the same time, which I think as we do that, it's going to be good for our customers, our colleagues and our shareholders alike.\n\nMatthew Kikkert -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nOur next question comes from Matt Stotler with William Blair. Please go ahead.\n\nMatt Stotler -- William Blair -- Analyst\n\nHey, everybody. And Dave, good to meet you virtually. Look forward to working together going forward. Thank you for taking my questions.\n\nI guess, first one, just a question of large deal pipeline. You obviously seem to be pretty healthy in the quarter. Something we've seen in prior slowdowns is a kind of a shift in customer buying patterns toward kind of smaller, kind of high near-term ROI low-risk deployments versus large purchase decisions. Is that something that you're seeing today? And then is that -- on the other hand, if you move to a bundled approach, do you still have the ability to kind of sell these smaller, high near-term ROI solutions to customers who may look for it, we do have more of a slowdown in the back half?\n\nVernon Irvin -- Executive Vice President and Chief Revenue Officer\n\nYeah. Excellent question. And thanks for asking that, Matt. One of the things that we position as part of our pillar strategy was obviously our journey map to be able to go to a large enterprise or a public safety company and give them the ability to on-ramp on their way to journey to CEM.\n\nSo each of the packages that we rolled out has a level called Essentials, which is the sort of low end of the marketplace where a customer can sign up for our risk intelligence solutions or mass notification or some workflow design products we have and then be able to very quickly migrate up to the next level, which is what we call our standard package, where they could then sort of add another set of services around our control center or MN Pro. And then obviously, full-blown CEM is the advanced product where now you're looking for holistically security for internal, external, digital, as well as physical threats and become a full CEM customer. So I think that optionality that we rolled out in the marketplace gives customers a journey map to say, hey, look, due to economic conditions, we like the journey for CEM, but we're -- want to just start with the essential package. And no, we think we are an existing customer that's already essential but migrate to intermediate and to advance.\n\nSo that strategy, again, got rolled out pretty early on, but we're seeing indications that was the right direction to go in.\n\nMatt Stotler -- William Blair -- Analyst\n\nGotcha. Very helpful. And then just one follow-up. You've talked historically about this kind of eight-figure backlog that in prior periods have been kind of expanding or increasing a little bit.\n\nAny update on what that looks like and whether that's still increasing or decreasing in size?\n\nPatrick Brickley -- Executive Vice President and Chief Financial Officer\n\nHey, Matt, it's Patrick. No material change this quarter relative to last quarter. Sort of what we delivered in revenue, we replaced with sales.\n\nMatt Stotler -- William Blair -- Analyst\n\nGot it. Thanks again.\n\nPatrick Brickley -- Executive Vice President and Chief Financial Officer\n\nYou bet.\n\nOperator\n\n[Operator instructions] Our next question comes from Stuart Goldberg with Kettle Hill. Please go ahead with your question.\n\nStuart Goldberg -- Needham and Company -- Analyst\n\nHey, guys. Thanks for taking the question. I wanted to know about the channel partners. What other details can you talk about for the quarter? And what have you learned about realized pricing through the channel partners, if anything, at this point?\n\nVernon Irvin -- Executive Vice President and Chief Revenue Officer\n\nYeah, absolutely. Thank you for the question, Stuart. This is Vernon again. I -- one of the things that we do see when we engage the partner organization is a greater deal velocity, part of what we hear from customers as they have strategic partners themselves, whether they're system integrators or consultancies.\n\nAnd some of the partners we announced Booz Allen and Pricewaterhouse, Deloitte and Athos control risk. And most of those companies that I mentioned have their own business continuity practice and have had them with the C-suite for quite some time. What we're finding that it is what's been locking the actual solutions and deliver resiliency from a digital transformation perspective, and that is what the CEM platform does. So aligning our CEM platforms with these large consultancies or SIs is, again, the ability to connect with their C-level relationships, which is the velocity component with our combination of two or ones that we're seeing our partners to get.\n\nLast but not least, I would say is pricing isn't a topic, we're doing these things at market rates, and there is no differentiation in the final pricing from -- with using our partnership.\n\nStuart Goldberg -- Needham and Company -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to David Wagner, CEO, for any closing remarks.\n\nDave Wagner -- Chief Executive Officer\n\nThank you all for joining Everbridge's second quarter earnings call. We look forward to meeting with many of you during the quarter and speaking with most of you again as we give our update after Q3. Thank you very much, and have a good evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNandan Amladi -- Investor Relations\n\nDave Wagner -- Chief Executive Officer\n\nVernon Irvin -- Executive Vice President and Chief Revenue Officer\n\nPatrick Brickley -- Executive Vice President and Chief Financial Officer\n\nMichael Turrin -- Well Fargo Securities -- Analyst\n\nRyan MacWilliams -- Barclays -- Analyst\n\nScott Berg -- Needham and Company -- Analyst\n\nLory Luo -- Bank of America Merrill Lynch -- Analyst\n\nBrian Peterson -- Raymond James -- Analyst\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nMatthew Kikkert -- Stifel Financial Corp. -- Analyst\n\nMatt Stotler -- William Blair -- Analyst\n\nStuart Goldberg -- Needham and Company -- Analyst\n\nMore EVBG analysis\n\nAll earnings call transcripts"
}