{
  "companyName": "Electronic Arts",
  "companyTicker": "EA",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/electronic-arts-ea-q2-2023-earnings-call-transcrip/",
  "content": "Electronic Arts (EA -0.01%)\nQ2 2023 Earnings Call\nNov 01, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. My name is Julianne, and I will be your conference operator today. At this time, I'd like to welcome everyone to the Electronic Arts second quarter fiscal year 2023 earnings conference call. Mr.\n\nChris Evenden, vice president, investor relations, you may begin your conference.\n\nChris Evenden -- Vice President, Investor Relations\n\nThank you. Welcome to EA's second quarter fiscal 2023 earnings call. With me today are Andrew Wilson, our CEO; Chris Suh, our CFO; and Laura Miele, our COO. Please note that our SEC filings and our earnings release are available at ir.ea.com.\n\nIn addition, we have posted detailed earnings slides to accompany our prepared remarks. Lastly, after the call, we will post our prepared remarks and audio replay of this call, our financial model, and a transcript. With regards to our calendar, our Q3 fiscal 2023 earnings call is scheduled for Tuesday, January 31st. As a reminder, we posted the schedule of our entire fiscal year of upcoming earnings calls on our IR website.\n\nThis presentation and our comments include forward-looking statements regarding future events and the future financial performance of the company. Actual events and results may differ materially from our expectations. We refer you to our most recent Form 10-Q for a discussion of risks that could cause actual results to differ materially from those discussed today. Electronic Arts makes these statements as of today, November 1st, 2022, and disclaims any duty to update them.\n\nDuring this call, the financial metrics, with the exception of free cash flow, will be presented on a GAAP basis. All comparisons made in the course of this call are against the same period in the prior year unless otherwise stated. And now, I'll turn the call over to Andrew.\n\nAndrew Wilson -- Chief Executive Officer\n\nThanks, Chris. It's great to be here with you all. We delivered solid performance across our business in Q2, driven by our EA Sports portfolio and our multiplatform live services business. Our broad IP, exceptional talent, and growing player network of more than 600 million are the foundation of strength and stability in an uneven macro environment.\n\nDuring Q2, we launched Premier Sports Games and provided over 120 content updates on 35 titles across our global catalog. Our teams are deeply committed to delivering amazing games and entertainment that inspire fans to play create, watch, and forge enduring social connections. Our broad IP portfolio is unrivaled in the gaming industry. Foundational to our leadership is EA Sports with breadth and depth of partnerships that allow us to continue delivering deeply immersive experiences to fuel long-term growth.\n\nOur global football business demonstrates the power of a multiplatform ecosystem with a massive community engaging through multiple experiences. In Q2, we delivered our biggest EA Sports FIFA console and PC launch in history. In addition, in FIFA Mobile, daily, weekly, and monthly active players were up more than 100% year over year. And our free-to-play FIFA Online service in Asia delivered record performance.\n\nNow, the entire global football community across our ecosystem will benefit from the unique holiday timing of the World Cup. Next week, we'll launch new World Cup content into FIFA 23, FIFA Mobile, and FIFA Online designed to attract, engage and entertain players throughout the tournament and beyond. For nearly 30 years, we've delivered the biggest and highest quality football games to fans all over the world. Across our ecosystem, we've built the world's largest football community with our players, 19,000 athletes, 700 teams, 30 leagues and federations, and more than 300 partners.\n\nAs we now move into the future with EA Sports FC, we have even greater opportunity to engage the global audience of 3.5 billion football fans. Players will continue to experience everything they love about our games today: the modes, leagues, competitions, clubs, athlete, brands, and more. We'll push the technical boundaries for even greater innovation, immersion, and authenticity. And through more platforms and new modalities, we will reach new football fans all around the world, bringing them into our global community.\n\nThis is what EA Sports FC is all about. In this unique year with our biggest-ever console and PC title, a deeply engaging worldwide mobile experience, our online PC services in Asia, and now with Men's and Women's World Cup content coming, we are in an incredible position to unlock a truly extraordinary future with EA Sports FC. As the consumption of entertainment and sport converge and grow, EA Sports offers fans immersive experiences like no other, an ability to play, create, watch, and connect with friends and the sports they love 365 days a year. Now more than ever, Madden NFL is deeply ingrained into the fabric of NFL fandom, reaching broader entertainment audiences.\n\nWith the sport of F1 continuing its growth trajectory, especially in the U.S., we are well-positioned to expand the total addressable market for our F1 franchise. We have more than 200 million players engaged in our EA Sports games. As we look to the future of FC, Madden NFL, F1, NHL, UFC, PGA Tour and Mall, we will continue growing these ecosystems to reach new fans, expand in new experiences, and create more social connectivity to fuel the enjoyment of sport. Our owned-IP franchises continue to be among the most deeply engaging and culturally relevant entertainment properties in the world.\n\nApex Legends is driving massive growth in emerging markets, and the team continues to build its content, universe, characters, and storylines across multiple platforms and experiences. As we expand our console, PC, and mobile experiences, Apex has captured the imagination of our global community beyond play. Not only are they playing, watching, and competing, they're captivated by the law, the worlds and storylines in and outside the game. We are just getting started and believe Apex will be one of the most important IPs in the world.\n\nEngagement in our Sims franchise continues to grow with millions of players unleashing their imaginations full of creativity, humor, and individuality, both in-game and across the entire ecosystem. We expect engagement to grow with the Sims 4 base game recently becoming free to enter. Looking ahead, our team is working on a new creative platform for our Sims community giving them more collaborative ways to play, create, connect, and share stories with their friends. In Q2, we also announced an exciting long-term multigame collaboration with Marvel joining forces with a cultural defining powerhouse to expand our entertainment offerings.\n\nFrom our EA Sports League partners to Disney's Star Wars and Marvel universes and more, we're partnered to grow our global communities, build value together, and co-create the future of entertainment. Our player network of more than 600 million worldwide continues to grow. The unique value of this network is our ability to create new communities and meaningful connections that matter. In fact, more than three-quarters of EA players engage with gaming content beyond the game itself, reading, watching and creating content, and engaging in social conversations through shared fandom.\n\nWith EA Sports FC, Apex, the Sims, Skate and more, all poised to fuel fun and social connection, our growing network will continue adding long-term value. As we look ahead, our talent teams are focused on building extraordinary experiences that drive deep engagement to grow our communities and reach new audiences, particularly Gen Z and Gen Alpha, who are turning to games as their preferred choice for entertainment and social connection. Games continue to be one of the fastest-growing forms of entertainment and the social networks of the future. We're in the privileged position of creating what people love doing more than anything else with their friends and family.\n\nThrough our broad IP, our creative talent, and our growing network of players, we are well-positioned to lead the future of entertainment and deliver long-term value. Now I'll turn the call over to Chris.\n\nChris Suh -- Chief Financial Officer\n\nThanks, and hello to everyone. As Andrew said, we had another solid quarter. Driven by our EA Sports portfolio and our multiplatform live services business. And importantly, engagement from our players around the globe across both platforms and our broad portfolio of games continued to be strong fueling our resilient live services business and enabling us to deliver on our commitments even as we navigate through an uneven environment.\n\nNet bookings for the second quarter were $1.75 billion and in line with our expectations, down 5% or 2% in constant currency due to the timing of the F1 launch with the strength in console and PC offsetting mobile. Our live services net bookings were also in line with our expectations, down 3% year on year or flat in constant currency due to the timing of the FIFA launch offset by strength elsewhere in the business. On a trailing 12-month basis, live services were 73% of our business. And with regard to full game sales, digital sales accounted for 66% of units sold through, up 5 percentage points from last year.\n\nOur EA Sports portfolio was the highlight and driver of Q2 net bookings. We saw strength across the entire FIFA franchise in the quarter, further demonstrating the power of our multiplatform ecosystem. FIFA net bookings grew 6% in constant currency, and we saw engagement increase significantly across all platforms. As Andrew mentioned, we delivered a record launch on FIFA 23.\n\nIn the first four weeks, FIFA 23 sell-through unit sales were up 10% versus the comparable period for FIFA 22 and FUT players are up 6%. With the launch of Madden 23, Madden Ultimate Team players and net bookings are both up double digits year on year. We delivered Q2 net revenue of $1.9 billion, in line with our expectations and with a higher mix of console and PC-based revenue, gross margins, and underlying profit were well above our expectations. Operating expenses were up 2% on last year, in line with our expectations as we continue to take a disciplined approach to investing in our development teams and new product launches.\n\nOperating cash flow for the quarter was negative $112 million, and we returned $378 million to shareholders through dividends in our ongoing share repurchase program. On a trailing 12-month basis, operating cash flow is up 26% year on year. Now turning to guidance. We are providing an updated guidance range today, primarily due to the persistent FX rate environment.\n\nJust over half of our sales are generated outside of the U.S., and the U.S. dollar strengthened between 7% and 15% versus our largest foreign currencies when compared to rates at the time of our initial FY '23 guidance. As a result, we now expect an FX impact of approximately $200 million versus our initial full year net bookings guide as the impact will grow in our second half and into FY '24 at current exchange rates. Beyond FX, our business fundamentals remain healthy with strong player engagement trends across our platforms and franchises.\n\nWe expect strength from our console and PC game franchises to offset most of the impact of the current mobile market softness. In particular, we expect to see the momentum of the FIFA 23 launch carry into the second half, aided by excitement surrounding the World Cup. With these factors considered, we are revising our full year net bookings guidance to $7.65 billion to $7.85 billion, up 2% to 4% year on year or 6% to 9% in constant currency. We expect fiscal '23 GAAP revenue to be $7.55 billion to $7.75 billion and expect cost of revenue to be $1.845 billion to $1.89 billion, below our prior range, reflecting the gross margin benefit from the revenue mix shift due to the relative strength of our console and PC franchises.\n\nWe continue to be disciplined in our spend while also carefully prioritizing investments to fuel our long-term growth, and we expect operating expenses to be $4.245 billion to $4.295 billion. Accordingly, our updated GAAP earnings per share guidance is now higher at $3.11 to $3.34. Importantly, our expectations for underlying profitability for the year remain unchanged, even after accounting for the FX headwinds. We are also reaffirming our guidance for operating cash flow at $1.6 billion to $1.65 billion, with capital expenditures of about $200 million that results in free cash flow of about $1.4 billion to $1.45 billion.\n\nPlease see our earnings slides and press release for further cash flow information. Turning to the quarter. We expect Q3 '23 net bookings to be $2.425 billion to $2.525 billion, driven by our annualized franchises plus the launch of Need for Speed Unbound on December 2. For the third quarter, we expect GAAP net revenue to be $1.825 billion to $1.925 billion, cost of revenue to be $560 million to $580 million and operating expenses of approximately $1.08 billion to $1.09 billion.\n\nThis results in earnings per share of $0.43 to $0.59 for the third quarter. To summarize, our solid second quarter results again demonstrate the power of the EA model. We carry momentum into the second half. FIFA is off and running with the World Cup set to accelerate engagement.\n\nNeed for Speed Unbound is ready for launch and a strong slate is queued up for Q4. We've extended the Apex franchise to mobile, enabling us to reach more people in more geographies than ever before and expect it to continue to grow over time. And with the Sims 4 now free to enter, we look forward to welcoming more players than ever into this beloved franchise. With our strong pipeline, healthy engagement trends, durable and highly recurring live services model, and a continued focus on discipline and execution, we are well-positioned for the future.\n\nNow, I'll hand it back over to Andrew.\n\nAndrew Wilson -- Chief Executive Officer\n\nThanks, Chris. In Q2, EA delivered strong engagement and deeply immersive experiences across our portfolio with new EA Sports titles and multiplatform live services powering the business. We have a deep slate of new titles set for the second half of the year. Entertainment is a fundamental human need.\n\nAnd in this dynamic environment, we are focusing on our strengths, providing amazing games and live services that inspire the world to play. With our incredible talent, our growing play network, and more people than ever engaging and connecting through games, we are excited to lead and create the future of entertainment. Now Chris, Laura, and I are here for your questions.\n\nOperator\n\n[Operator instructions] In the interest of time, we ask that you please limit yourself to one question and one follow-up question. Thank you. Our first question comes from Matthew Cost from Morgan Stanley. Please go ahead.\n\nYour line is open. \n\nMatthew Cost -- Morgan Stanley -- Analyst\n\nHi, everyone. Thanks for taking the questions. I have two here. So, in an environment where, Andrew, you mentioned, you know, obviously, things are changing, consumers are under pressure, are you observing any changes in the behavior of users? For example, are people perhaps prioritizing buying a copy of FIFA and maybe spending less on the Ultimate Team? Or is there anything that you've noticed that's starting to shift in the behavior of your users? And then secondly, on the pipeline, I think that the fourth quarter is still showing a major title that doesn't have a specific name to it yet.\n\nShould we interpret that as there's a title that's tentatively slated for the fourth quarter, but it could potentially be pushed out? Just any color you can add there. Thank you.\n\nAndrew Wilson -- Chief Executive Officer\n\nYeah. Great questions. First one on user behavior. I think the one thing to reinforce is we are seeing extraordinary engagement across our business, particularly in our key titles like FIFA and like Apex and like The Sims.\n\nAnd remember, this extraordinary engagement of what was already extraordinary engagement coming through COVID and many had believed that we were going to see meaningful changes, a meaningful drop-off to our engagement post-COVID as the world kind of went mostly back to normal. And we haven't seen that yet. We've continued to see really strong engagement across our products. And certainly, with the launch of FIFA and Madden, both of which are up and the ongoing strength in Apex and The Sims, we feel really good about the future.\n\nWhat we do want to say, though, is that we're going to be very deliberate as we move through the back half of the year. We've got an extraordinary slate through the back half. We feel very good about that slate. But it's hard to ignore all of the narrative around us and some of the commentary around what might be challenging macroeconomic times particularly in Europe that seems to be dealing with that more dramatically so far than the U.S.\n\nAs it stands right now, we haven't seen meaningful shifts in behavior. We expect that we will grow but we also want to be very thoughtful, focused, and deliberate as we move through this environment because if it gets really bad, I don't think anybody is immune, but I think what we've demonstrated is that we're unbelievably resilient and why we're focused on building incredible games and driving deep engagement with our community, which so far is working really, really well for us. On the second point around the title, you shouldn't read anything into that other than the nature of marketing in our industry has meaningfully changed over the past five or six years. You might remember when we launched Apex Legends, we didn't tell anybody about it until about 48 hours before the community get to play it.\n\nAnd as we continue to see the shift -- you know, the big shift, of course, in the recent decade was a move from television to digital. We've moved into more targeted digital and now we're moving in a more targeted timing around digital. And so, for each franchise, our development teams and marketing teams come together and think through what is the most appropriate time to begin meaningfully communicating with our community around what titles are coming. And so, we feel really good about our slate.\n\nWe feel really good about that particular title as it turns out. Actually really, really good. But it just -- our teams right now are still working through the appropriate timing for launching and marketing, communicating around that title.\n\nMatthew Cost -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Benjamin Soff from Deutsche Bank. Please go ahead. Your line is open.\n\nBenjamin Soff -- Deutsche Bank -- Analyst\n\nHey, guys. Thanks for the question. So, pretty exciting stuff with the Marvel partnership. I was wondering if you guys could maybe talk a little bit more about what that might mean for the long-term growth for your business.\n\nAnd the press release referenced at least three games, I believe. So, what do you think some of the things are that your partner might be looking for as they evaluate whether or not to extend this partnership to additional games? Thanks.\n\nLaura Miele -- Chief Operating Officer\n\nThanks, Benjamin. Great question. When we think about our growth potential in our portfolio, we certainly consider the games that we create, the world, the characters. We also look at the expansion of our player community and the diversity of players that we can bring in.\n\nWhen you think about the breadth of our portfolio from real-world sports to our original IP, you know, including Sims, Apex, Battlefield, Skate, Need for Speed, we also have licensed IP. You think about Star Wars, Lord of the Rings, and of course, now Marvel, as you mentioned. So, we consider this licensed IP, an incredibly important component of expanding, diversifying, and casting our net wider to bring new players in. And when we looked at our Star Wars business, as an example, we brought millions of players into our community, and what we realized and have seen is that over 40% of those players have gone on to play other games in our portfolio.\n\nSo, we consider adding licensed IP as a pretty significant engagement model to our overall community as we grow. And we're thrilled to welcome the Marvel partners into our creative teams, and we're incredibly confident that we're going to build meaningful content for our fans. We have generally approached these types of creative partnerships kind of away from the contract. We don't want it to be a transactional partnership, really embrace a creative partnership and co-create together.\n\nAnd we've seen great success in our past, and we expect no difference for the future with Marvel.\n\nChris Evenden -- Vice President, Investor Relations\n\nHey, Julianne, next question, please.\n\nOperator\n\nOur next question comes from Omar Dessouky from Bank of America. Please go ahead. Your line is open.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thanks for taking my question. I'd like to ask about your four objectives of play, create, watch, and social and how they're going to affect your business long term. And then I have a follow-up.\n\nSo, the first question is, are these initiatives you need to undertake in order to keep pace with the growth in the video game industry or exceed growth in the video game industry? And as you build out these features around your core franchises, sort of five years out, by what factor could they help your core franchises grow? And then I have a follow-up.\n\nAndrew Wilson -- Chief Executive Officer\n\nYeah. Great question. So, as we think about the four key vectors of opportunity for us: play, create, watch, and connect, the first thing to -- as we look at existing network of players over 600 million, as we look at new onboarding plays in the kind of Gen Z and Gen Alpha populations, what we discover is the first thing that they are expecting from us is that we expand play. So, when I started building games, this industry over 20 years ago, we were primarily playing single-player games or on-the-couch games.\n\nWe then moved from single player to multiplayer, offline to online, one-on-one to one versus many. So, we've seen these ongoing inflection points that have expanded the nature of play. I think as we are looking now, and as you look at what we're doing in and around our games like FIFA, like Madden, like The Sims, like Apex, and many others, is we are expanding the modalities of play beyond what might have been a traditional mechanic within -- in a game. And as we continue to drive these franchises forward, we start asking ourselves, \"What happens in FC when you're not playing on the pitch? What happens in The Sims when you leave your home and go to someone else's home? What happens in Apex when you move beyond the existing map or the existing modality of play?\" And so, every time we offer an expanded play option, what we do see is it attracts more people, and it drives deeper engagement in the franchise.\n\nAlso, as we look at these generations, of course, you don't have to look very far to see that created such a big and important part of all entertainment, particularly games. And as you look at YouTube and TikTok and Snap and others over the past five or 10 years, we've seen this become an even more important part of entertainment and social connection among these audiences. And as we think now about -- even if we go back as far as creating things in The Sims and only in Battlefield moment and sharing highlights from FIFA, and now the ability for players to come in and move things around in the world as a first step, create new things and put them into the world as a second step, and really create new aspects of these worlds as a third step what we see again is that more than half of our community engages in player-created content. And so, it attracts and it onboards new players.\n\nI watch my seven-year-old son get introduced to new games because he's watching created content on YouTube for the games that we make. And quite frankly, some of the games that our competitors make. And so, this notion of creativity and the ability to engage the community to create is a really important part of our future both in the expansion of our worlds to fuel the insatiable appetite for content that our global community of players has but also to deepen engagement. Again, and as part of that, watch is becoming a really important part.\n\nWe get 2 billion or 3 billion hours of play in FIFA a year, and we get nearly as much of that watching FIFA game play. The same is true for Apex. We're seeing this grow more and more across our ecosystem. And then finally, we're seeing connections that are formed among four and five and six people.\n\nThese atomic units as part of these global communities that are the most meaningful connections. These players are spending 90 minutes, two hours a day together, playing the games together and then sharing that content beyond the traditional boundaries of games. And so, as we think about our opportunities across these four vectors, we really think about it, which of these things are going to allow us to attract more people? We think it's very reasonable to believe that we can entertain 1 billion people in play. And we think about these things in the context of driving deeper engagement in the overall ecosystem, being it's very reasonable to believe that we can get that 1 billion people to engage with us for at least an hour a day.\n\nAnd what we know about our business is that people spend money where they spend their time and provided we offer incredible innovation, incredible creativity, incredible quality, and incredible value that that will ultimately present extraordinary opportunities for financial growth for us in the future.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nOK. A wonderful answer. Thank you. So, it sounds like you're really at the forefront of innovation rather than this just being table stakes for the video game industry of the future.\n\nMy second -- correct me if I'm wrong. My second question is, in the past, like in 2017, you've said that you spend about 25% of your R&D budget on new IP. Things that may never see the light of day. So, based on fiscal '22, that would be around $400 million to $500 million.\n\nFirst of all, is that kind of still the case? And second of all, as you build out the toolsets necessary to achieve play, create, watch, and social, should we think about incremental R&D spend on top of that? Or will the kind of additional expenses to create out those tool sets and initiatives be part of that 25% or even the existing budgets within existing franchises?\n\nAndrew Wilson -- Chief Executive Officer\n\nYeah. Great question. The first thing to acknowledge is, and I've talked about 20%, 25% in the past. One, it's not a static number.\n\nIt changes over time based on what's going on in our various incubation and development and production pipelines. As we think about investing, the primary investment for us is always going to be building incredible games. And for us, that really falls in two key categories: building out these global online gaming communities around our biggest IP: FC, Battlefield, Apex, The Sims, Madden, Skate is coming down the pipe. And so that's one category investment for us.\n\nAnd a lot of that 20%, 25% goes into new modalities of play and you create in and around those ecosystems that are very proven, very stable, and represent extraordinary opportunities for growth. The second area is around building these worlds and creating these characters and tell these amazing stories both in our owned IP and in the IP of our partners as we co-create the future of entertainment. And we really think about interactive storytelling as the future form of storytelling that most consumers will choose as their first form of entertainment. And a chunk of that 20%, 25% goes into those things, things that we do with our partners at Disney across Star Wars and Marvel will fall into that category.\n\nThe third category, which is a much smaller category, but probably represents one of the biggest long-term upside opportunities is how do we think about deriving value from the power of our network beyond the bounds of a traditional game experience. We've got 600 million, we're going to go to 1 billion. I hope that we get to 2 billion people in our network, and they spend an hour and a half a day in our games, and then they spend another 90 minutes a day doing things outside of our games, but that are deeply connected to the games that they play. And what is our opportunity there? And one such opportunity might be, how do we disrupt the consumption of sport? How do we really think about sport from an interactive viewpoint? If you starred in one of our games, but you are a deep sports fan, what other things might be able to do with you with our partners that would fuel your sports fandom.\n\nAnd while that's a relatively small investment for us today, it does represent a pretty significant upside to the expansion of what we're able to do with our global network of players and fans around the world over the course of the next three to five years. As we think about investment more broadly, you shouldn't imagine that this is deep incremental investment. This is about really focusing our existing investment in the right areas. And part of what we have to do as a company always is be very deliberate, very disciplined, and very focused on how we invest.\n\nAnd because we're in the entertainment business, we have to acknowledge that not everything we do will work or at least work exactly as we planned. And we have to be very ready to move and shift and reshape our organization and the investment that we put into it to drive that future. So, you shouldn't expect some giant new incremental spend, but you should expect us to continue to move investment around our company and where we feel like there are really big upside opportunities in the area of global online communities, in the area of interactive storytelling, in the area of harnessing the power of our network beyond the bounds of a traditional gaming experience and where we believe that we have very strong likelihood of success and growth, we will invest behind those things.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nThat's wonderful. Thank you very much for sharing your vision. Appreciate it.\n\nOperator\n\nOur next question comes from Eric Sheridan from Goldman Sachs. Please go ahead. Your line is open.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks for taking the question. I hope everyone on the team is well. Maybe just focusing on the mobile front, we've obviously gotten a lot of questions from investors. There's been sort of the last 12 to 15 months of headwinds that have been created by Apple's privacy changes.\n\nBut obviously, there's a long-tailed opportunity to get mobile right, especially AAA games on mobile over the medium to long term, and there's been a lot of capital allocated toward M&A in mobile. How are you thinking about investing behind mobile? Mobile continuing to grow as a percentage of the mix and how to navigate some of the maybe challenges in terms of growing the user base and monetizing in-game that mobile continues to face in this environment? Thanks so much.\n\nLaura Miele -- Chief Operating Officer\n\nThanks, Eric. Great question. We see mobile remaining one of the largest platforms in the games business, and it represents a pretty significant growth path for us, particularly with our large franchises. So, there's a couple of parts of how to think about this.\n\nAnd we are looking at mobile as an expansion in multiplier on our big franchises such as FIFA, Apex. As an example, when we look at our FIFA Mobile business, 75% of our FIFA Mobile players exist outside of Europe and North America. So, that's significant reach and global impact for our FIFA Mobile game. So, we continue to believe that the mobile business will be -- will contribute to these big online communities that Andrew has talked about and has discussed in our vision and strategy and be a multiplier for these gaming ecosystems for players.\n\nAnd when we think about a post-ATT world or post-IDFA world, what's most meaningful is having these large communities and well-known brands for strong reach. And so, we are confident in our position to have an impact beyond some of the challenges that some are experiencing in a post-ATT world. As we think about our acquisitions and our stand-alone business, we continue to see strength in games such as Galaxy, Star Wars Galaxy of Heroes. And when we look at Glu, our Glu acquisition, that is some of those properties such as Design Home, Covet Fashion, we believe are going to be strong contributors to our lifestyle Sims sort of business.\n\nThen we also have the Tap Sports business that clearly we have big strength in sports. And so, we continue to believe that those will contribute to our strategic growth path as we head into the future. So, yes, there have been headwinds in the mobile market, and we continue to believe that mobile as a platform will provide the global player reach for our big franchises. And we believe with our big community, it will continue to help us with some of our stand-alone mobile games with our large communities and big brands.\n\nOperator\n\nOur next question comes from Mario Lu from Barclays. Please go ahead. Your line is open.\n\nMario Lu -- Barclays -- Analyst\n\nGreat. Thanks for taking the questions. The first one is on FIFA. Just wondering if you could help double-click on the main factors that attributed to the 10% unit growth year on year.\n\nIs it the new features such as cross-play? Is it the upcoming World Cup content? Anything you can point to there would be helpful.\n\nAndrew Wilson -- Chief Executive Officer\n\nYeah, I think that the first one around our business there is we live in a symbiotic relationship with a real world of football. And the real world of football continues to grow. This is the world's game. It's the greatest game on the planet.\n\nThere might be some that would argue with me on that front. But certainly, as you travel around the world, there are more fans of this sport than pretty much any other sport on the planet, and it continues to grow and the engagement by virtue of technology advancements around access to content continues to fuel growth in the sport itself. As you then think about what our teams do in the context of innovation and creativity in modes, and this is our biggest FIFA yet, and we're delivering across all of the key leagues and teams and competitions in the world, and we're doing it at incredibly high quality, and we're really working closely with our fan base to understand how they want to experience interactive football through our game around the content that they love the most. And so, as we look through -- over the last nearly 30 years, this is what this team has continued to do year in, year out.\n\nIt has continued to grow year over year, and it really is the double multiplier of the growth of the sport itself combined with a team dedicated to innovation and creativity around that sport working in lockstep with a growing global community. And our expectation is that as we think forward to FC, that we're going to be able to do even more of this both in the context of immersion and authenticity of the very core of the sport, as well as the expansion of what the overall experience can embody for football fans around the world.\n\nMario Lu -- Barclays -- Analyst\n\nGreat. Thank you. And then just a second one on mobile, specifically on Apex Mobile. Just curious how it's progressing versus your internal expectations.\n\nAnd are there any early learnings that could be applied to other franchises like Battlefield that will ultimately be brought to mobile as well?\n\nLaura Miele -- Chief Operating Officer\n\nThanks for the question. As I mentioned in the mobile response earlier, mobile continues to contribute to the overall growth of some of our biggest franchises and brands. And that is certainly the case with Apex Mobile for the overall Apex brand. We're seeing player and geographic expansion in Southeast Asia, Middle East, Latin America.\n\nThat is exactly how we had hoped for and what we were expecting. Now, we are 24 weeks into our launch. And while we've delivered a strong experience, the rating on the App Store is quite strong, and we're proud of the quality of the game. And our core players have connected with it quite well.\n\nWe are now focused on improving our retention for our more casual players, and that is definitely an area of focus for us and an area of improvement. And this is very much a natural part of the cycle and process as we bring these games to market. And we believe and we know that Apex Mobile will continue to help us drive the growth for the overall Apex mobile brand and franchise in the coming years.\n\nMario Lu -- Barclays -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question comes from Andrew Uerkwitz from Jefferies. Please go ahead. Your line is open. \n\nAndrew Uerkwitz -- Jefferies -- Analyst\n\nYeah. Hey, thanks for letting me ask a couple of questions. I guess Andrew, and maybe Laura can chime in here, when you talk about kind of the four big initiatives around social and whatnot, it seems like The Sims and maybe Skate is solidly in kind of all four of those categories. Can you talk a little bit about how that kind of game design process goes as you try to figure out how to incorporate user-generated content and maybe a marketplace and maybe some sort of social fabric that overlays those types of games versus maybe what expectations are going to be from gamers who might think they just want to play a Skate game or just want to play kind of a housebuilding game?\n\nAndrew Wilson -- Chief Executive Officer\n\nYeah. I mean it's a longer and more complicated question than I probably have time for today, but I would tell you the way we think about it is really around player motivations. And when we design for a game, we're really thinking about what motivations are we trying to fulfill. And you've got one group that -- and I kind of go with a crude kind of cohort grouping.\n\nYou got one group who simply want to fuel the motivation of escape. They want to be able to disappear from the world they live in day to day and immerse themselves in a new world, and that be the sum total of their experience. And that's a really important thing for them. And we have to think about that across the breadth of our portfolio.\n\nThere might be another group who says, \"Hey, I want to be able to -- I want to play -- I want to immerse myself in this world, but I want to do it with a core group of friends. And I want to bring them in.\" We call this an atomic unit. And we see this among players in groups of kind of four or five. These are the strongest connections we see in our network.\n\nAnd really, the experience that they have is around doing things in the context of this group environment with four or five people. There's another group who says, \"Hey, I want to do this thing. I might do it by myself or I might do it with other people, but I really want to very quickly be able to share everything I'm doing with the outside world. I want to capture cool moves I do.\n\nI want to be able to capture cool things I build and be able to share that almost immediately with the outside world through social media and other platforms.\" And it's really kind of an ad hoc thing, and it's not very polished, but it's just like, \"Look, what I'm doing,\" and it's think about it like a kid on the playground who just, as a somersault on the treadmill, says \"Look, watch me.\" And so, we're fueling that motivation. And then we have a fourth group who really wants to create and curate and share their content in a highly polished format. And that we see in the context of The Sims. And we'll certainly see it in the context of Skate, and we're seeing that kind of start to rise up in things that people want out of our FC experience and our Madden experience and certainly has been and will continue to be part of our Battlefield experience over time.\n\nAnd so really, when we think about designing and building these things, we start with a player first, and we start with what are the motivations they're trying to fulfill. And then we look to build tools that seamlessly and without friction, fulfill those motivations for them in the best way possible. And what we are seeing is that we're able to fulfill motivations across that full spectrum of cohorts, and that's why our network is growing so rapidly. That's why our engagement is continuing to be strong, and that's why people are spending more time in our games and using this as a platform to build deep enduring connections with their friends.\n\nAndrew Uerkwitz -- Jefferies -- Analyst\n\nGot it. That's helpful. And then as I think about some of the kind of less -- some of the games that maybe have less of that when I think about the single player -- the single player stuff you're building. Is some of the motivation there, at the end of the day, somewhat financial where -- my guess is the predictability of the success of whether it's the licensed IP or maybe some of the stuff out of BioWare where you can -- where it's easier to kind of do the math on the ROI and it's just more predictable and you feel there's a need for those types of gains every single year?\n\nAndrew Wilson -- Chief Executive Officer\n\nAgain, entertainment has been built on the creation of world, the development of character, and the telling the story since time began, and we've experienced it in different forms over time, we had to go to the theater, then we would read about it, then we'd listened to it on the radio and then we watch it the movie, then we watch it in television. Now, we experienced that through games. And it is how we entertain ourselves first and foremost, as we think about these great storytelling opportunities. And so again, as a publicly traded company, we're always thinking about the financial return of the things that we do.\n\nBut as we think about the full breadth of the consumption of sports and entertainment, these deep social experiences are very much about how we enjoy attainment, but the creation of world and development of characters and telling of stories is kind of the central lifeblood of entertainment more broadly. And as we think about this, it's not just about predictability because, again, there are being crappy worlds and crappy characters and crappy stories being told. And so, we work with our partners and we work with our own IP to do things in a truly compelling way, and we think it represents an extraordinary business opportunity as we don't believe that humanity is going to turn it back on the nature of storytelling. As we look to the future, the nature of storytelling is almost certainly going to be interactive.\n\nAndrew Uerkwitz -- Jefferies -- Analyst\n\nGot it. Thanks so much for your answers. Appreciate it.\n\nOperator\n\nOur next question comes from Eric Handler from MKM Partners. Please go ahead. Your line is open.\n\nEric Handler -- MKM Partners -- Analyst\n\nGood afternoon, and thanks for the question. Wonder if you could talk a little bit about your decision to give the Lord of the Rings mobile game a bit more time in soft launch given the current mobile market conditions. Right now, in this post-IDFA world, is it just too challenging to find good ROI channels to launch a new game on a mass-market level? What is it you're seeing there? And then secondly, can you maybe talk about your decision to take The Sims to free-to-play model?\n\nLaura Miele -- Chief Operating Officer\n\nHi, Eric. So, we put the Lord of the Rings mobile game in the market in soft launch a few months ago, and it's being developed by the same team that created one of our most successful mobile games and Star Wars Galaxy of Heroes. And I would say it's actually a very normal part of our process to go out to soft launch and allow our community and player feedback to inform how we're thinking about game development. So, we consider this to be a pretty normal natural part of our cycle and aren't seeing anything unnecessarily unusual.\n\nAnd the game needs more time. We need more time to continue to flesh out our progression loops to simplify our – for, too, our first-time user experiences. And we're confident that we will get to market soon with the game. And as you mentioned, having a big brand like Lord of the Rings and a great creative partner, they're seeing good success in this franchise right now, it's going to help us in a post-ATT world.\n\nSo, in partnership with our big online community that we have and a big Lord of the Rings brand and a healthy soft launch, so we can get the game metrics and the gameplay right, we will come to market when the time is right for the game and for our players.\n\nAndrew Wilson -- Chief Executive Officer\n\nAnd on The Sims, again, it's nearly 10 years old now. I mean, there are people who are going to want to play The Sims 4 -- yeah, it's nearly 10 years old now. When we think about -- there's a bunch of people who want to play that game who may not have even been born when we launched the game. And while we have a community of many tens of millions of people playing, we recognize the opportunity to really open up and bringing anyone who wants to experience The Sims 4.\n\nAs we look at the last 12 months, about 90% of all revenue was from extra content, not the base game. And so, as we think about the future, as we think about the evolution of The Sims experience and really bringing in more people to enjoy what The Sims offers the playing community, we felt that this was the right time. And I commend the team for really making this happen and really supporting their community. And what we've seen on balance is the community has been very thankful for this, very supportive of this, and is looking forward to welcoming what we hope is many millions more into that ecosystem overall.\n\nEric Handler -- MKM Partners -- Analyst\n\nVery helpful. Thank you very much.\n\nOperator\n\nOur next question comes from Stephen Ju from Credit Suisse. Please go ahead. Your line is open.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nOK. Hi, Andrew. So, thanks for letting me ask the question. And I think this is a topic that we've explored before, but with what looks like the sequel for Sims under development, I thought I'd bring this up again.\n\nAnd I think this, for lack of a better word, I guess, the lower and the body of work that exists in Sims 4 because, as you say, the game is like 10 years old now, and there's a lot of content that you've released over the years. And should we be thinking about how Sims 5, when it's released, may feel a little bit empty? And I think this is something that we worried about in the -- for Battlefield in the past. So, what can we do as we think about sequels and follow-ups generally? Does this mean that things need to spend more time and development for that additional content? How should we think about that? Thanks.\n\nAndrew Wilson -- Chief Executive Officer\n\nYeah, it's a really good question, and I appreciate you using Sims as an example, but I think the question is probably broader than just The Sims. And I would say that there's not a one-size-fits-all answer to this question. Certainly, as we think about some of our iterative titles that we do each and every year, our objective is to build enough content and enough innovation and enough creativity that delivers extraordinary value for the amount that our community invest in each of those titles. And we have been very successful in doing that, and we commit many hundreds of people on those franchises to ensure that we deliver all of those things, particularly value to our community, to fulfill the expectations they have for what a new title would bring.\n\nWe have other things like the titles that come out of BioWare that really is about giving them time to build out these worlds and create these characters and tell these stories in a new innovative and creative way. Without using The Sims as an example, but using things like Skate as a potential example and maybe others in our franchise, there's also an opportunity, in some cases, to have an existing experience continue while layering in a new modality of that experience on top. And certainly, what we're going to see with Skate is you're going to be able to get in there and you're going to be able to skate and do all the things that we've been able to do in Skate games in the past. But there's a whole new modality around creation and social connection, that's going to be a meaningful part of that game going forward.\n\nAnd so, to answer your question, I think that we're looking at every franchise in its own stead, and we're asking ourselves, \"What is the right thing to do with respect to this franchise?\" Some of -- for our iterative franchise is about getting just the right amount of people into a team to deliver innovation and creativity, for some like our BioWare franchise is about giving time to really build out these worlds, characters, and storylines. And for other franchises like Skate, and certainly, as we think about the future of Sims, it's how do we hold on to all of the goodness of the existing franchise and layer in new modalities and extensions of how you play these games for a growing and changing and evolving diverse community around the world.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nNext question comes from Doug Creutz from Cowen and Company. Please go ahead. Your line is open.\n\nDoug Creutz -- Cowen and Company -- Analyst\n\nHey, thanks. I was wondering if you could talk about Wild Hearts a little bit. I think, normally, when you guys have partner titles, they tend to be lower-priced in these titles. But this, I think, correct me if I'm wrong, is coming to market at a $70 price point.\n\nSo, should we think of the opportunity set here the way that we would think about it for a AAA title sort of in general? And is this a game you think has franchise potential down the line? Thanks.\n\nAndrew Wilson -- Chief Executive Officer\n\nYeah. So, first thing I would say just to differentiate there, I think what we have had is EA Originals, which were lower-priced titles, this was an initiative that we developed some years ago really to support the indie community and the industry growth opportunity overall. What we were seeing in the industry was these indie developers were kind of building these very cool games. They didn't have the means to get into market in a big way and they didn't have the ability to continue on because the business model wasn't working for them at least for their first title.\n\nAnd what we did at that time was go into the community and say, \"All right, let's handpick some really great teams who are building some really cool games around really cool IP. Let's help -- let's fund development for them. Let's get them distribution and let's give them the profits on the back end so that they can come together and build an even bigger game the second time around.\" Most of those have been smaller, lower-priced titles. However, in the history and -- I've in this company 22 years, we have a long and rich history of co-developing, co-publishing, and distributing AAA full-priced IP, all the way back for as long as I can remember.\n\nWe don't do as much of it anymore just because there's not as much of it out there that we think really fits the bill and is a AAA quality bar that we believe can deliver against the expectations of these global communities at a full price point. We think Wild Hearts is one. I mean, I would tell you, it started with what felt like a pretty small idea for us internally. And every time we saw the product, we were wowed and mesmerized by what they were doing.\n\nThe Monster Hunter genre is a relatively new genre. It exploded. It is ripe for innovation and creativity and expansion, and what we see the team doing is all of the things that the community is asking for in the genre. And so -- and the response so far has been really, really strong.\n\nAnd so, I don't want to get out over my skis on this one. But I would tell you, I saw it. I think it's incredible. The community has seen it, they think it's incredible.\n\nHow big it can be, we don't quite know yet. But I think there's a path for this to be a really, really cool opportunity for us, for the development team, and for the community at large.\n\nDoug Creutz -- Cowen and Company -- Analyst\n\nThanks, Andrew. That's very helpful.\n\nOperator\n\nOur last question will come from Colin Sebastian from Baird. Please go ahead. Your line is open.\n\nColin Sebastian -- Baird -- Analyst\n\nGreat. Thanks. I have a couple of follow-up questions. I guess first, Andrew, I just wanted to talk about the approach to World Cup this year, how that differs from the prior cup given some of the challenges last time around on the core franchise.\n\nAnd then on live services, if you wouldn't mind providing a little more color on engagement and monetization trends for Apex, just given this has been such a big part of the portfolio growth over the past few years. Are you satisfied with the trends there? And how do you expect those KPIs to trend with the launch of new content this quarter? Thanks.\n\nAndrew Wilson -- Chief Executive Officer\n\nYeah. Let me grab the first part around World Cup, and then I'll let Chris speak to kind of engagement trends and those types of things around Apex. First, I might challenge the idea that we had troubles with the World Cup last time. But I might be biased on that front.\n\nAgain, I think we brought in and brought back about 12 million players back into the franchise with World Cup content. It was one of our highest engagement opportunities of that year. I think there may have been externally some expectations on higher revenue at that time. What you might remember we talked about was we believed it was a really strong engagement opportunity.\n\nWe use it to bring people into the franchise and back to the franchise, and we projected and predicted that it would drive growth in the out years beyond the World Cup. And of course, that has happened each and every year since that World Cup. So, we feel really, really bullish on what this World Cup can do for us. What I would say without going into broad details is it is more deeply integrated into the mode.\n\nIt was more kind of an add-on adjunct to the product last time. It was very cool. It was great content. It was World Cup.\n\nWhat we -- what the team has done this time is we take that content and embed it more deeply into the overall experience of the game. And our expectation is that while it will bring people into the franchise and back to the franchise, it will also drive even deeper engagement over time. And we think that is good for the long-term prospects of the product, particularly as we launch FC next year to build and grow that community to its absolute greatest possible point at this juncture is a great opportunity for us.\n\nChris Suh -- Chief Financial Officer\n\nGreat. And I'll jump in, Colin, and talk a little bit about our engagement. As we've talked about on this call, we're seeing -- we're in this enviable position of seeing healthy engagement trends across the breadth of our business. We talked a lot about FIFA.\n\nBut Apex is another one where we're very pleased with the state of player engagement with Apex. We've grown that business, as you know, in a very short period of time into a substantial business. As Andrew talked about, it's one of the great IPs and entertainment. We're seeing very stable engagement.\n\nWe continue to grow the franchise. We feel great about upcoming releases of new innovation into the game. It continues to be an important franchise for us, and we'll continue to invest behind it as well as feed growth now and into the future.\n\nAndrew Wilson -- Chief Executive Officer\n\nBut today, I was going to say the same thing. Thank you to all for being with us today.\n\nOperator\n\nAnd that's all the time we have for questions. [Operator signoff]\n\nDuration: 0 minutes\n\nChris Evenden -- Vice President, Investor Relations\n\nAndrew Wilson -- Chief Executive Officer\n\nChris Suh -- Chief Financial Officer\n\nMatthew Cost -- Morgan Stanley -- Analyst\n\nBenjamin Soff -- Deutsche Bank -- Analyst\n\nLaura Miele -- Chief Operating Officer\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nMario Lu -- Barclays -- Analyst\n\nAndrew Uerkwitz -- Jefferies -- Analyst\n\nEric Handler -- MKM Partners -- Analyst\n\nStephen Ju -- Credit Suisse -- Analyst\n\nDoug Creutz -- Cowen and Company -- Analyst\n\nColin Sebastian -- Baird -- Analyst\n\nMore EA analysis\n\nAll earnings call transcripts"
}