{
  "companyName": "ConocoPhillips",
  "companyTicker": "COP",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/conocophillips-cop-q3-2022-earnings-call-transcrip/",
  "content": "ConocoPhillips (COP 1.38%)\nQ3 2022 Earnings Call\nNov 03, 2022, 12:00 p.m. ET\n\nOperator\n\nWelcome to the Q3 2022 ConocoPhillips earnings conference call. My name is Richard, and I'll be your operator for today's call. [Operator instructions] I will now turn the call over to Phil Gresh, vice president, investor relations. Sir, you may begin.\n\nPhil Gresh -- Vice President, Investor Relations\n\nYes. Thank you, Richard. And welcome to everyone joining us for our third quarter earnings conference call. On the call today are several members of the ConocoPhillips leadership team, including Ryan Lance, chairman and CEO; Bill Bullock, executive vice president and chief financial officer; Dominic Macklon, executive vice president of strategy, sustainability, and technology; Nick Olds, executive vice president of global operations; Jack Harper, executive vice president of Lower 48; and Tim Leach, advisor to the CEO.\n\nRyan and Bill will kick off the call with opening remarks. After, which the team will be available for your questions. Just a few quick reminders. First, along with today's release, we published supplemental financial materials and a presentation, which you can find on our investor relations website.\n\nSecond, during this call, we'll be making forward-looking statements based on current expectations. Actual results may differ due to factors noted in today's release and in our periodic SEC filings. Finally, we will make reference to certain non-GAAP financial measures. Reconciliations to the nearest corresponding GAAP measure can be found in today's release and on our website.\n\nWith that, I'll turn the call over to Ryan.\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nThank you, Phil. Before we get into our strong results for the quarter, including record production, I'd like to touch on a few big-picture thoughts that are top of mind for us. First, inflation and supply chain constraints continue across the entire economy and our industry. This is particularly true in the U.S.\n\nshale, where rapidly escalating costs, combined with extremely tight supply, are limiting the pace of industrywide production growth. Second, we believe that the world is going to need investments in medium- and long-cycle production, in addition to U.S. shale plays. The depth and quality of our U.S.\n\nunconventional inventory, combined with our diverse global portfolio, has us well-positioned to meet these long-term supply challenges. And finally, a successful energy transition must meet society's fundamental need for a secure, reliable, and affordable energy while progressing to a lower carbon future. This requires an all-of-the-above solution. Obstacles that prevent the global market from functioning properly are not going to help the American consumer and would be disastrous for our allies.\n\nGovernments can help by enacting policies that encourage investments in developing lower-emission oil and gas resources that will be needed to get the world through the transition. This includes fiscal stability, streamlining permitting, and supporting critical infrastructure for an all-of-the-above solution. Now, against this backdrop, we believe that ConocoPhillips is well-positioned to win in any environment. We remain committed to delivering on our triple mandate of responsibly and reliably meeting energy transition, pathway demand, delivering competitive returns on and off capital, and progressing toward achieving our net-zero operational emissions ambition.\n\nAs further evidence of this commitment, our third quarter results demonstrated record total company production. Lower 48 production hit a milestone in over 1 million barrels of oil equivalent per day, and we anticipate further growth in the fourth quarter. On returns, we generated a trailing 12 month ROCE of 27%. We increased our ordinary dividend by 11% to $0.51 per share.\n\nAnd we announced a $0.70 per share VROC for the first quarter of 2023, and we increased our share buyback authorization by $20 billion. Additionally, we'll return 15-day in the capital for 2022, which represents over 50% of our projected CFO, well in excess of our greater than 30% annual commitment. Now, we believe that our CFO-based returns framework differentiates us relative to peers. And finally, our net-zero operational emissions ambition.\n\nWe recently announced a new medium-term methane intensity commitment consistent with our recent objectives of joining OGMP 2.0. From a strategic perspective, I wanted to provide an update on our global LNG initiatives. First, we were recently selected to participate in Qatar's North Field South project, following our selection earlier this year to participate in the North Field East, which adds to our long positive relationship with QatarEnergy. Second, we agreed to terminal services for a 15-year period at the perspective Britain's vital LNG import terminal in Germany.\n\nAnd third, we continue to progress our Port Arthur LNG project with Sempra, which we expect to reach FID by early next year. Overall, we continue to believe the substitution of natural gas in place of coal represents an opportunity for significant reductions in global greenhouse gas emissions. This should drive global LNG demand and related opportunities well into the future. Putting this all together, we remain constructive on the outlook for the industry.\n\nAnd we have a deep portfolio of short, medium and longer cycle, low cost to supply assets that generate strong cash flow as we continue to deliver on our triple mandate. Now, let me turn the call over to Bill to cover our overall performance for the quarter.\n\nBill Bullock -- Executive Vice President and Chief Financial Officer\n\nWell, thanks, Ryan. From a financial standpoint, we had a solid third quarter. We generated $3.60 per share in adjusted earnings. Production was over 1,750,000 barrels of oil equivalent per day, which included our previously guided approximately 15,000 barrels of oil equivalent per day impact from scheduled turnarounds, as well as some impacts from the temporary force majeure in Libya in July.\n\nFor the fourth quarter. We do not expect any material turnaround impacts. Lower 48 production averaged a record, 1,013,000 barrels of oil equivalent per day, including 668,000 from the Permian, 224,000 from the Eagle Ford, and 96,000 from the Balkan. Cash provided from operating activities was $8.7 billion.\n\nNow, this included a $15 billion benefit from working capital, primarily due to the timing of Norway tax payments and lower receivables. Excluding working capital, cash from operations was $7.2 billion. AP LNG distributions were 257 million in the quarter. And we expect fourth quarter distributions to be about $600 million.\n\nOn capital, we invested 2.5 billion back into the business in the third quarter, including around 300 million for acquisitions. This resulted in free cash flow of 4.7 billion, which more than covered the 4.3 billion we returned to shareholders in the quarter. Factoring in 400 million in disposition proceeds, ending cash and short-term investment were $10.7 billion at September 30th, up from 8.5 billion at June 30th. Turning to guidance, we still expect full year production of 1.74 million barrels of oil equivalent per day with a fourth quarter guidance range of 1.74 million to 1.8 million barrels of oil equivalent per day.\n\nOn cost, we've increased full year adjusted operating cost guidance to 7.7 billion from 7.5 billion. This is driven by inflationary impacts. We have also increased full year organic capex to 8.1 billion from 7.8 billion, also driven by inflationary impacts and partner operator working interest. Partially offsetting these increases, we have reduced full year DD&A guidance from 7.6 billion to 7.5 billion.\n\nIn terms of 2023 guidance, we anticipate providing full details with our fourth quarter earnings call in early February. We will also be hosting an analyst investor meeting next spring at the New York Stock Exchange. So, please stay tuned for more details. With that, I'll turn the call back to Ryan.\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nThank you, Bill. Now, before we go to Q&A, I wanted to spend a minute discussing a few important organizational announcements. First, Jack Harper, our EVP of Lower 48, informed me that he will be leaving the company due to a family medical situation. I know I speak on behalf of the entire organization when I say that Jack will be greatly missed.\n\nNow, in conjunction with this announcement, Nick Olds, who is currently our executive vice president of global operations, will become the executive vice president of Lower 48; and Andy O'Brien, currently our vice president and treasurer, will become senior vice president global Operations and join the executive leadership team. Now, with that, I'd be -- I wanted to turn the call over to Jack and give him the opportunity to say a few thoughts.\n\nJack Harper -- Executive Vice President, Lower 48\n\nThanks, Ryan. As Ryan mentioned, I will be leaving ConocoPhillips due to a family medical situation. It has truly been a privilege to work for both Concho and ConocoPhillips over the past 16.5 years. When Concho agreed to the merger with ConocoPhillips, we did so because we believe that the transaction would create a uniquely strong and differentiated company.\n\nAnd I could not feel better about how this has played out. This may be one of the most dynamic times that we've ever seen in the industry. And my competitive side certainly makes me wish that I could stay on board for what is ahead. However, I'm confident that we have set up the team for success with our organizational structure and planned transition over the next few months.\n\nWith that, let me turn the call back over to Ryan.\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nThanks, Jack. And I know I speak for everybody at ConocoPhillips. We have you and your family in all our prayers. So, with that, let me turn it back over to Phil, and we'll get going with the Q&A.\n\nPhil Gresh -- Vice President, Investor Relations\n\nAll right. Thanks, Ryan. Just as a reminder, we ask that you ask one question and one follow up. And with that, Richard, I'll turn it back to you.\n\nOperator\n\n[Operator instructions] And our first question on line comes from Neil Mehta from Goldman Sachs.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nGood morning, team. Ryan, I want to kick off with you on the LNG strategy. And we've seen a lot of interesting individual announcements, but maybe you could pull it all together and talk about how you see these coming together for how Conoco thinks about LNG as a part of its portfolio. And as it relates to that, maybe you could talk about risks around long-term LNG as we have a lot of new supply coming in from Qatar in the U.S.\n\nby the middle of the decade. And do you worry about spending on these projects into what could be a sloppier market toward the end of the decade?\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nNo, thank you, Neil. I appreciate the question. Yeah, I think for some context around the company, you know, we've been involved in LNG for a long, long time. You think about our liquefaction technology that we have that's been used by many, many operators around the world today.\n\nWe effectively started this business back in the '60s with our project up in Kenai and delivering, you know, 40 years of gas to our Japan marketing friends. So, we've been in this business for a long time. And then, when you look at the transactions that we've done over the last couple of years, you know, we have a growing resource position in the U.S. So, creating more demand and -- just makes a lot of sense coming out of out of the U.S.\n\nSo, as we step back and we started thinking about it, combined with our views of the energy transition and the view that LNG is going to be a necessary fuel that can become replace coal, similarly, the way that gas has done that in the United States and reduce the emissions profile in the U.S. So, we think this is something the globe is going to be needing as we go through this energy transition. So, you put all that together. And we said back over a year ago and said this was a piece that we wanted to grow in our portfolio.\n\nSo, it started with the opportunity at AP LNG. We picked up some more interest there. Then, we got named in the North Field expansion project, and then more recently here, in the North Field South. And then combined with wanting to do something in the U.S.\n\nto take advantage of a position that we have here and develop more demand for the product in the U.S., we looked at who we thought was the best positioned with permits and opportunity. And that's when we decided to join up with Sempra. And as you've seen, we expect to reach out by the early next year at Port Arthur. And that gives us some optionality also on there -- the West Coast of Mexico opportunity that they have as well.\n\nSo, when we looked at all this, trying to build this business for the long term, and complemented now by our German regas opportunity that we've entered into. So, we want to get into that full value chain. We've got a great commercial organization that can optimize around this. And we just think this is going to be a business that's going to be long term and going to be substantial well into the future.\n\nNow, it's going to be -- there's going to be periods of time when supply exceeds demand and when the demand exceeds supply. And that's more to your point. There may be a period coming later this decade for, you know, a year or two, where, you know, the pricing maybe get a little soft because of a lot of projects are coming in. But again, we're entering in this in the 20- and 30-year contracts.\n\nSo, we just have a long-term view that this is going to be a really good business and one that ConocoPhillips can excel at, given our history and the capability inside the company. And we expect to want to try to build more of this business over time.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nYeah, that's really clear, Ryan. The follow-up is just on capital spending for 2023, recognizing we're going to get more thoughts sounds like here in in February on it. But if we took the 8/1 as the starting point, what are some of the moving pieces as you go into '23 that we can break off of?\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nYeah, Neil. I would -- I guess I would start by saying I'd probably take the last half of this year, that kind of pace, annualize that for our base business. As we think about that going into 2023. We're not looking at trying to add scope into our Lower 48 operation, given the kind of environment on inflation that we see.\n\nSo, starting there, we'll assess what we think inflation looks like for next year. And importantly, we'll assess what our partners are doing in terms of the scope that they're trying to execute that we have to fund our share of. So, those are some unknowns that we're going to. But I'd say take the base business, which is kind of ratable off the second half of this year as you think about going into next year.\n\nAnd then the new businesses that we're trying to grow and expand and develop the company around, you know, NFE and NFS, the two Qatar projects, we'll be funding that next year. Again, we hope to reach FID at SEMPRA, so some funding associated with that next year. And then finally, Willow, you know, we hope to be getting into some construction activities next year with Willow. Obviously, we won't do that until we have a permit in place that allows us to go start up the funding of that project.\n\nSo, that's the base business. And those are the kind of adders as we look into 2023.\n\nPhil Gresh -- Vice President, Investor Relations\n\nAll right. Thanks, Neil.\n\nOperator\n\nThank you. Our next question on the line comes from Stephen Richardson from Evercore ISI.\n\nStephen Richardson -- Evercore ISI -- Analyst\n\nThank you. Ryan, I was wondering if you could maybe talk a little bit about how you're thinking about the cash return envelope for '23. Just acknowledging there's a lot of variability in the environment, but obviously, you've had a really strong year this year. And then you talked last quarter about how we're trending kind of closer to, you know, 50% of cash flow from ops.\n\nCertainly, a lot higher than your baseline. And so, I think we get this question a little bit. It's just how do we think about '23 with the moving parts, acknowledging what you just talked about with capital and the environment is uncertain? But if we have the environment that we have today in the next year, I was wondering if you can maybe talk about how you're thinking about that.\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nYeah. Stephen, I think if we have a macro environment today that's similar to next year, that's similar to the average over the course of 2022, I think you should expect a similar level of distributions. And I think we, you know, signaled that a little bit with setting the first quarter of VROC at $0.70 a share. You know, that this 10 seconds, we look at the macro.\n\nAnd if it's going to be similar next year, you ought to expect a similar level of distributions, which is in excess of our 30% commitment. But, you know, we're going to watch the macro because we think it's going to be incredibly volatile. But we think we've got the right value proposition and combination of VROC, base dividend, and how we're thinking about buying our shares back, that it's well set up for the kind of volatility we may see. But that would be sort of my comment as you think about going into 2023.\n\nIt's a function of the macro, which is, you know, reasonably strong right now.\n\nStephen Richardson -- Evercore ISI -- Analyst\n\nThat's great. Thank you. Maybe just to follow up on -- on the Lower 48, obviously, you've had some really, really strong results, and can't say the same of what we've seen in some of the productivity updates from, you know, elsewhere in the Lower 48 across the industry this quarter. I was wondering if maybe you could talk a little bit about performance versus just, you know, the timing of wells and kind of how you're seeing the program evolve, particularly in the Permian, where, you know, the Lower 48 numbers were really impressive this morning.\n\nJack Harper -- Executive Vice President, Lower 48\n\nYeah. Thanks, Stephen. This is Jack. Yeah.\n\nYou know, the production is back half loaded like we've been talking about. I hope you saw that in the quarter with the progression. We've also seen our OBO plans, our partners targeting increasingly longer laterals than we first anticipated, which, of course, yields a lower cost of supply and more economic return. In the Lower 48, we do expect to see continued, you know, growth, as Ryan mentioned in the fourth quarter.\n\nAnd the Permian should modestly exceed that kind of low single digits that we expect out of the Lower 48. In terms of well productivity and our plans are progressing as we have planned, we monitor this very closely internally and with our peers externally and really like where we stack up.\n\nPhil Gresh -- Vice President, Investor Relations\n\nGreat. Thanks, Stephen. Next question?\n\nOperator\n\nThank you. Our next question on the line comes from Doug Leggate from Bank of America. Please go ahead.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nHey, good morning. And, Jack, I wish you well, and I hope our paths cross again at some point. Good luck. I have got two quick questions, if I may.\n\nBill, I wonder if I could do first with the deferred tax in the quarter. I think we've heard you talk in the past about when you would hit, you know, full cash tax in the Lower 48. Has that been delayed somehow? Or maybe you could just walk through what happened in the quarter. It's quite a big deferred tax number, which we're happy to see, obviously.\n\nBut any updated guidance would be appreciated.\n\nBill Bullock -- Executive Vice President and Chief Financial Officer\n\nYeah, sure. Happy to, Doug. So, first up, the increase in third quarter tax rates on earnings reflects a shift in our geographic mix of earnings, primarily due to an increase in Norway's pre-tax earnings. And you'd expect that given the high gas price environment we're seeing in continental Europe.\n\nSo, as you know, Norway's a fairly high tax environment. So, you've seen our effective tax rate increase from 39% in the third quarter from 32% in the second quarter. Now, moving forward, I'd expect our effective tax rate to be in the mid- to upper-30s range, assuming a similar production level and that pricing falls with the forward curve. I noted the --\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nGo ahead. Thank you.\n\nBill Bullock -- Executive Vice President and Chief Financial Officer\n\nYeah. As you noted, the deferred tax for the quarter was a source of cash of just over $700 million. And I'd expect the deferred taxes to be a source throughout the year. We did enter a tax cash paying position in the U.S.\n\nin the second quarter. And we're now in a cash tax paying position in most of our jurisdictions around the world. So, assuming that prices and our capital program stays around current levels, I think you could see deferred tax to remain a modest source of cash, though cash taxes should be more close to our book taxes over time. And I do think it's important to note that trying to forecast deferred taxes and estimating cash tax ETR on a quarterly basis is pretty tough.\n\nIt can be impacted by a number of items in any given quarter. So, I'd really encourage you to think about that as our effective cash tax rate across an annual time period. And I expect that to be getting closer to what we're seeing our effective tax rate on an income basis.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nI understand the point about mix, and that's actually really helpful. So, thank you. I guess my follow-up, my question is on the Permian takeaway. We're obviously seeing a lot of volatility around Waha.\n\nBut you guys have obviously had a lot of changes in your portfolio. Could you just give a quick refresh to what your takeaway looks like? I guess the differential widened a little bit this quarter on utilization. So, we're trying to get a handle on that. I'll leave it there.\n\nThank you.\n\nBill Bullock -- Executive Vice President and Chief Financial Officer\n\nYeah, sure. So, as you know, we're a large, globally diverse MP, so the overall cash flow impact from the Waha pricing differentials that we've seen this last quarter was relatively immaterial for us. But that said, in our presentation materials, our realizations and Lower 48 relative to Henry Hub decreased by 6% from 96% in Q2 to 90% in Q3. And that's primarily driven by lower Permian in-basin month average prices in September relative to Henry Hub.\n\nWhen we look at it based on foreign markets, we'd expect to be in the upper 70s to low 80s as a percentage of Henry Hub for the fourth quarter. So, there's a lot of volatility around that, Doug, with what we're seeing in the market right now. And I'd expect that volatility is going to continue until we see the additional Permian takeaway capacity come online later in 2023. And I guess the only thing that just as a reminder, we're the second largest gas market in North America.\n\nWe've got a really strong market position that's multiples of our portfolio, and we think that's really beneficial in this situation. We've worked hard to build our gas marketing capability in the Permian following acquisitions, and we leverage that to ensure we've got flow assurance through these pricing events. We're really very confident with our in-basin flow assurance that we've got sufficient take away to manage through the short- and medium-term capacity constraints. So, for ConocoPhillips, this is essentially a price issue, not a flow issue.\n\nPhil Gresh -- Vice President, Investor Relations\n\nGreat. Thanks, Doug. Next question.\n\nOperator\n\nThank you. Our next question comes from Jeanine Wai from Barclays.\n\nJeanine Wai -- Barclays -- Analyst\n\nHi, good morning, everyone. Good afternoon and thanks for taking our questions.\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nHi, Jeanine.\n\nJeanine Wai -- Barclays -- Analyst\n\nJack, thanks for the partnership, and we wish you well. So, our first question, maybe just following up on Willow. Can you provide an update on what the latest is on that project? Any high-level commentary on what the moving pieces are relative to the original project, given that there's been a bunch of back and forth on it on the approvals? And I think the -- the last detailed update we got on it was in June of '21. And there was roughly a six-year lead time from FID to first production, and there was about $8 billion capital estimate.\n\nNick Olds -- Executive Vice President, Global Operations\n\nYeah, Jeanine. This is Nick. I'll definitely -- I'll go through that. Maybe as a reminder, I'll just walk back in time a little bit here.\n\nYou know, there was a key milestone that was accomplished in early July, and that was that draft SEIS. The comment period has been completed as well. And as I mentioned in the 2Q call, the draft SEIS put forward a new three-pad alternative, reducing the footprint in that Teshekpuk Lake Special Area. And that is supported by ConocoPhillips.\n\nNow, that addresses and is responsive to the Alaska District Court findings. Now, with respect to schedule, we're still targeting the final SEIS and the supported record of decision by the BLM end of this year. Now, Jeanine, as I mentioned previously, we would only take FID following a final SEIS and supported record decision by the BLM, and we are targeting FID early next year. Now, pending that successful record of decision, we expect to have 2023 capital spend for this upcoming winter season.\n\nAnd that's mainly focused on civil construction. So, that be open up a mine site and laying some gravel roads. Now, again, we won't take FID or make a significant investment until we have a clear path to development. We also continue to do detailed engineering and update our final cost estimates.\n\nI know that you referenced that. We've recently went to market to update our project costs and have seen some inflationary pressures as expected. We're seeing that globally, as well as some of the impacts related to the updated scope due to the BLM's alternative in their draft SEIS. But I want to leave you with this.\n\nDespite all the cost pressures, the project remains very competitive in our $40 cost supply framework. And finally, we'll provide more details on Willow at the market update that Bill referenced for next year.\n\nJeanine Wai -- Barclays -- Analyst\n\nOK. Great. Thank you for all that detail. The follow-up, maybe just sticking with projects here, there's been a lot of investor conversations around Conoco's capital commitments for major capital projects, such as, you know, the Qatar project, Sempra, Willow, etc., and how that really impacts free cash flow and cash returns.\n\nSo, we know that Conoco's cash returns, of course, is on a CFO metric, not a free cash flow metric. But it's all kind of circular in a way. So, we just wanted to check in again on just the level of strategic cash that you want to hold. And is that the same as it was previously? Because I guess post the Concho and Shell Permian deals, you could argue that you don't need to hold as much and then -- but on the other hand, you've got some major capital projects on the horizon that you need to reserve for.\n\nAnd so, you ended the quarter with 10.7 billion of cash, so you have a lot of options there. Thank you.\n\nBill Bullock -- Executive Vice President and Chief Financial Officer\n\nYeah, sure. Jeanine, this is Bill. So, first, based on our four prices, we'd expect to end the year with roughly $10 billion of cash. Also, the same -- roughly the same amount that you noted for the end of third quarter.\n\nAnd that's a -- I know it is predicated on us achieving our $15 billion of distributions to shareholders this year. Now, the framework of how we think about allocation of cash balance really hasn't changed. It's continuing to be guided by our priorities of having a competitive shareholder distribution, strong balance sheet strength, and efficient organic and inorganic capital allocations. And the framework that we've laid out of intending to carry $1 billion for operating cash, $3 billion of reserve cash, and anything above that is strategic cash, continues to be the way that we think about that.\n\nSo, when you think about strategic cash, we think about that for the opportunity to capture value-enhancing opportunities, like you saw us do with the Shell Permian acquisition, is to fund our programs' used cycles and to fund mid- and long-cycle projects. So, the basic way that we think about our cash balances is unchanged.\n\nPhil Gresh -- Vice President, Investor Relations\n\nGreat. Thanks, Jeanine. We're ready for the next question.\n\nOperator\n\nThank you. Our next question comes from Scott Hanold from RBC Capital Markets.\n\nScott Hanold -- RBC Capital Markets -- Analyst\n\nYeah. Thank you. I was wondering if you could go back to shareholder returns and, you know, just give us a sense of how you think about the mix of the shareholder returns. I mean, obviously, there are some companies that are, you know, highly, you know, formulaic, you know, with it.\n\nBut as you look into, you know, sending that VROC for, you know, the first quarter, like, what goes into play when you think of, like, what level you want that set at?\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nWell, I think we try to look at a couple of things, Scott. You know, where the -- where -- obviously where the macros at and project our cash flows forward into next year. And obviously, we're going to meet our 30% commitment. And in these kinds of commodity price, we're well in excess of that.\n\nI think our five-year average is in the mid-40s. And this year we're 50 or more percent of the cash. So, I think, you know, you ought to be thinking about if a similar environment persists into next year, the same level of absolute distributions, as I said earlier. In regards to the channel, you know, again, we want to move on to growing a reliable base dividend that you can count on.\n\nYou can count on through the cycles. It's going to be growable. It's going to be competitive with the best in the S&P 500. And that's what we're trying to do on our base dividend.\n\nWe want to buy some of our shares back. We want to buy through the cycles. We think about, you know, how much shares do we top up to get our 30% commitment at a mid-cycle price that we think about. And then at these elevated prices, we know we're getting more cash, and that's why we introduced the third channel through the VROC.\n\nThe VROC is a combination of cash and shares. And it's got some flexibility because we're monitoring the market. We're monitoring the macro. And we -- as we think about going forward into 2023.\n\nBut we know it's going to be volatile. We could wake up, it could be 80, it could be $120 a barrel. So, you know, that's why the VROC is there to be that variable channel. And we like to top up some of our cash, as well as buy some shares.\n\nAs we think about it, as we set it for the first quarter, you know, that's kind of the ratable amount that we had through the course of last year, which should signal that we're pretty bullish on how we think about 2023.\n\nScott Hanold -- RBC Capital Markets -- Analyst\n\nWell, that's great color. Appreciate that. And actually, before I get to my second question, it just started out with this. But, Jack, you know, all the best to you and your family.\n\nI mean, you know, we've worked together over the past decade plus, so it was a pleasure to work with you all these years, and good luck. You know, but my follow-up question then is, you know, looking at the opportunities that you all have in Norway, you look like you're progressing on Tommeliten and Eldfisk. Now, can you give us a sense? Is that more just a process of just maintaining production out there? Or is there an opportunity really to grow that and, you know, really part of sort of this global, you know, gas opportunity? Because I do believe it's a little bit more gas in a lot of these new developments.\n\nNick Olds -- Executive Vice President, Global Operations\n\nYeah. No. This is Nick. I'll give you a quick update on those developments.\n\nWe've got actually four developments that are in progress, two operated and two nonoperated. You referenced Tommeliten. So, we've got Tommeliten Alpha and Eldfisk North. Both of those are subsea developments that are all tied back to existing infrastructure.\n\nEven the two nonoperated are tied back to existing infrastructure. That means they are very low cost of supply. We're talking in the low-20s, very competitive in the global portfolio. We hit a couple of key milestones here recently as well.\n\nWe just hit our subsea templates on both Tommeliten Alpha and Eldfisk North, and we'll start drilling later this year. All four of those will come online throughout 2024. But the way I view that is probably more offsetting base decline within the greater Ekofisk areas, as well as our partner-operated assets. But again, all four of those are very competitive.\n\nPhil Gresh -- Vice President, Investor Relations\n\nNext question.\n\nOperator\n\nThank you. Yes, sir. Next question comes from John Royal from JPMorgan.\n\nJohn Royal -- JPMorgan Chase and Company -- Analyst\n\nHey, guys. Thanks for taking my question. So, just on the capex increase. If you could maybe give a little bit of color on the split between the NOJV portion of it and the inflation piece.\n\nI mean, I know it's relatively small overall, but that might be helpful. And then, on the nonoperated JV piece, is there any way to think about your exposure there in the Lower 48? Maybe a percentage of production or a percentage of capex or anything that could help us there.\n\nDominic Macklon -- Senior Vice President, Strategy, Sustainability and Technology\n\nHey, John. It's Dominic here. Just in this -- the split of capital in terms of the increase of 300 million, 200 million is really related to inflation and then about 100 million related to a change in working interest. We're seeing in our OBO well mix.\n\nAnd, you know, I think probably, we're seeing some of our partners maybe doing a little bit of capital management and shifting their own working interest down. And that's causing us to go up a bit. But there's still good well. In fact, I'll maybe just ask Jack to comment a little bit on what we're seeing on our OBO program there.\n\nJack Harper -- Executive Vice President, Lower 48\n\nYeah, we're very pleased with the results we're seeing. And as I mentioned before, we have some longer lateral development going on in that OBO program. Some of those wells will cross over into next year and hopefully provide a little bit of momentum.\n\nJohn Royal -- JPMorgan Chase and Company -- Analyst\n\nYeah, that's helpful. Thank you. And then, maybe just switching over to LNG. A little bit of color will be helpful in the Western Mexico opportunity with Sempra and how that could take shape and how we should think about potential timing there of you're getting involved relative to the 1Q target that I think Sempra has put out there for the Port Arthur FID.\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nYeah. I think the West Coast, John, is longer dated. And that's an option we have to participate in expansion of that facility that is currently operating today. And it would be -- I think they're converting the regas portion of that into a small liquefaction plant and looking at some expansion opportunities.\n\nSo, our heads of agreement, our HOA that we have with Sempra gives us the opportunity to participate in that down the road when -- if and when they decide to build another train at that facility.\n\nPhil Gresh -- Vice President, Investor Relations\n\nThanks, John. Next question.\n\nOperator\n\nThank you. Our next question on line comes from Ryan Todd from Piper Sandler.\n\nRyan Todd -- Piper Sandler -- Analyst\n\nGreat. Thanks. Maybe a follow-up on one of your earlier comments. In the Permian, it sounds like you're saying that at least for now, the plan for 2023 would be to largely keep activity levels flat with the second half of 2022.\n\nIf that's the case, any early thoughts on what the trajectory would be for Permian volumes during 2023? And maybe are you seeing any -- is it just a pricing issue? Or are you seeing tightness in the base and that's challenging your ability to execute anything that you'd like to?\n\nNick Olds -- Executive Vice President, Global Operations\n\nYeah, Ryan, we're very happy with our execution out there and feel that it's prudent right now to keep a steady amount of activity going into next year. And, you know, I would say, our internal plans this year and going into next are very consistent with our long-term outlook on production out of the Permian in the Lower 48.\n\nRyan Todd -- Piper Sandler -- Analyst\n\nGreat. Thanks. And then maybe just a follow-up on the cash returns. I mean, your position on the dividend has, you know, always seemed a little more reflective of your view on sustainability of the longer-term outlook.\n\nGiven the sizable dividend increase, can you talk a little bit about -- you know, maybe the read-through of your outlook on commodities in sustainability longer term, is this -- you know, has your longer term view improved? And is that reflected in a nice uptick in the dividend?\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nYeah, Ryan, I think we'll get a chance to talk more about that in our analysts meeting that we have that we talked about early in the spring of next year. But, yeah, basically it's a longer-term view given the dynamics that are going on the market today. We've had a certain mid-cycle price that we've talked about over the last four to five or six years. And I think it is reflective that we think, you know, that mid-cycle price has moved up a bit.\n\nAnd so, as a result, we can afford, you know, more base dividend and reflective of the raise that we announced here in the fourth quarter.\n\nPhil Gresh -- Vice President, Investor Relations\n\nThanks, Ryan. Next question.\n\nOperator\n\nThank you. Our next question online comes from Paul Cheng from Scotiabank.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nHey, guys. Good morning.\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nGood morning, Paul.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nThe first one, maybe go back into the split between dividend and buybacks. In the third quarter. Your split is about 65% in buybacks, 35% in dividend. If we're looking into the future, is that a reasonable proxy that how should we look at it, or that we can't really be prudent and saying that, OK, that's may be what you guys are going to do? So, that's the first question.\n\nSecond question is on the Qatar LNG that -- congratulations, you're getting to the north and south. Is there any capital number that you can share? I think in the North Field expansion, your share of the commitment is about 900. And given the, you know, the same -- say, 1 million [Inaudible] here. So, should we assume they're similar? And also, whether that the terms between the North Field South and North Field expansion are basically the same.\n\nIs there anything that maybe you can share? And also, that when the spending on North Field South will kick in because that, I don't think, will come on stream until 2028.\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nYeah. Paul, let me try to take those. I may call a friend with Nick through part of that. So, yeah, I think the first part split, I think, you had on the way we think about -- I think that was VROC, so between share buybacks and dividends.\n\nI think the split that we've historically have, you mentioned 35-65. I think those are reasonable up to like a 50-50 split between cash and share buybacks is how we normally think about the VROC. But that, you know, that's subject to change based on how we see the macro and kind of how we see it. But nominally, that's probably not a bad place to start.\n\nWith respect to Qatar LNG, I think the North Field South trains are going to be replicated from the North Field expansion trains. So, relative to the same amount of capital, maybe adjusted for your view of inflation because they will be a little bit later starting. But yeah, they're going to be the same scope, same size, and exact same kind of train. So, that's how we think about it.\n\nVery similar to the North Field expansion project. And then -- was the last one on cutter? Oh, the timing. Yeah, you're right. On the timing, I don't think there is much capital in the next couple of years associated with NFS.\n\nAnything you'd add, Nick?\n\nNick Olds -- Executive Vice President, Global Operations\n\nYeah. Just to add, Paul, just on -- as we talked about in the Q2 call, remember North Field expansion, that total net is 900 million for us. We will have catch-up payments. And so, once the condition precedents are set, we'll reverse QatarEnergy for COP share in those NFE project costs.\n\nThat could have happened early next year or even late this year. Again, 900 million net total for the project. Start up again for NFE is 2026. And then, NFS will probably follow a year later.\n\nPhil Gresh -- Vice President, Investor Relations\n\nThanks, Paul. Next question.\n\nOperator\n\nThank you. Our next question comes from Raphael DuBois from Societe Generale.\n\nRaphael DuBois -- Societe Generale -- Analyst\n\nHello. Thank you very much for taking my questions. Seeing from this side of the pond, it looks like there is a bit of a trade-off between the industry increasing production or face windfall tax and/or extra tax on distribution. Can you maybe explain what projects you could sanction if you were better incentivized to increase production? Are there any resources that you could monetize faster if you received that some sort of guarantee from the U.S.\n\ngovernment in terms of permitting, as you mentioned in your remarks, or in terms of tax stability? That would be my initial question.\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nYeah. Thanks. I think, you know, we're already growing our company. I think we're faced with some other issues in the short term around labor shortages, supply chain, and inflation.\n\nThey're probably dictating the pace of the industry. I think, generally, your question relates to a medium and longer-term outlook. Eventually, more infrastructure is going to need to continue the growth in the development of the U.S. shale and then more infrastructure needed for growth up in Canada and maybe even for exporting some of the product down into Mexico and Central America.\n\nSo, I think that's the issue we have with the policy choices that this administration is making. And things they could do to help is give more certainty on the long-term permitting and just the fiscal stability to make sure that, you know, we don't have large changes in the tax structure coming because these project takes -- these projects have cycle times and years associated with them and the more risky part in the front end, the less certainty you're going to have on executing some of that. So, that's why my remarks were around certainty, around the fiscal stability. You know, the whole conversation around windfall profits taxes is not a helpful conversation right now.\n\nAnd then more certainty around permitting. And I would add on the permitting, if you want an energy transition, you need this permitting as well. Certainly in the U.S. You need the permitting for onshore and offshore wind, for solar installations, for high-voltage transmission lines.\n\nSo, permitting relief is required if you want any chance of going through an energy transition and in having the support of trying to execute an all-of-the-above energy strategy. So, I think these are really important topics as we think about the next, you know, three or four or five years, and in the next decade or two for our business.\n\nRaphael DuBois -- Societe Generale -- Analyst\n\nGreat. Thank you very much. And my second question is, TotalEnergies has recently announced that they will spin off their holdings in Stormont and Fort Hills. And I was wondering if you could tell us what it may change for the way Stormont is run and whether it's something you could also consider to lower your GHG emissions intensity.\n\nNick Olds -- Executive Vice President, Global Operations\n\nYeah, Raphael, maybe I'll start with, you know, the way we look at Stormont is obviously we value Stormont greatly. It's a low cost of supply, low-capital intensity asset that's in our diverse portfolio. Again, it offers up stable, level-loaded production with a significant resource position out there. We've continued to transform that asset through technology applications, piloting emission reduction opportunities, including, I don't know if you follow this, joining the Pathways Alliance, which is, you know, six likeminded companies coming together to lower emissions from overall oil sands industry, net-zero by 2050.\n\nThe asset continues to perform extremely well. Actually, back in September, we hit a record production day of 158,000 barrels a day growth. So, we see this as, you know, staying in the portfolio. With respect to Total's SpinCo or NewCo plans, we're continuing to understand what that looks like.\n\nAnd I can't comment further beyond that.\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nI would say, Raphael, it does nothing for global emissions what Total is trying to do.\n\nPhil Gresh -- Vice President, Investor Relations\n\nThanks, Raphael. Next question.\n\nOperator\n\nThank you. Our next question on the line comes from Jeoffrey Lambujon from Tudor, Pickering, and Holt.\n\nJeoffrey Lambujon -- Tudor, Pickering, Holt and Company -- Analyst\n\nGood morning, everyone, and thank you for taking my questions. My first one is just on portfolio management on the acquisition strategy. I know you've talked about bolt-on as more of the focus, and we're obviously seeing that quarter to quarter. But I wanted to get any updated views you might have on the environment as you see it for larger deals, particularly for upstream assets in the Permian.\n\nI know that, you know, the cost of supply framework continues to be kind of the focal point in assessing those in terms of what opportunities would need to hurdle. But anything you'd say just around, you know, what you see today and where your bolt-on appetite might be, particularly the Permian, would be great, just given the position you've assembled there over the years.\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nYeah, maybe I can start, and I'll ask Jack to comment on it as well because I know his team has been very active in this space over the last year, year and a half. We continue to look for opportunities to bolt-on acquisitions. We mentioned one. It was a smart opportunity in the Eagle Ford to core up what we were doing there.\n\nSo, we went ahead and ended that. But a lot of focus was going on what we're doing in the Permian. And let me let Jack kind of describe a little bit about what we're doing there.\n\nJack Harper -- Executive Vice President, Lower 48\n\nSure. Thanks, Ryan. Yeah, we're always opportunistically looking to add to our core areas. And as we've talked about in previous calls, we find the highest value right now in swaps and trades.\n\nThe team has completed about 20 of these. And that approach is at 30,000 acres or so in court of land that allows for longer lateral development and lower cost of supply development. So, in addition to those 20-ish deals, we have about that many or more in the pipeline.\n\nJeoffrey Lambujon -- Tudor, Pickering, Holt and Company -- Analyst\n\nPerfect. Appreciate that. And then, lastly, just on the disposition side, I think the last time you'll tallied up what's been done since setting the target for the end of next year was with last quarter's earnings about 2.4 billion. With the noncore sales and today's press release, the incremental of that, was that included? And then, I guess bigger picture, it seems like Lower 48 noncore positions, you know, represent the main opportunities that it looks like, or at least half, over the recent past.\n\nIs that the right way to think about some of those priorities going forward?\n\nDominic Macklon -- Senior Vice President, Strategy, Sustainability and Technology\n\nYeah, Jeoff, it's Dominic here. Yeah. So, the -- we've sold -- well, since we closed the Contran and the Shell transactions, we obviously wanted to do a little bit of portfolio cleanup. So, we've sold 2.4 billion, as you said, of assets.\n\nAnd that's inclusive of the 0.3 billion this quarter. And, you know, we're pretty pleased about that because that they represent really the property assets we had for sale, typically very mature, low-margin, or high-cost supplies. So, that's assets like Indonesia, the high H2S field in Madden, some legacy assets and central base platform, and so on. So, we've been pleased with that.\n\nWe've monetized those in a strong market. Going forward, I would say, we're really just back into normal sort of high grade opportunity as usual. We're not focused on any target at this point. We're happy with where we are.\n\nYou know, we'll always look for opportunities. So, we're pretty happy that we've basically completed the main clean up that we wanted to do after those two big transactions.\n\nPhil Gresh -- Vice President, Investor Relations\n\nThanks, Jeoffrey. Next question.\n\nOperator\n\nThank you. Our next question comes from Neal Dingmann from Truist Securities.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nThanks for the time. Again, Jack, prayers are with you and your family. Hope all goes well. Ryan, my first question, I guess I would call it for the top news [Inaudible] on shareholder return and capital allocation.\n\nSpecifically, any change to how you are thinking about the shareholder returns versus or specifically the buybacks versus just particularly maybe accelerate your growth opportunities? I say that obviously, given the stock's hit an all-time high and, you know, knowing just the incredible high well opportunities -- high well return opportunities you all have.\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nYeah. Thanks, Neal. No, I think, you know, we've tried to describe that in the release. We feel like, you know, obviously, we could ramp more in the Lower 48.\n\nBut in this environment, it just doesn't make sense to be doing that right now. We just want to run efficient, stable programs right there. We do have opportunities to invest in more medium- and longer-cycle projects. We describe those around Willow and Sempra, and then the Qatari projects as well.\n\nSo, you know, we are leaning into -- you know, we're going to need to supply long term as an industry. And we think these are important, and we believe our company, with our global diverse portfolio, has the kind of opportunities that are low cost to supply, fit our GHG emissions intensity profile, and our reductions that we're trying to make in that particular area. And these are going to be needed assets that we want to invest in to ensure that the supply is there long term.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGreat to hear. And then my second question, probably for Jack. On the Permian and specifically the former Shell assets now purchased, I guess it was about a year ago. I'm just curious to, now, when you look at those how well returns you've seen there, how those are stacking up versus, you know, those initial expectations maybe a year or more ago, and, you know, how you guys are, you know, or if you all are utilized.\n\nAnd I think there was about, what is it, 600 or more miles of pipe there. I was wondering if that's being fully utilized.\n\nJack Harper -- Executive Vice President, Lower 48\n\nYeah. Thanks, Neal. Well, in general, we're very happy with that deal. It's fully integrated.\n\nI think we mentioned last quarter we've started to bring on some of the initial projects with our style of drilling and completion, and that continues. And the results are at least as strong as we had anticipated. And then on the other piece of that, the OBO, as I mentioned before, you know, so far, an upside to the deal has been that we have seen lateral lengths extended by our partners. And that's better for everyone.\n\nSo, we'll continue to do that. But right now, it's completely folded in and business as usual.\n\nPhil Gresh -- Vice President, Investor Relations\n\nThanks, Neal. Operator, I think we have time for one more question.\n\nOperator\n\nThank you. Our next question comes from Leo Mariani from MKM Partners.\n\nLeo Mariani -- MKM Partners -- Analyst\n\nHey, wanted to quickly follow up around some of your prepared comments. You certainly discussed the LNG deals that you've entered into, and you kind of alluded to the fact that there is some nice benefit with your kind of U.S., you know, production base, I guess particularly for the Port Arthur project. Just as you're thinking about that, I mean, do you think there's obviously an ability to kind of fold some of those volumes into that in the next couple of years? And would you anticipate maybe trying to kind of increase some of your gas production as you look out into the middle of this decade to kind of take advantage of that as feedstock?\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nWell, as we said, Leo, in our opening comments, that, you know, we think the gas resource is pretty plentiful in the U.S. You know I don't think there is -- I wouldn't think about it as physical integration between our assets. The market in the U.S. is a big liquid market.\n\nWe want to create -- you know, creating some of this more demand to exploit the resource in the U.S. is a good thing. And that's what we're trying to play. We see the resource in the U.S.\n\nbeing quite substantial. We want to be involved in the liquefaction of that resource, in the shipping, and in the regasification as we move it to higher-value markets around the world.\n\nLeo Mariani -- MKM Partners -- Analyst\n\nOK. That makes sense. And I guess you also talked in your prepared comments about having to kind of start some of this medium-term major project capital in 2023 that we should kind of layer on top of this kind of second half of '22 annualized spend, if you will. You know, is it possible to operating, you know, order of magnitude on this? Are we -- is this major project spend that we're talking kind of in the hundreds of millions? Or potentially, could this be north of a billion?\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nWell, I think it's too early to really -- as Nick described in terms of some of the nuances on Willow. Will we get started? Will we won't? Do we have to do a upfront payment? How big is that for Qatar? So, it's a little bit early for us to be kind of telegraphing what an absolute -- we're just saying, these are projects that make sense for us. We're going to fund them. We're going to lean in on some of these medium- and longer-cycle projects.\n\nWe think the world needs them. And again, that returns back to the shareholder aren't going to suffer because our value proposition is based on CFO. So, it's not based on free cash flow.\n\nLeo Mariani -- MKM Partners -- Analyst\n\nOK, Thanks.\n\nPhil Gresh -- Vice President, Investor Relations\n\nGreat. OK. With that --\n\nOperator\n\nAs we have no further questions, I will turn it over to Phil for closing comments. Please go ahead.\n\nPhil Gresh -- Vice President, Investor Relations\n\nThanks, operator. So, this will wrap up the call today. If you have any questions, investor relations is around. And we appreciate your time today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPhil Gresh -- Vice President, Investor Relations\n\nRyan Lance -- Chairman and Chief Executive Officer\n\nBill Bullock -- Executive Vice President and Chief Financial Officer\n\nJack Harper -- Executive Vice President, Lower 48\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nStephen Richardson -- Evercore ISI -- Analyst\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nJeanine Wai -- Barclays -- Analyst\n\nNick Olds -- Executive Vice President, Global Operations\n\nScott Hanold -- RBC Capital Markets -- Analyst\n\nJohn Royal -- JPMorgan Chase and Company -- Analyst\n\nDominic Macklon -- Senior Vice President, Strategy, Sustainability and Technology\n\nRyan Todd -- Piper Sandler -- Analyst\n\nPaul Cheng -- Scotiabank -- Analyst\n\nRaphael DuBois -- Societe Generale -- Analyst\n\nJeoffrey Lambujon -- Tudor, Pickering, Holt and Company -- Analyst\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nLeo Mariani -- MKM Partners -- Analyst\n\nMore COP analysis\n\nAll earnings call transcripts"
}