{
  "companyName": "Devon Energy",
  "companyTicker": "DVN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/devon-energy-dvn-q3-2022-earnings-call-transcript/",
  "content": "Devon Energy (DVN 0.77%)\nQ3 2022 Earnings Call\nNov 02, 2022, 11:00 a.m. ET\n\nOperator\n\nWelcome to Devon Energy's third quarter earnings conference call. At this time, all participants are in a listen-only mode. This call is being recorded. I would now like to turn the call over to Mr.\n\nScott Coody, vice president of investor relations. Sir, you may begin.\n\nScott Coody -- Vice President, Investor Relations\n\nGood morning, and thank you to everyone for joining us on the call today. Last night, we issued an earnings release and presentation that cover our results for the quarter and updated outlook. Throughout the call today, we will make references to the earnings presentation to support prepared remarks, and these slides can be found on our website. Also joining me on the call today are Rick Muncrief, our president and CEO; Clay Gaspar, our chief operating officer; Jeff Ritenour, our chief financial officer; and a few other members of our senior management team.\n\nComments today will include plans, forecasts, and estimates that are forward-looking statements under U.S. securities law. These comments are subject to assumptions, risks, and uncertainties that could cause actual results to differ from our forward-looking statements. Please take note of the cautionary language and risk factors provided in our SEC filings and earnings materials.\n\nWith that, I'll turn the call over to Rick.\n\nRick Muncrief -- President and Chief Executive Officer\n\nThank you, Scott. It's great to be here this morning, and we appreciate everyone taking the time to join us today. For Devon, the third quarter was another high-quality performance that demonstrated the flexibility of our strategy to create value in multiple ways. The team's disciplined execution of our operating plan advanced earnings and cash flow by healthy double-digit rates on a year-over-year basis.\n\nFree cash flow was bouldered by capital efficiencies and effective supply chain management that drove capital spending below forecast. We rewarded shareholders with cash returns in the form of both dividends and buybacks that increased by nearly double over the past year. And we strengthened our asset portfolio by closing on two highly accretive bolt-on transactions that add to our ability to deliver sustainable long-term results, all in all, another great quarter of executing on our disciplined strategy. For my remaining comments today, I want to focus on the strategic moves we've taken recently to improve our business and the positive impact these actions have on our fourth quarter and our 2023 outlook.\n\nTurning to Slide 4, we have worked hard through the years to assemble an asset portfolio that resides in the very best-positioned plays on the U.S. cost curve. Being a low-cost producer with quality inventory is critical to our long-term success. And over the past few months, we've taken steps to opportunistically improve our asset portfolio.\n\nThese bolt-on acquisitions were underpinned by exceptionally strong industrial logic that advance both the financial and operational tenets of our strategic plan. First and foremost, from a financial perspective, the transactions represent a value-oriented consolidation of resource in the economic core of these respective basins, resulting in immediate financial accretion. The acquired assets were funded entirely from cash on hand and purchased at levels as low as two times cash flow and possess free cash flow yields ranging up to 30% at strip pricing. Furthermore, the addition of this incremental wedge of free cash flow also allows us to accelerate the return of cash to our shareholders through higher dividends and positions us to further compound per-share growth through our ongoing stock buyback program.\n\nFrom an operation standpoint, these transactions fit like a glove within our existing asset portfolio and provide us improved economies of scale in the core of these respective plays. The direct adjacency of the acquired acreage also offers strong operational synergies and provides a meaningful runway of high-quality inventory that immediately competes for capital within our portfolio. Importantly, this resource capture allows us to sustain a high-margin production from these assets for many years to come and does not require us to accelerate drilling activity across other parts of the portfolio to maintain our overall productive capacity. Altogether, I could not be more pleased with these tuck-in acquisitions as they successfully demonstrate another pathway that our business can create immediate value for shareholders.\n\nHowever, I do want to be clear that deals such as these that check every box are exceptionally rare. We will always look for smart ways to strengthen our portfolio, but you should be confident in our disciplined approach that focuses on quality assets, adjacency to our operations, and immediate per-share accretion. On Slide 5, in addition to enhancing our asset portfolio, we have also taken important steps to maximize realized pricing for our products. With our marketing strategy, we are focused on securing multiple low-cost transportation options in each basin we operate with balanced exposure to domestic and international markets.\n\nBy controlling firm capacity from the wellhead to the key demand centers, we've been able to steadily improve our price realization over the past few years. This progress is evidenced by the record oil realization we achieved in the third quarter that reached 101% of the WTI benchmark. A key contributor to the strong performance was the 20% equity interest in Penn Oak's oil export terminal that we've accumulated over the past year. This investment in Penn Oak provides us 90,000 barrels per day of export capacity in Corpus Christi, offering valuable access to premium Brent-linked pricing that led to an uplift of more than $3 per barrel on these exports.\n\nWe've also taken steps to secure additional pricing diversification for our natural gas portfolio by recently entering an LNG export partnership with Delfin Midstream. Once again, this arrangement will provide us with 150,000 MMBtu per day of direct exposure to international gas pricing, such as the lucrative TTF or JKM markets. However, I want to be clear, this is a capital-light approach to attain LNG exposure, and our investment in Delfin, which is spread over this year and next, is very minor and will have a negligible impact to our capital outlook. A final investment decision for Delfin's floating LNG vessel is expected to be made in the coming months, and we anticipate the facility will be operational within four years of this decision.\n\nNow turning to Slide 7, with the positive tailwinds that come from our accretive bolt-on acquisitions, Devon's upcoming fourth quarter is set to be a strong one. As you can see on the left, we are planning on delivering a high-single-digit growth rate in production per share. Capital will be higher in the fourth quarter, but our disciplined reinvestment rates remain at very low levels. Approximately two-thirds of the increased capital spending compared to the previous quarter is driven by our recent bolt-on acquisitions.\n\nThe remaining third of the increase is a combination of higher service costs as contracts refresh, a bit more operated activity than previously planned helps our operational flexibility as we head into 2023. And we have seen an uptick in non-operated activity. Overall, it will be another great quarter for us as we expect to deliver free cash flow growth of more than 25% on a year-over-year basis. At today's pricing, this outlook translates into a compelling free cash flow yield of 11% or nearly three times what the S&P 500 index offers investors.\n\nWith this excess cash flow, there is no change to our cash return playbook. It will be more of the same. As you can see on Slides 9 and 10, we will continue to accelerate the return of capital to shareholders through our market-leading dividend, which is one of the top-yielding equities in the S&P 500, and we remain active buyers of our stock when the market presents us opportunities. This operational and financial momentum will also carry into 2023.\n\nI will hold off on detailed line item guidance today since we're still integrating the recent acquisitions of RimRock and Validus into our capital allocation process. However, I can confidently say that our Delaware asset will continue to be the focal point of our capital program, and we're focused on designing a plan with consistent activity levels that delivers the right balance between returns, capital efficiencies, and free cash flow. With the benefit of acquisitions, we do expect to grow production in 2023. However, compared to fourth quarter exit rates, our volumes in the upcoming year are likely to be in the bottom half of our targeted growth range of 0% to 5%.\n\nThe capital activity levels required to sustain production at these levels will be similar to the program we're deploying in the fourth quarter of this year. Although we could pull back on less efficient rigs when considering the incremental activity we've recently added in the Delaware, we still expect to experience some additional upward pressure on costs as contracts refresh, especially in the second half of the year, but price discovery is still ongoing and very sensitive to industry activity levels and commodity pricing. We will provide official guidance in February, but I'm confident that 2023 is going to be another great year for Devon as we are well-positioned to generate substantial free cash flow and execute on all facets of our cash return model. With that, I will now turn the call over to Clay to cover our operational highlights.\n\nClay Gaspar -- Chief Operating Officer\n\nThank you, Rick, and good morning, everyone. Devon's consistent quarterly performance exemplifies the importance of balancing three things: first, the value of well-communicated, consistent, and long-term business strategy; second, a 24-plus month planning process that details out the development schedule, supply chain, the takeaway needs, and any potential pinch points; and third, and critically important, near-term execution, AKA getting it done. Although third quarter was another quarter, our team was working hard to deliver on all phases. Altogether, we were able to deliver on our business, continues to strengthen and build momentum.\n\nDuring the quarter, the team delivered results that exceeded expectations by focusing on capital efficiency and strong well productivity. In addition to the important blocking and tackling associated with our day-to-day operations, we also invested substantial amounts of effort to ensure that we integrate the recent acquisitions into the business the right way so that we can maximize the value of these assets for shareholders. The integration is not just simply teaching the new people how we do it at Devon, but taking the time to learn, challenge and improve our own processes. On Slide 14, let's begin with an overview of our Delaware Basin operations, which account for more than 60% of our total activity and drove the overall company performance in the quarter.\n\nTo optimize the returns of our capital program in this tight market, we've been very thoughtful in designing a plan with steady activity levels that has resulted in an average of 14 rigs and three frack crews year to date. On the top right chart, you can see that this disciplined capital allocation in the Delaware is working well, resulting in a healthy production growth rate of 11% year to date. Importantly, the low-risk development projects, underpinning this volume growth, have delivered world-class returns with IRRs consistent in the triple digits. Another win for us can be seen in the bottom left, where the team has leveraged our substantial operating scale to maximize the value of our production.\n\nWith good upfront planning and economies of scale in the basin, we've been able to effectively control operating costs even as commodity prices have gravitated much higher over the last few years. On the bottom right, this cost mitigation strategy has allowed us to materially benefit from the higher prices, with margins expanding by 260% over the past few years. Looking specifically at the quarter's results on Slide 15, the Delaware team continued to do a great job of achieving operating efficiencies. On the chart to the right, new well activity was highlighted by several high-impact development pads, but the most prolific result was achieved by the CDU 604H in Southern Eddy County.\n\nThis three-mile lateral was our first test of the Wolfcamp B interval in the Cotton Draw area, delivering a 30-day rate of just over 6,500 BOE per day, with estimated recoveries for this well trending toward 3 million BOE. It's not bad for a secondary target. In addition to our outstanding well productivity, we've not seen any meaningful communication with the shallower zones in the Wolfcamp, such as the Wolfcamp A or XY sands, which deepens our quality of inventory and provides us flexibility to optimize future development plans in this portion of the field. As I mentioned in my earlier comments, the strategic development of these target-rich assets is some of the most complicated and important work we do.\n\nResults like this give us confidence that we're getting things right. We also made great progress advancing drilling and completion efficiencies across our operations in the basin. In the Wolfcamp, we improved drilling productivity by 13% on a per-foot basis versus last quarter, with some of our best spud rig release times for a two-mile wells, pushing below 20 days. Completion efficiencies have also steadily progressed as were highlighted by a record-setting performance on a Cotton Draw pad, where our completion pace reached an average of 3,200 feet per day.\n\nWhile we have made a lot of progress on efficiencies over the last few years, these D&C results showcased the incremental improvements the team is making every day to reduce cycle times, refine completion designs and deploy leading-edge technology across all facets of the value chain. Moving to Slide 16, I'm also excited about the positive results we're seeing delivered and the other key assets across our portfolio. In the Anadarko Basin with our four-rig program, the team's approach of wider spacing and larger completion designs is delivering excellent results. A great example of this resource progression was the auto development in the condensate window of Canadian County.\n\nThis five-well project, which codeveloped the Meramec and Woodford formations, attained an average 30-day rate of more than 2,700 BOE per day. The strong well productivity we are experiencing, coupled with our $100 million Dow drilling carry, positions this liquid-rich gas play to compete for capital with any asset in our portfolio. Moving to the Williston. This asset continues its tradition of delivering some of the best returns and highest oil rates in our portfolio with another batch of great wells brought online during the quarter.\n\nCoupled with the RimRock acquisition, oil production advanced 30% versus last quarter. The team is also making substantial progress integrating the RimRock acquisition into our operations. And because of this transaction, we expect volumes to take another step up to around 65,000 BOE per day by year end. This enhanced production profile now puts our Williston asset on pace to generate around $1 billion of cash flow for this year.\n\nTurning to the Powder River Basin. We're encouraged by the results from our Niobrara appraisal activity in the quarter. The top highlight was a three-mile lateral SSU MLT project in Converse County that helped further validate the commerciality of the spacing test. With improved completion design that pumped 3,000 pounds of sand per foot, all SSU MLT wells performed above type curve expectations with 30-day rates averaging 1,400 BOE per day, of which 86% was oil.\n\nImportantly, we're still experiencing strong reservoir pressure and shallower declines than forecasted, with per-well recoveries on track to reach 1.2 million barrels of oil equivalent. While we still have a lot of work ahead of us, this positive result adds to the conviction that the Niobrara will be a repeatable resource play and an important growth driver for Devon in the future. Lastly, in the Eagle Ford. The results from the infill and redevelopment activity across our legacy position in DeWitt County continue to demonstrate that there's a lot more oil to be recovered from this prolific play over time.\n\nDuring the quarter, we brought on eight new infill wells bounded by existing producers that delivered 30-day rates averaging 3,200 BOE per day. Slide 17 provides a more detailed overview of our recent Validus acquisition. This opportunistic acquisition doubles the scale of our position in the Eagle Ford and captures a repeatable resource play in the best part of the Karnes Trough oil window. As you can see on the map, the transaction secures an operated position of 42,000 net acres with high working interest of 90% that's adjacent to our existing footprint in the play.\n\nThe oil-weighted production mix of around 35,000 BOE per day provides strong cash operating margins through access to the premium Gulf Coast pricing, low per unit operating, and GP&T cost of around $6 per BOE. With enhanced scale in the basin, we expect to realize $50 million in average annual cash flow savings from the capital efficiencies, operating improvements, and marketing synergies. Furthermore, the core of the Eagle Ford is providing -- is proving to be one of the best opportunities in the world for downspacing, redevelopment, refracks, and also EOR. We have identified roughly 500 economic opportunities across the Validus acreage and this inventory allows us to sustain the high-margin production from our Eagle Ford assets for years to come.\n\nAnd lastly, on Slide 18. With our recent resource capture, I wanted to end my comments today by covering the depth and quality of our inventory, which we believe is differentiating compared to the vast majority of the E&Ps out there. Turning your attention to the middle bar on the chart. At our current pace of activity, we've identified 12 years of high-return development inventory, delivering greater than a 30% return with $65 WTI and 325 Henry Hub pricing.\n\nThis inventory disclosure reflects the confidence that we have in delivering repeatable, capital-efficient results for many years to come. As you would expect, the majority of our risked inventory resides in the target-rich Delaware Basin, but we're also stocked with healthy amounts of high-return inventory across all of our key assets. To be clear, this rigorous characterization is a result of existing well control and detailed subsurface work, but it is not meant to convey the full extent of our resource base. This bar only represents the high confidence operated inventory that deliver competitive return and a conservative mid-cycle price scenario.\n\nMoving to the bar on the right, with a higher commodity price and further derisking of our portfolio over time, we estimate that our inventory extends more than 20 years at the current activity base. This upside scenario assumes that we capture additional efficiencies, fine-tuned spacing at higher prices, and further delineate the geologic-rich columns across our acreage footprint. However, I will be quick to add that the upside we've identified is not an exercise, including every molecule potential. We fully expect a significant portion of the upside opportunities to come into development over time.\n\nTangible examples of these upside opportunities that the team are currently progressing include massive amounts of resource potential residing in the deeper Wolfcamp intervals, tighter redevelopment spacing and refracks success in the Eagle Ford, ongoing appraisal work in the Powder River Basin to further derisk the Niobrara, and improving capital efficiency that is unlocking resource potential in the Anadarko. Bottom line here is that we have an abundance of highly economic opportunities that will continue to deliver top-tier capital efficiency for the foreseeable future. And with that, I'll turn over the call to Jeff for a financial review. Jeff?\n\nJeff Ritenour -- Chief Financial Officer\n\nThanks, Clay. I'd like to spend my time today discussing the highlights of our financial performance for the quarter and the capital allocation priorities for our free cash flow. A good place to start is on Slide 6 with a review of Devon's financial performance, where earnings and cash flow per share growth rapidly expanded year over year and exceeded consensus expectations. Operating cash flow for the third quarter totaled $2.1 billion, an impressive increase of 32% compared to the third quarter of last year.\n\nThis level of cash flow generation comfortably funded our capital spending requirements and resulted in $1.5 billion of free cash flow in the quarter. As you can see on the chart to the right, this strong result keeps us on track to generate a record-setting amount of free cash flow this year and is a powerful example of the financial results our disciplined cash return business model can deliver. With the free cash flow Devon generated this quarter, our top priority is to reward shareholders with higher cash returns through our fixed plus variable dividend framework. This dividend strategy is foundational to our capital allocation process, providing us the flexibility to return cash to shareholders across a variety of market conditions.\n\nUnder this framework, we pay a fixed dividend every quarter and evaluate a variable distribution of up to 50% of the remaining free cash flow. Based on our strong third quarter financial results, the board approved a 61% increase in our dividend payout per year over year to $1.35 per share. On Slide 9, you can see that our large dividend translates into a very compelling yield compared to other segments of the broader market. In fact, at today's pricing, our yield is substantially higher than the average company in the S&P 500 Index.\n\nAnother priority for our free cash flow is the execution of our ongoing $2 billion share repurchase program. On Slide 10, you can see that over the past year, we bought back $1.3 billion of stock, which has reduced our outstanding share count by 4%. This equates to an average price of $50 per share, which is more than a 30% discount to our current trading levels. Over the past several months, our buyback activity has been somewhat limited due to our recent bolt-on acquisitions in the Williston and Eagle Ford.\n\nHowever, with those transactions now closed and with around $700 million remaining on our authorization, we can be more active buyers of our stock when the market opportunities present themselves. And to round out my prepared remarks this morning, I'd like to give a brief update on our investment-grade financial position. After funding $2.5 billion of acquisitions from cash on hand during the quarter, we exited September with a healthy cash balance of $1.3 billion and low leverage with net debt-to-EBITDA ratio of around 0.5 a turn. Even with this strong financial position, we're not done making improvements, and we'll continue to evaluate opportunities within our debt stack to create additional value for shareholders.\n\nWith that, I'll turn the call back to Rick for some closing comments.\n\nRick Muncrief -- President and Chief Executive Officer\n\nThank you, Jeff. Great job. We have covered a lot of good information today, but I would like to close with this key message, and that is that the team here at Devon is delivering on exactly what we promised to do. This is so foundational to our strategy.\n\nOur consistency has developed a strong trust for our brand with internal and external stakeholders. We've prioritized building a can-do culture and taking care of our people, including the contractors who work for us. We've prioritized for share value creation over the pursuit of volumes. And we have rewarded shareholders with market-leading cash returns.\n\nWe've also demonstrated time and again our technical capabilities and operational expertise against all -- across all five of our operating areas by consistently delivering top-tier well productivity and capital efficiencies. Furthermore, I believe we've continued to lead and differentiate from peers by establishing a logical, accretive track record of consolidation. The resource assessment successes that Clay referred to with our Lower Wolfcamp in the Delaware Basin and the Niobrara and the Powder River Basin are establishing new sources of supply and inventory. We look forward to sharing additional resource assessment successes in the future.\n\nFinally, we've continued to take important steps to enhance our business through our marketing and infrastructure strategies that have positioned us to achieve very attractive price realizations across the portfolio and stay ahead of any regional bottlenecks. Overall, it's been another great year for us, but the best is yet to come for Devon. We are focused on closing out the year with strength and are preparing to build upon this positive momentum into 2023. I will now turn the call back over to Scott for Q&A.\n\nScott?\n\nScott Coody -- Vice President, Investor Relations\n\nThanks, Rick. We'll now open the call to Q&A. [Operator instructions] With that, operator, we'll take our first question.\n\nOperator\n\nYes. Thank you. [Operator instructions] Our first question comes from Arun Jayaram with J.P. Morgan.\n\nArun, your line is now open.\n\nArun Jayaram -- JPMorgan Chase and Company -- Analyst\n\nYeah. Good morning. Rick, I wanted to start, you provided some, call it, soft guidance commentary for 2023. I respect the fact that you're still in your capital budgeting process.\n\nBut let's go back to your prepared comments. You mentioned that you expected targeted growth to be at the low end of the 0% to 5% range from the 4Q exit rate. When we think about the 4Q exit rate, is that basically the 4Q guide of 650,000 BOE per day at the midpoint and 322.5 for oil? Just trying to get your definition of the exit rate.\n\nRick Muncrief -- President and Chief Executive Officer\n\nYou bet, Arun. That's spot-on. That's exactly what we're saying. That's correct.\n\nThat's the assumption you should make. You bet.\n\nArun Jayaram -- JPMorgan Chase and Company -- Analyst\n\nGreat. OK. My second question for you, Rick, is to get your thoughts on what you think is the appropriate development scheme for shale in above mid-cycle conditions. We get a lot of questions from this from the buy side.\n\nBut one of your peers has decided to high-grade their 2023 program to develop, call it, higher return locations starting next year. In the broader context of the fact that shale inventories are finite in nature, do you think it makes sense for Devon today to tailor your development programs on maximizing IRRs or NPV per section? I'd love to get your thoughts on that idea.\n\nRick Muncrief -- President and Chief Executive Officer\n\nYeah. That's a good question. For us, I think the plan that we've been implementing over, I'd say, the last 18 months is about what you ought to expect from us in the future. We may have some minor tweaks, Arun, but we feel really good.\n\nWhen you're a multi-basin operator as we talked earlier, we're still doing in a couple of our basins, quite a bit of resource assessment, testing new zones, new intervals, things like that. We'll continue to do that. But as far as the operating scheme, I don't know that you'll see a lot of change from what we've been employing over the last couple of years. Clay, you want to add anything to that?\n\nClay Gaspar -- Chief Operating Officer\n\nYeah. Rick, I think you nailed it with balancing IRR and NPV is an important consideration. And of course, you have all the practical realities of we got to make sure we have take away. We want to make sure we're doing the right thing from an ESG perspective.\n\nWe're thinking about assessing future potential. Those always don't necessarily command the highest risk rate of return today, but it's incredibly important as we think about not just this quarter's return or year's return, three-year, five-year, 10-year returns as well.\n\nArun Jayaram -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks a lot.\n\nRick Muncrief -- President and Chief Executive Officer\n\nThank you, Arun.\n\nOperator\n\nThank you. Our next question comes from Neil Mehta with Goldman Sachs. Neil, your line is now open.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nYeah. Good morning, team. Rick, I wanted to get your perspective on these opportunistic bolt-ons. We've had Validus Energy and RimRock and as you said, you acquired them at very attractive multiples.\n\nWhat is the opportunity set that you see around similar type of acquisitions? And can this become a core part of your go-forward business model rolling up assets and arbitraging the multiple?\n\nRick Muncrief -- President and Chief Executive Officer\n\nNeil, that's another good question. From our perspective, I think you've heard us be very consistent with our messaging that we will always be opportunistic on transactions that could strengthen our company. We want to make sure that we do deliver the accretion. We're not waving arms, but we -- actually, it shows up in our income statement over time.\n\nAnd to the point that you made, if it could deepen some inventory, that really is very critical. We're going to continue holding consolidation, I think, an important part of our overall strategy. That being said, as I mentioned in our prepared remarks, you don't always find those deals that check every box, and we're not going to overpay. We're going to be very disciplined.\n\nAnd these two transactions work quite well for us. And there could be others in the future, but we'll wait to see. But we're certainly proud of what we've done and have to give a tip of the hat to our team that brought these over the fence, and they're great transactions and help us in a lot of ways.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nAnd the follow-up is just on capital spending. It's been the focus of investor conversations this morning. You talked a little bit about it in the prepared remarks, but can you once again bridge between old and new guidance for 2022 spend? And just how we should think about how much of this bleeds into the way we should think about '23 as well? Thank you.\n\nRick Muncrief -- President and Chief Executive Officer\n\nYeah. I think I'm going to ask Clay to go into maybe some of the detail. But just as I said in our remarks, two-thirds of the increase of capital spending are a direct impact of these acquisitions where you had ongoing rig activity. We had two rigs running down the Eagle Ford on the Validus deal and a rig running in the Bakken on RimRock.\n\nSo, it comes with capital spend. And so, that's a big part of it. And I think we broke it down into three other areas for that other third. But Clay, you may want to just share your perspective as well on the increase.\n\nClay Gaspar -- Chief Operating Officer\n\nYeah, Rick. First of all, look, there is inflation out there. We've never been hiding from inflation. It's real.\n\nAs we renew contracts, we see that continue to tick up. I think we're starting to see a crest in that as I look to see not necessarily significant rollover, but certainly kind of a crusting, maybe some green shoots and softening here and there. We will continue to monitor that. I think it's too early to say how that manifests over the course of 2023.\n\nBut that's the first piece of it. The second is we actually took some opportunity to step up a little bit of activity, get a running start on '23. You'll see that in -- really in the November, December new wells spud. That spud count will come up a little bit.\n\nAnd then also as we start to look at kind of across the fence and our partners, the non-op activity, has stepped up as well. So, when you break it down with the two-thirds being from the acquisition activity, the remaining piece kind of divided roughly in thirds that way. I think it's -- I think we feel pretty good about where we're at and for the trajectory for '23 as well.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nThanks, team.\n\nOperator\n\nThank you. Our next question comes from the line of Doug Leggate with Bank of America. Doug, your line is now open.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nThank you. Good morning, everyone. Guys, I wonder if I could go to Clay first and then to Jeff. Thanks.\n\nClay, your comments about testing wider spacing, I guess, in the Mid-Con. I'm looking at Slide 18. And to get from the 12-year inventory to the 20-year inventory, one of the comments under there is appraisal and tighter spacing. So I wonder if you can reconcile what does upspacing mean for your confidence in that increased longer-term inventory guidance.\n\nClay Gaspar -- Chief Operating Officer\n\nYeah. Doug, thanks for the opportunity to clarify that. So the upspacing is really relative to, I think, the dark years of the STACK where the industry really down-spaced too much, took for granted the amount of well-to-well interference or maybe isolation and frankly, just over-drilled. I think where we're at today, we're seeing phenomenal returns.\n\nBut as you know, everything changes on a real-time basis, commodity price yields, well costs, realizations. And that constant mix is something we're evaluating is three or four or five the right spacing specific to Mid-Con. But I think in the broader sense, as we look kind of across the basin and then you move from a midpoint of a $65 price deck to, I believe, we assumed an $85 on the larger account, you also have to reconsider how does that work in other areas. Powder River that is really yet to be defined on how -- what kind of spacing we're doing.\n\nAnd even some of the deeper potential in the Delaware Basin certainly has significant upside depending on which commodity price you run. And that's where that really that spot to the -- on the -- the bar on the right really comes in. One additional note on the -- in the Mid-Con area, there's a lot of running room with gas. And I think that, of course, is a very important consideration as we start thinking about what price deck do you run, what realizations do we have, and ultimately, what's the right economic approach to extract the most opportune value.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nSorry. Clay, just to be clear, did you say $85 oil for the 10,000 locations?\n\nClay Gaspar -- Chief Operating Officer\n\nYeah. Is it a little higher than that, Scott?\n\nScott Coody -- Vice President, Investor Relations\n\nYeah. It's in that neighborhood, Doug. So we did -- for the unrisked we did have a higher price point that's more reflective of maybe current spot pricing, just have a regulator on the unrest as well. But -- and also we did take some of the risking off with regards to some of the appraisal that needs to be successful to make that column convert into our risked category over time.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thank you for the clarification. My follow-up is hopefully a quick one for Jeff. And it goes back to the comment that Rick made about free cash flow in the fourth quarter over 2021.\n\nJeff, you still have about -- looks about an 80% deferred cash tax in that free cash flow number for the third quarter, $1.5 billion. When can we expect to see a more normalized cash tax going forward, and I'll leave it there. Thanks.\n\nJeff Ritenour -- Chief Financial Officer\n\nYeah, Doug, thanks for the question. We -- as you saw here in the third quarter, we adjusted our expectation for the full year cash tax level. We have been guiding most of the year around a 10% cash tax burden, and we now think that's going to be closer to 8%. The real big driver for us this year is we're having the benefit of some tax attributes, the bulk of which are NOLs.\n\nAs we move forward into next year, we'll carry forward about $1 billion of NOLs that we'll be able to utilize kind of over a multiyear period. So that will help keep our tax liabilities in check as we move forward. But as we've talked about before, our expectation for next year, if you assume kind of the current commodity price levels and cost structure, you're going to be hovering around that kind of 15% current tax level, and that would be our expectation as we move throughout next year.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nThanks for taking my questions, guys.\n\nOperator\n\nThank you. Our next question comes from Jeanine Wai with Barclays. Jeanine, your line is now open.\n\nJeanine Wai -- Barclays -- Analyst\n\nHi. Good morning, everyone. Thanks for taking our questions. My first question -- actually, both are maybe for Clay here.\n\nSticking with inventory, we again appreciate all the details on Slide 18. On the Delaware, can you provide a little bit more color on that? It looks like for the over 4,500 risked locations, about 55% of those are in the Delaware. And so our question is kind of what's the mix of zones within that estimate? And in particular, how much of those 55% of locations would you consider to be tier 1 kind of Wolfcamp A, XY?\n\nClay Gaspar -- Chief Operating Officer\n\nThanks, Jeanine. Yeah. And you're referring to Slide 18, the bar kind of there in the middle, a total of greater than 4,500 locations. Yes, you got a keen eye, a little more than half of that is in the Delaware.\n\nAs I think about that kind of light gray box and break that down, by far, most of that is Wolfcamp and Bone Spring, which is, as you know, kind of the really good stuff that we've been going after. Certainly, a smaller portion is some Avalon and some deeper other potential, but it's by far, mostly Bone Spring and Wolfcamp.\n\nJeanine Wai -- Barclays -- Analyst\n\nOK, great. And then, maybe sticking on ops here on base declines. So in 2Q, the Delaware total in oil production, it grew significantly. I think it was like 22% year over year in 2Q and 16% on oil.\n\nIn Q3, the year-over-year growth, it slowed and oil, I think, was down like 3,000 a day versus 3Q of last year. So just maybe smashing everything together, we've got flattish oil expected in 4Q in the Delaware. Can you provide an update on what you think the oil-based decline will be for the Delaware going forward? And then maybe for the overall company as you put in the Bakken and Eagle Ford deals? Thank you.\n\nClay Gaspar -- Chief Operating Officer\n\nYeah. Thanks, Jeanine. Yes, you're right. And as we compare quarter to quarter, obviously, there's two ends of that, last year's quarter to this year's quarter, and boy, can really get a little bit lumpy.\n\nSo I think you're thinking about it right, scaling up, maybe thinking about year-over-year trajectories. And so yes, we will continue to see some nice growth. We said 11% year to date on the slide. For the base decline, I would say it's roughly 30% to 35%, probably closer to 30%.\n\nAs we continue to moderate the growth, these numbers come down, and that's a benefit of this -- of the business model that we have. We'll continue to see that mitigate over time and therefore, making this, keeping our production flat more capitally efficient.\n\nJeanine Wai -- Barclays -- Analyst\n\nThanks. Is that 30% to 35% in the Delaware, or was that for the overall company?\n\nClay Gaspar -- Chief Operating Officer\n\nYeah, coincidentally, really both. But yeah, for both.\n\nJeanine Wai -- Barclays -- Analyst\n\nGreat. Thank you.\n\nClay Gaspar -- Chief Operating Officer\n\nSure.\n\nOperator\n\nThank you. Our next question comes from Paul Cheng with Scotiabank. Paul, your line is now open.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nThank you. Good morning, guys. Two questions, please. The first one is for Jeff and the second one is for Clay.\n\nFor Jeff, in your presentation, you have an interesting comment saying that the management and effort and the streamlining effort have led to a higher unit DD&A. Can you elaborate about what extent you guys are doing and that could lead to higher unit DD&A? And also what is the benefit that you expect from those efforts? I mean, what were you talking about here? And second point is on the recent bolt-on acquisition in Eagle Ford, is that in any shape or form will impact how you're going to look at your JV with BP in the area that the -- whether it's the focus or attention for the companies. I mean, how -- is there any shape or form that is going to have any impact? Thank you.\n\nJeff Ritenour -- Chief Financial Officer\n\nHey, Paul. This is Jeff. Yeah, happy to address your question on DD&A. It's a little bit of the nuance of successful efforts accounting, and you're probably aware, we have different common operating fields or cost centers, if you will, kind of across the company as to align with how we kind of manage the operations.\n\nPost the merger that we did with WPX, we actually kept our Delaware South and North assets separate. So, New Mexico to the north, obviously, and Texas to the South. Here, over the last couple of quarters, we decided to consolidate that all into one cost center. And so, as a result, you have spread that cost of those units across the entirety of that new business unit or a call center, if you will.\n\nAnd so as a result, you have a slight increase in the DD&A rate going forward to the overall company as a result of kind of streamlining that effort, driven by the consolidation of those two call centers.\n\nClay Gaspar -- Chief Operating Officer\n\nPaul, this is Clay. I'll pick up on the second question.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nIs there any --\n\nClay Gaspar -- Chief Operating Officer\n\nSorry, go ahead. Sorry, Paul, go ahead.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nYeah. Can I just ask that, Jeff, is that resulting in any cash savings going forward with this consolidation or streamline?\n\nJeff Ritenour -- Chief Financial Officer\n\nOh, absolutely. I mean, the work that we've done around integration post-merger continues. So, we're always looking for ways to continue to make the asset base better and how we manage those assets going forward. So certainly, this was a component of our -- of the execution of that integration, and we certainly would expect to see some synergies, albeit minor in the grand scheme of things today, but we're certainly -- part of our thought process as we rolled out the synergies we talked about post merger.\n\nClay Gaspar -- Chief Operating Officer\n\nPaul, I'll take the second question. So, our joint venture with BP is really a separate discussion. Now clearly, as we scale up our activities, we will bring our learnings, that economy of scale to BP as the drilling and completions operator and then vice versa. We're also bringing knowledge to the Validus assets.\n\nAlso remember, as part of the JV, Devon operates the joint venture wells. So there's definitely economies of scale in our operations, some of the technologies that we use, some of the efficiencies around the people, being able to cover essentially more with less. That's always very good as you scale up these opportunities. I think one of my favorite tests to do is as you look at one of these deals is just glance at the map.\n\nAnd if it makes sense from an industrial logic standpoint, you know that there is some real efficiencies to be gained, and we're certainly going after those right now.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Scott Gruber with Citigroup. Scott, your line is now open.\n\nScott Gruber -- Citi -- Analyst\n\nYes. Good morning. So on the Validus acquisition in the Eagle Ford, you identified about 500 in locations, which looks to double your total in the basin, as I squinted that inventory STACK bar chart. Are all these new drill locations, or do these figures include refrack opportunities? And if refrack is not included, how good could the refrack opportunity be?\n\nClay Gaspar -- Chief Operating Officer\n\nYeah. So, this is only the drilling opportunities, but we have additional refracks as well. They're a little hard to quantify. We're working on that now.\n\nWe have some internal numbers around the refracks. And I can tell you, it's more than just where does it work from a reservoir standpoint. It's also where does it work from a well-construction standpoint. You have to be able to reenter these wells for an economic -- economically and be able to restimulate and really stimulate new rock is the key to success there.\n\nScott Gruber -- Citi -- Analyst\n\nAnd as you study the opportunity set, how would you describe the economics of refrack today? And how would you think about layering them in over the next couple of years?\n\nClay Gaspar -- Chief Operating Officer\n\nYeah. I would say, we're still in the early stages of really rolling that into our portfolio. I would say it's still in the assessment bucket that I referenced early It could be very meaningful, not just in Eagle Ford, but maybe in other areas as well. And so the quantity that we've done this year, and I expect for next year, is relatively small.\n\nAs I've mentioned, it's finding the right recipe. What was the original stimulation in that well? What was the stimulations in the offset well? What's the spacing to the offset wells? What's the casing construction of that well? And does it lend itself to the right recipe so that we can reenter, properly stimulate, hopefully, charge that new rock and, therefore, really get the bang for the buck? What I can tell you, the early results are we're very encouraged. I think we're finding the right recipe, but it's too early to really lean in too hard just yet.\n\nScott Gruber -- Citi -- Analyst\n\nOK. I appreciate the color. Thank you.\n\nOperator\n\nThank you. Our next question comes from Neal Dingmann with Truist. Neal, your line is now open.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nThanks for the time this morning, guys. My first question is on your Delaware transportation specifically. Could you all speak to the continued Delaware takeaway? And then also how you all are protected from the Waha price volatility that we've even seen recently?\n\nJeff Ritenour -- Chief Financial Officer\n\nYeah. You bet. Neal, this is Jeff. We feel really good, frankly, about our ability to move the molecules.\n\nYou've heard us talk about this in the past, and we've had these dislocations in pricing in Waha over the last couple of years, and the team has done a great job of kind of protecting us from that exposure. As a big picture, we move, call it, north of 50%, almost 60% of our volumes are gas molecules out of the basin to the Gulf Coast. And so those volumes actually have exposure to Houston Ship Channel pricing. With the remainder of molecules that sit in basin, we've hedged almost all of that.\n\nAnd so, the remainder of volumes that are specifically exposed to Waha is about 10% of our gas molecules in basin. So, when you put that all together, just to give you some context and somebody will correct me on the math here, but I don't have it quite right. But it's less than 1% of our revenues as a total company are exposed to Waha at this point given the lengths that we've gone to, number one, move the molecules out of basin; and then number two, hedge our exposure there.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGreat answers. And then my second question is on your natural gas plant, specifically. Could you all give us some more color maybe on that Delfin LNG partnership, how you might see this advancing, and then other potential similar, I'd call, nonbinding type agreements or opportunities going forward?\n\nJeff Ritenour -- Chief Financial Officer\n\nYeah, you bet. No, we're excited about the opportunity with Delfin. We're a little light on details at this point because we're still in the process of negotiating some of the commercial terms there and how all that shakes out. But generally speaking, it's really just an extension of our broader marketing philosophy and thought process, which is we're always trying to capture the highest realized price wherever we can for our molecules, while at the same time, kind of balancing our exposure to the different markets that we're involved in.\n\nAnd so, as we look forward over the next five and 10 years, we really expect the growth in demand for natural gas to come outside of the United States. And so, for us, it makes sense to have exposure to the water and to those international markets. And so, we're excited that we could take a step forward with Delfin, make a relatively minor investment with them, which is going to provide us some access to those international markets going forward. I'll remind everybody that those projects, we don't expect to come online until the kind of the 2026 time frame, but we're excited to kind of work things forward with that group and then hopefully get us exposure to the premium markets that we're seeing internationally.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGreat details. Thanks, Jeff.\n\nJeff Ritenour -- Chief Financial Officer\n\nThanks, Neal.\n\nOperator\n\nThank you. Our next question comes from John Freeman with Raymond James. John, your line is now open.\n\nJohn Freeman -- Raymond James -- Analyst\n\nThank you. Yeah. My first question is a little bit of a follow-up to what Jeanine and Doug were talking to you on Slide 18. I guess just when I think about the risked inventory that you've got at the moment and we think about sort of the balancing act of adding to that risked inventory, either via bolt-on deals like you have done recently versus appraisal and testing to kind of move that upside location count into the risked inventory.\n\nI guess when you just sort of look out the next two, three years, I mean, would you anticipate that more of those risk inventory locations comes from more of these kind of bolt-on deals, or is it more from kind of the appraisal, testing, spacing type of efforts?\n\nClay Gaspar -- Chief Operating Officer\n\nThanks for the question, John. This is Clay again. I would say more from the appraisal. We think about the work that we're doing in a lot of these horizons that are just not quite defined on downspacing, what's the right spacing test, maybe even vertically.\n\nIs there two landing zones there or is there three landing zones in some of these intervals. And then I think about some of the stuff that's a little bit further afield, say, in the Powder, there's a lot more opportunity there to bolt on to that number from the appraisal standpoint. Any additional -- just to be clear, we don't have any assumptions on future acquisitions or any additional bolt-ons in any of these numbers.\n\nJohn Freeman -- Raymond James -- Analyst\n\nAnd then, when I think about for next year, I appreciate some of the early kind of color on how to think about 2023 from an activity standpoint and some of the cost inflation levers. Is there anything from like a midstream perspective on a year-over-year basis that we should also consider whether it's related to some of the bolt-ons recently getting bigger in some of these areas, just that necessitate some more midstream infrastructure spend in '23 versus '22 and we'll kind of trying to finalize what we think about the '23 budget?\n\nClay Gaspar -- Chief Operating Officer\n\nYeah. Just think about it kind of similar to '22, kind of a similar runway.\n\nJohn Freeman -- Raymond James -- Analyst\n\nGreat. Appreciate it.\n\nClay Gaspar -- Chief Operating Officer\n\nThank you, John.\n\nOperator\n\nThank you. Our next question comes from Matthew Portillo with TPH. Matthew, your line is now open.\n\nMatthew Portillo -- Tudor, Pickering, Holt and Company -- Analyst\n\nGood morning, all. Just to start out a question around Q4. It looks like the market is a little bit spooked on the guidance. As we look at the well data in the Permian in particular, your well results look extremely consistent on a year-over-year perspective, but curious as you guys look at the data, how you're feeling about your productivity trends.\n\nAnd then, if you are seeing fairly consistent well results, just curious if there's anything to take into account regards to till timing during the fourth quarter that might have led to some of the guidance shaking out in Q4.\n\nClay Gaspar -- Chief Operating Officer\n\nYeah. Thanks, Matt. I appreciate being able to talk about that because the well performance is phenomenal. This is an absolutely world-class asset.\n\nWe love the position we're in. We love the scale that we have. The team keeps delivering. We're still working on the efficiencies.\n\nWe're still applying technology, always trying to get a little better, a little smarter each day. No doubt about it. We have some inflation coming our way. So there is some squeeze to the margin -- on the margin, but I would take this world-class asset and love having in our portfolio and really, really pleased on what's going on with the team and what they're doing.\n\nMatthew Portillo -- Tudor, Pickering, Holt and Company -- Analyst\n\nAnd then, I guess, a follow-up question, Clay, maybe on the STACK. You guys have started the upspace program here with Dow. Looks like some impressive initial rates. Just curious if you could provide some context around well performance with the upspace completion design.\n\nAnd then additionally, just a view on midstream infrastructure as the asset starts back on growth, should we expect further midstream build-out, either on a G&P perspective or some marketing to move gas further south to accommodate that growth in '23 and '24?\n\nClay Gaspar -- Chief Operating Officer\n\nThanks for the question on STACK, Matt. Again, the team is looking at this holistically, thinking about what's the right way to extract the optimum value, balancing rate of return, balancing NPV and thinking about the levers that we have. The first and the most significant is well spacing. The second, of course, is completion design.\n\nBoth of those I mentioned in my prepared remarks. We like the approach that we have. Clearly, we have to understand what commodity price is going to do. And as those numbers rise up on gas and NGL realizations, there's an opportunity for us to maybe even take a step tighter and still achieve super competitive returns.\n\nSo, we're still working on that. Like what we're seeing as we move into the gas window, certainly, the higher commodity price and the gas certainly helps. It's a significant amount of upside for our inventory. As we think about the midstream, the nice thing about working in the Anadarko Basin is a lot of built-out midstream.\n\nSo, we feel really good about the runway. Of course, we have regular conversations with our midstream partners trying to stay out years ahead because these big wells, especially with the gas volumes, can take up a lot of space in pipe and in plants. And so, we want to make sure we're telegraphing what we're doing to our midstream partners. And I would say that those conversations are going along very, very well.\n\nMatthew Portillo -- Tudor, Pickering, Holt and Company -- Analyst\n\nThank you.\n\nClay Gaspar -- Chief Operating Officer\n\nThanks, Matt.\n\nOperator\n\nThank you. Our next question comes from Kevin MacCurdy with Pickering Energy Partners. Kevin, your line is now open.\n\nKevin MacCurdy -- Pickering Energy Partners -- Analyst\n\nHey, good morning, guys, and congratulations on a good production quarter above guidance. The only area you didn't beat our expectations was in the Bakken. And I wonder if you could talk about the integration of the RimRock assets and what you expect the trajectory of the production to be. You mentioned earlier that there was a 65,000 barrel a day exit rate.\n\nIs that for the full quarter, or will you expect to grow above that next year?\n\nClay Gaspar -- Chief Operating Officer\n\nYeah. I would say roughly so that 65% -- or 65,000 BOE a day is about -- what would be for the quarter. So, I appreciate the acknowledgment of the third quarter, sometimes that can get lost. The teams worked exceptionally hard to continue to perform, and we're really, really pleased with that.\n\nThe Williston as we take over on any of these acquisition deals, no doubt about it, there's going to be handoffs and little bumps in the road. There was a particular pad that came in. We had some delays. And as you know, when you're running kind of a subscale activity, just a few days or a week of delay can manifest into a larger delay when you're really trying to pick up and lay down equipment.\n\nAnd that beat us there. And so, we had a little bit of a transition issue there. But I think we've got the team up and running now, feel really good. I've bragged on many of earnings calls about the Williston team, in particular, have tremendous regard for them and faith in their execution.\n\nAnd again, this is -- integration is not necessarily normal core competency. We've taken it as one that we need to be exceptionally good at this. And I'm really proud of the results we're seeing around the organization from HR, from the IT department, from the accounting group, everybody coming together to really bring these assets in and ultimately extract the optimum value for the shareholders.\n\nScott Coody -- Vice President, Investor Relations\n\nWell, I appreciate everyone's interest in Devon today. And if you have any further questions, please don't hesitate to reach out to the investor relations team at any time. Have a good day. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nScott Coody -- Vice President, Investor Relations\n\nRick Muncrief -- President and Chief Executive Officer\n\nClay Gaspar -- Chief Operating Officer\n\nJeff Ritenour -- Chief Financial Officer\n\nArun Jayaram -- JPMorgan Chase and Company -- Analyst\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nJeanine Wai -- Barclays -- Analyst\n\nPaul Cheng -- Scotiabank -- Analyst\n\nScott Gruber -- Citi -- Analyst\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nJohn Freeman -- Raymond James -- Analyst\n\nMatthew Portillo -- Tudor, Pickering, Holt and Company -- Analyst\n\nKevin MacCurdy -- Pickering Energy Partners -- Analyst\n\nMore DVN analysis\n\nAll earnings call transcripts"
}