{
  "companyName": "Perion Network",
  "companyTicker": "PERI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/perion-network-peri-q3-2022-earnings-call-transcri/",
  "content": "Perion Network (PERI)\nQ3 2022 Earnings Call\nNov 09, 2022, 8:30 a.m. ET\n\nOperator\n\nHello, everybody, and welcome to the Perion Network third quarter of 2022 earnings conference call. Today's conference is being recorded. Press release detailing the financial results is available on the company's website at www.perion.com. Before we begin, I'd like to read the following safe harbor statement.\n\nToday's discussion includes forward-looking statements. These statements reflect the company's current views with respect to future events. These forward-looking statements involve known and unknown risks and uncertainties and other factors, including those discussed under the heading Risk Factors and elsewhere in the company's annual report on Form 20-F that may cause actual results, performance or achievements to be materially different, and any future results, performance, or achievements anticipated or implied by these forward-looking statements. The company does not undertake to update any forward-looking statements to reflect future events or circumstances.\n\nAs in prior quarters, the results reported today will be analyzed both on a GAAP and non-GAAP basis. While mentioning EBITDA, we will be referring to adjusted EBITDA. We have provided a detailed reconciliation of non-GAAP measures to their comparable GAAP measures in our earnings release, which is available on our website and has been filed on Form 6-K. Hosting the call today are Doron Gerstel, Perion's chief executive officer; and Maoz Sigron, Perion's chief financial officer.\n\nI would now like to turn the call over to Doron Gerstel. Please go ahead. \n\nDoron Gerstel -- Chief Executive Officer\n\nThank you very much. Good morning, good afternoon, everyone. Thanks for joining our third-quarter earnings call. Together with me on the call, Maoz Sigron, our CFO.\n\nBefore I dive into the quarter results, let's start by looking back to the last 8 quarters, taking the rule-of-40 model and applying it to our business. So rule of 40 is used by investors to see the long-term health and sustainability of a business. It can also be used by management to make long-term predictions and decisions. In my opinion, it's the best way to assess performance through the convergent lens of revenue growth and EBITDA margin.\n\nThe fact that Perion passes the hurdle of the rule of 40 is remarkable for the company and has done so in the last 8 quarters, as you can see from this slide. Perion needs to be viewed through this valuation lens even though it's applied to a high-growth, scalable software companies and not in my knowledge to our industry. Now I want to deal with the elephant in the room, a big elephant, which can be summarized in one question, given our quarterly results. How can we keep outperforming our peers? I keep asking this question, and I think it's more relevant today than ever before.\n\nPerion is uniquely able to react and size opportunities based on current trends that might change, but what will not change is our DNA to continue identifying trends and turn them into business opportunities. Looking at the last 8 quarters, our ability to exceed the rule of 40 is not a series of anomalous or a one-off success. Quite the opposite. We are outperforming the industry because we are built on the fundamental recognition that adtech must be able to respond underlying respond to the trends with ability and agility.\n\nLet's look at the current 4 trends that we see. And more importantly, are we able to react to those trends? Advertisers are looking for ways to increase customer engagement to enhance their brand equity, especially these days, moving away from standard ad units. And those that are not investing on brand equity in these difficult economic times, it's proven that they will pay the price. What we will show later on with few use cases is to what extent our high-impact suite for display and CTV.\n\nAnd not just keep the customer engagement really high, but allows us to keep our margin really high. The next one, advertising shifting direct response budget from social channel to search and advertising. Our intent-to-action solution known for search advertising is doing exceptionally well and will bring some figures how this is changing in terms of advertising allocation budget. Third, advertisers recognize that consumers are voting for brand that protect their privacy.\n\nOur reaction, SORT is gaining huge momentum, and we will talk about SORT and the huge momentum that we experienced in the third quarter. Last but not least, advertiser under growing margin pressure due to rapid rises in cost of goods. Our iHUB enable us to absorb pressure and maintain our high margin. And the fact of a matter, we increased our margin this quarter.\n\nDiving in into our revenue. So our revenue growth demonstrates our ability to continue shifting our business where media budgets are trending. For example, the growth of privacy trend, the growing demand for high-impact CTV, the need for retailers to transform their media business, and the fact that advertisers targeting Z generation in console game solution that I demonstrated in our last earnings call. These are all reflected in this performance.\n\nThese shifts are likely to increase, not decrease, in velocity. Therefore, ability to react becomes mandatory to continue outperforming the industry. From an EBITDA standpoint, our iHUB, Intelligent Hub, is a great example of technology innovation that serve our clients and our own financial results. Balancing supply and demand yields better efficiency both for our clients and for Perion.\n\nWe also benefit from operational efficiency, utilizing shared resources for all advertising solutions. We believe that the pressure on advertising inventory due to the macroeconomic environment will reinforce our central control system, iHUB optimizing demand and supply. Media margin increased to 41% compared to 39% in the third quarter last year. From an advertising revenue standpoint, as I point out, the trend shows the multiple ways in which advertisers are seeking to build brand recognition make an impact while respecting privacy.\n\nThe growth of video driven by our Vidazoo acquisition that happened last year demonstrate our ability to identify the right acquisition target and empower entrepreneurs to continue to grow their business. There are moments when consumer wants to lean into a small screen and others when they want to lean back and take it in the immersive experience of a large screen. Therefore, our ability to provide cross synchronization is a key factor to capture attention and provide higher return on ad spend to our clients. I show you this slide when we made the Vidazoo acquisition.\n\nThe model has served us well by attracting publisher to have an end-to-end video platform that eliminates the friction of multiple vendors. As you can see, we have nearly doubled the number of new publishers using Vidazoo platform and achieved robust growth in new spend at the same time. We believe Vidazoo will continue to grow. I want to take a more to dig into example, which I think you will find very compelling.\n\nIt demonstrates the power of two of our core competencies working together. On one hand, the high-impact ad unit; and on the other hand, targeted CTV. We ran a test. In this test, we measure effectiveness of conventional, standard CTV ad unit versus our high-impact CTV suite, as you can see it on the screen.\n\nWe did it by tracking the user that landed on clients' website in both cases. As you can see, the high-impact unit achieved a 400% increase in site visits and 400% higher conversion rate. Results like this are why advertisers will pay a premium for our high-impact units. Premium means $32 CPM compared to higher/lower teens when it comes to standard ads.\n\nThat's by itself drive another very important KPI for us, which is average deal size, which increased by 10% to $117,000. High-priced CPM help us maintain and grow our margin. The need for high impact will grow since advertisers are constantly looking to increase consumer attention. OK.\n\nWe are continually innovating new ways to measure the effectiveness of our high-impact units. So today, I'm pleased to unveil our new attention trace measurement. Its revolutionary way to measure consumer engagement, as you can see it on the slide, with our high-impact units in a real time. Let me put this technology innovation in perspective.\n\nYou may know that for decades, the traditional way to measure consumer engagement with an ad unit has been eye-tracked that works by following consumer eyes as they interact with an ad unit to measure effectiveness. But our researchers and data scientists were not satisfied with the one-dimensional model of measuring attention. So working with our partner, System One, we develop a model that includes sound along with sight. We measure that through real-time analysis, they literally traces attention and display it as consumer react.\n\nThis will provide our advertisers with a future validation of the efficacy of our high-impact units and will keep justifying our pricing model and, hence, our margin. We have a number of initiatives inside Perion which provide us with a pipeline of scalable revenue opportunities. One of them is our retail media solution. You probably know that many retailers are building their own media platform as a way to generate value for their first-party data, build an active loyalty, and compete against the giants like Amazon and Walmart.\n\nThe breakthrough for us is that this solution enable us to shift our transactional business to an always on, always on spend, which provide their predictability and sustainability we're always looking for. And the excitement of this business is that we're not waiting for the IO, we're not waiting for the campaign. This is a constant month-by-month spend over a course of the year. As you can see by the prestigious logos on this slide, this is being rapidly adopted by some of the America's most successful retailers.\n\nWhile the revenue contribution is still modest, the growth potential, even the TAM, is huge. SORT. Sort is a powerful technology for protecting privacy without storing any personal data. Our SORT business has been rapidly growing as a result of privacy trend I mentioned before.\n\nIn fact, as you may know, the FTC recently requested commentary on their proposed privacy regulation, and Perion submitted a detailed perspective. I'll be happy to share with you what with our submission. A side of our vision that the future of digital advertising must acknowledge consumer privacy. SORT function is effective flywheel that gets even more valuable and more effective as more data flows into it.\n\nNo matter which metrics you looked at versus cookies, versus Google benchmark, versus Ross, SORT comes out on top. Lastly, take a look at the quote for Mercedes, they believe what you see is so important that they want to be associated with it, and guess what, without compromising on the results. So you're able to see the Mercedes campaign here, with 58% CTR lifting SORT versus contextual and 53% CTR lift sort versus third party. Going back to the trend I mentioned earlier today and our ability to react to them, having a central hub is pivotal to increase our profitability and future growth.\n\nWe cannot predict what will happen on either side of the open web, demand or supply. Those are market forces. But we can be confident that by being in the center and having a two-way visibility, we can optimize the benefits for us and for our clients. In its first year, iHUB contributes 40% of our year-over-year EBITDA growth.\n\nAnd more importantly, our ability to capture signal from all channels to a central hub, as you can see it on your screen, and analyze them is the main factor behind SORT superior performance over other conventional targeting methods. The trades for advertiser shift budgets toward direct response continues. Pay attention to what Philipp Schindler, chief business officer at Google, said recently. I will read it for all of us.\n\nIn challenging times like this, advertisers are carefully evaluating the effectiveness of their budget. Search advertising tend to do relatively well in such environment given its strong measurability and focus on delivering ROI. It's also well suited to quickly adjust to changes in consumer behavior. And us, being a strategic partner of Microsoft, definitely enjoy this trend.\n\nOn top of this, the latest change of Apple privacy and Facebook-reduced attribution window are causing advertisers to shift budget to search advertising. We are evaluating this shift on both ends. Advertising looking to pay more on their ads reflecting a 42% increase in RPM, and hiring intent of searchers increased their CTR ratio by 27%. With that, I will turn the call to Maoz.\n\nMaoz?\n\nMaoz Sigron -- Chief Financial Officer\n\nThank you, Doron. Doron, please let me share my screen. Thank you. \n\nDoron Gerstel -- Chief Executive Officer\n\nGo ahead, please. \n\nMaoz Sigron -- Chief Financial Officer\n\nThank you, Doron. Good afternoon, and good morning to those of you joining us from the U.S. I am happy to be here today to present Perion's strong results for the third quarter of 2022. As you can see, Perion is performing extremely well.\n\nWe are overperforming our industry in each of the financial metrics, consistently improving our results during the last two years despite the global macroeconomic challenges and market volatility. The adtech industry is not immune to the challenges. We are navigating our way between the market shift, thanks to our diversification strategy, our ability to execute, our agile business model, and our innovative solutions. Giving the sense of our sustainable and predictable business model, which gives us good visibility and the action we have taken to reduce costs and penetrate new fast-growing market segment, we are updating our guidance and are positive about next year.\n\nLet's look at the key financial achievements this quarter, reflecting the strength of our business model and our ability to execute our strategy. Revenue of $158.6 million, reflecting 31% year-over-year growth, the highest quarterly revenue since 2014. Adjusted EBITDA of $33 million, 21% of revenue compared with 15% last year, reflecting 87% year-over-year growth. Net -- GAAP net income of $25.6 million, 141% year-over-year growth, the highest quarterly net income since 2014.\n\nNon-GAAP diluted earnings per share of $0.61, reflecting 53% year-over-year growth. Turning now to the quarterly results in more detail. The third-quarter revenue was $158.6 million, an increase of 31% year over year. The strong continuous revenue growth reflects a CAGR of 38%.\n\nDisplay advertising revenue increased by 26% year over year to $86.8 million, 55% of total revenue. Market adoption of our holistic video platform solution continue to rise. Video revenue more than tripled year over year, representing 44% of display advertising revenue. The number of video platform publishers increased by 88% year over year from 34 to 64, and the revenue from retained video platform publishers increased by 67% year over year.\n\nPerion CTV is also gaining traction, growing by 134% year over year, representing 9% of total display advertising revenue. Our unique privacy first SORT solution is seeing more interest from advertisers and agencies, who are becoming more aware of the importance of consumer privacy. The number of SORT customer rose to 140 this quarter, 11% increase quarter over quarter. SORT customer spending increased by 25% during that period, now representing 17% of display advertising revenue.\n\nThe third-quarter search advertising revenue increased by 38% year over year to $71.8 million, in line with the recent trend of advertiser favoring our intent direct display advertising. The year-over-year increase in revenue was driven by a 42% increase in RPM and a 60% increase in publishers. The 60.9 million daily searches on average reflects an increase of 15% year over year. Let's look at the revenue mix, which reflects our strategic business diversification.\n\nThe third-quarter display advertising revenue accounted for 55% of the total revenue compared with 57% in 2021, with search advertising representing 45% of revenue compared with 43% in 2021. We continue to expand into fast-growing video, CTV, and retail business, which now accounted for 57% of display advertising compared with 28% in Q3 2021. We are benefiting from the current shift try intend search advertising. Our media margin continued to improve year over year.\n\nRevenue, excluding TAC, was $65 million or 41% of revenue compared with $47.4 million in the third quarter of 2021 or 39% of revenue. Over the last year, we have created the intelligent app with several processes and automation by leveraging data and buying power in order to control and improve clearance media buying system. This has resulted in better financial terms that translate into better selling power, which is reflected in our financial results and more specifically in the media margin. Third-quarter opex and COGS amounted to $31.7 million or 20% of revenue compared with $33.1 million or 27% of revenue last year.\n\nThis impressive achievement reflects the execution of our business strategy. Perion DNA and state of mind is growing the business while keeping and improving efficiency. Over the last few years, we invested mediums in technology, automation, and offshoring part of our business. We have improved budget control and are consistently looking for a new initiative for Perion efficiency.\n\nOn a GAAP basis, net income was $25.6 million or $0.53 per diluted share, an increase of 141% compared with $10.6 million or $0.28 per diluted share in the third quarter of 2021. On a non-GAAP basis, net income was $29.9 million or $0.61 per diluted share, an increase of 94% compared with $15.4 million or $0.40 a diluted share in the third quarter of 2021. Adjusted EBITDA of $33 million, reflecting 94% year-over-year growth. Adjusted EBITDA margin of 21% compared with 15% last year.\n\nAdjusted EBITDA to revenue, excluding TAC, increased from 37% in the third quarter of 2021 to 51% during the third quarter of 2022. Our excellent financial performance is not limited to P&L only. Operating cash flow was $34.7 million compared with $14.2 million in the third quarter of 2021, reflecting 145% year-over-year growth. As of September 30, 2022, we had cash, cash equivalents, and short-term bank deposits of $390 million compared with $322 million as of December 31, 2021.\n\nWe are continuously generating positive cash flow. The $390 million in cash will serve as a valuable resource to execute both organic and inorganic growth opportunities. This concludes my financial overview. Doron, please go ahead. \n\nDoron Gerstel -- Chief Executive Officer\n\nJust a second. Given our strong performance and our sustainable and predictable business model and the good visibility into the fourth quarter, we're increasing our guidance for 2022 substantial. More specific, we are calling for $630 million to $640 million in revenue by the end of the year and at least $120 million of EBITDA. This represents 72% year over year on the EBITDA growth or 33% year-over-year growth from -- on the revenue side.\n\nAnother note here is that our CAGR on the revenue between '20 to 2022 is 39%, and the CAGR on the EBITDA on these 3 years is 91%. Ending note, let me go back to how I started this presentation. Since I became CEO in April of 2017, my mission has been to build the company of the future for the future. That means a company that would be strategically diverse and also lightweight and fluid, so a future of volatility where new trends would emerge.\n\nOthers would become less relevant, and we're a successful company needed to shorten the reaction cycle, or it would be outrun by circumstances beyond its control. We've built a company that makes the trends the trends, and what -- and that's why we are outperforming the market and can continue to do so. In a year, those four trends may change. but it doesn't matter to Perion because we will be able to react immediately to the new trends, gain market share in a high profitability while driving client satisfaction.\n\nI'd like to close this call by thanking my team because without their ability and agility, we would not be where we are today. And together, we will continue achieving what we do next. Thanks so much. With that, let's open the line for Q&A. \n\nOperator\n\nThank you. We will now be conducting the question-and-answer session. [Operator instructions] One moment please while we poll for your questions. Our first questions come from the line of Eric Martinuzzi with Lake Street Capital Markets.\n\nPlease proceed with your questions.\n\nEric Martinuzzi -- Lake Street Capital Markets -- Analyst\n\nYes. Congratulations on the strong quarter and the good outlook. Just curious to know, I know you released your prelim Q3 results on October 5. What did you learn during the month of October as far as the trends in the industry different maybe than what you saw in Q3?\n\nDoron Gerstel -- Chief Executive Officer\n\nNo, we didn't -- I don't think that there are changes in October. But what we're able to see these days is that this is going to be definitely a strong holiday season, definitely, when it comes to demand for our advertiser on all channels.\n\nEric Martinuzzi -- Lake Street Capital Markets -- Analyst\n\nOK. And as far as your competitors go and just other players in digital marketing, there's definitely been a dramatic deceleration. You went through some of the reasons why Perion has not experienced those same deceleration. But -- and I know you're not giving guidance on 2023, but the organic growth that you've guided to for Q4, I believe, were in the neighborhood of high 20%.\n\nWhat's the sustainability of that beyond Q4? \n\nDoron Gerstel -- Chief Executive Officer\n\nSo I must say that, that was the heart of our presentation, and it's our ability to keep growing the way we did in the last 8 quarters. I think that diversification is definitely something which is important, but our ability to identify those trends and react quickly is giving us a lot of confidence on our ability to maintain grow our business. The foundation is definitely there. The foundation from the hub perspective is giving us a huge cost leverage, and the foundation of our ability to go after new markets.\n\nI think that what we are able to achieve with those reseller is definitely evident. Retail marketing is one of this. We are investing a lot on developing new, high-impact formats, mainly for the CTV. We have advanced conversation with Microsoft advertising.\n\nAs far as our ability to leverage our great reputation from the search part of the business into Xandr and PromoteIQ, the two acquisitions that Microsoft advertising, this is all part of 2023. So we are quite optimistic. We are aware of what is going around. It makes us that we need to really work harder than how we performed in the past. \n\nEric Martinuzzi -- Lake Street Capital Markets -- Analyst\n\nOK. And then lastly, you talked about taking share in social. Is that anecdotal color that you're getting? I mean -- or do you have a view into your customers are telling you, hey, we're pulling this much out of social and we're shifting it over to search specifically on that direct response budget shift? \n\nDoron Gerstel -- Chief Executive Officer\n\nSo there are two, I think, two major events that happened on social. One has to do with iOS 14. That was kind of a year ago. And second, the fact that the attribution window in Facebook is being reduced from 28 days to seven days.\n\nThose are a mega event when it comes to advertisers that definitely view the effectiveness of social advertisers and from a targeting standpoint. And that's -- we definitely see shift from social into search because there is nothing compared to the intent of the consumer that you're able to target in search advertising. So we see a rise there. As an evidence of it, we shared the RPM increase and the CTR.\n\nThis all reflected that advertisers are willing to pay more to have their ad associate with a keyword this year or this time compared to last year. The CTR shows that there are more qualified, qualified in respect to high-intent consumer that will be exposed to those ads and being reflected on the CTR. So all in all, definitely a shift, and I think it was part of what we keep saying for a long time that Perion is in a very interesting position that we are able to capitalize on those shifts that is happening. And this is the nature of this industry because from the eyes of the chief digital officer that need to allocate its budget wisely among those 3 main pillars, they shift budget because of what's happened.\n\nAnd the question is how we will be victim of being a point solution that's not able to do anything when there is different trends or you were able to diverse your offerings and capitalize on those trends, and I'm glad that we are on the latter than the former. \n\nEric Martinuzzi -- Lake Street Capital Markets -- Analyst\n\nI am glad of that as well. Thanks for taking my questions.\n\nDoron Gerstel -- Chief Executive Officer\n\nThanks so much.\n\nOperator\n\nOK. Thank you. Our next question comes from the line of Laura Martin with Needham & Company. Please proceed with your questions.\n\nLaura Martin -- Needham and Company -- Analyst\n\nHey, can you hear me OK?\n\nDoron Gerstel -- Chief Executive Officer\n\nYeah, we can hear you. Hi, Laura.\n\nLaura Martin -- Needham and Company -- Analyst\n\nHi, hi. So great numbers. Wow, what a performance, congratulations. I guess my first question is, as you think about cost next year, one of the things I'm curious about is we have Twitter laying off half of their workforce.\n\nAnd Meta today, laying off 13% of their workforce. I'm wondering if that -- my first question is, does that give you opportunities to pick up some excellent engineers and maybe build your cost but really upgrade and add to your talent base because of some of these talented people getting laid off in your -- in the sort of digital ad industry?\n\nDoron Gerstel -- Chief Executive Officer\n\nRight on. Our HR is already all over. They are using LinkedIn, and they're using any other resources because there are some great engineers there. And we have great -- Israel is a small community, and I'm glad that Facebook has a huge lab here.\n\nSome of them are, unfortunately, looking for a new home. And I think that we have a huge data scientist team that is working on our iHUB. And if they're hearing me now, that's definitely a good place for them. But we are seeing it a great opportunity.\n\nWhen it comes to Twitter, I must say that there is a very interesting thing that we noticed that has to do with privacy, nothing from the employment, and there is some hesitation from advertisers. It's kind of they're on the fence. They're not sure yet what is going on, and we see it immediately when they are shifting budget to other channels. So that's -- I don't know how long this trend will continue, but I can tell you that advertiser acting quite quickly when they are shifting from channel or within channels, and that's something that we notice immediately after the announcement of the Twitter-Musk acquisition. \n\nLaura Martin -- Needham and Company -- Analyst\n\nAnd then on interactive ad units, I'm wondering how important you feel that, that is a driver to your 2023 revenue. \n\nDoron Gerstel -- Chief Executive Officer\n\nYou're talking about the interactive ad units? Say again, Laura. You're -- I'm not -- Laura? \n\nLaura Martin -- Needham and Company -- Analyst\n\nCan you hear me or not?\n\nDoron Gerstel -- Chief Executive Officer\n\nNow I can hear you, but I didn't hear the question well. Can you repeat? \n\nLaura Martin -- Needham and Company -- Analyst\n\nYes. So I was asking about how important are interactive ad units to drive revenue in 2023. \n\nDoron Gerstel -- Chief Executive Officer\n\nVery good. So interactive ad units, especially on the CTV side is part of what we call high-impact suite. It is not the pivot of it. It's a feature.\n\nThere are some that like it, some not. There is -- I can tell you that I talked a bit about the laid-back type of experience. It is really interesting to note to what extent when you were laid back. The whole performance CTV is very much under kind of a question mark that the interactive holds very well as a way to interact with your TV, make an action.\n\nI must say that at this point, the majority of our advertiser is looking at it that the viewer is more passive than we were kind of hoping. So it is there, but it's not more than, let's say, 10% to 15% of the overall CTV spend. \n\nLaura Martin -- Needham and Company -- Analyst\n\nVery helpful. Thank you very much. Congratulations on great numbers.\n\nDoron Gerstel -- Chief Executive Officer\n\nThanks. Thank you.\n\nOperator\n\nThank you. Our next question has come from the line of Andrew Marok with Raymond James. Please proceed with your questions.\n\nAndrew Marok -- Raymond James -- Analyst\n\nThanks for taking my questions. So the trends on SORT look really encouraging. I guess what does it take to get SORT more involved and more advertisers campaigns? Is it really just an awareness issue right now? And then secondly, kind of separately on the search market. I guess could we drill down a little bit there? Because your search business is growing well in excess of the total search market.\n\nJust to get a little sense of some of the drivers there. We understand the shift toward search in a pressured macro environment. But what particularly are you guys doing well? Thank you. \n\nDoron Gerstel -- Chief Executive Officer\n\nGood. Thank you. So first on SORT. So there are two drivers behind SORT, which makes it quite important.\n\nI used the word flywheel, but we truly believe that that's a flywheel. So first and foremost, from a technology and data standpoint, more SORT campaign we're doing, the better we are. That's a very important figure, and I'm happy that we are able to perform well. Now keep in mind that there are 2 forces here that's pushing SORT.\n\nOne, it's coming from advertisers that they realize that consumer prefer brand that protect their privacy. It's part of a bigger movement, which is ESG movement. And when we're dealing with a premium advertiser, that's a very important argument. However, at this point with all the respect to privacy, they said, \"Well, we love what you're doing, but we don't want to compromise on performance.\" So all of them with no exception, and Mercedes was one of them, that's expecting us to do an ABC benchmark: a, SORT; b, third-party; and c, contextual targeting in order to benchmark the performance of SORT.\n\nThe other thing which is very interesting is what's happening from a legislation standpoint. And that's a very, very interesting movement. Even though it will take time. we have a feeling that that's -- this trend definitely left the stage.\n\nSo that's what makes really SORT moving. Now to your question, we are working, as we speak, right now on SORT as a service. In other words, currently, SORT is being used at Perion with no exception. And we are -- our intention is to go beyond Perion and have it as a service, the service that we were able to work with publisher, other DSPs, and make it a common use.\n\nSo far, we are in -- we've just completed a very, very cautious test. Keep in mind that we need to be a very rigid response time, which is less than 2 milliseconds on this service. So it's quite a technology challenge. But so far, definitely, so good.\n\nThere is a great market reaction to it. So from a product market fit, definitely, we check this box. So all in all, we are very, very confident on our ability to provide the service even on the first half of next year. Now when it comes to the second question that has to do with what we are doing better when it comes to search advertising.\n\nSo what we are doing better very much has to do with our partner, Microsoft advertising. So Microsoft identified that there is a time, and they are putting a lot of efforts behind it. It has to do with new products that we launch during -- in this quarter. It's called Microsoft Trends.\n\nAll in all, there is a huge effort from their side, and what they realize is what's happening with Google or with other search. So they're expanding to new countries, they're putting more resources on product, and that's reflected on our numbers. \n\nAndrew Marok -- Raymond James -- Analyst\n\nGreat. Thank you. \n\nDoron Gerstel -- Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThank you. Our next questions come from the line of Jeff Martin with ROTH. Please proceed with your questions. \n\nJeff Martin -- ROTH Capital Partners -- Analyst\n\nGreat. Can you hear me? \n\nDoron Gerstel -- Chief Executive Officer\n\nYes. Hi, Jeff. \n\nJeff Martin -- ROTH Capital Partners -- Analyst\n\nYes. Hi. Congrats on a wonderful quarter. I wanted to drill down a little bit more on the publisher growth within search up 60% year over year.\n\nYou're obviously expanding into new countries. I was curious if there's things beyond that, if the high-impact capabilities within search are attracting publishers. Is there anything in particular that is driving that other to growth? And what your outlook for additional increase in publisher additions over the next 12 to 18 months looks like? \n\nDoron Gerstel -- Chief Executive Officer\n\nSo just a small correction. The high impact has to do with the display, and search has nothing to do with the high impact that we're doing. But to your question, when it comes to publisher, definitely, with the new product that we're launching, we're looking about two parameters: the increase in spend that existing publisher is doing; and the other one, our ability to attract net new publisher, and that's going very well in both ends. The fact that we are become bigger and bigger gives us also a better rev share rate, which we are able to share with our publisher and makes us even more competitive compared to other partners.\n\nSo -- and that gives us an advantage to attract even more publisher. \n\nJeff Martin -- ROTH Capital Partners -- Analyst\n\nGreat. And then just I was curious if you could give some insight into the potential to continue to grow the average campaign size or average client spend. I think $117,000 in the quarter, and that's up nicely year over year. What are some of the factors as we head into 2023 that will enable that to continue to grow? \n\nDoron Gerstel -- Chief Executive Officer\n\nAbsolutely. So the main factor, of course, has to do with the units. So the whole notion of going into a high impact opposed to standard is you spend more, yet, it all need to be translated to a higher return on net spend. Quite an effort to educate our customers.\n\nDon't measure us based on what you spend, measure us based on what you gain out of this campaign even though you pay premium. And I mentioned the $32 CPM, which is a very, very high number. So it has to do with continue with the high impact. That's one.\n\nSecond, it's very important for us to come with this campaign with multiple screens. I mentioned how important is to having one campaign, the ability to run into multiple screen and ability to synchronize between your -- those screens because it's quite different on price. And it's very effective because the consumer is changing screen in his way to work, at work, at home, and you name it. So that's another factor.\n\nWhile we're able to have more screen in a single campaign, that's increased dramatically the spend. Now it speaks very well the agency and the brand that are looking more than ever to minimize the number of vendors. So when you're coming with holistic solution that cover all their needs on multiple screens, they are willing to give you more and more business. And it's not secret to say that getting $117,000 average deal IO, it's the same effort in getting a name.\n\nFrom a sales standpoint, it's the same effort. For everything, it's the same effort because creative is being done, and activation is being done. And you need to set the plumbing, and you need to do reporting, and you need to do everything. That's a net-net margin that we're able to get.\n\nSo this is one of the -- I think the most important parameter that we should look at. And we are doing tremendous effort to increase the spend, but at the same time, it needs to be translated to increase value for the perception of the customer. Otherwise, it will -- it cannot be done. \n\nJeff Martin -- ROTH Capital Partners -- Analyst\n\nGreat. And then last question for me if I could. You've got a pretty sizable cash flow at this point. Could you give us a look under the hood at what M&A might look like in 2023? Are you planning on continuing down that strategic path? \n\nDoron Gerstel -- Chief Executive Officer\n\nYes. So first of all, I must say that I answered this question beginning of 2022. And honestly, I was kind of thinking that we're able to do. If I remember I said one and maybe two even, and the situation is a bit different, and I think that we all understand that it works really hard to be in this position where we have now close to $400 million of net cash and no debt.\n\nIt gives us a wonderful position. We are looking for accretive, specific target that we identify. I can tell you that we are definitely focusing on it. The intention, I now need to be more careful than last year, so the intention is definitely doing it in 2023.\n\nThat's the intention. There are some great opportunity. It's there for us, and I'm very optimistic. \n\nJeff Martin -- ROTH Capital Partners -- Analyst\n\nGreat. Thank you.\n\nDoron Gerstel -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nThank you. Our next question comes from the line of Mark Kelley with Stifel. Please proceed with your questions.\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you very much. I wanted to ask you about -- you called out a strong holiday season is your expectation for this year. And Criteo is just one company in particular that called out a lack of an early holiday ramp in ad spend, and it sounds like maybe you're not seeing that.\n\nI guess is the shape of the fourth quarter playing out as you would typically expect so far? That's my first question. And the second one is, and if you answered this, I apologize, but can you please give us the pro forma growth rate for 3Q with Vidazoo? Thank you. \n\nDoron Gerstel -- Chief Executive Officer\n\nVery good. So as far as the Q4 so far, November 9, we're definitely -- which we are almost in the mid of the quarter, we are definitely not seeing any slowdown. Plans as they were before. It may be changing mix between the different channel.\n\nYes, that's definitely something which we couldn't project. But as I mentioned before, the fact that we are diverse gives us a way to capitalize on these changes and the overall looks as we plan. \n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nPerfect. Thank you. And then on the pro forma growth for 3Q, if you could give us that, that would be great. \n\nMaoz Sigron -- Chief Financial Officer\n\nMark, thank you for the question. We are with per forma above 15% for Q3. Again, this is -- as mentioned during the last call, it's difficult for us to measure the exact number due to the synergy that we have between Vidazoo and the rest of the business unit, which is good. But yes, this is more or less the number.\n\nAnd again, as mentioned during the last call, part of the IR benefit is definitely for Vidazoo, the joint, and contribute a lot to the bottom line to the EBITDA. \n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nAll right. Thank you. And the 15, one, five, right? Just to make sure. \n\nMaoz Sigron -- Chief Financial Officer\n\nOne, five.\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nOK. Thanks very much. \n\nOperator\n\nThank you. Our next questions come from the line of Jason Helfstein with Oppenheimer. Please proceed with your questions.\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nI'll ask one. So it's very clear as earnings are playing out, obviously, a lot this morning last night that right now like being a demand-type platform is definitely a more attractive way to be because you control effectively like the buying decision as opposed to accepting the bids. In addition, being multi-platform is increasingly important. And then you're also seeing significant benefit by having supply side capabilities on the margin and control inventory.\n\nSo far, as we've seen companies scale to tie the marketplaces, it's been incredibly difficult. I mean talk about kind of where you see the kind of plan from here, kind of both organically and through M&A continuing to be a two-sided marketplace, which is clearly working in your favor. Thank you \n\nDoron Gerstel -- Chief Executive Officer\n\nYeah. So first of all, Jason, right on. I mean that's a good description, I think, of why we're able to perform quarter after quarter. I can tell you that from an organic standpoint, there is a lot that we can grow.\n\nI mentioned few areas. On the display side, we're definitely putting a lot of efforts on retail media. I think that, definitely, the customer that we're talking with are very much behind on their media business. And they all want to be where Amazon and Walmart, and others are today.\n\nThey have the data. They have the data. That's the point. The challenge for us is to take them and from where they are today to where they need to be, and I'm very happy that we're able to do it even in an always-on fashion.\n\nIt's only the start, but that's definitely an area that we are planning to invest more. That's from a vertical perspective. When it comes to the video, there is quite a very interesting thing that's happening also that those publishers that are joining are very much putting all their video business on our platform, which gives us another very interesting, what we call, stickiness kind of business. The cost of transitioning or the cost of switching is so high, and we're always looking for those kind of things that gives us more stability and more predictability on our business.\n\nSo I think that there is a great way organically to grow the business, as I mentioned in the call. In terms of the acquisition, yes, we identify two areas where we want -- CTVs definitely remain high. We truly believe that there are some very, very interesting company in this domain. We're going after those companies.\n\nWe are where we are today and what we are -- want to accomplish, this need to be a company that definitely represents a leadership position in the domain, not less than that. It's not going to be a technology acquisition. It's definitely a business acquisition, which have are prominent first-tier agencies and customer. This is what we put, and this is the screening that we're doing at this time, and there are some interesting opportunities there.\n\nOther area, which is something that we start working and start evaluating, it has to do with digital out-of-home. We think that this is really interesting, especially when we are looking about convergence of digital out-of-home and retail. Having screens in the retail is very interesting. At least, this is something that we are hearing from our retail business.\n\nSo those are the two areas that, at this point, we're looking at. Hello? Hello?\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nI'm all set. You can go to the next question. \n\nDoron Gerstel -- Chief Executive Officer\n\nOh, thank you. Bye, Jason. Operator? \n\nOperator\n\nThank you. There are no further questions at this time, so I'll hand the call back over to you for any closing comments. \n\nDoron Gerstel -- Chief Executive Officer\n\nVery good. All right, guys, thank you very much for joining, and we'll see you next time. Thanks again. Bye-bye. \n\nMaoz Sigron -- Chief Financial Officer\n\nBye bye.\n\nDoron Gerstel -- Chief Executive Officer\n\nBye-bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDoron Gerstel -- Chief Executive Officer\n\nMaoz Sigron -- Chief Financial Officer\n\nEric Martinuzzi -- Lake Street Capital Markets -- Analyst\n\nLaura Martin -- Needham and Company -- Analyst\n\nAndrew Marok -- Raymond James -- Analyst\n\nJeff Martin -- ROTH Capital Partners -- Analyst\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nMore PERI analysis\n\nAll earnings call transcripts"
}