{
  "companyName": "Oscar Health, Inc.",
  "companyTicker": "OSCR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/oscar-health-inc-oscr-q2-2022-earnings-call-transc/",
  "content": "Oscar Health, Inc. (OSCR 2.08%)\nQ2 2022 Earnings Call\nAug 11, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. My name is Christian, and I will be your conference operator today. At this time, I would like to welcome everyone to Oscar Health 2022 second-quarter conference call. All lines have been placed on mute to prevent any background noise.\n\nAfter the speakers' remarks, there will be a question-and-answer session. [Operator instructions] Thank you. I would now like to turn it over to Cornelia Miller, vice president of corporate development and investor relations, to begin the conference.\n\nCornelia Miller -- Vice President of Corporate Development and Investor Relations\n\nThank you, Christian, and good afternoon, everyone. Thank you for joining us for our second quarter 2022 earnings call, where we'll walk through our results and our trajectory for the rest of the year. Mario Schlosser, Oscar's co-founder and chief executive officer, and Scott Blackley, Oscar's chief financial officer, will host this afternoon's call, which can also be accessed through our Investor Relations website at ir.hioscar.com. Full details of our results and additional management commentary are available in our earnings release, which can be found on our Investor Relations website at ir.hioscar.com.\n\nAny remarks that Oscar makes about the future constitute forward-looking statements within the meaning of the safe harbor provisions under the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by those forward-looking statements as a result of various important factors including those discussed in our annual report on Form 10-Q for the quarterly period ended March 31, 2022, filed with the SEC and our other filings with the SEC, including our quarterly report on Form 10-Q for the quarterly period ended June 30, 2022, to be filed with the SEC. Such forward-looking statements are based on current expectations as of today. Oscar anticipates that subsequent events and developments may cause estimates to change.\n\nWhile the company may elect to update these forward-looking statements at some point in the future, we specifically disclaim any obligation to do so. This call will also refer to certain non-GAAP measures. A reconciliation of these measures to the most directly comparable GAAP measures can be found in our second quarter 2022 press release, which is available on the company's Investor Relations website at ir.hioscar.com. With that, I would like to turn the call over to our co-founder and CEO, Mario Schlosser.\n\nMario Schlosser -- Co-Founder and Chief Executive Officer\n\nThank you, Cornelia. Hello, everyone, and thank you for joining us. Today, Oscar is serving more members and more clients across the healthcare system than ever before. And I'm proud of how our products are making healthcare more affordable and more accessible for so many.\n\nIn the second quarter, we have continued to build our momentum this year, and we're excited to provide an update on the progress we have made across a number of our priorities. As you know, we nearly doubled in size this year in terms of membership. And even with this dramatic growth, our results from the first half of the year are on track, and we remain confident in our ability to deliver on our guidance for the full year. Today, we report that direct and assume policy premiums increased 101% year over year to 1.7 billion for the second quarter of 2022.\n\nOur medical loss ratio was 82.2% in the quarter, a decrease of 20 basis points year over year. We are seeing meaningful operating leverage from our scale in our adjusted admin expense ratio, which improved 140 basis points year over year, and we are entering the back half of the year well positioned to deliver on our full-year outlook. Looking first at our individual business. As you know, we have meaningfully increased the scale in our insurance business and now serve over 1 million members.\n\nWe now cover approximately one out of every 13 individual ACA lives or roughly 7.5% of the overall ACA markets. In these specific regions, where we sell our plans, our market share is roughly 16%. And even with our growth this year, we continue to see industry-leading Net Promoter Scores, particularly in states like Florida, where we have a large membership base and a score of 56 Net Promoter Score this past quarter. In the first half of the year, in addition to supporting the significant increase in our scale, the team has been focused on initiatives to reach insurance profitability in 2023.\n\nWe have developed an impressive number of product features and platform enhancements with the majority focused on lowering the total cost of care for our members and improving operational efficiency. I'd like to give you a few examples for this. Let me start with our expanded use of what we call our care journeys. These are our automated fully digital outreach campaigns designed to improve clinical outcomes.\n\nWe use them in our case management, and we use them in our Oscar virtual care teams. One of those care journeys, which leverages a fully automated EMR integration to prompt providers about required screenings has resulted in about 10% higher adherence for three primary cancer screening metrics year over year. We also talk about what we are doing to address some common issues that impact managed care organization in the same vein of the process improvements and tech improvements we've been implementing. For example, we have refactored our system to improve the coordination of transferring members from out-of-network to in-network facilities.\n\nThis work is designed to provide our members with the holistic support they need for longitudinal care, and we have successfully transferred about 60% of all temper transfers so far this year. Finally, a great example for another one of the many issues generally in healthcare that's reduced overall medical costs and improve member experience and improve provider satisfaction is a process that we call the total cost of care process. So, we constantly detect overall utilization or overflowing costs. And that process is affected by recently increased utilization of the treatment of uterine fibroids due to increasing awareness of the issue and a population getting older.\n\nAnd we saw that the treatment of occurs with an outdated treatment protocol. There is recently a FDA approval of a new less invasive procedural treatment condition. And so, we were able to quickly modify everything from claims logic to provide campaigns, to member campaigns and communication, including how this all shows up on our digital products in order to focus utilization, improve outcomes and drive down the total cost of care for these members. To be able to do something like that quickly is a great example for the wholesome impact of a tech-driven insurance company.\n\nWe are also pushing ahead administrative efficiency projects, including continued improvements to our claim system to improve payment accuracy and the strategic replacement of some vendors. As we look ahead to 2023, we are prioritizing margin expansion in our individual business. The pricing submitted for 2023 plans, we expect an average rate increase in the high single-digits and we have assumed that the ACA enhanced subsidies are accepted. Now, about 10 years that we are in this market, and we think we understand the ACA market very well, including the local nature of many of these individual rating areas.\n\nSo, our pricing is nuanced and focused on margin expansion, while maintaining a competitive market position in key markets for 2023. For C+O, our small group products we have had a particularly strong first half of the year with respect to growth. Recently, we reached the 50,000-member milestone, which is up 10x year over year. We continue to hear positive feedback from the market about the unique product we have developed there, and we are excited to announce that we plan to expand into the Philadelphia markets, starting on 1/1/2020.\n\nAnd we look forward to building on our collectively strong brand presence there. We also look forward to growing our virtual primary care offering for 2023 across the book and into more markets. In fact, expanding further on our technology platform, I'll ask Oscar, let me provide an update on how we are prioritizing our resources. First, as I said earlier, we have been focusing substantial resources on enhancing our infrastructure to serve the dramatic increase in membership we achieved during open enrollments and most importantly, to drive the insurance company toward profitability in 2023.\n\nSecond, we have devoted potential resources to the Health First implementation and the resolution of post-launch challenges that we are experiencing due to the complexity of a comprehensive integration at this scale. Now, given these two demands and our resources, we will not pursue full-service Plus Oscar deals for implementation in the next 18 months. We certainly remain committed to the Plus Oscar business. Our ongoing engagements with the market reinforces our decision to deliver our offering increasingly as Software-as-a-Service and to deliver a more modularized offerings.\n\nNot only do these offerings typically involve issued sales cycle, but we are also doing that Plus Oscar can deliver meaningful value to providers and other players looking to take on more risk that these organizations see value in lower modular solutions. So, we are actively moving forward with the development and the sale of campaign builder, our first Plus Oscar modular products. Here are conversations with prospective clients are progressing well. As the team prepares the technology for externalization, we are also adding important features, based on market feedback.\n\nSpecifically, we recently launched a next best action feature, which services only the highest priority messages at any given time to members to improve conversion rates. As the features launched, almost 51% of Oscar members have engaged in a campaign with engagement rates of 55, and we expect our campaign builder of clients will benefit similarly from the new future. Now, before I turn the call over to Scott, I'd like to spend a moment talking about the regulatory and legislative landscape that could impact the total additional market size in individual for 2023. With regard to subsidies, we are pleased to see pass the Inflation Reduction Act and as you know, that includes an extension to the enhanced ACA subsidies to 2025.\n\nWe expect that the package will pass in the House as well and that the enhanced subsidies will continue for the next few years. With regards to Medicaid redeterminations, regardless of whether the public health emergency is extended in October or beyond October, we predict that the majority of redeterminations will occur in 2023. Importantly, we have included an assumption for Medicaid redeterminations in our 2023 pricing. We believe these items, in combination with the potential for addressing Family Glitch, should be a tailwind to expanding ACA markets next year.\n\nWith that, I'll turn the call over to Scott.\n\nScott Blackley -- Chief Financial Officer\n\nThank you, Mario, and good afternoon, everyone. Our second-quarter results show solid execution across our businesses. We have delivered against our 2022 plan through the first half of the year, and we are reiterating our full-year guidance. We ended the second quarter with approximately 1 million members, an increase of 84% year over year, driven by growth predominantly in our individual and small group books of business.\n\nNet churn through the first six months is trending positively compared to our historical experience. In the quarter, our lapse rates were favorable, and we had modest special enrollment member adds. Second quarter direct and assumed policy premiums increased 101% year over year to $1.7 billion, driven by higher membership and business mix shifts toward higher premium silver plans. Turning to medical costs.\n\nOur medical loss ratio was 82.2% in the quarter, an improvement of roughly 20 basis points year over year. This improvement was driven by pricing actions, lower COVID net costs, and initiatives targeted at reducing the total cost of care. We also had some offsets from a lower amount of favorable prior-period development compared to the prior year, which was $42 million favorable this quarter versus $54 million favorable last year. Key drivers of the PPD this quarter include significant favorable current year development related to the first quarter, which was partially offset by net unfavorable development related to 2021 risk adjustment.\n\nOn a year-to-date basis, we've had negative prior-year development of approximately $42 million, which was related to 2021 and 2020, and which we believe are driven by issues that are specific to those periods. Turning to utilization. We saw direct COVID costs that were down year over year and quarter over quarter. Importantly, based on what we are seeing in our data, we believe the current COVID wave has peaked.\n\nRegarding non-COVID utilization, it was slightly below baseline in the quarter, which effectively offset our COVID costs. I also want to note that as we expected, the MLR performance of our 2021 SEP members who we retained in 2022 has thus far been consistent with other members from open enrollment. Compared to 2021, we anticipate lower new members via the special enrollment period in the second half of this year, which we expect to be a tailwind to our year-over-year MLR performance. Looking into administrative costs.\n\nOur second quarter 2022 insurance company administrative expense ratio was 19.5%, an improvement of 30 basis points year over year, driven by fixed cost leverage and variable cost efficiencies. Besides on greater operating leverage from our scale in our adjusted administrative expense ratio, which improved 140 basis points year over year. This improvement is notable, given the fact that we continue to make investments to meet the increased scale of the business.Importantly, we are focused on tightly managing our controllable costs in the second half of the year to ensure our expense base going into 2023 is aligned with our profit targets. Our overall combined ratio, which is the sum of our medical loss ratio, and the insurance company administrative expense ratio was 101.7% in the quarter, an improvement of 50 basis points year over year, driven roughly equally by the MLR and the insurance company administrative expense ratio and improvements that I previously mentioned.\n\nOn a year-to-date basis, our combined ratio is 99.6%, reflecting a consolidated profit across our insurance companies. Our second quarter 2022 adjusted EBITDA loss was $76 million which was $25 million higher year over year, but as a percentage of premiums before ceded reinsurance improved by 130 basis points from last year. Turning to the balance sheet. We ended the quarter with over $3.6 billion in total company cash and investments, including $611 million of cash investments at the parent and another $3 billion of cash investments at our insurance subsidiaries.\n\nAt the end of the quarter, we had $670 million of statutory capital are at our subsidiaries, including $150 million of excess capital. At this point, we believe we are well capitalized for the next couple of years under our plan. Based on the results to date and our forecast for the second half, we are reaffirming our guidance across all of our metrics for 2022. Our second quarter and year-to-date results are in line with our plans, and we believe lay the groundwork for us to achieve insurance company profitability in 2023.\n\nWith that, let me turn it back to Mario.\n\nMario Schlosser -- Co-Founder and Chief Executive Officer\n\nThanks, Scott, and thanks to all of you for joining our call today. I'd like to close by reiterating a few key points. We are drafting off the strong momentum in our first two quarters, and I'm achieving our full-year guidance. We are on track with our plan to achieve profitability in our insurance business in 2023, driven by our disciplined pricing strategy, by our admin efficiency work, and by our medical cost management initiatives this year.\n\nAnd that has been due to a lot of very, very hard and focused work. So, I would like to thank all the Oscar employees. It's their dedication and tenacity that makes this possible. With that, we'll turn it over to the operator for the Q&A portion of the call.\n\nOperator\n\nThank you. [Operator instructions] And your first question comes from the line of Michael Hall with Morgan Stanley. Your line is open.\n\nMichael Hall -- Morgan Stanley -- Analyst\n\nHey. Thank you, guys. First question, just any update on how 2021 on a risk adjustment payable settled out? And also, given your prior analysis of your weighted risk-adjustment report, could you update your 2022 risk adjustment assumptions? I know that your risk adjustment transfer of payables went up about $400 million this quarter. Curious, how much did it impact your MLR performance? Thanks.\n\nScott Blackley -- Chief Financial Officer\n\nYes. Let me just give you an overview of what happened with PPD and risk adjustment. So, in the quarter, we received both the final CMS report for 2021, and we also got the first quarter -- we got the 2022 report from Wakely. And so, those two things came into the quarter, which were the primary drivers of a lot of our adjustments.\n\nAnd in total, we ended up with approximately, as I said, $42 million of favorable prior-period development. And there are really two things that drove the quarter. First off, we had positive development on claims estimates that were primarily related to some of our newer markets. And in those markets, we used proxies from other markets to build our estimates.\n\nAnd what we saw there is that actual performance came in much better and so that was favorable to the tune of about $6 million to $8 million. And then the second factor hitting the quarter was unfavorable 2021 risk adjustment development, to your question, and we think that that is mainly attributable to market deterioration that happened in the back half of last year, where it looks like that the market got a bit that sicker, really, versus our book, and that's probably really likely related to some SEP growth dynamics. And that was about $26 million of adverse development. And we think that that dynamic was really pretty specific to 2021.\n\nAnd then there were some other offsetting smaller items that were puts and takes in there. And then, just to kind of pull up, on a year-to-date basis, I mentioned that we had about $42 million of unfavorable development, and two-thirds of that is related to 2021 risk adjustment and then a third of it is related to 2020. And big picture, risk adjustment, and estimates is very challenging. But overall, we were pretty consistent with the reporting that we got from Wakely.\n\nWe didn't have too many significant adjustments on 2022, slightly positive there. With risk adjustment, you really have to focus on executing your processes in a pretty consistent confident way. You're having to make adjustments and estimates for what the market's doing. So, the volatility that we see in this area, we actually think, confirms that we have a pretty good process.\n\nMichael Hall -- Morgan Stanley -- Analyst\n\nGot it. Thanks, Scott. That's really helpful. And then just one more.\n\nAs we think about the Plus Oscar pipeline, I think in the past, you've mentioned about one to two deals a year, but given you're no longer pursuing full service, and pass deals for the next 18 months, but you're also rolling out new SaaS modularization effort. Curious, how does that impact your original one to two deal a year target? Like, has that changed at all?\n\nScott Blackley -- Chief Financial Officer\n\nSo, yeah, we talked about this at the Investor Day in the last quarterly earnings call as well. The modularization question is really one we've been consistently getting for the past 12 months of being out in the market. It's great for us to be out there and actually offering campaign builder now. That's getting the perception from what we can see in the market now.\n\nAnd so, there, we expect a higher number of -- obviously, we can do over time as a shorter sales cycle generally, and exactly, as you said, because of the large growth we had and because we want to support existing clients in execution there, we really said for the next 18 months, let's not shoulder another implementation of a big full-service deal. Now, overall, the trends in the marketplace, I think, are very much alive and very much on targets. And there is a continued shift as we can see from hospitals and health systems toward taking more risk, toward kind of reaffirming and shoring up their health plans. We think it is still difficult to get a modern-day infrastructure besides ours that helps folks take risk in a good way and connect to the member engagement.\n\nAnd so, very much continue to be out there in the marketplace and negotiating. And so, I think at this point, on these full-service deals, we're already talking about 2025 and beyond.\n\nMichael Hall -- Morgan Stanley -- Analyst\n\nGot it. Thank you, guys.\n\nOperator\n\nYour next question comes from the line of Stephen Baxter with Wells Fargo Securities. Your line is open.\n\nStephen Baxter -- Well Fargo Securities -- Analyst\n\nYeah. Hi. Thanks. I just wanted to follow up on a couple of the Plus Oscar questions there.\n\nI guess first, I did think I heard you say kind of launch challenges. But let me just hear you expand a little bit on what exactly that means either clarifying what you said on the reviewers expanding on the issue? And then, just as you talk about the 18-month horizon, I guess, why is 18-months, horizon-wise about six months wise more 12 months, what the thought process there just given the pipeline, getting another elongated new deals taking a long time to consummate in the first place, I would feel like that potentially could push full-service revenue out into late 2025, maybe even 2026 probably you see more of that. So, I just want to understand these issues much better, and then maybe I have a follow-up.\n\nScott Blackley -- Chief Financial Officer\n\nLet me start with the comment made on the launch challenges. So, as we told you last quarter, the full book migrations are complex and challenging. They're also not done after launch. So, we're really in the middle of the work of making sure we support the integration there.\n\nWe're now seven months in and working through refining implementation. What we wanted to do there is to recommit additional resources necessarily support the new clients, and we're making progress there. It's a really good priority for us, as we talked about, we will make sure it's done right. And as a result of that, we're being thoughtful but not overextending ourselves by taking on new full-service clients for the near term.\n\nNow, in terms of the 18 months, this -- we are out there in the marketplace, continue to talk about some future food service yields. And that -- at this point, we can start to get into 2025, even in conversations already to give ourselves more time to get the implementation rights, and that means that we will continue to be in the marketplace. And in many cases, we have a chance of actually launching campaign with implementations that might then lead to follow-on implementations but become bigger and bigger. And that's where the full focus is right now because we just think that that is a prudent thing to do given how much we grew and most importantly, given that we are really doing here is to use the infrastructure we built in the past 10 years to show an impact on healthcare costs, member experience.\n\nAnd we have such an incredible opportunity of getting to insurance company profitability in 2023 on our now big book business that we really want to make sure that that becomes the primary driver of the internal efforts, the internal work.\n\nStephen Baxter -- Well Fargo Securities -- Analyst\n\nOK. That's fair.\n\nOperator\n\nYour next question comes from the line of Jonathan Yong with Credit Suisse. Your line is open.\n\nJonathan Yong -- Credit Suisse -- Analyst\n\nHi. Thanks for taking the question. Just a question on your high single-digit pricing comment. This does seem to be a bit in line with the national averages that have been coming out.\n\nBut I guess in some of your key markets like Florida, how does this compare and if you did see a large bolus of membership come in, in 2023 will result of the dynamics of you achieving profitability in the InsureCo?\n\nScott Blackley -- Chief Financial Officer\n\nYeah. Jonathan, thanks for the question. So, as we said, our 2023 pricing was really laser-focused on prioritizing margin expansion. And as you mentioned, the rate increases that we made were on average, high single digits which is kind of in the ballpark of what many were doing.\n\nBut I would also just comment that it really is a nuanced picture where you have to go region by region to really understand the competitive landscape there. If we just kind of pull back and look at the market, overall, it's a very competitive market. And from what we've seen, we're seeing that the more experienced players in the market seem to be on the upper end of price increases. And then on the other hand, there's other players, including some large players who seem to be more aggressive in coming in there.\n\nAnd so, our take is that those with the most experienced appear to be pricing up at this point in the market cycle. And then I just think that, overall, for us, we think that we have priced with the goal of obtaining margin expansion. We're well-positioned to deliver that.\n\nJonathan Yong -- Credit Suisse -- Analyst\n\nOK. Great. And then just on the Plus --\n\nOperator\n\nYour next question comes from the line of Kevin Fischbeck with Bank of America.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks. I guess I want to go back to the Plus Oscar thing. I guess a couple of questions.\n\nWhen you guys first outlined this change in strategy, it seemed like it was an addition rather than a replacement over the next 18 months. So, I guess, I understand how you want to focus on the health and profitability. But as you first unveiled, it didn't sound like it was going to stop you from making that progress or from doing the full-scale launches. So, it does sound like something is different? Just want to make sure that I understand that.\n\nBut then also, how should we think about since financing is a question. I appreciate the two-year liquidity comment. But how should we think about this change at all? Like how much earnings might you not have versus kind of initial models because you're not selling things for the next 18 months versus the cost of doing this switch? Just trying to better understand the implications of what's going on in the delay.\n\nMario Schlosser -- Co-Founder and Chief Executive Officer\n\nYeah. Let me start by what hasn't changed. What hasn't changed with regards to Oscar is, I think, number one, our opportunity in our product market fit, particularly in the changing healthcare landscape. I mentioned before, I think conversations shift toward risk we need to focus on one experience even the entry of bigger tech players in this.\n\nThese are all trends that we called a while ago and that exactly remain alive. That's an opportunity, and we have broad market share there. The second thing has not changed is the importance of Oscar long-term strategy. So, the critical takeaway here is I continue to believe, certainly, Plus Oscar is a viable business, and it will be a material component of Oscar over time.\n\nAgain, reinforced in the conversations we're in, in conversations we continue to be in as well. I don't think that's -- as I mentioned, a lot more competition on modern-day infrastructure out there, and so we can give ourselves the time and pause on these full-service implementations for these 18 months to make sure we focus on scaling the business for the [Inaudible] members and the profitability targets and serving existing clients. And that's really less. We ultimately -- Plus Oscar, to me, if you look at software for a second, is about we've got technology we build.\n\nWe've got infrastructure rebuild and we want to use that to make healthcare more affordable, member experience. The most exciting proof points we can now achieve is next year delivering on insurance core profitability that was getting excited. And that is also, we think, is exciting for prospective clients. And that's the proof point we were trying to earn here.\n\nAnd in the meantime, they continue to build our footprint through campaign builder, which is just a shorter sales cycle and let us unlock additional client set as well.\n\nScott Blackley -- Chief Financial Officer\n\nYeah, Kevin. Why don't I speak to your question on, kind of, the impact of these decisions on kind of on cash and liquidity? And I would just say, first of all, that we continue to be targeting total company profitability in 2025. The most important component of delivering on that is getting the insurance company profitable in 2023 and then more profitable thereafter. So, if you think about our resource allocation, we're actually putting our resources toward our most important objective.\n\nAnd then I would say, secondly, as we look to grow campaign builder and other modularization services to follow. We think there's an opportunity to deliver profitability. The question is EBITDA might be a little bit slower than what we had originally expected. But we still believe there's significant opportunity.\n\nAnd -- so that will be one of the levers that will help us to get the profitability. And then I would just also say that depending on the trajectory of how profitable the insurance company is able to move over time, we'll need to be very focused and careful about managing our holding company spend levels. So, those are really the components that I think are going to be able to help us drive getting to insurance -- kind of our total company profitability in 2025.\n\nOperator\n\nYour next question comes from the line of Josh Raskin with Nephron Research. Your line is open.\n\nJosh Raskin -- Nephron Research -- Analyst\n\nHi. Thanks. I just wanted to go back to the pricing and expectations for next year. So, you talked about the high single-digit pricing next year, which you think is overall, probably sounds consistent with the market.\n\nBut I think, Scott, to your point varies dramatically by market. So, I guess, trying to figure out more specifically, based on the pricing actions that you've taken, what does that really mean for Oscar's competitive positioning? And do you think you grow or contract relative to the overall market? And I'd be interested to hear views on -- your thoughts on the overall market, which I think you guys have been talking about expectations for growth before a Family Glitch and things like that, but just with the subsidies getting finalized, etc.\n\nScott Blackley -- Chief Financial Officer\n\nYeah. Josh, well, look, I appreciate the question. I'll just start off by saying that it's too early for us to be giving any guidance on 2023. So, I'm not going to give you any type of directional feedback on what we're anticipating for that period at this point in time.\n\nAnd when I just step back from the market and look at what's going on, on the one hand, you've got SAT or the extension of some of the programs that we saw really supporting growth in the marketplace to date. And so, we think that's going to be a continued tailwind. Medicaid redeterminations and Family Gitch, those are also things that can expand the market. So, we think the combination of pricing in a larger market positions us well in terms of where we may see ourselves going in 2023.\n\nBut we'll come back to you and give you some more updates on our guidance for 2023 and a later date.\n\nMario Schlosser -- Co-Founder and Chief Executive Officer\n\nJosh, you ask about the overall market and pricing, and I want to relate what Scott said there. I think we've been also saying for a while that we think the increases will be for the overall market in the high-single-digits. So, I think the latest, I've seen is across something like 35 states now, including Texas is about 8.3% or so. That is maybe some of the rotation because some of that is probably prior to subsidy extensions some after different states have different filing requirements there, right? So, it's good to see, I think, that we have an understanding of how the market operates nowadays that we were able to roughly predict where that would go.\n\nWhat Scott said earlier, what I want to reaffirm is that we see some of the experienced players in this market, price up more, and we see some of the ones who came back in price more aggressively. And if there is one thing we have learned in the last eight years, sometimes, painfully ourselves, is that we don't want to chase when people try to go in certain markets and try to underprice or something like that. And so, we feel confident in how we're pricing and very region as we said. And as the pricing comes out toward September and October, we'll see more cards turn over there.\n\nOperator\n\nYour next question comes from the line of Lindsay Golub, Goldman Sachs. Your line is open.\n\nLindsay Golub -- Goldman Sachs -- Analyst\n\nHi. Thanks for the question. Just to go back to the market again. I'd love to hear more about how you're approaching plan design.\n\nAnd then just to hear, if there are any areas where you're making investments, how you think that might compare to competitors? And then just thinking also about the positioning, how the more disciplined pricing and maintain markets might fit into the targeted high-teens to mid-20s revenue growth as we work toward profitability? Thank you.\n\nMario Schlosser -- Co-Founder and Chief Executive Officer\n\nYeah. Plan design, I think, is one of the superpowers of the insurance company. And so, it's been an area for us where every year, I wish we could be doing even more creative things. And where, in fact, actually, next week, we have a first meeting for innovative plan design for 2024.\n\nI believe it or not, that's truly how early we start the process there. We have a number of new things we're doing this year. I don't want to go too much into detail there just yet because that hasn't all come out yet, but – for example, as I talked about in the prepared remarks, we're taking our virtual primary care plan designs into similar markets. We are rolling some of our kind of specialized plan designs in certain states around particular member demographics out in the places.\n\nAnd we are – have all kinds of things around incentives and rewards is one that we constantly think about and support. And so, those are areas where I think we have done some very interesting work. I think that work has had a real impact as well, both in terms of growth and actually also loss ratio improvements. And you can expect us to do a lot more there, certainly in the future and state forward or we have cooked up for 2023 when the plan design come out in the next couple of weeks.\n\nAnd your second question was about – do you mind repeating your second question? Actually, that might have been a Scott question.\n\nLindsay Golub -- Goldman Sachs -- Analyst\n\nI wanted to just ask how – can you hear me all right?\n\nScott Blackley -- Chief Financial Officer\n\nYes. We can.\n\nLindsay Golub -- Goldman Sachs -- Analyst\n\nThank you. Just on the positioning for 2023, I wanted to ask how some of your more disciplined pricing and maintain markets. So, since your targeted high-teens to mid-20s revenue growth as you work toward profitability.\n\nScott Blackley -- Chief Financial Officer\n\nYeah. And I appreciate the question, and I know that folks are certainly going to be interested in where do we think the book will be in 2023. And I'm just going to again say that it is too early for us to give you an outlook on where 2023 lands, but we believe that the pricing that we put in the market is supportive of our path to profitability. And that's the reason that we lead in on prioritizing margin expansion above all lots.\n\nLindsay Golub -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nWe have a follow-up question from Stephen Baxter with Wells Fargo Securities. Your line is open.\n\nStephen Baxter -- Well Fargo Securities -- Analyst\n\nYes. Hey, just a couple of quick follow-up on -- just on -- when you say you built the Medicaid redetermination outlook, I guess, under your pricing, I guess that could make the market larger, but it seems like by how much and really when they start to get a meaningful impact in terms of the timing? It seems like that they're pretty open items. What are you assuming is the impact to the risk pool? And I guess how do you just get comfortable with the range of outcomes that you build inside the pricing there? Thanks.\n\nMario Schlosser -- Co-Founder and Chief Executive Officer\n\nYes. It's got some puts and takes. So, on the one -- the two factors that you got to consider there that we consider this, on the one hand, when this membership come, the more it comes in the middle of 2023, the more it will have some SEP risk adjustment impact in the same way prior SEP enrollment has had that impact in a given year, nothing like risk scores, things like that. That's one question.\n\nAs we said there are right now the public health emergency is scheduled to expire in October. Then there's a limitation, how quickly states will start moving members to Medicaid into the ACA. And so, therefore, the earlier in the year that happens, I think, generally the better it is for this SEP-RA phenomenon. The other factor is what is the mobility of that book.\n\nAnd there's actually different opinions, I mean, I've seen at least one study out in the market, say, hey, this is going to be a better mobility than the ACA population. And we have generally built this in as an upward trend in the MLR and pricing. That's the short story. We expect this combination of SEP-RA and higher mobility in likely our view to have an upward drift and therefore, that's been to pricing, it's also different in different markets, but that's kind of generally what we have done there.\n\nNow, I will say this. The fact that we are now six, seven months -- six months and obviously, these results here. And that we see the MLR on these members who came in SEP last year for this year, essentially the segment MLR members who came in any open enrollment periods, just we underscore this point we made in prior calls, which is that those members generally win trends toward similar utilization patterns and can be managed to similar utilization and therefore, similar cost outcomes. And so, this is a long-term good thing that members are coming to this market.\n\nIt will support generally, I think, the overall stability of the market, we have a membership in there and so when we enroll the next year, whenever it will be, we hope to then retain them to make sure that they will continue to be a bit MLR in the membership of business. And so, that's really how we think about this.\n\nStephen Baxter -- Well Fargo Securities -- Analyst\n\nOK. Thanks. And then just one last quick one for me. It looks like the back-half implied G&A ratio, total company adjusted admin ratio ramps up a decent amount.\n\nI think, actually, it's a decent amount more than the actual insurance company admin ratio. When we think about the difference between those two trends in the back half of the year, what should we be thinking about of what the drivers are? Thanks.\n\nMario Schlosser -- Co-Founder and Chief Executive Officer\n\nYeah. I appreciate the question. And I guess I would maybe start with the insurance company. And in the insurance company there, I would anticipate that -- we'll see a less seasonal kind of ramp in the insurance company admin expense, where historically, we would have seen an increase in the third and fourth quarter.\n\nSo, I think that's what we saw last year. This year, I would expect that we'll see the fourth quarter up, but we expect it's going to be up more modestly versus what we would have seen in the prior year. And then, when -- and one of the phenomena there is that the ramp that we experienced in the fourth quarter, we would expect that we are in better positioned for ramp this year versus where we were last year based on our work that we're doing on scale. And then when I think about the -- what's going on in the Holdco line item there, I think that is really just about some of the investments that we're making in our infrastructure to support scale and to support kind of what we're doing with our clients.\n\nAnd I think that those are investments that aren't necessarily sticky. And so, we'll look to continue to drive efficiency and Holdco over time.\n\nOperator\n\nThere are no further questions at this time. I would like to turn the call back over to our presenters.\n\nMario Schlosser -- Co-Founder and Chief Executive Officer\n\nYeah. Thanks so much for the call. Thanks much for the good questions on your coverage and constant work and dedication. And we will see you soon.\n\nThanks again.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCornelia Miller -- Vice President of Corporate Development and Investor Relations\n\nMario Schlosser -- Co-Founder and Chief Executive Officer\n\nScott Blackley -- Chief Financial Officer\n\nMichael Hall -- Morgan Stanley -- Analyst\n\nStephen Baxter -- Well Fargo Securities -- Analyst\n\nJonathan Yong -- Credit Suisse -- Analyst\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nJosh Raskin -- Nephron Research -- Analyst\n\nLindsay Golub -- Goldman Sachs -- Analyst\n\nMore OSCR analysis\n\nAll earnings call transcripts"
}