{
  "companyName": "Constellation Brands",
  "companyTicker": "STZ",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/06/constellation-brands-stz-q2-2023-earnings-call-tra/",
  "content": "Constellation Brands (STZ -1.30%)\nQ2 2023 Earnings Call\nOct 06, 2022, 10:30 a.m. ET\n\nOperator\n\nGreetings, and welcome to the Constellation Brands fiscal year '23 Q2 earnings call. [Operator instructions] As a reminder, this conference is being recorded. It's now my pleasure to turn the call over to Joseph Suarez, vice president, investor relations. Please go ahead.\n\nJoseph Suarez -- Vice President, Investor Relations\n\nThank you, Kevin. Good morning, all, and welcome to Constellation Brands second quarter fiscal 2023 conference call. I'm here this morning with Bill Newlands, our CEO; and Garth Hankinson, our CFO. As a reminder, reconciliations between the most directly comparable GAAP measures and any non-GAAP financial measures discussed on this call are included in our news release or otherwise available on the company's website at www.cbrands.com.\n\nPlease refer to the news release and Constellation's SEC filings for risk factors, which may impact forward-looking statements made on this call. [Operator instructions] Thanks in advance. And now, here's Bill.\n\nBill Newlands -- Chief Executive Officer\n\nThank you, Joe, and good morning, all. Welcome to our second quarter call. I hope everyone had a good summer and enjoyed some of it with our great products. Before we get started today, I want to take this opportunity to say that our thoughts are with all those affected by Hurricane Ian.\n\nThankfully, all Constellation employees living in Hurricane Ian's path are safe and accounted for. We are also fortunate to have avoided any adverse impact to our operations in the area to this point. And we continue to stay in contact with our local distributors, retailers, and other partners to best support their needs in this difficult time. Additionally, thousands of people in Florida, South Carolina, North Carolina, and Virginia have been impacted by this natural disaster.\n\nSo we are also supporting the American Red Cross with a significant contribution to help provide food, shelter, and much-needed assistance. We will also match employee contributions to the American Red Cross two for one as part of this effort, and we hope it provides at least some comfort to local residents as they work to recover and rebuild. I also want to remind everyone that we filed our proxy statement in connection with the Class B common stock reclassification a couple of weeks ago. We have called a special meeting of shareholders to vote on the reclassification next month on November 9.\n\nAt this point, we are unable to comment further or provide additional information on this topic during today's call beyond what is available in the proxy statement and our other filings with the SEC. All of these filings are available through our Investor relations website, and I urge anyone interested in the special meeting or the reclassification to review these documents. Now, as usual, I would like to start by emphasizing a few key takeaways from our latest results. First, consumer demand for our products remains strong.\n\nConsumer-led premiumization trends continue across beverage alcohol, giving further confidence in the resilience of premiumization as a fundamental driver of demand for our brands. Buy rate, which captures both the number of trips a consumer makes and the amount they spend per trip, increased in the second quarter for both high-end beer and total wine categories in tracked channels. And buy rate for Hispanic high-end beer consumers, which is particularly relevant to our core beer portfolio, is also proving resilient. More specific to our brands, our beer business posted depletion growth of nearly 9%.\n\nThat is more than 9 million additional cases for the quarter. And in our wine and spirits business, our wine portfolio gained share and outperformed the entire wine category in tracked channels, while our craft spirits brands outperformed the higher-end segment of the spirits category. Second, our beer business also continues to outperform the entire category. In the second quarter, our beer business remained the leading share gainer in U.S.\n\ntracked channels across the entire beer category, and now accounts for 28% of the high-end segment. Importantly, we believe our beer business remains well placed to continue to support the steady growth of our brands with inventories across the supply chain at historical norms and production continuing for our operating plants to meet volume expectations for the fiscal year and incremental capacity unlocked from our existing brewery operations in Mexico through optimization and productivity initiatives and the expansion of our breweries at Nava and Obregon, as well as the construction process of our new brewery in Veracruz, are all advancing as planned, all of which has given us the confidence to increase the fiscal '23 net sales and operating income growth guidance for our beer business and continued conviction in our medium-term top-line growth and margin algorithm. Third, the transformation of our wine and spirits business continues to yield results. Over the past few years, this business has been evolving from a U.S.\n\nwholesaler business focused mainly on the mainstream segment to a global omni-channel competitor primarily focused on the higher end. And in our latest quarter, our largest premium wine brands, Kim Crawford, Robert Mondavi Private Selection, Meiomi, and Ruffino; and our largest fine wine brand, The Prisoner Wine Company, all delivered solid depletion growth. In our craft spirits portfolio, High West, Casa Noble, and Mi Campo all achieved strong double-digit depletion growth. In addition, our international and DTC channels each delivered double-digit net sales growth year over year, and we continue to gain share in three-tier e-commerce.\n\nFourth, our capital allocation priorities remain firm. Starting with our investment-grade rating. We expect to remain investment grade, including after funding the expected $1.5 billion cash payment for the Class B common stock reclassification, given the strong operating performance and cash generation of our business. Moving on to cash returns to shareholders.\n\nAs of the end of the second quarter, we were over 97% toward meeting our $5 billion goal. And we have now exceeded the share buybacks component of our goal by $300 million. And upon payment of today's declared dividend, which we expect to take place next month, we will have fully achieved our goal ahead of our fiscal year-end deadline. Shifting to our third priority of reinvesting to support the growth of our beer business.\n\nAs noted earlier, our capacity expansions and construction processes continue according to plan. And lastly, our M&A focus remains on small acquisitions to fill portfolio gaps, particularly in our wine and spirits business. This included, most recently, the investment in a minority stake in Archer Roose as part of our Focus on Female Founders initiative, which is an accessible premium wine brand focused on offering consciously crafted wines to a new generation of legal drinking age wine drinkers. We are proud to say that five years into our Focus on Female Founders initiative, we have fulfilled 76% of our commitment to invest $100 million in female-founded and female-led start-ups in the beverage alcohol sector as part of our efforts to enhance social equity within the industry.\n\nNow let's move on to a more fulsome discussion of our performance in the quarter. As I mentioned earlier, our beer brands continue to resonate strongly with the consumer, gaining 1.8 points across the entire category and 2.5 points in the high-end segment and tracked channels. Modelo Especial delivered depletion growth of over 10% and was the No. 1 share gainer in the entire U.S.\n\nbeer category. It continues to strengthen its position as the No. 2 beer brand in dollar sales and is the No. 1 or 2 beer in 11 states, more than double the number of states from just three years ago.\n\nWe continue to see further opportunities to maintain the growth momentum of Modelo Especial, particularly given the resilience of premiumization trends and our relentless focus on striving to close the brand's distribution and awareness gaps. Corona Extra maintained its momentum with 6% depletion growth and is the No. 3 share gainer in tracked channels. It remains the No.\n\n1 most loved beer brand with both general market and Hispanic consumers. And our La Vida Más Fina campaign has maintained the No. 1 spot in ad awareness across the beer category. We continue to expect modest growth from Corona Extra, supported by distribution gains within certain pockets of the U.S.\n\nwhere it is underrepresented and the brand's appeal and growth potential with younger legal drinking age and multicultural consumers. Pacifico achieved depletion growth of over 37% and was a top 10 share-gaining brand in tracked channels. We continue to see a fantastic growth runway for Pacifico as an emerging brand, particularly as the brand has significant distribution potential when compared to Modelo and even more so when compared to Corona Extra. Lastly, our Modelo Chelada brands posted depletion growth of more than 60% for the second quarter.\n\nAnd Modelo Chelada Limón y Sal was a top 15 share-gaining brand in tracked channels. Modelo Chelada remains the No. 1 brand family in the chelada space and owns nearly 60% market share of the chelada segment nationwide. However, awareness for Modelo Chelada is still relatively low compared to other flavor categories.\n\nAnd we continue to expect significant growth as we invest in marketing to broaden the demographic appeal and in additional flavors and package configurations to unlock new consumption occasions for this product. All in, the strong demand for our brands in the second quarter supported a net sales increase of 15% for our beer business. And this, in turn, drove a 25% uplift in operating income, which also benefited from the lapping of higher obsolescence charges last year. This gives us confidence to increase guidance for our beer business as we now expect to achieve 8% to 10% net sales growth and 3% to 5% operating income growth for fiscal '23, which Garth will review in more detail shortly.\n\nThat said, it is important to remember that in the third and fourth quarters of fiscal '23, we will be lapping elevated shipments from the second half of the last fiscal year that resulted from the rebuild of distributor and retailer inventories after supply shortages and severe weather-driven shipping disruptions that occurred in the first half of fiscal '22. So while on an absolute basis, we continue to expect our shipments for the remainder of this fiscal year to be relatively in line with depletions, we believe the more comparable indicator for growth for our beer brands in the second half will be the depletion rate. Looking forward, we are also confident that over the medium term, our beer business remains well-positioned to deliver 7% to 9% net sales growth and 39% to 40% operating margin, supported by the sustained momentum of our core brands, the steady progress of our brewing capacity additions and the continued development of our innovation lineup, including the momentum of our chelada brands, the recent launch of Fresca Mixed, the expansion of Modelo Oro from select test markets to the entire national market next year, and the introduction of Corona nonalcoholic. The new nonalcoholic drinking age consumer is an attractive target as they also consume high-end beer, as well as spirits and hard seltzers.\n\nSo we are excited about the extension of Corona into this segment, and we look forward to sharing more details as we approach the product launch. Moving on to wine and spirits. Our wine and spirits business is making headway with its vision to become a bold and innovative high-end market leader. As noted earlier, the largest premium and fine wine brands and craft spirits brands of our portfolio delivered solid depletion growth rates in the second quarter.\n\nAnd relative to the market, the higher-end portion of our wine portfolio, which includes our premium and fine wine brands, outperformed the corresponding category segments in U.S. tracked channels. Our craft spirits portfolio delivered dollar sales growth significantly ahead of higher-end segment of the spirits category. Our wine and spirits business also continues to advance its mainstream strategy through a greater focus on brands and initiatives with higher returns, including through the delivery of relevant and innovative products.\n\nAs we also announced this morning, we continue to further premiumize our business with the divestiture of a portion of our main streamline portfolio combined with a couple of select premium brands to the wine brand. When it closes, we believe this transaction will further enable us to focus our portfolio and efforts to deliver the industry-leading growth in margins that we continue to work toward. From an innovation perspective, we have several great examples of recently introduced products that are driving growth within our wine portfolio. Woodbridge Box was the No.\n\n2 premium box share gainer in the second quarter. Meiomi Red Blend 750 was the No. 2 wine SKU. Kim Crawford Sparkling Prosecco was the No.\n\n4 new wine brand. And the recent launches of The Prisoner Pinot Noir and Blindfold Blanc de Noir are respectively seeing early successes in priority accounts and the on-premise. Beyond product innovation, we continue to extend our growth in direct-to-consumer and three-tier e-commerce channels, as well as international markets. Wine & Spirits DTC net sales grew 15% in the second quarter as our investments in these channels continue to yield strong performance.\n\nWe also continued to outperform in three-tier e-commerce, delivering dollar sales growth 16 points ahead of the competition in the second quarter. Importantly, we're also outperforming in three-tier e-commerce with our beer business, which achieved a 7-point lead in dollar sales growth versus competition in the second quarter. Back to our wine and spirits business. International net sales grew 10% versus prior year, showing the continued momentum of our brands in the select international markets that we are targeting.\n\nGoing forward, we will continue to focus on growing our omni-channel and international footprint as we believe these channels will continue to grow as a portion of our mix over time and be an important opportunity for higher-end growth. Now let's move on to Canopy growth. While the impairment of our Canopy investment is clearly disappointing, it is not indicative of a significant long-term market opportunity that still exists for the legal cannabis market, particularly in the U.S. where the market was estimated at $25 billion at the end of 2021 and is expected to nearly double in size by 2026 as more states continue to legalize cannabis.\n\nIn fact, the companies that Canopy invested in to establish its U.S. ecosystem continued to perform strongly and to scale. We also remain supportive of Canopy's efforts to restructure its Canadian operations and its plan to further drive BioSteel's growth and believe these actions will also strengthen their business and ultimately provide an opportunity to enhance the value of our holding. Before I conclude, I also want to take this opportunity to highlight that we expect to release our 2022 ESG Impact Report later this month.\n\nThe report seeks to provide a comprehensive review of our ESG strategy and key initiatives designed to make a positive difference in our communities, safeguard our environment and advocate for the responsible consumption of beverage alcohol. We will also, for the first time, be reporting with references aligned to the Sustainability Accounting Standards Board framework and taking into consideration the recommendations from the Task Force on Climate-Related Financial Disclosures. We believe these planned enhancements to our reporting will be valuable steps intended to better align with stakeholder expectations on the information we provide on these important topics, reflect our company values, and better showcase our ongoing efforts to address pressing environmental and societal needs that are important to our communities, our consumers and our employees. I invite all of our stakeholders to spend some time reviewing the report when it is released, which will be available through our company website.\n\nIn closing, I'd like to reiterate our main takeaways from this quarter. Number one, consumer demand for our higher-end beer and higher-end wine and spirits products continues to be strong. And we remain confident in the long-term prospects of our portfolio and our runway for growth. Number two, our core imported brands continue to outperform the industry.\n\nModelo Especial further strengthened its position as the No. 2 beer in the U.S. market and continues to gain ground as the No. 1 share gainer.\n\nAnd Corona Extra also maintained its momentum, delivering solid growth rates and taking the No. 3 share gainer spot in the beer category. The strong performance of our brands in the first half of the fiscal year now puts us on track to deliver better-than-expected growth for our beer business in fiscal '23. Number three, we continue to see the benefits of our wine and spirits strategy taking hold.\n\nOur largest higher-end wine and spirits brands are delivering growth. And we are also performing strongly internationally with our higher-end brands and in e-commerce and DTC channels. And number four, we continue to deliver on capital allocation priorities by maintaining our investment-grade credit rating, delivering cash returns to shareholders through dividends and share buybacks, advancing the brewery capacity expansion and construction processes in our beer business to support its continued strong growth and executing on disciplined tuck-in M&A to fill gaps in our portfolio. And with that, I would now like to turn the call over to Garth, who will review our financial results in the quarter.\n\nGarth Hankinson -- Chief Financial Officer\n\nThank you, Bill, and good morning, everyone. As Bill mentioned, our business continued to perform well in the second quarter, delivering another strong set of operating results. We are making good progress against our operating plans and strategic initiatives. And we are now expected to exceed our previously stated fiscal 2023 net sales goals for the beer and wine and spirits businesses and our operating income goal for the beer business.\n\nOur strong Q2 results were led by a 12% increase in net, sales driven by growth in both our beer and wine and spirits businesses. Additionally, we achieved a 10% uplift in operating income, underpinned by significant double-digit increase in the operating income of our beer business. Our strong cash flow results supported dividends and incremental share repurchases in Q2 that put us on track to exceed our $5 billion goal in cash returns to our shareholders by the end of this fiscal year. With that, let's review Q2 performance and our full year outlook in more detail, where I'll generally focus on comparable basis financial results.\n\nStarting with beer. Net sales increased 15%, primarily driven by shipment volume growth of over 12% from strong demand for our core beer portfolio and higher average annual price increases. Q2 shipment volumes were generally aligned with depletion volumes, and inventories across the supply chain remained at historical norms. From a growth perspective, depletions for the quarter were up nearly 9% which was propelled by the continued strength of Modelo Especial, Corona Extra, Pacifico, and the Modelo Chelada brands.\n\nSelling days in the quarter were flat year over year and will continue to be flat in Q3. Moving on to beer margins. We continued to experience headwinds, driven by the inflationary economic environment, particularly in packaging material costs and shifts in mix. However, beer operating margin increased over 330 basis points to 40.5%, primarily driven by more favorable impact from pricing, lower obsolescence charges, and lower marketing spend, as well as the favorable impact of fixed cost absorption from strong shipment volume growth.\n\nAs you may recall, we reported higher obsolescence charges in Q2 of fiscal 2022 due to the slowdown in the overall hard seltzer category during the summer of last year. Marketing as a percent of net sales decreased 170 basis points due to the timing of our media spend. We continue to expect that marketing as a percent of net sales will be in the 9% to 10% range for the full year as we anticipate marketing spend to ramp up in the second half of the year with the launch of new campaigns, particularly from our media investments around college and NFL football. Given the strong performance of our beer business, we are now targeting full year fiscal '23 net sales growth of 8% to 10% and operating income growth of 3% to 5% for that business.\n\nOur updated fiscal '23 outlook includes a 2% to 3% price increase, which is higher than the previously anticipated 1% to 2% expectation and medium-term algorithm range as elevated costs continue to create pressure across the supply chain. However, we continue to expect an implied operating margin of approximately 38% for fiscal '23. We anticipate second half operating income margins to be negatively affected as we expect the benefits from our pricing adjustments and cost-saving actions will be more than offset by ongoing inflationary pressures across raw materials and packaging, particularly as more favorable hedges will continue to roll off, additional headcount in training, as well as increased depreciation from our brewery capacity expansions and higher marketing spend, as previously referenced. Now shifting to wine and spirits.\n\nQ2 fiscal '23 net sales increased over 1%, driven primarily by an increase in bulk sales and favorable pricing. And as Bill noted, Q2 depletion growth was solid for our largest premium wine brands, Kim Crawford, Robert Mondavi Private Selection, Meiomi and Ruffino, our largest fine wine brand, The Prisoner Wine Company, and our largest craft spirits brand, High West, Casa Noble, and Mi Campo. Operating margin decreased 40 basis points to 19.3%, primarily driven by the continued impact of inflationary headwinds and higher general and administrative expenses. The increase in COGS was mainly a result of higher supply chain costs, particularly container surcharges and warehousing, and higher material costs, including grapes and glass, partially offset by favorable fixed cost absorption as a result of the lapping of the New Zealand frost and the wildfires in the U.S.\n\nThe increase in general and administrative expense was driven by compensation and benefits primarily to improve marketing effectiveness. Marketing was favorable due to the timing of spend. For full year fiscal '23, we now expect wine and spirits net sales to come in flat to down 2% and operating income to increase 3% to 5%. This implies operating margins of about 24% for fiscal '23.\n\nDespite significant inflationary pressures and the inclusion of Cooper & Thief in the divestiture previously referenced by Bill, we continue to expect a considerable improvement in operating margins albeit at a lower point than previously anticipated. As noted in our Q1 earnings call, we expect to achieve the uplift in operating margins in the second half through the following key drivers: consumer-led premiumization and mix improvement, mainly in our fine wine brands; incremental pricing actions executed in Q2 that will be fully reflected in the second half; a bountiful New Zealand harvest, which will drive volume and enhance margins for Kim Crawford; lowering marketing as a percent of net sales; and finally, continued benefits from our cost savings initiatives. Now let's proceed with the rest of the P&L. As we also discussed in our Q1 earnings call, increased investment in our digital business acceleration initiative was the primary driver of our higher corporate expense.\n\nThe majority of the spend in our Digital Business Acceleration program, or DBA for short, was incurred in Q2. And we expect to start to see some small benefits from these investments later this fiscal year followed by larger benefits in FY '24. As a reminder, the goal of our DBA initiative is to support our aim to become a digital leader and capture value. It is a combination of data, technology, and operating models, including evolving ways of working, organizational structures, and acquiring talent.\n\nDBA builds on the implementation of our SAP platform that was completed last year. And we anticipate it will enable us to deliver cost savings and greater efficiency in a number of areas by taking our digital strategy to the next level. The first phase of our DBA program is focused on three key areas: supply chain, marketing, and procurement, each with their own objectives. The aim of these initial efforts is to maximize efficiency across end-to-end supply chain, to build a world-class procurement function with greater spend visibility, and to unlock demand for our products by analyzing and connecting multiple consumer data sources.\n\nWe continue to expect $35 million to $40 million of spend in our DBA program for fiscal '23 as part of our total $265 million to $270 million of corporate spend anticipated for the full year. Comparable basis interest expense for the quarter was relatively unchanged. However, we now expect interest expense for fiscal '23 to be between $360 million and $370 million as a result of the July equitization of the Canopy debt securities and rising interest rates. This excludes the impact of any interest expense associated with the funding of the $1.5 billion cash consideration payable in the event a Class B common stock reclassification closes.\n\nFrom a balance sheet perspective, should the reclassification be approved, on a Q2 FY '23 pro forma basis, our net leverage would increase to approximately 3.5 times when considering funding for the premium payment and excluding Canopy equity earnings. We ended the second quarter with a net leverage ratio of approximately three times, excluding Canopy equity earnings. As Bill noted, we have nearly completed our goal of returning $5 billion to cash to shareholders. We will continue toward our goal through planned dividend payouts and opportunistic share buybacks throughout the remainder of this fiscal year.\n\nThis remains a top capital allocation priority, and we now expect to exceed our cash returns to shareholders goal by the end of this fiscal year. That said, we continue to expect our weighted average diluted shares outstanding to be approximately 186.5 million for fiscal '23, including shares repurchased in Q2. As a result of the adjustments to our beer business growth outlook for fiscal '23 and the partial offset from higher interest expense, we now expect EPS comparable guidance to be in the $11.20 to $11.60 range, which represents a $0.10 increase at the top end of our prior guidance range. Moving to free cash flow, which we define as net cash provided by operating activities less capex.\n\nWe generated free cash flow of $1.2 billion for the first half of fiscal '23, which is a 4% increase versus prior year, reflecting strong operating cash flow, partially offset by a 23% increase in capex investments as we continue to make good progress on our brewery capacity expansion plans to support the robust growth of our beer business. In addition, our brewery optimization and productivity initiatives have enabled us to utilize incremental capacity from our existing footprint. We now estimate our current total capacity to be approximately 41 million hectoliters, giving us additional production flexibility and enhancing the returns of our prior capital investments. We continue to expect fiscal '23 free cash flow to be in the range of $1.3 billion to $1.4 billion, which reflects operating cash flow in the range of $2.6 billion to $2.8 billion and unchanged capex of $1.3 billion to $1.4 billion.\n\nLastly, on Canopy growth. We recorded a $1.1 billion impairment on our investment, which was excluded from our comparable basis results. This noncash item was driven by the following factors: the period of time for which the fair value has been less than the carrying value and the uncertainty surrounding Canopy's stock price recovery in the near term, Canopy's previously announced goodwill impairment for their cannabis operations and the uncertainty of U.S. federal cannabis legalization.\n\nIn addition, we also recorded a $651 million equity loss from our share of ownership in Canopy, which includes $461 million of Canopy's goodwill impairment. While disappointing, we continue to believe that Canopy's focus on premiumizing its cannabis-branded portfolio to improve their performance in Canada is appropriate. And we also remain supportive of Canopy's efforts in the U.S. to strengthen their emerging CPG brand distribution and build of a competitive THC ecosystem.\n\nIn closing, we continue to deliver strong business performance and are proud of the continued progress we are making against our operating plans and strategic initiatives. Our beer business continues to outshine the market. And our wine and spirits business is showing the benefits of its strategy to become a global omni-channel competitor in line with consumer preferences primarily focused on the higher end. With that, Bill and I are happy to take your questions.\n\nOperator\n\n[Operator instructions] Our first question today is coming from Dara Mohsenian from Morgan Stanley. Your line is now live.\n\nDara Mohsenian -- Morgan Stanley -- Analyst\n\nHey, guys.\n\nBill Newlands -- Chief Executive Officer\n\nGood morning, Dara.\n\nDara Mohsenian -- Morgan Stanley -- Analyst\n\nSo on your beer business, there's been a pretty nice halo the last few quarters between scanner data and the reported depletions just as on-premise recovers post-COVID. Wasn't as much the case this quarter. So can you just give us some detail on on-premise and untracked channels in general in Q2 and what you're seeing there? And then on the beer margin side, obviously, a big beat in the quarter versus consensus. That's great news.\n\nBut the implied H2 margins of 36% are well below what you saw in the first half. Obviously, there's some seasonality there. But just help us understand as we think about margins for fiscal '24, should we think about it more relative to a 38% full year base? Is it more relative to 36% in the back half? Again, there's some seasonality there, but just conceptually, how you think about that would be helpful.\n\nBill Newlands -- Chief Executive Officer\n\nJoe and Garth, why don't I take the first part? So relative to the on-premise, it's very typical of us to see a stronger Q1 on-premise because it includes Cinco, which is the single biggest event and occasion for our beer business in the on-premise. On-premise was roughly 11% of our volume in this particular quarter, which was slightly less than it was in the prior quarter. The other thing I think that's always important to look at is our completion volume has been very consistent with what we look at in IRI trends. And as an example, in our beer business in the most recent IRI trends, the 26-week data showed in totality 7.5% growth.\n\nAnd purely import business showed 9.4% growth. That's very consistent with our roughly 9% depletion growth in this particular quarter. The other place where you'll also see strength within our business is in some of the untracked channels in smaller Hispanic -- particularly Hispanic accounts particularly out west, which are not tracked by IRI or Nielsen channels. So all in, I think, again, our depletion growth profile looks exactly like what the takeout trends in tracked channels are.\n\nAnd I think as we've said many, many times, this year, in particular, that is really the way to look at our business due to the variance that we saw last year and weather-related activities in our -- and when we shipped and when we did maintenance and things of that nature, which I'm sure Garth will touch on here in a moment.\n\nGarth Hankinson -- Chief Financial Officer\n\nYeah, Dara. On the margin piece. So one, I would say that you would expect that this year's margin profile on a first half versus second half would reflect something that's more normal, which we really haven't had the last couple of years due to sort of production issues that we had to contend with, which led to sort of a rebalancing of shipments. Again, this will be more because we're in a more typical production environment.\n\nYou will see a more sort of normal first half versus second half margin profile. We are expecting margins in the second half to be negatively impacted as I said in my remarks as the benefits from pricing and some of the cost-saving actions will be more than offset, again, by ongoing inflationary pressures. From a materials perspective, we continue to see some pressure from corn, as well as cans and cartons, and glass. As you know, we have a relatively robust hedging policy.\n\nBut the way that we layer in those hedges and then the way that those hedges then roll off, we saw the greatest impact from those in the first half of the year. So while we're nicely hedged, they just won't be at the favorable rates, if you will, as we were in the first half. And then again, as is typical -- and then as typical as we're laying out incremental capacity, we will be impacted by incremental costs as we bring on people to train in advance of the capacity coming online. And then finally, we're expecting to see a significant increase in marketing in the second half versus the first half as we support new marketing campaigns around college and NFL football.\n\nFor FY '24, our guidance is -- continues to be clear on that. We continue to view the right way to think about our margins is in that 39% to 40% range, and we're not coming off of that.\n\nDara Mohsenian -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question is coming from Kevin Grundy from Jefferies. Your line is now live.\n\nKevin Grundy -- Jefferies -- Analyst\n\nGreat. Thanks. Good morning, everyone. So I wanted to pivot to the wine sales this morning, given the continued premiumization focus, but you're holding on to Woodbridge, a more value-oriented brand.\n\nI think the view there in the past has been that that brand offers scale. Just a little bit on how the deal came about, whether you can comment whether you're done and generally pleased with the shape of the portfolio at the conclusion of this transaction. And I think just kind of taking a step back, just given the change here, and I think it's sort of been in some state of transition for a period of time. It sort of begs the broader question whether the wine portfolio, albeit a narrowed down one and more focused on premium -- the premium end of the category, whether you think it still makes sense within the broader portfolio relative to a beer business, much higher growth, margins, and return on capital.\n\nSo I'd love to get your thoughts there. Thanks so much.\n\nBill Newlands -- Chief Executive Officer\n\nSure. Well, look, we're very pleased with the progress that we're seeing in the Wine business. And the divestiture that you saw this morning, again, helps to reshape the portfolio. What I -- the way I think you should think about our total business is we are increasingly focused our attention on the higher end.\n\nWe've noted that for many, many years as it relates to beer. We have now specifically related that on our wine and spirits business as well. As you probably noted, most of the tuck-in work that we've done in our wine and spirits business has been focused on craft spirits, as well as higher-end wine brands that fill portfolio gaps, all of which focus on the high end where we believe the growth and margin profile are significantly improved. So I would think about this today as just a further step in the reshaping of our business.\n\nAs we've said, we're very focused on seeing a growth profile and an improved margin profile on that business. And we believe we're well on our way to delivering that. And today is just, again, one more step in the process of achieving that goal.\n\nOperator\n\nThank you. Our next question is coming from Lauren Lieberman from Barclays. Your line is now live.\n\nLauren Lieberman -- Barclays -- Analyst\n\nGreat. Thanks so much. Good morning. I was just curious on the second half outlook because some of the things just in terms of the cost structure because some of the things you've called out in terms of rolling hedges and so on.\n\nI would have thought you might have had some visibility into previously. So I was just more curious on the -- what's changed on the second half cost outlook rather than just why second half is different than first half? And then the second thing was you made a pretty clear statement on the medium-term algorithm, still looking for 39% to 40% margins on beer. So outside of the timing shifts that are impacting the second half margins, I was just curious if you can maybe look forward fiscal '24 and beyond. Like do we get back to 39% to 40% in '24? Or is it a longer rebuild because of where you think that those relative hedge positions kind of roll through when we look into '24?\n\nGarth Hankinson -- Chief Financial Officer\n\nYeah. So Lauren, on the first half of that, around what changed from Q -- or from the first half of the year to the second half of the year, and I would say that really, nothing has changed in our mind. We give guidance on an annual basis, not on a quarterly basis. And we're going to deliver margins in line with where we said at the beginning of the year.\n\nYou want to answer the second half of that, Bill?\n\nBill Newlands -- Chief Executive Officer\n\nYeah, sure. I think the way to -- we'll obviously give specific guidance on fiscal '24 when we get to that time frame. But I think what we are seeing is we continue to see a long runway for growth in our beer business. And we think that's in the 7% to 9% range consistently.\n\nWe think we're going to see consistent delivery of 39% to 40% on the margin play. As Garth and I have always said over the last several years, you have opportunities to be ahead or behind that in any one particular year. This year, we're a little behind that algorithm because of a number of factors that we've touched on before. But we still believe that is a solid expectation for the medium term, and we'll give specific guidance around '24 when we get there.\n\nBut we believe that's a consistent approach that we are going to be able to deliver on with consistency for the next several years.\n\nOperator\n\nThank you. Our next question today is coming from Bonnie Herzog from Goldman Sachs. Your line is now live.\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nAll right. Thank you. Good morning, everyone. I was hoping for a little more color on your beer shipments versus depletions.\n\nI guess, first, it would be helpful to hear how your quarter-to-date depletions have been tracking. And then second, you mentioned depletion should outpace shipments in the second half. But just really trying to think through how we should think about your shipments. In the context of your new top-line guidance, it does imply barely any shipment growth in the second half.\n\nSo I guess I'm really trying to understand this, given you're lapping some of the brewery maintenance you had last year in Q3, and then you have the rollout of some really strong innovations, such as Modelo Oro, that will need to be shipped in Q4. So I'm just kind of thinking through your new top-line guidance, and it feels pretty conservative. So I just want to make sure I understand that. Thanks.\n\nBill Newlands -- Chief Executive Officer\n\nSure. Well, to answer your first part of your question, Bonnie, the start of the quarter, September was very solid. And it's consistently in line with what we expect our annual numbers to be. So we certainly think we're off to a good start in Q3.\n\nGarth said this at the beginning of the year that it was going to be a very lumpy year. The important part that I think everyone should think about is our depletion -- the actual volume of our depletions and our shipments year to date are almost on top of one another. However, because you compare it to last year and because we had shipping disruptions last year, it looks very different on a percentage basis. On an actual volumetric basis, they're very similar, and you're going to see the same thing for the rest of the year.\n\nBut this is why we have consistently said the best thing to do to look at the success of our business is the depletion rate. And our depletion rate year to date on our beer business is in just under 9%. And obviously, that's why we increased our guidance because we have further confidence that we are going to outpace the growth profile that we set out at the beginning of the fiscal year. So that's the way we've consistently urged that people think about it around the depletion rate because it's just going to be lumpy this year on the shipment side.\n\nDoesn't take away one iota for the outperforming success that our beer business continues to have in the marketplace.\n\nOperator\n\nThank you. Our next question today is coming from Andrea Teixeira from J.P. Morgan. Your line is now live.\n\nAndrea Teixeira -- JPMorgan Chase and Company -- Analyst\n\nThank you. So I just want to go back to this question because it does imply though that, of course, you ship more than you had in depletions in the 9%. So what you're saying now, we should be seeing shipment volume negative in the third and the fourth, which is that what's implying because we see it as flat revenues, if I understood you correctly, minus 2% to plus 2%, given your guidance. And you have pricing.\n\nSo you're just telling us to assume volumes will decline in the second half. I just want to clarify that. And then another question related to that, given the pressures that you had in commodities rolling over and all the hedges, isn't it makes sense to take another pricing usually in the fall to kind of like offset those pressures? Thank you.\n\nGarth Hankinson -- Chief Financial Officer\n\nYeah, Andrea. Thanks for the question. So first of all, just to reiterate what Bill just said, our shipments and our depletions for the first half of the year have been in line with one another. So we have not over-shipped beyond the depletions.\n\nThe issue between the first half and the second half is strictly due to the timing of shipments related to some production outages that we had to deal with last year. So that's the differential. As it relates to your point on pricing, as we said in our scripts, we are taking more pricing this year. We upped it for this year from our normal 1% to 2% algorithm to 2% to 3%.\n\nBill Newlands -- Chief Executive Officer\n\nThe other thing I think is important to consider is we've seen significant mix benefits in our business as well. There's been -- because in part from the growth of cheladas, which are almost entirely single-serve, although we have added some innovation in different size and pack configurations. But the single-serve pieces of our business have been very strong. It's a great example of that's mix accretive.\n\nSo in addition to purely the fact that we are going to be taking a bit more price than we had originally anticipated, we also are seeing mix benefits within the portfolio as well, which will be advantageous.\n\nOperator\n\nThank you. Your next question is coming from Rob Ottenstein from Evercore. Your line is now live.\n\nRob Ottenstein -- Evercore ISI -- Analyst\n\nGreat. Thank you. I was wondering if you could talk to us a little bit about what's going on with Modelo and Corona, Corona being somewhat stronger than we would have expected. Modelo still very strong but slightly slower than it has been in prior years.\n\nIs there anything going on there in terms of the interaction between those two brands or the brand families that we should be aware of?\n\nBill Newlands -- Chief Executive Officer\n\nNo, Robert, I don't think so. I mean, again, when we look at the kind of growth profile that Modelo Especial, using that as the example, in any of the volumetric trend timing, we're growing in double digits all the way along. And that becomes -- obviously, the bigger it gets, the more double digits is a very enjoyable proposition. We're very excited admittedly about Corona Extra.\n\nCorona Extra has grown a bit ahead of what we had expected. But I think that speaks to the -- just the long-term belief among both Hispanic and non-Hispanic consumers in that brand. It's the most loved brand. We continue to benefit from that.\n\nAnd we continue to advertise against that business very heavily. So I wouldn't read a lot into the fact that Modelo continues to grow double digit, but it's slightly less than the last double digit. I would view it as we have a comprehensive brand portfolio whether you talk about Modelo Especial, Corona Extra, the chelada business, Pacifico, that just continues to radically outperform. And that combination allowed us to raise our expectations for the beer business for the year.\n\nRob Ottenstein -- Evercore ISI -- Analyst\n\nGreat. Thank you.\n\nBill Newlands -- Chief Executive Officer\n\nWelcome.\n\nOperator\n\nOur next question today is coming from Bryan Spillane from Bank of America. Your line is now live.\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nThanks, operator. Good morning, guys. I just wanted to ask a question about, I guess, beer inventories. And given that you've had more supply this year and seems like your in-stock levels are better in assortment, has it just been more in stock with a full array of assortment? Is that -- how much of a benefit has that been to depletions?\n\nBill Newlands -- Chief Executive Officer\n\nWell, obviously, any time you have all the packages and you have all the availability that you expect, it certainly is beneficial. What I must say is our team did an outstanding job of making sure throughout the challenging time when we had some product outages to make sure that we had availability of the brand. Brand size switching, meaning package size switching, within the beer business is very strong because most consumers come into the store planning to buy a Corona or a Modelo and, therefore, will adjust their package size selection based on what's available. We've seen that through in-depth consumer research.\n\nSo yes, it certainly helps some because it provides the wide array of selection that we owe to consumers. But it doesn't change the algorithm radically because as you've seen, we continue to show high single-digit volumetric and double-digit top-line growth within the business almost throughout the entire thing. The other thing that I would say, though, where you do see some real change by availability is Pacifico. We said a couple of quarters ago, we had some challenges around brown glass, which significantly impacted Pacifico.\n\nBut didn't really change. In fact, some of you on the call asked questions about that. Are we concerned that Pacifico's growth profile isn't what it once was? And then it comes roaring back with 37%, and the IRI data shows over 50% takeout increases. So I think it shows and confirms what we had said to you in prior quarters is that Pacifico is a tremendous potential brand for us going forward.\n\nAnd it is a great example to your question of in instances where we've had some challenges on inventory, what can really happen in the strength of our inherent brands.\n\nOperator\n\nThank you. Your next question today is coming from Kaumil Gajrawala from Credit Suisse. Your line is now live. Kaumil, perhaps your phone is on mute.\n\nBill Newlands -- Chief Executive Officer\n\nTalk to us, Kaumil.\n\nKaumil Gajrawala -- Credit Suisse -- Analyst\n\nHi. Sorry about that, guys.\n\nBill Newlands -- Chief Executive Officer\n\nCarry on.\n\nKaumil Gajrawala -- Credit Suisse -- Analyst\n\nCould we talk a little bit about the price increases? You're looking for a little more pricing perhaps than you had expected before? Are they in place? What's the magnitude? And then on price gaps, you gave pretty compelling reasons in previous quarters on why you were going up perhaps less than the market given kind of our outlook for inflation, most of which has come true. So can you maybe talk about kind of this new outlook and what has changed?\n\nBill Newlands -- Chief Executive Officer\n\nI think there's two or three things that fall into that equation. You are correct. We have raised our expectation from 1% to 2% to 2% to 3%. I think there's several things that are in play there.\n\nWe've been very excited by the buy rates that we've seen across our business, one. We obviously are doing our best to cover as best we can some of the inflationary pressures that Garth noted in his remarks. But we really haven't changed how we do pricing. We do our pricing SKU by SKU, market by market, all the way across the board.\n\nBut it will probably come into that 2% to 3% range, which again is up from what we expected. I think an important part, and I touched on it a couple of questions ago, is we're also seeing mix benefits, which does flow through in terms of how it presents itself. When you have things like single serves doing better, which is a better mix item for us, you see cheladas, which are almost all single serve, being a better mix item for us. So you've got a combination of, yes, we're going to take a bit more pricing.\n\nYes, you're seeing better mix in the overall equation. And yet, we're still doing it the way we're doing it, which is SKU by SKU, market by market. And I believe it remains judicious. We always keep the consumer in mind as we think about what we're doing relative to pricing.\n\nAnd that certainly isn't going to change.\n\nOperator\n\nThank you. Our next question is coming from Vivien Azer from Cowen and Company. Your line is now live.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nHi. Good morning. I wanted to touch on cannabis, Bill. I wanted to touch on your comment on SAFE Banking.\n\nI mean, I fully agree, right, like it's so hard to know. But if the base case assumption is that Republicans flip the House, it seems like there's maybe better than a 50% chance that SAFE could pass. Historically, Canopy has indicated that the Constellation Board sensitivity and your lender sensitivity is a key determinant in terms of their ability to close their purchase obligation on acreage that would certainly be meaningfully accretive to their bottom line, and in turn, how you guys are reporting that business. So could you just offer any updated insights on how the board and your lenders are thinking about SAFE in the current kind of House version, very narrow? Thanks.\n\nBill Newlands -- Chief Executive Officer\n\nSure. We failed miserably at predicting how that was all going to play out. So I would take my answer with a slight grain of salt, admittedly. But we are cautiously optimistic that there will be progress.\n\nWhat I'm particularly happy about relative to Canopy is I think they are positioned to be a winner in the U.S. Their Wana, Jetty, and Acreage layouts, which are all ready to go, I think are an important part of being a winner. We still believe that in the longer run, brands are going to matter. And I think they're positioning themselves to have the right brands that will matter over the long run here in the U.S.\n\nLook, we're optimistic. I think everybody is optimistic that we're going to start to see the legislation loosen up. Although again, being able to predict that, I would have failed miserably on that score. But we're hopeful.\n\nOperator\n\nThank you. Your next question is coming from Nadine Sarwat from Bernstein. Your line is now live.\n\nNadine Sarwat -- AllianceBernstein -- Analyst\n\nHi, guys. I'd like to kick off with two long-term questions here. So sticking on the cannabis points, in the past, you've alluded to U.S. federal legalization as being one of the key factors behind your continued confidence in the Canopy investment.\n\nBut it's now one of the stated reasons for the meaningful impairment you took today. So how long are you willing to wait to see U.S. legalization happen? And do you see the size of your stake changing in Canopy anytime soon? And then similarly, a bigger picture question, your super-premium beer brands continues to perform strongly in the last quarter, but the consumer is seeing increasing pressure on their wallets from macro pressures. So are you seeing anything, if any, changes in consumer behavior quarter to date from that macro pressure? Thanks.\n\nBill Newlands -- Chief Executive Officer\n\nSure. Let me take the wallet question, and then we can decide who takes the other. No, fortunately, we haven't. One of the things that we recognize is beer, fortunately, is a staple for many of our -- much of our consumer base.\n\nSo we've seen some variation in terms of the pack sizes that have been taken out. But as I alluded earlier, and we view this as a critical component, the buy rates that we've seen have been increasing. And that's one of the first things you look at is the number of times that people go to the store and what they take out when they're in the store. So we're cautiously optimistic that this is going to continue to go well for us.\n\nI think it speaks to the strength of the brands, and I think it speaks to the strength of the brand confidence that consumers have with us. Relative to cannabis, I wouldn't expect you to see the size of our investment in that change.\n\nGarth Hankinson -- Chief Financial Officer\n\nAnd as to outlook, I would just say that in terms of the first part of your question around legalization, first of all, that was one part of a multipart analysis to determine whether or not we need to take the impairment that we announced today. Beyond that, we continue, as Bill has said, we continue to be pleased with how the cannabis category has unfolded. In the U.S., as Bill noted in his remarks, it's now a $25 billion retail sales opportunity in those states where it's legal. So it is starting to convert consumers, and consumers are adopting to the category.\n\nAnd we are happy with the position that Canopy has in the U.S. and with the improvements that they're making in Canada.\n\nOperator\n\nThank you. Our next question today is coming from Bill Chappell from Truist Securities. Your line is now live.\n\nBill Chappell -- Truist Securities -- Analyst\n\nThanks. Good morning. Just a couple of questions on -- I mean, Modelo Oro. I can't remember, is that -- does shipments as you expand nationwide going to have an impact or a meaningful impact on the back half of the year kind of shipments? Or is that more into next year? Or is it not meaningful? And then second, and I know that I should probably understand this, but why isn't it just coming out of Modelo Light? I mean, it seems like with some of the confusion of Corona Premier that a consumer doesn't always understand that it's a light beer or it's a low-calorie beer.\n\nSo any clarification would be helpful. Thank you.\n\nBill Newlands -- Chief Executive Officer\n\nYeah, you bet. Oro is going to be taken nationwide next fiscal year. So it will have no impact per se in the back half of this current fiscal year. It's in three test markets now, and obviously, those will continue, but it will be taken nationwide next year.\n\nLook, we did a lot of study as to what we thought was the best answer. We -- if you actually look at the can, that we're really talking about the gold standard of light beer. So I think the consumer will understand what they're going to get. Our understanding from the research is that they do understand what it is.\n\nAnd certainly, we were very pleased with the results of the test market and are anxiously looking forward to seeing how it does on a national basis next year. It was highly incremental, and we're very excited about that as well. So we're very optimistic about what Oro can do when Modelo has a \"light version\".\n\nOperator\n\nWe've reached the end of our question-and-answer session. I'd like to turn the floor back over to Mr. Newlands for any further closing comments.\n\nBill Newlands -- Chief Executive Officer\n\nThank you, again, and appreciate all of you joining our call today. Hopefully, as you could hear, we delivered another quarter of strong growth performance. Consumer demand for our higher-end beer, wine and spirits brands remain robust, giving us further confidence in their runway for future growth. Our core beer brands, Modelo Especial and Corona Extra, continued to outshine the market.\n\nAnd our next-wave brands, like Pacifico and Modelo Chelada, are achieving very strong double-digit growth. We continue to see opportunity ahead for our beer portfolio supported by continued consumer-led premiumization and our ongoing investments in brewery capacity expansions. The benefits of our wine and spirits strategy are also taking hold as our higher-end brands continue to resonate with consumers and our global and omni-channel efforts are yielding benefits. Our largest premium wine, fine wine, and craft spirits brands all delivered positive depletion growth, and we achieved double-digit net sales growth in both DTC channels and international markets.\n\nAnd we continue to demonstrate, again, that we are committed to capital allocation priorities to maintain our strong financial foundation, balance returns and reinvestment and deploy excess cash with discipline. In closing, as our next earnings call is not until January, I'd like to wish everyone a safe and happy holiday season. And as always, we hope your celebrations will include enjoying some of our great products with your family and friends. Thanks again, everybody.\n\nAppreciate you joining the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJoseph Suarez -- Vice President, Investor Relations\n\nBill Newlands -- Chief Executive Officer\n\nGarth Hankinson -- Chief Financial Officer\n\nDara Mohsenian -- Morgan Stanley -- Analyst\n\nKevin Grundy -- Jefferies -- Analyst\n\nLauren Lieberman -- Barclays -- Analyst\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nAndrea Teixeira -- JPMorgan Chase and Company -- Analyst\n\nRob Ottenstein -- Evercore ISI -- Analyst\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nKaumil Gajrawala -- Credit Suisse -- Analyst\n\nVivien Azer -- Cowen and Company -- Analyst\n\nNadine Sarwat -- AllianceBernstein -- Analyst\n\nBill Chappell -- Truist Securities -- Analyst\n\nMore STZ analysis\n\nAll earnings call transcripts"
}