{
  "companyName": "Macy's",
  "companyTicker": "M",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/17/macys-m-q3-2022-earnings-call-transcript/",
  "content": "Macy's (M 0.93%)\nQ3 2022 Earnings Call\nNov 17, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and welcome to Macy's Inc. Q3 2022 earnings call. Today's call is being recorded. At this time, I will now turn the call over to Pam Quintiliano.\n\nPlease go ahead, ma'am.\n\nPam Quintiliano -- Head of Investor Relations\n\nThank you, operator. Good morning, everyone, and thanks for joining us to discuss our third-quarter 2022 results. With me on the call today are Jeff Gennette, our chairman and CEO; and Adrian Mitchell, our CFO. Jeff and Adrian have prepared remarks that they'll share, after which we'll provide time for your questions.\n\nGiven the time constraints, we ask that participants in the Q&A, please, limit their questions to one single-part question. Along with our press release from earlier this morning, a slide presentation has been posted on the Investors section of our website, macysinc.com. In addition to information from our prepared remarks, the presentation includes supplementary data to assist you in your analysis of Macy's. Also note that, unless otherwise noted, the comparisons that we'll speak to this morning will be versus 2021.\n\nComparisons to 2019 are provided where appropriate to best benchmark our performance given impacts from the pandemic. Keep in mind that all forward-looking statements are subject to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially from the expectations and assumptions mentioned today. A detailed discussion of these factors and uncertainties is contained in our filings with the Securities and Exchange Commission.\n\nIn discussing the results of our operations, we will be providing certain non-GAAP financial measures. You can find additional information regarding these non-GAAP financial measures, as well as others used in our earnings release and our presentation, on the Investors section of our website. Finally, as a reminder, today's call is being webcast on our website. A replay will be available approximately two hours after the conclusion of this call and is archived on our website for one year.\n\nWith that, I will turn the call over to Jeff.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nThanks, Pam. Good morning, everyone, and thank you for joining us today. It's an exciting time at Macy's, Inc. Our teams are geared up for the peak holiday season, and earlier this morning, we shared our third-quarter results where compelling product, disciplined inventory controls, and solid execution drove strong top- and bottom-line results.\n\nResults are further proof that our Polaris strategy, first introduced in February of 2020 is working. Before getting started, I would like to thank our entire organization. Every single one of our colleagues has contributed to our success. Thanks to them, I am confident that we are serving our customer base and their unique needs better than ever across channels, categories, occasions, and value brands.\n\nOur products, colleagues, and customers mirror the diversity we see across the country. We are an anchor and a trusted resource for all of the communities that we serve. And while we are honored to uphold many of the traditions of the past, like the Macy's Thanksgiving Day Parade and Santaland, we are also there for our current and potential customers as they celebrate the moments and holidays that are most meaningful to them. Being a modern department store is key to that relevancy. The concept of a trusted one-stop shop is timeless.\n\nIt works, but only if it reflects the preferences and needs of our customer, and we have transformed our entire organization to do just that. With our breadth and diversity of product across multiple nameplates that are not tied to just one value band, category, and user life stage, our position is a strength, especially in the current environment where the styles our customers are looking for, the categories they are seeking, and how much they are spending can differ dramatically from one season to the next. It also is what attracts new customers to us. We are committed to providing quality, fashion newness, timely flows, and relevancy through, first, a curation of premium owned and market brands, which we bring to life at Macy's through our Own Your Style platform; second, a disciplined approach to inventory, reflecting conservative buying and a healthy receipt reserve that ensures flexibility when our customer pivots and signals new interests; and third, a modernized supply chain and pricing science tools, which yield higher turnover, gross margin return on investment, and higher cash flow.\n\nThese attributes have been critical unlocks to our success. Third-quarter net sales of 5.2 billion were at the high end of our guidance provided on our second-quarter call, declining 3.9% to last year and rising 3.1% to 2019. Customers continue to return to in-person post-pandemic shopping experiences, and we're searching for occasion-based product, including career in tailored sportswear, dresses and luggage rather than popular pandemic categories such as active, casual sportswear, sleepwear, and soft home that skew more heavily toward digital purchases. These factors contributed to the relative outperformance of brick-and-mortar sales, which declined 1% to last year.\n\nDigital sales declined 9% to last year. Relative to 2019, brick-and-mortar sales declined 9%, and digital sales rose 35%. During the quarter, Macy's digital traffic remained relatively consistent, but conversion softened, suggesting that while discovery is still occurring online, there has been a shift in in-person transactions. Regardless of where our customer ultimately makes a purchase, we strive to provide the best omnichannel experience throughout their journey.\n\nWe are making digital investments to authentically communicate and serve their lifestyle needs whenever and however they choose to shop with us. That includes the introduction of personalization and live shopping, as well as the ongoing refinement of existing online platforms, including our mobile app, where we registered an 11% rise in active customers on a trailing 12-month basis. Compared to our average Macy's customer, active app users spend more per transaction and per year. Turning to comps.\n\nOur owned plus licensed comparable sales declined 2.7%. Luxury nameplates, Bloomingdale's and Bluemercury, continued to outperform. Bloomingdale's posted 4.1% comp sales growth and expanded its active customer file by 9% on a trailing 12-month basis, while Bluemercury saw comp sales growth of 14% and grew its active customer file by 15%. Although in different stages of their revolution, we see a significant long-term growth opportunity for both nameplates.\n\nMacy's owned plus licensed comp sales declined 4%. On a trailing 12-month basis, active customer count grew by 2%, and our Star Rewards active customer base, which is our most valuable customer, represented 70% of Macy's owned plus licensed comparable sales, five points higher than last year. Throughout the quarter, our customer responded well to our mix of full price, promotions, and markdown items. When combined with selectively higher tickets, we realized our consecutive quarter of AUR gains.\n\nEnd-of-quarter inventories were better than expected, rising 4% to 2021 and down 12% to 2019. And we achieved adjusted EPS of $0.52, well above our guidance. While we are pleased with our progress, we are committed to doing more. Our customers are savvy, and they have a lot of options.\n\nOur team is aligned on what it takes to be successful and relevant today and into the future. This includes, one, an improved shopping experience for all customers through reducing friction across omni touch points; two, more personalized offers and loyalty communications; three, a compelling mix of private label and branded product; and four, speedier checkout and delivery with the right service when our customer needs it. In addition to these ongoing initiatives, we are also enhancing other go-to-market strategies to inspire new and existing customers. Last month, we introduced permanent Toys \"R\" Us shop-in-shops within all Macy's locations, providing an experience that does not exist on a national basis elsewhere.\n\nThese shops are adjacent to the kids department, making it easier to discover with room for kids to explore in a space designed for them. We are encouraged by the initial response. Overall, the Toys \"R\" Us customer is younger and more diverse than our Macy's customer, and we have discovered that 85% of Toys \"R\" Us customers are cross-shopping. Toys \"R\" Us is a great example of finding a hole in the market and strategically filling it, gaining share and loyalty in creating lasting memories for children and adults alike.\n\nAnother example is the late September launch of Macy's digital marketplace. Marketplace features a collection of new brands, products, and categories from third-party sellers, representing a low-risk way to introduce customers to new options without shouldering inventory liability. While not the first to do this, we believe our curated offerings will keep existing customers on our platform while bringing in new ones. Units per order are above the Macy's average, and we are seeing customers cross-shop with mixed bags, including owned, vendor direct, and marketplace items, which is encouraging.\n\nAnd similar to Toys \"R\" Us, it further cements our status as a one-stop shop. Another way we were staying close to our Macy's customer is by refining our in-person shopping experience. Market by Macy's, which we introduced in February of 2020, plays a unique role in our omnichannel market ecosystem. These off-mall stores are 25,000 to 50,000 square feet, compared to our full-line average of roughly 185,000 square feet, and offer a highly curated immersive shopping experience that celebrates discovery and convenience.\n\nMarket by Macy's conversion rates are generally higher than that of our full-line stores, and these locations continue to outpace their respective trade areas and acquisition of new customers. Today, we operate eight Market by Macy's. As we evaluate potential new locations, we are looking at areas where we have a strong digital presence, but no physical footprint, where it no longer makes sense for us to keep a full-line store and Market by Macy's can act as a replacement. A good example is the Market by Macy's in St.\n\nLouis, Missouri, which opened last week and is a mile away and less than a fifth of the size of its mall-based predecessor. All these initiatives taken together plus others like the ongoing reimagination of our private brands, our Own Your Style brand platform and our Macy's Media Network are a testament to our focus of reclaiming Macy's voice as a multigenerational influencer and arbiter of American fashion and helping customers connect with the product that empowers, inspires, and speaks to their unique individual preferences. We are focused on remaining relevant by doing so in an authentic way that honors our rich and unparalleled heritage. That emphasis on bridging the past with our future at Macy's also applies to Bloomingdale's, where we are celebrating our 150th anniversary with a series of events and exclusive collaborations with top designers.\n\nThe collections, along with pop-up shops and events with brands such as Ralph Lauren, Jimmy Choo and Dior, speak to our relationships with both established players, as well as the next generation of luxury designers our customers are craving. Following seven quarters of comp owned plus licensed sales growth, we are excited about the opportunity at Bloomingdale's and the expansion of our off-mall smaller format, Bloomie's, nameplate. Today, in the Chicago land area, we are opening our second Bloomie's. At 50,000 square feet, it serves as a replacement of the 206,000 square foot full-line Old Orchard location.\n\nMomentum has also continued to build at our other luxury nameplate, Bluemercury, where we registered our fourth consecutive quarter of comparable sales growth. Another way we're maintaining a close relationship with our customers, colleagues, and communities and one which we are all proud of is the launch of S.P.U.R. Pathways in early November with our momentous capital. S.P.U.R.\n\nPathways is a multiyear, multifaceted program that ultimately will provide up to $200 million of funding to diverse owned and underrepresented businesses. The program is designed to advance entrepreneurial growth, close wealth gaps, and address systemic barriers among minority-owned businesses. S.P.U.R. Pathways also represents an ongoing evolution of our mission, everyone, social purpose, commitment to people, communities, and plant.\n\nBefore turning it over to Adrian, I would like to provide insight into the recent trends and our current thinking around the fourth quarter. In the middle of October, there was an unexpected slowdown in sales, which continued into November, markets that were unseasonably warm were the most affected. Over the past week, our sales performance has improved. We are evaluating the sustainability of recent trends and the drivers that we believe will impact holiday consumption.\n\nWhen we think about last year, the consumer was flushed with cash, and there was a pull forward of demand on well-documented inventory constraints. This year, consumer is hearing about a glut of inventory. They are under a tighter budget, feeling the impact of inflation on nondiscretionary items and beginning to deplete their savings. With that in mind, we believe they are waiting until closer to holiday to make purchases, especially as there is an extra day, which is a Saturday between Thanksgiving and Christmas.\n\nWe now expect holiday shopping patterns to be similar to 2019 and are taking the appropriate actions to support anticipated higher peaks around Black Friday, Cyber Week and the the weeks before Christmas. The holidays are happening. Trips are booked, parties and family gatherings are planned. Consumers will be spending, but it is too early to tell how much they will allocate to our [Inaudible] categories.\n\nWe are confident in the amount and composition of our inventory, timing of flows, and marketing but cognizant that we do not operate in a vacuum. The low end of our outlook assumes late October and early November sales trends continue. Pressure on the consumer persists, and the promotional competitive landscape intensifies throughout the holiday and into January. The high end assumes that sales patterns will be consistent with our 2019 trends and reflects recent adjustments to our operating plan for holiday.\n\nAs we navigate this period of uncertainty, our financial health and operational disciplines, along with our experienced leadership team, are key advantages. We are flexible, agile, and well positioned for the fourth quarter and 2023. Here's why. Our inventory is in great shape.\n\nWe have roughly 55% newness for holiday, 30 percentage points higher than 2019, and we are not saddled with older receipts in pandemic category overstocks. Across nameplates, we have products and brands that cater to our customers' lifestyle needs with a variety of price points that will allow everyone, including last-minute shoppers, to participate in the magic of holiday at Macy's, Inc. This includes exclusive cosmetics and fragrances from Dior and Armani, established brands such as UGG, Ralph Lauren, The North Face, and Jordan, as well as newer additions, Kylie Cosmetics, NEST Candle, [Inaudible] and Pandora. With our strong vendor relationships and mix of private brand and licensed brands, we can chase into areas of strength that warrant it and have a flexible pricing model to quickly adjust promotions and markdowns if demand does not materialize.\n\nWe believe we are taking in an appropriate cautious stance on our outlook given the myriad of unknowns. However, that does not temper our enthusiasm for holiday. We know our customer relies on us for an exceptional holiday experience. And as we have for the past several years, we'll deliver.\n\nWith that, I'll pass it over to Adrian for a deeper look into the third quarter and details on the remainder of the year.\n\nAdrian Mitchell -- Chief Financial Officer\n\nThanks, Jeff, and good morning, everyone. It has been two years since my first earnings call. At that time, I spoke to the three reasons I joined Macy's, Inc., our brand, our talented and dedicated team, and the focus within our Polaris strategy on innovation and operational excellence, all designed to capitalize on the opportunities in the changing consumer landscape. I also shared that my initial focus was a return to financial health and the creation of additional capacity to invest in profitable sales growth while returning capital to our shareholders.\n\nProtecting our financial health is paramount. Beginning in August 2021, our teams took a series of aggressive actions to pay down over $1.8 billion of long-term debt and we reladder our fixed interest rate debt maturities. As a result, we are now benefiting from our vastly improved leverage ratio and more attractive debt maturity schedule. Disciplined decisions around the governance of inventory are also a top priority.\n\nEffectively managing inventory gives us the flexibility and liquidity toward what consumers are buying at every customer touch point. This is imperative as it impacts all aspects of our business, including the health of our margin profile, as well as the amount of cash we have available to both invest in strengthening our omnichannel capabilities and to return to shareholders. The investments we have made in data and analytics from demand forecasting to inventory allocation, to pricing signs have laid the foundation for continued inventory control now and well into the future. We also have a disciplined approach to make pivotal decisions quickly across our entire enterprise.\n\nNow, let me walk through the third-quarter results and our five value creation levers before discussing our outlook for the remainder of the year. First is omnichannel sales. We generated $5.2 billion in net sales during the quarter, a decline of 3.9% versus the prior year. Comparable sales on an owned plus licensed basis decreased by 2.7%.\n\nDuring the third quarter, 20% of omnichannel markets grew sales year over year, accounting for about 15% of Macy's brand comparable owned plus license. We have been aggressive about rightsizing our store base, and we'll continue to prioritize asset monetization. However, we continue to see the importance of main locations within the best malls, particularly as we build out our omnichannel ecosystem. We expect to announce less than 10 store closures in January, consistent with our decision to delay the closure of our full-line store base that we communicated last year.\n\nThe second value creation lever is gross margin. For the quarter, gross margin was 38.7%, down 230 basis points from the prior year period and better than our expectation. The gross margin rate decline was driven by a 230-basis-point decline in merchandise margin, reflecting an increase in promotional and clearance markdowns to sell lower moving categories at Macy's, including casual apparel, soft home, and warmer weather seasonal goods. Our pricing signs, including location-level pricing, continue to drive incremental margin benefit and improve the effectiveness of promotions for Macy's, Inc.\n\nWe are in the mid-innings of our pricing work and are continuing to refine and invest in machine-learning tools that will allow for more sophisticated competitive pricing and greater automation at scale. Partially offsetting the additional third-quarter markdowns were higher ticket prices and favorable category mix shifts, driving a roughly 3% improvement in owned AUR for Macy's, Inc. Delivery expense accounted for 4.3% of net sales, relatively consistent with last year. Higher fuel costs more than offset the impact of a 2-percentage-point decline in digital penetration and reductions in delivery cost per package.\n\nWe continue to get smarter about where demand is and how best to service that demand. As part of our continued efforts to increase the productivity of our physical assets, we have converted space in 35 stores to serve as mini DCs. These semi-automated mini DCs totaling nearly 1 million square feet allow us to reduce shipping costs and split shipments, better utilize inventory in specific markets and regions, and improved delivery speed, which will be an advantage this holiday season. They are relatively low-cost complements to our existing fulfillment network. We have also made the appropriate process and technology investments to streamline fulfillment activities in all remaining stores.\n\nThe investments we're making in our supply chain, both upstream and downstream, are focused on simplifying our processes and modernizing our technology, further enhancing our [Inaudible] to move products to our customers faster while driving greater supply chain cost efficiencies. The third value creation lever is inventory productivity. Inventory increased 4% year over year, which was better than our expectations and down 12% compared to '19. We have strategically brought in seasonal products earlier and have the added capacity to chase in-season trends.\n\nInventory turnover for the trailing 12 months improved 15% from 2019 and was relatively flat to 2021 when levels were artificially low due to supply chain constraints. Expense discipline is the fourth value creation lever. SG&A increased $84 million or 4.3% to $2.1 billion. SG&A as a percent of net sales was 39.3%, 300 basis points higher than last year.\n\nCompared to 2019, SG&A improved by 330 basis points. SG&A reflects the investments we had made in our colleagues as we continue to adjust compensation to remain competitive and attract the best talent. A reminder, in 2021, we benefited from an elevated number of job openings, the vast majority of which has since been filled. During the quarter, SG&A also benefited from Macy's Media Network, which generated net revenues of $31 million, up 21% from last year.\n\nCredit card revenues were $206 million, down $7 million from last year. As a percent of net sales, credit card revenues were consistent with the prior year 3.9%. Performance continued to be driven by lower bad debt levels than expected, larger balances within the portfolio and higher-than-expected spend on co-brand credit cards. After accounting for interest and taxes, these results generated better-than-expected adjusted diluted EPS of $0.52 versus $1.23 in 2021 and $0.07 in 2019.\n\nLastly, the fifth value creation lever is capital allocation. Year to date through October, we generated $488 million of operating cash flow and invested $983 million in capital expenditures. Year over year, operating cash flow was impacted by outflows from accounts payable and accrued liabilities, as well as a net outflow from the change in merchandise inventories net of merchandise accounts payable due to the timing of receipts and payments. Year to date, free cash flow, inclusive of proceeds from real estate, was an outflow of $373 million.\n\nFor the full year, we expect that capital expenditures to be $1.2 billion, up from $1 billion, reflecting investments to improve our omnichannel capabilities and strengthen our competitive position in the marketplace. We are committed to our overall capital allocation strategy, which includes maintaining a healthy balance sheet and investment-grade credit metrics, investing in value-enhanced initiatives and capabilities, and returning capital to shareholders through quarterly dividend and share repurchases. In light of the current macroeconomic environment, our focus is prioritizing liquidity and balance sheet health in order to maintain flexibility to respond quickly to a variety of opportunities and scenarios as they arise. Next, I'll walk through our updated outlook for the fourth quarter and fiscal year.\n\nFull details of our updated guidance can be found within the presentation on our website. As we think about this critical fourth quarter, we believe that every sale has to be earned through fresh items that consumers want to purchase, as well as quality and clear value. Our guidance range contemplates the risk associated with softening consumer demand and the impact of the broader competitive landscape. While we are comfortable with our inventory position, we will continue to proactively adjust promotions and take markdowns necessary to drive sell-throughs in slower moving categories and ensure that we do not carry inventory risk into 2023.\n\nIn light of the late October and early November trends and the uncertain demand environment, we now forecast fourth-quarter net sales of $8.16 billion to $8.4 billion. Gross margin for the quarter is expected to be no more than 270 basis points lower than 2021. For the fourth quarter, we expect adjusted earnings per share between $1.47 and $1.67. For the full year, our expectations for Macy's, Inc.\n\nis largely unchanged. We expect net sales of $24.3 billion to $24.6 billion; digital as a percent of net sales to be approximately 33%; gross margin down roughly 150 basis points from 2021; SG&A as a percent of net sales to rise approximately 120 basis points from 2021; net credit card revenues of approximately 3.4% of net sales, up from our outlook of 3.3%; asset sale gains of $75 million to $90 million; benefit plan income of $21 million, compared to our prior outlook of $25 million; adjusted EBITDA margin of roughly 10.5%; and interest expense of $180 million, down from $185 million. After interest and taxes, we are now estimating annual adjusted earnings per share of $4.07 to $4.27, reflecting increase in credit card revenues, lower benefit plan income, lower interest expense, and a change in our shares outstanding expectation. Combined, these changes resulted in the $0.07 increase from our prior outlook.\n\nOur outlook does not consider the impact of any potential future share repurchases associated with our current share repurchase authorization. In closing, our strong inventory management practices, along with our liquidity, investment-grade credit metrics and fixed interest rate debt and mid-pricing interest rate environment, allow us to operate from a place of strength and flexibility even when the broader macroeconomic environment is challenging. We believe we are well positioned to compete this holiday season. We have the tools, the data-driven processes, and the talented teams to manage through this uncertain time and are committed to building a better and more relevant Macy's, Inc.\n\nof the future. With that, I'll turn it back over to Jeff for some closing remarks.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nThanks, Adrian. Although the macroeconomic environment is uncertain, we are confident in our ability in this holiday and beyond. We believe Macy's, Inc. is poised for a future of profitable growth.\n\nWe are committed to making strategic investments to provide a positive and consistent shopping experience for our customers, rich careers for our colleagues, and an attractive return for our investors. We will do this while bolstering our position as a leading modern department store. And with that, we're going to open it up for questions.\n\nOperator\n\n[Operator instructions] We'll take our first question from Chuck Grom from Gordon Haskett. The line is open. Please go ahead.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nHi, thanks. Good morning, and great review, guys. Just had a question kind of near term, if I can. By backing into the midpoint of your sales guide, Adrian, it implies about, I think, around the negative 4% comp in the fourth quarter, which on a three-year geostack is about 300 basis points of the slowdown from the third-quarter number.\n\nI just wanted to confirm that's where October ended and, I guess, where November has started. And then more near term, when you look at the last week of improvement, are there any factors you can point to either regionally or from a category perspective?\n\nAdrian Mitchell -- Chief Financial Officer\n\nAbsolutely, so I'll get it started, Chuck, and good morning to you. I'm sure Jeff will comment on some of the category pieces as well. You know, as Jeff spoke about in his opening remarks, there's this uncertainty that Jeff has highlighted. And we've looked at a number of scenarios as we think about the fourth quarter, looking not only at the overall trend for the third quarter but also looking at the last couple of weeks, which was slower than we had expected and also trickled into the early part of November.\n\nSo, look, as we navigate this uncertain period, our high end of guidance assumes that the consumer reverts back to the Q3 trends more broadly, outside of the last two weeks and that the holiday shopping patterns mirror a lot of what we would have experienced pre-pandemic. You know, as we think about the low end of the guide, as you described, it assumes the continuation of the trend that we saw in late October into the early part of November. And so, when we think about both ends of the guidance, the one thing that we are very disciplined around is making sure that both ends reflect also the markdowns to ensure that we drive the sell-throughs for slower-moving categories that may vary based on what end of the range we actually end up on. So, that's a bit of the context around how we're thinking about it.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nAnd then, Chuck, on categories, the cold-weather categories definitely responded better over the past week. So, just increased sell-throughs and business. And when you look at outerwear, you look at boots, sweaters, fleece, those categories. And the geography question, it's clearly got better in the Northeast and Upper Midwest, but it also got better in -- when you look at the southern part or the belt of the country as well.\n\nSo, an improvement, and we're watching the trends closely to see which trend line sticks.\n\nOperator\n\n[Operator instructions] We'll take our next question from Matthew -- Matthew Boss from JPMorgan. The line is open. Please go ahead.\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\n[Audio gap] maybe key areas of the organization that you think are better positioned relative to 2019, how you believe this is driving results relative to your peer set? And then just opportunities you see for Macy's to take market share during holiday and into next year.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nYes, Matt, I think I got most of your question. You were cut off a little bit at the front. But I would tell you that kind of pre- and post-pandemic, kind of how I would characterize Macy's. I'd say the headline here is that we're a more modern department store.\n\nI'll talk about it in kind of five buckets. So, the first one would be we have the right talent and team alignment, and that everybody is very focused on executing the Polaris strategy with precision. I'd say the second thing that is a pre-, post-pandemic headline would be just we're in much better financial health. And when you look at it, we just have materially less leverage, little to no debt over the next five years.\n\nAnd I think we are executing a really disciplined capital allocation strategy. I think the third one is the big bucket -- is inventory control. That starts with just really a big focus on strategic planning down into not only season, quarter, category, brand, etc. That really translates into the buying team is more conservative than what they're buying.\n\nAnd they're also retaining a nice reserve so that they can respond in season. We have also pulled in more data science to really give us where the customer shifts are going by category, by brand, by value bands. Also included in inventory control is a more modernized supply chain. And so, we certainly have diversified our private brand manufacturing.\n\nWe diversified our port entry, and we're deploying more sophisticated forecasting and allocation tools. I'd say the fourth bucket just is, which I think is in the middle innings of our development, is pricing science and just a real disciplined focus on sell-throughs, turnover in GMROI and then using just increased automation to help us respond to that. And then if I had to pick a fifth, I would say that and this is in the very early innings, it's just our vision and early execution with the private brand strategy. I think it's one of the biggest volume drivers that we're going to have in the future.\n\nAnd as we see it right now with the INC Women's brand, which has been revitalized as one of our best trending brands in the store, and we've got a lot of pipeline of new content coming, which we'll talk about in future calls. So, just as an overall comment, I just think that from where we were pre-pandemic, we just have a real pipeline of innovation coming with loyalty and personalization, what we're doing with marketplace, it's a different company than we were back in March of 2020.\n\nAdrian Mitchell -- Chief Financial Officer\n\nThe only other thing I would add, Matt, is that to Jeff's second point, we do have the financial capacity and the wherewithal to continue to invest in modernizing our business as a modern department store. When you just look at the math, we're stronger, we're more agile, we're financially healthier so that we can continue to make the investments in the business. And Jeff and I and the management team have a pipeline of other initiatives underway, but we're very much focused on profitable sales growth. That's our longer-term focus.\n\nOperator\n\nWe will take our next question from Omar Saad from Evercore Partners. Your line is open. Please go ahead.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nThanks. Good morning. Nice quarter. I wanted to follow up on kind of the e-com stores mix.\n\nYou guys alluded to e-com, obviously, giving back some of the gains and -- but keeping so many things well above pre-COVID levels of where stores are coming back. How do you think that plays out in the fourth quarter? I'm not sure if I quite discern what exactly your kind of e-com versus stores mix will be. But in terms of that this year in the holiday season, do you expect stores to be -- kind of continue that trend? And then what does that mean for margins for you guys as the e-com business has a lot of shipping costs during the holiday quarter typically? And then maybe quickly, what your third-quarter comp would have looked like if that mid-October slowdown didn't happen? That would be helpful for us, too. Thanks.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nHi, Omar. First off, we're very focused on omnichannel, and that's the headline here. What I'd say on the digital versus the channel within the omnichannel stack is that digital is reverting back to kind of a mix between where we were pre-pandemic and where we were during the pandemic. So, when you look at our digital penetration of the business in '19, it was 25%.\n\nDuring the pandemic, it was 40%. And as you heard from our call, we're now calling the 2022 at 33%, down from our initial estimation that it was going to be in the 37% range. So, that has downshifted. We do expect that we're going to have a strong performance to 2019 across every quarter, and we're mapping on that.\n\nWhen you see what our trend was in digital in the third quarter versus 2019, we were up 35%. So, that is a similar -- when you kind of think about that when you embed that into kind of our modeling for the fourth quarter on the high end of our guidance, that's where we see it. All shipping costs on any scenario that we have have been contemplated. So, that is a -- where you might have higher shipping costs if you're on the higher digital model.\n\nIf you're on the lower digital model, you might have higher SG&A costs because it's -- that traffic might be shifting to stores. So, those are the ways that we're looking at it in terms of how we're modeling it. But -- when I look at -- when you think about GMROI or you think about what we're doing with turnover, all of that is in our models on both ends of the guidance about which way it's going to go. What we've done is -- when you look at the inventory allocation, we've got a lot of our inventory that is forward deployed.\n\nThese 35 mini DCs that Adrian spoke of, it's about 1 million square feet of supply chain we didn't have last year. We are looking at all of our ship alone categories to get those closer to the customer to increase speed of delivery and also mitigate shipping costs. You know, we've got great automation that's going on in our mega centers to make sure that we're hitting the customer expectations on time of delivery and reducing package cost. So, all that kind of modernized supply chain applies to whatever comes our way with digital business in the fourth quarter.\n\nOperator\n\nWe will take the next question from Oliver Chen. Your line is open. Please go ahead.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nHi, Jeff and Adrian, nice job on the quarter. October has been fairly volatile. I'm curious about your thoughts on the consumer and the price consciousness and what you're seeing and also what you might extrapolate going forward? Related to that, is this risk of promotional environment intensification -- other folks don't have inventories as well in control. Would love your thoughts on how you may handle that because it really seems like others are over-inventoried.\n\nThanks a lot.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nYeah. Let me start out, Oliver. Let's start with the consumer. I think, clearly, when we looked at it, it was unexpected, what we saw as kind of the downshift.\n\nAnd to Omar's question about what happened in the course of the quarter, the last couple of weeks of October, I think of that as being twice the negativity of the trend that we had in the first 11 weeks of the quarter. So, we've been watching that one carefully to see, OK, is that where the customer or the consumer is going? And when you started to think about where we were last year with all of the publicity that was going on about lack of supply and supply chain issues, and then, if you don't get it now, you're not going to have it in time for Christmas. And you counter that with if you were to do all the polls of what the consumer articles have been on blood of inventory and wait for best prices, we really saw it in our conversion rate. So, what happened in the last couple of weeks of October was not a downshift in traffic.\n\nWe didn't see less traffic coming on the websites or in our stores, which we now track through RetailNext. What we saw was a drop in conversion. And so, that conversion was a market difference, not from what the trend had been from the previous weeks, but from what we were up against in 2021. So, that is -- that's what kind of showed us that this is probably a -- this idea that there might have been a supply concern and that with the supply concern being off the table, we'll go back to usual demand patterns.\n\nWe're watching it carefully to see which way we're going. Obviously, we wanted to make sure that our guide comprehended that if it was a slowdown like we saw in the last two weeks of October and we took that all the way through the balance of the year versus this if it modeled 2019. So, you know, that's where we're at. And I think in terms of the -- where our inventory is, because of the reserves that we have, we can peel that back depending on whatever we're seeing in the environment.\n\nIt's as much important for me to say that when we've got a category that's really hot and it's really working and there's an opportunity for us to get fresh inventory, which there's always opportunity, we're able to jump on that. If that doesn't materialize, then we'll just peel that back. So, our intent is that by the end of the fourth quarter, we're going to be in a great inventory position and in the right mix of categories, brands, and value bands to enter what our expectations are going to be for '23, which we'll talk about on the fourth-quarter call.\n\nAdrian Mitchell -- Chief Financial Officer\n\nIf I could just add a couple of things just to build on Jeff's point, the punchline for Jeff and I, as we feel good about the inventory position for holiday. Not only are we looking at our inventory position versus last year, which is you know we're up about 4%, but we're actually down 12% to 2019. And really, look, we're very excited about the level of newness, 55% newness for the holiday season. To your question about the promotions, the inventory discipline that Jeff described is very much aligned with our pricing and markdown strategy.\n\nYou know, we will take the necessary markdowns based on demand versus the expectations we have week to week as we progress through the fourth quarter. And we know that customers from a pricing standpoint are looking for value. All the surveys that we've seen would indicate that the value is going to be an important driver for the customer. So, as we think about our initial ticket, our promotions, our markdowns, we expect to manage through that as best we can, but the good news is we have the pricing signs to be able to do that, looking at sell-throughs, looking at the available inventory by location, looking at the product outdates.\n\nSo, we feel good about where we are starting the quarter, and we feel good about our plans going through the quarter.\n\nOperator\n\nWe will take our next question from Ashley Helgans from Jefferies. Your line is open. Please go ahead.\n\nAshley Helgans -- Jefferies -- Analyst\n\nHey, good morning. Thanks for taking our questions. Any initial learnings you can share about the new marketplace model. And then we're just curious what's driving the larger basket sizes and units per order so much?\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nAll right, so let's talk about marketplace. So, we launched it successfully earlier in the quarter. And I think the big thing on the marketplace is that it's not a flip to switch like it's a fully formed organism on our site. We're adding new content every single day as we continue to scale this.\n\nRight now, we're really bringing on new brands, products, and categories, really focused on premium third-party sellers. And the overall objective here is it's a low-risk way for us to introduce new customers or take care of existing customers on signals that where we didn't have content in either owned or VDF inventory in the past. And that's without shouldering the inventory liability. It's too early to quantify a lot of the detail with it, but let me just tell you a couple of headlines.\n\nThe first one is that it's attracting younger customers. That's -- and when you think about that higher basket size and the higher units per order, a lot of that is mixed baskets between either owned inventory or VDF inventory. So, that's a real positive sign. What I'd say is that when you have a new customer who's coming into marketplace, almost all of them are cross-shopping in the balance of Macy's.\n\nWe're excited about the fact that we're going to continue to develop this. We're excited about adding Bloomingdale's marketplace next year. And we're hitting our objectives. Too early to talk about any more specifics on it.\n\nWe'll give you more detail on future calls.\n\nAshley Helgans -- Jefferies -- Analyst\n\nOK, great. That's helpful. And then if I can just throw in one more. Any color you [Technical difficulty]\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nWe lost you, Ashley. Are you on mute?\n\nOperator\n\nWe'll take our next question from Kimberly Greenberger. Your line is open. Please go ahead.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nHey, Ashley, if you're on the call -- Kimberly, two secs. Ashley, if you're on the call, just email us your next question, and we'll take care of it. Kimberly, you're up.\n\nKimberly Greenberger -- Morgan Stanley -- Analyst\n\nThanks, so much, Jeff. Obviously, it sounds to us like you're really navigating the short-term ups and downs pretty well. So, I wanted to just turn an eye toward 2023. We understand you're not providing guidance for 2023 today.\n\nBut we're just interested in understanding how you're thinking about it kind of big picture.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nYeah.\n\nKimberly Greenberger -- Morgan Stanley -- Analyst\n\nWe here on our side don't have a lot of visibility in sales trends. I'm not sure how you feel about that. So, I'd love to hear your thoughts. And if you think that visibility is low as well, maybe you can talk through how you're approaching your spring and summer inventory buys.\n\nAnd, Adrian, if you could just call out any notable headwinds or tailwinds that you see on the horizon in 2023, that would be super helpful. Thanks.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nHi, Kimberly. So, let me start with -- some of this is predicated on how the balance of fourth quarter goes and what is -- what's the consumer buying through this time frame. But let me just say that we do think that this customer -- that this holiday is important to our consumers and the gift-giving is going to be important, family gatherings are going to be more plentiful than other. We look at hotel reservations, airline flights, just all the surveys that say how many nights they're going to spend away from their home with family members.\n\nThis gifting season is going to be important. Now, that is when you look at savings rates starting to deplete, you look at all the other -- just the cumulative effects of inflation on our consumers across all discretionary and nondiscretionary spend. There may be a slowdown in as we think about the first quarter bind that they will be tapped out in terms of their budgets. So, while not giving you any guidance for '23, we are looking very carefully at the base of your question, which is how that might come by quarter and ensuring that we have the right supply and not oversupply of content.\n\nHowever, that quarter split might be out. So, we think that the first quarter may be more pressed, and we're thinking through that right now. We're making adjustments in our own ordering, obviously, watching our reserves very carefully on this. And so, spring, summer, we have a better view of.\n\nNot sure yet about what fall holiday will look like. All that will be obviously baked into our full guidance when we come back to you, you know, at the middle of February. So, anything, Adrian, you would add?\n\nAdrian Mitchell -- Chief Financial Officer\n\nYes, I'll just add a couple of things. And good morning, Kimberly. What I would say is that within the context of what Jeff described, we remain committed to our previously stated longer-term targets, which are low single-digit sales growth and low double-digit adjusted EBITDA margins. And I think if you think about what Jeff shared a bit earlier with regards to how we're thinking about the business, I think that the actions that we've been taking to strengthen our competitive position is really important.\n\nSo, we have a healthy balance sheet, we're investing in new capabilities, we have a talented team, and we believe that positions us well for those longer-term targets of profitable growth. You know, we're investing in high-return initiatives. These are the things that will strengthen our capabilities to be able to really go to the marketplace in a stronger position with the consumer, really building on that foundation around disciplined inventory management, investing in talent and all the things that we've spoken about earlier. To your point about headwinds and tailwinds, I think the biggest headwind that still remains around inflation because that's really affecting the capacity for consumers to spend on discretionary categories.\n\nIt's also, you know, as we look ahead, one of the headwinds we're also looking at is just what's the rate of demand. How much will demand slow in a rising interest rate environment? The tailwinds that we think we have is how we compete in the marketplace. We know that the consumer -- value is important to the consumer, customer experience is important to the consumer, relevance is important to the consumer. So, we're really focused on what we can control and how we compete, and I think that could be a real tailwind for us.\n\nOperator\n\nWe'll take our next question from Dana Telsey from Telsey Group. Your line is open. Please go ahead.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGood morning, everyone, and nice to see the progress. As you think about the real estate portfolio, urban areas versus suburban areas, what you're seeing in Backstage? Is the performance different at all from what you're seeing in those areas? And then next year, as you think about supply chain broadly, how do you frame the tailwinds from supply chain and what it could mean to the business? Thank you.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nLet me start with your first two points, Dana, and then I'll have Adrian take the supply chain question. What I'd tell you on the urban versus suburban, we definitely -- when you look at our downtown locations, as we talked about on the previous call, those definitely are some of our best-performing locations. Much of that is related to the return to office and just having just a lot of activity that is going around those particular buildings. We're seeing that with kind of the return of customers that we're basically avoiding those areas based on being during the pandemic.\n\nSo, that continues. We're having a good year when you think about Herald Square, Union Square, 59th Street at Bloomingdale's, you go downtown D.C., Philadelphia, State Street, all those stores are having a very strong year. So, now they are still well below where they were during pre-pandemic. So, there is a lot that needs to come back, and that is how we're looking at the potential tailwind, maybe not in '23 of international tourism.\n\nWe thought it was coming back in '23, not certain with the exchange rates of where that's going to come out, but we're watching that one carefully to kind of get those buildings back to 2019 levels. So, I mean that's how I would characterize that. When you think about Backstage, Backstage is equally doing well. I mean we now have it in 310 stores.\n\nWe opened it just recently in Herald Square. It was already in our other kind of downtown flagships. It's doing quite well. So, yeah.\n\nThere's really no difference between the performance of it in an opening price mall versus one that is in a premium mall. Backstage is just fantastic. And what I like about it is that it basically is adding to the basket of existing customers, and it's attracting new and more diverse, younger new customers. So, everything we've been talking about on the evolution of our Backstage business since 2015 continues to pay dividends for us.\n\nSo, that's how I'd characterize that. I'll turn it to Adrian on supply chain.\n\nAdrian Mitchell -- Chief Financial Officer\n\nThank you, Jeff. Good morning, Dana. So, with regards to supply chain, as we think about next year, there are two realities that we view in our planning. Number one is that goods will be flowing.\n\nWe're certainly seeing the goods roll this year, which has positioned us very well for the holiday season. We're set on our floors, we're ready for holiday, but we believe the supply chain is going to continue to get healthier and healthier. But the key thing is that goods are flowing. I think what's important for us for next year is really thinking about inventory control.\n\nInventory control and inventory discipline is just going to be really critical. You know, as Jeff highlighted earlier, we're buying conservatively, and we built in the appropriate reserves going into next year to really be able to respond to any changing trends. And that's because we fundamentally changed the way we buy. We have a very integrated team end to end that's looking at sourcing and allocation and planning, all the way to fulfilling orders for the customer.\n\nThe other thing that I think is important as we think about the spring season is that we're not planning to do any packaway inventory this year. We're planning to get into the next year in a clean inventory position because the packaway is just not a favorable thing for us as a fashion retailer. So, as we mentioned a bit earlier, we're committed to the markdowns necessary to clear any aged inventory this season and make sure that strategically, we're in a better position to drive sell-throughs and drive healthy margins going through the fourth quarter and into next year.\n\nOperator\n\nWe'll take our next question from Bob Drbul from Guggenheim Securities. Your line is open. Please go ahead.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nHi, good morning. Adrian, just a couple of questions on -- if you could talk more about the credit card business, and I think it was better than expected sort of what you're seeing, what came in better than expected, I think bad debt expense. But if you could maybe just address some of the factors there and how you're thinking about it sort of into Q4, but even more probably if you can give us some more color around the expectations into '23, that would be helpful. Thanks.\n\nAdrian Mitchell -- Chief Financial Officer\n\nYes, absolutely. So, as we think about credit card going into Q4, what you'll see as a rate of sale is a seasonal adjustment. So, we do have a lot of nonrural customers that do come into our system in the fourth quarter. So, they tend to use a variety of tenders to be on our proprietary credit card.\n\nSo, as a rate of sale, you'll actually see that soften in the fourth quarter, which is just a seasonal adjustment.As we think about the credit card business in the near term and in the longer term, there are really two factors that we think about. The first factor is around bad debt. What we've seen is that bad debt levels have remained lower than expected for a prolonged period of time that drove very healthy credit card revenues this year and last year, but we do see evidence of that beginning to unwind as we're seeing more kind of payment opportunities and delinquency opportunities emerge. So, we do feel that they will begin to be a more progressive reversion back on bad debt.\n\nThe second lever we look at is just the usage. And what we're seeing is very healthy usage on the co-brand side, as well as higher usage on the broader proprietary credit card within our nameplates and within our network. And so, last year, as you can imagine, there's a lot of stimulus in the market, so there's a lot of cash payments and debit payments. But really, credit card is back.\n\nAnd so, a lot of people are using their credit card, they're building larger balances, and that's really driven the health of our credit card business through the pandemic, year to date, and we project that to be healthy into the fourth quarter, as you see from our guide.\n\nOperator\n\nWe will take our next question from Gaby Carbone from Deutsche Bank. Your line is open. Please go ahead.\n\nGabriella Carbone -- Deutsche Bank -- Analyst\n\nHi, good morning. Congratulations on the nice results. So, you've made a real improvement on your balance sheet over the past year. Just wondering if you can speak to how you're thinking about debt paydown and leverage along with your capital allocation priorities moving ahead.\n\nThank you.\n\nAdrian Mitchell -- Chief Financial Officer\n\nThanks for your question. You know, we follow a very disciplined capital-allocation strategy. And the first and most important thing is to make sure that we have a healthy balance sheet. So, looking at controlling inventories, very key to that, as well as debt, is an important part of that.\n\nWe have committed coming into this year that, on an annual basis, we'll have a leverage ratio below two times on an adjusted basis. And so, we're very committed to that. And we're certainly looking at a variety of things as it relates to debt pay down. The second thing, though, which is really important is investing in the business.\n\nWe believe that the highest return for our shareholders is investing in high-return initiatives that drives profitable growth over the near, medium, and long term. So, really important for us to make sure that we're investing in those initiatives. And then the third piece is really returning capital back to our shareholders in the form of a predictable dividend and modest dividend, but also with excess cash being able to do share repurchases. As it relates to debt pay down, we're constantly looking at a lot of options and a lot of different scenarios.\n\nWe do have the liquidity and the capacity right now. We don't have any material debt maturities for 4.5 to five years, so we're already in a very healthy position, but debt pay down is always an option that we look at.\n\nGabriella Carbone -- Deutsche Bank -- Analyst\n\nOK, thank you.\n\nOperator\n\nWe'll take our final question for today from Paul Lejuez from Citigroup. Your line is open. Please go ahead.\n\nTracy Kogan -- Citi -- Analyst\n\nThank you. Tracy Kogan filling in for Paul. [Audio gap] you're seeing in your Market by Macy's stores, and maybe give us a little bit more detail about the assortments there and what percent of your full assortment is in those stores. And then so you talked about maybe relocating some Macy's stores to these off-mall formats.\n\nHow many markets do you have maybe a weaker performing full-line Macy's store where you think there's an opportunity to relocate off-mall in a Market by Macy's format? Thanks.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nSo, let me start with we're pleased so far with how Market by Macy's is performing. And so, just to reemphasize what our strategy here, it really has three buckets and three purposes. The first one is just right where -- as the overall comment is that about 60% of business in our categories that's done in brick-and-mortar is done off-mall. And so, when looking at the majority of our portfolio being on-mall, that really served up an opportunity for us.\n\nClearly, omnichannel sales is what we're really focused on. And when you look at wherever we have a sale or wherever we have a store, you have higher concentration of digital sales being done in those ZIP codes. So, it really is this kind of irrefutable loop that goes on with customer activity. So, we had three objectives with respect to Market by Macy's.\n\nThe first one was to what is a fill-in location wherein we already have a presence in that particular market, but we have ZIP codes that are underserved, and we're seeing that in our digital signals. That's where we put a number of our locations from Atlanta, Washington, D.C., Dallas Fort Worth. Then we have this replacement location that's part of your question. That was one that we did last week.\n\nReally proud of the -- this is the first one that we've done. This was our Chesterfield Mall that was in St. Louis, and we found a very vital strip center that was a mile away from the Chesterfield Mall. In the Chesterfield Mall, it used to be a thriving center.\n\nMacy's was really all that was left. The balance of the mall was either closed or was no longer there. So, we have this handoff when we opened the Market by Macy's in St. Louis in the Chesterfield Strip Center, then we closed the store.\n\nWe worked on the handoff of customers, we picked all the great colleagues. We moved them over. That's had a very nice start. The third area that we're looking at, which gets to the other part of your question, is how we're thinking about new markets, either where Macy's brand used to be or Bloomingdale's brand has not been or where it's a brand-new market for us.\n\nSo, know that we are in 49 of the Top 50 markets in the nation on the Macy's side. But I think we're only in 13 of the Bloomingdale's side. So, really getting the Bloomie's brand into some of those markets is quite interesting to us. And then starting to do that on the Macy's side is something that you're going to see from us in 2023.\n\nTo the comment about curation, so you think about Market by Macy's is let's call it, 30,000 square feet and we have a full-line store that's like 180,000 thereabouts. So, we're making lots of decisions based on the localized environment about what brands we put in there, what turnover we expect, how quickly we're able to bring things in and get them out. And so -- and it's a very open palate. So, we have lots of flexibility in those environments, lots of opportunities for us to make adjustments.\n\nSo, we're very dogged about sell-throughs and conversion. That's what the team is very focused on. I think the format and the locations we're picking is quite strong. So, we need to make these stores work before we get to a scalable model.\n\nBut as you can imagine, we're looking at that 60% of brick-and-mortar business being done off-mall, lots of opportunities when we get a model this scalable.\n\nOperator\n\nThat is all the time we have for question-and-answer session for today. Now, I will turn the call over back to Gennette for closing remarks. Please go ahead, sir.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nHi, everybody. Thanks for your interest in Macy's, Inc. brands, and watch the parade. Everybody have a great Thanksgiving.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPam Quintiliano -- Head of Investor Relations\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nAdrian Mitchell -- Chief Financial Officer\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\nOmar Saad -- Evercore ISI -- Analyst\n\nOliver Chen -- Cowen and Company -- Analyst\n\nAshley Helgans -- Jefferies -- Analyst\n\nKimberly Greenberger -- Morgan Stanley -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nGabriella Carbone -- Deutsche Bank -- Analyst\n\nTracy Kogan -- Citi -- Analyst\n\nMore M analysis\n\nAll earnings call transcripts"
}