{
  "companyName": "Hecla Mining",
  "companyTicker": "HL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/hecla-mining-hl-q3-2022-earnings-call-transcript/",
  "content": "Hecla Mining (HL -0.71%)\nQ3 2022 Earnings Call\nNov 09, 2022, 10:00 a.m. ET\n\nOperator\n\nHello, and thank you for standing by. My name is Regina, and I will be your conference operator today. At this time, I would like to welcome everyone to the Hecla Mining Company third-quarter 2022 earnings conference call. [Operator instructions] I would now like to turn the conference over to Anvita Patil.\n\nPlease go ahead.\n\nAnvita Patil -- Head of Investor Relations\n\nThank you, operator, and welcome, everyone. Thank you for joining us for Hecla's third-quarter 2022 financial and operations results conference call. I am Anvita Patil, Hecla's vice president of investor relations and treasurer. Our financial results news release that was issued this morning, along with today's presentation, are available on Hecla's website.\n\nOn today's call, we have Phil Baker, Hecla's president and CEO; Lauren Roberts, Hecla's senior vice president and chief operating officer; and Russell Lawlar, Hecla's senior vice president and chief financial officer. Any forward-looking statements made today by the management team come under the Private Securities Litigation Reform Act and involve risks as shown on Slides 2 and 3 and in our earnings release and in our 10-K and 10-Q filings with the SEC. These and other risks could cause results to differ from those projected in the forward-looking statements. Reconciliations of non-GAAP measures cited in this call and related slides are found in the slides or news release.\n\nWith that, I pass the call to Phil.\n\nPhil Baker -- President and Chief Executive Officer\n\nThanks, Anvita. Good morning, everyone. Thank you for joining our call. With this being the first conference call since the September 7th closing the Alexco transaction, I want to start with a few comments on Keno Hill.\n\nYou know, the week after the closing, I, along with Lauren and our Chief Administrative Officer Mike Clary, went to site. We went to Mayo, which is the local town into Whitehorse. This visit was timed around the biweekly shift change, which allowed us to meet I'd say about 140 of the 170 employees, and the enthusiasm of the workforce was palpable. The crews are excited to have resources and plans that allow them to be successful.\n\nAnd so, we're going to have our challenges, but I think we are starting at a very good place. We also met with the Yukon federal and community leaders. And there's a recognition that Keno Hill is a high-profile project for the Yukon. And that's important for the -- and this project is important for the success of mining development in the Yukon.\n\nSo, I'm confident that we're going to receive all the support that these folks can give. And Lauren is going to go into our performance and plans for the rest of the year operationally. Now, the third quarter marked another strong operational performance from all of our mines where we actually achieved new records at each of them. At Greens Creek, we've been working to increase throughput, and we've begun to see the results where we produced a quarterly record of about 2,500 tonnes per day of throughput.\n\nAt the Lucky Friday, we produced in excess of 1 million ounces for the second consecutive quarter, all while executing a very significant capital plan, which is going to allow us to further increase throughput and reliability. Casa Berardi also continued to achieve new monthly throughput records one of the months during the quarter. With Keno Hill expected to be in production next year, Lucky Friday's growth and Greens Creek's consistent performance, we now expect to produce in the range of 17 million to 20 million ounces of silver by 2024. And this production will not only be the largest producer of silver in the United States but will also be the largest in Canada.\n\nSo, despite Hecla being a 130-year-old company, we believe we are the fastest growing established silver producer. While we are investing in our business with large capital programs at each of the mines and at Keno Hill, we ended the quarter with a very strong balance sheet, which we're committed to maintain. Russell will talk more about that. Strong operational performance in the year has allowed us to increase our silver production guidance while maintaining our operating and capital cost guidance despite adding Keno Hill.\n\nSo, Lauren, why don't you give some insights into our operations. \n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nThank you, Phil. I'll start on Slide 6. Greens Creek produced 2.5 million ounces of silver in the third quarter, 2.5% higher than last quarter. The mine produced approximately 2,400 tonnes per day, and the mill achieved a new all-time throughput record of 2,500 tonnes per day.\n\nLower lead grades resulted in the deferral of a silver concentrate shipment to the fourth quarter. The impact of the deferral is lower revenue and cash flow in the third quarter, as well as lower cost of sales because the costs related to the shipment were recorded in inventory. In the fourth quarter, there will be a higher cost of sales with offsetting revenues and cash flows of approximately 18 million as the inventory charges are reversed. Cash costs and all-in sustaining costs for the third quarter increased to $2.65 per ounce and $8.61 per ounce, respectively, driven by lower by-product production, lower by-product prices, a tight labor market that require the use of some contractors, primarily in maintenance.\n\nGreens Creek is positioned for another strong year and generated 86 million in free cash flow for the first nine months of the year. Despite the deferral of the silver concentrate shipment to the fourth quarter, the mine was free cash flow positive in the third quarter. For the fourth quarter, we expect similar operational performance with a slight decline in production due to approximately 8% lower silver grades related to the mining sequence. We are affirming our cost guidance for the mine and expect the mine to meet the increased production guidance of 9.3 million to 9.6 million ounces of silver for a solid finish to 2022.\n\nMoving to Slide 7, Lucky Friday's silver production exceeded 1 million ounces in the last two consecutive quarters. For the first nine months of the year, the mine produced 3.2 million ounces of silver, which already is 90% of last year's production. Cash costs for the quarter were $5.23 per ounce, higher than the second quarter of 2022 due to lower by-product credits, driven by lower lead and zinc prices. All-in sustaining costs for the quarter were $15.98 per ounce due to planned higher sustaining capital spend.\n\nSignificant sustaining capital projects in the quarter included work to raise the tailings facility and infill drilling to support the accelerated UCB production pace as we target more than 5 million ounces a year of production. Also in the third quarter, due to a multi-week shutdown at the Trail smelter, a 2,000 dry metric ton silver concentrate shipment containing approximately 216,000 ounces of silver and 2.9 million pounds of lead was deferred to the fourth quarter. The deferral had an impact of 6 million on the mine's revenues. The mine had negative free cash flow of 4.5 million for the quarter, primarily due to the deferral.\n\nYear to date, the mine has been free cash flow positive, generating $8 million net of our investments to grow production. We are affirming production and cost guidance for the mine, but our lowering capital guidance to 56 million to 58 million due to the timing of some capital expenditures. The quarter continues to highlight the UCB mining method success in managing seismicity and improving productivity at the mine. With grades getting better at depth and increased throughput, the mine is set to produce more than 5 million ounces per year in the near future, and we believe this mine's best decade is ahead of it.\n\nTurning to Slide 8, Casa Berardi produced just over 33,000 ounces, in line with the second quarter. All-in sustaining costs increased to $1,738 per gold ounce due to higher sustaining capital expenditures associated with a design change in the expansion of the tailings storage facility and increased exploration spending. Casa Berardi's costs remain more exposed to inflation than our other mines due to the absence of any significant by-products and the relatively larger volumes of material mined and processed. Casa Berardi remains an important part of our operating portfolio with a large, underexplored land package.\n\nThe operation provides us gold production and scale, and our exploration is focused on adding higher grade underground material. Recent drilling results are showing good continuity of high-grade zones along the 113 and 118 sector. Casa Berardi generated positive free cash flow for the quarter, as well as for the first nine months of the year. We are affirming our production and cost guidance and are lowering our capital guidance slightly to 42 million to 45 million as some capital products will be completed in 2023.\n\nWe completed the acquisition of Alexco in early September. From day one, our focus has been on development and the advance rate has increased by 40% since acquisition. At the end of October, we completed about 30% of the total development required prior to starting the mill. We expect the advance rate to continue to improve as we have bad mining practices or receive more equipment.\n\nBy the end of 2022, we expect to have completed about 40% to 50% of the development required to start the mill. We are incurring around $4 million a month of cost. So, in the fourth quarter, we expect the capital spend at Keno Hill to be in the range of 10 million to 12 million. We anticipate achieving full production run rates in 2023, with a mill start in the second half of the year, yielding about 2.5 million ounces of silver.\n\nWe'll give a more detailed production and cost guidance for 2023 later this year and early next. Slide 9 highlights some of the work we have planned at the Bermingham deposit where the focus will be on the Bear zone. The wide highlight of development is what we plan to complete this year and the red arrow shows about where we expect to be when we begin stoping. Moving to Slide 10, this image shows our work plans in the upper lighting zone of the Flame and Moth deposit.\n\nAs on the previous slide, the right highlighted development shows the plan we expect to complete this year, and the red arrow show where we expect to be when we start stoping. With two deposits and multiple production horizons in each, we'll have a high level of flexibility to meet production demands. This has been a major issue for Keno Hill in the past that we intend to solve. While our immediate focus is on these two deposits, let me end with a comment on exploration that gives us confidence in the potential of the district.\n\nDrilling on the underexplored Coral Wigwam target, which is about 1.3 kilometers from Bermingham, yield a 101-ounce drill hole intercept over 7.3 true feet. These are early days in the exploration program, but nonetheless, very encouraging and quite exciting. With this, I'll pass the call to Russell.\n\nRussell Lawlar -- Senior Vice President and Chief Financial Officer\n\nThank you, Lauren. Turning to Slide 12, third-quarter revenues were $146 million, 30% from silver, 42% from gold, with zinc and lead at 28%. Our revenues decreased approximately $45 million from the prior quarter, primarily due to the deferral of Greens Creek's and Lucky Friday's silver shipments to the fourth quarter, as Lauren has described. These deferred shipments had an impact of approximately $24 million on revenues, and we also saw lower prices across all four metals.\n\nAs we indicated on last quarter's call, we are investing our cash in our operations for future production and cash flow growth. Due to the revenue reduction capital spend of more than $37 million for the quarter, transaction costs incurred from the Alexco acquisition, refinancing of our revolving credit facility and working capital changes related to the deferral of revenues, as well as interest payments of $18 million in the third quarter, our free cash flow for the quarter was negative $62 million. Even with relatively lower silver prices and a reduction in both the by-product prices and production, we continue to see solid cash flow and margins from our silver assets, where we had a consolidated all-in sustaining cost of just over $10 per ounce year to date with a margin of more than $11 per silver ounce. Free cash flow generation from our three operations for the first nine months of the year was approximately $98 million.\n\nAs we look to the remainder of the year, we anticipate maintaining a cash balance in excess of $100 million, while keeping to our prudent financial policy of maintaining a net leverage ratio of less than 2-to-1. Turning to Slide 13, we've seen inflationary environment of earlier this year continue into the third quarter, where prices of key inputs continue to remain elevated around 15% higher than at the beginning of the year. We are continuing to experience a tight labor market, especially as we recruit for experienced miners and skilled trades, such as mechanics and electricians. At our silver operations, we have seen our by-product credits, which provide some offset against inflationary pressures decline, primarily due to the decline of by-product prices.\n\nWe are focused on managing our cost structure and reaffirming our cost guidance even after we've seen prices of by-products come down. We remain confident that we can execute our mining and development plans at our operations even in this current tight labor and inflationary environment. And with that, I'll pass the call back to Phil for his closing remarks.\n\nPhil Baker -- President and Chief Executive Officer\n\nThanks, Russell. And so, we'll go to Slide 14, which just gives us a view of our guidance for production and for costs. And what you'll see is our production guidance we announced earlier in the month or late last month that we were increasing our production guidance at Greens Creek because of its strong operating performance year to date. And as Russell has described, we have this inflationary pressure, but we're able to affirm our cost guidance and our -- and we're also maintaining our capital guidance because we're lowering capital expenditures of Lucky Friday and Casa to offset the development expenditures that we have at Keno, the $10 million to $12 million that we mentioned.\n\nThe other thing I just want to mention while I'm on guidance is really a call out to our employees for our safety performance. Our all injury frequency rate for the first nine months of the year was 1.32, and that's 37% lower than the U.S. average, and it's an improvement of 19% over the same period from 2021. So, thanks to all the Hecla employees for this achievement.\n\nSo, I want to end with a number that caught our attention, and this is on Slide 15. India imported 200 million ounces of silver in the first eight months of 2022. And the silver bullion market is about a billion ounce market. And so, that's 20% of global demand for silver that they imported over the first eight months.\n\nIndia's increased silver imports are a key factor that caused the silver and the London vaults to be at the lowest level since 2016. Silver buying in India was muted during COVID. So, this is more than double last year's imports three times the 2020 levels and about the same as 2019. So, the message is India -- Indians are back buying silver for jewelry and silverware because that's about three-quarters of the silver purchases for that purpose.\n\nAnd where it's really coming from the millennials and the Gen Z population in India are more keen on silver jewelry than gold jewelry due to changing fashions or the desire for the ability to change their jewelry frequently and the ability to have lightweight jewelry that complements a more professional look. And Anvita is Indian, and she said to me that her younger cousins who were in India have expressed a preference for silver jewelry for daily workwear. So, typically, when you hear us talking about silver, you hear us talking about the use of silver for energy transition, and we still think that's the future for silver. But we do view the -- this increased demand in India is providing a great base to the silver price.\n\nFinally, I want to emphasize our commitment to silver. While we believe in gold and see a need to have gold operations, and we'll probably even grow our gold operations, we have been a silver company for 130 years. And we think the future could not be brighter for the metal, and we see more upside relative to gold. So, we're working hard to increase our exposure to silver.\n\nAnd since I've been at Hecla, we've gone from 6 million to 7 million ounces of production to 10 to 12, and now we're heading to 17 to 20, and all of that production is in the U.S. and Canada. And we expect in the next year or so for our silver revenue to exceed gold and probably go over 50% of our total revenues even at the current gold silver ratio, which we expect to improve. This will put us in a unique position, especially since other silver companies have seen a decline in their silver exposure.\n\nSo, with that, Regina, I'd like to open the call for questions.\n\nOperator\n\n[Operator instructions] Our first question will come from the line of Michael Siperco with RBC Capital Markets. Please go ahead.\n\nMichael Siperco -- RBC Capital Markets -- Analyst\n\nThanks very much, operator. Thanks for taking my call. So, I know we'll get more on Keno Hill as time goes on, and thanks for the update today. Can -- can you go into any more maybe surprises that you've had since taking over, good or bad, anything that we should be watching for in terms of the update or the start-up, anything along those lines?\n\nPhil Baker -- President and Chief Executive Officer\n\nI guess I'll let Lauren give his views. But the first thing I would say, Michael, is that if you think about the due diligence process we went through, we had 63 days of people on site, you know, before this transaction was ever announced. And so, I think we knew everything that you could know at that time. So, from my perspective, not a huge number of surprises.\n\nLauren, anything that really sticks out to you?\n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nI guess the one thing that sticks out to me, and it's positive, is the reception that we received, how welcoming the entirety of the workforce right down to the miners have been to us. And I think it just gives us a great platform to start from. The best -- we knew we would be well received there, but it's I don't think any of us recognize how well received we would be.\n\nPhil Baker -- President and Chief Executive Officer\n\nAnd the food was pretty good at the camp.\n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nYeah. You would definitely need to go on some kind of exercise program if you were there for very long.\n\nMichael Siperco -- RBC Capital Markets -- Analyst\n\nThat's good to hear, I guess. OK. I guess maybe a couple more for me, and I'll hand it over. Maybe a similar question on capex at Lucky Friday.\n\nA number of big projects you've highlighted as being on the go there. With the lower capex now in 2022, should we be expecting more or less a deferral of that capex into '23? I know you're going through the budgeting process, but should we be thinking about a similar type of number in '23 as we saw in '22? Or has any thinking changed along those lines?\n\nPhil Baker -- President and Chief Executive Officer\n\nIt's just a deferral into '23. And, you know, relative to where we were going to be for '23, which, of course, is not disclosed, we will be slightly higher with this deferral. But part of it is we're deferring it for operational reasons. Some work was slower to get done and rather than trying to push through that work -- and this is on the bunker.\n\nRather than trying to push through that work in the winter, we're going to wait until the spring to complete it. Lauren, anything to add?\n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nNo, that's exactly correct. We did the analysis of the potential benefit of working through winter versus the cost and determined it wasn't worth the risk of working through winter on that particular project. So, we're buttoning up, putting it to bed. And by roughly the end of November, we'll come back to it early in April.\n\nSo, it was a project that we could defer some spending on and made the decision to do so. The real game changing capital project at Lucky Friday is a service hoist, and it is on schedule and going great. I was out Lucky Friday this week and got to tour. The building is up.\n\nThe hoist is in place. It's being wired, and we're pairing the shaft to receive the guides for the service hoist. So, that project is going really well. \n\nPhil Baker -- President and Chief Executive Officer\n\nThe other thing, Michael, is there is equipment that's slow to come, and that's part of the deferral from '22 to '23. So, we will make those expenditures -- and that's not just at the Lucky Friday. That's across the company.\n\nMichael Siperco -- RBC Capital Markets -- Analyst\n\nGot it. Thanks. OK. Maybe switching gears quickly to the by-product credits and the zinc and lead production.\n\nHave you considered breaking out lead and zinc guidance more than you do for some more predictability? I know it's the nature of the beast to an extent. Is it just too hard to really predict on a quarter-by-quarter basis, what those credits will be from Greens Creek and Lucky? \n\nPhil Baker -- President and Chief Executive Officer\n\nYou're the first person to ask for that in 20 years. So, we'll consider. \n\nMichael Siperco -- RBC Capital Markets -- Analyst\n\nOK. OK. I'll take that under advisement. Maybe just one other silver question.\n\nYou brought up demand in the physical market. I suppose we're still seeing a spread between that physical more retail-focused silver price and the spot price, maybe narrower now that we've bounced up off the $18 level over the last few weeks, months. So, I suppose two questions. Are you seeing the same thing? And assuming that you do, do you see any opportunity to exploit that spread? Or do you just see it as maybe a positive sign for future silver prices?\n\nPhil Baker -- President and Chief Executive Officer\n\nWell, it's really sort of the wholesale to retail purchase of silver. If you look at 1,000-ounce bars, there's not that big of a spread. The spread really is at the retail level of the one-ounce coins and medallions and the like and the 100-ounce bars. So, you know, we produce -- the final product we produce at our silver mines is a concentrate.\n\nSo, we don't have, you know, physical metal to try to do something ahead of retail level. So, we're not continuing to try to do that at least at this point.\n\nMichael Siperco -- RBC Capital Markets -- Analyst\n\nNot so much on the. Sorry go ahead. \n\nPhil Baker -- President and Chief Executive Officer\n\nYou could conceivably -- you could conceivably toll the material. We haven't really ever seriously considered that.\n\nMichael Siperco -- RBC Capital Markets -- Analyst\n\nAll right. I mean, more as a view on the market. I mean, do you see that as not to suggest that you start producing coins around. But do you see that retail spread as being indicative of anything that you would see in the broader market -- in the broader silver market?\n\nPhil Baker -- President and Chief Executive Officer\n\nWell, I think it's not dissimilar to what we've seen in India with an increase in demand. You know, you just -- it provides that fundamental underlying demand that supports the price makes it going down in a significant way really hard for it to do and get you more risk to the upside. \n\nMichael Siperco -- RBC Capital Markets -- Analyst\n\nGreat. Very good. Thanks for -- thanks for my questions. I'll pass it on. \n\nOperator\n\nYour next question will come from the line of Lucas Pipes with B. Riley Securities. Please go ahead. \n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nThank you very much, operator. Good morning, everyone. My first question, Phil, is on the cost side. So, great to see that cost guidance is flat this year.\n\nAnd I wondered if you could expand on that a little bit. Are we seeing -- are we seeing inflationary pressure subsiding? Or is this really more a testament of -- to your cost management? Thank you. Thank you for your perspective on that.\n\nPhil Baker -- President and Chief Executive Officer\n\nIt's certainly not subsiding yet. I don't think it's increasing, but we're continuing to have this inflationary pressure. I mean, you know, I'll just use diesel as an example. You know, the price of diesel is significantly higher than it was.\n\nAnd we're just very focused on managing our costs. And the best way of doing that to an extent, on a per ounce basis is increasing throughput. So, I'll let Lauren and Russell add any comments. \n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nI think the denominator is key. So, we've been driving to generate more metal and more revenue. You know, we had some visibility that there was going to be an inflationary period and did some budgeting accordingly. I think it exceeded our expectations in many cases, but we did protect ourselves a bit during budgeting.\n\nRussell Lawlar -- Senior Vice President and Chief Financial Officer\n\nYeah. I think just -- I think, Phil, you got it. It's certainly not subsiding. But I think as we've moved through the year and you take into account the budgeting changes that Lauren has mentioned, I think that the cost guidance, what you've seen is that we've been able to take in the inflation into account, essentially, but it's still high compared to what we've seen in the past. \n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nCan you -- very helpful. Thank you. And as a quick follow-up on this point, are you seeing areas where costs are coming down or -- and conversely, what are the key pressures today that are still running through the system? Thanks.\n\nPhil Baker -- President and Chief Executive Officer\n\nWell, yeah. Certainly, we are seeing some cost reductions on some of the materials, but it's not dramatic. It is at the margin and not particularly meaningful. The more important thing is that they're not going up at the rate that they were.\n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nI agree. And they tend to be the -- you know, the coming off of an inflationary period, the costs tend to be fairly sticky, and they lag the change in the broader market by at least a quarter. \n\nPhil Baker -- President and Chief Executive Officer\n\nAnd the other thing to remember is where are our costs, and our labor is almost 40% of our cost. And we've had -- during the course of the year, we've had increases we think we are at or above market. And so, that gives us a little bit of room to wait for the market to catch up to where we're kind of our labor expenditures. But these other items, while the costs might be -- and I look at consumables at 18% -- might be significant in the high grade 18%, each individual cost is actually quite small as a percentage of our total.\n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nVery helpful. Thank you. And then my second theme I wanted to touch on is the reshuffling within your capex guidance. Not huge numbers, but what are some of the things you're saving at Lucky Friday and Casa Berardi? And I'm sure you had thoughts about why you had it in the budget in the first place.\n\nSo, I would appreciate what the trade-offs are? Thank you very much.\n\nPhil Baker -- President and Chief Executive Officer\n\nSo, Lucas, it's really just a deferral. And it's -- and as I said a moment ago, some of it is just operational benefit. In some cases, the suppliers have not been able to deliver the equipment. And then, frankly, almost every year, our guys are very excited and ambitious, and they will project projects that they just don't have the time to actually get to.\n\nLauren. \n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nSo, we see it every year. We tend to forecast our capital expenditures higher than they materialize, but we generally come pretty close to budget, which will be the case this year.\n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nGot it. Is it reasonable to assume there's a catch-up then next year if this is deferral? Or would you say it's kind of this happens on an ongoing basis, so it wouldn't be a kind of catch-up?\n\nPhil Baker -- President and Chief Executive Officer\n\nWe would hope catch -- Lucas, we'll hope that we'll catch up in '23 with the expenditures that we defer into that primary equipment and a couple of major ones.\n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nIts largely growth, right? So, as seeing the projects are executed the way we expect it to be, we should catch up. \n\nPhil Baker -- President and Chief Executive Officer\n\nYeah. Just like you said, those are projects we want to do. These are projects that we want to do. So...\n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nOK. So, should we assume higher capex for 2023 directionally? \n\nPhil Baker -- President and Chief Executive Officer\n\nWe haven't given guidance on '23. We're still in the budgeting process. So, let me hold off doing that until we're ready.\n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nFair enough. Really appreciate the update, and continued best of luck. \n\nPhil Baker -- President and Chief Executive Officer\n\nThank you.\n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nThank you.\n\nOperator\n\nYour next question will come from the line of Heiko Ihle with H.C. Wainwright. Please go ahead.\n\nMarcus Giannini\n\nThis is Marcus Giannini calling in for Heiko. Thanks for taking my questions. So, you've seen about 3.6 million at Keno in the quarter, and you're expecting 10 million to 12 million of spend in Q4, which gets us from 30% to 50% of development complete. How long do you think we can trend line that figure of 20% costing about 10 million to 12 million? And then, I guess, while you're at it, how much are inflationary impacts hitting you in that area specifically? \n\nPhil Baker -- President and Chief Executive Officer\n\nWell, you know, it's hard to say specifically that we certainly feel the same inflationary pressures we do elsewhere. The real concern is diesel -- is the fact that diesel costs have gone up. As far as the assumption, look, I think if you're assuming that we'll spend sort of at that same level during the course of next year and, you know, some time, we'll turn on the middle probably in the third quarter. You know, maybe, we'll be able to advance to the second depending on how well the development goes.\n\nAnd -- but, certainly, we will be in full and consistent production by the end of the year. That is our objective. Everything else that we can do that gets us ahead of that is upside for us. And at the end of the year, early next year, we will give guidance -- specific guidance on Keno, as well as on the other properties.\n\nThings to add? \n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nYeah. We expect the development rate to increase over time. This is -- it's just learning curve, it's learning the ground and also getting some of the equipment that we have onward will help accelerate the development rate. So, I would expect the capital expenditure for development to escalate with the development rate in proportion to the development rate.\n\nAnd then I guess the other thing is we have some capital construction to do, which is a seasonal thing. So, as we hit April, May time frame, you'll see some of that spending increase. \n\nRussell Lawlar -- Senior Vice President and Chief Financial Officer\n\nAnd I think, in general, you should look at Keno Hill. You'll probably see a bit of a ramp-up in cost kind of similar to what Lauren has mentioned. But the lion's share of it is generally a fixed cost that the cost that we've said kind of that monthly spend is about what they incur or we incur up there. As it relates to inflationary pressures, keep in mind, we're looking at this from the lens that we just closed the acquisition in September.\n\nSo, as inflation high, yes, but the changes took place really earlier in the year. So, I think it's kind of from a baseline perspective, we have that already in our thought process.\n\nMarcus Giannini\n\nOK. Gotcha. That's really helpful. And then, for my next question, it's already been touched on quite a bit with Lucky Friday and Casa and capex being deferred to 2023.\n\nSo, I guess, I'll ask about equipment availability, what types of items are you guys having difficulty sort of procuring on that front? \n\nPhil Baker -- President and Chief Executive Officer\n\nMechanics.\n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nYeah. The biggest challenge is still in the mechanical trades ranks. In terms of equipment, it's sort of a mixed bag. And you can't even really point to one manufacturer being slower than another.\n\nAnd even within a single manufacturer, the delays may be incurred at a particular facility, which means it might be one class of machine, whereas we don't have trouble getting another class of machine. So, it's really an odd mixed bag. It's difficult to say that it's -- that there's a trend other than the industry is strong and there's demand for equipment.\n\nMarcus Giannini\n\nOK, fair enough. Yeah, that's it for me. I'll hop back in queue. Thanks, guys. \n\nOperator\n\nYour next question will come from the line of Joseph Reagor with ROTH Capital Partners. Please go ahead.\n\nJoseph Reagor -- ROTH Capital Partners -- Analyst\n\nHey, Phil and team. Thanks for taking the questions. A lot of stuff I want to touch on was already hit on, but just kind of want to follow up a little bit on Keno Hill and make sure I fully understand it. Once you guys start the mill up, we should expect the development capital to trail off, correct?\n\nPhil Baker -- President and Chief Executive Officer\n\nWhat will happen is there'll be a split in the development capital between continuing to advance the primary development that ramping system that you saw on that slide with the green and maybe, call it, maybe half of the expenditures will be related to that sort of development and the other half will be related to that stope access development.\n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nAnd stoping. \n\nPhil Baker -- President and Chief Executive Officer\n\nAnd stoping. So...\n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nRecall that these are mines with more than 10 years of life. So, there's a lot of development remaining to be done there. \n\nJoseph Reagor -- ROTH Capital Partners -- Analyst\n\nYeah, fair enough. OK. And then looking at Casa, you know, this quarter, costs -- or total cost exceeded revenue. I know that there's some accounting stuff behind that.\n\nBut any concerns about the inflation there and kind of a weak gold environment and putting you guys in a position at some point that, you know, if gold doesn't recover from this level that you guys have to reconsider whether or not to continue operating the mine? \n\nPhil Baker -- President and Chief Executive Officer\n\nWell, I think that's probably too strong to say continuing the mine. It really is a question of how much capital investment you can make because we do have the objective of, you know, trying to have all of our mines be cash flow positive. We've really had that as a mantra for some time while we are willing to have periods of time for them to need capital infused. These are operating lines that should be able to be cash flow positive and generate returns for the overall corporation.\n\nSo, are we looking at ways of improving the performance at Casa? Yeah, absolutely, all the time. So, Lauren, anything to add to that?\n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nWe're always looking to optimize plans. And based on the cost structure, inflation, metal price, we're always optimizing both the underground and the open pit plans. And the open pit plans are really the bigger lever, I would say, because of the volumes of material. From a cost perspective, that's the bigger lever.\n\nThe lever on the revenue side is the underground mine. So, we're always balancing those things.\n\nPhil Baker -- President and Chief Executive Officer\n\nYou know, and, fundamentally, we think we have this 37-kilometer strike on the Casa Berardi Break that is very, very prospective. It is very underexplored, and that's where the grading comes from. That's -- so, you're going to see us continuing to explore, continuing to look for that higher grade material. The drilling that we're doing in the 113 is interesting.\n\nThere's some high grade that we've seen. But -- and if you'll recall, going back a decade, that was -- the 113 was the real high-grade material that drove the value of the month. So, if we can find some more of that material, it's a whole different proposition at Casa Berardi.\n\nJoseph Reagor -- ROTH Capital Partners -- Analyst\n\nOK, fair enough. And then, just on inflation, I guess, maybe you guys can attempt to quantify what part of the inflation you've seen you feel will be sticky versus what part do you think might, you know, have some kind of pullback as the world normalizes again at some point in the future? Is it 50-50, 60-40? How do you feel about that? \n\nPhil Baker -- President and Chief Executive Officer\n\nLook, labor will be sticky. Contractors will vary. Diesel will vary, and the others will be slow to move, but they will bear the steel, the -- that sort of items, the consumables.\n\nJoseph Reagor -- ROTH Capital Partners -- Analyst\n\nOK. And so, with [Inaudible]\n\nPhil Baker -- President and Chief Executive Officer\n\nOnce labor goes up, it's hard to have it come down. \n\nJoseph Reagor -- ROTH Capital Partners -- Analyst\n\nYeah. OK. All right. Fair enough.\n\nI'll turn it over. Thanks for the questions.\n\nOperator\n\nYour next question will come from the line of John Tumazos with John Tumazos Very Independent Research. Please go ahead.\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nThank you. I want to congratulate you on your 10%, 15% rate of cost growth. I keep a log of three dozen companies where the seven quarter cumulative cost increase is 41% or 6% per quarter. And Nevada Gold Mines, open pit mining cost per tonne row is 50%, cumulatively over seven quarters or 7% per quarter.\n\nSo, Phil, I want you to tell us how you're going to keep doing so well, particularly is 1 million ounce a level where Lucky Friday tops out, and does 2,500 tons a day a level where Greens Creek tops out. Or can those productivity gains continue and help you keep costs under control? \n\nPhil Baker -- President and Chief Executive Officer\n\nSo, at Greens Creek, we're -- our objective is try to get to 2,600 tonnes. And to put that into perspective, we were around 2,100 tonnes a day when we started operating the mine. So, that's a big increase, and it's mostly cut and fill mining. And, you know, my hat is off to the performance that those guys had because we've been at 2,500 tonnes a day for this year.\n\nAnd so, you'll see us try to continue to increase the throughput. At the Lucky Friday, we've gone to this new mining method. We -- it's much more productive, much safer. And I think that the ability to increase the throughput there, we've already demonstrated, we've gone from 800 tonnes a day to 1,100.\n\nWe're on a path to 1,200. And Lauren won't like this, but, you know, I think there's more beyond that. \n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nThere's always more. It's just what the curve looks like. \n\nPhil Baker -- President and Chief Executive Officer\n\nSo, that's really the -- trying to increase productivity. So, i.e. not add additional people to the extent you can avoid that but improve the productivity per person. There's some technologies that we're certainly looking at that we think will be constructive.\n\nBut I will tell you that we are on the cutting edge of technology when we look at some of the stuff we're trying to do at Greens Creek, for example, with automated haul trucks. You know, our vendors say we are there at the forefront of what anyone is able to do. Lauren, why don't you add to my comments?\n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nYeah. I think the key really for us is to get the very most we can get out of the capital we've already invested. And, in some cases, we make additional investments where we see incremental opportunity. But it's very much a denominator game.\n\nAnd so being efficient and moving more tonnes and more metal with the same or slightly increased resources. And it's a winning combination for us. \n\nPhil Baker -- President and Chief Executive Officer\n\nAnd just a comment on -- you mentioned the Nevada Gold Mines. And the thing to remember is we have small underground mines, which is a huge advantage in this inflationary environment because we just don't have the amount of cost per tonne, I mean, in aggregate, not per tonne but in aggregate. And so, a move in the diesel price for them is much more meaningful than it is for us. \n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nPhil, could you run through what the natural bottlenecks or limiting factors are at Greens Creek, Lucky Friday, and Casa Berardi? Tailings, mill capacity, shaft hoisting underground mining, which are the limiting factors in each site? \n\nPhil Baker -- President and Chief Executive Officer\n\nSure. So, why don't we, together start at the Lucky Friday. So, the Lucky Friday, you know, fortunately has had a large amount of capital, and it's true for all the mines, a large amount of capital that's been put into the mine. And so, we are clearly able to get to 1,200 tonnes a day without reaching any bottlenecks.\n\nNow, that's true because of the service hoist that we're putting in. Otherwise, the hoist to have would have been the bottleneck to get to that 1,200 tonnes a day. When we get to 1,200 tonnes a day, it starts to come in the mill. At Lucky Friday, we continually have to expand tailings facilities at the Lucky Friday, and we're fortunate in that we now have a land package that allows us to have tailings for as far out as we can really see.\n\nAnd so, I think we're in pretty good shape at the Lucky Friday. To get beyond 1,200 tonnes a day is really about -- depends about the mill. \n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nAnd we'll chase bottlenecks around there, but most of them can be resolved with modest investment. The [Inaudible] problem would be if we put another zone in production and meaningfully needed to change what was happening in the mill. But even so, it would be just expanding the grinding circuit. So, not a huge investment. \n\nPhil Baker -- President and Chief Executive Officer\n\nSo, at Greens Creek, I mean, the real issue we thought was the mill, but we keep increasing the throughput of the mill and with very small adjustments. And so, as I said, we've gone from the 2,100 to 2,500. And we think we'll be able to get to 2,600 without any meaningful investments. We're now in a position where the mine itself is the bottleneck.\n\nAnd part of the issue with the mine is the length of the haulage that we have. If you go to the 200 South, that is about a 40-minute haul from the bottom of the mine, maybe even 50 minutes. And that's a lot of time, you know, and a lot of people that have to be engaged in that activity. And so, that's one of the reasons why we're trying to figure out if there's an automated solution or a quasi-automated solution to try to improve the haulage.\n\nYou know, the backfill is -- in delivering of the backfill throughout the mine is a bottleneck. But I don't think there's going to be much issue as far as getting to the 2,600 tonnes a day. Want anything to add? \n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nNo, I agree.\n\nPhil Baker -- President and Chief Executive Officer\n\nAnd then, of course, tailings at Greens Creek, and we're in the process of permitting the next tailings even though we just completed the permitting on the last tailings, what, two years ago, I guess. So, we see it as about a 10-year process to permit and construct tailings, I guess, eight years. And so, we're well on track for that. At Casa, we've been able to increase the throughput of the mill.\n\nWe doubled it. We were at 2,000 tonnes, roughly, we're at 4,000 tonnes. So, growing on that mill production is not really the -- what we're focused on. It's really about improving the grade of the material that comes into the mill.\n\nWe've looked at ore sorting there. We've looked at -- but fundamentally comes finding more higher-grade underground material.\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nThank you for the rundown.\n\nPhil Baker -- President and Chief Executive Officer\n\nSure thing, John.\n\nOperator\n\nOur next question is from the line of Lucas Pipes of B. Riley Securities.\n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nThank you very much for taking my follow-up. I want to ask another question on Casa. With the diesel price increases this year, can you speak a little bit to the trade-off of surface versus mill utilization there? And any light you could shed on underground versus surface costs and how that might help -- how mix might help to optimize cost at the site going forward? Thank you for your perspective on that.\n\nPhil Baker -- President and Chief Executive Officer\n\nSo, Lucas, you broke up a little bit, but I think what you're asking is sort of the relationship between the underground production and the surface production. And generally speaking, we'd like for it to be about 50-50, but it all depends on what the grade is of the underground. You know, that's what we try to get to. It's difficult because of the amount of development that you need to do for these relatively small stopes.\n\nRemember those numbers, but it's pretty challenging development rate to be able to access the stopes. \n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nYes, that's correct. It's -- I think the way to think about the underground is right now, we need to turn around 140 to 150 stopes a year underground to sustain the target production rate to the mill. Our operating philosophy there has been to maximize the throughput and reliability of the mill, which we have achieved, and then feed the mill, the best possible grade. So, underground preferentially backed up by open pit, but always keep the mill full.\n\nSo, that's been the operating philosophy. \n\nPhil Baker -- President and Chief Executive Officer\n\nAnd when you think about this mine over the long term, the -- where this mine will generate a huge amount of cash flow is when you stop development and you stop, you know, laying back the open pits. And all you're doing is mining the ore, then this thing becomes a huge cash flow generator. But we're trying not to get to that point. We're trying to continue to extend the mine life, generate free cash flow in the meantime, generate returns to us in the meantime. \n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nVery helpful color. Again, best of luck, and thanks for taking my questions.\n\nPhil Baker -- President and Chief Executive Officer\n\nSure thing.\n\nOperator\n\nOur next question will come from the line of [Inaudible] with [Inaudible] Please go ahead.\n\nUnknown speaker\n\nHello. Thank you for taking my call. Good morning. My question was what are some of the current and looming potential for -- current and looming challenges for Hecla Mining as you move forward?\n\nPhil Baker -- President and Chief Executive Officer\n\nWell, look, the issue that we have as to most companies, both mining and otherwise, is people. We are on a continual recruiting effort. We have much more focus on them that we've ever had in our history. And so, it's really about getting the people that you need.\n\nIf you think about mining engineers that are coming out of school, it's a, you know, super small number compared to what it was 10 years ago, 20 years ago, 30 years ago. So, maybe you have to repurpose other engineers from other disciplines. But it's -- that is the big challenge for us and to the industry.\n\nUnknown speaker\n\nYeah, that makes sense. Thank you so much. Thank you.\n\nPhil Baker -- President and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nOur next question comes from the line of [Inaudible] with [Indiscernible] \n\nUnknown speaker\n\nYou guided for 42 million to 45 million in capital expenditures for Greens Creek. But, yes, so far [Inaudible] 25 million despite the fact they -- understand in the winter months. Is this due to timing of the payments? Or are you -- as for Casa and Greens Creek and Lucky Friday deferring some expenditures to 2023? \n\nPhil Baker -- President and Chief Executive Officer\n\nYes. No, the back weighting of the capital at Greens Creek relates largely to equipment that we've had to -- we've seen delayed that we've ordered. That would be sort of the largest item. Anything -- anything else? \n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nNo. We've wrapped up our capital construction for the year. It's done, completed as expected. So, really, it's the equipment.\n\nUnknown speaker\n\nOK. Thank you. And congrats on the encouraging drill results at Keno Hill. I wonder at what time -- at what point in the future are you looking to put out a resource update? \n\nPhil Baker -- President and Chief Executive Officer\n\nYeah. So, we're evaluating, you know, our resources at all of our properties. We do that every year, and so, you'll see something with the -- in early 2023. Having said that, we do not have the opportunity to do the infill drilling at Keno that is going to be required for a significant update in the resource to reserves or conversion of resource to reserve.\n\nSo, it might be really until the end of '23 before you see a significant move in those resources and our reserves. And remember, we have in front of us, you know, 37 million ounces of reserves that Alexco had. That's at least an eight-year mine life. And we're pretty confident that, that Bermingham deep material will eventually convert, which would take this out to a plus 10-year mine life if it does.\n\nUnknown speaker\n\nThank you. One last follow-up question on Keno Hill. Keno Hill is a small mine, and you have previously, as the Alexco management did, talked about increasing the throughput to 550 tonnes per day. Is that something that you want to initiate as soon as possible once Keno Hill is up and running? Or how do you view that? And have you thought about expanding beyond that throughput level? \n\nPhil Baker -- President and Chief Executive Officer\n\nYes. The first step is to get into full and consistent production, and then we'll look at, as we do at all the mines, increasing the throughput from there. So, 400 tonnes a day is the first objective. \n\nUnknown speaker\n\nOK, great.\n\nOperator\n\nOur final question will come from the line of Sean Wondrack with Deutsche Bank. Please go ahead.\n\nSean Wondrack -- Deutsche Bank -- Analyst\n\nHi, good morning. I was curious, on Slide 13, you sort of show the components of production costs. So, one bucket, other is 24%. Is there any way you could give us a little more detail surrounding what's in that bucket, please? \n\nPhil Baker -- President and Chief Executive Officer\n\nSure. I think power. We realized that we're on hydro at all of our mines. So, that's a component of that -- that's the largest component.\n\nA third of that total. \n\nRussell Lawlar -- Senior Vice President and Chief Financial Officer\n\nYes, that's probably correct, as well as -- as I sat there and talk about that same box, the other one that sticks into my mind is something like the lease for [Inaudible] Greens Creek [Inaudible] That's an expense that would fit into that bucket as well. So, it's things along those lines that don't really fit into the rest of the pieces of the pie, but sometimes it can be relatively large like power. \n\nSean Wondrack -- Deutsche Bank -- Analyst\n\nRight. And how has your hydro power expense sort of -- how has that been over the course of this year? Has it been up or down or stable? \n\nPhil Baker -- President and Chief Executive Officer\n\nIt's stable. It's stable. That's one of the advantages that we have, both in terms of the cost of power, it's quite low and in terms of the inflationary pressure on power. \n\nSean Wondrack -- Deutsche Bank -- Analyst\n\nRight. Well, that's helpful. And then, it's nice to see -- I think you've reached 1.9 times of net leverage now. Are you trying to remain right around the two times leverage target? Is there anything religious about sort of remaining around there? Or would you potentially take this lower as your production increases and your free cash flow begins to churn? \n\nPhil Baker -- President and Chief Executive Officer\n\nWe're -- would like to see it get lower, but we're committed for it not to get higher. \n\nSean Wondrack -- Deutsche Bank -- Analyst\n\nUnderstood. Understood. OK, thank you very much.\n\nRussell Lawlar -- Senior Vice President and Chief Financial Officer\n\nAlong those lines, we were at 1.1 just coming at the end of last year, right? So, we've seen it significantly lower. But, to Phil's point, we're committed to remain prudent with our balance sheet and keep it less than 2-to-1.\n\nPhil Baker -- President and Chief Executive Officer\n\nAll right. Well, we appreciate everyone participating in the call. And what we would remind you that if you would like to have a one-on-one call with us, those are available. We've blocked out time.\n\nSo, just reach out according to the instructions on the press release. And otherwise, we look forward to speaking to you again either toward the end of this year or early next year. Appreciate it. Thanks, everyone. \n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAnvita Patil -- Head of Investor Relations\n\nPhil Baker -- President and Chief Executive Officer\n\nLauren Roberts -- Senior Vice President and Chief Operating Officer\n\nRussell Lawlar -- Senior Vice President and Chief Financial Officer\n\nMichael Siperco -- RBC Capital Markets -- Analyst\n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nMarcus Giannini\n\nJoseph Reagor -- ROTH Capital Partners -- Analyst\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nUnknown speaker\n\nSean Wondrack -- Deutsche Bank -- Analyst\n\nMore HL analysis\n\nAll earnings call transcripts"
}