{
  "companyName": "Confluent, Inc.",
  "companyTicker": "CFLT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/confluent-inc-cflt-q3-2022-earnings-call-transcrip/",
  "content": "Confluent, Inc. (CFLT 1.09%)\nQ3 2022 Earnings Call\nNov 02, 2022, 4:30 p.m. ET\n\nShane Xie\n\nHi, everyone. Welcome to the Confluent Q3 2022 earnings conference call. I'm Shane Xie from investor relations, and I'm joined by Jay Kreps, co-founder and CEO; and Steffan Tomlinson, CFO.  During today's call, management will make forward-looking statements regarding our business, operations, financial performance, and future prospects, including statements regarding our financial outlook for the fiscal fourth quarter of 2022, fiscal year 2022, and fiscal year 2023. These forward-looking statements are subject to risks and uncertainties, which could cause actual results to differ materially from those anticipated by these statements.\n\nFurther information on risk factors that could cause actual results to differ is included in the most recent Form 10-Q filed with the SEC. We assume no obligation to update these statements after today's call, except as required by law. As a reminder, certain financial measures used on today's call are expressed on a non-GAAP basis. We use these non-GAAP financial measures internally to facility analysis of our financial and business trends and for internal planning and forecasting purposes.\n\nThese non-GAAP financial measures have limitations and should not be considered an isolation from or as a substitute for financial information prepared in accordance with GAAP. A reconciliation between these GAAP and non-GAAP financial measures is included in our earnings press release and supplemental financials, which can be found on our investor relations website at investors.confluent.io. And with that, I'll hand the call over to Jay.\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nThanks, Shane. Welcome, everyone, to our third quarter earnings call. I'm pleased to say that Confluent delivered another strong quarter with the results exceeding the high end of all our guided metrics. Total revenue grew 48% year-over-year to $152 million.\n\nConfluent cloud continued to be the fastest-growing area of our business with revenue up 112% year-over-year to $57 million. We are also continuing to increase our operating leverage with a 14-point year-over-year improvement in non-GAAP operating margins. Despite the pressure from a more difficult macroeconomic backdrop, we think these strong and consistent results are a testament to our ability to drive durable and efficient growth. The rise of data streaming is one of the most fundamental shifts in the world of data.\n\nSo it will be hard to imagine a time when companies didn't have ubiquitous access to real-time data and the ability to react to it instantaneously. Apache Kafka has emerged as the de facto standard of this movement, hundreds of thousands of organizations, including more than 75% of the Fortune 500 use it every day for critical use cases across their business. But there are also incredible things happening within the larger data streaming ecosystem, including an extraordinary number of new use cases and technologies. In October, we hosted Current 2022, the first-ever industry event for data streaming.\n\nIt put Confluent at the center of the ecosystem and brought together over 4,000 attendees, hundreds of ecosystem partners, and more than 50 sponsors to learn, network and explore the future of data streaming. In today's call, I want to give a view of this emerging data streaming category and explain how it relates to some of the legacy technologies it replaces. We believe data streaming represents a major new data platform that has the potential to be as broad in scope as databases have been. However, many of the legacy products in this space have been quite limited in adoption and scope.\n\nHow can we square the skyrocketing adoption of Kafka, rapid success of Confluent, and expansive view most technologists have about streaming with more limited success previous tools in the space have had. To answer that requires a brief excursion through the legacy technologies that Confluent displaces. Today, we can broadly think of three major states of software and data. First, custom applications, the business is built from scratch and the operational databases that support them.\n\nSecond, the hundreds of SaaS applications like Salesforce and Workday that address common yet critical needs for business functions, and finally, analytics systems improve decision-making.  Each of these areas has grown a set of ad hoc fragmented tools for integration and a primitive kind of data in motion. Let's review this previous generation of tools and then discuss how it is displaced by data streaming.  Custom applications communicate with message queues, database change capture products, ad hoc APIs, and enterprise service buses, these technologies fit the real-time requirements of application workloads but were impossible to scale, low level, and labor-intensive to work with and limited in their application. SaaS applications, meanwhile, grew their own set of tools, including proprietary application integration platforms, business process management tools, and bulk file transfers. These tools achieved some success in their domains but were again limited in scalability, unable to handle complex data transformations or logic, fragile to work with, and disconnected from modern development platforms.\n\nFinally, businesses drive data into analytical systems, primarily through a combination of legacy ETL or ELT tools as well as preprocessing and data lakes. These tools support rich transformations but are stuck with slow batch processing that makes the data hours or days late by the time it arrives. These tools are all flawed in different ways. They're either slow and batch-oriented, nonscalable, require significant maintenance from centralized teams, or are unable to work with more sophisticated data and processing.\n\nBut more importantly, the critical problem is that in a modern company, all three of the major estates of data must be highly connected. The custom applications must interconnect with the off-the-shelf applications and the analytics applications. Consider a simple example of a modern retailer. Data about what is selling is needed by dozens or hundreds of custom applications, SaaS applications, and analytics platforms, having to create point-to-point plumbing across a dozen different tools for each use case and simply not feasible or scalable approach.\n\nData streaming works by rethinking this problem from the ground up whereas the previous generation of tools were ad hoc and limited to a narrow domain, data streaming starts with a broad foundational approach. It takes the core architectural concepts of a database, such as a ledger of changes, transactional guarantees, horizontal scalability, and easy dynamic data transformations, and translates them from the world of data at rest to data in motion. We believe the result is something vastly more general and powerful than any of the previous solutions. It consolidates the fragmented ecosystem of integration tools with a solution that can achieve all the capabilities each of the previous tools could not.\n\nIt's real-time, it's horizontally scalable. It's transactionally correct, and it provides an open, programmable platform. This provides a solution that is better in each of the domains than the previous generation of systems, but its key strength is that it treats data in a reusable manner. A single stream of data can feed all use cases, whether custom applications, SaaS applications, or analytic stores.\n\nThis allows vastly more simplicity and reuse than previous solutions, but the power of data streaming is well beyond the integration and technologies of yesterday because it starts with an open programmable foundation is not limited to building pipelines. The stream processing capabilities in Kafka allow any application logic, whether for data transformation or applying smart business rules. This is what has made Confluent a foundation for developing real-time applications that react to the stream of business events continuously. The real-time applications that organizations can build with Confluent are limitless includes fraud detection, fleet management, customer 360 platforms, real-time inventory management, and many more.\n\nThus, while each of the legacy technologies was limited in scope and adoption, data streaming has much broader potential as it both consolidates this landscape and expands well beyond it. Indeed, considering the three estates of data I mentioned before, the custom applications, SaaS applications, and analytics systems. It's worth noting that each of these is a repository of stored data. That is data at rest.\n\nHowever, equally important is the data in motion that Confluent is providing the underlying platform and foundation for. We believe this data in motion represents a fourth state of data, which will be equally critical to the operation of a modern business. This background provides a good framework for contextualizing a few exciting product releases from Confluent. While Confluent has revolutionized the underlying infrastructure for integration with data streaming, some of the legacy tools still had one advantage.\n\nWhereas Confluent was primarily a programmatic tool, many of the legacy tools were low code or no code which, while limited in power, were easy to learn and use. This is what makes me so excited for our recent announcement of stream designer. Stream designer brings a dead simple UI for building pipelines, familiar from other integration tools, but it does it on top of our modern data streaming platform. Stream designer is the first drag-and-drop visual builder to rapidly build and deploy streaming pipelines natively on Kafka.\n\nIt integrates with the core capabilities of our platform, Kafka, Connect, stream processing, and governance to make building mission-critical data pipeline simple. Stream designer also makes deploying streaming data pipelines accessible to more people throughout an organization, including people less familiar with Kafka. Users with different skill sets don't have to give up the power of the underlying infrastructure either. They can seamlessly switch between the UI, code editor, and command-line interface to quickly and declaratively build data pipelines.\n\nBack in 2021, we mentioned a wide variety of up-the-stack use cases we are uniquely positioned to address. Stream designer represents our first step in that direction and lets us serve the set of use cases broadly characterized as data pipelines. This isn't the end of the story though. By having one layer where data flows throughout the organization, this enables Confluent to add additional value.\n\nAs data streaming use cases grow and real-time data flows more freely across the business, it's critical that this data can easily be discovered, understood, and governed in real-time. Stream governance advanced does exactly that. The newest capability in our stream governance suite makes governing mission-critical workloads at any scale more reliable with a 99.95% uptime. And the ability to add user-generated business context makes it easier to find the data that's needed to power new use cases.\n\nNow customers can more easily scale the power of data streaming from individual projects to central nervous systems for their business. Taken together, stream designer and stream governance advanced are powerful examples of the fundamental paradigm shift occurring with data streaming. They also show our unique ability to build out-of-the-box solutions on top of our platform that reach a broader set of customers, accelerate their adoption and grow our addressable market over time. What was once thought of as different software categories are today consolidating into one much more general, powerful, and valuable market data streaming platform.\n\nNext, I'd like to touch on something I mentioned in my opening remarks, Confluent is set up to drive durable and efficient growth. We've seen fantastic momentum to date, but what's most exciting is our approximately $60 billion market opportunity in front of us. We've started to demonstrate both the breadth and depth of this opportunity. The breadth is captured by the massive adoption of Kafka, which provides a large installed base for new customer acquisition through self-service on Confluent cloud.\n\nThis is foundational to our strategy of converting open-source users and landing greenfield customers in high volume. We've also shown the depth of the value of these opportunities with our ability to expand rapidly after we land a customer. This is evident in our best-in-class large customer ratio, where 22% of our customers have an ARR of $100,000 or more. But at the same time, we believe there are strong expansion opportunities with our largest customers still, including those with ARR of $10 million or more, particularly as we make it easier to connect and consume data throughout the platform.\n\nWe also continue to benefit from the secular move to the public cloud, particularly in an environment where there's increased pressure for organizations to run their businesses more efficiently. Our cloud-native platform significantly simplifies operational complexities and reduces total cost of ownership saving valuable engineering resources allocated to manually building and managing lower-level infrastructure tools like Kafka, a new Q3 customer is a great example of the cost savings of Confluent cloud. Armis is a leading cybersecurity platform for connected devices that enables its customers to discover and secure their IT, cloud, IoT, and edge assets in real time. Today, Armis tracks over 3 billion devices for its customers, from printers, laptops, and mobile devices to connected medical devices and factory equipment.\n\nKafka is a central part of their business, responsible for ingesting data bidirectionally from billions of devices to provide real-time protection and policy enforcement. But with the rapid growth of its business and the proliferation of connected devices, the cost and overhead of managing open-source Kafka was unwieldy. This quarter, Armis turned to Confluent cloud for a cloud-native Kafka service that can scale alongside its business. Confluent will be the central nervous system for Armis' data streaming platform, managing data from billions of devices in real-time, all while enabling them to reassign 70% of the expensive engineering talent previously focused on Kafka to projects that move the needle for the business.\n\nThe durability of our growth is also reflected in our ability to rapidly expand once we land a customer. A great illustration of this dynamic is one of our largest Confluent cloud customers. As one of the highest-traffic job websites in the world, this customer sends more than 4.5 gigabytes per second through Confluent cloud every day. Kafka was a no-brainer choice to start their data-in-motion journey, but they soon found themselves spending too much developer time managing Kafka.\n\nOur commercial relationship started with a small deal in 2020 for a single use case in a single business unit. As that pilot proved successful, we landed a $1 million-plus deal that expanded Confluent cloud to more business units across the company. Inspired by our platform's extensive capabilities and an accelerated move to the cloud, our customers reimagined their data architecture in 2021, leading to our first multimillion-dollar deal with this customer. As Confluent became a critical unified data layer across the organization, their annual spend surpassed $8 million.\n\nAs you can see, what often starts as a small land for a single use case can rapidly expand to a large customer in just two years' time. But we believe we are still at the beginning of a great partnership as use cases and streaming data become more pervasive throughout the organization. Turning to efficiency. On a year-over-year basis, we improved non-GAAP operating margin by 14 points in Q3 and eight points in Q2.\n\nWe are pleased with the substantial margin improvement we've driven this quarter and excited that there are significant opportunities to continue these improvements. We're making substantial progress in creating strong connective tissue between our product-led and enterprise sales motions to help accelerate our customers' time to value. And we are still early in leveraging our partner ecosystem and bringing to bear a solution and industry focus. As an eight-year-old company, we believe our go-to-market model will drive differentiation and separation from our competitors, which will generate greater leverage and efficiency in our model over time.\n\nLooking forward, we remain confident in our ability to achieve positive non-GAAP operating margin when we exit Q4 2024, Confluent's 10-year mark as a company. A profitability timeline comparable to many of our successful high-growth peers.  And finally, we're pleased to announce that Ray Perez has joined Confluent as our chief customer officer. Ray joins us from New Relic where he most recently held the role of CCO, leading the solutions engineering, solutions architecture, enablement, and expert services teams. We'd also like to thank Roger Scott for his leadership and impact while at Confluent and wish him the best in his next chapter.\n\nTo summarize, we have entered the data streaming era. Kafka is at the center of this movement but represents just the foundation of the emerging platform. Our recent releases of stream designer and stream governance are great examples of this and show how Confluent is moving up the stack to help our customers connect, process, store, govern and share data from across their businesses. We believe this model will be the basis to drive continued durable and efficient growth for our business and allow us to capture the lion's share of our large market opportunity ahead.  With that, I'll turn the call over to Steffan to walk through the financials.\n\nSteffan Tomlinson -- Chief Financial Officer\n\nThanks, Jay. In Q3, we beat our revenue and bottom line guidance as we've done in each quarter since going public. Key highlights include strong top-line growth, including the largest increase in sequential revenue add for Confluent cloud. Robust expansion of large customer cohorts, which translated to another quarter of greater than 130% net retention rate and a 14-point year-over-year improvement in non-GAAP operating margin.\n\nThese strong results reflect that our market-leading data streaming platform continues to resonate with customers despite a cost-conscious environment, and we continue to demonstrate our ability to drive durable growth and improve efficiency and profitability.  Turning to the detailed results. I'd like to note all comparisons are on a year-over-year basis unless otherwise noted. RPO in the third quarter grew 72% to $663.5 million. Current RPO estimated to be 62% of RPO was approximately $408.2 million, up 59%.\n\nTotal revenue grew 48% to $151.7 million. Subscription revenue grew 50% to $138.7 million and accounted for 91% of total revenue. Within subscription, Confluent platform revenue was $81.8 million, up 25%, and accounted for 54% of total revenue. Confluent platform remains an important component of building a central nervous system for our customers and continues to drive upsell and cross-sell opportunities for Confluent cloud.  And we saw another record quarter of sequential revenue add for Confluent cloud, up $9.9 million sequentially and up 112% to $56.9 million, representing 38% of total revenue, compared to 26% of revenue a year ago.\n\nCloud accounted for more than 60% of new ACV bookings and Q3 marks the fourth consecutive quarter where cloud accounted for greater than 50% of new ACV bookings. As cloud accounts for a larger share of new ACV bookings, Confluent platform will have lower ACV and less upfront revenue. Confluent cloud momentum was driven by our strong product advantage, our continued focus on decreasing time to value and use case expansion, leading to robust consumption across a broad spectrum of verticals. Additionally, customers run their operational workloads on Confluent and these workloads are directly responsible for driving the core operations of our customers' business, which reflects the mission criticality and resiliency of our data streaming platform.\n\nTurning to the geographic mix of revenue. Revenue from the U.S. grew 44% to $95.1 million. Revenue from outside the U.S.\n\ngrew 56% to $56.6 million. On our last earnings call, we called out some deals that were taking longer to close in Q2 due to additional scrutiny in pockets across geographies. While this dynamic has continued, I'm pleased to report that the vast majority of those deals were closed as expected in Q3.  Turning to customers. We added 120 net new customers ending the quarter with approximately 4,240 total customers, up 40%.\n\nWe're pleased with the improved sequential growth despite the continued impact of paywall removal. This strategic move removed the payment friction for developers to test drive complement and it continues to have a positive effect for new sign-ups. As a reminder, we expect the impact of total customer count will take a few quarters to work through and new pay-as-you-go customers do not have a material contribution to our revenue in any given quarter. The growth in our large customer base continues to be robust.\n\nCustomers with $100,000 or more in ARR grew 39% to 921, representing 22% of our total customer count and these customers contributed more than 85% of total revenue in the quarter. Customers with $1 million or more in ARR grew 53% to 113. As discussed at current, we have a growing number of customers with $5 million plus and $10 million plus in ARR, and we see strong expansion opportunities across our customer base, including these two largest customer cohorts.  Dollar-based net retention rate in the quarter remained above 130% for the sixth consecutive quarter driven by 90% plus gross retention and strong expansion across platform and cloud. Importantly, NRR for cloud continues to be higher than the company average and NRR for hybrid customers remain the highest.\n\nA period of tough economic times is when the real durability of demand for our product is tested and we think our consistent and strong NRR is a testament to our TCO advantage and the mission criticality of our use cases. Moving on to gross margins. I'd like to note that I'll be referring to non-GAAP results unless stated otherwise. Total gross margin was 71% and subscription gross margin was 76.9%.\n\nOur focus on improving the unit economics of our cloud offering continued to pay off, driving another quarter of healthy gross margins despite a continued revenue mix shift to Confluent cloud. In the near term, we anticipate total gross margin to fluctuate near our midterm target of approximately 70%. Turning to profitability and cash flow. Operating margin improved 14 percentage points to negative 28%.\n\nThe improvement was primarily driven by improved sales and marketing efficiency and our balanced approach of investing in the highest ROI projects while continuing to proactively manage spend across the organization. Net loss per share was negative $0.13 using 282.3 million basic and diluted weighted average shares outstanding. Free cash flow margin was negative 30% in line with our expectations. As discussed last quarter, we changed our annual bonus structure by moving $13.5 million payout into Q3 '22 from Q1 '23.\n\nThe bonus payment had a negative impact of approximately nine percentage points on free cash flow margin in the quarter. And we ended the third quarter with $1.94 billion in cash, cash equivalents, and marketable securities. Now I'll turn to our outlook. We are raising our revenue and bottom-line guidance for Q4 and FY '22.\n\nThe magnitude of the raise incorporates what we've experienced since June, where deal cycles are elongated due to the additional scrutiny on budget approvals. Our forecast assumes that this macro dynamic persists in Q4. For the fourth quarter of 2022, we expect revenue to be in the range of $161 million to $163 million, representing growth of 34% to 36%. Complement Cloud sequential revenue add to be in the range of $9.8 million to $10 million; non-GAAP operating margin to be approximately negative 28% and non-GAAP net loss per share to be in the range of negative $0.16 to negative $0.14, using approximately 286 million weighted average shares outstanding.\n\nFor the full year 2022, we expect revenue to be in the range of $578 million to $580 million, representing growth of 49% to 50%, non-GAAP operating margin to be approximately negative 32%, and non-GAAP net loss per share in the range of negative $0.65 to negative $0.63 using approximately 280 million weighted average shares outstanding. Looking ahead, while we're still in the midst of annual planning, I'd like to provide a preliminary outlook for next year. For the full year 2023, we expect revenue to be in the range of $760 million to $770 million, incorporated in the preliminary revenue outlook is a negative impact of $12 million to $17 million, stemming from the increased scrutiny on deal approvals and we're assuming that the overall macro dynamic that we see today will continue to persist throughout next year. And we expect non-GAAP operating margin for the full year 2023 will be approximately negative 21%.\n\nWe will continue to invest with discipline focusing on the highest ROI segments of our business to drive efficient and high growth. We'll monitor and course correct if the macro conditions change materially and action is warranted to ensure we meet our margin targets. In closing, our strong Q3 results are another proof point of our ability to drive high growth with increased efficiencies. The demand environment for data streaming remains strong despite the macro dynamics around deal approvals.\n\nOur Confluent cloud momentum reflects our TCO value proposition, the differentiation of our use case-driven consumption model, and the mission-critical nature of our cloud-native platform. Looking forward, we're well-positioned to drive efficient digital transformation with high ROI for our customers. Now Jay and I will take your questions.\n\nShane Xie\n\nRight. Thank you, Steffan. [Operator instructions]. And today, our first question will come from Phil Winslow with Credit Suisse, followed by William Blair.\n\nPhil?\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nGreat. Thanks for taking my question, and congrats on a really strong bookings quarter, but also delivering a pretty impressive operating leverage. Jay, one of our takeaways from Current '22 was that large Kafka users are increasingly coming to the realization that open-source DIY simply wasn't really scaling for them. And they were, therefore, increasingly looking at Confluent cloud.\n\nNow I also appreciate your customer example on this call today. So with IT budgets as a whole coming under pressure due to just macro, how is this change in conversations with those open-source Apache Kafka users in terms of sort of TCO and potentially moving those to Confluent cloud? And then I just have one follow-up with Steffan.\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nGreat observation. That's exactly right. So the TCO angle of our cloud offering has been part of our sales process for a while now, but it has kind of come to the forefront. And it's one of a number of advantages of moving to a true cloud offering, right? You get a more complete product, you get something that's really kind of cloud-native and elastic and expands as you need it.\n\nAnd then it's actually just a better deal, and we think that's compelling. And so yes, we see this kind of call them large tech customers that have a big installed base of Apache Kafka. We see that as a huge opportunity for us where they're already using the open source. In many cases, they started before there was a Confluent or before there was a Confluent cloud.\n\nBut now that we have a cloud offering that really works well at scale and it's cost-effective, it kind of meets the needs of even very demanding customers. We're very optimistic about that segment.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nAwesome. And then, Steffan, it was great to see a sequential increase in Confluent cloud and I remember you flagged that two quarters ago. Could you just remind us of the seasonality that you see there, kind of Q4, Q1, just the trend there? Because obviously, the bookings were strong again at a high level this quarter, but just maybe help us think through just sort of the, call it, the seasonality in terms of translating that into Confluent cloud revenue.\n\nSteffan Tomlinson -- Chief Financial Officer\n\nFrom Q3 to Q4 or Q4 to Q1.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nBoth actually.\n\nSteffan Tomlinson -- Chief Financial Officer\n\nYes. So sure. So we are very pleased with the fact that we were able to deliver the highest sequential net add in Q3 of $9.9 million for Confluent cloud. So that came in above our expectations.\n\nAnd as we think to Q4, we factored in a couple of things into our guide for the $9.8 million to $10 million sequential increase. And two main factors. One is we have a very robust consumption modeling system that we use to help drive that. And then we also learned from last year that at the end of the calendar year, some companies aren't as aggressive in terms of deploying new workloads in Q4 as they look to lock down systems for the end of the year.\n\nSo we took that into consideration. We're very pleased though with the $9.8 million to $10 million guidance range for the quarter. And then Q4 to Q1, typically, most companies that have a hybrid revenue model would see sequential net add from Q4 to Q1, but not at the same rate as the prior quarter. And while it's a little bit too premature to talk about specific quarterization of what FY '23 looks like.\n\nWe wanted to share that dynamic with you as well. Because when you look at the overall $7.60 to $7.70 range and the growth rates that we're posting, Confluent cloud is going to be a continued driver and it's going to continue to account for probably two to three points of additional revenue share per quarter throughout next year.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nAwesome. Keep up the great work.\n\nSteffan Tomlinson -- Chief Financial Officer\n\nThank you.\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nThanks, Phil.\n\nShane Xie\n\nThanks, Phil. We'll have Jason Ader from William Blair. Next, followed by Morgan Stanley.\n\nJason Ader -- William Blair and Company -- Analyst\n\nThanks, Shane. I guess my question -- well, first, I want to say great job on explaining the power of Kafka. I thought you guys did really an amazing explanation, really simple, and articulated the history, I think, extremely well. My question is on consumption and whoever wants to take it.\n\nBut we've seen some other companies, obviously, Azure, AWS, Mongo, get hit by the sort of consumption impact related to macro. It doesn't seem like it's affected you guys as much. Maybe can you talk through that and why?\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nYes. Yes. It's an interesting one. I do think this is more about the individual product or products than it is about just consumption models.\n\nI think no matter what the business model is, when there's tight economic times, customers look at, hey, are we really getting the value out of this? Is there a way to use less seats, less instances, less servers, or in a consumption model, can we dial down overall usage in some way, right?  I think the reason that you see less of that with Confluent, a few things like one, we tend to serve mission-critical use cases, and there's a lot of use cases, right? So the opportunity to expand is very large. And that counterbalances any headwind from optimization that we've seen. Beyond that, I think these mission-critical use cases are important. You're not going to turn it off in one quarter.\n\nAnd they usually come out more or less preoptimized. And so we haven't seen a huge amount of that in our customer base. Obviously, economic pressure does create a kind of headwind. I think the tailwind in this area is strong enough that it just doesn't show up, and that's kind of shown in the overall NRR that's remained strong.\n\nI think, shown in the kind of sequential net add in Cloud.\n\nJason Ader -- William Blair and Company -- Analyst\n\nAnd then a quick follow-up, Shane, for Steffan, just on percentage of ARR through partners and then particular cloud partners. Can you give us those numbers, Steffan?\n\nSteffan Tomlinson -- Chief Financial Officer\n\nWell, we don't break those out specifically, but what I can tell you is we saw tremendous growth from all three main cloud service providers through the marketplaces. We saw the best growth that we've seen in a long time from all three. So when we look at the overall mix of business, primarily where we sell direct to our customers, and oftentimes, we fulfill through the channel. But the marketplace business that we do with the three cloud service providers is definitely an accelerant, and it's been a bright spot for us, specifically this past quarter.\n\nJason Ader -- William Blair and Company -- Analyst\n\nAnd it has better unit economics for you?\n\nSteffan Tomlinson -- Chief Financial Officer\n\nIt does for sure.\n\nJason Ader -- William Blair and Company -- Analyst\n\nThank you.\n\nShane Xie\n\nThanks, Jason. We'll take our next question from Sanjit Singh with Morgan Stanley, followed by D.A. Davidson.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nThank you for taking the questions, guys. Congrats on a very, very solid Q3. Jay, I think over the past couple of quarters, you guys have talked about different use cases. And as sort of another sort of take on that if you sort of aggregate it up in your mind, what percentage of the business, Confluent cloud or overall is coming supporting like operational use cases, whether it's just-in-time inventory or dynamic pricing, something that's driving more operational use cases versus come being used for analytical decisions to support for more analytical use cases.\n\nIs there any way to think about that and how that maybe evolves over time?\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nYes. Yes. I don't have something more scientific and there's obviously a set of use cases that kind of blur the lines where, OK, it's some machine learning app, it's kind of analytics see, but it does have some feedback loop into production. Yes.\n\nBut I would say the vast majority are kind of operational in nature, right? They tend to be things built by software engineers rather than data scientists. We do have an interaction with the analytics world. We're often kind of a very significant feed into the Snowflakes and DataBricks and BigQueries of the world. But we're not really competing with those technologies or replacing them.\n\nI think to them, we would just be an upstream feed, even though, obviously, in our demand were the exciting thing doing data processing.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nIs that part of the -- in terms of just the position that you just laid out, is that part of the reason why we're seeing relative resiliency versus some of the other data platforms that are seeing customers optimize and in rushing more.\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nYes. I think it's one aspect. I mean there's a number of things. I think when you peer behind the curtains in any of these companies, I couldn't speculate company by company.\n\nBut I do think if you think about operational use cases, this is some chunk of software engineers spent probably a better part of a year, maybe a team of people, a better part of a year building. It doesn't just get turned off and on. So it's not -- like when we -- when we look at our spend on reporting, for example, we realize, \"Oh, look, we have a bunch of reports, nobody looks let's delete them. It's pretty easy to do.\n\nThat's generally not the case with this kind of more core application. But if you look at what happens with consumption, there's a number of things that impacted, including just the particular product, how much traction it has, that space. you can't fold all that into just the space, but I do think that's one important variable. And I think it's a positive thing to serve these mission-critical use cases in this environment.\n\nI think these things are typically the very important big bet for the company. It's the thing that's likely to kind of go forward in a purchasing decision, and it's the thing that's unlikely to get cut when you're looking to optimize. And I think that shows up both in the continued expansion sequential add in cloud as well as we shared the gross retention number. I think all of it kind of supports that story.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nMakes some sense. And then one for Steffan. Steffan, thank you so much for the color on seasonality in Confluent cloud. As it relates to fiscal year '23, the $12 million to $17 million headwind, which I think is primarily from longer sales cycles.  Any way to -- how to sort of arrive at that number? And dive in some more broadly in terms of saying expectations this early just given the dynamics of your model.\n\nHow do you guys sort of -- what are sort of the underlying assumptions that got you to 2023 guidance?\n\nSteffan Tomlinson -- Chief Financial Officer\n\nWell, it starts with the track record of us delivering on our commitments throughout FY '22. And on the basis of FY '22, numbers where it was the FY '22 plan. And right now, we are in the midst of doing our FY '23 plan. We have very good visibility to multiple streams of future revenue.\n\nAnd then we also took a look at a number of drivers around productivity per head. We look at pipeline, we look at a number of other factors. And then we layer on the macro dynamics that we've seen around sales cycle elongation. And through all that process, we arrived with the $12 million to $17 million headwind for FY '23 that we're calling out.  And look, the environment is -- has been tough.\n\nWe've been able to go through and execute against what we've committed to folks. And our level of like confidence and enthusiasm around FY '23 is there, right? And so we are -- we take things into consideration like the macro and everything else. But at the end of the day, we felt good about the $760 to $770 and the improvement in operating margin. We are definitely focused on balancing growth and profitability.\n\n-- and that has shown up not only this year but how we're guiding next year.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nAppreciate it, Steffan. Thank you so much.\n\nShane Xie\n\nAll right. Thanks, Sanjit. We'll take our next question from Rudy Kessinger with D.A. Davidson, followed by Cowen.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nHey, guys. Thanks for taking my question. I know you talked about on the macro extended deal cycles, etc. I guess I'm curious -- and you also talked about current customers that can't really diode you down.\n\nBut I guess as you look at your current customers, and the pace that they're expanding to new use cases, how has that pace changed over the last six months given the macro?\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nYes. When we kind of give that $2 million to $3 million of pressure for Q4 and as we did for Q3, I think that takes into account both new use cases, like net new customers, new use cases as well as expansion. And yes, I think it's relatively similar between both. There's obviously a little more scrutiny on a new customer than on an expansion.\n\nThe reality is there's a lot of use cases to go after. And so despite that, I think we've shown strong performance on NRR, which is kind of the best roll-up staff that shows what's actually happening. And so I think that is the takeaway as we're kind of seeing that continue. And then we did talk about, hey, some of these deals that slipped, we felt confident they would close last quarter, and that was borne out.\n\nThe vast majority of those did close, took a little longer, but we were pleased to see that. And I think that's credit to the strength of the TCO argument these things are getting a lot of scrutiny, but they're going through with a lot of scrutiny.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nYes. Got it. Steffan, quick follow-up for you. Given the commentary on '23, I know you're not giving too granular details yet, but just with cloud expected to increase is two, three points as a percentage of the mix.\n\nIs it right to think that platform growth is really going to start to level off. I think that forces you into about high single digits to low double digits growth in platform. Does that sound about right?\n\nSteffan Tomlinson -- Chief Financial Officer\n\nWe'll be providing more color commentary around guidance and mix on our Q4 call. But by definition, given the mix shift that we've already seen this year, with cloud becoming a greater portion of new ACV. By definition, that means that complement platform is reducing in terms of percentage of ACV, and we see that trend to continue. So growth will be moderating for Confluent platform.\n\nWith that said, Confluent platform is incredibly important, and it's important for the solution that we're providing customers need to be running their data and motion solution everywhere. That means on-prem, hybrid cloud, multi-cloud. And so Confluent platform is going to continue to be a very important part of the story, but growth will be moderating a little bit as we've seen this mix shift. And by the way, the cloud business continues to overperform our expectations.\n\nAnd it's really being customer-led, and we feel like we're still in the very kind of early stages of the growth curve with cloud.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nGot it. Thanks, guys.\n\nShane Xie\n\nThanks, Rudy. We'll take our next question from Derrick Wood with Cowen followed by Wells Fargo.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nGreat. Thank you for taking my questions. Great job on a solid quarter. I guess, Jay, just to start with you, going back to the topic of this mindset shift from DIY to cloud.\n\nThat was certainly something we heard loud and clear at your conference. Two questions about this. One, as this shift happens, how does this change the competitive landscape and kind of short list of vendors that companies may look at? And two, how are you changing your go-to-market strategy from a direct and indirect sales standpoint as you really try to lean more into the cloud?\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nYes. Yes, both are excellent questions. I think this is a very significant thing that's happening. It's happening in the big tech companies where they have heavy investments.\n\nIt's happening in mainstream enterprise companies are just looking at where resources are going and looking for a way to do the same thing, better, faster, cheaper, that's what this kind of time tends to encourage. And there's a really obvious one with these managed services where you're putting a lot of effort into a very difficult problem that you're not doing well, and there is a better way to do it. So yes, we're absolutely seeing it. What does it impact in the terms of the competitive landscape? I don't think it's a huge change.\n\nI would say, net-net, the folks who are focused in an on-premise world become less relevant. And there are a set of companies that provide something around Kafka support or some of these legacy technologies that primarily exist in data centers. I mean, I do think there's a shift away from that stuff. So that's a change.\n\nI don't think it's a dramatic change because we didn't view those as kind of compelling competitors to begin with because this shift was already underway. On the partner side, I don't think it's a major revelation. We work very closely with the cloud providers, and they're obviously a very important partner as Steffan alluded to, each in their own environment, have a significant sales force. And they're looking for ways to bridge between these environments.\n\nWhen we -- when I talk to any kind of large enterprise -- they are all in on the transition to the cloud. They have a set of systems in data centers that are going to persist for a very long time. That connectivity and the fabric for data that spans, that's incredibly strategic and important to them. And I do think that's a part of the conversation around data streaming that they view as very strategic because it's what enables them to actually make this move.\n\nAnd so it's both about the shift of open-source stuff like Kafka to a managed service as well as the overall story of migration to the cloud and how that plugs into an existing business. And so I think both of those are kind of important aspects of what we're doing.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nThat is great. Thank you. Steffan, one for you. I know billings is not a number you closely watch, but just wanted to ask about this because there's been a bit more deceleration in deferred revenue than in the RPO or CRPO.\n\nCRPO numbers have been holding up quite high even against tougher comps. So I guess just as you shift more to the cloud, does that have some sort of impact on deferred, especially if there's pay-as-you-go, or are there some things around invoice duration that have changed because of the macro? Just trying to get an understanding of the potential dynamics around the deferred revenue side.\n\nSteffan Tomlinson -- Chief Financial Officer\n\nWell, for both billings and deferred revenue, they are impacted by mix and as we have more Confluent cloud business. specifically on billings, we have a mixture kind of in practice, but usually, it's monthly or quarterly billings for Confluent cloud. And one of the reasons why we do focus on RPO and CRPO is that's more consistent with the consumption type model as opposed to more of a legacy model that would be more focused on traditional billings. So the more that cloud becomes a bigger percentage of our new ACV and revenue there will be more of a disparity between billings and short-term revenue versus RPO and CRPO.\n\nAnd I guess the last thing I would say is on just billings practices in general. We haven't seen very much change in billings requests or anything along those lines. Things have been relatively stable.\n\nShane Xie\n\nGreat. Thanks, Derek. We'll take our next question from Michael Turrin with Wells Fargo, followed by Scotiabank.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nThanks. Appreciate you taking the question, and nice job everyone with the execution here. I mean, look, you're managing your business through a challenging backdrop Maybe, Jay, you can speak to how you keep the go-to-market and engineering teams all focused and moving in the right direction given just all the noise and volatility you've seen since going public. And then, Steffan, can you maybe expand on how that informs your approach to the growth margin framework and trade-off and just what underlines the confidence and just the consistent approach to making sure you're taking advantage of the growth opportunity first and foremost here?\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nYes. Michael, yes, look, I would say there's no silver bullet. The thing I think, does help us is, as a company, we've done some hard things before. So we went through a very significant kind of cloud transition.\n\nYou would see a lot of that kind of shift happening now, but the work was done earlier on. And doing that in a small company is a lot of work. And just difficult, you're asking people to build and launch a very difficult second product in the middle of the start-up take it out to market. I think just working through our things kind of builds the muscle.\n\nAnd then if you're in more difficult times, people who have been through something hard before, you've kind of built a little comradery around how you go to it. There's some resilience. There's some people used to it. And so I think that helps.\n\nAnd I think that kind of built a bit of a core of a team that is ready for some challenges. Obviously, it doesn't help if there's kind of friction in the world, it doesn't make it easier. I think we're lucky to be in a space that just has potential that can outpace that as long as we execute well.\n\nSteffan Tomlinson -- Chief Financial Officer\n\nAnd on the growth and profitability side of the house, we've been very prescriptive ever since we've been public around, we have a growth and profitability framework. It bears to mention, we've never been in a company where it's been growth at all costs. We've been always about growth and improving operating margin. And we've constructed our internal plan and what we've communicated with Wall Street through the following lens.\n\nIt is all about making sure that we are adequately invested to tackle the $60 billion market that's out there. while we are also increasing the fundamental drivers of efficiency, think about productivity per head, think about unit economics of cloud. These are projects that are going to be continuing on for probably forgot forever.  And as we've constructed this model, showing the year-over-year improvement in operating margin is critical for us to demonstrate that we're showing that efficiency and productivity while still in high-growth mode and we define high-growth mode is greater than 30%. So this is a framework that we put in place.\n\nWe've been operating against it. and we're committed to driving high growth and improving profitability toward the breakeven target of exiting Q4 '24, which, as Jay mentioned, is the 10-year mark of the company -- of the company's age.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nCongrats on the results.\n\nSteffan Tomlinson -- Chief Financial Officer\n\nThank you.\n\nShane Xie\n\nThanks, Michael. We'll take our next question from Nick Altmann with Scotiabank followed by Barclays.\n\nNick Altmann -- Scotiabank -- Analyst\n\nYes. Great. Thanks, guys. Maybe one for Jay to start.\n\nYou guys outlined your TAM at the Analyst Day and it the numbers kind of insinuated that half of the market is kind of at the commercial end. And just given you guys don't talk about the lower end of the market as much. I was wondering if you guys could maybe elaborate on the strategy there. how meaningful the commercial segment is to revenue and to bookings? And how much of a focus is that portion of the market in the medium term versus the larger end of the market?\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nYes, it's a fantastic area for us. A few years back, that was absolutely the worst part of the business and had very low focus internally. And as we started to have a low-friction cloud product, we realized, hey, we could build just really a cloud-native motion that would help land companies in that segment. And really kind of reimagine that team and they got better on every metric, right? Now it's one of the highest-performing areas in the company.\n\nIt's -- that's newer, right? But it's definitely an area where we are doubling down and kind of disproportionately adding capacity. They're doing great against their targets.  And we think that's really important to us, it's important to have -- have a mechanism to capture both breadth and depth, right? So depth is definitely the larger customers. We do tend to talk about those because people always have the question of like, hey, what is the breadth of depth, what could a customer be in this space? How much might they spend? And so I think there's value in that. We don't talk as much about how we're going after the broad market.\n\nI think there it's more about the mechanisms, how does the self-service feed into a more transactional early stage sale? How does that kind of grow and expand it turns out a lot of these commercial customers can actually become quite sizable, and they move pretty quickly. And so what starts small actually can turn into something pretty reasonable. So we're very excited about that area, and it's probably good feedback that we should talk about it more.\n\nNick Altmann -- Scotiabank -- Analyst\n\nGreat. And then just one more. You guys have talked about how the cloud marketplaces have been a very much successful from a go-to-market perspective, from a lead gen perspective. I guess as we're sort of entering a choppier macro environment, what are sort of the puts and takes there? Because I guess one side of the equation, if there's consolidation of spend from a procurement perspective, maybe that's a tailwind as people are using AWS credits to sort of burn down, commits, and allocating those to Confluent.\n\nAnd the flip side of the equation, maybe it's a little bit easier to slow consumption or reallocate those credits. So is it choppier macro and sort of your relationship with these cloud marketplaces. Is that more of a tailwind? Or is there a little bit of a headwind there potentially too?\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nI think it's a tailwind. So the way the marketplace has come into play, it's a little bit of a lead gen thing, but the bigger aspect is that companies have significant committed spend with the cloud providers and it's possible to buy products through that through your marketplace agreement. And so you could think of that committed spend as kind of a shadow budget that's flexible across different things that you could purchase. And so if you're in tighter times, you're probably optimizing everything in the cloud, and it's a really nice way to be able to fit in a new thing like Confluent.\n\nAnd so yes, we see it as something that reduces friction in the sale for sure. It also provides a great mechanism for cooperation with cloud providers, right? What motivates them is both that marketplace consumption as well as the flow of data into all of their other services, which kind of helps drive utilization and consumption in their cloud. And so both of those are the things that are going to activate their kind of go-to-market teams to help. And so we think these are great programs.\n\nWe've leaned heavily into them and been quite successful.\n\nShane Xie\n\nGreat. Thanks, Nick. We'll take our next question from Raimo Lenschow with Barclays followed by JMP Securities.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nHey, thank you. Two quick questions from me. Jay, like the interesting thing at the conference was to see the excitement like how kind of messaging and what your offering is changing the world. In light of that, like how do you see this at the moment playing out in customer conversations because as macro is getting tougher, does it -- in the past, a tend to be like the tendency to stay with the old for now because you're just keeping the lights on versus also have any pressure to become more real-time and actually do something.\n\nSo the question is more, how are the customer conversations changing now as macro is getting a little bit more choppy and then I had one follow-up from Steffan.\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nYes. Yes. I mean I think the critical question is, hey, does that excitement persist in times where there's more economic pressure. And what we've seen is, yes, it absolutely has, right? And on both sides of it, like we're continuing to grow through more difficult times.\n\nI think if anything, the big change is how prevalent is that TCO side of things, right? Is there a really strong story of how you can displace legacy technologies you can get out of this kind of internal operations of open source that can be very costly and then how you can just get more efficient use out of your data and enable the things that you have to do as a business, but now with a little bit of a tighter overall management of budget. And I think that we actually have a very compelling story in that area. And I think that goes along well with the overall excitement about the area. I think that, that's now -- you kind of have to have both of those things be true about any product area for it to continue to succeed in the current environment.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nAnd then, Steffan, as the more question on the investment. So as you guys doing more cloud, what does it kind of do in terms of investment levels in sales and marketing, et cetera, going forward? Because this cloud in a way one beauty of cloud increases visibility for you in terms of you see what a customer is doing, you see how much they're doing.  Does that kind of trigger a different investment in sales and marketing? Is it -- can you do more with less? How do you have to think about that dynamic?\n\nSteffan Tomlinson -- Chief Financial Officer\n\nAs we look at the investment profile for sales and marketing, we are definitely leaning into the mix shift that we're seeing that's being more driven by our customers, where it's more cloud oriented. We have a customer growth go-to-market journey where we have these five stages ultimately with getting to a central nervous system. And so along the way of that journey, what we are doing from a sales and marketing standpoint is making sure that we have the right model in place around number of account executives and systems engineers and customer success people. In the cloud business, when we segmented and we look at the commercial business, the commercial business is 100% cloud.\n\nThat business is growing very healthily. And then we look at the enterprise business, which is growing healthily, too, but we see more hybrid opportunities in the enterprise business where they have existing complement platform deals, and we're looking to upsell and cross-sell into those existing customers where they could be adopting Confluent cloud.  So when you net it all out, what we're looking at is we're looking at a more efficient go-to-market structure, sales, and marketing with the shift to cloud. because a lot of it is expansion selling. And we feel like it's a good setup as we look to get more leverage out of sales and marketing over time.\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nAnd a big part of that, just to tag on is, look, the ability to drive kind of product-led growth and adoption and then expansion with software in addition to an excellent field sales team, it's just not that easy to do on-premise. It is hard to get net new data systems stood up on-premise. You got to hire people, you have to order servers. There's no way to just do it with software.\n\nIn the cloud, that's totally different. So our ability to kind of augment what that team does make our field force like more efficient in everything they do and how they work with customers. It's just so much better as well as our data about how that's progressing and our ability to be smart and targeted in what we do. And so yes, that's kind of where that efficiency comes from.\n\nNow obviously, there's some investment to get all those parks built and strung together. We've talked a little bit about how we're trying to orchestrate that journey. But yes, I think it's a huge ability to amplify what you're doing with humans and really be intelligent and direct it well to drive efficient growth.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nPerfect. Congrats. Thank you.\n\nShane Xie\n\nAll right. Our next question will come from Patrick Walravens with JMP Securities.\n\nPatrick Walravens -- JMP Securities -- Analyst\n\nGreat. Thanks, Shane. Let me add my congratulations. So, Jay, I saw that about an hour ago, you announced a new chief customer officer, Ray Perez, I guess.\n\nAnd I was looking at his background, is actually seems really similar to Roger Scott, right? So I'm just wondering yes, really similar. What's the rationale there?\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nYes. Yes, they know each other. This is a planned transition. So we feel really good about it.\n\nBasically, Roger stepping back, and we were looking for who would be good to step into it, and we're really excited about Ray. So yes, I think it's not some evolution of the team, and we're excited about what he adds.\n\nPatrick Walravens -- JMP Securities -- Analyst\n\nAll right. And then also, my follow-up is and lots of people have this issue. But with the stock having gone from the '90s to '22, that makes retention harder. What are you guys doing? What's your message to people? And is there anything you can do to offset sort of the pressure that comes from having the equity to do that?\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nYes. Well, I mean, look, it was a turbulent time for us to go public. There was a big run-up and then some fall-off. I think the employee base we have has been through a number of things that were difficult.\n\nAnd so we're kind of in it for the long haul. There's a huge opportunity here. People are excited about it. We did do some small things to try and help.\n\nSo Steffan talked about the fact that we kind of split the bonus payout, we felt like that was a cost-efficient way of trying to give people something a little earlier. So what would have been a payout in Q1, we split into two payments and gave the first one upfront so that it wasn't kind of cushion some of it. And I think that helps that was extremely well received.  So I think we're in a good state with our employees, and it's also gotten much easier to hire new people and grow because it's a more difficult economy. So I guess that's a silver lining in it.\n\nSteffan Tomlinson -- Chief Financial Officer\n\nThe other thing I'd tag on is, as you think about our demonstrated ability to deliver on our commitments. That is very important as all the employees, including everyone on this call, we all have goals and objectives that we're trying to accomplish each quarter and those get boiled up into how we guide the Street, how we execute, and the level of execution since we've been public has been a big bright spot for employees because people are delivering on their commitments in a very tough environment. And a lot of things are going on in the macro and the volatility in the stock market. There are some things that are outside of our control.\n\nBut what we can control is our execution, and that has been really stellar in a very volatile environment. And I think that is -- that provides some comfort to the employee base as well.\n\nPatrick Walravens -- JMP Securities -- Analyst\n\nYes. Couldn't have said it better.\n\nShane Xie\n\nAll right. That concludes today's earnings call. Thanks again, everyone, for joining us. We'll talk soon.\n\nTake care.\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nThank you all.\n\nDuration: 0 minutes\n\nShane Xie\n\nJay Kreps -- Co-Founder and Chief Executive Officer\n\nSteffan Tomlinson -- Chief Financial Officer\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nJason Ader -- William Blair and Company -- Analyst\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nNick Altmann -- Scotiabank -- Analyst\n\nRaimo Lenschow -- Barclays -- Analyst\n\nPatrick Walravens -- JMP Securities -- Analyst\n\nMore CFLT analysis\n\nAll earnings call transcripts"
}