{
  "companyName": "NXP Semiconductors",
  "companyTicker": "NXPI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/nxp-semiconductors-nxpi-q3-2022-earnings-call-tran/",
  "content": "NXP Semiconductors (NXPI -0.06%)\nQ3 2022 Earnings Call\nNov 01, 2022, 8:00 a.m. ET\n\nOperator\n\nHello. Thank you for standing by. And welcome to the NXP third quarter 2022 earnings conference call. [Operator instructions] I would now like to hand the conference over to your speaker today, Jeff Palmer, senior vice president of investor relations.\n\nPlease go ahead.\n\nJeff Palmer -- Senior Vice President, Investor Relations\n\nThank you, Josh. And good morning, everyone. Welcome to the NXP Semiconductors' third quarter 2022 earnings call. With me on the call today is Kurt Sievers, NXP's president and CEO; and Bill Betz, our CFO.\n\nThe call today is being recorded and will be available for replay from our corporate website. Today's call will include forward-looking statements that involve risks and uncertainties that could cause NXP's results to differ materially from management's current expectations. These risks and uncertainties include, but are not limited to, statements regarding the continued impact of the COVID-19 pandemic on our business, the macroeconomic impact on the specific end markets in which we operate, the sale of new and existing products, and our expectations for the financial results for the fourth quarter of 2022. Please be reminded that NXP undertakes no obligation to revise or update publicly any forward-looking statements.\n\nFor a full disclosure on forward-looking statements, please refer to our press release. Additionally, we will refer to certain non-GAAP financial measures, which are driven primarily by discrete events that management does not consider to be directly related to NXP's underlying core operating performance. Pursuant to Regulation G, NXP has provided reconciliations of the non-GAAP financial measures to the most directly comparable GAAP measures in our third quarter 2022 earnings press release, which will be furnished to the SEC on Form 8-K and be available on NXP's website in the investor relations section at nxp.com. Now, I'd like to turn the call over to Kurt.\n\nKurt Sievers -- President and Chief Executive Officer\n\nThank you, Jeff. And good morning, everyone. We appreciate you joining our call today. Now, let me begin with a review of our Quarter 3 performance.\n\nOur revenue was 20 million better than the midpoint of our guidance with performance in the mobile, automotive, and communication infrastructure markets all better than our expectations. For the consumer exposed IoT subset of the industrial and IoT market, we started to experience weaker sell-through in the channel. And let me remind you that our consumer IoT exposure is approximately 40% of the industrial and IoT segment revenue. It is made up of thousands of customers primarily in China and serviced through our distribution partners.\n\nTaken together, NXP delivered Quarter 3 revenue of 3.45 billion, an increase of 20% year on year. Our non-GAAP operating margin in Quarter 3 was a record 36.9%, 340 basis points better than the year-ago period and 80 basis points above the midpoint of our guidance. Our results reflect strong execution with solid profit fall-through on the incrementally higher revenue and better than guided operating leverage. Notwithstanding our results, which surpassed our guidance, we are facing a tricky demand environment.\n\nOn the one hand, the demand trends from automotive and core industrial customers are very resilient. And we continue to face supply constraints across multiple microcontroller and advanced analog products. And on the other hand, we see weakness in the broad consumer IoT and in the Android mobile market. Given that unbalanced dynamic of the demand environment, we are going to pull those levers that are in our control, namely stringent channel inventory management, and discipline and discretionary operating expense.\n\nIn terms of inventory, we have decided to take a Draconian approach to managing our distribution channel inventory. Specifically, our Quarter 4 guidance contemplates a channel inventory at the 1.6 months of supply level, which is in line with Quarter 3 and well below our long-term model. We prefer to keep any incremental inventory on our balance sheet, where we have the ability to control and redirect shipments as needed. And in terms of discretionary spending, among others, we are slowing the rate of hiring.\n\nAll in all, we believe these measures are a prudent approach until such time as we see a clearer and more consistent view of the demand environment. Now, let me turn to the specific trends in our focus end markets. In automotive, revenue in Q3 was 1.8 billion, up 24% year on year, near the high end of guidance. In industrial and IoT, revenue was 713 million, up 17% year on year, 32 million below our guidance.\n\nIn mobile, revenue was 410 million, up 19% year on year, 30 million better than our guidance. And lastly, communication infrastructure and other revenue was 518 million, up 14% year on year, slightly above our guidance. Now, let me look at key operating indicators relative to the noted demand dynamics, where we see the following. In terms of quoted product lead times, overall, we dropped to just below 70% of our portfolio with lead times that are greater than 52 weeks.\n\nThis metric was greater than 80% a quarter ago. While this is in aggregate an improvement from prior periods, we continue to be sold out through '23 in the automotive and core industrial end markets. In terms of our NCNR program, most of our automotive and core industrial customers continue to demand assured supply for 2023. Our 2023 NCNR order book continues to surpass our 2023 supply capability, as well as the level of NCNR orders which have been requested for 2022.\n\nAnd in terms of inventory, as noted previously, our Q4 guidance contemplates distribution channel at 1.6 months, well below our long-term target of 2.5 months. With respect to on-hand inventory at NXP, our DIO has increased five days sequentially to 99 days, and it will increase further. Given the application-specific nature of our product portfolio, we are comfortable with this direction. Now, let me turn to our expectations for Quarter 4.\n\nWe are guiding revenue at 3.3 billion, up about 9% versus the fourth quarter of 2021, within a range of up 5% to up 12% year on year. And from a sequential perspective, this represents a decline of about 4%, at the midpoint versus the prior quarter. At the midpoint, we anticipate the following trends in our business. Automotive is expected to be up in the high teens on a percent basis versus Quarter 4 2021 and flattish versus Quarter 3 2022.\n\nIndustrial and IoT is expected to be down in the low double-digit range on a percentage basis year on year and down in the high teens range versus Quarter 3 2022. Mobile is expected to be up in the low single-digit range year on year and down in the upper single-digit range versus quarter three 2022. And finally, communication infrastructure and other is expected to be up in the low teens range versus the same period a year ago and flattish on a sequential basis. Now, in summary, there is a real dichotomy in the various end markets that we serve.\n\nThe potential for some demand destruction in the consumer end markets that we noted as a concern last quarter has materialized. While we could ship more into the channel, we are taking a proactive stance to limit channel inventory buildup. And conversely, we are seeing very resilient customer demand in the automotive and core industrial segments, where demand continues to outpace supply, which hinders us from shipping to the true end demand. So, overall, we remain cautious in the near term due to the uncertainties in the macro environment.\n\nAnd with that, now I would like to pass the call over to you, Bill, for a review of our financial performance.\n\nBill Betz -- Chief Financial Officer\n\nThank you, Kurt. And good morning to everyone on today's call. As Kurt has already covered the drivers of the revenue during Q3 and provided our revenue outlook for Q4, I will move to the financial highlights. Overall, our Q3 financial performance was very good.\n\nRevenue was 20 million above the midpoint of our guidance range. And both non-GAAP gross profit and non-GAAP operating profit were above the midpoint of our guidance. Now, moving to the details of Q3, total revenue was 3.45 billion, up 20% year on year, notwithstanding weakness in the consumer-centric portion of the industrial and IoT segment. We generated 1.99 billion in non-GAAP gross profit and reported a non-GAAP gross margin of 58%, up 150 basis points year on year and both above the midpoint of guidance range as a result of higher factory utilization and higher sales volume.\n\nTotal non-GAAP operating expenses were 730 million, or 21.2%, up 73 million year on year and up 6 million from Q2, better than our guidance range and below our long-term model. From a total operating profit perspective, non-GAAP operating profit was 1.27 billion, and non-GAAP operating margin was 36.9%, up 340 basis points year on year and both above the midpoint of the guidance range. Non-GAAP interest expense was 91 million, with cash taxes for ongoing operations of 160 million or 13.6% effective cash tax rate. And non-controlling interest was about 12 million.\n\nStock-based compensation, which is not included in our non-GAAP earnings, was 89 million. Now, I would like to turn to the changes in our cash and debt. Our total debt at the end of Q3 was 11.16 billion, flat sequentially. Our ending cash position was 3.76 billion, up 214 million sequentially, thanks to improved operating performance.\n\nThe resulting net debt was 7.40 billion. And we exited the quarter with a trailing 12-month adjusted EBITDA of 5.3 billion. Our ratio of net debt to trailing 12-month adjusted EBITDA at the end of Q3 was 1.4 times. And our 12-month adjusted EBITDA interest coverage was 13.8 times.\n\nTurning to working capital metrics, days of inventory was 99 days, an increase of five days sequentially, as we continue to experience incrementally improved supply trends. The increase in on-hand inventory was evenly split between raw materials and work in process to support revenue growth in subsequent periods and an increase in finished goods due to the noted weakness in the Android mobile market and the consumer-centric portion of industrial and IoT. As Kurt mentioned, we continue to tightly manage our channel inventory. Inventory in the channel was 1.6 months and continues to be well below our long-term target.\n\nDays receivable were 27 days, flat sequentially. And days payable were 96, an increase of two days versus the prior quarter. Taken together, our cash conversion cycle was 30 days. Our working capital management, balance sheet, and channel metrics continue to be very strong and well managed.\n\nCash flow from operations was 1.14 billion, and net capex was 281 million or 8.2% of revenue, resulting in a non-GAAP free cash flow of 863 million or 25% of revenue. During Q3, we paid 223 million in cash dividends, and we repurchased 400 million of NXP shares. In addition, since the beginning of Q4 through October 28, we purchased an additional 260 million of shares under established 10b5-1 program. On a trailing 12-month basis through the end of Q3, we have returned 98% of our non-GAAP free cash flow back to the owners of the company, consistent with our capital allocation strategy.\n\nThe cash flow generation of the business continues to be excellent. Now, turning to our expectations for Q4. As Kurt mentioned, we anticipate revenue to be about 3.3 billion, plus or minus about 100 million. At the midpoint, this is up 9% year on year and down 4% sequentially.\n\nWe expect non-GAAP gross margin to be about 57.8%, plus or minus 50 basis points. Operating expenses are expected to be around 720 million, plus or minus about 10 million, which is down about 1% sequentially, driven by lower incentive compensation and discretionary spending. Taken together, we see non-GAAP operating margin to be 36% at the midpoint. We estimate non-GAAP financial expense to be about 81 million, driven by higher interest income.\n\nAnd we anticipate cash tax related to ongoing operations to be about 140 million or about a 13% effective cash tax rate, which is below our communicated model, leading to a full year effective tax rate of 13%. Non-controlling interest should be about 12 million. And for Q4, we suggest for modeling purposes, you use an average share count of 262 million shares. For capex, we suggest you use 8%, bringing total year capex to 8% versus our prior expectations of 10% due to delays in equipment deliveries.\n\nFinally, I have an update to our reported financials, beginning with our guidance for Q1 2023. We will begin to apply an estimated annual tax rate to our GAAP and, thus, our non-GAAP profit before tax. This change will enable NXP to report a non-GAAP earnings per share on a go-forward basis, consistent with SEC guidelines. Given current tax legislation, we believe our new estimated tax rate will be consistent with our long-term cash tax rate of 18%, as provided at our analyst day in November of 2021.\n\nOverall, despite the uncertain macroeconomic conditions which are impacting some of our more consumer-oriented markets, as Kurt mentioned, we will navigate what is in our control, such as channel inventory and discretionary spending. Furthermore, over the foreseeable future, we will continue to operate within our long-term financial model. Thank you. And we now can turn the call back over to the operator for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Ross Seymore with Deutsche Bank. You may proceed.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nHi, guys. Thanks for letting me ask the question. Kurt, I wanted to ask about the inventory side of the equation, both on the channel and on your balance sheet. On the channel side of things, you guys are, like you said, well below target, about 1.6 months, well below where you were at similar points where people were worried about us being at a peak cycle.\n\nSo, I guess the question is, could you ship more into the channel if you wanted to? And what's led to the philosophical shift to significantly lessen the channel and more on your balance sheet, as in prior cycles, it seems to be the opposite prioritization?\n\nKurt Sievers -- President and Chief Executive Officer\n\nYeah, good morning. And thanks, Ross. Yes, the answer is a blunt yes. We could have shipped more into the channel against open orders actually in this fourth quarter and that especially into the consumer IoT part of our segments.\n\nBut as I mentioned, given the whole macroeconomic uncertainty, we just feel it is a much more prudent approach to actually limit this channel inventory at this very low level of 1.6 months and mind you that the delta to 2.5 months in terms of revenue would be about 500 million. And that's the level of open orders, which we would easily have, which we could serve. But we think it's more prudent because it's unclear how the macro is going to further develop and how the demand in that part of the market is going to develop. So, we feel it's a better idea to keep what we have already in the pipeline to keep in-house and on the balance sheet, also for eventually being in a position to redirect it to other customers.\n\nNow, that's the one side of the house. I just have to also remind you that at the same time, Ross, we have this real situation that in the auto and core industrial side of the house, we have the opposite situation. We do not have enough supply, so we continue to be sold out. And also that we could actually -- if only we have the supply, we could make more revenue in Quarter 4.\n\nWe have a lot of open orders, which are very real. We checked all of them but can't really serve them. But again, back to your initial question, yes, we could sell more. But we found it is much more wise to stick to this very low channel inventory of 1.6 months at this time.\n\nIt's not a long-term target, though. But at this particular period in the cycle, we feel it's the best thing we should do.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nThanks for that color. I guess as my follow-up, one is for Bill on the gross margin side of things. I'm impressed that the gross margin is staying flat, maybe surprised would be the word more than impressed, given that the revenues are dropping 4% or so. Your predecessor had a very rough rule of thumb at a 5% drop in revenue with a 1% drop in gross margin.\n\nSo, how are you able to keep that flat? And what's the sustainability of that ability to keep the gross margin at this general level?\n\nBill Betz -- Chief Financial Officer\n\nYes. Thanks, Ross, for your question. And you're right, we did slightly better than our guidance, driven by the higher revenues and fall-through. One area, I think, we need to understand a little bit better is that our internal utilizations remain in the high 90s, as we are still well constrained, and specifically in our auto.\n\nAnd if you think about internally, more than two-thirds of our capacity is just pinpointed to our IP proprietary mixed-signal, auto-centric capacity internally. And we are constrained. As you heard Kurt mention, we are sold out, and we expect this to be well-utilized all throughout 2023. Second, as mentioned on previous calls, you're right.\n\nWe mentioned we'd stay in a tight range, delivering toward our high-end model. And I think we've demonstrated that, and it's incorporated in our Q4 guide. And more longer term, what gets us to 58% is really those new product introductions, which are further out in the journey, I would say.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nThank you.\n\nKurt Sievers -- President and Chief Executive Officer\n\nThanks, Ross.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from C.J. Muse with Evercore.\n\nYou may proceed.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nYeah, good morning. Thank you for taking the question. I guess, the follow-on on Ross's question, I guess, you know, can you comment on the ability at all to repurpose wafers capacity? My sense is, internal versus external, the answer is no. And then as part of that, before, you know, coming to the recovery, you had a gross margin construct, I think, of every 5% change in top line, 100 bps growth in gross margins.\n\nNow that, you know, you see a clear mix shift here in terms of auto, core industrial holding strong, yet consumer weaker, is there kind of a thought process or model we should be thinking about on the gross margin side as we push forward into some sort of further correction on the consumer side?\n\nKurt Sievers -- President and Chief Executive Officer\n\nHey, C.J. Good morning. Let me first go at the repurposing or the potential for repurposing of capacity. So, first of all, yes, I can confirm directionally that indeed repurposing between internal and external is very limited.\n\nI mean, that's really how we've built our supply strategy. When you then think about within internal and within external, repurposing between the different segments which we serve, and that's now specifically between the more consumer-oriented versus the more auto or core industrial-oriented markets, to a limited level, it is possible. It is typically not at all possible on a finished product level. So, once the product is completely manufactured, and sometimes program, we have hardly any products which are swappable.\n\nHowever, if you still speak about buyback, inventory for example, we do have the opportunity with several process nodes to actually swap between those markets, but not with all of them. I'll give you one example, which is quite sizable for us. We have a lot of product going in 55 nanometers with embedded nonvolatile memory. That, for example, is very, very purely automotive, which means we are sold out.\n\nWe are short in that technology. But that same technology is also not used for any of the consumer applications. So, the demand drop in consumer doesn't really help us there. However, there is other technologies, like 90 nanometers or 180 nanometers, where we can do this if the product is not yet finished goods.\n\nSo, it's a bit of an in between, but we have some liberty here. And that is also the reason why, among others, for example in parts of our comm infra market in Q4, we start to see acceleration in our revenues because we actually could swap some of our existing capacity into those markets, like the e-government markets or RFID markets, which were super constrained over the past eight quarters. On the margin side, I'd say there is quite some variation of margin within each of the segments. So, you cannot easily draw conclusions between the four revenue segments, what their mix is and what it means to the end margin of the company.\n\nIt is more sophisticated, to be fair. Bill, I'm not sure if you want to go a little bit deeper. But in the end, you cannot draw conclusions on the level of the total segments.\n\nBill Betz -- Chief Financial Officer\n\nNo, nothing else to add.\n\nJeff Palmer -- Senior Vice President, Investor Relations\n\nC.J., did you have a follow-up?\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nYes. Thanks, guys. Just a quick follow-up. The China IoT piece, you know, I would have thought that that would have shown weakness earlier.\n\nSo, I guess, are there particular kind of sub end markets that have proven, you know, to be more resilient, at least until today, that's kind of enabled that to hold up? Or kind of can you give us a little more color on how to think about the key drivers within that bucket?\n\nKurt Sievers -- President and Chief Executive Officer\n\nYeah. It really started in, I'd say, August and then going into October to quite significantly drop. But again, of course, our approach to stick to the 1.6 level of month of channel inventory gives this a different color, C.J. I mean, you know, in former days, honestly, we would just have kept shipping.\n\nSo, we it would have felt like, oh, finally, we get the channel inventory up. Now, it's very much our choice that we said we don't want to do this. And that's why it sees quite a harsh decline. But again, as I explained earlier, we think that's the better way to do it.\n\nBut again, it started in August time frame. I would say, it's the consumer IoT market globally which is softening. It's just such that we have a relatively sizable exposure to China. But it's not that the non-Chinese consumer IoT customers would be still very resilient.\n\nI think this is globally weakening, but it hits us harder from a China perspective. And this is also where we have a very large channel exposure, which is why this general approach, which I explained earlier, I think, makes a significant difference in how we want to deal with it.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nVery helpful. Thank you.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Vivek Arya with Bank of America. You may proceed.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nThanks for taking my question. Kurt, for my first one, I'm curious to get your perspective on just the supply demand equation in the automotive industry at your OEM and Tier 1 customers. Do you think they're still undersupplied or oversupplied or just kind of rightly supplied? And just what are the hotspots of over or undersupply right now? And just how is your visibility of growth into the first half of next year? I think you've added Q4 flattish, which, I assume, is more a supply, you know, variable. But just what's your perspective into the supply demand balance at your auto customers right now?\n\nKurt Sievers -- President and Chief Executive Officer\n\nYeah. Thanks, Vivek. First of all, let me just indeed unfortunately confirm that the sequential flat in auto into Q4 is purely a function of supply. I wish it was different, but it is a straight function of supply.\n\nNow, it still has a nice year-on-year growth, by the way, but the sequential is a supply limitation. In general, many microcontrollers, if not all, in our portfolio and the large part of the analog products, which we have, continue to be significantly supply constrained in automotive. And that is after a very careful and very thorough analysis of the demand in this whole web from the OEMs through to Tier 1. So, I think we have more transparent and more detailed discussions than ever before in trying to understand that.\n\nAnd it really shows also, given the NCNR order level, which we are getting in automotive for all of last year, that those constraints will continue to be in place through a large part of next year, depending, of course, on how the supply possibly further improves above the visibility we have today. But with our current supply visibility, we will continue to be sold out in the automotive market through next year. If you'd ask me how much was the gap to true demand, probably it is in the order of -- that we have a supply coverage of 85% next year in automotive and core industrial versus true demand. Now, there is still this golden screw problem, so I don't want to take this off the table.\n\nSo, sometimes one component is indeed missing from us or from another peer in the market, and then it takes a few weeks until stuff is being flushed through. But that doesn't take away that there is overall shortage in the key microcontrollers and analog products.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nGot it. So, my follow-up, you know, you continue to build inventory on your balance sheet. And when I couple that with the fact that, you know, you mentioned you're sold out in automotive and core industrial, that's almost two-thirds of your business, so is it fair to assume that you're planning for next year -- I know you're not giving '23 guidance, but are you planning for next year sales to be at least flattish, you know, year on year with auto and core industrial growth offsetting any weakness on the consumer side? Or is that stretching right too much the conclusion from combining the fact that you still continue to build inventory and your auto and core industrial demand is sold out for next year?\n\nBill Betz -- Chief Financial Officer\n\nHey, Vivek. This is Bill. Let me take this one. First off, we're not guiding 2023.\n\nBut let me go into the internal inventory and try to summarize for everyone. Yes, we've increased five days, which is about 50% raw material and work in process. And the remainder was in finished goods from a quarter-over-quarter perspective. Clearly, as Kurt mentioned, a portion of these finished goods was driven primarily by NXP preventing inventory buildup in the channel as we reroute this material to other customers in need, where some of it is fungible and some of it is not.\n\nAreas where we have higher consumer or mobile inventory levels, we hold the wafers in die bank, as Kurt mentioned, before completing assembly and test in our back-end facilities. At the same time, we remain highly constrained in the wafer areas of 28, 40, 55, 65, and 90 in our auto and core industrial segments. And again, as we mentioned in both our opening remarks, it's better to keep control of your own inventory than putting it into the channel, which will just create future issues if demand falls. And again, majority of what we build is very application specific and long-lived, which gives us confidence to hold and be ready to service future demand.\n\nKurt Sievers -- President and Chief Executive Officer\n\nAnd thanks, Bill. Let me maybe just add that one view on next year when it comes to automotive since you were asking earlier. We see no reason why the strong trend of content increase following, among others, electrification and ADAS would break. I think every quarter, we look at the ratio of electric cars of the total SAAR.\n\nIt's higher than in the quarter before. For this year, we see now 27% of the total SAAR being ex-EVs. And for next year, it's forecasted to be 34%. And you know what that means for the semiconductor content in a car.\n\nSo, from that perspective, I think there is, from a demand view, certainly good reason to believe that it continues to be a very strong and very resilient market. While at the same time, the extended supply chain in our view continues to be underfilled. It is still actually dysfunctional because it is still too low level. So, those two perspectives should maybe add to a pretty healthy view from an automotive demand perspective on 2023.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Stacy Rasgon with Bernstein Research. You may proceed.\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nHi, guys. Thanks for taking my questions. The first one, I get the issues in consumer and mobile. Those seem to be in the numbers now at this point.\n\nBut auto and industrial look really resilient. You're sold out. You've got these NCNRs. I guess, why do you sound so worried given that long-term support in those core markets and presumably given how sustainable it is? Like, are you seeing any signs at all of weakness, even small signs, any tiny upticks in cancellations or anything like that in those core markets?\n\nKurt Sievers -- President and Chief Executive Officer\n\nStacy, we have no cancellations or push-outs in auto or core industrial. At the same time, I don't have a crystal ball, and I don't want to take a position here to be the economic schedule is for the macro for next year. But -- so this -- also this guidance here is based on the orders and the supply capability which we have at hand for Quarter 4. But I can absolutely confirm no push-outs, no cancellations in core industrial and auto.\n\nAnd, you know, the one indicator which gives maybe a somewhat better feel on the longer term is the level of inventory sitting in the extended supply chains in those two markets. And from anything we can check and see there, that level continues to be super low. And that's why we continue to believe it should stay very resilient.\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nGot it. Thank you. For my follow-up question, I wanted to, again, I guess, dig in on the channel inventories. So, a lot of the consumer stuff which is weak goes to the channel.\n\nIt sounds like you're not shipping that into the channel, but the channel inventories are still flat. So, are you shipping other stuff into the channel that's making up for it? Like how is the mix, I guess, of end markets within that channel changing as the consumer stuff is weakening?\n\nKurt Sievers -- President and Chief Executive Officer\n\nWe will not speak about the mix because then it really becomes complicated. But it is not that we do not ship at all in the channel. We ship into the channel to keep a steady level of 1.6 months of inventory. So, it's not to say that this is so dramatic that we have to stop all shipments.\n\nThat's not how it works. We just -- we are very disciplined. Bill and I are actually sitting every week, and we look at the sell-through and sell-in data with each of our distribution partners by segment. And then, we make sure every week.\n\nIt's not only at the end of the quarter, that's through the quarter, that it doesn't surpass the 1.6. The change we wanted to communicate today is only that, so far, honestly, for eight quarters in a row, I was desperate to get it up. I mean, I would have wished we could have shipped more into it in order to have a higher channel inventory. Now, given those consumer trends, we are actually more disciplined to make sure it doesn't go higher, especially in those parts where actual demand is -- but it doesn't mean there is zero shipments.\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nI understand that. I guess what I'm asking is, is it fair to say, even if you don't want to go to the mix, the detailed mix, that the consumer mix within the channel is lower and mix of other stuff is higher now versus maybe a couple of quarters ago?\n\nKurt Sievers -- President and Chief Executive Officer\n\nNo.\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nNo? OK.\n\nKurt Sievers -- President and Chief Executive Officer\n\nI'm not sure why you think it should be. No, it is not.\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nWell, I mean, if the consumer stuff is so much weaker, you said it's 40% of your industrial business. And a lot of it goes through the channel. And clearly, demand there is weakening.\n\nKurt Sievers -- President and Chief Executive Officer\n\nWell --\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nAnd it sounds like they're limiting shipments of that stuff into the channel. That's all. But the total inventories look the same.\n\nKurt Sievers -- President and Chief Executive Officer\n\nYeah, Stacy, we are limiting shipments. But I mean I think about it this way. The industrial IoT segment is 18% of the total revenue of the company. And 40% of that is the consumer IoT, and that's still not at a zero shipment level.\n\nSo, it is not that dramatic from a change perspective.\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nGot it. OK. That's helpful. Thank you, guys.\n\nAppreciate it.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from William Stein with Truist. You may proceed.\n\nWilliam Stein -- Truist Securities -- Analyst\n\nSorry, I was muted. Thanks for taking my question. I'm hoping you might have some discussion in terms of the difference in demand levels and lead times and your level of constraints between automotive on the one hand and industrial on the other. I think in prior quarters, you've noted that industrial is even more constrained than automotive because it doesn't quite get the same level of attention.\n\nCan you update us on that dynamic, please?\n\nKurt Sievers -- President and Chief Executive Officer\n\nWe really don't have it broken down that way, but, Bill, still the key shortages in the core industrial are indeed continuing to be highly escalated and quite painful. So, I think I can repeat the statement I made earlier that while there continues to be a lot of public reports about the shortages in auto and much less noise about industrial, in our case, in the core industrial, we continue to be as short as we used to be before.I said it earlier, I think, in the context of a different question. Say, for the next couple of quarters, I think about four or five quarters, we believe after risk adjusting our demand, we should have about 85% coverage against -- that used to be 80%. So, you see we are five percentage points higher, but that is not necessarily because the supply capability in auto or industrial has gone up so much, it is just that the consumer IoT demand on the other side or for the total company has dropped such that, in aggregate, for the total, we come up to 85%.\n\nBut it continues to be equally painful in auto and industrial than it used to be.\n\nWilliam Stein -- Truist Securities -- Analyst\n\nAppreciate that. As a follow-up, I'd like to linger on this small pivot you're making in terms of the way you're dealing with the channel in your inventory. And I wonder if the company has evaluated potentially moving to a consignment oriented model, which would allow you to make even more control. There's only one company that I'm aware of that has perceived that in a big way this sort of an outlier in terms of how to deal with distribution.\n\nBut I wonder if that's a growing thought given your approach that you're discussing today. Thank you.\n\nKurt Sievers -- President and Chief Executive Officer\n\nOK. Thanks, Bill. But the quick answer, no, we are not contemplating that.\n\nWilliam Stein -- Truist Securities -- Analyst\n\nOK. Thanks.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Gary Mobley with Wells Fargo. You may proceed.\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nHey, guys. Thanks for taking my question. I wanted to talk about one of your smaller businesses for a second, and that is the mobile side of the business. You highlighted what sounds like 8% upside to your Q3 revenue forecast for that particular business.\n\nAnd we step back and look at the full year. Based on your Q4 guide, you're going to grow that business by close to 10%, which is counterintuitive given some of the weak mobile handset-related data points. So, what's helping you outperform there? Is it content growth, or is it inventory channel-related?\n\nKurt Sievers -- President and Chief Executive Officer\n\nIt's got nothing to do with channel or inventory because we put the same discipline on all segments. No, it has to do with our strategy, which is really on content growth. Think about the mobile wallet. Think about the kicking in ultrawide bands.\n\nAnd we also have, I'd say, directionally -- it's not black and white, but we have a bias to higher-end mobile phone market, which comparably is doing better this year than the very low-end Android. So, I'd say, therefore, two answers. Our company-specific content increase in share gains are working out. I mean, that is very much in line with how we put it a year ago at our investor day.\n\nAnd secondly, you might say we are in a good position because we are somewhat more exposed to the higher end rather than the feature phones, with the Android phones.\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nThanks for that. As my follow-up, I want to ask about the latest US export restrictions. My hunch is you're not so much directly impacted from these US export restrictions. But I guess, indirectly, you know, can you speak to how it may result in some kitting issues in certain end markets and/or, you know, whether it requires you to change your manufacturing footprint?\n\nKurt Sievers -- President and Chief Executive Officer\n\nYeah. So, first of all, of course, at all times, we will 100% make sure that we are in total compliance with any export control regulations. And so we are also after these latest changes. All of our assessment so far of these latest changes in the regulations show that, if anything, we have super immaterial impact on our revenues.\n\nWhen it comes to second or third order effect, which you were hinting to, also there, I must admit we haven't really found anything, which looks like being an issue for us. But, of course, we keep researching it. But at this point, I can only say no. If anything, only super immaterial impact.\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nThanks, Kurt.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Matt Ramsay with Cowen. You may proceed.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nGood morning. Thank you very much. Kurt, for my first question, you were very clear about the trends in your automotive business, and the business continues to do quite well. And I think, to an earlier question, you mentioned that sort of on a quarterly basis, the SAAR numbers and the L2, L3 penetration numbers of ADAS continue to kind of go higher in your own estimates.\n\nBut how do you guys made any changes to those kind of mix and content assumptions in the next year or two just based on interest rates? I think a lot of us externally saw some of the data out of CarMax and some other sources and the auto. New car purchases are obviously financed pretty heavily. So, is there any assumption that might have changed recently in your forecasting based on some of the interest rates? That would be interesting. Thanks.\n\nKurt Sievers -- President and Chief Executive Officer\n\nYeah, Matt. So, we -- I give you here two answers. The one is the short term. So, when it comes to the guidance for Q4, it's really based on orders at hand.\n\nI mean we don't -- it helps a bit down, but we don't make these strategic considerations for the next three months. This is really about orders and supply capability. Longer term, say, next year, again, I don't want to say I have the crystal ball. So, we use IHS typically for the SAAR, which I think just updated their forecast for next year for a 4% SAAR growth to, I believe, something like 85 million units.\n\nHowever, it really isn't that important at all. What really matters is the content increase, which has a lot to do with the mix to e-vehicles, premium vehicles, and other features kicking in. So, I think the whole discussion around interest rates and recessions looming left and right. I agree with you that it could have impact on the demand behavior of people buying cars.\n\nBut unless that drops incredibly far down, I believe that the content -- semiconductor content per car is actually trumping the moves on the SAAR itself. And that is, for us, much more relevant. But again, I mean, we don't guide next year. I don't know what it is going to be, but we really should more and more start to look at this as a semiconductor company and industry from a content perspective rather than a unit perspective in automotive.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nNo. Thanks for that. I realized it's a tough big-picture question. But it's the one that we're getting.\n\nAs my follow-up, I wanted to ask, in the automotive sector, you guys obviously have a strong position in BMS, so managing the battery. But there's sort of two sides to managing the battery. There's actually running the car, and then there's the charging side and lots of conversation on why, one, in [Inaudible] and what it means for on-board fast chargers. And I wonder, as a full BMS solution managing the charging and the discharge of the battery, is that something that you guys are looking into, not the manufacturer or anything applied against [Inaudible], but buying it from someone else and doing a fully integrated both sides of the battery type solution? Any thoughts there would be helpful.\n\nReally appreciate it.\n\nKurt Sievers -- President and Chief Executive Officer\n\nWell, actually, we not only look at it, but we work the system end to end. So, we are also very busy with companies building and providing the charging infrastructure. I think we have revealed earlier, so I may use the name. We work closely with ChargePoint, for example, in the U.S.\n\nAnd that is not only on the charging, but that even includes payment to make this a very seamless process for the consumer. So, our payment and identification and security technologies are also being included in this. So, yes, we look at it at a -- from a total end-to-end basis. However, I have to say this still means we are not going into discrete power.\n\nSo, whenever these systems and wherever they need discrete power solutions, so like silicon carbide. This is not our focus. Our focus remains on the advanced analog and logic products, which we think is about 50% of that opportunity.\n\nJeff Palmer -- Senior Vice President, Investor Relations\n\nJosh, we'll take the next question, please.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Joseph Moore with Morgan Stanley. You may proceed.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nGreat. Thank you. I know last quarter you guys have talked about the desire of the automotive companies to build up safety stock at the Tier 1 level. I think you talked about six months.\n\nYou know, where are they in that process? I mean, it definitely sounds like things are still pretty tight. But is there any indication that they're able to put any of that inventory into place?\n\nKurt Sievers -- President and Chief Executive Officer\n\nYeah. Indeed. That is strategic requirement, which, in many cases, OEMs are and have been putting on Tier 1s. My guess is -- it's very hard to get the full picture of this, but my guess is that in some few cases, they start to be able to start building somewhat on a lot of those core products which are plaguing us and others.\n\nFrom a sheer built performance perspective, they are very, very far from achieving anything in this. Because, again, even before that would happen, the whole supply chain -- the whole extended supply chain needs to build a higher inventory level. That's not just in one company, but it's just that the whole trade becomes more functional. So, I would say, given the end demand trends and how I would judge the supply capability of us and the industry, this will take all of next year still before we come even close to that requirement.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nThank you. One moment --\n\nJeff Palmer -- Senior Vice President, Investor Relations\n\nJoe, did you have a -- Joe, did you have a follow-up, or is that it?\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nNo, I'm good, Jeff. Thank you.\n\nJeff Palmer -- Senior Vice President, Investor Relations\n\nThis will probably be our last question. Operator?\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Toshiya Hari with Goldman Sachs. You may proceed.\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nHi. Good morning. Thanks so much for squeezing me in. I have two questions.\n\nFirst one is on pricing. I think if we take the midpoint of your Q4 revenue guidance, you're going to be growing around 19% for the full year. I think you gave really good color last quarter on how significant the tailwind is from pricing. If we can get an update on 2022 pricing, that would be great.\n\nAnd then, you know, your preliminary thoughts into 2023, again, from a pricing perspective particularly given, I think, the intent on your foundry supplier to raise pricing next year as well.\n\nKurt Sievers -- President and Chief Executive Officer\n\nYeah, Toshiya, so as a good practice, as we've done for last year, we will provide the full year pricing impact for calendar year 2022 in Quarter 1 of 2023. It's still very, very dynamic, I would almost say, day in, day out. So, we will give you and provide you the aggregate pricing impact on our revenue growth for this year in Q1 of next year. From an overall dynamic perspective, we continue to see quite sizable input cost decreases to us.\n\nThat is from the foundry partners, but there's also a lot of other inflationary cost increases. And, of course, we absolutely walk the talk that we stick to our strategy to pass on those input cost increases to our customers to exactly that level that we can protect our gross profit percentage. And seeing how the supply demand imbalance in our core markets is moving into next year, I guess, it is reasonable to assume that we will continue to raise prices also next year. We are now so much to the end of 2022 that I think it's fair to say it's highly likely that we will also continue next year's prices, just following those input cost increases.\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nThat's helpful. Thank you.\n\nKurt Sievers -- President and Chief Executive Officer\n\nI can say --\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nSorry.\n\nKurt Sievers -- President and Chief Executive Officer\n\nYeah. No, go ahead.\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nSorry about that. As my follow-up, just on how you're thinking about utilization rates and capex going forward. You know, Bill, you talked about utilization rates being in the high 90s, given your comment on inventory growing in the quarter. My guess is you're keeping utilization rates to where they are, but just wanted to clarify that.\n\nAnd then on capex, you mentioned you've had equipment delivery delays. Should we expect capex to be elevated into 2023? Or is it a little bit premature to say at this point? Thanks so much.\n\nKurt Sievers -- President and Chief Executive Officer\n\nSo, let me quickly take the utilization, and Bill is going to speak about capex. On the utilization, yes, we will stay very, very highly utilized because, as Bill put it earlier, the majority of our internal front-end factories are working for automotive and core industrial. So, that's exactly there where we see the strong demand continuing, and that's why the utilization rates there will stay very high. Bill, over to you for capex.\n\nBill Betz -- Chief Financial Officer\n\nYes. Related to the capex, as I mentioned, we will do better this year, 10% going to 8%. And next year, we will be in the range between 6% and 8%.\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nThanks so much.\n\nKurt Sievers -- President and Chief Executive Officer\n\nYeah. I guess that gets us to the end of the call. So, in summary, I would say, we are cautious in the near term, given all the macro uncertainty. However, under the surface, we see what I call the dichotomy, which is really a very disciplined approach to a weakening consumer IoT market, where we want to stay ahead of the game and not trap the channel while, at the very same time, we continue to be supply constrained quite significantly in our core industrial and automotive markets, where we try to do everything in-house and with our foundry partners to get the supply the soonest in line with the pretty resilient demand signals, which we are having.\n\nAnd that sets it for the call today. Thank you, all, very much. Thank you.\n\nJeff Palmer -- Senior Vice President, Investor Relations\n\nThank you, Josh. Appreciate everybody's attendance. That concludes the call today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJeff Palmer -- Senior Vice President, Investor Relations\n\nKurt Sievers -- President and Chief Executive Officer\n\nBill Betz -- Chief Financial Officer\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nWilliam Stein -- Truist Securities -- Analyst\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nMore NXPI analysis\n\nAll earnings call transcripts"
}