{
  "companyName": "American International Group",
  "companyTicker": "AIG",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/american-international-group-aig-q2-2022-earnings/",
  "content": "American International Group (AIG -0.61%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and welcome to AIG's second quarter 2022 financial results conference call. This conference is being recorded. Now at this time, I would like to turn the conference over to Quentin McMillan. Please go ahead.\n\nQuentin McMillan -- Head of Investor Relations\n\nThanks very much, and good morning. Today's remarks may include forward-looking statements, which are subject to risks and uncertainties. These statements are not guarantees of future performance or events and are based on management's current expectations. AIG's filings with the SEC, including our annual report on Form 10-K and quarterly reports on Form 10-Q, provide details on important factors that could cause actual results or events to differ materially.\n\nExcept as required by the applicable securities laws, AIG is under no obligation to update any forward-looking statements if circumstances or management's estimates or opinions should change. Additionally, today's remarks may refer to non-GAAP financial measures. The reconciliation of such measures to the most comparable GAAP figures is included in our earnings release, financial supplement, and earnings presentation, all of which are available on our website at www.aig.com. With that, I'd now like to turn the call over to our chairman and CEO, Peter Zaffino.\n\nPeter Zaffino -- President and Chief Executive Officer\n\nGood morning, and thank you for joining us to review our second quarter results. AIG had an excellent quarter with strong momentum continuing across all of our strategic, financial, and operational objectives. I could not be more pleased with the exceptional results in general insurance. And life and retirement again delivered good results despite very challenging equity market conditions, significant volatility, and other headwinds.\n\nAs you saw in our press release, adjusted after-tax net income per diluted common share was $1.19. General insurance achieved a calendar year combined ratio of 87.4%, the first sub-90 quarter and best result this business has achieved in over 15 years. The accident year combined ratio, excluding CATs, was 88.5%, a 260 basis point improvement year over year and the 16th consecutive quarter of improvement. And the accident year combined ratio, excluding CATs, in global commercial was 85.3%, an improvement of 400 basis points year over year.\n\nConsistent with our strategy to manage volatility, catastrophe losses were very modest in the quarter, coming in at $121 million or 1.8% of a combined ratio. Life and retirement has strong fixed annuity sales with over $1.3 billion in deposits for the second straight quarter, which benefited from the origination capabilities of Blackstone. AIG returned nearly $2 billion to shareholders in the second quarter through $1.7 billion of common stock repurchases and $256 million of dividends. In addition, we are on track to buy back at least $1 billion of common stock in the third quarter.\n\nWe ended the second quarter with $5.6 billion of parent liquidity, which Shane will go through in more detail in his remarks. On today's call, I will provide more detail on five topics. First, I will provide an update on the IPO of our life and retirement business, which will be known as Corebridge Financial once the company is public, and discuss why we chose not to proceed with the IPO in the second quarter. I will also review the significant progress we've continued to make on various aspects of the separation of Corebridge as we prepare this business to be a stand-alone public company.\n\nSecond, as a follow-on to the IPO discussion, I will review life and retirement results where, as I mentioned, the core business showed continued resilience and solid performance despite headwinds largely driven from a reduction in net investment income. Third, I will review the performance of general insurance, where underwriting excellence continues to produce outstanding results with strong profitability and top-line growth, particularly in our global commercial portfolio. Fourth, I will provide an update on AIG 200, where we achieved critical milestones and delivered on our stated goal of $1 billion in exit run rate savings six months ahead of schedule. Lastly, I'll provide an update on capital management, particularly with respect to stock buybacks and debt reduction.\n\nFollowing my remarks, Shane will provide more detail on the quarter and then we will take questions. Mark Lyons, David McElroy, and Kevin Hogan will join us for the Q&A portion of today's call. As you can see, our team has accomplished a lot on many fronts. Before expanding on our financial and operating performance, I want to address the status of the Corebridge IPO.\n\nOur base case had always been to complete the IPO in the second quarter, subject to regulatory approvals and market conditions. In deciding whether to launch the initial public offering in May or June, we weighed several variables, which were all market-related, some specific to Corebridge and some more macro level. These included equity market conditions and particularly the trading values of companies in the life and retirement sector that we consider to be the most comparable to Corebridge. In the second quarter, equity markets were down 16% with only three weeks seeing positive market returns, the VIX, which was above 30 resulting in extremely elevated market volatility and feedback we received from advisors, analysts, and many potential institutional investors following the public filing of the S-1.\n\nWhile completing the IPO is a significant priority for us and something we are laser-focused on, we believe this is an attractive business and did not want to execute a transaction that would be detrimental to stakeholders in the long run. Absent something we don't see today, we remain ready to execute on the IPO, subject to regulatory approvals and market conditions. And the next window will be in September. In the meantime, throughout the summer, we continue to make significant progress to position the business for long-term success.\n\nI'll highlight three areas of focus. One, expanding on our plan to achieve expense savings at Corebridge. Last quarter, we estimated these savings to be in the range of $200 million to $300 million, but we now expect to generate closer to $400 million of savings over the next three years with the majority of the run rate savings to be achieved in the next 24 months. Two, progressing the implementation of a new operating model for our investments unit.\n\nThis includes our strategic partnership with Blackstone announced in July of 2021 and our partnership with BlackRock, where we began moving assets under management in the second quarter of this year pursuant to the arrangement we announced in late March. And three, planning our transition to BlackRock's Aladdin platform, which will replace aging and end-of-life technology infrastructure and provide enhanced risk analytics and reporting. We continue to expect that Corebridge will pay an annual dividend of $600 million post-IPO that will have a payout ratio of 60% to 65%, and that it will achieve a return on equity of 12% to 14% over the next 24 months. Now turning to life and retirement's performance in the second quarter.\n\nAs I mentioned earlier, adjusted pre-tax income was $563 million, decreasing from the prior-year period due to lower NII, which was driven by lower alternative investment income, accelerated DAC amortization, and an increase in SOP reserves. Given the pending IPO, we remain somewhat limited in what we can say about the business, but let me provide some details from the second quarter. The core business produced strong sales in fixed annuities, which were up 48% to $1.4 billion, and strong sales in indexed annuities, which were flat at $1.5 billion. In group retirement, contributions grew 1%, nonrecurring deposits grew 4% and enrollments were up 11%.\n\nSecond quarter deposits of $1.8 billion were strong with base net investment spread growing 4 basis points sequentially due to the higher interest rate environment. The life and retirement balance sheet and capital position remains strong with an RBC ratio of 415% to 425%, still above our target ranges. Now let me provide more detail on our second quarter results in general insurance, where we continue to drive improved financial performance. Gross premiums written increased 5% on an FX-adjusted basis to $9.6 billion, with global commercial growing 8% and global personal decreasing 3%.\n\nNet premiums written increased 5% on an FX-adjusted basis to $6.9 billion. This growth was led by our global commercial business, which grew 8% with global personal decreasing 4%. Global commercial net premiums written increased 10%, excluding AIG Re, where we have significantly reduced property CAT writings and exposure, particularly in the Southeast region of the U.S. North America commercial net premiums written increased 10% or 14% excluding AIG Re.\n\nAnd international net premiums written increased 5% or 8% excluding the impact of nonrenewal and cancellations related to Russia exposure in each case on an FX-adjusted basis. In North America commercial, we saw very strong growth in net premiums written: In Lexington, which grew 31% led by wholesale property, which was up 46%; retail property, which grew 17%; and our Canadian commercial business, which grew 10%. In international commercial, on an FX-adjusted basis, we also saw strong growth in net premiums written: In Global Specialty, which grew 16% led by energy, which was up 20%; and marine, which was up 10%; North America Specialty, which grew 17%; and international Specialty, which grew 15%. In global commercial, we also had very strong renewal retention of 85% in our in-force portfolio, with North America up 200 basis points to 85% and international holding steady at a very strong 86%.\n\nAs a reminder, we calculate renewal retention prior to the impact of rate and exposure changes. And across global commercial, our new business continues to be very strong, coming in slightly over $1 billion for the fifth consecutive quarter. North America's new business grew to $542 million led by Lexington. International new business was $466 million, slightly down year over year due to intentional actions we took in Talbot and in our Specialty business related to Russia, Ukraine.\n\nTurning to rate. Momentum continued in global commercial with overall rate increases of 7%. And in the aggregate, rate continued to exceed loss cost trends. This is the fourth consecutive year in which we're achieving rate above loss cost trends and where we are successfully driving margin expansion.\n\nNorth America commercial achieved 7% rate increases with some areas achieving double-digit increases led by Lexington, which increased 18% with 17% in Lexington wholesale property; Financial Lines, where professional increased 34% led by cyber, which increased 52%; and excess casualty, which increased 10%. International commercial rate increases were 7% driven by Financial Lines, which increased 11%, including more than 47% rate increases in cyber; property, which increased 10%; and EMEA, which also increased 10%. Last quarter, we indicated that our loss cost trend view in the aggregate for North America commercial had migrated upwards from 4% to 5%, mostly driven by shorter tail lines. And as a result, we moved the upper end of the range to 5.5%.\n\nIn the second quarter, trends in casualty and other liability lines continue to show no obvious impact in either internal or external data to support a large move on loss cost, whereas property businesses have been more clearly affected. As a result, based on a review of more recent information, we again modified our view on loss cost trend to 6%. Loss cost trend represents the composite of frequency and severity. However, there is an additional mitigant to inflation built into rate decisions.\n\nExposure trend, which we view as a partial offset to loss cost trend, reflects the additional premiums an insurer receives driven by growth in underlying inflation sensitive exposure basis. When taking this exposure mitigant into account, our current North America commercial loss cost trend net of these inflationary exposure benefits is approximately 4%. Additionally, our North America commercial accident year loss ratio, ex CAT, is booked at 63% year to date, which is consistent with pure actuarial rate over loss cost and exposure trends but is a pure numerical approach and does not reflect our improved risk selection and continued improvement in terms of conditions. Those benefits will emerge over time.\n\nAs we discussed on prior calls, since 2018, we have implemented a clear ventilation strategy in our casualty, financial lines and property portfolios that directs our capacity deployment toward higher average attachment points, which is a strong defensive measure toward rising inflation. And this strategy continues today. We also implemented the strategy in our AIG risk management loss-sensitive workers' compensation business. And over the last few years, average deductibles have increased 30% to $1.3 million.\n\nTurning to personal lines. In North America personal, net premiums written declined nearly 4% driven by a reduction in warranty, which was partially offset by a rebound in travel. In international personal, net premiums written declined 4% on FX-adjusted basis also due to a reduction in warranty and partially offset by growth in accident and health and travel. Now I'd like to spend a few minutes on our high-net-worth business.\n\nThis is a business we will continue to invest in where there are attractive opportunities for profitability improvement. Over the last two years and through the second quarter, we've already invested $140 million to improve digital workflow, data, a customer interface that will provide enhanced insight and value to distribution partners and policyholders. The actions we are taking are designed to position this business to be more balanced with less density and lower volatility in order to provide more sustainable financial results. Let me review some of the market dynamics impacting this business that have created significant complexity and the resulting actions we are taking to reposition the portfolio.\n\nCurrently, the level of reinsurance we purchased and the commensurate model ceded profit is a headwind to net premiums written growth and combined ratio improvement. This has been intentional as we are not willing to take volatility on frequency or tail risk on CAT in our high net worth business. Adding to this, the inability to pass on increased loss and reinsurance costs through rate increases or limit management largely due to regulatory constraints further deteriorates margin in the short run. But we have made a deliberate decision to continue writing this business as we believe the trade-off is appropriate in the near term given the opportunity we see over the long term.\n\nAnd while each of our CAT-exposed businesses has different attributes, I don't see reinsurance costs for the high net worth market generally becoming less expensive for the foreseeable future, but instead, seeing it putting pressure on the segment. In fact, for a business that is primarily underwritten in peak zones with high total insured values, reinsurance costs will likely increase and, in some cases, materially. To understand the complexity of reinsurance for peak zones, you need to look no further than in what has happened in the retrocessional market over the last few years. While overall small market, retrocession provides approximately $60 billion of available limit across various structures, of which roughly $20 billion is indemnity-based for reinsurers with this capacity primarily supported by alternative capital.\n\nThe dynamics in the retrocessional market over the last few years are important to understand because they have materially changed even though overall retrocessional capacity has remained flat since 2017. First, the cost of retrocession has increased significantly more than in the reinsurance industry on a risk-adjusted basis. Second, available capacity has shifted from predominantly aggregate to predominantly occurrence. Third, first event aggregate and lower attaching occurrence retrocession have been put under significant stress.\n\nFourth, the retrocessional market return period attachment points have increased 50%. And fifth, compounded risk-adjusted rate changes have also increased by over 50%, even though retrocessional exposure is reduced compared to prior year. When you couple these factors with the additional adjustments going forward for inflation, model changes, trapped capital, you have a very complicated and challenging market. Additionally, if you review global insured net cat retrocessional losses over the last decade, nine out of 10 years have had larger contributions from secondary peril aggregate losses than peak peril losses, which highlights the complexity of modeling catastrophes.\n\nAs a result of these dynamics and challenging circumstances, we concluded that to continue to provide high-net-worth clients with comprehensive solutions that meet their emerging risk issues, we needed to move property homeowners product to the non-admitted market, particularly in CAT-exposed states. In the second quarter, we exited the admitted personal property homeowners market in certain states as we could no longer maintain our level of aggregation especially given the inability to reflect the loss cost increases, inflation and increased reinsurance costs and rates as well as limitations on our ability to make coverage changes in this market. As part of our go-forward high net worth strategy, we're going to move homeowners and possibly other products in more states to the non-admitted market. And we plan to set up a structure that, over time, we expect to be supported by third-party capital providers in addition to AIG.\n\nThis structure will provide more flexibility to manage aggregation, price, limit, terms, and conditions and to innovate to solve evolving client needs. We will continue to provide coverage to our clients in the U.S. utilizing a hybrid model of non-admitted and admitted products in some states and admitted-only products in other states. We're already seeing the benefits of this strategy in our portfolio as the reduction in key catastrophe perils is apparent in these early stages.\n\nFor example, since year-end 2021, gross wildfire PMLs are down approximately 35% to 40% across the entire PML return period curve. Now I want to review Russia, Ukraine. Last quarter, I addressed the many complexities and uncertainties that this situation presents, particularly those related to aviation policies issued to airline operators and leasing companies, including questions surrounding the occurrence of actual losses, loss mitigation efforts, whether any losses arise from war versus non-war apparels and the potential applicability of sanctions. These complexities and uncertainties very much continue.\n\nThe claims we have received continue to be largely reported under political violence or political risk policies. And we continue to reserve our best estimate of ultimate losses, heavily comprised of IBNR despite the fact that the information we have received in connection with these claims remains very limited. Moreover, in the event of losses and the lines of business we have outlined that are subject to a potential loss, we have multiple reinsurance programs available. Turning to AIG 200.\n\nWe started this three-year journey in 2019. AIG 200 was designed to transform our core foundational capabilities across the company, and our financial objective was to deliver $1 billion of exit run rate savings with a cost to achieve of $1.3 billion. At the end of the second quarter, we achieved these goals 6 months earlier than expected. Delivering on these critical operational and financial objectives is a major accomplishment for our team.\n\nAIG 200 was successful because we maintained a tight governance structure and saw exceptional collaboration from colleagues across all major areas of the company. While the original objectives of AIG 200 have been completed, our team will remain focused on continuous improvement in operational excellence. AIG 200 has put the company in a significantly better place. Specifically, we modernized our IT platform, retiring over 50% of our identified applications and moving 80% of our infrastructure to the public cloud.\n\nWe now have a global standard commercial underwriting platform that streamlines our processes and allows over 3,000 underwriters to make better risk management decisions in real time. This platform also includes a new global location management system that allows us to better understand and manage our PML exposure. We made significant investments in key capabilities, including building a consistent underlying data infrastructure, enhancing our digital capabilities through new distribution partner and client portals linked to a single common call center platform, and fundamentally streamlined our finance reporting capabilities for faster decision-making. And we streamlined our global operations and shared services capabilities by moving over 10,000 roles to outsourcing partners.\n\nI want to thank all of our colleagues involved in AIG 200 for their outstanding performance. They should take great pride in knowing they established a new infrastructure and foundation for AIG that we will continue to build on and that will drive benefits for our stakeholders now and in the future. Turning to our capital management strategy. We will continue to be balanced and disciplined as we maintain appropriate levels of debt while returning capital to shareholders through stock buybacks and dividends while also allowing for investment in growth opportunities across our global portfolio.\n\nAs I said earlier, we had a very successful second quarter where we reduced net debt outstanding by $1.4 billion, repurchased $1.7 billion of common stock, paid $256 million in dividends, and ended with $5.6 billion in parent liquidity. Looking ahead, with respect to debt repayment, AIG will receive the remaining $1.9 billion under the promissory note from life and retirement prior to the IPO. And we expect to use these proceeds to pay down additional AIG debt and for other purposes. With respect to share buybacks, we have $5.8 billion remaining on our current share repurchase authorization and expect to repurchase at least $1 billion of common stock in the third quarter.\n\nWith respect to growth opportunities, our priorities continue to be focused on allocating capital in general insurance where we see opportunities for profitable organic growth and further improvement in our risk-adjusted returns. As we discussed on our last call, we expect that post deconsolidation of the life and retirement business, AIG will achieve a return on common equity at or above 10%. Shane will provide more details on ROE and on capital management in his remarks. Shane, I'll turn the call over to you.\n\nShane Fitzsimons -- Chief Financial Officer\n\nThank you, Peter, and good morning to all. As Peter noted, I will provide more detail on our second quarter financial results and unpack a number of our key performance metrics, specifically EPS, liquidity, leverage, net investment income, and ROCE. I will begin by providing more detail on the financial results of general insurance and life and retirement in the second quarter. I will then provide more detail on net investment income.\n\nI will then review our balance sheet, leverage, AOCI, liquidity and share count, which benefited from excellent execution on a number of capital transactions. And finally, I want to provide you more detail on the execution path to 10% ROCE for AIG and more detail on what we intend to do to get there, including income drivers, expense reduction, and AIG 200 where, as Peter noted, we have contracted or executed on our stated goal of $1 billion of exit run rate savings 6 months ahead of our original time line. Turning to EPS. Adjusted after-tax EPS was $1.19 per diluted common share.\n\nImprovements in general insurance profit of $1.26 billion contributed $0.06 year over year. Within general insurance, strong underwriting income of $799 million contributed $0.31 of improvement, offset by a $0.25 decline in net investment income primarily driven by the decline in alternatives. And reduction in shares outstanding also contributed $0.10. Life and retirement declined $0.52 in APTI to $563 million, which was below last year's second quarter primarily due to $0.36 or $387 million unfavorable from lower net investment income, $0.19 or $202 million from accelerated DAC amortization and an increased SOP 03-1 reserves.\n\nThe net investment income decline in life and retirement was due to alternatives being down $0.21 and an $0.11 decline in yield enhancement income. As I noted, general insurance's adjusted pre-tax income contribution in the second quarter was $1.26 billion, which reflects strong underwriting profit growth and continued improvement in the calendar year combined ratio of 510 basis points to 87.4%, and the accident year combined ratio ex CAT of 260 basis points to 88.5%. General insurance adjusted pre-tax income improved by $63 million year over year. Underwriting income improved by $336 million driven by a $182 million improvement in accident year underwriting income in addition to $137 million from an improved PYD, offset by a reduction in alternative investment income in the quarter.\n\nThe combined ratio improvement was due to improved underwriting income, earned premium growth, expense discipline, low catastrophe losses, and favorable PYD, which all contributed to pre-tax underwriting income being up 73% year over year, increasing to $799 million from $463 million. North America commercial had another 300 basis points improvement in the accident year combined ratio ex CAT over the prior-year quarter, coming in at 88.2%. International commercial also continued to improve profitability with 550 basis points improvement in the accident year combined ratio ex CAT this quarter, coming in at a strong 81.4% for the second quarter. North America personal had a 40 basis points improvement in the accident year combined ratio ex CAT over the prior-year quarter, coming in at 99.7%.\n\nInternational personal experienced a 120 basis points deterioration in the accident year combined ratio ex CAT, coming in at 95.2% for the second quarter. In the second quarter, CAT losses were $121 million or 1.8 loss ratio points, compared to $138 million or 2.1 loss ratio points in the prior-year quarter. Prior-year development, excluding related premium adjustments, was $202 million favorable this quarter compared to the favorable development of $51 million in the prior-year quarter. This quarter, the ADC amortization provided $42 million of favorable development.\n\nAnd the balance of $160 million favorable arose mostly from old accident years in workers' compensation along with primary casualty lines in the U.S. The review in the quarter was mainly focused on North America and represents approximately 15% of reserves. Within both AIGRM loss-sensitive work comp and U.S. primary casualty lines, there were additional indications of higher favorable development, but we felt it prudent to wait and see how the inflationary environment evolves, particularly as it relates to the casualty bodily injury and the medical side of workers' comp.\n\nWe look at this quarterly, and as is our standard practice, we will be reviewing approximately 75% of the total pre-ADC general insurance reserves in the third quarter. Life and retirement adjusted pre-tax income of $563 million, compared to $1.12 billion in the second quarter of 2021. The year-over-year decline was due to $387 million of lower net investment income, of which $224 million is from lower alternative investment income as well as accelerated DAC and increased SOP reserves of $202 million driven by the market declines in the second quarter. The DAC and SOP charges had approximately 300 basis points negative impact on ROCE in the quarter, but these are largely noncash.\n\nWithin individual retirement, fixed annuity sales increased 48% year over year, aided by origination activity to the Blackstone relationship. And fixed index annuity had another solid quarter of sales. Sales of variable annuities declined in the quarter, consistent with market conditions. Net flows were positive $628 million this quarter, compared to negative net flows of $77 million in the prior-year quarter.\n\nAnd variable and indexed annuity spreads expanded two basis points from the first quarter of 2022. Group retirement had strong deposits in the quarter of $1.8 billion, while surrenders declined and base net investment spread was up four basis points versus the first quarter of 2022. Life insurance adjusted pre-tax income was $117 million. The second quarter represented the lowest COVID mortality quarter since the pandemic began, while non-COVID mortality also ran favorable in the period.\n\nPremiums and deposits also continued to benefit from the solid international life sales, which comprise approximately 45% of new sales activity. Our previously reported level of spread rate compression has been in the range of 8 to 16 basis points annually. But given current market conditions, we now expect to be better than 8 basis points for the full year. As you are aware, for the life and retirement business, we conduct our entire reserve review in the third quarter.\n\nHowever, with the recent focus on the guaranteed universal life product, I will provide a few comments. First, this is not a large block for us. So we do not have much exposure in our in-force block, which is approximately $3 billion in net statutory reserves, which represents 2% of our net liabilities. For context, we did participate in the recent industry study on this topic.\n\nAnd our projected lapse rates, fund bases and dynamic premium modeling approach are consistent with the recommendations of the study. As additional background, over the last five years, we have been reviewing and strengthening our reserve assumptions for the guaranteed universal life product. And as a result, we don't expect significant adjustments. Turning to other operations, which includes interest expense, corporate general operating expenses, institutional asset management expense, runoff portfolio and eliminations, it was a positive contributor to adjusted pre-tax income year over year by $149 million.\n\nCorporate general operating expenses improved $74 million year over year in the second quarter, benefiting from AIG 200 and continued emphasis on expense management. Adjusted pre-tax net investment income for the quarter was $2.5 billion, a decline of $678 million compared to the second quarter of 2021. As a reminder, we report the results of our private equity holdings on a one-quarter lag, and we may have an impact in the third quarter as well. Over the last few years, we focused on improving the risk profile of the investment portfolio with continued vigilance around corporate and consumer credit and a strong capital and liquidity profile in both general insurance and life and retirement, which support our ability to manage through difficult times as evidenced by our financial stability through COVID.\n\nIn life and retirement, our weighted average credit rating has improved since the end of 2015, while the percentage of capital-intensive assets has declined in the portfolio from 10.5% to 8.3%. In the second quarter, we continued the proactive steps in the investment portfolio to avoid potential overexposure in the event credit deteriorates. We sold RMBS and ABS securities with a market value of $3.2 billion in the second quarter. In addition, we have alternative investments, particularly hedge funds, that have generated good returns over time but with more quarter-to-quarter fluctuations and that is more volatility than we would prefer.\n\nGoing forward, we would expect to move over time to an asset allocation with less volatility. We've also executed on sales of approximately $4 billion of low-yielding longer-duration corporate bonds to buy higher-yielding, shorter-duration structured securities, privates, ABS, and CMLs with many of them being floaters. We feel it is appropriate to take advantage of the higher rate environment and turn the portfolio over a little more quickly than would naturally occur at maturity, thereby enhancing our forward APTI and ROCE. The second quarter saw significant increases in benchmark treasury yields with a 65 basis point increase on the 10-year or 146 basis points through June 30th.\n\nWith general insurance and life and retirement portfolio durations are just under four and eight years, respectively, the overall rising interest rate environment will provide a tailwind to our investment portfolio returns. Our base fixed income portfolio saw a lift in yield of 18 basis points in the second quarter versus first quarter with $17 million additional within general insurance and $28 million additional in life and retirement. The new money yield on our base portfolio was approximately 80 basis points above the assets rolling off the portfolio during the second quarter. At the end of the second quarter, the new money yield is roughly 130 basis points higher than the overall current portfolio in general insurance and roughly 75 basis points higher in life and retirement.\n\nMoving on to the balance sheet, leverage, and liquidity. As Peter noted, we closed the quarter with $5.6 billion of parent liquidity. The second quarter includes execution of $1.7 billion in share repurchases, $256 million of common and preferred dividends and $1.4 billion net spend on debt reduction actions, including AIG debt retirement and extinguishment costs of $7.9 billion that is partially offset by the Corebridge debt issuance of $6.5 billion. In the second quarter, we saw a large AOCI movement as a result of increasing interest rates.\n\nAdjusted AOCI, which excludes the cumulative unrealized gains and losses related to Fortitude, moved from negative $5.9 billion to negative $15.4 billion, or an additional reduction of $9.5 billion. We exited the second quarter with GAAP leverage of 31.1%, up from 27.8%, a 330 basis point increase quarter over quarter. The decrease in AOCI in the period added 390 basis points to the leverage ratio. This was partially offset by the net debt reduction of $1.3 billion in the period in addition to net income gains.\n\nThe impact of AOCI is substantially larger in life and retirement and general insurance, given the duration of their respective asset portfolios. At quarter end, our debt leverage ratio, excluding AOCI, was 25.3%, down 60 basis points versus 25.9% at the end of the first quarter of 2022. Total adjusted return on common equity was 7%, down from 10.5% in 2Q '21. And total company adjusted tangible return on common equity was 7.6%.\n\nThe decrease is mostly caused by decline in net investment income. general insurance's adjusted attributable return on common equity was 12% in the second quarter while life and retirement was 7.6%. life and retirement's ROCE was impacted by approximately 300 basis point drag from the acceleration of DAC, an increase in the SOP 03-1 reserves in the second quarter. Adjusted book value per share of $72.23 increased 2.1% sequentially and 20.2% year over year.\n\nAdjusted tangible book value per share of $66.06 increased 2.2% sequentially and 21.8% year over year. Our primary operating subsidiaries remain profitable and well capitalized with general insurance's U.S. pool fleet risk-based capital ratio for the second quarter estimated to be between 475% and 485%. And the life and retirement U.S.\n\nfleet estimated to be between 415% and 425%, both above our target ranges. Finally, during the quarter, we repurchased approximately 30 million shares at an average cost of $58.25, bringing our GAAP ending share count to 771 million with the quarterly average of 801 million, compared to 873 million in the prior-year quarter, representing an 8% reduction in average share count. As we previously disclosed, our agreement with Blackstone includes an exchange right put option, which is not exercisable until November of 2024. That gives Blackstone the right to exchange their stake in Corebridge for shares in AIG.\n\nUnder the applicable accounting principles, this put option was dilutive in the second quarter and resulted in 43 million additional shares outstanding for the purposes of the adjusted EPS calculations in the period. It is worth noting that this put option goes away upon the execution of the IPO. Looking ahead, we have four priorities, which all lead to ROCE improvement toward our 10% or greater goal: continued momentum on underwriting excellence, expense reduction through operational excellence and expense discipline, the successful IPO and separation of the life and retirement business and continued execution on our capital management priorities. Continued momentum on underwriting excellence will include further improvements in our underwriting profitability without an increase in volatility as well as underwriting portfolio optimization, which involves both measured growth on proper leverage to optimize return allocation.\n\nWhile we have made significant progress to date, we are still achieving written rate above trends, both in business today and that which we have not yet earned in. Expense reduction will come through continued cost discipline, operational excellence, earn-in of AIG 200 run rate savings and a reduction of parent GOE. As Peter mentioned, we have now contracted or executed on $1 billion of savings related to AIG 200, and we have realized $610 million of savings to date. That leaves $390 million of savings that AIG expects to earn in over the coming 12 to 18 months.\n\nWe also expect roughly $300 million of the AIG corporate expenses will move to life and retirement upon deconsolidation. In addition, as Peter stated, we now expect life and retirement to execute a cost savings program, which will generate close to $400 million in savings and expect the program to deliver the first $100 million before year-end. With respect to the execution on our capital management priorities, we have already accelerated our share repurchases this year and expect additional repurchases as we get more clarity on the timing of the proceeds from the Corebridge IPO. Contemplated in our current plan, which includes the completion of the Corebridge IPO, we expect to reduce our share count to somewhere in the range of 600 million to 650 million shares, while maintaining leverage in the 20% to 25% level along with strong capitalization at the insurance subsidiary company level.\n\nEach of these drivers has some elements of tailwind to them. Additionally, yield enhancement in the base investment portfolio should provide meaningful lift in earnings power over time based on the current economic backdrop. To date, we're beginning to see the benefit of higher yields driving higher base portfolio returns where we are not dependent on higher interest rates to achieve our goal. These focus areas give us a line of sight to a minimum of 300 to 400 basis points of ROCE improvement.\n\nWe will continue to provide updates over time. And with that, I will turn the call back over to you, Peter.\n\nPeter Zaffino -- President and Chief Executive Officer\n\nGreat. Thank you, Shane. And operator, we're prepared to take questions.\n\nOperator\n\nThank you, Peter. [Operator instructions] Our first question will come from Meyer Shields at KBW. Meyer, you may unmute.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nGreat. Thanks. Good morning. Peter, you provided a ton of information on rates and trend and exposure.\n\nBut I was hoping we could dig a little deeper, specifically into the exposure benefits for liability lines where premiums are based on receipts, but maybe the relationship between receipts and losses is not as obvious as, let's say, in property, and we've got the concerns of longer tail lines.\n\nPeter Zaffino -- President and Chief Executive Officer\n\nSure, Meyer. Thank you for the question. Like you said, we've provided a lot of information in our prepared remarks. But I think, Mark, why don't you go through what the effects are in exposure and also talk a little bit about sort of the loss ratio implications in the observations that we made.\n\nMark Lyons -- Executive Vice President, Global Chief Actuary and Head of Portfolio Management\n\nHappy to. So a couple of things come to mind. First off, as Peter mentioned, North America commercial aggregate loss trend is now up to 6% this quarter as opposed to our upper revision we did last quarter, the 5.5%, because we look at that every quarter. Short-tailed lines are driving much of this increase, and that is seen in our own data as well as external information.\n\nAnd over the last few years, because I'm talking about the weighted average loss cost trend there, the North American portfolio has reduced its property writings and has shrunk as a percentage of total, which helps ameliorate the growth in severity. So -- but we're seeing commercial property line loss cost trends of roughly 10% and in specialty-oriented property lines closer to 15%, driven by inflationary trends in construction materials, replacement costs, labor, transportation, things of that nature. Our view of casualty, bodily injury and the medical side of work comp, though, is unchanged from last quarter. And recall that even that reflected an increment of anticipatory medical cost increase.\n\nBut as Peter said in his prepared remarks, we have yet to see it within our own data or with relevant external data. Now I think getting into some of your question as well, it's hard to discuss loss cost trend without discussing the related topic of margin, which reflects the exposure trend and how that mitigates the loss cost trend that we've already just talked about. The aggregate North American commercial book has an approximate 2% exposure trend, which, as you mentioned, represents additional collected premium due to the positive impact of the underlying inflation-sensitive exposure basis to which the rates are applied. And therefore, it does function as a partial inflation mitigant.\n\nAnd examples of that would be one of our growth engines, which is Lexington, which has approximately 60% of their book based on inflation-sensitive exposure basis. And another one would be retail property, where the focus on accurate and current statement of values is razor sharp in that level of focus. So the exposure trend is partially mitigating these loss cost trends, which then produces the approximate 4% all-in loss ratio trend that Peter commented on. But -- so when you put that in conjunction with the 7% rate increases achieved in the quarter, we're in excess of loss cost trend and loss ratio trend, let alone the loss ratio benefits of tighter terms and conditions.\n\nAnd rate change alone really doesn't tell the whole picture. We've spoken before about the power of the primary, especially in D&O. AIG's position there permits deploying ventilate capacity as we see fit, but just as important is the stronger pricing power resident in the primary versus high excess, which is fast becoming a good commodity driven by high price or highly by price and seeing the largest rate reductions. That's the strength of the primary.\n\nBut I think lastly, just I think a clarification, it may or may make some sense, so think of it this way, let's not get confused on the difference between a real underlying exposure to loss with the measurement of that exposure to loss. So to keep it simple, if storekeeper A buys a GL policy, which is mostly a premises policy, and the insurer uses square footage as the exposure base, then the premium paid is rate times square footage, of course. And next year, if there is no rate change, he'll have the same premium. However, if storekeeper B has an identical store in the same geographic area and the same sales volume, but their insurer instead rates on gross receipts, and those receipts are 3% higher this year than last year, the true underlying exposure as measured by the propensity to have a claim didn't change, but the measurement of that exposure did change.\n\nSo storekeeper B's premium will be 3% higher than that charged by insurer A, even though the stores are identical in every way.\n\nPeter Zaffino -- President and Chief Executive Officer\n\nThat's great, Mark. Thank you. Meyer, is there a follow-up?\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nYes. Just a very brief one really on the last comment. Is there an opportunity or an advantage to maybe shifting even more of the premium Phase 2 inflation-sensitive exposure?\n\nMark Lyons -- Executive Vice President, Global Chief Actuary and Head of Portfolio Management\n\nYes. I mean, it's -- that is a potential strategy that you'd -- a little difficult to implement, right, because you have -- part of a profitable portfolio are those things, rated -- inflation exposure basis like premises. However, when you get into other lines, like the M&C side of GL, Meyer, I think what you're saying makes a lot of sense.\n\nPeter Zaffino -- President and Chief Executive Officer\n\nYes. I think maybe I'd just add to that, and we'll take the next question, which is all the significant repositioning we've done in the excess and surplus lines, particularly with the Lexington. You hear a lot about in the prepared remarks because they've done such a great job between growth, rate, retention and pivoting that portfolio to be a significant contributor in terms of profitability improvement. I mean, we've gotten on property alone 16 consecutive quarters of double-digit rate increases.\n\nAnd as Mark alluded to, that just starts to drive margins. So we are repositioning the portfolio based on where we see the best risk-adjusted returns. OK. We'll take the next question.\n\nOperator\n\nOur next question will come from Erik Bass with Autonomous. Erik, you may unmute your line.\n\nErik Bass -- Autonomous Research -- Analyst\n\nGood morning. Thank you. So with the Corebridge IPO, it sounds like your strategy is to remain patient and wait for markets to recover since you're not a forced seller. Is this the right take? Or if the IPO window opens in the fall, would you look to take advantage and get some stock floated even if at a modest discount to what you view as the ultimate fair value?\n\nPeter Zaffino -- President and Chief Executive Officer\n\nYes. Thanks, Erik. We provided a lot of sort of guidance in our prepared remarks, but let me try to add to it. Our plan has always been to do an IPO of Corebridge, and that has not changed.\n\nSo now we are targeting September. I mean, we gave you some of the variables, but obviously, there's more to consider like you outlined. We just felt that the market conditions in the second quarter were not conducive. We always intend to own greater than 50% following the IPO.\n\nAnd therefore, we'll continue to consolidate results for the foreseeable future. The base case is still to do secondary offerings, but those will likely take place in 2023. And so look, we're going to watch the market. We always have to be careful in terms of the conditions that exist in the regulatory approvals.\n\nBut our base case has just shifted from May, June to September. And we'll watch it carefully, and we'd like to get it floating.\n\nErik Bass -- Autonomous Research -- Analyst\n\nGot it. Thank you. And then one follow-up on Corebridge. I was just hoping you could talk a little bit more about the performance of your VA hedging program this quarter and the movements in the RBC ratio that we saw.\n\nPeter Zaffino -- President and Chief Executive Officer\n\nYes, Shane, you and Kevin want to provide some insight on that?\n\nKevin Hogan -- Chief Executive Officer of Life and Retirement\n\nYes, so --\n\nShane Fitzsimons -- Chief Financial Officer\n\nGo ahead, Kevin.\n\nKevin Hogan -- Chief Executive Officer of Life and Retirement\n\nSo Erik, yes, our VA -- the hedging program, our economic target-based hedging program has continued to perform as we have expected throughout all of the market volatility. It is an economic target-based hedging program, and so the RBC decline was in part due to the variable annuity and index annuity portfolios. And as you know, those market impacts are reversible as markets recover. So we have hedged all Hedgeable economic risks.\n\nWe have an open credit spread position, which we believe is offset by our general account credit portfolio, and the hedge has performed as we have designed it.\n\nErik Bass -- Autonomous Research -- Analyst\n\nGot it.\n\nPeter Zaffino -- President and Chief Executive Officer\n\nThank you, Kevin. Thanks, Eric. I think we have one last question. Operator, we'll turn it to you.\n\nOperator\n\nOur next question will come from Brian Meredith with UBS. Brian, you may unmute your line.\n\nBrian Meredith -- UBS -- Analyst\n\nThanks. Yes. Two quick questions here for you. First one, thanks for all the detail on the expense outlook going forward.\n\nI'm just curious, is there another plan expense reduction program for the general insurance business post the Corebridge split? And Pete, I'm curious, is there a G&A expense ratio did you think you need to be at or a target you're looking at to be among the most competitive from an expense leverage perspective in the commercial insurance business?\n\nPeter Zaffino -- President and Chief Executive Officer\n\nYeah. Thanks, Brian. Yes. So as we said, we're really proud and pleased that we just finished AIG 200, and that will start to continue to earn in.\n\nThe work that we did in the summer for Corebridge, we increased our expectations there over the three-year period to be now at the upper end of the range of $400 million. So our primary focus is the underwriting excellence in terms of the improvement, the focus on continuing AIG 200 and making sure that operational excellence becomes a core part of the organization, which it already has, but we want to continue that, and then making sure that the separation of Corebridge is done flawlessly. At the same time, we are looking at our overall cost structure. There's a ton of work underway.\n\nAnd as we start executing on those other pieces, there will be -- Shane put in his prepared remarks, where we're going to get out a meaningful amount up to $500 million more of expenses. That's the remaining company within AIG. So that will start to get executed. As we start to deconsolidate, we'll have a path forward as we flow Corebridge and be able to give you more guidance.\n\nI don't have a percentage. I focus on the nominal in terms of -- when I look at even like general insurance over the last five quarters where we've invested a lot in the business, the nominal GOE has not gone up. I mean, so the expense discipline is there. And we want to continue to benefit from the earned savings with AIG 200 and what we will take out in terms of the combined entity when we go forward.\n\nBut we want to have an organization that is going to be world-class in terms of its overall expense ratios. And I think we've proven that we not only can take it out in a really constructive way because we're investing for the future, but we maintain that level going forward. We have growth opportunities in the top line, which will help the ratios. I mean, the commercial business is growing, excluding AIG Re, which the reason why I've excluded is that we're not trying to grow that business based on the CAT exposures today, but growing at 10%.\n\nWe see opportunities to grow in the future when we look to the back half of this year. We have very strong retention. The new business that's been coming in is going to be more retained. It's the fifth quarter in a row where we produced more than $1 billion of new business, all very positive, all helpful to our ratios.\n\nAnd so we feel like we have a lot of momentum.\n\nBrian Meredith -- UBS -- Analyst\n\nGreat. That's really helpful. And then one last question on the whole exposure loss trend. Everybody is talking about increasing exposure.\n\nWhat happens if we go into a recession? Can that actually hurt your ability to see -- accrete margin?\n\nPeter Zaffino -- President and Chief Executive Officer\n\nI don't think so based on the makeup of the portfolio. But Mark, why don't we end where we started with you just to give a little bit of perspective and then you can turn it back to me.\n\nMark Lyons -- Executive Vice President, Global Chief Actuary and Head of Portfolio Management\n\nYeah. Thank you, Peter. And Brian, good to hear from you. So to your question, remember, what Dave McElroy and his team are doing, Lexington is becoming an increasing proportion of the business.\n\nAnd on a non-admitted basis, you have a lot of interesting terms and conditions like minimum earned premiums. So even if that does fall off a bit, that doesn't necessarily translate on a downward movement.\n\nBrian Meredith -- UBS -- Analyst\n\nOK. Thank you.\n\nPeter Zaffino -- President and Chief Executive Officer\n\nThanks, Mark. Thanks a lot, Brian. Have a great day. And thanks, everybody, for joining us.\n\nReally appreciate the time, and have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nQuentin McMillan -- Head of Investor Relations\n\nPeter Zaffino -- President and Chief Executive Officer\n\nShane Fitzsimons -- Chief Financial Officer\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nMark Lyons -- Executive Vice President, Global Chief Actuary and Head of Portfolio Management\n\nErik Bass -- Autonomous Research -- Analyst\n\nKevin Hogan -- Chief Executive Officer of Life and Retirement\n\nBrian Meredith -- UBS -- Analyst\n\nMore AIG analysis\n\nAll earnings call transcripts"
}