{
  "companyName": "Dollar Tree Inc",
  "companyTicker": "DLTR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/22/dollar-tree-inc-dltr-q3-2022-earnings-call-transcr/",
  "content": "Dollar Tree Inc (DLTR -1.08%)\nQ3 2022 Earnings Call\nNov 22, 2022, 9:00 a.m. ET\n\nOperator\n\nWelcome to the CBS -- good day and welcome to the Dollar Tree third quarter earnings call. Today's call is being recorded. At this time, I would like to turn the call over to Randy Guiler, vice president of investor relations. Please go ahead.\n\nRandy Guiler -- Vice President, Investor Relations\n\nThank you, operator. Good morning, and welcome to our call to discuss results for Dollar Tree's third fiscal quarter 2022. With me on today's call are Executive Chairman Rick Dreiling, President and CEO Mike Wytinski, and CFO Jeff Davis. Before we begin, I would like to remind everyone that various remarks that we will make about our expectations, plans, and prospects for the company constitute forward-looking statements for the purposes of the safe harbor provisions under the Private Securities Litigation Reform Act of 1995.\n\nThese statements are subject to risks and uncertainties, and our actual results may differ materially from those included in these forward-looking statements. For information on the risks and uncertainties that could affect our actual results, please refer to the risk factors, business and management's discussion and analysis of financial condition and results of operations sections in our annual report on Form 10-K filed March 15, 2022, our Form 10-Q for the most recently ended fiscal quarter, our most recent press release, and Form 8-K, and other filings we make from time to time with the SEC. We caution against reliance on these forward-looking statements made today, and we disclaim any obligation to update or revise these statements, except as may be required by law. Following our prepared remarks, Mike and Jeff will take your questions.\n\nGiven the large number of those that would like to participate, I ask that you please limit your questions to one. I will now turn the call over to Rick.\n\nRick Dreiling -- Executive Chairman\n\nThank you, Randy, and good morning, everyone. In my short time here, I have been incredibly impressed with the team's overall enthusiasm and willingness to accept and embrace much-needed change. As I stated last quarter, we are making change happen to create long-term shareholder value and enable the next waves of profitable growth for Family Dollar and Dollar Tree. The company is moving at a rapid pace.\n\nWe have done a remarkable job of rebuilding our executive team and with retail thought leaders that are subject matter experts and eager to be part of this transformational journey that we have embarked on. In a short period of time, all of our C-suite positions have been filled, as well as new leadership roles dedicated to a number of key areas, including diversity, sustainability, compliance, and communication. Last quarter, we shared news of the material price investments made at Family Dollar. These actions got on price parity with key competitors and widen our spread to grocery and drugstores.\n\nCustomers are recognizing this commitment to value, which contributed to a 4% comp sales increase and the segment's first quarterly traffic increase in three years. The teams are focused on improving store standards. They are committed to clean them up, straighten them up, and fill them up. Improving sales productivity is a vital component of the Family Dollar turnaround, and we are extremely focused on driving sales per square foot, unit sales growth, and transaction count growth.\n\nWe are a company with more than 16,200 stores. But the way I prefer to look at this is that we are really two growth companies with 8,100-plus stores each. Both Dollar Tree and Family Dollar are unique businesses with two different go-to-market strategies. Having two distinct large segments provides us flexibility like none other in value retail.\n\nAnd both Dollar Tree and Family Dollar have extraordinary opportunity for growth and improvement over time. We are prioritizing our areas of growth, and we are moving with urgency. The new management team is in-house. We've taken aggressive action on price.\n\nThe advertising and marketing cadence has been enhanced. We are in the midst of a cultural transformation throughout the organization designed to enhance our associate and customer experience. Store standards are improving. Years of sales productivity opportunities are ahead of us, and work on supply chain and technology initiatives will enhance us to achieve our ultimate goals.\n\nI know many are eager to learn more about all of our plans, including the timing, the magnitude, and the expected returns. These details will be shared at our Spring Investor Day in a more structured format as our new leadership team has assembled more time to gather. We are entirely committed on taking the right steps to transform this organization for the long term. On behalf of our directors, I want to thank each of our associates for their commitment, dedication, and effort, especially for their willingness to embrace much-needed change.\n\nThis is a journey that I am thrilled to be part of. I'll now turn the call over to Mike.\n\nMike Wytinski -- President and Chief Executive Officer\n\nThank you, Rick, and good morning, everyone. Thank you for joining us today. As you have seen in recent months, we have announced a number of executives have joined Dollar Tree. I am excited about the caliber and quality of the leadership team we now have in place.\n\nThis team will lead our company through the next evolution of growth. We are committed to transforming our culture, meeting our shoppers' and associates' needs, improving store productivity and efficiencies, and delivering improved long-term operating results. I am pleased with the team's efforts to deliver solid results for the quarter. Our third quarter sales performance reflects the timely execution of merchandising initiatives to drive our consumables business in this uncertain and inflationary environment.\n\nSame-store sales for both segments improved from the prior quarter and delivered sequential monthly improvement throughout the quarter. Shoppers are responding to our new value proposition at Family Dollar and Dollar Tree as we focus on driving both traffic and store productivity. With the exception of Q1 and Q2 of 2020, at the initial onset of the pandemic, our 6.5% enterprise comp represents our best quarter since the Family Dollar acquisition. By segment, the comp was comprised of an 8.6% increase for Dollar Tree and a 4.1% increase for Family Dollar.\n\nIn recent quarters, we refined our strategies at both Dollar Tree and Family Dollar to focus on the traffic-driving consumable side of the business. Our transition to the $1.25 price point has enabled our merchants to greatly enhance value for our shoppers. For the second consecutive quarter, our consumables comp outpaced the discretionary comp at Dollar Tree. The team delivered a 9.3% comp on consumables, with key contributors being in food and beverage, snack and cookies, and candy.\n\nFamily Dollar consumables increased 4.7% on a comp basis despite the ticket headwinds related to our price actions in Q2. Shoppers are clearly recognizing the greater value and are responding to our enhanced advertising initiatives. Importantly, at both Dollar Tree and Family Dollar, we saw an acceleration in comp performance throughout the quarter, with October being our strongest month. We have a number of key sales-driving initiatives to drive productivity.\n\nFor Dollar Tree stores, we are continuing to exceed the customer's expectation for value. Our merchants do a tremendous job of effectively managing the ever-changing assortment that wows our shoppers. Expanding our $3 and $5 offering into more stores, we ended the quarter with our Plus assortment in nearly 30% of our Dollar Tree stores, and we'll continue to aggressively expand this initiative in the years ahead. We are currently refining our $3 and $5 assortment as our team operates in an environment of continuous improvement based on learnings.\n\nWe are developing our frozen assortment to meet our shoppers' family needs as they are looking to save money by dining at home. We are aggressively expanding our offerings of protein, pizza, breakfast items, and family sizes at price points that meet their budgets. We will continue to focus on winning the season. Dollar Tree is a destination for shoppers looking to celebrate holidays, events, and seasons.\n\nOur offering will be better than last year, but not as good as next year as we continue to improve our assortments. Family Dollar, from a pricing perspective, is in the best position in more than a decade. Now that we have taken action to reestablish price parity, we are committed to maintaining our competitiveness. Other Family Dollar initiatives designed to improve sales per square foot, unit sales, and transaction count include improving our store layouts through improved adjacency flow, adding linear square footage, expanding immediate consumption DSD categories, and optimizing the beverage and frozen food offering.\n\nDeveloping private brands, we are in the process of growing and improving our private brand performance by providing shoppers more choices and a broader offering of quality products at a greater value. Over time, we believe this will enhance customer loyalty, as well as our margin profile. We are refining our marketing effectiveness to provide customers with convenience, value, variety, and an improved shopping experience. We have evolved our print advertising calendar and format to be more relevant to our customers to drive their visit frequency.\n\nWe are also in the process of relaunching our Smart Coupon program, designed to improve quality, availability, clip rate, and redemptions. In this changing and dynamic environment, we feel we are implementing the right plans to drive sales productivity, enhance margins, and improve efficiencies to enhance the long-term benefits to each of our stakeholders. In October, Jeff Davis joined Dollar Tree as our new CFO. Jeff brings more than 30 years of financial leadership to the organization, with much of his experience coming from large retailers, including Walmart, JCPenney, and Darden.\n\nJeff is very much focused on value creation through strategic growth and strategic decision support, as well as value preservation through governance and efficiency in operations. Jeff has been in the company for nearly two months, but he is making a difference already. I'll now hand the call over to Jeff to provide more color on Q3 and what's ahead of us.\n\nJeff Davis -- Chief Financial Officer\n\nThank you, Mike, and good morning, everyone. I am delighted to join the Dollar Tree team at such a pivotal time. I've been in my seat for almost eight weeks, and I have experienced tremendous energy and excitement across the entire organization as the team is embracing change. While the company has been around for decades, I believe we are in the early phase of significantly improving our long-term operating performance.\n\nIn October, I had an opportunity to meet several of you at store visits, and I look forward to connecting with a larger group in the near future. More details to come. Since Mike and Rick already covered our third quarter sales results, I will now move directly to the discussion of operating income. Unless otherwise stated, all third quarter comparisons are against the same period last year.\n\nTo supplement my comments, we are introducing a quarterly presentation on our website at corporate.dollartree.com/investors, which outlines several key operating metrics. We hope you will find this additional information helpful to better understand our business. Operating income increased 22.8% to $381.3 million, or 5.5% of total revenue, a 70-basis-point improvement in operating income margin. This was led by a 240-basis-point improvement in gross profit margin, partially offset by a 170-basis-point increase in our SG&A expense rate.\n\nGross profit increased 17.5%. In the Dollar Tree segment, gross margin improved 520 basis points, primarily from higher initial mark-on related to the move to $1.25 price point, lower freight costs, and sales leverage, partially offset by greater penetration of lower-margin consumable merchandise and product cost inflation. Family Dollar's gross margin declined 100 basis points, largely due to a product mix shift and product cost inflation. We expect to see continued pressure across both segments related to the inflationary cost environment and merchandise mix as our consumable sales are expected to continue outpacing discretionary.\n\nSG&A as a percentage of total revenue increased 170 basis points to 24.4%. The increase is principally related to elevated repairs and maintenance as part of our commitment to improve store standards, investments in store hourly wages, and higher inflationary costs across a number of expense categories, including utilities. Corporate support and other expenses increased 30 basis points to 1.4%, primarily from increased stock compensation expense, higher incentive comp, and professional fees. From a bottom-line basis, net income improved 23.1% to $266.9 million, or $1.20 per diluted share, in comparison to $0.96 per diluted share last year.\n\nMoving through the balance sheet. My comments reflect balance comparisons to the end of Q3 2022 versus Q3 2021. Combined cash and cash equivalents totaled $439 million, compared to $701 million. The reduction in cash is largely attributed to the repurchase of approximately 2.86 million shares for $397.5 million in Q3 of this year.\n\nInventory increased 31.1%, primarily from inflationary product and freight costs, expansion of $1.25 and multipriced Plus inventory, and store growth. Also, recall last year, shoppers pulled forward purchases well ahead of the holiday season, concerned about product availability, while we were chasing trans-Pacific deliveries of discretionary products as our inventory levels dipped well below normal operating levels. This year, shoppers' purchasing behavior appears to be more closely timed to holiday dates. Finally, unit counts are at similar levels to October 2019.\n\nOur inventory is fresh. We have limited dated inventory well within manageable levels. Capital expenditures were $391.2 million in the third quarter, versus 295.6 million last year. For fiscal 2022, we now expect capital expenditures to total approximately $1.2 billion.\n\nAs we look to Q4, we see the following affecting our business. We will anniversary a significant number of Dollar Tree stores, approximately 2,500 in December and 3,000 in January, the transition to the $1.25 price point a year ago. We previously experienced an outsize benefit to comps and margins associated to the transition. The economy continues to pressure middle- and low-household-income customers, resulting in needs-based purchasing.\n\nWe expect consumables to outperform discretionary, which negatively impacts gross margin. We are cycling advance child tax credit payments, which were distributed mid-month from July to December in 2021. On a year-over-year basis, we are facing higher costs from suppliers related to this inflationary environment. While at Family Dollar, we do have the flexibility to adjust price; at Dollar Tree, where we are at a fixed price point, it takes us time to adjust quantities and pack sizes for cost changes, which can lead to near-term pressure to margins.\n\nWe will continue to invest in store and DC standards and expect to have higher year-over-year expenses in repairs and maintenance. In addition to being right on price, we will be right on wage as it continues to be a competitive market for talent. We are raising our sales outlook for the year. Consolidated net sales for the year are now expected to range from $28.14 billion to $28.28 billion, compared to our previous outlook range of $27.85 billion to $28.10 billion.\n\nWe expect to deliver mid-single-digit comp sales increase for the year comprised of a high single-digit increase at Dollar Tree stores and a low single-digit increase in Family Dollar. Selling square footage is expected to grow by approximately 2.8% as we are experiencing supply chain delays related to procuring equipment and fixtures for store openings. For Q4, we estimate consolidated net sales will range from $7.54 billion to $7.68 billion based on a mid-to-high single-digit increase in same-store sales for the enterprise. At the end of Q2, we expected fiscal 2022 diluted earnings per share to be in the range of $7.10 to $7.40.\n\nDue to several factors, including, but not limited to, an acceleration of consumable product mix shift and elevated product cost pressure, we expect to be in the lower half of the previous outlook range. Other considerations for our updated 2022 outlook include the following. We expect consolidated depreciation and amortization to be approximately $770 million. Net interest expense is expected to be $30 million in Q4 and $127 million for the year.\n\nOur outlook assumes a tax rate of 24.3% for the fourth quarter and 23.7% for fiscal 2022. Weighted average diluted share counts are assumed to be 222.3 million shares for Q4 and 224.2 million shares for the full year. Our outlook does not include any share repurchases. As of October 29th, we had $1.85 billion remaining on our existing share repurchase authorization.\n\nI'll now turn the call back to Mike.\n\nMike Wytinski -- President and Chief Executive Officer\n\nThanks, Jeff. I am proud of our team's efforts. During a period of material organizational change, a disruptive hurricane through the Southeast, and macro uncertainty contributing to the highest inflation in 40 years, we delivered increases of 8.1% in sales, 17.5% in gross profit, 22.8% in operating profit, and an increase of 25% in EPS. Our results continue to reinforce the relevance of Dollar Tree and Family Dollar to millions of households across North America.\n\nAs you know, in late June, we announced that a number of executive positions would be changed. I am proud to share that by mid-November, all seats are filled, and we are very confident in the outstanding team we have built. All additions have been successful leaders throughout their careers and bring new, fresh perspectives and will enhance our progress. In addition to the executive changes, last week, we announced new leaders for several key areas of the business, including diversity, sustainability, compliance, and communications.\n\nI'm very confident in the team we have developed and that it will enable us to accelerate progress on our transformational journey. In the months ahead, we will be refining and prioritizing our plans to ultimately deliver improved operating performance across both segments. At our Spring Investor Day, we will provide you with a more transparent and comprehensive view into the opportunity ahead of us and the path to get there. Before we transition to Q&A, I want to sincerely share my gratitude to our associates, especially in Florida and the Carolinas, for their efforts during Hurricane Ian at the end of September.\n\nTheir efforts through the preparation for and the recovery from this devastating storm was critical to countless families and communities we serve. In many cases, our Dollar Tree and Family Dollar stores were among the first to reopen to assist customers with the products they needed most. Thank you to each of you. Operator, we are now ready to take questions.\n\nOperator\n\nThank you. [Operator instructions] We will take the first question from the line of Matthew Boss from J.P. Morgan. The line is open now.\n\nPlease go ahead.\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks. So, maybe, first question, at Family Dollar, could you elaborate on the drivers of sequential improvement as the quarter progressed? How much do you think more so of this is tied to the macro or the value trade-down behavior versus what inning do you think that your company's specific initiatives are in today at Family Dollar?\n\nMike Wytinski -- President and Chief Executive Officer\n\nYeah, thanks for the question. I think it's a combination of everything that you're seeing going on, the pressure on the customer, and then our merchandising team invest -- the investment we made in getting our prices right to be at parity in the marketplace, and then as well as writing more impactful ads and more frequency of our ads. So, I think stronger promotion, stronger base pricing, and then the work on the assortment in our H25, I think is leading to the overall macro impact that the customers are seeing on the pressure that they have to try and meet the budget each and every day. I think that, you know, on the customer, we're seeing -- you know, we're seeing continued pressure.\n\nWe're -- you know, as I've shared, we're seeing more customers come into our segment. And once they're in our segment, these are -- the majority of the customers are at 80,000 and higher household income. But even once they're inside the store, we're seeing shifts in their behavior where they're very consumable and needs-based focused to try and make that budget work and stretch it over the month. We're seeing private brands now for 39 weeks in a row have outpaced national brands.\n\nThirty-nine weeks in a row. We have not seen that prior five to seven years where private brands were outpacing national brands. But it's now been 39 years in a row -- or 39 weeks in a row. I'm sorry.\n\nAnd then we're seeing first in a month business is getting stronger. We're seeing our SNAP and food stamp business is growing. And we continue to see credit is outpacing debit. So, we do see that shift in the customer coming into our segment.\n\nAnd then when they're in our store, they are shifting into the consumables and needs-based to make their budget happen. And I think the work that our merchants are doing are absolutely aligned and helping drive meeting their needs when they're in our store.\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\nRight. And then just at the Dollar Tree banner, what's your overall assessment to date on breaking the box overall? Can you -- and can you speak to sequential trends with traffic to the banner that you're seeing? Or what's been the reception to Dollar Tree Plus or the rollout of the $3 and the $5 SKUs across the assortment?\n\nMike Wytinski -- President and Chief Executive Officer\n\nYeah. I'll start with $1.25. I think, overall, our traffic has been very stable, and we saw a slight improvement in Q3 in traffic. But what was more important is throughout 2020 and 2021, our consumable sales continued to decline quarter after quarter because of the product availability and the assortment, we just couldn't provide for the customer at that dollar price point.\n\nOnce we moved to the $1.25, throughout this year, our merchant teams have worked hard at bringing in that new assortment, and we have absolutely changed that trend. Instead of declining business in consumables, it's now accelerating and leading the growth. And I believe, over time, that will continue to drive traffic into our stores at Dollar Tree. So, what I'm really excited about is for the second quarter in a row, consumables have outpaced our discretionary business and it was 9.3%, 9.4% comp sales, but discretionary is still doing well at over 8%.\n\nSo, we like the business and the reaction we're seeing from the customers based on us being able to have a better assortment at greater values on products they need. And I think as we continue to provide that, that will help stabilize our traffic in the long term going forward. On the $3 and $5, we're seeing a great response from our customers, especially on the seasonal side of the product, and that's where we think we can continue to refine and grow that business. And then as well, you've also heard us, on the frozen food part, at the $1.25, with the cost pressures, it's even hard for us to get a great value assortment at the $1.25.\n\nSo, we've moved to multipriced products in our frozen food set. It's easier to communicate to our customers and our associates because it's door by door. And our -- and that assortment, as I've shared, the customers are responding greatly. And again, this is our frozen business, for the last 18 months was in a decline because of the same pressures we were seeing on the consumables.\n\nAnd now, we've completely reversed that where we have introduced the multipriced $3 and $5 items. Customers are responding well, and we see strong growth in our sales there. So, I think between the two of those things, the consumable side and then the frozen side, over time, we will continue to drive traffic doing that. And then on the discretionary side, proven by our continued growth on an 8% comp, the customers still see the value in our seasonal, hardy, toys, crafting, and that continues to be strong.\n\nSo, I like the trends we're seeing overall.\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\nGreat color. Best of luck.\n\nOperator\n\nThank you. We will take the next question from the line of Scot Ciccarelli from Truist. The line is open now. Please go ahead.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nThank you. Good morning, everyone. So, can you talk about the consumable versus the discretionary mix of both banners? It seems like there's a concerted effort to focus more on consumables. Obviously, that helps with traffic but is margin dilutive.\n\nSo, I guess the question is how do you guys expect to manage that balance? Number one. And then number two, when would you expect the mix pressures to start to ease? Is there like, I guess, a certain target you're kind of shooting for?\n\nMike Wytinski -- President and Chief Executive Officer\n\nYeah, and you're right. Right now, we're meeting the needs where the customer is taking us, and we are improving that assortment. And I'll speak to Family Dollar. Larry Gatta and the merchants have done a wonderful job at really improving that assortment and that pricing for that customer where they need us.\n\nAnd it's all in that consumable and DSD-related products. And we've done that not only in our base pricing but our promotion pricing and then also in the linear footage dedicated to it, our resets and our 2.5. So, you're right, I think our biggest goal to drive improvement on the Family Dollar side is to get more sales per square foot in our boxes. And the first thing is, is driving it with consumables and being right on that.\n\nBut the team is also, at the same time, really working on discretionary to be right on seasonal and home to meet their needs. But really, it's the consumable driving that trade over more than our effort and the work that we're doing on the merchandising side. And then on the Dollar Tree side, just as I have shared, I like what I've seen the last two quarters, where one is up 9.5%, the other one is 8%. That's a great balance.\n\nAnd I think as we continue to provide that value on the consumable side, I think, over time, we like when both are 50-50, 50%, say, discretionary, 50% consumables. And then as they grow over time, I think -- like Dollar Tree historically is always growing low single-digit comps with a combination of traffic and units in the basket. And I think once we settle and cycle through that, providing that effort on the consumable side, we will get back to that normal cadence that we've seen in the past.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nSo, just from an earnings algorithm perspective, I'm not asking specific guidance for next year, is it fair to assume kind of lower gross margins, but maybe more SG&A leverage on kind of a go-forward basis maybe than what we've seen historically just given the mix shift?\n\nJeff Davis -- Chief Financial Officer\n\nYeah. This is Jeff. Absolutely, from a standpoint of -- given the mix shift and some of the other cost pressures. You know, margin is much more under pressure.\n\nBut given this increase in revenue, the opportunity to leverage our SG&A is definitely there.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nGot it. Thanks.\n\nMike Wytinski -- President and Chief Executive Officer\n\nAnd I would just say, too. The other thing is, as Family Dollar continues to prove their execution and drive market share in these products and DSD and national brands, and then even in our private brands, vendor rebates and allowances will follow that because we're executing better. And Larry's team is really working hard on trying to drive that. So, it's really even the mix within the mix.\n\nAs consumables grow, there is levers that we can pull with allowances and rebates and then mix in the private brands as that consumer shifts, too. That should help with some of the margin pressure, too.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nVery helpful. Thanks, guys.\n\nOperator\n\nThank you. And we'll take the next question from the line of Joe Feldman from Telsey Advisory Group. The line is open now. Please go ahead.\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nYeah. Hey, guys. Good morning and thanks for taking the question. Wanted to ask you just to go a little deeper, on the private brands, where do you see the most opportunity? Like what maybe categories and where that you're focused on and where do you think you can drive incremental improvement quickly?\n\nMike Wytinski -- President and Chief Executive Officer\n\nI believe across the board. In Larry's team, we have staffed up. We've brought in additional experts in this area on the private brand for Family Dollar. On the OTC and health, over-the-counter drug and health is where we're going to be focused and leaning in first.\n\nAnd of course, on the paper side of it, we think there is opportunity. And then just on the everyday food side. So, those would be the three big areas. And I think Larry's team, we're organizing around it.\n\nWe're looking at the brands and driving penetration by category, comparing to the rest of the market. And we've partnered with a third-party broker to really help accelerate that. So, those would be the three big areas, and it's a huge focus for Larry and his team.\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nThat's great. Thank you. If I could follow up with maybe a bigger picture question. I think Rick had said in his prepared remarks that, you know, he views the company as kind of two really strong growth companies under one roof.\n\nAnd which I guess is not too different from the past, but it does imply that there's, you know, two different go-to-market strategies, which we know, and ways of doing business. So, I'm wondering, how do you guys leverage the scale of the overall company and the operations? And like has anything changed with that strategy to have these, you know, combined fulfillment centers and, you know, purchasing power being stronger? Maybe you can just give a little more color on that.\n\nRick Dreiling -- Executive Chairman\n\nHey, Mike. I think I'll lead with that if that's OK. Hey, what I would say is the things that how we go to market, how we face the customer between the two banners are totally different. One is basic consumable retailing, the Family Dollar side.\n\nOne is consistent everyday low price, one price point. The leverage, the beauty of the combination is all of the back side things that the consumer doesn't experience: the accounting, the HR, the legal. And that's where all of those synergies exist. Even on the supply chain, how we deliver to the stores, how [Technical difficulty].\n\nSo, all of those synergies are still there. But what we're doing a much different -- what I would think not only different but better job is with how we're facing the consumer, realizing that one is more emotional driven. And then again, one is more concerned with everyday excitement value. Michael, I'll turn it over to you on that.\n\nMike Wytinski -- President and Chief Executive Officer\n\nNo, I think you stated it right. Well, the customer facing side is where we're leveraging. But on the backside, we'll be leveraging all the opportunities we can as one organization.\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nThat's great. Thanks. That's a helpful response. Thanks, guys, and good luck with this quarter.\n\nOperator\n\nThank you. We will take the next question from the line of John Heinbockel from Guggenheim. The line is up now. Please go ahead.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nHey, guys, a couple of questions on Family Dollar merchandising. So, you know, one, given the size of the box, how do you think about product breadth versus depth, you know, that fundamental tension, and do you need to accelerate cooler capacity as part of the process? And then lastly, I know you're working on supply chain, right, to try to improve out of stocks. How quickly do you think that begins to impact the business, right? Is that kind of, you know, six months out, a year out, maybe not that long? Thoughts would be great.\n\nMike Wytinski -- President and Chief Executive Officer\n\nYeah. So, I'll start with the breadth and depth of Family Dollar. And, you know, again, Larry and his team is going category by category, and he's already made changes in our new H2.5. But that will be a continuous improvement throughout this next year.\n\nAs him and his team apply that discipline and strategy to each category, we will be bringing in more SKUs where it makes sense to help meet the needs of the customer and comparing it to the rest of the market. And where we've done that and the categories that he's done so far, we're seeing great results in it, and I think that's why we're excited about our 2.5. We're also using our linear space more. We're putting in more shelves inside the box, and then we can go vertically higher in the gondolas, the rows of shelving that we have right now.\n\nAnd again, that allows us to bring in more assortment into the store and getting more sales per square foot. The cooler is absolutely an improvement. And every time we remodel a store, we want to bring in more coolers, both cold -- cool beverage and frozen beverage, because that's where the customer is moving to. And it's a convenience item and it's meeting their needs.\n\nSo, there is room for continued expansion there. And Larry and his team has even really looked at a reset for the whole frozen food set. And we're -- we've rolled that out going into this back half of the year. So, that's going to be a continuous improvement side.\n\nAnd on the supply chain, I would say we're constantly looking at reenabling our supply chain, as Rick said, to try and drive efficiencies and making it easier for our stores. And we're seeing improvements right now on things that we're doing in our supply chain. So, I think you'll see it now throughout the next two to three years on how do we continue to refine our supply chain as a key enabler to drive the efficiencies and make it easier for our stores to get the product in the stores more efficiently.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. We will take the next question from the line of Edward Kelly from Wells Fargo. The line is open now. Please go ahead.\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nYeah. Hi. Good morning, guys. I wanted to ask about the Dollar Tree gross margin.\n\nYou know, you've hinted at the past that, you know, this potentially could be higher than 36% over time. I think if I try to sort of like, you know, look at where your run rating now based on a commentary around a little bit of incremental pressure in Q4, you know, maybe your run rating, you know, sort of high 35% range. Just thoughts around that. And then as we think about next year, you know, you do get a big freight benefit likely.\n\nHow do you think about, you know, investing that versus letting that flow through? And I asked that question because, you know, the consensus is probably in the high 37% range for next year. And it sort of all boils down to, you know, what do you think the right margin is for this business to provide value to customers while also delivering for shareholders?\n\nJeff Davis -- Chief Financial Officer\n\nYeah, thank you for the question. If you think about our margins right now, and as we think about a move forward, it's really driven by what the customer is really leading into and buying. So, right now, we're seeing a little more of a rotation into our consumables versus our discretionary. But yet, you're seeing good growth on both sides.\n\nWe like the balance of that. We're doing a number of things to continue to provide value to the customer and maintain that margin rate as best we can, recognizing right now that we're still under some level of product cost pressures, as well as from a freight component, but still being able to deliver, as you said, you know, high -- mid-30s types of margin rates. You know, as we move forward, we will continue to look to deliver value to the customer across both of those broad categories of discretionary and consumables. We believe that a number of things that we're doing with a multi price point will allow us to lean into the discretionary even more and hopefully continue to balance out that end of the business also.\n\nSo, it's really a combination of the two and it depends on how the customer is and their behaviors and their needs. And we're able to provide them across a broad continuum.\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. And we'll take the next question from the line of Michael Lasser from UBS. The line is open now. Please go ahead.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning. Thanks a lot for taking my question. Just within your last answer, you mentioned a mid-30% gross margin moving forward for the Dollar Tree banner. The Dollar Tree banner has $0.5 billion of costs that were negatively impacted from all the significant amount of freight and transportation over the last few years, especially container costs.\n\nContainer costs are now back to where they were in 2019 levels. So, understanding that there could be some mix pressure as the consumer focuses on consumables, why would you not get a more significant benefit to Dollar Tree's gross margin from the significant decline in freight cost moving into next year? Should we interpret that to mean that you have to make more sizable investments in Dollar Tree in order to maintain the sales productivity of that banner, especially now that you see how those stores that were early to raise prices last year are performing once they lap that? Thank you very much.\n\nJeff Davis -- Chief Financial Officer\n\nAs I look at this, there is definitely the opportunity as freight rates start to turn back around. That -- you know, we are on contract. Most of the business we do is on contracted carriers versus spot rates. So, there's going to be a little bit of a lag in that time frame.\n\nAnd at this point, we're not giving any guidance for 2023 as of yet. But to the extent that we continue to see the freight rates and the other trans-Pacific rates coming down and staying down, that will be reflected in our longer-term contract rates. We will then have the opportunity to balance that with giving back to the customer, as well as the shareholder. But having said that, that's only one component.\n\nThe other component is underlying product cost. And right now, there is as much pressure and many times in the product costs, underlying vendor product costs as there is in freight. So, you know, we have to balance the two and definitely keep an eye on, in my mind, how we create value for the overall organization is balancing that in being priced right in the marketplace for our customer, as well as providing a higher return to our shareholder.\n\nMichael Lasser -- UBS -- Analyst\n\nSo, if I can just follow up on that, Jeff. As of November 2022, you have 312 stores that are now anniversary-ing the rollout of the $1.25 price point from last year. Are those stores comping positively in the range with the rest of the Dollar Tree banner performance?\n\nJeff Davis -- Chief Financial Officer\n\nYeah. So, we're in a new quarter here. We're not going to give you interest quarter guidance. And it's really early for us to tell.\n\nSo, you know, I think that when we release our fourth quarter results, we'll be able to tell you more about that.\n\nMichael Lasser -- UBS -- Analyst\n\nThank you very much and good luck.\n\nOperator\n\nThank you. We will take the next question from the line of Michael Montani from Evercore. The line is open now. Please go ahead.\n\nMichael Montani -- Evercore ISI -- Analyst\n\nHey, good morning. Thanks for taking the question. Just wanted to ask, first off, if I could, on the SG&A side, if there's a level of comp that you feel you'd need for natural leverage into the fourth quarter and into 2023 in order to lever some of the expenses there? And then a follow up.\n\nJeff Davis -- Chief Financial Officer\n\nYeah, you know, Michael, it's a good question. You know, it's one in which what would be a natural level to leverage in normal circumstances versus what we are doing, as we had mentioned earlier, a good focus, continued focus and commitment around elevating our store standards, investing in not only store standards, but our wage rates for our stores. We're -- and the combination of the two. You know, we have been making some material investments.\n\nBut if you look over a period of time, we've been able to leverage our SG&A, if you will, on about a 2% to 3% comp.\n\nMichael Montani -- Evercore ISI -- Analyst\n\nOK. Thank you. And then if I could just follow up on capex. The past few years, it was trending around $8 a foot, and this year, it looks like it could be north of nine.\n\nSo, given some of the inflationary components there and the investments you all are making, is that kind of the right baseline, that nine-plus, to build off of or should we think of this as maybe some more catch up that could subside?\n\nJeff Davis -- Chief Financial Officer\n\nYeah, you know, once again, I don't want to give any guidance beyond 2022 other than what we've provided. The investments that we're making this year in technology and supply chain on top of our normal base is what's really driving the increase. And, you know, we believe it's the right thing to do as we set up for the right capabilities for us to accelerate our growth going forward.\n\nMichael Montani -- Evercore ISI -- Analyst\n\nThank you.\n\nOperator\n\nThank you. We will take the next question from the line of Chuck Grom from Gordon Haskett. The line is open now. Please go ahead.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nHey, thanks very much. Jeff, on the implied fourth quarter guide, can you help us think about the segments where you see more margin compression relative to the third quarter? It looks like you're anticipating operating margins to be down about 30 basis points or so. They were up about 70 basis points in the third quarter on a similar comp. So, just wanted to hold our hands on the segment for 4Q a little bit.\n\nJeff Davis -- Chief Financial Officer\n\nYeah, we historically have not given guidance necessarily on a banner basis. We look at it in total. The pressure that we're seeing is, once again, continued rotation in the consumables and how the customer is responding there, as well as we know that we are continuing to see other inflationary cost pressures across the P&L. But all of this is more -- was anticipated back when we gave our earlier guidance.\n\nIt's really the product mix shift that is the predominant sort of driver of our sort of direction around the lower half of the range.\n\nMike Wytinski -- President and Chief Executive Officer\n\nAnd the continued pressure on cost.\n\nJeff Davis -- Chief Financial Officer\n\nYes.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK, great. And follow-up question for Rick and Mike. Obviously, the price investments a few months ago were smart. I'm curious, when you think out over the next couple of years and the next big levers you can pull to improve productivity, you know, I guess what should we be thinking about? Mike, you touched on a little bit in terms of raising the [Inaudible] adding coolers.\n\nBut I guess maybe a little bit of looking inside the playbook on what to expect.\n\nMike Wytinski -- President and Chief Executive Officer\n\nYeah, I would say that --\n\nRick Dreiling -- Executive Chairman\n\nSo, Mike -- go ahead, Mike.\n\nMike Wytinski -- President and Chief Executive Officer\n\nGo ahead.\n\nRick Dreiling -- Executive Chairman\n\nYeah, I was going to say -- go ahead, brother. I'm sorry. Bye. Bye.\n\nGo.\n\nMike Wytinski -- President and Chief Executive Officer\n\nYou know, Rick opened up with the clean it up, fill it up, and straighten it up. I think getting the product filled in our stores and better store conditions and more consistently for our customer is one thing. I think that private brands is another big leverage. And I think the work that Larry and the team are going to do yet that we -- were really at the beginning of that, doing a better job on the category-by-category assortment that our merchants need and being priced right.\n\nI think those are the big levers inside our store to really keep driving the overall sales per square foot of our buildings.\n\nRick Dreiling -- Executive Chairman\n\nYeah. And I -- the only thing I would add to that is we are -- especially on the Family Dollar side, we are under-SKUed, and we are under-SKUed based on how we ship product to the stores. We tend to ship only in case packs versus eaches for the higher-margin, slower-turn merchandise. If you look at our cooler commitment, we are undercoolered, for lack of a better phrase, in our Family Dollar stores and probably our Dollar Tree stores.\n\nSo, there is lots of upside by managing the SKU base.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. We'll take the next question from the line of Kelly Bania from BMO Capital. The line is open now. Please go ahead.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nHi, Good morning. Thanks for taking our questions. I was wondering if you could just help us give us a little more specific magnitude of the product cost inflation you're seeing on the consumables versus the discretionary side of both businesses. And just with as you work with suppliers, are you seeing any light at the end of the tunnel in terms of the product cost inflation front?\n\nJeff Davis -- Chief Financial Officer\n\nYeah. Kelly, maybe the best way to describe the support dimension to it is if you take a look at our inventory and you take a look at our inventory on a year-over-year basis. And in my prepared remarks, I had mentioned that part of the inventory increase was as a result of last year, the cupboards being fairly bare last year as a result of, you know, customer pull forward and holiday and then us chasing goods. But even if you step back from that, about 40% to 45% of our increase in inventory on a year-over-year basis is a result of product -- vendor product cost increases.\n\nThere's another roughly 20% that is a result of higher freight costs associated with those inventories. So, just those two components represented about, you know, roughly 60%, 65% of the increase in the cost of our inventory. And that's what is now embedded in our inventory and then, of course, will be rolling through with respect to, you know, margins on a go-forward basis, in which we have been dealing with over the course of the year. Yeah, as it relates to -- you know, our merchant teams continue to be, I think, very resourceful in looking at, you know, different suppliers, negotiations, working with them around allowances, working with them across other ways to get support on the business.\n\nAnd then, of course, one of the things that is really important to us and Mike had mentioned is we're leaning into these private brands and the opportunity to blend that more into our offering. Our customers are looking for that opportunity, and it gives us more margin protection.\n\nOperator\n\nThank you. We'll take the next question from the line of Simeon Gutman from Morgan Stanley. The line is open now. Please go ahead.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nHey. Good morning, guys. It's Simeon Gutman. Following up on the freight question, I wanted to ask maybe a different way.\n\nSo, is part of it, you know, that the timing of contracts means that we don't see a lot of the savings in '23 or are you just reserving the right to figure out how to plan the business? There will be savings, but you're not sure of how to -- you know, how to reinvest or use the savings yet.\n\nJeff Davis -- Chief Financial Officer\n\nYeah. I think you're spot on as it relates to the freight. Those contracts and the way that we would recognize it is more of a forward look. So, it would be into a 2023 year.\n\nAnd then as that freight -- as we negotiate those new freight costs, we see those freight costs coming down, they would run through our inventory turns.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nOK. So, I guess it's a '23 into '24 phenomenon where the real savings builds up. Is that the right way to interpret that answer?\n\nMike Wytinski -- President and Chief Executive Officer\n\nWe wish to see it in the back half of the '23. We should start to see it. It's about a quarter drag. You know, we turn our inventories four times a year.\n\nSo, it's usually about a quarter drag. Once we start appreciating the lower rates, then we can see that in our product as it's coming through.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nOK. And then just my quick follow-up on the traffic on Dollar Tree. Can you talk about -- I'm sure this has been asked, but, you know, why it's like multiyear? I think it got a little better this quarter, but structurally, it's been down for the past several years. Can you talk about that? And then why shouldn't the right algo be you get price, but traffic is either flat or it could decline because it's hard to understand why the traffic has, you know, structurally been weaker over the last several years? Thank you.\n\nMike Wytinski -- President and Chief Executive Officer\n\nYeah, I would just say this. I think it's a lot due to our assortment that we provided for our customer. And the majority was that was on the consumer side. And then just during the pandemic, our customer, it was -- we weren't high consumable driven and high discretionary where they were -- when they had money in their pocket.\n\nTrips were consolidated in '20 and '21, and they were buying high-ticket items to decorate their homes, decorate outside, and replacing a lot of things inside their house. That's not where Dollar Tree is at our single fixed price point. So, '20 and '21 were OK for us. But when we saw the consumable side of the business, that assortment go away, that was impacting our traffic.\n\nThat's why I'm really excited about going forward. The last two quarters now, we're seeing that consumable sales come back, 9.4% comp in the third quarter, and we see that continue and especially on a consumable. And then on the frozen side of the business, we do see that traffic starting to settle back into what Dollar Tree has been known for, you know, that low single-digit traffic increases with ticket increase, to have a nice go-forward balance between the two. And continuing to balance our mix between consumable and discretionary, I think that's ahead of us and that's what the work that the team has been doing in the last two quarters.\n\nWe're seeing evidence of it.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThank you. Good luck.\n\nOperator\n\nThere are no further questions. So, I will hand it back over to your host to conclude today's conference. Thank you.\n\nRandy Guiler -- Vice President, Investor Relations\n\nThank you, Caroline, and thank you for joining us for today's call. Our next quarterly earnings conference call to discuss both Q4 and fiscal year-end results is tentatively scheduled for Wednesday, March 1, 2023. Thank you and have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRandy Guiler -- Vice President, Investor Relations\n\nRick Dreiling -- Executive Chairman\n\nMike Wytinski -- President and Chief Executive Officer\n\nJeff Davis -- Chief Financial Officer\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nMichael Montani -- Evercore ISI -- Analyst\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nMore DLTR analysis\n\nAll earnings call transcripts"
}