{
  "companyName": "Zscaler",
  "companyTicker": "ZS",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/01/zscaler-zs-q1-2023-earnings-call-transcript/",
  "content": "Zscaler (ZS 0.03%)\nQ1 2023 Earnings Call\nDec 01, 2022, 4:30 p.m. ET\n\nOperator\n\nThank you for standing by, and welcome to the Zscaler fiscal year '23 first-quarter results earnings conference call. At this time, all participants are in a listen-only mode. After the speakers' presentations, there will be a question-and-answer session. [Operator instructions] As a reminder, today's call is being recorded.\n\nI will now turn the conference to your host, Mr. Bill Choi, senior vice president, investor relations and strategic finance. Please go ahead, sir.\n\nBill Choi -- Senior Vice President, Investor Relations, and Strategic Finance\n\nGood afternoon, everyone, and welcome to the Zscaler first-quarter fiscal year 2023 earnings conference call. On the call with me today are Jay Chaudhry, chairman and CEO; and Remo Canessa, CFO. Please note that we have posted our earnings release and a supplemental financial schedule to our Investor Relations website. Unless otherwise noted, all numbers we talk about today will be on an adjusted non-GAAP basis.\n\nYou will find a reconciliation of GAAP to the non-GAAP financial measures in our earnings release. I'd like to remind you that today's discussion will contain forward-looking statements, including, but not limited to, the company's anticipated future revenue, calculated billings, operating performance, gross margin, operating expenses, operating income, net income, free cash flow, dollar-based net retention rate, future hiring decisions, remaining performance obligations, income taxes, earnings per share, our objectives and outlook, our customer response to our products and our market opportunity. These statements and other comments are not guarantees of future performance, but rather are subject to risks and uncertainties, some of which are beyond our control. These forward-looking statements apply as of today, and you should not rely on them as representing our views in the future.\n\nWe undertake no obligation to update these statements after this call. For a more complete discussion of the risks and uncertainties, please see our filings with the SEC, as well as in today's earnings release. I would also like to inform you that we'll be attending the following upcoming events in December: UBS Global TMT Conference in New York City on December 5, Nasdaq Investor Conference in London on December 6. Now, I'll turn the call over to Jay.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nThank you, Bill. I am pleased to share our Q1 results. For the quarter, our revenue grew 54% year over year and billings grew 37% against a difficult comparison. Normalized for higher billings duration a year ago, billings grew 42% as customers continue to embrace our Zero Trust Exchange platform to secure the digital transformation.\n\nOur disciplined approach to growth is enabling our operating profits to grow 76% year over year, with operating margins expanding by 150 basis points over the same period. Our free cash flow margin was 27%, which once again placed our performance above the Rule of 80 for the quarter, a combination of growth and profitability that we believe only 1% of the public SaaS companies achieve. As the world's largest security cloud platform, we have outstanding unit economics in our business reflecting high 90% gross retention rate and over 80% gross margins. These industry-leading retention and margins are possible because of our differentiated service and highly scalable multi-tenant cloud platform.\n\nIn September, Zscaler celebrated our 15th anniversary when cloud and mobility were in their infancy, we founded the company with a bold idea to transform security and the corporate network. We started with a clean slate and created the Zscaler multi-tenant in-line cloud platform, establishing modern Zero Trust architecture. This approach is now recommended by NIST, one of the most respected standards bodies in the industry. Our Zero Trust Exchange is built on a unique architecture that securely connects users, devices, and applications using business policies, regardless of their location.\n\nI could not be more proud of all our accomplishments to date, and I want to thank our employees, customers, and partners for being a part of this journey. The vision we started Zscaler with is even more relevant today. Hybrid work and public cloud adoption are now mainstream as organizations. Large and small, are racing to ensure their business operations are agile, resilient, and secure.\n\nThese generational tailwinds are durable and my conviction in our $72 billion serviceable market opportunity is greater than it has ever been. In my conversations with hundreds of IT executives, it is clear that cybersecurity remains their No. 1 priority. Cyber threats, including ransomware and data exfiltration, continue to grow exponentially as attackers exploit VPNs and firewalls.\n\nThis is driving more organizations from firewall and VPN-based castle-and-moat security to Zscaler's Zero Trust architecture. To meet this need, we launched a new certification program that provides comprehensive knowledge of Zero Trust architecture and practical guidance for the planning, design, and implementation of a Zero Trust architecture, enabling networking and security professionals to lead their organizations' secure digital transformation. In today's environment, ROI and cost optimization are becoming bigger priorities as business leaders are being asked to do more with less. Our Zero Trust Exchange eliminates the need for traditional security devices, either as on-prem appliances or virtual machines in the cloud that are difficult to maintain and require compromises between security, cost, and user experience.\n\nOur business value message is resonating in this challenging macro environment and more customers are willing to adopt our broader platform to consolidate multiple-point products, increasing our average deal size. As a result, we are actively working on more large, multiyear, multi-pillar opportunities than ever before, to align to the increasing deal sizes in each of our geo theaters. We reorganized our field-level customer segmentation and expanded our enterprise segment efforts at the beginning of this fiscal year. When we started in enterprise segment two years ago, it started with one global leader for all geos.\n\nAs this business has grown, it made sense for us to align this segment under each geo leader for faster decision-making closer to the customer. These changes contributed to a late ramp in the seasonally tougher Q1, but we believe these changes position us to scale to reach our next milestone of $5 billion in ARR and beyond. In Q1, even as we saw additional deal scrutiny and longer reviews on most deals, we grew our base of customers with $1 million or more in ARR by 55% year over year, ending the quarter with over 340 of these customers. As I mentioned before, customers are increasingly buying Zscaler for users, our complete platform for user protection, which includes ZIA, ZPA, and ZDX bundled together.\n\nThis accelerates our customers' transformation journey and makes us a critical partner for them. Now, let me highlight several such deals. First, pursuing a strategic initiative to modernize the business, our top 10 global banks made a four-year $10 million per year commitment for Zscaler for users driven by cloud adoption, including Microsoft 365 and Zoom. This customer needed a proven and scalable SASE solution to secure thousands of branch offices and hundreds of thousands of employees operating in more than 100 countries.\n\nImportantly, we met their requirement to eliminate the risk of legacy VPNs and lateral threat movement, which was a Board-level priority. Unlike a VPN in the cloud, Zscaler connect users to specific applications and not to the corporate network, which will significantly improve their security posture as employees unwittingly bring infected laptops back to the office, organizations need a true Zero Trust platform to eliminate the risk of lateral threat movement. Next, in an upsell deal, a Global 1000 financial services company in Asia after deploying ZIA for 110,000 users last year, upgraded to Zscaler for users, our entire user protection platform for all 130,000 employees. As a growing company, they are using Zscaler to quickly and cost-effectively open new branch offices with secure Internet connectivity, reducing the branch opening costs by 50% compared to legacy firewall-based architecture.\n\nAlso, CPA replaces their extensive VDI infrastructure with Zero Trust access. This customer said, and I quote, \"ZPA provides a far more seamless user experience versus our existing VDI solution. And now we will have visibility to which user is accessing which applications, one of our key security requirements.\" With this latest seven-figure purchase, this customer's total ARR more than tripled in just over one year. As these two wins illustrate, when these large financial services companies were ready to embrace the cloud, Zscaler was the only platform that met their needs.\n\nWith security as a major requirement, these financial services companies chose a proxy architecture with ability to inspect TLS traffic at scale and disqualified firewall-based SASE solutions. We now have eight of the top 10 global banks and seven of the top 10 insurance companies outside of China as our customers. I'm also excited to see more $1 million ACV wins in our Enterprise segment. Let me share a new enterprise customer in the tech sector who bought all four product pillars, ZIA, ZPA, and ZDX, for 4,000 users and posture control for workloads.\n\nZscaler is enabling this secure digital transformation with direct and seamless access to SaaS and private applications regardless of their location. This supports their remote-first strategy, enabling them to close 12 offices and consolidate half a dozen point products. This deal was sourced by a VAR partner and speaks to the progress we are making with the channel. As this win shows, deal sizes in the smaller enterprise segment are growing as customers adopt our broader platform.\n\nNext, we are also executing well on our federal government opportunity, which had a strong quarter. We remain the only cloud security service to have two products at the highest level of FedRAMP certification. These certifications are driving our federal business as the U.S. government pursues a Zero Trust strategy to enhance the nation's cybersecurity.\n\nWe had four deals in the Fed vertical that were each over $1 million, all of which included ZIA and ZPA. Our highly differentiated architecture which connects users to applications and not to the network, eliminating lateral threat movement was critical to winning these deals. We have now landed 12 of the 15 cabinet-level agencies as customers with plenty of opportunity to upsell at these very large organizations. As I mentioned, overall demand from customers to consolidate on our platform is growing.\n\nOur net retention rate has again exceeded 125% now for eight consecutive quarters. Happy customers buy more, and our Net Promoter Score continues to exceed 70 which is more than two times the average NPS for SaaS companies. We have a 6x upsell opportunity with our existing customers just for our core ZIA and ZPA product pillars. An important area of continued innovation, I'd like to highlight is data protection.\n\nOur comprehensive data protection offering has been gaining traction as customers are concerned about data leakage with employees working from anywhere. In Q1, we delivered an industry-first zero configuration data and protection service, leveraging and building on our eight years of innovation in AI and ML. This DLP service provides auto-classification of unstructured data to expedite deployments with zero configuration. In addition, we completed the integration of recently acquired ShiftRight, workflow automation technology with our data protection solution to enable organizations to manage hundreds of potential risks and incidents in a simple, yet very sophisticated way to significantly reduce case resolution time.\n\nData protection is the first of many areas where we will broadly integrate ShiftRight workflow technology into the Zero Trust Exchange platform. These additional features, combined with previously released Exact Data Match and Indexed Data Match technology makes us the leading data protection platform in the market. Beyond our core products, we are excited about the rapid adoption of our two emerging product pillars: ZDX to manage digital user experience and Zscaler for Workloads to secure servers and workloads. New ACV from our workload communication product is growing nearly 100% year over year.\n\nAnd our newest deception and CNAPP offerings are seeing strong customer interest. Let me highlight two upsell deals this quarter that were driven by our workload products. A Fortune 500 aerospace customer that is accelerating its AWS and SaaS adoption, purchased Zscaler for Workloads to inspect one petabyte of TLS-encrypted workload and IoT traffic per month, resulting in better security. This customer purchased our ZIA Transformation Bundle for 115,000 users two years ago as they've already committed to our Zero Trust architecture.\n\nIt was seamless for them to add workload protection, which is built on the same core Zero Trust Exchange. This seven-figure ACV workload deal more than doubles the customer's annual spend with us. In another upsell win, a longtime customer upgraded and expanded their purchase to ZIA, ZPA, and ZDX for 12,000 users and also added Zscaler for Workloads to accelerate the application migration to Azure. Zscaler for workloads now represents one-third of this customer's $1 million-plus annual spend with us.\n\nAs these customer wins illustrate our proven track record, running the world's largest in-line security cloud makes Zscaler the obvious and trusted partner of choice. Our Zero Trust Exchange processes over 270 billion transactions in line and prevents more than 7 billion security and policy violations per day, providing our customers an unmatched network effect for superior security. Our demonstrated ability to scale our cloud platform becomes even more important as we address hundreds of millions of workloads and billions of OT and IoT devices. In closing, while there are broader macro challenges and economic uncertainties, we are seeing an increase in large multiyear commitments for multiple product pillars.\n\nAs I mentioned earlier, as deal sizes have increased, we have adapted our field-level customer segmentation to better serve our customers and to deliver more consistent execution. Our consultative sales process enables our account teams to quantify the business value of our platform to remain close to the customers, especially at the C level, and to get deals across the line. I believe periods of uncertainty can act as a catalyst for change. Customers are engaging with us to embrace Zero Trust architecture consolidate point products, simplify IT, and standardize on the Zscaler platform, all of which delivers better security and lower cost.\n\nCIOs are telling me that they are using this challenging environment to drive change and to eliminate the technical debt of legacy point products, which are expensive to buy and operate. Customers are increasingly turning to Zscaler in today's challenging environment, while overall IT budgets are tightening, we believe that security budgets remain more resilient. We are bringing more innovations to customers than ever before while scaling our customer support and go-to-market organization. We believe we are still in the early innings of a significant market opportunity to enable secure digital transformation and achieve our $5 billion ARR goal.\n\nNow, I'd like to turn over the call to Remo for our financial results.\n\nRemo Canessa -- Chief Financial Officer\n\nThank you, Jay. Our Q1 results exceeded our guidance on growth and profitability even as we manage through additional deal scrutiny and longer reviews. Revenue was $356 million, up 54% year over year and up 12% sequentially. ZPA product revenue was approximately 19% of total revenue, growing 78% year over year.\n\nFrom a geographic perspective, Americas represented 52% of revenue, EMEA was 33% and APJ was 15%. Our total calculated billings in Q1 grew 37% year over year to $340 million against a difficult comparison. As we expected, billings duration was a headwind to growth this quarter. Our Q1 billings duration was above the midpoint of our normal 10 to 14 months range but was below last year's higher levels.\n\nWe estimate that duration negatively impacted our billings growth by approximately five percentage points. Normalized for this higher duration, our billings grew 42% year over year. Our remaining performance obligations, or RPO, grew 57% from one year ago to $2.682 billion. The current RPO is 50% of the total RPO.\n\nOur strong customer retention rate and our ability to upsell the broader platform have resulted in a high dollar-based net retention rate, which is once again above 125%. We have a strong base of large enterprise customers which provides us with a significant opportunity to upsell our broader platform. At the end of Q1, we had 348 customers paying us more than $1 million annually, up 55% from 224 in the prior year. The continued strength of this metric speaks to our large enterprise focus and the strategic role we play in our customers' digital transformation initiatives.\n\nWe added 128 customers in the quarter, paying us more than $100,000 annually, ending the quarter at 2,217 such customers. Turning to the rest of our Q1 financial performance. Total gross margin of 81.4% was up nearly 85 basis points year over year. Our total operating expenses increased 12% sequentially and 53% year over year to $247 million primarily due to higher compensation expenses from a very successful hiring quarter.\n\nOperating margin was 12% and free cash flow margin was 27%. We continue to expect data center capex to be around the high single-digit percentage of revenue for the full year. We ended the quarter with over $1.82 billion in cash, cash equivalents, and short-term investments. Before providing our guidance, I'd like to share a few observations about the current business environment.\n\nDemand for the Zscaler platform remains strong. Across our key customer segments, we're seeing deals getting larger as customers are trying to consolidate more and accelerate their security transformation around our Zero Trust Exchange. Customers are expanding their commitments with us from a targeted use case to a much broader platform-centric approach. In our opportunity pipeline, we're actively working on more multiyear and multi-pillar opportunities than we historically have.\n\nWhile good for our business, larger deals take longer to close as customers introduce more checks and reviews. In this environment, we think it's prudent to expect a higher level of review and scrutiny by our customers to continue. We'll continue to balance growth and profitability based on how our business is growing. In our outlook for fiscal '23, we intend to deliver operating margin expansion of more than 150 basis points, which is an increase from our prior guidance.\n\nNow, moving to guidance and modeling points. As a reminder, these numbers are all non-GAAP, which excludes stock-based compensation expenses and related payroll taxes and amortization of intangible assets. For the second quarter of fiscal 2023, we expect revenue in the range of $364 million to $366 million, reflecting a year-over-year growth of 42% to 43%; gross margins of approximately 80%; operating profit in the range of $42 million to $43 million; net other income of $8 million; income taxes of $4.5 million; earnings per share of $0.29 to $0.30, assuming 156 million fully diluted shares. Please note that starting in fiscal 2023, we adopted the new accounting standard which requires the use of the if-converted method for calculating EPS.\n\nTo account for our convertible notes, you will need to add back $360,000 in quarterly interest expense and includes 7.6 million shares to the fully diluted share count. For the full year fiscal 2023, we expect revenue in the range of $1.525 billion to $1.530 billion or year-over-year growth of approximately 40%, calculated billings in the range of $1.93 billion to $1.94 billion or year-over-year growth of approximately 30% to 31%. We expect our first-half mix of billings to be approximately 43% of our full-year billings guide. Operating profit in the range of $179 million to $183 million.\n\nOur guidance reflects 150 to 180 basis points of operating margin improvement compared to last year while growing revenue at 40%. Income taxes of $19 million, earnings per share in the range of $1.23 to $1.25, assuming approximately 157 million fully diluted shares. As noted earlier, to account for our convertible notes in EPS, you'll need to add back $1.4 million in annual interest expense and include 7.6 million shares to the fully diluted share count. Let me conclude with comments on our investment framework.\n\nWe remain confident in our ability to deliver on our tremendous growth opportunity while increasing profitability. We continue to see a robust pipeline and are prioritizing our investments in innovation and selling capacity, while also being thoughtful and prudent in managing our overall cost structure. The recurring nature of our business model gives us good visibility on top-line revenue and allows us to adapt quickly to changes in the market conditions while delivering on our operating profit and margin goals. As we have discussed, if we're growing revenue faster than 30%, you can expect less than 300 basis points of margin expansion in the year.\n\nWe remain confident of reaching 20% to 22% operating margins in the long term with a huge market opportunity and customers increasingly adopting the broader platform, we'll continue our disciplined approach to managing our business to maximize value for our shareholders. Operator, you may now open the call up for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Matthew Hedberg of RBC Capital. Your line is open.\n\nMatthew Hedberg -- RBC Capital Markets -- Analyst\n\nGreat. Thanks for the taking the question, guys. Maybe just a question on the sales segment reorg. Seems like a really good thing to kind of achieve these longer-term goals.\n\nMaybe just a little bit deeper understanding of what that looks like. And also, I think, Jay, you may have mentioned it, there was maybe a slight impact to Q1 billings as a result of that. Wondering if that was the case and if there's any way to quantify that.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nOf course, Matt. As you know, we start to pursue smaller enterprise segment a couple of years ago. At that time, we put the enterprise sales team under a global leader who directly reported to our CRO. As this segment has nicely grown, it was the right time for us to move it in the geo teams under geo leaders.\n\nSo, that was one change. The second, we made changes where accounts got redistributed among our four market segments at the field level, as you know, we've got major, we've got large enterprises, enterprise, and commercial. And this contributed to a late ramp in a seasonally tougher Q1, but these changes are done, and we're already seeing better results, better pipeline, and we think this is the right thing for us to do to grow to our big target of $5 billion ARR.\n\nOperator\n\nThank you. One moment, please. Our next question comes from Alex Henderson of Needham and Company. Your line is open.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nGreat. Thank you very much. First off, I'd like to compliment your outstanding execution in what is obviously a toughening environment. I was hoping you could give us a little bit of context of what's going on in the lower end of the marketplace for you.\n\nI know you don't do much in the SMB space, but that's obviously been an area that a lot of other companies have seen challenges. I was wondering if you were seeing any issues in what you call your smaller business segments. Thanks.\n\nRemo Canessa -- Chief Financial Officer\n\nYes. Alex, overall, I mean, I think all segments were impacted in the quarter. I think the macro environment, as you've mentioned, is that all companies are basically feeling the macro impact. The enterprise segment change that we made also impacted basically our results in the quarter.\n\nOn the lower end, we're doing OK, but it did impact all segments. I think it's more driven by macro than anything else.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nBut, Remo, the low end wasn't more impacted than others, so --\n\nRemo Canessa -- Chief Financial Officer\n\nYes. No, low ended a little bit better than the upper end.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nYes.\n\nOperator\n\nThank you. One moment, please. Our next question comes from Andrew Nowinski of Wells Fargo. Your line is open.\n\nAndrew Nowinski -- Wells Fargo Securities -- Analyst\n\nGreat. Thank you very much for the question, and congrats on another nice quarter. I guess I just want to ask a question on the billings guidance. Maybe a little bit less of a raise than you've done historically.\n\nI'm wondering, number one, did you factor in a change in duration? Or what kind of duration assumptions do you make with regard to your billings? And then did you add any extra levels of conservatism into that guide given the macro backdrop? Thank you.\n\nRemo Canessa -- Chief Financial Officer\n\nYes. The billing guide for Q2, the duration is similar to last year. It's slightly above the midpoint. One thing to call out for fiscal '23, Q3 is going to have headwinds because, in Q3 of last year, the duration was longer.\n\nRelated to the conservatism related to our billing guide, it's really related to what we saw happen in Q1. So, what we saw happening in Q1, we're taking forward into Q2 and for the rest of the year. What we're seeing basically is elongation of sales cycles. As we talked about, and Jay mentioned, on the prepared remarks, our deal size is getting bigger.\n\nCustomers are buying more of our platform. It's more of a platform sale, all good. Our pipeline is increasing, our pipeline is increasing by region, each region's pipeline is increasing. But whereas before, for the larger deals we talked about, it was nine to 12-month sales cycle.\n\nIt was trending down into more than nine months, now it's trending up more into the 12-month type range. So, all those things basically were taking into consideration with our guidance.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nRemo, if I may add, the strong pipeline in Q2 is what we feel pretty good about. But we do know that there's a closing time factor we are factoring in.\n\nOperator\n\nThank you. One moment, please. Our next question comes from Joel Fishbein of Truist. Your line is open.\n\nJoel Fishbein -- Truist Securities -- Analyst\n\nThanks for taking my question. Jay, just wanted to follow up on your comments about the Fed space. Obviously, being the only one that has FedRAMP high. I'd love to understand how you are positioned there competitively, how long the tail is on some of those deals as the government undergoes some of these security transformation projects.\n\nJust a little more color around that. Thank you.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nThe Fed business was quite good for us. We have been building on it. We are investing on it. And that's where it has taken us to all these certifications.\n\nThe impact of macro is less on the federal business. It has its own budget cycle goes through its own process. We now have landed 12 of the 15 cabinet-level agencies, and we're helping them, and they all start actually at a fairly small level, and they have been growing at a pretty decent pace, and so it's an early stage, though last quarter, we did have sizable $46 million project, which actually gets billed on a periodic basis. So, feel very good and strong about the Federal business, but Federal takes its own time in closing some of these deals.\n\nOperator\n\nThank you. One moment, please. Our next question comes from Hamza Fodderwala of Morgan Stanley. Your line is open.\n\nHamza Fodderwala -- Morgan Stanley -- Analyst\n\nHi, guys. Good evening, and thank you for taking my question. Maybe for Jay or Remo, feel free to chime in. So, obviously, macro is impacting every company.\n\nSo, that's clear. I think, on the other hand, Zscaler did have the chance to kind of give a full-year guide back in September. And it seemed like at that point, that a lot of your outlook seemed derisk for what we're growing macro concerns at that time. So, is it really the sales force changes that's driving that perhaps somewhat incremental headwind that you're talking about? And are we talking about a full-on sales reorg? Or is it just some tweaks that are being made to help you align better to your long-term growth opportunities? Thank you.\n\nRemo Canessa -- Chief Financial Officer\n\nYes. I'll start. I think it's both the macro basically things that we're seeing. For the full-year guide that we had at beginning of the year, we had $1.2 billion -- $1.92 billion of billings growth up to $1.94 billion.\n\nThe billings growth that we've revised it to is $1.93 billion up to $1.94 billion. So, the midpoint has increased. Macro is playing into it. And what we've talked about is that if there's uncertainty related to the macro, and that's why we gave the guide that we did and we tried to derisk basically our guide but it's really primarily the macro and also somewhat the changes.\n\nBut as Jay mentioned, the changes are pretty much behind us and things were looking very positive.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nYes. So, if I may add, first of all, it was not a full reorganization. As I said, we have four segments. And as our deals are getting bigger, some of these deals that sat in lower segments, they're getting bigger.\n\nThey need to be handled by the upper segment and so on and so forth. So, realigning the segment was good for us to optimize the deal size and who should be working on them, it's that. And the second was this lower enterprise team, which used to report to the CRO directly now is linked to geos. So, they're not massive changes, but they are more than normal that we typically have done.\n\nBut none of these deals are going away. We are well positioned. We're winning some already. We are working on more.\n\nAnd as I said, the pipeline as a result of some of these changes made is growing. And I feel very good and comfortable about it.\n\nRemo Canessa -- Chief Financial Officer\n\nYes. One other point. Really, when you take a look at the amount of accounts that shifted, it was a pretty substantial amount of accounts that shifted into the various segments. So, again, as we mentioned, as Jay mentioned before, we feel largely that is taken care of.\n\nCould there be some impact going forward, there is. But again, from our perspective, it's largely macro.\n\nOperator\n\nThank you. One moment, please. Our next question comes from Tal Liani of Bank of America. Your line is open.\n\nPlease make sure your phone is not on mute.\n\nTal Liani -- Bank of America Merrill Lynch -- Analyst\n\nHere you go. Can you hear me now?\n\nOperator\n\nLoud and clear.\n\nTal Liani -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. Thank you. I have two related questions. The first one is Prisma -- Palo Alto Prisma had much better-than-expected results on the same kind of like-to-like.\n\nAnd the question is, do you see any changes in the competitive landscape? Do you see any changes in the pricing dynamics and aggressiveness of other players that might drive some of the changes we're seeing? And the second question is kind of -- I want to understand the bigger picture. If someone asked me a year ago what could be the impact of economic slowdown, I would say that this particular area where you're acting should not be impacted much because you're replacing capex with opex, and you're actually enabling the change to customers without putting out tremendous capex upfront. So, if there are budget issues, they should actually do it. And the question is, why are we seeing this area impacted as well despite the fact that it enables companies to lower their spending if they need to?\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nYeah. So, OK, I'll start. Your first question about competition and pricing dynamics. I'll tell you on the higher end of the large enterprise segment, we haven't really seen much competitive changes at all.\n\nThese large enterprises aren't savvy. They look for the right architecture. They take this thing very seriously. And almost all these large deals, when firewall companies have tried to come in and compete, they're often excluded.\n\nI mentioned some of them during the call. So, I do wonder, where do those deals come from? Because if you ask me some of my largest deals, if you took top X-deals, we aren't really competing with the firewall companies out there. Price dynamics will matter if you really are competing. That's number one.\n\nBut also, number two, the service we're selling is very mission-critical. In fact, it's probably more mission-critical than Office 365. That's what I hear from CIOs because we are on the switchboard. We are connecting everything to everything.\n\nSo, we have not seen pricing pressure from competitive side of it. We have been told a few times that the customer said, yes, this vendor came and offered us a third, the quote price, but we decided we are not serious about it because it doesn't meet the requirements. Your second part of the question was impact of economic slowdown. It is very true that the area we are playing in really does two things for customers.\n\nOne, it's important cyber area. Number two, with consolidation, simplification, and standardization, customers do save money. So, those are the two things that are helping us a lot more than many other market segments. But when the broader macro is there's obviously some impact, but I would say, relatively speaking, it is far less than other areas.\n\nAs I had talked to many CIOs and CXOs, they don't see securely budget getting reduced much. As compared to IT budgets, we are in a much better shape, but there is impact. And sorry, and one part of the impact is these large deals are going more and more through CFOs and CEOs for approval.\n\nOperator\n\nThank you. One moment, please. Our next question comes from John DiFucci of Guggenheim. Your line is open.\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nThank you. So, guys, this macro slowdown is much different than the last one we saw due to COVID, where Zscaler benefited from more distributed access. So, as we look out into fiscal '23 and beyond, as we layer in the soft and perhaps softening -- further softening macro backdrop, how should we expect the appetite for new customers to undergo a transformation of their security paradigms?\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nYes. That's a good question. You're basically saying will new customers start transformation projects. It depends upon what kind of projects you're looking at.\n\nCIOs are prioritizing projects must-do versus projects that can wait. That's one part. But if you look at what we do, where we fit, OK? Cyber is not going away. The risk of cyber is still there.\n\nIt is a board-level discussion. It's happening. Number two, there is pressure on cost consolidation and simplification. Yes, while customers won't start big new projects, but projects that can be done without big investments, and they are being done.\n\nIf you look at the total IT budget of a CIO and the security is a fairly small part of it. By engaging at the CIO level, we are actually able to get a fair share of the budget. So, I think we feel pretty good about fiscal '23. Having said that, will there be a bigger hurdle to cross to close those deals? Absolutely, yes.\n\nBut to do so, you need two things. One, you need CIO, CXO level engagement, which we have traditionally done. Two, you need better business justification to make a strong case CFO that it makes sense. And we have been doing that for quite a while, and now the number of assessments, value assessment we're doing is actually much higher than it used to be.\n\nRemo Canessa -- Chief Financial Officer\n\nYes. A couple of comments, John. So, our split with new and upsell in Q1 was approximately 50-50. Now Q1 was driven -- Jay talked about on the call, Federal call, we had large Federal deals.\n\nAnd also, we did well in the financial sector with new accounts. So, that's on a go-forward basis, I still think for fiscal '23, as I mentioned before, probably the 40-60 range is probably the right way to think of things 40% new, 60% upsell. But we shouldn't lose track to how big this market is. I mean, this market from both user and workload, we estimate that two years ago to be $72 billion.\n\nThat's clearly bigger now. I mean, it's growing. And you look at the penetration that we have in this market, as well as others, we're in the very early stages still so as you go through this global economic macro environment, it's going to work itself through and we're in a position now that the macro environment is not favorable, but it will turn, it will turn. The advantage of Zscaler is that from a cost perspective, security perspective, and user experience, it is a top platform we feel in the world for networking and security.\n\nSo, again, we need to kind of wade through this macro environment, keep on executing, and we feel things will take care of themselves.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Roger Boyd of UBS. Your line is open.\n\nRoger Boyd -- UBS -- Analyst\n\nGreat. Thanks for taking the questions. I don't think you gave the contribution of emerging products to new business, and forgive me if you did. But it sounded like you did have some nice wins in the quarter there with ZDX and Zscaler for workloads.\n\nSo, I'm wondering if you can just update us on how you're thinking about upselling these solutions in the current environment relative to your guide last quarter for, call it, high teens percent of new business. Thanks.\n\nRemo Canessa -- Chief Financial Officer\n\nYes. Hey, Roger, they're tracking still to the high teens. So, they're doing well. ZDX and our cloud protection products are tracking in the high teens for the year.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nYes. If I may add, the ZDX has been our fastest-growing service. It has grown faster than ZPA if you look at a similar timeline or similar stages. And the cloud protection has two main areas.\n\nOne is what we call CNAPP, the API-security, that's a posture control product. And second is Zero Trust Workloads or in-line security, and we are the only vendor who has done tight integration between the two. And our actually customer interest has been pretty strong. Our new ACV nearly doubled year over year on our Zero Trust for Workloads.\n\nI talked about a couple of deals, large deals during the earnings thing, one was a seven-figure ACV workload to you. It more than doubled customers' annual spend with us. That's significant. Another deal I mentioned, workloads now represent -- one-third of these customers are $1 million annual cost spend with us.\n\nSo, these things, which used to be fairly small three, four quarters ago, are beginning to get pretty significant.\n\nOperator\n\nThank you. One moment, please. Next question comes from --\n\nUnknown speaker\n\nNice conversation. And if so, is it fair to assume that in the first -- hi. Can you hear me, guys?\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nYes.\n\nUnknown speaker\n\nHey. So, just a quick question. You talked about the pipeline growing. Just wondering, is the coverage ratio growing at a significant enough level to offset the elongation in sales cycles? Thank you.\n\nRemo Canessa -- Chief Financial Officer\n\nWe take that all into account in our guidance. So, it's all been taken into account in our guidance. And so, yes, it's been taken into account.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Fatima Boolani of Citi. Your line is open.\n\nFatima Boolani -- Citi -- Analyst\n\nHey, good afternoon. Thank you for taking my questions. Either for Jay or Remo, please chime in. I appreciate a lot of the commentary you've shared around the opportunity that you have with large multiyear, multi-pillar deals, the pipeline composition for those types of transactions is increasing, but against a much, much tougher environment.\n\nSo, there's a little bit of a dichotomy there, and I wanted to peel that back a little bit because if your business and execution and pipeline is that much more reliant on some of these larger deals and the environment is admittedly harder to execute it. What are some of the things that you are doing and that you have under your control to make sure that we don't see the type of slippage that could cause some more variability into your billings performance? And just as a related matter, are you changing incentive to ensure you're driving that type of behavior and successful close rates on those large transactions, which it seems like you're becoming more dependent on? Thank you.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nRight. Fatima, yes, multiyear, multi-pillar deals, those pipelines are growing. And yes, tougher environment with more scrutiny and more approval levels, that's what we're seeing. So, there are two significant trends that we have been doing that are helping us to make sure we're able to get those deals closed.\n\nOne is customers look for better business justification. That's what I mentioned on CFO-ready business cases, business value assessments, which we do to help quantify them. If you remove these eight-point security and networking products, this is the ROI you can get. And in fact, we're showing more than 200% ROI in many most majority of our cases.\n\nThat's very strong. It's -- we've done it. We're doing a better job in that area. The second thing to get deals done in a tougher environment is having strong C-level engagements because you're going to make a case there to show what needs to be done.\n\nAnd also, if you're part of the CIO's budget rather than just security budget, you actually have a better chance of doing it. Both of those things are helping us, and we are keeping those factors in mind as we are providing you our forecast.\n\nRemo Canessa -- Chief Financial Officer\n\nYeah. And from an incentive perspective, I wouldn't say we're doing anything out of the ordinary that we've done in any quarter. So, no real changes from an incentive perspective.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Mike Walkley of Canaccord. Your line is open.\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nGreat. Thanks for taking my question. Just maybe following up on that last answer. As you work with closing these larger deals, are these larger customers may be slowing their pace deployment to help their own opex in terms of how they're ramping deals or once you close them, they're ramping kind of similar to prior experiences?\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nYes. So, it's an interesting dynamic in the market. Market is tougher. But when CIOs look at what needs to be done, they look for consolidation, simplification that's driving our deals to get bigger.\n\nBigger deals mean more scrutiny. Now and -- but we are helping our customers to ramp into larger commitments to deploy our platform. So, it is a phased thing we are doing. So, we are -- we have been doing that for a few quarters, and it does continue.\n\nRemo Canessa -- Chief Financial Officer\n\nYeah. So, we're not seeing any increased ramping. It's always been part of our business. We've called it out.\n\nI mean, you look at the type of deployments we have with hundreds of thousands of users, you can't do that overnight. So, again, we're not seeing any increased ramping, and it's been part of our business for a long time.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Joshua Tilton of Wolfe Research. Your line is open.\n\nJoshua Tilton -- Wolfe Research -- Analyst\n\nHey, thanks guys for squeezing me in here. I just have two quick ones. First one goes back to Andy's question. I just want to ask it a little differently.\n\nIf 2Q has normal duration comps, is there any reason we shouldn't expect that billings growth should kind of return to this 40-plus range that you saw in Q1 after adjusting for the duration? And my second question is, if you look at the deferred revenue, it did decline sequentially from 4Q to 1Q for the first time in a while. So, just anything unusual to call out there.\n\nRemo Canessa -- Chief Financial Officer\n\nYeah. I mean, you've got our guidance. So, we feel comfortable with it and how we're going to come in. We'll see at the end of the quarter.\n\nRelated to the decline in deferred revenue Q4 to Q1, again, there's seasonality to our business. So, the growth rates from Q4 to Q1 have been very small. It declined slightly this quarter. Nothing really to call out other than seasonality and our performance in the quarter.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Peter Levine of Evercore. Your line is open.\n\nPeter Levine -- Evercore ISI -- Analyst\n\nGreat. Thank you for squeezing me here. So, maybe one just to kind of repeat, I think, on an earlier question from John, could you talk about what you're seeing at the top of the funnel, meaning -- given we are kind of closer to the tail end of the COVID work-from-home wave of deals that you saw. Could we -- is there a risk of a drop off in the pipelines or hit to net new billings, obviously, given the backdrop here, but it sounds like 2Q pipeline seems strong, but any color you can add to that?\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nYes. The Q2 pipeline is strong. It is a record pipeline. We did get some benefit of COVID, but that was starting in March of 2020 and most CIOs had to do something in a quarter or two of that.\n\nSo, most of the effect of COVID actually ended by mid of 2020. So, since then, it is kind of growth of our business driven by the need for security, transformation, digital transformation, and the like. I think we have been doing good pipe funnel. It is true that some of the changes we made in start of Q1 did kind of cause some slowdown for us.\n\nWe are past that. It's a good pipeline. And the question is how much -- how well do we overcome the scrutiny and extra level approvals to land the deals we need to land? And that's what we are working on. That's really part of our job but good strong pipeline.\n\nRemo, you want to add anything? OK.\n\nOperator\n\nThank you. Our next question comes from the line of Keith Bachman of BMO. Your line is open.\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nHi. Thank you very much. I wanted to ask Remo a question, and there's two parts to it. Remo, it's been talked about the billings beat this quarter was one of the smallest in many years, and you're moving the midpoint up, but the top end of the billings guide is remaining the same.\n\nThe macro has gotten tougher. Last quarter, I think a lot of us jumped off the call and said, it seems like Zscaler has derisked the numbers. But given all that backdrop, it just seems like there's been incremental risk introduced to the billings, and just wondered if you'd characterize -- would like to respond to that. And the second part of the question is you're raising up income by about $6 million from the previous guidance.\n\nAnd yet it seems like -- how would you respond to -- or why not raise it more, if in fact the growth isn't accelerating and you kind of keep the billing range the same, why not give a little bit more on the op income side. That's it for me. Thank you.\n\nRemo Canessa -- Chief Financial Officer\n\nYes. I mean, great questions, Keith. If the macro environment has changed. I mean, we talked about the uncertainty going into calendar '23.\n\nThere's a lot of uncertainty in -- mean you're seeing all the earnings reports coming out or most of the earnings reports. And we're all seeing the same thing. It's the macro backdrop, which is the primary reason. As I mentioned, secondarily, is the enterprise segment change, but that's a lot less.\n\nSo, the macro environment has changed. That's number one. Related to getting more operating profitability, as I mentioned, with our contribution margin as high as it is in Years 2 and 3, it's over 60%, getting to operating profitability is the easy thing, but I believe it's shortchanging the company and our shareholders. It's -- if you look at our free cash flow margin, you look at our profitability, we are increasing our operating profitability, we're going to be prudent and disciplined related to our approach and how we're going to run the business.\n\nThe key thing is -- and the size of this market, and it's early stage. Our priority is growth. And -- but we will -- as we go forward, as you've seen, a slight increase in operating profitability, we're more focused on operating profitability than we have been in the past. But it's going to be a measured approach from our perspective.\n\nIt will be measured in what we feel is the right balance and really true on our business.\n\nOperator\n\nThank you. One moment, please. Our next question comes from Shrenik Kothari of R.W. Baird.\n\nYour line is open.\n\nShrenik Kothari -- Robert W. Baird and Company -- Analyst\n\nHey, guys. Thanks for taking my question. Either for Jay or Remo, just chime in. You spoke about Federal vertical, call it, strength in financial services vertical clearly, a top 10 global bank for your $10 million commitment.\n\nSo, broadly, we'll be hearing, thinking in some verticals, the tech or CPG retail kind of getting impacted more than others, including public sector, defense, utilities more solid. Is that something that you guys are observing in terms of bifurcation or divergence in sectors there? Is there a guidance now building into itself a potential like spillover of macro into so far less affected verticals, yes?\n\nRemo Canessa -- Chief Financial Officer\n\nI'll speak specifically about the verticals. Jay, if you'd like to add more comments please do. In Q1, the verticals that we saw do well for us were financial federal services and healthcare, those were the strong verticals for us. Have we taken into account the impact of verticals going forward? The answer is yes, not specifically per vertical, but current customer and where that deal is in the deal cycle.\n\nSo, it is being taken into account. But speaking to other verticals, maybe Jay would like to comment more on that.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nYes. I think even though we did well some of the verticals, as Remo pointed out, I'm not sure overall vertical is a big, big factor. Macro is impacting broadly, but there are some verticals that have less, for example, in oil and gas, doing differently than many of others. But I won't say it's a big factor for us.\n\nIt is a factor but not a major factor.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Saket Kalia of Barclays. Your line is open.\n\nPlease make sure your phone is unmute. Our next question is from -- OK.\n\nSaket Kalia -- Barclays -- Analyst\n\nSorry. I'm so sorry. I was on mute there. Hey, guys.\n\nThanks for taking my question here. A lot of my questions have been asked. Jay, maybe for you, just a little bit of a broader one. Clearly, the fiscal year for Zscaler is very different, but then a calendar year.\n\nBut a lot of your customers operate on December fiscal years. Maybe the question for you is what have you heard anecdotally just on the prospect of budget flush this year from your customers? Is that something that you think is going to be more muted for security this year? Or is it more related to timing? Any perspective that you have there would be helpful.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nLook, as you have seen in the past few quarters, deals are getting more and more back-end loaded. We saw that a few quarters ago. We saw it in Q1, we think we will have a linearity thing similar to Q1, maybe a little bit better than Q1. But I don't think that December will significantly change everything out there.\n\nRemo?\n\nRemo Canessa -- Chief Financial Officer\n\nYes. I mean, from -- could there be a positive impact related to 12/31 December, there could be. From a linearity perspective there, Saket, I would be thinking something similar that we've had basically in Q4 and Q1, which is more back-end loaded. But can it happen? It can, but I would be thinking more of a similar type of linearity.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Adam Borg of Stifel. Your line is open.\n\nAdam Borg -- Stifel Financial Corp. -- Analyst\n\nAwesome. Thanks so much for taking the question. Just two quick ones just on the Federal space. Not sure if I missed it but what was the mix that the Fed business represented in the quarter? And when you think about the opportunity, it's great to hear those wins, is it really just on ZIA and ZPA? Or what's the opportunity for ZDX and Zscaler for Workloads in the federal space? Thanks.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nI'll start at the broad level, Remo, and then you can get into specifics. Yes, Federal is most of the stuff in place is ZIA and ZPA but it's building strong interest on ZDX and some of the newer products. But currently, it's a strong mix of ZIA and ZPA.\n\nRemo Canessa -- Chief Financial Officer\n\nYeah. From -- as Jay mentioned, 12 of the 15 cabinet agencies, four deals greater than $1 million. It's clearly a good quarter for us at Federal. We'll be getting -- how Federal is doing on an annual basis on a new and upsell perspective, so -- but Federal was a strong, good quarter for us in Q1.\n\nOperator\n\nThank you. Ladies and gents, that concludes our conference. I'd like to turn the call back over to Jay Chaudhry for any closing remarks.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nThank you for your interest in Zscaler. We look forward to seeing you at upcoming investor events. Thank you, and goodbye.\n\nRemo Canessa -- Chief Financial Officer\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBill Choi -- Senior Vice President, Investor Relations, and Strategic Finance\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nRemo Canessa -- Chief Financial Officer\n\nMatthew Hedberg -- RBC Capital Markets -- Analyst\n\nAlex Henderson -- Needham and Company -- Analyst\n\nAndrew Nowinski -- Wells Fargo Securities -- Analyst\n\nJoel Fishbein -- Truist Securities -- Analyst\n\nHamza Fodderwala -- Morgan Stanley -- Analyst\n\nTal Liani -- Bank of America Merrill Lynch -- Analyst\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nRoger Boyd -- UBS -- Analyst\n\nUnknown speaker\n\nFatima Boolani -- Citi -- Analyst\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nJoshua Tilton -- Wolfe Research -- Analyst\n\nPeter Levine -- Evercore ISI -- Analyst\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nShrenik Kothari -- Robert W. Baird and Company -- Analyst\n\nSaket Kalia -- Barclays -- Analyst\n\nAdam Borg -- Stifel Financial Corp. -- Analyst\n\nMore ZS analysis\n\nAll earnings call transcripts"
}