{
  "companyName": "JD.com",
  "companyTicker": "JD",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/jdcom-jd-q2-2022-earnings-call-transcript/",
  "content": "JD.com (JD -1.68%)\nQ2 2022 Earnings Call\nAug 23, 2022, 8:00 a.m. ET\n\nOperator\n\nHello, and thank you for standing by for JD.com's second quarter and interim 2022 earnings conference call. [Operator instructions] Today's conference is being recorded. [Operator instructions] I would now like to turn the meeting over to your host for today's conference, Mr. Sean Zhang, director of investor relations.\n\nPlease go ahead.\n\nSean Zhang -- Director of Investor Relations\n\nThank you. Good evening and good day, everyone. Welcome to JD.com's second quarter and interim 2022 earnings conference call. Let me introduce the management team on the call today.\n\nCEO of JD.com, Mr. Lei Xu, will kick off with opening remarks. Our CFO, Ms. Sandy Xu, will discuss the financial highlights.\n\nAfter that, we'll open the call to questions from analysts. I would like to remind you that during this call, our comments and responses to your question reflect management's view as of today only and will include forward-looking statements. And please refer to our latest safe harbor statement in the earnings press release on our IR website, which applies to this call. We'll discuss certain non-GAAP financial measures.\n\nPlease also refer to the reconciliation of non-GAAP measure to the comparable GAAP measures in our press release. Also, please note, unless otherwise stated, all figures mentioned in this call are in RMB. And now I'd like to turn the call over to Mr. Xu, our CEO.\n\nMr. Xu?\n\nLei Xu -- Chief Executive Officer of JD Retail\n\n[Foreign language] Hello, everyone. This is Xu Lei. Thank you for joining JD.com's 2022 second quarter earnings call. In the second quarter, a combination of factors has brought unprecedented challenges to the radio and consumer industry in China, such as the COVID resurgence across many regions and the complex macroeconomic and external environment.\n\nChina's GDP grow 0.4% year on year, while total radio sales fell 4.6%, both hitting their lowest levels on the past two years. Despite all that, JD managed to help its users and partners to through difficulties and continue to outpace China's overall retail industry while delivering steady improvement in operating efficiency and margin. This once again demonstrates JD's resilience and healthy momentum through difficult cycles. China's economy has experienced a rapid development for a long time, but economic development is thought to be cyclical, creating theoretical challenges for businesses.\n\nCompanies need to have a long-term line sight and proactively build strategies and capabilities that will support its growth for the long term. This will enable them to mitigate cyclical fluctuations with resilient, showcase greater value, and lay a stronger foundation for the long life. This mindset is fundamentally different from that of pursuing explosive short-term growth. Now I'd like to share with you why JD remains confident in the future and what we are doing amid a challenging macro environment.\n\nFirst, we have always focused on user experience, cost optimization, and efficiency to build a long-term business model and core competencies. In Q2, our annual active user base remains strong, mainly driven by healthy user growth in our form JD retail business, which recorded a substantial net position of over 10 million users and double-digit percentage growth on a year-on-year basis. On top of this, our long-standing pursuit of superior [Inaudible] further propelled user quality, as evidenced by the increases in DAU's user shopping frequency and spending. In particular, our DAU achieved a 25% year-on-year growth in Q2.\n\nLooking at different user segments, JD numbers, who are amount of users with higher consumption power stickiness, further expanded by 5 million in the first seven months and passed 30 million user milestone last month. While scaling up, plus members alternating high average admin spending, which was eight times from that of the non-plus members by Q2. We're also pleased to see that our new users have more appreciation and trust in JD, with a notable increase in ARPU and record high shopping frequencies for the past three years. More female, Gen Z, and elderly groups are becoming modern users of JD, thanks to our efforts over the years to always treat consumers and sharing everyone's love.\n\nThis also set a solid foundation for our user's growth and quarterly improvement in the second half of the year and the year to come. JD continues to drive forward its long-term strategy based on three pillars, namely, consumer, merchandise, and shopping scenarios. As such, we have made a leveling effort in exploring low-tier market, building core capabilities in the supply chain needle platform, expanding omnichannel or interest rate business, and further strengthening our online marketplace ecosystem. The lower tier market has also always been an important incremental part of our addressable market, and we have made a long-term commitment to it.\n\nIn light of the evolving macro and industry environment, as shared before, we have shifted our focus to the efficiency of our resource allocation in the area. Moving to the supply chain platform. We believe that this is far more than a driver to improve our gross margin and cost structure and plays a key role in increasing operating efficiency in the retail industry, boasting breakthroughs and innovation for mature brands, and capitalizing rapid development for emerging brands. JD has integrated and synergized three networks, including our transaction network that covers round-the-clock omnichannel shopping scenarios, a warehousing and a distribution network that serves nationwide and extends globally, and a service network that is enabled by intelligent technology.\n\nSeamless integration of all three networks overcome the pain point of a single network and not only ensures the reliability of JD's own supply chain, but also drive digital transformation and efficiency improvement, both up and downstream industry players, supporting the high-quality development of China's real economy. In the future, high- efficient and flexible supply chain capabilities will be a top priority for the sustainable development of China's retail and other inventory. COVID resurgence and the complex environment has made this even clearer to an increasing number of companies. China has made significant programs in developing supply chain capabilities, but there is still room for improvement.\n\nJD is well-positioned and determined to provide the industry best-of-class supply chain solution. JD Logistics healthy development is a strong testament to our supply chain capabilities, which are empowering this industry. Amidst the COVID resurgence, JD Logistics once again spared no efforts to protect the people's livelihoods. As one of the first batch of companies working with local cities to ensure supply of gaming necessities, we have gained wild recognition through.\n\nAt the same time, JD Logistics leverages integrated supply chain, logistics service capabilities to solve the supply chain disruptions faced by many external customers, such as in FMCG, home appliance, furniture, apparel, 3C, automobile, and fresh produce industry. As a result, JDL achieved a steady growth in total revenue during the quarter and maintained double-digit growth in external revenues and the number of external customers. During the quarter, JDL's external revenues accounted for nearly 60% of the total revenues. In addition, JDL continued to expand its logistic infrastructure globally.\n\nBy the end of Q2, it operated over 1,400 warehouses and managed the total GMV of approximately 25 million square meters. Our omnichannel business maintained healthy momentum in Q2. Although COVID brought significant challenges to the retail industry, our intra-city retail business continued to deliver triple-digit year-on-year growth. The evolution of the retail industry validates our early decision to expand into the omnichannel business.\n\nAnd we have formed differentiated perspectives and strategies around this business. First, JD's customers naturally associate us with shopping. And while developing our intra-city retail business, we further explored that association and customer needs in decentralized scenarios. Also, with strong capabilities in supply chain, B2C sales, and user management, JD is also to establish more comprehensive cooperation with partners to help them efficiently adapt to the market changes and meet consumers' instant needs in various scenarios, thus leading the retail industry's cost optimization and improvement in efficiency and user experience.\n\nWe're also pleased to see that the interest in the retail industry is booming. JD will further leverage its existing core capacities to explore new business models, improve technical capabilities and expand omnichannel with multiple business forms. JD has been striving to build a healthy and sustainable ecosystem for merchants and has already laid a solid foundation. In Q2, a number of categories, including home appliances, sports and outdoor, and cosmetics, continue to outperform the industry.\n\nWe have been expanding our ecosystem for merchants, including both top brands and SME as they are more willing to deepen cooperation with business partners like JD that can bring -- that can help them navigate the impacts from COVID and the macro conditions. In this quarter, we revamped and upgraded JD's main app, reconstructed our traffic allocation mechanism, and provided more refined digital tools to build a better operating environment for merchants. During the 618 grand promotion, merchants achieved better growth and contributed a higher proportion of sales compared to a year ago. By building a more open and inclusive ecosystem, JD will continue to leverage its supply chain, logistics, technology, and service capabilities to join hands and grow together with more merchants.\n\nTo conclude, I'd like to reiterate our thoughts on the cyclical adjustment of the economy and the long-term mindset that companies need to have. Economic development cycles, but that doesn't mean it loses long-term momentum. And we believe that the retail industry has the power to weather different cycles. In face of the current macro and the industrial adjustment, what's important for JD is to further strengthen our core capabilities, increase operating efficiency, and ensure healthy margins and cash flow, while at the same time, continuing to invest in innovations and the strategies that will position us well for the future.\n\nLooking ahead, there may still be uncertainties. But from a long-term perspective, we believe that China's consumer market has strong vitality and will become the world's largest in scale. While coming out of the cycle adjustment, we expect to see strong recovery momentum. We will continue to build upon our strength and capabilities to better capture opportunities and prospects for the long term.\n\nWith that, I'd like to give the floor to Sandy.\n\nSandy Xu -- Chief Financial Officer\n\nJD has been playing a vital role to serve customers with daily essentials, to help our business partners manage their business efficiently in China and overseas, and to support many cities in their efforts to boost consumption. Our solid second quarter results continued to demonstrate our ability to serve our customers and business partners, while manage our business effectively despite the challenging operating environment. In the second quarter, our net revenues reached RMB 268 billion, representing a solid 5% year-on-year growth, despite the COVID-related disruptions, particularly in higher-tier cities, and the tough comps as we lap the strong recovery from last year. Our GMV, excluding unpaid and canceled order, came out from the result in April and has seen a gradual improvement in growth as COVID-related supply chain and logistics disruptions subsided starting from the end of May.\n\nProducts revenues were up a solid 3% year on year, reflecting the outperformance of our online retail business, which helped to secure a stable supply of the essential goods for our users. Our annual active user base remains resilient at 581 million, mainly driven by over 10 million net addition of active users in core JD Retail business from the previous quarter, partially offset by the adjustment in our C&C business, which I will elaborate later. Service revenues grew by 22% year on year to RMB 41.6 billion and exceeded 15% of total net revenue for the first time in history. Many merchants face operational and logistics bottlenecks during the COVID and increasingly turned to JD's reliable supply chain infrastructure to weather the challenges.\n\nAs a result, logistics and other services revenue grew by 38% year on year in Q2, which I will talk in details later. Our marketplace and marketing revenues grew 9% year on year and exceeded the RMB 20 billion mark in Q2. In particular, our advertising revenues reported a healthy double-digit percentage growth, which is faster than our commission revenue, as we proactively rolled out relief measures for SME merchants. In the quarter, we saw that many business partners and merchants, especially those from the electronics and cosmetic categories, allocated additional advertising dollars to boost recovery.\n\nMoreover, thanks to our improved ecosystem, we here and new merchants on our platform gain more user and sales traction during the June 18th grand promotion and subsequently contributed more sales than before. Now let's turn to our segment performance. City retail's revenues grew 4% year on year and reached RMB 242 billion in Q2. I'd like to share three consumption trends that we observed in the second quarter.\n\nFirst, customers continue to shift purchases from discretionary goods to daily essential item, which has driven our general merchandise revenue up by 8% year on year in Q2. Notably, our largest growth category, supermarket, continued to see its order volume growing over 25% year on year and it serves users' daily needs anytime and anywhere. We are also encouraged to see revenues for healthcare, home goods, sports and outdoor, cosmetics, and MRO recording double-digit growth and outpacing the sector. The trends reflected our expanding user mind share across many of our emerging categories.\n\nElectronics and home appliance category reported a static revenue compared to the same quarter last year. Both computer and home appliances maintained solid growth in the quarter despite the fulfillment bottlenecks and our commitment to prioritizing delivery of less essentials during COVID resurgence. Mobile phones experienced a soft performance in the quarter amid a sluggish sector momentum. Meanwhile, we are also encouraged to see that since the logistics bottlenecks needs [Inaudible], our electronics category has experienced a nice rebound and has been outperforming the sector again, thanks to our strong consumer mind share and industry-leading supply chain capability in this category.\n\nFinally, fulfilled gross margin of JD Retail was up by 50 basis points compared to the same quarter last year. Although the COVID resurgence added to the operational complexity as well as our fulfillment cost, the incremental cost was more than offset by an increase in gross profit. Most categories have benefited from increased user traffic as daily top customers mine for reliability. And as a result, we experienced savings on marketing and promotion.\n\nOn top of this, we also enhanced our operating efficiency and focus on ROI of general marketing spending and other opex. As a result, JD Retail's operating margin reached 3.4% in Q2, an improvement of 80 basis points from a year ago. JD Logistics or JDL was an important pillar that underlies our ability to navigate the supply chain complexity. Its Q2 revenues grew 20% year on year to RMB 31 billion.\n\nWith its proprietary logistics network, JDL was one of the few companies that could still work around the challenges and support fulfillment services that many customers and merchants critically needed in an uncertain time. Subsequently, revenues from external customers continued to outgrow internal revenue, further diversifying JDL's revenue stream. More impressively, JDL's ongoing operations and technology optimization and changing cost discipline more than offset the incremental fulfillment cost arising from resulting staff subsidies and protective measures during recent COVID outbreaks. Therefore, its non-GAAP operating margin improved 150 bps from a year ago and turned positive in Q2.\n\nJDL is well on track of improving its profitability even in this challenging operating environment. Dada reported revenue of RMB 2.3 billion and an operating loss of RMB 424 million. In this year's June 18th promotion, Dada further enriched customer shopping experience through extensive omnichannel collaboration with 150,000 offline stores across China. As a result, the number of users who placed orders through Shop Now increased by over 400% compared to the same period last year.\n\nDada plays an essential role in executing our important omnichannel or intra-city retail initiative, which has been growing triple-digit percentage, as Xu just mentioned. Finally, due to the evolving macro conditions, we reviewed and rationalized our strategies in different parts of our new business segments. On one hand, we proactively implemented cost control measures and strategic alignment in our new businesses in face of the challenging internal environment, particularly in the business. So the operating loss was reviewed, both sequentially and on a year-on-year basis.\n\nOn the other hand, we continually pursue long-term growth opportunities, through technology, innovation, and our new -- and new business models, where we may adjust our pace of investments from time to time based on market conditions. JD Property recently entered into agreements to set up its third logistics property core farm on top of the two core farm that were successfully launched before, which will bring the total transferred AUM to surpass RMB 27 billion upon the completion. Moving to the consolidated bottom line. In face of the additional costs arising from the macro uncertainties and fulfillment complexity, we effectively managed our capital allocation across businesses to focus more on our core business and further enhanced operating efficiency by putting different levers in cost control.\n\nAs a result, Q2 non-GAAP net income attributable to ordinary shareholders was RMB 6.5 billion, with non-GAAP net margin of 2.4%, representing a year-on-year improvement of 60 basis points. On a GAAP basis, net income attributable to ordinary shareholders also turned positive to RMB 4.4 billion, with GAAP net margin up 1.6%. Our free cash flow for the trailing 12 months this quarter sequentially improved to RMB 27.7 billion, mainly driven by robust operating cash flow as a result of healthy margin improvements in business and prudent cash management in addition to the seasonality factor. By the end of Q2, cash and cash equivalents, restricted cash and short-term investments added up to a total of RMB 207 billion, up from RMB 186 billion last quarter.\n\nDuring the quarter, we have turned close to -- we have returned close to RMB 15 billion in cash to our shareholders through cash dividends and share repurchase, which amounted to over 20% of all our accumulated retained earnings in the last three years. Before I close, I would like to emphasize that while the increased uncertainties in the near term will prove to be challenging for every industry player, including JD, it's also an opportunity for us to strengthen our market position as we are better positioned to grow our business effectively and manage our resources cautiously. We are confident to press the hat with resilient performance, primarily due to two drivers. First, thanks to our proprietary supply chain capability, we are able to quickly adapt to the changing environment and support customers and business partners who were proving for uncertainty.\n\nThis enables us to further strengthen our consumer mind share and continue to outperform the industry. Secondly, relentless focus of operating efficiency and investing our resources effectively has always been the backdrop of our unique business model. And it is playing a bigger role in securing our long-term high-quality growth going forward. With that, let's open the call to the Q&A.\n\nThank you.\n\nOperator\n\n[Operator instructions] Our first question will come from Ronald Keung with Goldman Sachs. You may now go ahead.\n\nRonald Keung -- Goldman Sachs -- Analyst\n\n[Foreign language] Thank you, management team. I would love to see whether you could share how your expectations for second half growth. Have you seen any further consumer confidence improvement through July and August? And I can see that second half last year and during singles day, your performance was very strong. Much of the output outpace the industry.\n\nSo for this year, do we have any strategic strategy on categories, delivery formats, and shopping formats, even live streaming? Any of those strategies that we are planning to drive this second half growth? Thank you.\n\nLei Xu -- Chief Executive Officer of JD Retail\n\n[Foreign language] And let me take your question. And early to see that, for this quarter, we are facing a lot of challenges, actually the most challenging quarter since we are listed. And I don't need to elaborate a lot on the reasons. And there are different impacts of the macroeconomics and The COVID resurgence, but leveraging on JD's supply chain capabilities and our staff user quality were less affected compared with all industry.\n\nAnd on the different categories, they are reflecting different conditions, for those categories that are closely related to the essential products, medical expenses, consumer products, home appliances, and health-related categories, as well as JD's omnichannel business and or intra-city retail business, they're seeing a quick growth. And also JD has been deploying our online and offline development. This also helped us to maintain a healthy and stable growth. And for some other categories that are long tail and are nonessential such as apparel, there have been weak demand, so too the alcohol category because their shopping scenarios are limited.\n\nAnd however, on these categories, JD continued to expand our market share. Also worth mentioning is the mobile phone industry. As we see, they are facing multiple challenges. And we see the consumers, they're prolonging their phone changing cycles.\n\nAnd for the short term, as natively, we will continue to face tough headwinds. But for the long-term, as I've just shared, we continue to be confident to the long-term China's macro economy and consumption trends. And since day one of JD, we start to build our supply capabilities, and we do have same [Inaudible] the value of these capabilities. And we think we have also -- we have the responsibility to use our supply chain capability to support the projected development of the whole industry.\n\nSo in the coming times, we will continue to focus on quality growth and continue to enhance our market share among our consumers, expand our market share and be vital to our margins and healthy cash flow. And a lot of people are paying much attention to our strategy [Inaudible] from strategies, it won't change. It will stay for a long time. And portfolio aspects, it will continue, it will always continue to be our main forecast -- focus.\n\nFirst is user experience; and second, our building of the supply chain capability; and third, it's a large base for us to continue to improve our cost and efficiency; and fourth is our investment in technology; and fifth, we continue to develop innovation business under -- in a disciplined approach. And from the tax perspectives, number one, we will continue to deepen our lower-tier market to expand our reach to consumers. And second, we will deploy intra-city retail business, working on the shopping scenarios to deepen our understanding and insights on consumer needs. And thirdly, we will continue to build our supply chain capabilities and this is from a merchandise perspective.\n\nEven though we are in a leading position in terms of the supply chain, we see ourselves, there is still a lot of room to improve. And fourth, we will continue to build an open platform ecosystem. And these four aspects will remain a long-term tactic for us to continue. Thank you.\n\nRonald Keung -- Goldman Sachs -- Analyst\n\n[Foreign language]\n\nOperator\n\nOur next question will come from Kenneth Fong with Credit Suisse. You may now go ahead.\n\nKenneth Fong -- Credit Suisse -- Analyst\n\n[Foreign language] Congrats on the strong result and thanks for taking my question. We saw a very meaningful uplift in operating efficiency in the second quarter. As internet company continue to go through cost optimization, how should we think about the margin upside for our business, especially we are already very efficient? Thank you.\n\nSandy Xu -- Chief Financial Officer\n\nThanks for the question. This is Sandy. Let me take this one. Overall, looking ahead, as mentioned before, given the increased macro uncertainties and fulfillment complexity due to COVID resurgence, we are more focused on the effectiveness of our capital allocation across different business units and the improvement of operating efficiency this year to ensure our company, our group is in healthy cash flow and balance sheet position, well prepared for the next billing cycle.\n\nSpecifically, for JD Retail, we expect that the fulfilled gross margin of most core categories to continue to improve in Q3 year over year and quarter over quarter, especially the supermarket category. And the profitability improvement actually comes from a better marketing and operating efficiency and our expanding economies of scale. Retail is -- fundamentally, it's a business of scale. And we believe that JD Retail's long-term margin improvement trajectory will continue to be demonstrated.\n\nAnd for JD Logistics, even though we still expect to incur some additional costs due to various types of COVID costs here and there, so far, the magnitude is not as significant as that in Q2. So JDL continues to demonstrate the value they could bring to their customers, i.e. the efficiency savings and better service quality, which are reflected in JDL's improving gross margin. We will try to maintain the full year bottom line target for JDL.\n\nAnd then for new business, as you all know, we started to adjust our investment pace in new business since the end of Q1. Our management team are more focused on cash flow and profitability. We expect that our investment scale in new business will decline both year on year and quarter over quarter. So for the group as a whole, we have better control over and confidence in the bottom-line performance.\n\nWe expect the near-term profitability at the group level to improve meaningfully year over year. And we will continue to focus on quality growth and creating value for our shareholders. We'll continue to gain market share in our core businesses, maintaining our commitment to invest for the long term. Thank you.\n\nLei Xu -- Chief Executive Officer of JD Retail\n\n[Foreign language] I'll just add a few words on the supply chain. I think many people think JD's supply chain capabilities is in a leading position in China. Even though we also think so, but we also see that there a plenty of space for us to improve on these assets. So we have been reiterating a lot on our mission to improve our supply capability.\n\nSo for example, in the past, we are thinking about supply chain from our own perspective. But for now, we are more taking a more holistic approach and thinking of our partners. So both internal and external collaboration before enforcement and inching building. So from internally, we have seen the supply chain capabilities on different categories are different.\n\nSo we are improving those and making a high standard for the overall capabilities on supply chain on all categories. So before, we think a lot -- think more mainly focused on the online supply chain. The product development with the offline man collaboration with external partners will also be both online and offline externally. And in the past, we think we are operating in a normal situation.\n\nBut given the outbreak of the COVID and the special situations, even though we're [Inaudible], we're taking it to a consideration of how we can better perform in extreme or special situations to run our supply chain. I also want to say that even though I hear a lot of companies are talking a lot about improving their capability on supply chain, but I want to point out that JD has been developing our supply chain and building [Inaudible] in the field in about 20 years of our development. We have been investing in it and just evolving our understanding of this field for a very long time. So I want to just say that we will as willingly continue to develop supply chain in our -- according to our own understanding, in our own direction, and will not follow any other people's.\n\nThank you.\n\nKenneth Fong -- Credit Suisse -- Analyst\n\n[Foreign language]\n\nOperator\n\nOur next question will come from Thomas Chong with Jefferies. You may now go ahead.\n\nThomas Chong -- Jefferies -- Analyst\n\n[Foreign language] Thank you, management for taking my question, and congratulations on a very strong set of results. I have a few questions. The first question is more about the macro headwinds as well as the -- what happens to the public sector together with the hot bread these days. How should we think about the outlook for the consumer electronics in the second half? And my second question is about our omnichannel strategy.\n\nGiven our solid execution in omnichannel, may I ask about the revenue contribution and the key focus areas in coming years? And the third one is about our past membership. Given the solid progress that we have made, can we talk about our strategies as well as what we are seeing in terms of the consumer behavior for existing and new members -- new users? Thank you.\n\nLei Xu -- Chief Executive Officer of JD Retail\n\n[Foreign language] let me answer the first and second questions. First is about home appliances. And in Q2, for the home appliances industry, they are facing multiple challenges, including the downward economy and a weak consumption demand and a disruption on the supply chain, and the logistics and the service to both localities. And from the -- a brand perspective, they are taking a more cautious attitude and focus on the sales that can bring more certainty, refine operation and healthy profitability.\n\nThis has been a consensus in this industry. And this also makes JD a more preferred partner to work with them in line that they pursue. So I believe in this quarter or in the coming months, JD will continue -- they will continue to attach great importance to the collaboration with JD. Yes.\n\nFor Q2, on JD, the top appliances category has outperformed the industry, and they have delivered quite an outstanding margin on JD.com. I think this is -- are main contributors to JD's supply chain and also our deep understanding in this industry and our strong market share of nonconsumers and our partner's estimation and [Inaudible], also a testament of our disciplined approach to our cost control and efficiency improvement. And in Q3, we see these categories on a good track and slightly improving with June level. However, overall, the market still is in low level, and we are still facing some uncertainties from the macro and external environment.\n\nSo JD will continue to focus on the efficiency and experiences. And also, I want to point out that, thanks to our development in omnichannel, home appliance categories is developing fast on the omnichannel side. This is also thanks to our strategy to go into the lower-tier cities and our development on both [Inaudible] stores, such as our five-star appliances and other formats of physical stores. This also helped also this category to outpace the overall market and bring some new growth opportunities for the home appliances industry.\n\nAnd about the users' growth, Q2 is also our challenging quarter, and there are various reasons, both outside and internally. And outside, we have the COVID and shopping power lag. And internally, we also take initiatives to adjust our user growth strategies. And because of the restructuring of our JD business, in the short term, we might leave some users.\n\nHowever, with the active users on our core data business, we have seen a very high-quality growth. And for the users, their shopping frequencies in app are also rising. And especially for the new users, their shopping frequency in app rising significantly and reaching previous high. And in terms of the different segments of consumers, the lower tier market consumers is an important shopping group.\n\nAnd also, we will attach great importance to the silver group, the elderly group of people according to China's demographic changes and their shopping power changes. And lastly, I want to share a little bit more of our paying JV plus membership. This is a very unique system we created based on our whole understanding and the features of our platform. The shopping behavior of our users is not really comparable with other membership systems in China and outside China.\n\nThrough years of development, we see these members of the JD Plus membership is achieving good success and meeting our expectation, and bring up values. And in the future, we'll continue to build up this membership system and create more innovative system and benefit with this membership. Thank you.\n\nSandy Xu -- Chief Financial Officer\n\nThis is Sandy. Let me take the omnichannel revenue contribution question. When we talk about omnichannel scarcity internally, that actually include quite a number of business streams, including our back start, home appliance business, our home appliance franchise store business, our even fresh, the fresh offline omnichannel business, and as well as the [Inaudible] initiative for our supermarket category, and the intra-city radio, the Shop Now initiative. So some of the business, they contribute to the 1P revenue by -- some of them, like Shop Now, they contribute GMV and commission revenue.\n\nSo in terms of the revenue contribution, it didn't change significantly this quarter. It was still around 10% from the omnichannel business as a whole. To be honest, the offline business were disrupted more seriously compared to online business during the quarter. Except for our Shop Now business that is still in early type of growth stage, the other -- some of the other offline businesses, they did not perform as strong as our online B2C business.\n\nThomas Chong -- Jefferies -- Analyst\n\n[Foreign language]\n\nSean Zhang -- Director of Investor Relations\n\nOK. Thank you, Thomas. Can we take the next question, please?\n\nOperator\n\nOur next question will come from Eddy Wang with Morgan Stanley. You may now go ahead.\n\nEddy Wang -- Morgan Stanley -- Analyst\n\n[Foreign language] Thank you, management for taking my question. My question is about the on-demand retail. So we noticed that we have deepened the relationship between JD and Dada, and means -- do you think JD will increase its investment in the on-demand retailing? And given the overall consumption slowing down, do we think the on-demand retailing could potentially become the next growth driver for JD? Thank you.\n\nLei Xu -- Chief Executive Officer of JD Retail\n\n[Foreign language] Sure. I'll take your question. And actually, two years ago, when we described on-demand delivery, we're talking about O to O, online, off-line. And actually, O2O is now equal to on-demand deliveries, only one form of that, and JD has started on this business by then.\n\nAnd while we are doing -- why we're doing this back then is more driven by our exploration to see how to better make fulfillment for the categories that will carry on high fulfillment fee. And then we also realized that the users demand for on-demand delivery is growing rapidly. And in the past, when we do online shopping, we are offering more physical products. But also, we have seen that people's demand are extending to more services, especially for the pet services or the aftermarket, of the automotive industry, so which driven us to look at the on-demand market to extend our service offering to the consumers.\n\nAnd thirdly, from the perspective of our brand partners, while they're doing more e-commerce, they are facing some difficulties in managing their members, managing their users and doing their marketing. So their own challenges when they do more e-commerce. And based on all this perspective, so this make us think the underline's ratio is very important services we need to design and create for different parties in terms of -- when coming up with different products and different services, and product categories. And all these are in the product design and preparation.\n\nEven though we have seen the whole industry, a lot of players are interested in this field and in joining these competition. Also on JD side, we have seen the on-demand orders are growing rapidly. But I also need to come -- make some rational adjustments. And for this -- to develop this business, we need to continue to strengthen consumers' market share.\n\nAnd we also need to explore real-time on supply chain, which is challenging for everybody now. And thirdly, we will also make sure to services their reliability and stability for on-demand deliveries. So there's a lot of work to do. And we will continue to see the penetration of this business to the consumer and the qualities and delivery performance of this new business.\n\nSo for the short term, we will not look at the short-term GMV. And it's a go, however, we do see the GMV on JD in the on-demand retail is growing in a good track. Now if I need to point out, for the profit, it's not a wise thing for the e-commerce players now to grab the market in competition with the brand and with our offline merchants. We need a new system or new pattern that both three parties are all can benefit from this new business model.\n\nThank you.\n\nSean Zhang -- Director of Investor Relations\n\n[Foreign language]\n\nEddy Wang -- Morgan Stanley -- Analyst\n\n[Foreign language]\n\nOperator\n\nWe are now approaching the end of the conference call. I'll now turn the call over to JD.com's Sean Zhang for closing remarks.\n\nSean Zhang -- Director of Investor Relations\n\nThank you for joining us today on the call and for your questions. If you have further questions, please contact me and the IR team. We appreciate your interest in JD.com and looking forward to talking with you again next quarter. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSean Zhang -- Director of Investor Relations\n\nLei Xu -- Chief Executive Officer of JD Retail\n\nSandy Xu -- Chief Financial Officer\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nKenneth Fong -- Credit Suisse -- Analyst\n\nThomas Chong -- Jefferies -- Analyst\n\nEddy Wang -- Morgan Stanley -- Analyst\n\nMore JD analysis\n\nAll earnings call transcripts"
}