{
  "companyName": "NCR",
  "companyTicker": "NCR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/ncr-ncr-q3-2022-earnings-call-transcript/",
  "content": "NCR (NCR 0.26%)\nQ3 2022 Earnings Call\nOct 25, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and welcome to the NCR Corporation third quarter fiscal year 2021 earnings conference call. Today's conference is being recorded. At this time, I would like to turn the conference over to Mr. Michael Nelson, treasurer and head of investor relations.\n\nPlease go ahead, sir.\n\nMichael Nelson -- Treasurer and Head of Investor Relations\n\nGood afternoon, and thank you for joining our third quarter 2022 earnings call. Joining me on the call today are Mike Hayford, CEO; Owen Sullivan, president and COO; and Tim Oliver, CFO. Before we get started, let me remind you that our presentation and discussions will include forward-looking statements. These statements reflect our current expectations and beliefs, but they're subject to risks and uncertainties that could cause actual results to differ materially from those expectations.\n\nThese risks and uncertainties are described in our earnings release and our periodic filings with the SEC, including our annual report. On today's call, we will also be discussing certain non-GAAP financial measures. These non-GAAP measures are described and reconciled to their GAAP counterparts in the presentation materials, the press release dated October 25, 2022, and on the investor relations page of our website. A replay of this call will be available later today on our website, ncr.com.\n\nWith that, I would now like to turn the call over to Mike.\n\nMike Hayford -- Chief Executive Officer\n\nThanks, Michael, and thank you, everyone, for joining us today for our third quarter 2022 earnings call. I will begin with some of my views on the business and I will also provide an update on our previously announced intention to separate NCR into two public companies. Tim will review our financial performance and then Owen, Tim and I will take your questions. Let's begin on Slide 4 with highlights.\n\nIn the third quarter, NCR delivered strong performance that included solid top-line revenue growth and significant margin expansion. The NCR team executed very well in a difficult macro environment. Additionally, NCR made significant progress against our strategic initiatives with strong execution across all of our KPIs. We continue to build positive momentum in the business as we make progress on our strategy to NCR becoming a software-led as-a-service company with higher recurring revenue streams.\n\nFirst, we delivered 8% year-over-year total revenue growth on a constant-currency basis and 7% recurring revenue growth also on a constant-currency basis in the third quarter. Second, adjusted EBITDA increased 15% on a constant-currency basis from the third quarter of 2021. And finally, adjusted EBITDA margin expanded to 19.3%, which represents a 230-basis-point increase from the second quarter of 2022. Now moving to the business update on Slide 5.\n\nWe had strong momentum across our strategic growth platforms, which support our company's transformation. In retail, we continue to deliver on our strategy to be the retail platform company of choice. During the third quarter, we expanded our partnership with a large CFR chain of over 950 convenience stores and gas stations. They extended their use of the NCR commerce platform and converted to a software subscription, adding 5,000 platform lanes.\n\nThis allowed them to unify the online ordering capabilities with in-store made-to-order food capabilities via the NCR Commerce platform. In self-checkout, RBR named NCR, the global market leader for self-checkout for the 19th consecutive year. In the third quarter, we continued to see our customers refresh and extend self-checkout usage to help them mitigate costs. In hospitality, we continue to experience strong demand across our enterprise and SMB customers.\n\nIn SMB, our payment attach rate for new customers remains 90% driving a record high number of payment booking sites. We also expanded our relationship with Buffalo Wild Wings, which added NCR's tablet offering along with subscription software to their restaurants to help improve guest and team member experience that will enable them to serve more tables, increase speed of service and improve order accuracy. In digital banking, we continue to have positive momentum. In the third quarter, digital banking had 20 renewals, five new logo deals and continued the expansion of our online digital account opening platform.\n\nTerrafina, which we acquired in 2021 to extend our account-opening capabilities, experienced the largest quarter in its history. In the third quarter, we also converted two large regional banks, Wintrust Bank of Chicago area and Wisconsin-based Associated Bank, to our digital banking platform. These two conversions added almost 1 million new digital banking accounts. We also had success with our digital-first retail banking solution, where we integrated a financial institution's retail channels using our CSP or channel services platform.\n\nDuring the third quarter, Citibank selected NCR's CSP teller solution to replace their legacy branch teller software. NCR has now two of the top five banks in the U.S. on our CSP teller platform. In payments and network, we are making progress across both merchant acquiring and the Allpoint network.\n\nWe are continuing to have success with our integrated payments offering for our hospitality customers, including 90% of our new SMB clients selecting NCR's payment solution. The Allpoint network continued its strong growth by delivering everyday banking transactions, including cash deposits at the financial kiosk to more financial institutions and cardholders than ever before. In the third quarter, Allpoint extended its partnership with a top 10 retail bank, enabling that bank to offer fee-free access to cash and cash deposits. In self-service banking, we continued momentum in our ATM-as-a-Service solution.\n\nInterest in our offering is accelerating from both community banks and large FIs globally. In the third quarter, we signed 18 ATM-as-a-Service deals. The ability of NCR to provide the scale and capability to provide a full stack integrated ATM-as-a-Service offering when bundled with the Allpoint network, this has given us a unique solution in the marketplace. And lastly, we will give you more details today on our plans to separate NCR into two public companies.\n\nFirst, I'm going to have Tim cover our financial results, and then Tim and I will provide an update on those separation activities. Tim?\n\nTim Oliver -- Chief Financial Officer\n\nThank you, Mike, and happy birthday. Our third quarter results represent strong performance in the face of continued macroeconomic impacts of persistently high inflation, rapidly increasing interest rates and a historically strong U.S. dollar. Our global team is weathering this economic and geopolitical chaos by focusing on the things we can control.\n\nOur team's ability to simultaneously deliver solid financial results and make strategic progress is commendable and the sustained commitment to our customers and to each other is laudable. So let's begin on Slide 6 with a top level overview of our third quarter financial performance. Starting on the top left, revenue was $1.97 billion, up $71 million. Revenue was up 8% from the prior year, and recurring revenue was up 7% when adjusted for constant currency.\n\nThe very strong U.S. dollar had an unfavorable impact of $78 million primarily within our retail and self-service banking segments. In the top right, adjusted EBITDA increased $28 million year over year to $380 million or 15% on a constant-currency basis. Foreign currency exchange rates had an unfavorable impact of $22 million.\n\nAdjusted EBITDA margin expanded 80 basis points from the third quarter of 2021 to 19.3%. While EBITDA margin sequential comparisons are not always illustrative, the outlook we provided back in April after a very challenging first quarter, described a recovery with sequential EBITDA improvements of $50 million to $70 million for each of the remaining three quarters of the year. On a currency-adjusted basis, our financial performance in the last two quarters achieved the high end of that range. The pricing and cost actions that we described in April are delivering the accretion to profitability that we targeted and needed.\n\nIn the bottom left, reported non-GAAP EPS was $0.80, up $0.11 or 16% year over year. The strength of the U.S. dollar reduced EPS by about $0.12. Adjusting for that, EPS was up 40% year over year.\n\nThe non-GAAP tax rate was 31% versus 29% in the prior year, and we expect the full year tax rate to be within the range of 27% to 29%. And finally, free cash flow was a modest use of $28 million. Free cash flow continues to be impacted by two issues. First, supply chain challenges, though now starting to abate, are still causing both nonlinear revenue generation and an investment in working capital.\n\nAnd second, the impact of our labor cost reductions and employee benefit and incentive programs impact the P&L before they are evident in cash flow. Both of these effects are timing issues that we should be able to harvest over the next couple of quarters. I'll provide more detail on cash flow on Slide 12. Moving to Slide 7, which shows our retail segment results.\n\nStarting on the top left, Retail revenue was up $34 million or 6% year over year as reported and up 12% on a constant-currency basis. Retail adjusted EBITDA was up 23% year over year and up 35% on a constant-currency basis. Component cost inflation, particularly on POS devices, was successfully mitigated by cost reduction actions, better pricing and a better product mix during the quarter. Adjusted EBITDA margin rate expanded 380 basis points sequentially and 310 basis points year over year to 22%.\n\nThe bottom of the slide shows retail segment key performance indicators. On the left are platform lanes, a KPI that illustrates the success of our strategy to convert our retail customers to our platform-based subscription model. We increased our number of platform lanes by more than 200% compared to the same period a year ago. The platform lane increase is driven by three rollouts at major convenience and fuel customers.\n\nWe see accelerating momentum for the conversion of our traditional lanes to platform lanes and have a substantial lane conversion backlog. In the center bottom is our self-checkout revenue. Self-checkout revenue increased 16% year over year. Remember that the sawtooth pattern and overall growth trend in SCO is caused by the timing of large orders by major retailers.\n\nLabor shortages and wage pressures continue to accelerate the need for self-checkout. ARR growth was driven by higher platform revenues, partially offset by the impact of currency translation. Slide 8 shows our hospitality segment results and depicts momentum across this business. Hospitality revenue increased $14 million or 6% year over year and 8% adjusting for currency as restaurants reopen, rework and expand.\n\nOur enterprise business was up 5% driven by new store openings and technology refreshes, and our SMB business was up 11%, driven by the success of our relaunched Aloha cloud platform. Third quarter adjusted EBITDA was up 16% year over year, and adjusted EBITDA margin rate was 21%. A richer revenue mix with more payments and platform sales and improving indirect cost absorption drove profitability improvements. Hospitality's key metrics on the bottom of this slide include platform sites, payment sites and ARR.\n\nPlatform sites increased 32%, payment sites increased 111% and ARR was up 8% year over year, another very strong quarter for hospitality. Turning to Slide 9, which shows our digital banking segment. Digital banking revenue increased $9 million or 7% and driven by increasing user counts, a CSP win at Citibank and continued success at Terrafina, which continues to grow at almost a 50% rate. EBITDA increased 15% year over year with an adjusted EBITDA margin rate increasing to 44%.\n\nDigital banking's key metrics on the bottom of this slide include registered users, active users and annual recurring revenue. Both registered and active users have recovered to levels similar to those we posted about a year ago. As we mentioned last quarter, two long anticipated customer consolidation de-conversions rolled off more quickly than two of last year's major wins at Wintrust and Associated Bank rolled on. For the year, we expect active users to be up in high single digits and ARR was up 3% year over year.\n\nMove to Slide 10. This is our payments and network segment. Starting at the top left, payments and network revenue increased $32 million or 11% year over year and 14% when adjusted for FX rates. More endpoints generating more and higher-value transactions is driving this growth.\n\nPayments and networks adjusted EBITDA increased 3% year over year and 7% when adjusting for FX. Beneficial revenue mix and cost leverage were offset by a significant increase in our cost to rent cash for ATM fleet, which is directly tied to interest rates. The cost of cash rental goes through EBITDA is at cost of goods. Adjusted EBITDA margin rate was 34%, down from the prior year due to those higher cash rental costs.\n\nThe bottom of the slide shows the payments and network key metrics. On the bottom left, endpoints increased 25% year over year. These access points to the Allpoint network and the merchant-acquiring terminals are increasing as we migrate them to the new NCR installed base. In the center-bottom are transactions, a KPI that illustrates the payments process across the Allpoint network and our merchant acquiring networks.\n\nTransactions were up 2% year over year. And annual recurring revenue in this business increased 11% from the third quarter of 2021. Slide 11 shows our self-service banking segment results. Self-service banking revenue was flat year over year as reported and up 6% on a constant-currency basis.\n\nAdjusted EBITDA declined 3% year over year and was up 1% on a constant-currency basis. Adjusted EBITDA margin rate was 23%. The bottom of the slide shows our self-service banking segment key metrics. On the left, our software and services revenue mix was flat compared to last year at 69% due to higher ATM hardware sales in this quarter.\n\nATM-as-a-Service units increased 185% year over year to almost 12,500 units. We experienced significant growth in India with 7,800 units added and incremental growth in the U.S. We have a strong backlog of ATM-as-a-Service deals and now expect to end the year with over 15,000 machines under contract. This shift to recurring revenue continues to gain traction with AR up 4% year over year.\n\nOn Slide 12, we present free cash flow, net debt and adjusted EBITDA metrics to facilitate leverage calculations. As I previously stated, free cash flow was a use of $28 million in the quarter. For all the reasons I discussed upfront, working capital has been a challenge. Days sales outstanding has increased 11 days versus the beginning of the year.\n\nInventory days has increased another four days. And the net impact of nearly seven days to the cash cycle has caused a timing impact of more than $150 million through the first three quarters of this year. We also reduced payables in Q3 by nearly $80 million. In order to ensure improvement, I'm standing back up our cash control tower initiative that we used in 2020 to harvest most of this cash in Q4.\n\nThe combination of working capital improvements, higher profitability and the lapse of the timing issue and compensation and benefits, we now anticipate $400 million of cash generation in the next two quarters with more than half of that occurring in Q4. To say it differently, working capital improvements will drive Q4 free cash flow, while compensation and benefits timing issues should resolve in Q1 of next year and provide a strong start to full year free cash flow in 2023. This slide also shows our net debt to adjusted EBITDA metric with a leverage ratio of 3.9, down slightly from the prior quarter due to higher profitability. We remain well within our debt covenants.\n\nAnd finally, before I hand it back to Mike, some thoughts on guidance for Q4. We provided guided ranges back in April as follows: approximately $8 billion of revenue; $1.4 billion to $1.5 billion of adjusted EBITDA and $2.70 to $3.20 of EPS. Since that guidance was provided, the anticipated impact of all of the exogenous shocks, including war, component cost, freight, fuel, other inflation, interest rates and now currency has more than doubled from our April estimate of $150 million. That said, adjusting for relief from the currency impact that could not have been anticipated at the time, we believe that our adjusted results still fall well within those ranges.\n\nMore specific to Q4, we expect to deliver a fourth quarter that is very similar to Q3 from both a revenue and profit perspective accompanied by significant improvement in free cash flow. Thank you. And Mike, back to you.\n\nMike Hayford -- Chief Executive Officer\n\nThanks, Tim. As I referenced earlier, starting on Slide 13, Tim and I will provide an update on our separation activities that we previously announced a month ago. Let me provide an update on our thoughts on separating NCR into two public companies starting on Slide 13. On Slide 13, you can see the current five reporting segments at NCR.\n\nGoing forward, as we separate out our ATM business into a separate stand-alone company, we have worked with our advisors and board on a plan taking into consideration a number of factors that you can see on this slide. As we work through the alternatives for how to affect the separation, we believe the best path forward would be a tax-free spin-off of the ATM business into a separate public company via distribution of ATM SpinCo shares to existing NCR shareholders. Remember, the timing is expected to be at the end of 2023. By that time, we would expect to have generated cash flow over the next four to five quarters to reduce leverage.\n\nWe also believe that we could execute our spin in a manner which could also provide deleveraging if the debt markets were still difficult at that time. Going to Slide 14. This illustrates the separation of NCR's existing self-service banking business segment and payments and network segment to form a new entity via distribution of shares to existing shareholders. Tim will cover more details in his section, but let me share a few thoughts on the steps we have taken to prepare us for this action.\n\nNCR has made significant strides over the past five years to transform our company into a customer-first software-led as a services company. The actions we have taken to align our organization around customers and markets will help us move into two organizations. NCR RemainCo will include our retail hospitality, digital banking and merchant services businesses. RemainCo is transforming to a software-led growth company.\n\nThese businesses operate in markets where we expect to see continued spending on technology to run the store, run the restaurant and deliver digital-first banking solutions. We believe NCR RemainCo will continue to be a strong competitor for those upgrade imperatives. ATM SpinCo, which is our ATM business, includes the majority of our payments and network business aside from the Merchant Services and all of self-service banking. SpinCo is expected to be a stable recurring revenue business with solid cash flow generation that can allow us to deliver cash back to shareholders through a dividend payment.\n\nIn terms of leadership at each company, we have a deep bench of experienced leaders at NCR. We are working through the organizational structures. However, we intend to look internally for the management teams that will lead each company. We believe that this approach is the best path to unlock shareholder value, but should alternative options become available in the future that could deliver superior value, such as a whole or partial company sale of NCR, the board remains open to considering alternative scenarios.\n\nNow I'll pass it back to Tim to review the financial projections and capital structures of each of these companies.\n\nTim Oliver -- Chief Financial Officer\n\nAll right. So picking up on Slide 15. Here, we show the size and scale of each of the two resulting businesses on a last 12-month basis and then an allocation of our five-year strategic growth rates that we described in our investor day presentation back in December of '21. This chart is a good jumping-off point for modeling the two independent businesses.\n\nThe top of the page recast the results from the last 12 months into NCR RemainCo and ATM SpinCo. These two businesses have similar revenue bases with higher margin rates and less capital intensity at ATM SpinCo and lower margin rates and more capital intensity at NCR RemainCo. On the bottom of the page, we described the expected contribution of each of these two businesses to the future performance using our five-year growth targets. NCR RemainCo is expected to grow at or slightly above the high end of the 6- to 9-point range.\n\nWhile ATM SpinCo will be at or slightly below the low end of this range. These longer-term growth rates will not be linear as the ramp of as-a-service revenue in both of these businesses could outpace our current expectations. We expect both businesses to grow EBITDA more quickly than revenue. And by default then we expect margin rates for both to accrete up.\n\nNCR RemainCo starts with lower margins than the average and should be able to generate more substantial improvements to margin. At ATM SpinCo, they already have high margins and are expected to post more modest expansion. And finally, we expect lower cash conversion at NCR RemainCo as we invest for higher growth, while cash conversion at ATM SpinCo should be strong and predictable. And turning to Slide 16.\n\nHere, we remind you of NCR's current capital structure and then qualitatively rework it and so that the deck stack can be more appropriate to the capital structures for each of NCR RemainCo and ATM SpinCo at the time of separation. All of this analysis assumes that interest rates will be similar to those predicted by the forward curve, but that markets will be more receptive to financing when we execute the transaction. First, at Remainco. We intend to retain more than two-thirds of our existing unsecured debt by keeping leverage lower at RemainCo.\n\nWe would then fill out the rest of the debt stack by amending our existing secured debt. This minimizes debt breakage cost reduces issuance costs and allows us to continue to work with our terrific and current banking group. At RemainCo, we are targeting a net debt leverage ratio of between three and and 3.4 times based on the first full year post spin pro forma numbers. Lower leverage will allow this business to continue to invest more aggressively in strategic growth.\n\nAnd then, at ATM SpinCo, we expect a larger proportion of the debt to be new secured bank debt then augmented by a not less than seven-year senior note at the time of the spin to conform with tax requirements in a spin transaction. The U.S. pension plan will also likely go with SpinCo and may require partial funding of our underfunded position. The full amount of that underfunded position is already considered in our modeling.\n\nAt ATM SpinCo, we are targeting a net debt leverage ratio between 3.4 and 3.8 times based on the first full year post spin pro forma numbers. We expect this business to be less capital-intensive, require less investment for growth and to be a dividend payer. And finally, on the bottom-right in green, we anticipate generating $500 million to $800 million of free cash flow between now and the separation that can be deployed to reduce overall leverage going into the split. With that, Mike, back to you.\n\nMike Hayford -- Chief Executive Officer\n\nAll right. Thanks, again, Tim. Moving to Slide 17 with the looking-forward conclusion. In closing, our priorities for the rest of the year are very clear.\n\nFirst, in a macro environment, which we still believe is challenging, our team will continue to execute at a high level and build on the strong performance we delivered in the third quarter. Second, we have made significant progress transforming NCR to a software-led as a services company. Our strategic KPIs are trending in the right direction, and we will continue to build on positive momentum in the business. Maybe said a different way, these first two bullets are stating that our team is winning, and we expect to continue to win in the marketplace.\n\nThird, we are focused on improving our cost structure. As Tim mentioned, we have identified efficiency cost actions to streamline our costs. Fourth, we expect to close out the year with a strong cash flow generation, as Tim referenced. And fifth, we expect -- with the expected strong cash flow, we will continue to allocate capital to the highest-return opportunities.\n\nWe will balance the desire to delever with the opportunity to repurchase shares at attractive levels. As a reminder, we have a previously authorized share repurchase program that we can tap. And finally, we are focused on separating NCR into two public companies. We are working through the legal and organizational structures and expect to be in a position to execute the separation by the end of 2023.\n\nThat concludes our prepared remarks for today. With that, we will open the call for questions. Operator, please open the line.\n\nOperator\n\nThank you. [Operator instructions] And at this time, we will go first to Matt Summerville with D.A. Davidson.\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nA couple of questions. First, just to close the loop on the guidance. You'd indicated on the July call that you're comfortable at the low end of the range. You were, obviously, implying something for the full year around $1.375 billion, plus or minus, I haven't done the exact math yet.\n\nBut Tim, I want to be certain, are the two biggest deltas from July to now, the cost of cash as it pertains to the payments and network business and the drop-through in incremental FX headwind from revenue to EBITDA. Would those be the two biggest delta buckets, if you will?\n\nTim Oliver -- Chief Financial Officer\n\nYeah. So on the interest side, we expected back then to have about $25 million of pressure across the year. It turned out to be closer to $80 million. So we've had $80 million of pressure on interest rates that go through the P&L through EBITDA at the payments business, much higher than we anticipated that absorbed a lot of the range, if you will, the $1.4 billion to $1.5 billion.\n\nOn the currency side, currency has gotten an awful lot worse in the latter half of the year. We now think that the full year impact of the currency will be $260-plus million on revenue and almost $70 million on EBITDA. And in fact, it's going to be $115 million on cash flow. So currency has become a big issue we could not have anticipated back then.\n\nI think, if you project forward Q3 and duplicated in Q4. And you give me a relief for the FX numbers I just described, we'll be safely in the middle of the range on EPS and on revenue and on EBITDA. So I think that guidance was reasonably well thought out. I think, it was reasonably well executed against.\n\nWe've taken out more cost than we thought we needed to, to scramble back and cover some of the escalation and interest expense that you described. Also inflation got a little bit worse. So yeah, I hope that helps.\n\nMike Hayford -- Chief Executive Officer\n\nBut Matt, let me -- this is Mike. Just let me clarify your statement. So the range we gave $1.4 billion to $1.5 billion. And when we give ranges of outlook, it always sans FX.\n\nI think, most companies do the same. So within that range of $1.4 billion to $1.5 billion, excluding FX, we're clearly within that range for the full year.\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nGot it. And then, just as a follow-up, those leverage projections for Remain and SpinCos, how is that treating the $500 million to $800 million of free cash flow you anticipate generating between now and when you affect that transaction?\n\nTim Oliver -- Chief Financial Officer\n\nYeah, it presumes that about $400 million to $500 million of that gets applied to reduce indebtedness prior to execution of the deal.\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nAnd then, would it be fair to assume to the extent you overachieve on the low end of that range, maybe closer to $700 million, $800 million, would you plan on using any overachievement for further debt paydown or share buyback at $20, let's say?\n\nTim Oliver -- Chief Financial Officer\n\nSo I think, our shares are a very good value right now. And I would hope that once we start proving out that we can generate free cash flow in the next quarter that we can get to work in buying back some shares.\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nGot it. Thank you, guys.\n\nOperator\n\nAnd we'll go to our next question from Paul Chung with J.P. Morgan.\n\nPaul Chung -- J.P. Morgan -- Analyst\n\nHi. Thanks for taking my question. So just on the Spin, what's been the feedback from your customers kind of across the segments? And then also, internally, how are teams kind of reacting to the uncertainty here? How are you keeping employees engaged and kind of retention levels high?\n\nMike Hayford -- Chief Executive Officer\n\nYeah, this is Mike. Let me start with the customer side. And I guess, about a month ago, we made the announcement. So I probably talk directly to a few dozen C-level executives.\n\nI know Owen has done many as well. And I think, without an exception, the conversation has been very productive. When you walk through led us to this point in terms of our feeling that we're undervalued in the marketplace and that having, if you look in conglomerate, there's multiple businesses underneath the umbrella wasn't doing us any favors. So as we've done that, I literally have done that across this country.\n\nI've done over Europe, as I met with the clients in Europe. They all get it. They all also look at our business and say, look, I'm a retail POS buyer or I buy hospitality or I buy banking services derived by ATMs. And I haven't had a single one with a single concern.\n\nOn the employee side, it's business as usual managing through change, manage through not only difficult 2022 but also getting ready for a spin transaction at the end of '23. We do every other week calls with all of our employees around the globe. We just got on the road and did six in-person town halls, including Belgrade, Dundee, London, Atlanta, Dallas and got in front of people, and I'll tell you the same reaction by the customers when we sit down and have a conversation about what we're doing and why we're doing it. The feedback from our employees has been just as positive as it has been from our customers.\n\nOur employees all want to know what it means to them and what's going to happen over the next year, but they totally get it. And again, let's go back to customers. I'll just pass it over to Owen. I haven't had anybody concerned whatsoever from a customer perspective.\n\nOwen Sullivan -- President and Chief Operating Officer\n\nI would agree with that, like Mike, a lot of conversations. It's more curiosity once we explained that this is about our frustration of seeing value creation being appreciated in the market, and it's not about the performance of the business or any other underlying issues. Customers are very quick to acknowledge that. They tell us that through conversations.\n\nWe just had our latest NPS scores. They came up 10% up year over year. So we continue to have really, really strong feedback from the market. And at the end of the day, if we're not distracting internally and creating issues with the customers, that's all they care about right now.\n\nAnd to Mike's point, I think our people are very curious as to why we were doing this. We've talked extensively to them. I think, there's more uncertainty from our employees about the general economy and the implications of that than there are to where we're going with our two companies. As we've talked in the past, the majority of our people are already aligned within the businesses that we're separating into.\n\nSo if you're a developer or a support person in banking or in retail, that's where you're going to be post the spin. So I think, they're anxious more about the overall economic conditions, and we continue to talk to them about what we're going to do with the business. and are alleviating quickly some of those concerns.\n\nPaul Chung -- J.P. Morgan -- Analyst\n\nAnd then, a follow-up on digital banking, a nice rebound here in registered and active users. You mentioned the Wintrust and other regional banks. Was this kind of a competitive win? And talk about differentiation, how the firm is winning deals? And then, how do we think about user growth in the near term here?\n\nMike Hayford -- Chief Executive Officer\n\nYeah. So Wintrust Bank is a Chicago-based bank and then Associated Bank, which is Wisconsin-based bank and both of those are, one's $40 billion in asset size, one's $50 billion. It's very large regional banks. And again, collectively, they brought down almost 1 million accounts.\n\nNow we've talked about that literally over the last, I think, six months that we've signed them. It takes a little time to bring them on board. Those conversions are -- shout out to the team, those conversions on flawless. And when I say the team, we just got down meeting with the executives of both of those organizations that was the joint effort between the NCR team, as well as team from those banks.\n\nSo those accounts came on board throughout the third quarter. So you saw the comps, the revenue will be coming on board fully in the fourth quarter. And as you -- we talked about double-digit top-line growth, you'd expect to see the same with the account growth. So going forward, you should expect to see that really going forward.\n\nWe talked about that in our last year's investor day, where we said digital banking, the team has done a phenomenal job of bringing that back to be very competitive. Those were both competitive wins in that $25 billion above marketplace. We have taken more than our lion's share of victories out there, and we expect to continue to do so.\n\nOwen Sullivan -- President and Chief Operating Officer\n\nYeah, the only other comment I'll add on to that is our entire strategy on all the businesses, all the industry is the land and expand. So the wins of the digital banking and those customers is leading to really strong growth in our Terrafina business. Mike commented in his opening comments about the performance of our channel services platform. Those institutions we just talked about are embracing that, and will add that to the portfolio of NCR offering.\n\nSo we're seeing great land and expand coming as a result of really strong conversions. The other comment I'd make is, as we talk to the digital banking team and we look out to the fourth quarter, we're looking at perhaps the largest order quarter we've had since, well, actually, it will be in the history of the firm. So we're really bullish. Those will take some time.\n\nThose will convert through the first half of next year. But the momentum in that business is really strong.\n\nPaul Chung -- J.P. Morgan -- Analyst\n\nOh, great. That's great. Thank you.\n\nOperator\n\nAnd we'll move on to our next question from Kartik Mehta of Northcoast Research.\n\nKartik Mehta -- Northcoast Research -- Analyst\n\nGood afternoon. Mike, maybe thoughts on shared services or the service business since retail and ATM, I'm not sure how much they're sharing and how you intend to deal with some of the shared services for those two businesses.\n\nMike Hayford -- Chief Executive Officer\n\nYeah, Kartik, that's a great question. So as we look at where we stand today on work to go to get to the end of job next year, with the spin the go-to-market side that on -- ones I've been working on literally for the last four years is really aligned vertically within our lines of business, whether it's retail, hospitality or banking. So most of that work is already done. We have remaining shared services, which are feet on the street to do the break fix or do the service and support for hospitality, retail and for banking, and then we've got some -- obviously, some corporate functions.\n\nSo on the shared services itself, the teams have put in systems and automation and actually, a lot of those get deployed out of centralized sites. In those centralized sites like Belgrade, they already focus on either retail or they focus on the banking business. In the field, we have resources that are dedicated to either, for example, fixing ATMs on a full-time basis as a specialist or fixing SCO self-checkout devices on a full-time basis as a specialist. And then, we have some generalists who are certified to do both.\n\nSo our team has gone through and identified where we'd have to make separations, how we would then handle, whether it's through services agreements from one group to the other or whether in most cases, we have enough scale and mass in the geographic area just to have the generals break into the specialty area. So we think we have a pretty good handle on that. We think we have a pretty good sense of what that means in terms of separating those out and where we -- where we'll have some. We recognize there will be some dis-synergies, but we think that will be quite kept to a minimum.\n\nKartik Mehta -- Northcoast Research -- Analyst\n\nAnd then, Tim, maybe just thoughts on dis-synergies, the dollar dis-synergies that you think spinning out the two companies will create. Obviously, I think, the slide you showed just showed EBITDA for both companies and separated by segment. I'm wondering maybe your thoughts on just dis-synergies?\n\nTim Oliver -- Chief Financial Officer\n\nYes. So we think it's going to be between $80 million and $100 million of incremental expense to stand up two independent companies. I think, $30 million to $40 million of that is just direct public company costs and the rest would be duplication of other parts of the organization. Over the next year, probably the next six months, we're targeting some pretty significant cost actions inside the organization to more than offset that $80 million to $100 million.\n\nI think, we'll have actions in place that are probably twofold that to help us cover that and be ready. So in the model that's described on here in the assumptions and the leverage calculations, we've presumed that we get that cost out and that we're able to cover that incremental expense.\n\nKartik Mehta -- Northcoast Research -- Analyst\n\nTim, you said that doubled. Would you anticipate taking out more than the $80 million to $100 million. So could you actually with other EBITDA than expected?\n\nTim Oliver -- Chief Financial Officer\n\nYeah. I think, there are two separate topics, right? One is getting ready to split. And in fact, as you described, there will be dis-synergies associated with that. As you know, we went through some cost and pricing actions during the course of 2022 that allowed us to scramble back to a decent performance for the full year.\n\nAs we enter 2023, we expect another difficult year, and we're getting ready for that. Owen and his team have pulled together some production actions both those associated labor and others associated with component costs and with freight to help us be productive -- generate productivity going into 2023. Those actions are north of $200 million, and would more than offset the pressure from $80 million to $100 million for the spin.\n\nKartik Mehta -- Northcoast Research -- Analyst\n\nThank you very much. I really appreciate it.\n\nTim Oliver -- Chief Financial Officer\n\nMy pleasure.\n\nOperator\n\nAnd we'll go to our next question from Ian Zaffino of Oppenheimer.\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nOK, thank you very much. Just one more question on leverage of the SpinCo, RemainCo. How exactly are you arriving at those leverage rates? Why is that the best? And then, maybe on the RemainCo, what's the opportunity for M&A, especially vis-a-vis the leverage that you're thinking of spinning it out with? So are we expecting more organic growth or M&A growth in that area? Just a little color there would be great. Thanks.\n\nTim Oliver -- Chief Financial Officer\n\nYes. So on a leverage perspective, we think that the ATM SpinCo can tolerate more leverage, and we believe that it generates a very predictable cash flow stream. And so, it's an obvious dividend payer, and it can carry a little more leverage because it's not as capital-intensive. From a RemainCo perspective, we need to keep our leverage under our covenants or existing covenants for the two-thirds of the long-term debt that we want to keep in place.\n\nThat's 3.7%. We also want to leave ourselves room to continue to invest for growth in this segment. So we think the right leverage here is to be lower than at ATM SpinCo. They're both, as you can tell, they're both wide ranges.\n\nWe don't know exactly where we'll fall out in either of these two businesses. But that was the thought process. And on the tax --\n\nMike Hayford -- Chief Executive Officer\n\nM&A, let me just address the opportunities for M&A or inorganic growth on the RemainCo. So if you look at RemainCo, it's retail POS, it's hospitality POS and it's the digital banking. We think all three of those areas are growth opportunities in the marketplace. We think the spending will continue as -- particularly on the POS side as people have an upgrade imperative, but we've already talked about digital banking being an area that we see financial institutions on the retail side, we focus on the retail side, financial institutions, integrating their channel strategies and our products are very well suited to do that.\n\nWe have seen, on an inorganic basis over the last four years, we've been very successful. We just talked about Terrafina, which is kind of opening for digital banking. D3, which is a product that was successful in winning Associated Bank and Wintrust Bank, we've had great success in retail with a company that does virtualization called Zynstra, we brought a company called Freshop, which does the front-end glass, which allows you to do integrated order entry of your mobile device into the grocery POS. So we've had a lot of success of acquiring inorganic products to integrate with our platforms and then upsell, cross-sell.\n\nWe think going into '23, a lot of those companies that maybe are underscaled that have had some success building product, but haven't gotten to a point where they're actually generating earnings or cash flow might be more attractive opportunities for us going forward. So we think RemainCo will have opportunities to grow organically, as well as inorganic opportunities.\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nOK. And maybe just a little bit of a follow-up there. I mean, I guess, that was sort of my point that I do think there's all these organic opportunities or inorganic opportunities RemainCo. So should the difference in the leverage ratios between two companies be actually larger than that, meaning RemainCo should take maybe less leverage and then SpinCo should take on more leverage?\n\nMike Hayford -- Chief Executive Officer\n\nYeah, I mean, we could turn it in its way. I think, it becomes an equation of how much leverage we want to put on SpinCo as we get closer to a date where we look at the marketplace, we've got to build a new balance sheet for SpinCo. I think, we'd look at that. I don't think we would overlever either company.\n\nWe want both companies to have opportunities to succeed. And so, I think, we get your point. I think, the other thing to keep in mind, when we have a RemainCo, which is in higher growth businesses, we would hope to establish a currency using equity to be able to go out and do deals that today we simply can't do. So I think, getting that balance right, which company gets how much debt, we'll keep that in mind.\n\nBut the goal a SpinCo to be stable, steady cash-generating to return some of that cash to shareholders via dividend and then remain co to be able to participate in growth organically and inorganically.\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nOK. Perfect. Thank you very much.\n\nOperator\n\nAnd we'll go next to Erik Woodring with Morgan Stanley.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nYes, thanks for taking my question. Maybe, Mike, if I start with you, I guess, we're hearing some mixed commentary from our coverage in terms of the impact of macro uncertainty. And so, can you maybe just elaborate on what you're hearing from customers in terms of time to close deals, any downsizing or pushing out of deals? Is there any caution at all? And maybe if you could kind of detail that by end market or vertical if there is any difference that would be super helpful. And then, I have a follow-up.\n\nThanks.\n\nMike Hayford -- Chief Executive Officer\n\nYeah, let me start, and then I'll have Owen add some color. So as we look at fourth quarter, we haven't seen that yet. And as you look at our numbers that we actually gave at the end of the first quarter outlook for the full year, we're hitting those numbers. So we haven't seen a diminution in orders.\n\nOwen talked about digital banking having had extremely strong orders. I'd say our SCO business remains strong. Our hospitality business has had a very strong year, continues to remain strong through the fourth quarter. So if you look at it through the end of 2022, we haven't seen that.\n\nI think, we talked to customers the same conversation in the public media and the macro trends, people are concerned. We just haven't seen red flags. We haven't seen things pop up that would tell us that our customers are going to slow down ordering heading into '23 at this stage. I think, we're cautious like everybody else, looking at the future.\n\nBut we just haven't seen that hit our order book as of yet. I don't know, Owen, you want to add to that?\n\nOwen Sullivan -- President and Chief Operating Officer\n\nYeah, I would say that from a backlog standpoint, there has not been material pushing out of projects or of implementations. Certainly, there's a lot of chatter about what next year will bring. And I think, people have raised the flags. The counter to that is labor continues probably the most pressing issue that our customers are talking about.\n\nAnd we sit in a pretty good spot with the technology that we can bring to the table for all three of our industry groups as we address technology to offset both labor cost and the labor in the mix, if you will. I know as we've talked to the major retailers, self-checkout and the supporting systems, software, etc., is an investment that they're willing to make and we see that across the board. So as of right now, we're just not seeing delays or a pause in terms of project activity, albeit they are anxious like most of us are as to what '23 will bring. That's why we're taking a pretty aggressive approach on the costs that Tim addressed.\n\nWe're doing that in anticipation. And if it turns out to be an overreaction, then we'll get the benefit of it. But right now, markets and order activities are not waning.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nOK. That is really, really helpful. I guess, maybe, Tim, just to circle back to the 2022 guide. I just want to make sure when you're talking about assuming 4Q looks similar to 3Q from a revenue and margin perspective, was that referencing sequential change or on an absolute dollar and percentage basis.\n\nAnd then, maybe just, again, the second part would that be, can you again just detail -- again, you mentioned the FX headwinds and the rental cost headwinds, what are the offsets that you're flowing through to arrive back at this kind of guidance that you've guided to today? Thanks.\n\nTim Oliver -- Chief Financial Officer\n\nYeah. Sure. So sequentially, similar, meaning not growth rates, but in absolute values. When we post those, it will be about a 3% to 4% growth rate year over year on revenue and about a 12% to 13% growth rate on EBITDA.\n\nSo I feel OK about that performance. The -- back to your question on currency, we now expect looking at FX rates today, currency to impact revenue by $262 million to impact EBITDA by $67 million, and to impacts free cash flow by almost $115 million. So when I talk about being in our side of our range of $1.4 billion to $1.5 billion on EBITDA or approximately $8 billion on revenue. I think, you can see with relief, if you just do the math, I described, Q3 to Q4, you add up where we are this year, you add back those FX effects where we're well within those ranges trending toward the midpoint of some of them.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nPerfectly clear. Thank you so much.\n\nTim Oliver -- Chief Financial Officer\n\nMy pleasure.\n\nOperator\n\nAnd we'll go next to Matthew Roswell of RBC.\n\nMatthew Roswell -- RBC Capital Markets -- Analyst\n\nYes. Good evening. A quick question on the expectation for free cash flow to come back. Is that solely timing differentials? Or is there anything in there with either the macro environment getting better and/or you're all doing some sort of cost reduction, etc.?\n\nTim Oliver -- Chief Financial Officer\n\nYeah. So I think, nothing special has to happen. It doesn't presume any change in the quality of our earnings. It doesn't change very remarkable increase in profitability.\n\nIn fact, we've just described profitability in the fourth quarter, very similar to the third. We've got $180 million of working capital use of cash this year. There was a year in which I thought we'd hold working capital relatively flat, $157 million used in AR and over -- and nearly $75 million of use in inventory. Those folks who own those efforts to collect that cash tell me they can get that back.\n\nAnd so, I expect to get at least $150 million of free cash flow out of working capital in the fourth quarter. We'll also generate other cash in the quarter, I think we'll be north of $200 million is my best guess. That means there's still another couple of hundred million dollars of cash that should have been generated this year that will likely harvest in Q1 of next year. There is -- whether it be incentive compensation programs or the way we funded our 401(k) or some other labor reduction, including severance that gets paid a salary continuation, the P&L benefit of some of those things predates our ability to see it through cash flow.\n\nAnd I expect a lift of $150 million to $200 million of cash flow in Q1 just from those effects.\n\nMatthew Roswell -- RBC Capital Markets -- Analyst\n\nOK. Thank you very much.\n\nTim Oliver -- Chief Financial Officer\n\nMy pleasure.\n\nOperator\n\nAnd for our last question, we will go to a follow-up from Matt Summerville with D.A. Davidson.\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nYeah. Thanks. Just two quick ones. R&D expense looked like it declined materially year on year and quarter on quarter to an adjusted $21 million.\n\nAm I looking at that correctly? Is that the right figure? And if so, from a run rate of 50-, 60-ish, how does that happen?\n\nTim Oliver -- Chief Financial Officer\n\nI don't think that's -- so capex in the quarter was --\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nR&D. R&D.\n\nTim Oliver -- Chief Financial Officer\n\nMatt, I'll have to get back to you. I don't have that one in front of me.\n\nMike Hayford -- Chief Executive Officer\n\nYeah, Matt, so I would say from a investment in software development and harder development, which we do a lot of, we haven't changed that at all. So quarter to quarter, we haven't changed that. So if there's maybe a categorization of capex from R&D versus to spend in a product, it's not a business action.\n\nTim Oliver -- Chief Financial Officer\n\nSo in fact, I'm looking at it now. The total spend, cash spend, on R&D is relatively flat. The cap rate has changed. So the cap rate was higher, meaning that more of that spend went to capex than opex.\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nOK. Is that sustainable going forward?\n\nTim Oliver -- Chief Financial Officer\n\nI'd say that it was -- the cap rate was understated in the first half of this year. We also changed the profile of the projects that we prioritize to make sure that they were capitalizable meaning that they had future period revenue associated with them. So I'd argue we're getting more bang for our buck out of capex and our cap rate should be reasonably close to the average of Qs 2 and 3.\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nOK. And then, as my final follow-up, product gross profit margin looked to be flat quarter on quarter. I guess, that surprises me a little bit. So can you talk about the puts and takes there on the roughly 12% product gross margin? And if you're getting more pricing, while that's not getting better mix seemed to be OK.\n\nI mean, your SCO volumes look good in retail. So help me understand what's going on with product gross margins. Thank you.\n\nTim Oliver -- Chief Financial Officer\n\nYeah, I think, you're just seeing the big cost pressure we've seen all year long go through gross margin, and we're trying to offset it with indirect costs. So we've been chasing indirect costs all year long to offset pressure on the direct side. Obviously, that doesn't come through gross margin. In some instances it will, if it's direct, if it's in the business itself.\n\nBut for the most part, all the cost efforts we've taken thus far this year were the things we could control more easily, which is our indirect cost. I think, you'll see that switch next year. I think, next year, we'll start to see the sub-supply chain relief next year. We've done about as much work as we can do in the indirect cost, still some on putting organize the two new organizations together.\n\nI think, we can collapse some cost out there. But ultimately, I think, the story of 2023 is going to be direct cost management.\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nGot it. That's it for me. Thank you, guys.\n\nTim Oliver -- Chief Financial Officer\n\nSure.\n\nOperator\n\nAnd at this time, I would now like to turn the call back to Mike Hayford, CEO, for closing comments.\n\nMike Hayford -- Chief Executive Officer\n\nThanks. The NCR team delivered an outstanding quarter this quarter. We had 8% revenue growth and 15% EBITDA growth, both on a constant-currency basis. But more importantly, we continued our strategic transformation to a software-led as-a-service company, improving our strategic KPIs across all five business segments.\n\nOur success is driven by the efforts of every NCR team member to take care of our customers each and every day and as I travel around the globe to Belgrade, Dundee, Prague, London, Dallas, Cebu, Tokyo, Sao Paulo, Chennai, Mumbai and many others, including Atlanta, I see what makes NCR so special, it's our employees each and every day. I want to close with a thank you to all of our employees who make NCR work and delivered a wonderful quarter, and thank you all for joining us. We'll see you next time.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichael Nelson -- Treasurer and Head of Investor Relations\n\nMike Hayford -- Chief Executive Officer\n\nTim Oliver -- Chief Financial Officer\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nPaul Chung -- J.P. Morgan -- Analyst\n\nOwen Sullivan -- President and Chief Operating Officer\n\nKartik Mehta -- Northcoast Research -- Analyst\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nMatthew Roswell -- RBC Capital Markets -- Analyst\n\nMore NCR analysis\n\nAll earnings call transcripts"
}