{
  "companyName": "Norwegian Cruise Line Holdings",
  "companyTicker": "NCLH",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/norwegian-cruise-line-holdings-nclh-q3-2022-earnin/",
  "content": "Norwegian Cruise Line Holdings (NCLH -1.84%)\nQ3 2022 Earnings Call\nNov 08, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning and welcome to the Norwegian Cruise Line Holdings' business update and third quarter 2022 earnings conference call. My name is Maria, and I'll be your operator today. [Operator instructions] As a reminder to all participants, this conference call is being recorded. I would now like to turn the conference over to your host, Jessica John, vice president of investor relations, ESG, and corporate communications.\n\nMs. John, please proceed.\n\nJessica John -- Vice President, Investor Relations, ESG, and Corporate Communications\n\nThank you, Maria, and good morning, everyone. Thank you for joining us for our third-quarter 2022 earnings and business update call. I'm joined today by Frank Del Rio, president and chief executive officer of Norwegian Cruise Line Holdings, and Mark Kempa, executive vice president and chief financial officer. Frank will begin the call with opening commentary, after which, Mark will follow to discuss our financials before handing the call back to Frank for closing remarks.\n\nWe will then open the call for your questions. As a reminder, this conference call is being simultaneously webcast on the company's Investor Relations website at www.nclhltd.com/investors. We will also make reference to a slide presentation during this call, which may be found on our Investor Relations website. Both the conference call and presentation will be available for replay for 30 days following today's call.\n\nBefore we begin, I would like to cover a few items. Our press release with third-quarter 2022 results was issued this morning and is available on our IR website. This call includes forward-looking statements that involve risks and uncertainties that could cause our actual results to differ materially from such statements. These statements should be considered in conjunction with the cautionary statement contained in our earnings release. Our comments may also reference non-GAAP financial measures.\n\nA reconciliation to the most directly comparable GAAP financial measure and other associated disclosures are contained in our earnings release and presentation. With that, I'd like to turn the call over to Frank Del Rio. Frank?\n\nFrank Del Rio -- President and Chief Executive Officer\n\nThank you, Jessica, and good morning, everyone, and thank you for joining us today. I am pleased to report that we reached another significant achievement on our road to recovery this quarter with a generation of positive adjusted EBITDA for the first time since the pandemic began. We have been clear about our intentional and methodical return to service strategy, consistently meeting or even exceeding the operational and financial milestones we had guided to. I am encouraged by our progress as each quarter has seen substantial sequential improvement in load factor, with the shortfall gap continuing to narrow versus pre-pandemic levels while our industry-leading pricing continues to hold strong.\n\nAnd while we are always looking for ways to capitalize on opportunities to accelerate our recovery, I want to reiterate that our primary focus continues to be maximizing profitability for 2023 and beyond in a sustainable manner by prioritizing our long-term brand equity and protecting our industry-leading pricing. While the macroeconomic environment heading into 2023 remains more uncertain than usual, we see several tailwinds and catalysts to sustain our current positive trajectory as outlined on Slide 5. First, the public health regulatory COVID-related protocols continue to improve. In the past 30 to 45 days alone, key countries like Canada, Bermuda, Greece, and all of South America have removed COVID testing requirements for entry, and many countries in Asia have begun reopening to cruise.\n\nThese developments have paved the way for us to relax our own COVID-19 protocols, allowing us to reach a wider cruising population, as well as adding greater variety to high-yielding itineraries as more ports around the world become accessible to cruising. With the public health environment improving, in September, our three brands removed mandatory vaccination requirements. And just last month, Norwegian Cruise Line took another significant step forward with the elimination of all COVID-19-related guest protocols. That means no more vaccination, testing, or masking requirements on any of the line's 18 ships except in the very few areas around the world which still have specific COVID rules.\n\nThis is a long-awaited alignment of protocols to the rest of the travel, leisure, and hospitality industries, which reduces friction, eliminates the No. 1 reason for not booking a cruise, and meaningfully enhances the cruise experience for our guests. Our SailSAFE program was always designed to evolve. And the improvement in a public health environment, along with the near elimination of intrusive protocols to remain in place, allow us to uphold our No.1 priority of protecting the health, safety, and well-being of our guests, crew, and the communities we visit.\n\nSecond, while there are heightened concerns surrounding an economic slowdown in the broader marketplace, the primary target cohort of our three brands, which is more upmarket and affluent than that of the cruise industry as a whole, continues to demonstrate a willingness to spend on travel and experiences. In fact, you may have heard commentary from credit card issuers this earnings season about continued strong spend on travel and experiences, especially by those in higher-income categories, reinforcing the continued strength and resilience of demand for cruising, particularly among Americans. Within the cruise industry, we believe our company is well positioned to outperform if indeed the macroeconomic environment weakens. First, and as Slide 6 illustrates, our dominance in the upscale space which we participate in, not only through our Oceania and Regent brands, but also with our exclusive high-end ship-within-a-ship concept on Norwegian with The Haven is significant.\n\nAnd while this quarter is not totally immune to economic downturns, it has been very resilient historically. In addition, Slide 6 also demonstrates our favorable guest demographic mix, which skews toward the higher end of the income spectrum as each of our brands operate at the top of their respective industry categories. The vast majority of our guests have a net worth of 250,000-plus, again, a more resilient cohort in the event of an economic downturn, particularly if the job market remains strong and the equity markets stabilize. With over 85% of our guests sourcing coming from North America, we will also benefit in the near term given our relatively low exposure to European sourcing where the economic environment is already challenged.\n\nLong term, this bodes well for our business as North Americans have historically been the guests who book the earliest, garner the highest ticket price, and spend the most on board. Taken together, these factors contribute to our strong book position despite current macroeconomic worries and a turbulent geopolitical environment. Last quarter, we spoke about the two indicators in our business that we typically monitor to evaluate the extent and willingness of consumers to spend on cruise travel: the first being the booking window, which provides a peek into the consumer's psyche about the future; and the second being our onboard revenue generation, which is our best real-time now indicator. Both of these indicators continue to meet or exceed our expectations.\n\nIn fact, our onboard revenue generation continues to break records as onboard revenue -- revenue per passenger cruise day was approximately 30% higher than the comparable 2019 period. In addition, our booking window in the third quarter was approximately 245 days, nearly 10% ahead of the same quarter in 2019. This is important because an elongated booking window is preferable as it provides better visibility, which allows us to increase prices sooner while moderating marketing spend. The last catalyst I want to touch on is our industry-leading newbuild pipeline outlined on Slide 7, which we expect will enhance our brands' profile and product offerings and, most importantly, drive significant revenue, adjusted EBITDA, adjusted earnings per share, and cash flow growth.\n\nTurning to Slide 8, in August, we celebrate the christening of our newest ship, Norwegian Prima in the Reykjavik -- in Reykjavik, Iceland, the first major cruise ship christened in this historic seafaring locale. Prima has been incredibly well received with extremely positive feedback from the guests, travel partners, media, and the investment community who have participated in the ship's sailings so far. The addition of Prima and her upcoming five sister ships, along with Oceania Cruises' new generation of Vista Class ships and Regent's Seven Seas Grandeur, will, without a doubt, reinforce the positioning of our brands as the leaders in providing upscale experiences in each of the major cruise categories. Looking ahead to 2023, we have three new builds, one for each brand entering the fleet with over 5,000 additional berths.\n\nThese new ships are expected to attract new-to-brand guests, create excitement for our loyal past guests, and contribute significantly to top- and bottom-line financial results. With the relatively small size of our current 29-ship fleet, we are confident that we can absorb this capacity growth. Not only do we have many unserved and underserved markets around the world, but we also continue to believe that the cruise industry at large is vastly under-penetrated, especially when measured against other land-based vacation alternatives. To put this point into perspective, as you can see on Slide 9, which we provided at our investor event last month, the total number of staterooms aboard our 29 ships across our three brands is less than one-fourth the total number of hotel rooms in Orlando, Florida, alone, just one city and one single country.\n\nAnd even if you look at the entire cruise industry, there are fewer staterooms in the global cruise fleet of over 250 ships than there are hotel rooms in the top three U.S. cities for hotel capacity, which is Orlando, Las Vegas, and Chicago. So, the opportunity to grow demand is significant. And when you couple that with the supply side of the equation, where we have a high degree of visibility and a limited pipeline of new ships due to shipyard constraints, the industry, and Norwegian Cruise Line Holdings, in particular, have a strong foundation for continued growth.\n\nShifting our discussions now to our booking demand and pricing trends. As you can see on Slide 10, in the third quarter, our load factor was approximately 82%, in line with our guidance and demonstrating continued and substantial improvement over the prior quarter of 65%. We expect load factors to continue improving sequentially to the mid to high 80% range in the fourth quarter despite the fourth quarter historically being a seasonally lower-occupancy quarter in the third quarter. And looking at our quarterly load factor in terms of the gap with 2019, third quarter occupancy was approximately 30% below the comparable 2019 period.\n\nAnd we expect continued sequential improvement in closing this gap to about 20% during the fourth quarter. The steady occupancy ramp-up is expected to continue until we reach historical 100%-plus levels beginning in the second quarter of 2023. In terms of pricing, as you can see on Slide 11, our net per diem price growth in the third quarter of '22 when compared to the third quarter of 2019 was up approximately 5%. This is particularly impressive when considering the hit pricing took with the absence of premium-priced Baltic itineraries in the quarter due to the Russia-Ukraine conflict.\n\nThese strong results demonstrate the effectiveness of our strategy of holding firm on our core go-to-market strategy of market-to-fill versus discounted sale and maintaining price integrity by emphasizing high value over low price, which you can see on Slide 12. I've said this before, and I will reiterate again today given its high importance, that we strongly believe that this strategy is the optimal path to continually deliver high-quality and sustainable profitability once we return to a fully normalized post-pandemic environment, which, again, we expect will be in the early second quarter of 2023. Turning to Slide 13, as expected, our fourth quarter 2022 book position remains below that of 2019. That said, pricing continues to be significantly higher when compared to 2019 even when taking into consideration the dilutive effect of future cruise credits.\n\nDilution from future cruise credits will not carry forward into 2023 as the bonus or value-add portion of certificates issued during the pandemic will expire at year-end. Focusing in on 2023, our full-year book position is equal to 2019's record performance, and our ongoing net booking pace is at the level needed to sail full beginning in the second quarter of 2023. We believe our cumulative book position is at the optimal level when balancing our desire to encourage guests to book early in order to be approximately 65% booked by year-end for the following year while also maximizing our industry-leading pricing so as not to leave yield on the table. This volume versus price dynamic is a delicate balance that we have fine-tuned over the years using historical itinerary-specific data and our sophisticated revenue management system and is key to our success.\n\nPricing is also significantly higher for 2023 versus the comparable 2019 period with strength seen across all three brands. As we have said previously, pricing, naturally, will level off as we fill out our book for 2023, but we continue to expect to achieve record pricing for full-year 2023. As we look to the future, our entire team is mobilized, energized, and ready to flawlessly execute. Our eyes are wide open, and we are preparing for multiple scenarios given the current heightened uncertainty in the macroeconomic environment, and we are ready to adapt and pivot if needed.\n\nOur company and our industry has demonstrated its resilience time and again in the past, and I'm confident that, if necessary, we will do so again. We are also encouraged by the relaxation of protocols and the regulatory and public health environment which paved the way for us to return to normal operations. And we are excited to welcome the eight additional ships to our fleet we have on order through 2027. We will continue to be disciplined and strategic as we work to set our company up for long-term success and to maximize value for all stakeholders.\n\nI'll be back with closing comments a little later, but for now, I'll turn the call over to Mark for his commentary on our financial position. Mark.\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nThank you, Frank, and good morning, everyone. My commentary today will focus on our third-quarter financial results and outlook and the progress we continue to make on our path to full recovery. Slide 14 outlines key metrics highlighting our third-quarter results, all of which were at or above our previous guidance. During the quarter, our load factor improved 17 points over the prior quarter to 82%, in line with the guidance previously provided.\n\nThis is consistent with our phased and methodical approach to ramping up occupancies while maintaining pricing discipline as we remain on track to reach historical load factor levels for the second quarter of 2023. Fourth-quarter load factor is expected to be in the mid to high 80% range, which, while on the surface appears only modestly higher than third quarter, represents continued significant improvement when taking into account the seasonality of our operations. Strong ticket pricing and onboard revenue generation drove total revenue per passenger cruise day in the quarter, up approximately 14% versus 2019, better than our expectation for a high single-digit increase. This is particularly impressive given the impact in 2022 of the Russia-Ukraine conflict on premium-priced Baltic itineraries, which are heavily weighted to this quarter.\n\nIn addition, crew-related capacity constraints on the high-yielding Pride of America were another headwind during the quarter. As we look to the fourth quarter, we expect this metric to increase by approximately 20% compared to 2019 levels. Slide 15 illustrates our advanced ticket sales build, which continues to indicate healthy consumer demand. Our total ATS balance stood at 2.5 billion at the end of the third quarter, flat versus the prior quarter's record-high balance and versus the seasonal decline we typically see between the second and third quarter.\n\nOn a gross basis, ATS build was 1.5 billion, consistent with the prior quarter, which was the highest level in three years. In addition, approximately 1.6 billion of the total ATS balance at quarter end is associated with bookings that are already within the final payment window and, therefore, subject to cancellation penalties, which, by definition, results in stickier bookings and lower risk of churn. Turning to cost, we continue to feel the impact of inflation and global supply chain constraints, which is pressuring margins in the near term. As seen on Slide 16, we have opportunistically added to our fuel hedge position during the quarter and are now approximately 44% hedged for the remainder of '22 and approximately 38% hedged for 2023.\n\nWe continue to expect adjusted net cruise costs excluding fuel per capacity day to decrease approximately 10% in the second half of 2022 compared to the first half. Given our ongoing ramp-up, second-half costs are not representative of a go-forward run rate, in part due to the additional demand-generating marketing investments as we lay the foundation for 2023, which we expect will normalize closer to historical levels on a capacity-adjusted basis beginning next year. In addition, we're starting to see some moderation of the hyperinflation we have seen in late areas -- of late in areas such as food costs and related. Looking ahead to 2023, net cruise costs excluding fuel per capacity day will exceed 2019 levels, as anticipated, due to both normal and hyperinflation over the past three to four years.\n\nHowever, we are laser-focused on managing our cost base, and our entire team is focused on mitigating this impact by increasing efficiencies and rightsizing the business, all while still preserving the exceptional guest experience our brands are known for. To help with modeling, we have also provided additional guidance on key metrics like capacity days, revenue expectations, depreciation and amortization, interest expense, fuel consumption, and capital expenditures, all which can be found on Slide 17 and in our earnings release. Shifting to our financial performance. Slide 18 demonstrates our continued momentum and consistency in achieving key milestones.\n\nLast quarter, we generated operating cash flow for the first full quarter since the beginning of the pandemic. And this quarter, we are pleased to report positive adjusted EBITDA of approximately 28 million. The next step forward is our expectation to achieve adjusted free cash flow in the fourth quarter. We have been clear throughout our return to service that this will not be an overnight flip-the-switch process, particularly given our intense focus on best positioning our company to maximize profitability once we return to a fully normalized operating environment.\n\nOn our current trajectory, each of these building blocks are expected to lead to record net yields and record adjusted EBITDA for the full-year 2023. Moving to liquidity and our balance sheet on Slide 19, our overall liquidity position remains strong, totaling approximately 2.2 billion at quarter end, consisting of cash of approximately 1.2 billion and the undrawn 1 billion commitment. Keep in mind that during the third quarter, we took delivery of Norwegian Prima, which resulted in a cash outlay partially offset by incremental ECA ship financing. Based on our current projections and trajectory, we continue to believe we will be able to meet our liquidity needs organically.\n\nSlide 20 demonstrates the result of our deliberate measures throughout the pandemic to optimize our debt maturity profile, which positions us well as we ramp up to a normal operating environment. For the remainder of 2022 and for the full-year '23, we have approximately 300 million and 1 billion of debt payments coming due, respectively, the vast majority of which are related to our low-cost export-credit-agency-backed ship financing. We have previously disclosed that we are in the process of extending our operating credit facility consisting of our revolver and Term Loan A, which mature in early 2024, and we are on track to complete this by year-end. Upon completion, we expect to have a relatively smooth maturity profile over the course of the next few years.\n\nFor additional detail on the breakdown of upcoming debt payments through 2027, we provide a detailed schedule on our investor relations website. Our total debt portfolio is approximately 75% fixed rate today, and this is expected to increase to approximately 80% by year-end 2023, with the addition of three new builds next year, which positions us well in a rising rate environment. Turning to Slide 21. In addition to maximizing our current fleet, our expected future earnings growth from today's normalized levels will be fueled by the transformational growth profile we already have in the pipeline, representing a 50% growth in capacity versus 2019 levels.\n\nAs Frank touched on, we welcome this new capacity given our company and, more broadly, the cruise industry's under-penetration within the larger leisure landscape. Our new ships have a very favorable and efficient financing structure locked in at the time of contract, which results in an expected immediate boost to profitability once they enter service. For all newbuilds on order, our -- our financing is committed at fixed rates averaging approximately 2.5% over the portfolio. Another important component of our newbuild pipeline is that, well, prior to a ship delivery, we are already receiving significant cash flows in the form of advance ticket sales and pre-sale of onboard revenue streams.\n\nThis typically equates to roughly 100 million to 150 million of cash inflow from future bookings prior to a vessel's first revenue sailing, essentially resulting in a cash infusion into the business that continues to build over time as final payments for future voyages also become due. Before handing the call back to Frank, I want to reiterate that while we are proud of the tremendous progress we have made to date, we are not taking our foot off the gas and are relentlessly focused on executing our medium- and long-term financial strategy as laid out on Slide 22. We are keeping a close watch on the macroeconomic environment and are preparing to adapt to any potential scenario. But we are confident we are taking the right steps to set up our company for a successful future.\n\nWith that, I'll turn the call back over to Frank for closing comments.\n\nFrank Del Rio -- President and Chief Executive Officer\n\nThank you, Mark. Before we wrap up our prepared remarks, I'd like to provide an update on our global sustainability program, Sail & Sustain, which Slide 23 outlines; key accomplishments; and milestones. Since we last spoke, we continue to advance our commitment to pursue net-zero greenhouse gas emissions. We successfully completed the testing of a biodiesel fuel blend on Regent Seven Seas Splendor in October, and we announced the signing of a memorandum of understanding with MAN Energy Solutions to conduct a feasibility study on retrofitting an existing engine to operate with dual fuels, diesel and methanol.\n\nWe will continue to evaluate a variety of alternative fuels and share learnings with other companies as we collectively try to find a viable long-term solution. In September, after Hurricane Ian had a devastating impact to our neighbors in southwest Florida, we responded as quickly and as generously as we could and donated $100,000 to the American Red Cross to assist in emergency relief efforts. We also committed to matching donations from team members, business partners, travel agents, and concerned guests, and others in our network up to an additional $100,000. And before turning the call over to Q&A, I'd like to leave you with some key takeaways which you can find on Slide 24.\n\nFirst, we believe we are very well positioned in the current economic environment given NCLH's unique drivers which have allowed us to excel financially in the past and will continue to do so in the future. Second, we are hitting our targets and reaching key milestones on our path back to normalcy. We are focused on laying the foundation for long-term, sustainable profitability for 2023 and beyond. Third, our target upmarket consumer continues to hold strong, which is reflected in our excellent book position and significantly higher pricing for '23, as well as our impressive onboard revenue performance.\n\nAnd lastly, our cash generation engine has ramped up, which, along with our newbuild pipeline, provides a clear path for return to meaningful profitability and a deleveraging of our balance sheet in the coming years. We've covered a lot today, so, I'll conclude right now with this commentary and open the call for your questions. Operator.\n\nOperator\n\nThank you, Frank. [Operator instructions]\n\nJessica John -- Vice President, Investor Relations, ESG, and Corporate Communications\n\nBefore we get to the questions on the line, we first want to address a top question from our new online shareholder Q&A platform, which provides all of our investors another avenue to submit and upvote questions for management. Several of the top questions we received this quarter were centered around the same key theme, which was our comfort around our current financial position and liquidity, particularly if we face an economic slowdown or recession. Mark, do you want to answer that one?\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nSure. Thanks, Jessica. And it's very exciting to have this new engagement platform being utilized by our broad shareholder base. So, nice step forward.\n\nLook, we feel good about our liquidity position today, which is north of $2.2 billion. And as I said, that consisted of cash of 1.2 billion and the 1 billion undrawn commitment. You know, as -- as I said in my prepared remarks, based on our current projections and trajectory, we do believe we will be able to meet our liquidity needs organically. So far, despite the heightened concerns around the economy, we have not seen any signs of a pullback from our target consumer.\n\nWe continue to believe that we are better -- relatively better positioned in the event of an economic downturn given our brands' skew to the higher end of their respective market categories. And that results in a more upmarket consumer, which typically has been very resilient to weaker economic environments. So, we'll continue to monitor the evolving landscape, and we're preparing for multiple scenarios. But overall, we feel confident that if faced with challenges, we will demonstrate our resilience as we have so many, so many -- done so so many times in the past.\n\nOperator\n\nThank you, Mark. Our first question from the line comes from Patrick Scholes with Truist Securities. Please proceed with your question.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nHey, good morning, everyone. Thank you.\n\nFrank Del Rio -- President and Chief Executive Officer\n\nGood morning, Patrick.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nGood morning. A couple of questions for you regarding commissions. Certainly been a lot of news about your changes in the NCF. And, you know, can you talk why is now the right time for that? And then, related to that, you know, it would seem that this is something your competitors could do.\n\nAnd, you know, if they did it, maybe this, you know, it's sort of a net zero if everybody's doing it. Why do you see a competitive advantage of doing that at this time? And then, I'll have one more follow-up question. Thank you.\n\nFrank Del Rio -- President and Chief Executive Officer\n\nHey, Patrick, it's Frank. A couple of reasons. Number one, the travel agency community is not fully yet back to pre-pandemic levels, at least not for the cruise space, because while we were out -- and, remember, we were out nearly 500 days -- travel agents had to continue making a living. And they made a living by selling more land resorts, more land vacations than they ever had before.\n\nAnd they're still doing it. So, we have to find a way to draw them back to the cruise industry and away from the land vacations, which is our No. 1 competitor anyway as opposed to other cruise brands. And we think this is the way to do it.\n\nWe actually did an experiment over the summer using a relatively good-sized sample, and we found that travel agents who were paid commissions on these non-commissionable fares increased their business with us significantly such that the revenue that they generated over a long period of time more than offset the increase in commission expense. So, we think this is an ROI type of -- of -- of move in many ways. I hope the competition does match this because I think it'll be great overall for the travel agency community, which we all rely on. And at the end of the day, it's not about -- so much about commission savings; it's all about generating additional revenue and filling the vessels that are coming online for us and for the rest of the industry.\n\nSo, I know of no company has ever made their -- their -- their mark by saving and saving and saving. You make your mark in the top line. And this is what this is -- that's what this move is meant to do, to generate more revenue. And your second question, Patrick?\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nYeah. Thank you. That makes sense. Just taking a look actually at the 3Q results, and this was also for 2Q as well, can you remind us why again -- and this is before you made your commission change -- why were commissions and onboard cost rates so much higher than comparable in 2019?\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nYeah. Hi, Patrick and I -- this is Mark. I touched on that last quarter. So, if you recall, as part of our overall Free at Sea and part of our broader bundling package, we introduced a significantly new -- new air program.\n\nSo, we started to see, you know, some of the costs of that flowing through in -- in the second quarter. And then, of course, if you look at the third quarter, that's where most of our ships are often the more premium and exotic itineraries. So, you do see a higher cost of air component within that. That said, on a net-net basis, it does drive better overall net revenue per diems.\n\nAnd that's certainly evidenced by our -- our performance in the last two to three quarters.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nOK. Thank you for the clarity on that. I'm all set.\n\nOperator\n\nOur next question comes from Robin Farley with UBS. Please proceed with your question.\n\nRobin Farley -- UBS -- Analyst\n\nGreat. Thanks. I wonder if you could sort of put a range for us around when you talk about price being up significantly for 2023 to get a sense of, you know, what range that may be. I know you had given a range with Q2 results and indicated that that would come down as load moved up.\n\nBut I'm wondering if you sort of give us a similar ballpark. Thanks.\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nHi, Robin, it's Mark. So, I'm going to hold Frank back off on that one because I think, if you recall, last quarter, we said it was going to be a one-time data point. So, I have to be the bad guy in the room. Look, our pricing, as we said 30 days ago, is significantly up.\n\nWe reiterated that today in our release. You know, it's up, and, you know, I cannot give you a range. We gave you the one-time data point. We did say that -- that we would expect that to level off, but it's up significantly.\n\nAnd again, that is all part of our phased ramp-up strategy. We're protecting price. We want the consumer to pay more, yes. Are we -- are we -- is there an offset in the very short term that we are sacrificing a small amount of load factor? Yes, we've said that, but that is part of our strategy.\n\nWe expect to be back at load normalized load factors in the second -- for the second quarter of next year. So, we are right on path. We are right on track with our intentional actions. And all I can tell you is that pricing is up, and that continues to show in both our actual results.\n\nAnd if you recall, in my prepared remarks, I said that gross pricing is expected to be up 20% in Q4. So, if you think about that, you can kind of get an idea of where we're trending. But all signs are looking good for next year.\n\nRobin Farley -- UBS -- Analyst\n\nNo, that's great. Thanks. And just as a follow-up, just to clarify your comments about the expense. The net cruise costs for 2023, you said it would -- it would normalize in 2023.\n\nWill that be, you know, as soon as Q1? In other words, is this extremely elevated cost here in Q -- is it just a Q4 thing? Or is it going to take you a couple of quarters for it to normalize? Just trying to clarify what sort of -- in 2020 -- by FY 2023 or at some point during 2023. Thanks.\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nYeah, great question. So, look, you know, if we look at Q3 where our -- where our cost came-- came in and if you do the math and you imply where Q4 is, it's coming down slightly. Look, it's going to be a tapering down. And what -- what I would, you know, broadly guide you to is that when you look at FY '23, you know, certainly not in the first quarter.\n\nBut when you look at the year on a whole, you're probably looking at net cruise costs down, you know, at least mid-single digits from the prior year. And obviously, we expect to do -- to do better than that. But, you know, you have to really look at the composition of what's going in there. And, you know, if you look at the third and fourth quarter, we do still have some trailing COVID-related costs, whether it's testing additional crew, that is tapering off in the quarter.\n\nSo, we did see some ramping down in Q4 as related to that. In Q3, we had a significant launch of the new class of -- of vessel, Prima. That's a drag on cost. But the other thing to keep in mind, too, is that starting next year, or in '23, we no longer have quarantine cabins that are out of service.\n\nSo, while that -- and that's a double impact because if you think about that in '22 and especially in Q3 and Q4, from a unit cost standpoint, that impacts our denominator, you know, from a capacity-day basis. So, by the mere fact that we have -- we are putting those cabins back in -- into revenue sale mode, so to speak, for 2023, it will inherently reduce our unit cost, but we're also going to get the benefit from additional revenue. So, there's a lot of moving parts in -- in 2022. It's just -- as I said before, it's a bit of a noisy -- noisy and bumpy year.\n\nBut I'll -- I'll go back to, you know, the expectation that is at -- at least we expect mid-single digit decreases. And we're -- we're going to do everything in our -- in our power to do much better than that.\n\nRobin Farley -- UBS -- Analyst\n\nAnd just -- just to make sure I understand, when you're saying down mid-single digit, is that year over year? Are you saying then sort of relative to '19 that the cost could still be up like 20% or 30%? I'm trying to do the math on the -- on the slide here. So, maybe --\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nI will -- I will let you do the math. But I did say in my prepared remarks that we expect costs to be up versus '19 and '23. [Inaudible] recall, we did not have the benefit of removing any older ships from the -- from the fleet, nor did we -- did we have the benefit of selling any higher operating cost brands vis-a-vis some of the broader industry. So, when I'm talking about at least what I might commentary on mid-single digits, that's off where we are in terms of run rate for Q3 and Q4 of this year, not the entire 2022.\n\nRobin Farley -- UBS -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question comes from Steve Wieczynski with Stifel. Please proceed with your question.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nYeah. Hey, guys. Good morning. So, probably for you, Mark, but -- but want to start with the balance sheet.\n\nAnd, you know, we recently saw one of your peers lay out, you know, some longer -- let's call it longer-term financial targets in which they, you know, see a path back to investment grade over the next, you know, let's call it couple of years. Just -- you know, just wondering if you guys have thought about a similar path and maybe what the next couple of years might look like from a deleveraging perspective. As -- you know, I think I remember you guys had some massive deleveraging. I think that was post-2014 or 2015 in which you basically cut your leverage in half over, let's call it, a three- or four-year period.\n\nAlso, noticed, Mark, your capex forecast for 2024 dropped, you know, a good bit from last quarter. And I assume that's just your Prima class ship getting pushed back into early '25. But that's going to allow you guys to generate some significant free cash flow as well in '24, which, you know, potentially could help your -- your deleveraging path, if that all makes sense.\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nAll right. Well, good morning, Steve. That's a lot to unpack there. But I'll start with, you know, first and foremost, yes, we -- we think about it every day in terms of -- of where this business is going and the opportunity and how do we get back to -- to pre-pandemic levels.\n\nYou know, as we stated 30 days ago in our -- in our investor event, we are charting -- charting a path back to success. And -- and first and foremost, that -- that means rightsizing the business, getting the business back to full operating capacity, which is just around the corner. That's going to result in significant cash flow and that results in delevering and de-risking -- de-risking the balance sheet. So, that is what the entire management team, as well as our board, is focused on.\n\nI've said that before, I said that in -- 30 days ago, I'm telling you it again today: We -- we need to deliver this company. We've done it before. We've taken the company down from nine, 10 times levered to where we were in the end of 19 at, you know, low threes going into the two. So, you know, as we look forward, you know, and if I have a crystal ball, as I said at -- at the investor event, is we want to turn up, we want to finish FY '23 with a 5.x handle and leverage.\n\nAnd then, our goal in '24 is a 4.x handle and then 3.x handle. So, we obviously have a path of how we can do that. We need to continue to execute. We need a relatively stable environment.\n\nBut, you know, signs are looking good. We're getting where we need to be. Our strategy is working. Will there be bumps in the road? Yes, there is going to be bumps in the road, but we've -- we've proven time and again that we can get past that.\n\nWhat was the last part of your question now?\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nThe -- the -- the [Inaudible]\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\n[Inaudible] Yeah, sorry about that. Yeah, you're absolutely right. So, look, you know, as we said in our -- in our -- in our earnings release, we do -- we do have a slight delay with the LEO 3 and 4 class vessels, and that is strictly 100% as a result of -- of shipyard delays from supply chain constraints. I think, on average, we're -- those ships are being delayed on average by about four to five months each vessel.\n\nSo, that just -- really just simply pushes some of your capex from '24 to '25 and so forth. So, a little bit of an opportunity, you know, certainly not -- not a huge shift. But given where the world is today, we think that's OK. And that's -- that's going to further help us when we think about next year of having -- over the next couple of years having slightly better, lower capex.\n\nThat should provide more cash to the business.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nOK, understood. And then, if I could ask one more question. I know I asked a bunch to you, Mark. But, you know, maybe for Frank, you know, maybe -- maybe just how you're thinking about the next four or five months, you know, from a booking perspective.\n\nAnd I guess what I'm getting at here is, you know, you obviously have had a lot of strong booking activity since all the COVID restrictions have been removed and whatnot. But maybe just how you're thinking, you know, wave season should start to gear up here over the next, call it, four or five weeks. You know, how -- how are you guys kind of thinking about the booking patterns over the next couple of months? Are you expecting kind of a normalized wave season from here?\n\nFrank Del Rio -- President and Chief Executive Officer\n\nNo, I think it'll be an extraordinary wave season, and it's already started. You know, 10 days doesn't make a trend necessarily, but the last 10 days, the Norwegian brand had its best 10-day streak ever, ever. And I -- I think that's going to carry on throughout the fourth quarter and into -- into wave. You know, wave is -- it is a consumer event, but travel agents get behind it.\n\nAnd travel agents haven't had a wave in three years, and they're excited. And when I see travel agents excited, I can't help but, you know, join them. So, I -- I -- you know, I really think that the next four months, five months, into the end of March, which is typically the end of the season, are going to be exceptionally strong booking periods.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nOK, great. Thanks, guys. Appreciate it.\n\nFrank Del Rio -- President and Chief Executive Officer\n\nTake care.\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nThanks, Steve.\n\nOperator\n\nOur next question is from Dan Politzer with Wells Fargo. Please proceed with your question.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nHey, good morning, everyone, and thanks for taking my questions. So, Mark, I just wanted to follow up in terms of the spend cadence. I know you mentioned down mid-single digits for the -- versus that second-half run rate for net cruise costs in 2022. But as we think about for 2023 and, I guess, the cadence over the course of the year, you know, it sounds like it's going to be certainly front-end weighted.\n\nIs that mostly the elevated marketing costs? And then, as you kind of exit 2023, how should we think about the net cruise costs?\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nYeah, look -- good morning, Dan. I think, you know, when you look at the -- at the cadence, while it is still a bit early to give exact guidance on cadence, we're still going through all of our operating plans internally. I think it's fair to say that, you know, Q1 is going to be probably a bit higher than Q -- than Q2 would be. And then, naturally, I think we're going to start to see more scale in Q2 and Q3.\n\nSo, you're going to continue to see a downward trend. And --and, you know, as you're looking at your models, keep in mind, we do have three new ships that we're taking delivery of next year. So, there will be some start-up costs related to those. So, just keep that in mind.\n\nBut it's going to be a downward slope next year, and you're going to -- we're already starting to see that -- that take effect. You know, look, as we look into 2024, we're going to continue to -- to garner scale benefit as we take on new capacity. We -- we believe that, you know, throughout the course of 2023, we're going to find opportunities. And we're rightsizing the business, you know, from -- from some of the cost creep that we've just seen over the last two to three years.\n\nYou know, we've had to take hard looks at ourselves and -- and make sure we're doing all the right things. Our -- first and foremost, we wanted to make sure we were getting back, operating in a healthy and safe manner. We've done that. We're doing it.\n\nNow, we're focusing on what does it take to deliver that product. So, we are focused on it. You know, we're attacking it from every angle, but you're going to -- it will be a -- it will be a slow downward trend. And -- and -- but too early to comment on 2024.\n\nBut I -- just on the surface, we will see some scale benefit.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nGot it. Thanks. And just for my follow-up, in terms of 2023, you gave your deployment mix, which I think was -- was pretty helpful. So, as we think about pricing and the top line, to what extent do you attribute that -- you know, the pricing tracking higher to this, you know, more attractive or optimal itinerary mix with less Caribbean, more Europe, more Alaska and Asia-Pac versus 2019? Or is it -- is this more your market-to-fill strategy and kind of just holding the line on pricing?\n\nFrank Del Rio -- President and Chief Executive Officer\n\nI think it's a little bit of both, Dan. Especially, the Norwegian brand has pivoted to longer, more exotic, higher-yielding itineraries that book earlier. There is no such thing as a good close in bookings, and that's one of the things that we're trying to get away from. It's part of the strategy over the -- paying NCFs.\n\nBy the way, I failed to mention that NCFs are only paid commission if the booking is more than 120 days from -- from booking date. And there's a big demarcation of the quality, the pricing of a booking that is made early rather than close in. But, yeah, you know, we've -- we make no bones about that we hold price. We -- we lead the industry by such a wide margin on price that it's almost untouchable.\n\nAnd we continue to grow. You see what we've done in second quarter, third quarter of this year compared to our peers, what we're projecting for Q4, well, projecting for 2023. That is the central theme of our go-to-market strategy. And we accomplish it by marketing to fill, by bundling, and by having top-line product on board.\n\nSo, that's going to continue. It is core to our strategy. It's price, price, price. And that's why, as Mark mentioned, we have taken a very disciplined approach to the filling.\n\nWe don't care if we're behind others by a quarter or two in terms of load factor, we simply won't sacrifice price because we've seen historically that those who drop prices to ridiculous levels in order to fill take years, if not decades, to recover. And we're simply not prepared to do that.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nGot it. Thanks so much for the color, Frank and Mark.\n\nFrank Del Rio -- President and Chief Executive Officer\n\nThanks, Dan.\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nThanks, Dan.\n\nOperator\n\nOur next question comes from Vince Ciepiel with Cleveland Research Company. Please proceed with your question.\n\nVince Ciepiel -- Cleveland Research Company -- Analyst\n\nGreat. Thanks for taking my question. A little bit longer term, curious, Frank, your perspective on kind of finding the balance of growing capacity with continuing to source the strongest guests, providing unique and interesting itineraries. I know you talked a little bit about the low penetration rates of cruise.\n\nImagine share being just kind of part of it, but how are you thinking about kind of managing that build along with, you know, continuing to have port capacity and interesting itineraries to meet that demand you're going after?\n\nFrank Del Rio -- President and Chief Executive Officer\n\nYou know, that's our secret sauce, Vince. And if I tell you, everyone will do it. But I will -- I will tell you that there are just dozens, dozens of either under-penetrated or places that we simply don't go because we don't have enough vessels. You know, just in the U.S., there are cities in the U.S.\n\nthat are just historically very strong source markets that we don't have a vessel either seasonally or -- or at least -- or year-round. And we think that with new vessels coming online, we'll be able to do that. Alaska, where we've made huge investments in land-based infrastructures in ports, we're still under-penetrated. The Norwegian brand, for example, only has four vessels there.\n\nOceania and Regent, only one each. Our competitors have multiples of that. And the reason for that is, is that we need to be in other places. So, we see Alaska, we see Europe as growth markets.\n\nWe believe South America is becoming very, very interesting, greater demand for South American ports. Asia has taken a back seat over the last couple of years because of the COVID situation there. But I got to tell you, Japan is red hot for us. Australia is red hot.\n\nAnd so, I'm -- I'm excited about the -- the possibility of -- of going to new places with new ships and continuing to just feed the beast of high-yielding itineraries. You've heard me say before, Vince, itineraries is the No. 1 driver of yield. And we think that we -- we do itineraries better than most, and we'll continue to do so.\n\nVince Ciepiel -- Cleveland Research Company -- Analyst\n\nGreat. And second for Mark. I think there's a little bit of confusion on the cost front. And I know you guys don't want to give specific guidance, so maybe wanted to come at this from a different direction.\n\nWhen you talk about record EBITDA in 2023, which sounds like you guys still feel good about, like getting there some component of price and costs. But as you think about managing the business from a margin perspective, obviously, fuel's outside of your control. But as you just think about the next one to two years, those margins ex fuel, aka the relationship between price and operating costs, any reason to think that that would be a departure from kind of where you'd been historically?\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nYou know, Vince, absolutely not. You know, we've talked about this before, and I'm not going to sit here and tell you today that there is not near-term pressure on margins. We've said there is. We acknowledge that.\n\nI'd be a fool not to say that. But I think when you look out over the course of the next year or two and you look at where the business is going and where the cost will settle, right, this hyperinflationary environment cannot last forever. And, you know, we are taking actions internally as well to -- to ensure that we're rightsizing all of the -- all of the cost of the business. But, you know, more importantly, we believe the operating leverage of this industry and more -- most -- more particularly, our company is intact.\n\nIs it going to be there in the next quarter or two? I think that's going to be a challenge. But when you look over the next one to two years, certainly, we believe this industry gets back to pre -- pre-COVID margin levels and plus. But -- but as I said in my remarks, it is not going to be an overnight -- overnight flip of the switch. So, it's going to take some time, but without a doubt, this industry, we believe, is intact from a -- a margin perspective.\n\nFrank Del Rio -- President and Chief Executive Officer\n\nAnd, Vince, that's why maintaining those high prices is so important because we can control that, or at least we can greatly influence pricing and the relationship between marketing and sales in all our distribution channels. Whereas, you know, you acknowledge that we don't control the cost of fuel, but we don't really control the cost of beef or carrots or onions or a lot of other things that we consume. And unless you're prepared to slash and burn the product, which will in turn affect your pricing, the best way to control margins or -- or -- or influence margins positively is through pricing, which is what we do.\n\nVince Ciepiel -- Cleveland Research Company -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nOur next question comes from James Hardiman with Citi. Please proceed with your question.\n\nJames Hardiman -- Citi -- Analyst\n\nHey, good morning. Thanks for taking my question. So, some of this has been covered, but I just want to make sure we're able to sort of unpack the difference between gross pricing and net pricing, right? In the third quarter, I think gross was up 14% versus 2019. Net was up 5%.\n\nIt sounds like the differences, some of the bundling, the airfare, I guess as we move forward, some of the NCF -- NCF stuff is going to be in there. So, I guess, as we look at 2023, how should we think about the gap between those two? Should we expect that to -- to widen even -- even -- even further as we move forward, or do some of that stuff sort of peel back?\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nHi, James. Good morning. It's Mark. So, you know, you're absolutely right.\n\nWhen you look at the last two to three quarters, you know, the differential between gross to net has been about anywhere from eight to nine points, I think, when you look at -- at the second and third quarter. So, you know, if you look at where our implied guidance is for Q4 and you do the math, you're probably going to get to a spread of about seven points. So, you know, our -- our best view of everything we can see given the bundling get -- getting back to normalized load factor levels and full ships, it's probably going to be somewhere in the zone of that, you know, seven- to eight-point differential on a run-rate basis. Now, could it be higher or lower.\n\nAnd in a particular quarter, it may be a point or two, but I think, generally speaking, we're -- we're looking at somewhere around that seven -- seven-point differential.\n\nJames Hardiman -- Citi -- Analyst\n\nGot it. That's really helpful. And then, obviously, one of the things that shaped this year, maybe less so for you than some of some of your peers, but, you know, obviously, wave season was -- was hijacked by, you know, omicron and you had the Ukraine conflict. I know it's difficult, but is there any way to quantify or estimate what type of an impact that that ultimately had on your business this year? And I'm assuming that it's primarily a pricing impact, more so than occupancy, but maybe walk us through that.\n\nUltimately, I'm just trying to think through or think about what this year would have looked like with -- with a more normal wave season, which I think we're all hoping that that is the case in 2023.\n\nFrank Del Rio -- President and Chief Executive Officer\n\nYeah, James, it would have looked a lot better. You know, the -- if you look back at all the major changes that took place starting in early June when the US government no longer required people to test to get back into the country, that was a huge one. It was only four or five months ago. I think we all want to put COVID so far behind us that we forget some of these major milestones that occurred just very recently.\n\nThen, of course, the CDC dropping their protocols and allowing us to do what we're doing now, that all has contributed to less friction with consumers bringing travel agents back to the fold, so to speak. And so, that's why I'm so excited about this upcoming wave period because it doesn't have all the -- all the burdens that the last two or three had. But in -- specifically to your question about Q3 pricing and Ukraine, look, if you had asked me what is the single city in the world -- port in the world that you cannot live without, I'd tell you is St. Petersburg, and we lost it.\n\nVery, very high yields, incredible shore excursions sales. So, onboard revenue, which is, you know, higher than any other itineraries that I can think of, relatively long season. You can get to St. P in the Baltic and, you know, mid-May, and you can leave in mid-September.\n\nSo, it's a real blow. It's a real blow. And -- and so, by -- we -- we kept most of the ships there, although one vessel came out of the Baltic and we send it to the Caribbean, which is about as extreme from one to the other that you can think of. So, it did affect -- it did affect load factors.\n\nAnd no question, it affected pricing. And -- and the impact on -- on EBITDA had to be in the tens of millions of dollars.\n\nJames Hardiman -- Citi -- Analyst\n\nThat's really good color. Thank you.\n\nOperator\n\nOur next question is with Paul Golding with Macquarie Capital. Please proceed with your question.\n\nPaul Golding -- Macquarie Group -- Analyst\n\nThanks so much and congrats on the quarter. I wanted to ask a bit of a follow-on question with Europe, given the protracted geopolitical issues. I'm -- I'm looking at the deployment mix for '23. It looks like Europe is up in terms of plan for '23 deployment mix versus '19.\n\nSo, I just wanted to get a sense of the demand picture for, presumably, the North American cruiser, or is that still strong for Europe despite the geopolitics. And is that a tailwind that we should see also given the 85% North American sourcing comment from -- from prior? Thanks.\n\nFrank Del Rio -- President and Chief Executive Officer\n\nYeah, I think it is a tailwind for several reasons. One, it was until mid-summer that Americans were allowed back into the U.S. unless they had to test. And so, this revenge travel or -- and pent-up demand that we've been talking about for months is really alive and well for Americans going to Europe.\n\nAnd we want Americans going to Europe because they do sell the -- you know, buy the highest cabin categories, book, really. And also, because of the strength of the dollar, I mean, going to Europe now, even though you do pay -- Americans do pay in dollars for our cruises here, they're going to spend a lot more money, enjoy themselves a lot more once they get to Europe. So, we -- we do believe that Europe is -- is poised for an incredible 2023 season. That's why we increased our capacity there by six percentage points of occupancy at the expense of the Caribbean.\n\nI'll take that trade all day long because the yields both on ticket and on onboard revenue are so dramatically better for European cruises that, you know, we'll -- we'll take that -- that trade.\n\nPaul Golding -- Macquarie Group -- Analyst\n\nGreat. Thanks, Frank. And then, maybe staying on the topic of Eastern Europe, I was wondering if there's been any change to -- to the positive side in terms of cost with respect to your onboard labor costs due to the issues in Europe. Are you seeing any benefits there? And maybe more structurally, shoreside, even though I know it's a smaller piece, any change in the structural labor cost picture there and in general? Thanks.\n\nFrank Del Rio -- President and Chief Executive Officer\n\nNo, no change at all. The vast majority of our onboard crew are -- come from Asia, not from Eastern Europe. Things have changed. You know, 20 years ago, it was Western Europeans, became Eastern Europeans, now it's primarily Asian.\n\nSo no, no positive or question whatsoever. We have, operator, question for one more -- or time for one more question, please.\n\nOperator\n\nOur next question is from Ivan Feinseth of Tigress. Please proceed with your question.\n\nIvan Feinseth -- Tigress Financial Partners -- Analyst\n\nHi. Thanks for taking my question and congratulations on another great quarter and the ongoing progress.\n\nFrank Del Rio -- President and Chief Executive Officer\n\nThank you, Ivan.\n\nIvan Feinseth -- Tigress Financial Partners -- Analyst\n\nThe big gain in onboard spending, what -- what are the key drivers of that? What are you seeing being most popular that the cruisers are spending on?\n\nFrank Del Rio -- President and Chief Executive Officer\n\nYou know, we're -- we're seeing it in experiences. So, our -- our casino is doing really, really well. We're going to give Vegas a run for their money. People are enjoying the destinations.\n\nWe have industry-leading itineraries. So, shore excursion business is up. Our cuisine is second to none, and people are enjoying cuisine but even our spas. Our spa is doing very, very well.\n\nAnd so, I'm happy for the -- I'm happy for the folks over OneSpaWorld.\n\nIvan Feinseth -- Tigress Financial Partners -- Analyst\n\nAnd then, Mark had commented a couple times about he's seeing slight moderation in -- in commodity -- food, commodity prices. Are you still seeing those trends, or what's your outlook there?\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nYeah, Ivan, we -- you know, we continue to see that. You know -- you know, certain categories are trending down, and they're starting to get into their historical averages. We're not -- certainly not where we would like them to be or need them to be, but we are seeing continued -- continued momentum in there. But I wish it was quicker.\n\nBut, you know, we're at the mercy of the rest of the world. But again, we're seeing positive momentum on that front.\n\nIvan Feinseth -- Tigress Financial Partners -- Analyst\n\nThanks. Wishing you a big Q4 and happy holidays.\n\nFrank Del Rio -- President and Chief Executive Officer\n\nYou too.\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nThank you, Ivan.\n\nFrank Del Rio -- President and Chief Executive Officer\n\nThank you, operator. And thank you, everyone, for -- for joining us this morning. We ran a little bit over time. But those are all great questions, and we were happy to have the opportunity to answer them.\n\nAs always, our team will be standing by to answer any of your questions. Have a great day, everyone.\n\nOperator\n\nThis concludes today's conference call. You may now disconnect.\n\nDuration: 0 minutes\n\nJessica John -- Vice President, Investor Relations, ESG, and Corporate Communications\n\nFrank Del Rio -- President and Chief Executive Officer\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nRobin Farley -- UBS -- Analyst\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nVince Ciepiel -- Cleveland Research Company -- Analyst\n\nJames Hardiman -- Citi -- Analyst\n\nPaul Golding -- Macquarie Group -- Analyst\n\nIvan Feinseth -- Tigress Financial Partners -- Analyst\n\nMore NCLH analysis\n\nAll earnings call transcripts"
}