{
  "companyName": "Outbrain Inc.",
  "companyTicker": "OB",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/outbrain-inc-ob-q3-2022-earnings-call-transcript/",
  "content": "Outbrain Inc. (OB -1.90%)\nQ3 2022 Earnings Call\nNov 10, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to Outbrain Inc.'s third-quarter 2022 earnings conference call. This time, all participants are in listen-only mode. A question-and-answer session will follow the formal presentation. As a reminder, this conference is being recorded.\n\nI would like to turn the conference over to your host, Anthony [Inaudible]. Thank you. Sir, you may now begin. \n\nUnknown speaker\n\nGood morning, and thank you for joining us on today's conference call to discuss Outbrain's third-quarter 2022 results. Joining me on the call today, we have Outbrain's co-founder and co-CEO, Yaron Galai; co-CEO David Kostman; and CFO Jason Kiviat. During this conference call, management will make forward-looking statements based on current expectations and assumptions. These statements are subject to risks and uncertainties that may cause actual results to differ materially from our forward-looking statements.\n\nThese risk factors are discussed in detail in our Form 10-K filed for the year ended December 31st, 2021, as updated in our Form 10-Q for the quarter ended June 30th, 2022, and in subsequent reports filed with the Securities and Exchange Commission. Forward-looking statements speak only as of the call's original date, and we do not undertake any duty to update such statements. Today's presentation also includes references to non-GAAP financial measures. You should refer to the information contained in the company's third-quarter earnings release for definitional information and reconciliation of non-GAAP measures to the comparable GAAP financial measures.\n\nOur earnings release can be found on our IR website, investors.outbrain.com under the News and Events section. With that, let me turn the call over to David. \n\nDavid Kostman -- Co-Chief Executive Officer\n\nThank you, Anthony. We're pleased to report that we exceeded the high end of the guidance we provided for Q3, both for extra gross profit and adjusted EBITDA, and we are raising our guidance for the full calendar year 2022. We are encouraged by our tremendous momentum and significant market share gains with premium publishers and by the fact that we are continuously broadening our value proposition for enterprise brands and performance advertisers reaching over 1 billion unique users on the open web. At the same time, we are driving business efficiencies through consolidation of activities in lower-cost geographies, acceleration of automation and strict cost controls.\n\nIn July, we implemented a headcount reduction process as a continuation of cost reduction steps we started taking already in March. In total, we took our annual cash costs down by approximately $50 million versus our original 2022 plan. Let me start with the supply side of our marketplace. As mentioned, we migrated some of the largest most premium publishers to the Outbrain marketplace, including the global Daily Mail group properties, FOX News in the U.S., and many others.\n\nWe also renewed deals with many publishers, including Meredith and Politico. This highly strategic, large supply partners are additive to the major wins we've been reporting since the beginning of the year, and they enabled us to experience double-digit growth of our ad impressions year over year, resulting in our highest level of impressions ever. We are very excited by the addition of these partners and believe that our leadership position among the world's most premium publishers is stronger than ever. According to Similarweb data, for example, in the U.S.\n\nand Israel, we are the exclusive partner for four out of the Top 5 news publishers. In Germany, it is six out of the Top 10. And in France, it is eight out of the Top 10. And as we expand with more partnerships, we're also deepening our impact by driving demand, not just to the feed where we reached close to 60% SmartLogic adoption in desktop and over 80% adoption in mobile but also through mid-article placements known for higher brand awareness and viewability and therefore attracted two large enterprise brand advertisers.\n\nAs a data point, we have currently more than 100 header bidding integrations with publishers and continue to expand it with our thousands of publishers. Let's move to the demand side. As we discussed last quarter, this huge supply wins coincide with general softness on the advertiser side, which is reflected mostly in cost per click or CPC. Our diverse demand mix of enterprise brand and performance advertisers has provided some stability as we see outcome-driven performance brand driving more revenues in Q3, which is keeping our marketplace at close to 100% fill rate.\n\nPricing in our marketplace remains the current headwind given the macroeconomic situation. In Q3, we've seen CPCs decline more than 20% versus the same period last year, including the unfavorable impact of foreign exchange. This decline was partially offset at an RPM level to continuous click-to-rate algorithmic improvement. In terms of geographies, we continue to see more headwinds in Europe, including on a constant-currency basis.\n\nIn terms of segment, although our advertiser base is diversified, we've seen weakness in automotive and finance, while trends in travel entertainment intact have been stable to positive. To sum it up, we continue to focus on our core and execute tightly and strategically on key priorities. On the supply side, we've built massive high-quality exclusive open web supply for multiyear period. And on the demand side, we're expanding beyond our strong performance business to more brand budget.\n\nTherefore, we believe we are well positioned for medium-term and long-term growth, which depends mostly on our ability to execute and gain incremental share of wallet with advertisers. On the financial front, we are pleased that we exceeded the high end of our guidance for Q3, and we are moving cautiously on any expenses to ensure that we act responsibly in the current environment and are focused on profitability for 2023. With that, I will now turn it over to Yaron.\n\nYaron Galai -- Co-Founder and Co-Chief Executive Officer\n\nThanks, David. In Q3, we formally launched Keystone at an event with over 40 top global publishers. The sponsors have been very positive, and we are now in the implementation phases with three additional publishers that will join the four design partners that we previously mentioned. It is clear that revenue diversification is one of the top priorities for many of the best publishers around the world.\n\nAnd it is clear that they are lacking the technology needed to enable their diverse revenue growth at scale. Many publishers are adding paywalls, registration, e-commerce, newsletters, video, etc. We are all seeing and feeling that as consumers of content and news. In today, most publishers will make manual decisions on how to carve up their real estate, whether it's a pop-up, prompt to register, sidebar box to show video or navigation box to e-commerce offers.\n\nThese manual real estate decisions are then typically shown to large swaths of users without personalization or optimization. Keystone is a technology platform that helps make automated personalized decisions designed to help grow publishers with various business KPIs by tailoring different content and offers to different users. Keystone leverages significant technology and algorithms from Outbrain's core advertiser and publisher products and leveraging our core publisher sales teams and publish relationships in our go-to-market. Our design partners have been reporting to us a 30% plus improvement of user engagement where they have implemented Keystone as compared to their prior baseline and a list of their business KPIs for these Keystone placements.\n\nSo, while Keystone is in its infancy, we're encouraged with the early excitement from publishers that joined the September launch and from the results reported by our design partners so far. I'm pleased that we are staying true to our core business, and we see tremendous growth opportunities in it. Whether through Keystone, midarticle brand placements, video intelligence, or our header bidding partnerships that David mentioned, we continue to deepen the value Outbrain creates as a strategic partner for some of the world's best media owners and brands. Now, on to Jason Kiviat, our CFO, to discuss the financials.\n\nJason Kiviat -- Chief Financial Officer\n\nThanks, Yaron. As David mentioned, despite seeing steeper-than-expected FX headwinds on our top line, we beat our Q3 guidance for both Ex-TAC gross profit and adjusted EBITDA. Revenue was approximately 229 million, a decrease of 3% year over year on a constant-currency basis and 9% on an as-reported basis. The decrease year over year is driven by lower yields, owing largely to the headwinds on advertising demand affecting our industry.\n\nThese headwinds were partially offset by growing our supply from winning new, quality long-term partnerships and from expanding our ad impressions and click-through rate on existing partnerships. Adding new media partners in the quarter contributed 11 percentage points or approximately $28 million of revenue growth year over year, and our net revenue retention was 81%, reflecting the impact of the demand environment, reducing modification levels on our platform. The net revenue retention rate for Q3 reflected the net positive growth of ad impression, as well as improvement to click-through rates more than offset by the lower CPCs on the demand side that David spoke to, as well as FX headwind. As a reminder, 60% of our business is outside the U.S.\n\nEx-TAC gross profit was 53 million, a decrease of 20% year over year on a constant-currency basis and 23% as reported. As we noted last quarter, a steeper decline of Ex-TAC gross profit year over year versus revenue was driven by several factors: one, an unfavorable mix of revenue; two, lower performance on certain media partners, driven in part by the demand headwinds we're seeing; and three, the impact of onboarding and optimizing significant new supply partners, which is challenged by the weaker-than-normal demand return. We expect to go out of this headwind in the coming quarters, assuming no further deterioration in the macro environment. Moving to other cost of revenue, which increased approximately $3 million year over year, driven by our investments to increase serving capacity in order to facilitate yield growth through algorithmic and optimization improvement efforts.\n\nThese areas have been large growth accelerators in recent years. Our belief is that when demand stabilizes and recovers, we will be positioned to return to revenue growth through technology and product improvements, which will generate operating leverage on these investments. Operating expenses decreased approximately 17.7 million year over year to $49 million in the third quarter. Approximately 16.5 million of the decrease is nonrecurring and was triggered by our IPO as it relates to the incremental stock-based compensation expense recognized last year for awards with an IPO earnings condition.\n\nExcluding this onetime impact, operating expenses decreased 1.2 million year over year, driven by a few offsetting factors. We had higher personnel-related costs, reflecting increased headcount, including from our VI acquisition in January, effectively offset our lower variable compensation costs and FX stability year over year. As noted in the prior quarter, we also are seeing higher marketing, T&E and facility expenses, effectively impacted by COVID, return to more normal operations this year. These increases were more than offset by the impact of a one-time insurance recovery received in the current year.\n\nAs mentioned last quarter, we implemented a series of cost reduction efforts to adjust the current business spending, and we continue to focus our attention on driving greater efficiencies in our operations. Adjusted EBITDA was 1.7 million in Q3. On a constant-currency basis, adjusted EBITDA was approximately breakeven due to the favorable impact of FX on operating expenses, primarily from the euro, Israeli shekel, and British pound. Next, moving to liquidity.\n\nUses of cash in the quarter included the majority of the remaining cash consideration paid for our acquisition of VI, as well as continued share repurchases. Free cash flow, which we define as cash provided from operating activities less capex and capitalized software costs, net use of cash in the period of approximately 16 million. This was primarily driven by lower profitability and the timing of cash receipts and payments around period end. I'll point out that when you look at the balance sheet, we will now see investment in marketable securities balances in both the short- and long-term assets, totaling $207 million.\n\nIn total, we ended the quarter with 345 million of cash, cash equivalents, and investments on the balance sheet and 236 million of long-term convertible debt. Lastly, we announced previously on February 28, our board authorized a $30 million share repurchase program. Through October 31st, we have repurchased approximately 5.8 million shares for a total of $27.8 million, including commissions, with remaining availability under the program of $2.2 million. Now, turning to our outlook.\n\nAs discussed today and in prior quarters, the volatility of demand we've seen this year is ongoing, which results in continued uncertainty and a more cautious approach. With that context, we have provided the following guidance. For Q4, we expect Ex-TAC gross profit of $57 million to $60 million. We expect adjusted EBITDA of $4 million to $6 million.\n\nFor full year 2022, we are increasing our expectation of Ex-TAC gross profit and adjusted EBITDA to at least $232.5 million and $23.2 million, respectively. This guidance assumes no further material changes in macro conditions. Now, I'll turn it back to the operator for Q&A.\n\nOperator\n\nThank you. We'll now begin the question-and-answer session. [Operator instructions] This time, we'll pause momentarily to assemble the roster. First question will be from Ross Sandler, Barclays.\n\nPlease go ahead. Mr. Sandler, is your line on mute? All right. We'll move on to our next question, which will be from Laura Martin, Needham.\n\nPlease go ahead.\n\nLaura Martin -- Needham and Company -- Analyst\n\nHi. Can you hear me OK?\n\nDavid Kostman -- Co-Chief Executive Officer\n\nYes, Hi, Laura.\n\nLaura Martin -- Needham and Company -- Analyst\n\nHi, hi, hi. So, a couple. So, net retention of about 80% is pretty low, and your competitor reported that they have spent $20 million in the quarter guaranteeing new business. So, I'm wondering if you are losing out clients to your primary competitor?\n\nDavid Kostman -- Co-Chief Executive Officer\n\nOK. Let me take that. Thanks for that question. So, if you look at new business, actually, our new business was 30% higher than the competitor for Q3.\n\nSo, we reported $28 million of new business. What we are talking about when we talk about wins, we're talking really about major publisher wins. I would say that in aggregate, on an annual basis, we probably moved over to our marketplace well north of $100 million of business, and these are names like Daily Mail, obviously, top name, Fox, and others.\n\nJason Kiviat -- Chief Financial Officer\n\nThis is Jason. I'll just add on that to give some color to that 81%, Laura. We actually added page views or impressions, our primary supply metrics, net of any churn. So, we grew that on a same-store sales basis year over year.\n\nSo, there really wasn't meaningful churn. You know, it was really all in the demand and the average CPCs paid by advertisers as David said in his prepared remarks, 20% plus down year over year on just pricing. And you're talking about 81% because we did grow the actual, you know, supply net of any churn. And we also grew our -- through our technology, our click-through rate.\n\nSo, we grew clicks in both ways, but it was pricing that was down year over year.\n\nDavid Kostman -- Co-Chief Executive Officer\n\nThere are some more parameters that we highlighted in the call is in terms of the leadership position, we highlighted some of the major market position. If you also look at the number of impressions, we have a record number of impressions. So, when we talk about wins, there's a massive size wins long term and very good deals for us.\n\nLaura Martin -- Needham and Company -- Analyst\n\nOK. Can we talk about Keystone? This is where you and I disagree. So, Keystone sounds to me like it's highly customized. In order to help companies digitize their back end, every company is different, and they're going to want a lot of sort of maintenance, care to understand their business.\n\nIs Keystone really a business that is scalable the way your core business is where you can just build a single platform and, suddenly, everybody plugs in? Or is there going to be a lot more employee sort of handholding by you guys and the margins ever be as high as your core business, please?\n\nYaron Galai -- Co-Founder and Co-Chief Executive Officer\n\nYes. So, it shares a lot of the -- and thanks, Laura, for the question. It shares a lot of the fundamental attributes of our core business because, as I said on the call, we do leverage a lot of the core product and technology for Keystone. And so, we know how to work with these publishers.\n\nWe've been doing this for almost 15 years with many of them. And, again, it leverages a lot of our core abilities, both human and technology. That said, this is a new type of business. It is a SaaS business.\n\nAnd so, the level or the interaction that they expect and we expect to provide is different. And, you know, in the long term, our bet with this is that it really takes us one step above in terms of the strategic relationship that we have with these partners. So, we think it's a good investment on that.\n\nLaura Martin -- Needham and Company -- Analyst\n\nOK. And finally, Microsoft. Could you guys update us on what's going on with Microsoft and you guys?\n\nDavid Kostman -- Co-Chief Executive Officer\n\nSo, generally, we don't talk about -- Laura, this is David. We don't talk about specific customers, but Microsoft remains a super large partner, a very important partner for us. We're very excited about the progress they are making generally on the advertising side, and this bodes well for our partnership with them.\n\nLaura Martin -- Needham and Company -- Analyst\n\nOK. Thanks very much. Thank you.\n\nOperator\n\nThank you. Next question will be from Ross Sandler, Barclays. Please go ahead.\n\nRoss Sandler -- Barclays -- Analyst\n\nAll right. Can you hear me this time, guys?\n\nDavid Kostman -- Co-Chief Executive Officer\n\nHey, Ross.\n\nRoss Sandler -- Barclays -- Analyst\n\nAll right. OK. How do we think about framing 2023 growth at this point? I mean, we're seeing what's happening broadly in the industry, but how are you guys thinking about it as we head into next year? And then, Yaron, the comment you made about Keystone early partners seeing 30% improvement in engagement. It was pretty interesting.\n\nIs that an ad engagement increase? Or is that like overall viewership increasing 30%? Could you just unpack a little bit more about what's driving that and what you meant there? Thanks a lot.\n\nDavid Kostman -- Co-Chief Executive Officer\n\nI'll take maybe the first question here, Ross. So, we're not giving a specific guidance for '23, but we are very focused on profitability, cash flow generation for next year. You saw we were cautiously guiding up for Q4. I think we're going to see the ability to leverage the massive supply wins.\n\nThey're going to highlight the scale of them. So, as time goes by and we optimize further and improve the performance of this deal, this is long-term supply that we already have. So, I think that's going to allow us to continue to grow. And what we need to do next year is we need to take share of wallet.\n\nI think also, you know, the demand side follows the supply. So, when you have these massive supply wins that I highlighted, many of the advertisers also are following. They want to be on these sites. These are sites that are what we call tentpoles or anchors in every market makers -- in every market.\n\nSo, we feel pretty good about the ability even in a rough economic environment to just take a bigger share of wallet. This is also why we are accelerating growth with enterprise brands. So, we have a very strong performance business, but we're also doing a lot to be able to access more existing budgets of enterprise brands.\n\nYaron Galai -- Co-Founder and Co-Chief Executive Officer\n\nHey, Ross. Yaron here. I'll take the second question about Keystone. So, first of all, the 30% plus that I mentioned is the number that's being reported to us by some of the design partners on the improvement of the user engagement they're seeing on Keystone implemented placements on their properties versus the baseline they had before.\n\nNow, just to try to use the metaphor here, the way these -- Keystone, the way they use their real estate is by making largely manual decisions, which apply to pretty much all their users. So, it's almost like, say, Spotify, where once a week they choose the song that everyone can listen to. And that's it, and that's the song that's recommended to everyone. They don't make personalization and optimization on those individual -- for individual users.\n\nSo, with Keystone, we take those same placements, and we're now personalizing and optimizing it the way, you know, we do so well in the news feed itself. And so, that's how they're seeing the increase in user engagement. And this is not under ad spots, but rather on the other business KPIs that they're trying to drive, whether it's internal e-commerce or subscriptions or reducing churn. So, it's on those KPIs where we can increase their engagement.\n\nOperator\n\nThank you. Next question will be from Andrew Boone, JMP Securities. Please go ahead.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nGood morning. Thanks so much for taking my questions. Just as we think about modeling, can you guys double-click on take rates and just talk about how we should think about that near term? I understood the macro is difficult in terms of predicting demand, but is there just directionally, how should we start to think about take rates as being stable, starting to improve, or what direction? \n\nJason Kiviat -- Chief Financial Officer\n\n[Technical difficulty] Sorry. I was giving a long answer on mute there. No, I was just saying -- thanks, Andrew, it's Jason. We've spoken before how -- when we enter deals, we focus on the Ex-TAC dollars, not necessarily the take rate, but obviously, we gave some color last quarter and this quarter on the call just on some of the factors that impact our overall take rate.\n\nObviously, one of them is always going to be a mix of just, you know, what types and sizes and geographies of partners we're generating more or less revenue from in a period. And then, obviously, the demand impact is certainly the biggest driver on our margin change this year. Of course, a bunch of our partnerships are variable rates that are based on impacted negatively by the negative macro trends and the lower demand and lower yields we're seeing from it. Now, there is obviously some in our control, of course, as well.\n\nYou know, we've added a lot of quality, good supply in these things in our history, take a few quarters to ramp up and optimize and scale, and we've done that in the past routinely. And so, there -- there's certainly some in our control to keep improving. And, obviously, some that's also just going to be macro driven as well. We don't see rates going, you know, significantly lower or higher in the next couple of quarters.\n\nI mean, it's not something we guide to, of course, but we -- to help you with your modeling, I would say we don't expect them to go materially lower than where they are right now.\n\nDavid Kostman -- Co-Chief Executive Officer\n\nI would just add, Andrew, to that. When you look at the RPM composition, it's sort of CTR. We still saw improvements year over year in Q3. And we talk a lot about the supply, but the interesting thing here is that the demand and many of the advertisers just need to be on those market makers side.\n\nSo, we expect that it takes time to ramp up some of these deals, but it also brings a lot of new advertisers to the marketplace. And we talked about that phenomenon of the better blanket. The more demand we will get into it. And because of those massive supply wins, there's much more demand that wants to be in as part of our marketplace, not just on these new sites.\n\nYou know, we also feel it's going to create a positive dynamics and be able to leverage the algorithmic improvement that we still see into a much larger scale. So, we're not -- we're not building on any improvement on pricing in the short and mid term.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nAnd then I guess just a bigger-picture question for me is just thinking about how do you guys harden demand? Like what do you guys need to do to create more truly always on budgets that are on the platform? I'll just -- I'll leave a broad open-end question there. Thanks so much.\n\nDavid Kostman -- Co-Chief Executive Officer\n\nAndrew, it's -- sorry, I will repeat a little bit. I think it's -- I think creating that exclusive huge supply base attracts the demand. I mean, advertisers want to be on those big sites. So, it doesn't only help impressions, which we had record levels.\n\nAnd as I said, we added about north of $100 million of new business that's coming from competition, but also that attract a much larger number of advertisers. Our growth into midarticle, header bidding, video intelligence is also allowing us to be much more attractive and relevant for enterprise brand budget. And also there, by the way, we're very much focused on clients that are looking for additional measurable outcomes, and we see good traction with that. So, that's why we're cautiously optimistic that even within the current environment, we will continue to execute, be very focused on the core business, and we will be able to see the growth coming from this growth of supply that's bringing in more demand that's making the marketplace more attractive.\n\nYaron Galai -- Co-Founder and Co-Chief Executive Officer\n\nAnd, Andrew, Yaron here. Maybe just to add one thing about that, as we mentioned on the call, we do have demand at a fair rate of near 100%. And so, we have the demand, including for business growth in new partnerships. This really is a pricing thing due to the macro.\n\nOperator\n\nThank you. [Operator instructions] Our next question will be from Shweta Khajuria at Evercore ISI. Please go ahead.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thank you. Could you and David, please, talk about how you're thinking specifically thinking about cost management next year? I know you commented the focus is going to be on profitability and cash flow generation, which makes sense. What specifically are you thinking about for next year? Thank you.\n\nDavid Kostman -- Co-Chief Executive Officer\n\nHi, Shweta. We are -- if you recall, I mean, we started, I mean, already cautioning a little bit on the outlook in March of this year so -- when we saw some weakness in Europe. So, we started already taking actions internally since March. We did more of a cost reduction more concerted one in July.\n\nAnd right now, we're focusing on a few things. We have a development center in Ljubljana. We're moving more resources there. We're generally looking at shifting sort of resources to lower-cost areas.\n\nWe increased investments in automating processes, more self-serve. And we're looking at generally where are the opportunities in terms of integrating, consolidating. So, we accelerated integration of VI into our core, and we accelerated some things with [Inaudible] So, we are very focused on all the operational things that we can control. And so, these are, I would say, the main areas.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thank you. And then, Jason, how should we think about your guidance for the quarter in terms of, you know, how much conservatism may be baked into it? And what sort of accounted for to get to your low and high end of the guide? Thanks.\n\nJason Kiviat -- Chief Financial Officer\n\nSure. Yes. So, I mean, let me just start maybe just with what we've kind of seen in the year and the quarter just to frame that a little bit. So, obviously, we've talked earlier in the year about the large step down in demand that we saw, which were, really, at the end of Q1 and our biggest one that we've seen were in Q2.\n\nWe haven't seen any kind of change in demand quite as meaningful, you know, since then as far as budget cancellations, which were really first in Europe and then maybe more in the U.S. after that for various macro reasons. And, obviously, FX has been a headwind all year. As you know, 60% of our business is outside the U.S.\n\nBut August and September showed more of what I'll call like a relative stability, I guess, compared to H1, and we've seen that continue into the early part of Q4 as well. I think a few things to say why. One is just -- you're only just talking about the diversity of advertisers. We have, obviously, verticals, but also type, a lot of our performance marketers have taken on -- their budgets have been a little bit more resilient, particularly in the U.S.\n\nin these last couple of months. And they've taken on a bigger portion of our advertiser mix, which has been a little bit more stable. We've also just seen positive signs. You know, we're cautiously optimistic, I guess, from both U.S.\n\nand Europe in the last month or two, including Germany, which is our second largest market, we've talked about it and was hit as hard as anyone by the demand headwinds this year. So, it gives -- it leaves us some cautious optimism and, you know, expecting a more normal seasonal list in the back half of Q4. And, obviously, all these quality supply we're talking about just scaling into them is assumed in our guidance. So, I'd summarize it with, you know, we're using October run rate, October FX rates.\n\nWe're cautiously optimistic on the seasonal lift in the back half of the quarter, which is typically our strongest time of the year. And we expect to continue scaling and performance of our new supply. And, of course, there has been no material deterioration in the macro conditions. So, I hope that gives some color.\n\nDavid Kostman -- Co-Chief Executive Officer\n\nI just want to add on your cost point. I mean, we talked about $50 million of reductions this year versus our plan. We are obviously in final stages of budgeting 2023. I think we are ruthlessly prioritizing.\n\nAnd, you know, we're looking at all the cost in terms of how the outlook is for '23, and we will do whatever is necessary to really ensure profitability for next year.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thanks, David. Thanks Jason.\n\nOperator\n\nThank you. That concludes our question-and-answer session. I'll turn the call back over to Mr. Yaron Galai for closing remarks.\n\nPlease go ahead.\n\nYaron Galai -- Co-Founder and Co-Chief Executive Officer\n\nThanks, operator, and thank you all for joining us today for our Q3 earnings. We are pleased with beating our guidance for Q3 and raising our full-year guidance despite the tough macro conditions. This quarter continued a record year of winning significant new long-term partnerships with some of the largest and most premium publishers globally, which gives me the confidence that our superior technology and strong commitment to our partners will pay off in stronger growth and profitability. Thanks for your time and looking forward to updating you here next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nUnknown speaker\n\nDavid Kostman -- Co-Chief Executive Officer\n\nYaron Galai -- Co-Founder and Co-Chief Executive Officer\n\nJason Kiviat -- Chief Financial Officer\n\nLaura Martin -- Needham and Company -- Analyst\n\nRoss Sandler -- Barclays -- Analyst\n\nAndrew Boone -- JMP Securities -- Analyst\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nMore OB analysis\n\nAll earnings call transcripts"
}