{
  "companyName": "ZoomInfo Technologies Inc.",
  "companyTicker": "ZI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/zoominfo-technologies-inc-zi-q3-2022-earnings-call/",
  "content": "ZoomInfo Technologies Inc. (ZI -0.13%)\nQ3 2022 Earnings Call\nNov 01, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the ZoomInfo third quarter financial results conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would like to hand the conference over to your speaker today, Jerry Sisitsky.\n\nPlease go ahead.\n\nJerry Sisitsky -- Investor Relations\n\nThanks, John. Welcome to ZoomInfo's financial results conference call, highlighting our results for the third quarter of 2022. With me on the call today are Henry Schuck, founder and CEO of ZoomInfo; and Cameron Hyzer, our chief financial officer. After their remarks, we will open the call to Q&A.\n\nDuring this call, any forward-looking statements are made pursuant to the safe harbor provisions of U.S. securities laws. Expressions of future goals, including business outlook, expectations for future financial performance and similar items, including, without limitation, expressions using the terminology may, will, expect, anticipate and believe and expressions, which reflect something other than historical facts, are intended to identify forward-looking statements. Forward-looking statements involve a number of risks and uncertainties, including those discussed in the Risk Factors section of our filings with the SEC.\n\nActual results may differ materially from any forward-looking statements. The company undertakes no obligation to revise or update any forward-looking statements in order to reflect events that may arise after this conference call, except as required by law. For more information, please refer to the cautionary statement included in the slides that we have posted to our investor relations website at ir.zoominfo.com. All metrics discussed on this call are non-GAAP unless otherwise noted.\n\nA reconciliation can be found in the financial results press release or in the slides that we've posted to our IR website. With that, I'll turn the call over to our CEO, Henry Schuck.\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nThank you, Jerry, and welcome, everyone. Today, more than ever, go-to-market teams are looking to do more with less, and the ZoomInfo platform is the only solution that can deliver exactly that for companies of all sizes. We're at the beginning of a generational shift of digital transformation for B2B sellers and our business model has proven powerful even in a challenging macroeconomic environment. Our all-in-one platform drives efficiency at a time when every dollar spent is being scrutinized, and it does that by connecting businesses with the people who are most likely to purchase their solutions and giving them the technology they need to engage at scale.\n\nZoomInfo's Q3 results once again beat expectations on the top and bottom line, and we're again raising our full year revenue and profitability guidance. In the third quarter, we delivered GAAP revenue of $288 million and adjusted operating income of $118 million. This represents year-over-year growth of 46% and an adjusted operating income margin of 41%, up approximately 120 basis points sequentially and up approximately 180 basis points from last year. We generated $100 million in unlevered free cash flow in the quarter or nearly $1 per share on an annualized basis, underpinning our leading combination of growth and profitability at scale.\n\nIn Q3, we sold the largest expansion deal in the company's history, another eight-figure TCV client. We also sold the largest new business deal in company history, our first land to exceed $1 million with SalesOS, OperationsOS, Engage and Enrich being leveraged. The platform strategy is increasingly resonating, and we continue to consolidate point solutions across sales engagement, conversation intelligence, data and account-based marketing like we did this quarter with Ryder System, Taylor Corporation and USI. While these deals demonstrate that we're continuing to execute well, as we made our way through Q3, we began to see increased macro pressure on deals, causing the level of deal review to increase and sales cycles to elongate further.\n\nSince this started very late in the quarter, it only modestly impacted Q3 results. This elongation trend has continued into Q4, and we do expect it to impact growth in the short term. While we can't control the macro, and we know that we could deliver even more growth in a more stable economic environment, we can control how we manage the business. And you will see the resiliency of our model play out in the form of strong and consistent margin gains driving earnings.\n\nWe are confident in raising guidance for 2022, and we expect to continue driving a sustainable combination of best-in-class growth, profitability and free cash flow generation at scale. With that, let me highlight some of the many customer successes in the quarter. First, we ended the quarter with 1,848 customers who spend more than $100,000 a year with us. That's up 40-plus percent year over year.\n\nWe again drove record ACV per customer. And as I mentioned earlier, we saw the largest expansion and new business deal in the company's history. We continue to close transactions with customers across all industries, seeing the strongest growth in the transportation and logistics, finance, insurance, real estate and manufacturing verticals. Advanced functionality now represents 30% of ACV, and we continue to go deeper and increase our strategic value to our customers.\n\nMore than ever, organizations want to work with fewer, more strategic partners. And as a result, the full stack of our integrated best-in-class platform is even more relevant. As an example, a top news and entertainment broadcasting company went from a demo with a single rep to a multimillion dollar transaction that went wall-to-wall across their entire sales team. This deal accelerated the digitization of their sales motion, given their sales and sales ops professionals the best opportunity to win with highly accurate data and insights that are cleansed and routed to the right sales reps, plus the automation, workflows and engagement tools needed to efficiently close a deal.\n\nTheir team said it best. There are going to be two types of sales teams going forward, successful and efficient teams that have ZoomInfo and mediocre teams that do not. Next, a Fortune 50 consulting infrastructure and software company expanded their licenses to further streamline their go-to-market strategy with best-in-class global data, insights and automation. As an enterprise organization, they needed to select a vendor that they could trust, and our investments in privacy and data stewardship gave them the confidence in our platform and our company.\n\nTheir investment expanded their SalesOS users by more than 300% to over 3,500 professionals across 63 countries. ZoomInfo allows them to reach the right stakeholders at the right time when they are in market. A large public telecommunications company with more than 3 million customers wanted to improve efficiency by consolidating several vendor relationships. They already use ZoomInfo for data orchestration but decided to unify their go-to-market strategy by expanding with SalesOS, MarketingOS and OperationsOS.\n\nThis full stack deal represented a more than 10 times expansion with ZoomInfo. And a $15 billion market cap financial data services company was looking to rationalize spend across their tech stack without losing the efficiency of their sales team in the face of an uncertain macro environment. We help them consolidate vendors by adding our Intent and Chat products, providing them one end-to-end go-to-market suite while growing their SalesOS seats by 50%. We continue to focus our development efforts to create integrated experiences across the entire platform and to deliver data-driven engagement workflows to help our customers drive efficient growth.\n\nIn SalesOS, we continue to invest behind unifying the sales professionals' experience for prospecting, engagement and closing deals onto a single platform by integrating our core sales intelligence, Engage and Chorus' conversation intelligence products. Customers are now able to streamline prospecting and engagement in SalesOS, using one-click engagement, advanced sales automation and the integration of conversation intelligence. We also continue to invest in our footprint across the go-to-market organization, adding products for account executives, account management and customer success teams. We've integrated ZoomInfo intelligence into the post-call and pipeline review process via Chorus.\n\nSo contact company and engagement functionality is available without leaving the platform. This includes our new meeting brief that help our customers run effective meetings by pushing company, participants and competitive intelligence along with deal risks and engagement highlights right to our customers' inbox. In MarketingOS, we focus on automating key activities to help marketers achieve better targeting and alignment between sales and marketing. As part of our multiyear product vision, we're building out an integrated platform that optimizes end-to-end go-to-market motions by unlocking omnichannel cross-departmental use cases.\n\nThis strategy is resonating with customers. Over 75% of MarketingOS customers are already SalesOS customers who want to get their teams onto the same tools, leveraging the same data. In the quarter, we added lead expansion capability, which allows users to expand their advertising audiences to similar target personas within the same account to influence a larger portion of the buying committee and better multithreaded deals. Additionally, we know that responding to interested prospects within less than 90 seconds increases conversion rates by close to 40%.\n\nThat's why we integrated Slack into our workflow engine, putting the right market and buyer intelligence in front of the right people in seconds. For example, if a prospect from one of your assigned accounts visits a high-value page on your website, we can automatically alert you and attach the relevant account and deal context for immediate outreach. We also expanded our campaign reporting capabilities to include insights into account creative and domain placement for DSP campaign, which supports quick A/B testing and help streamline workflows. In OperationsOS, we're helping customers move beyond static data quality enrichment and into a world of continuously updated, ready-to-action data inside their CRM.\n\nCustomers can now automatically capture all relevant companies inside their predefined total addressable market and operationalize them through sophisticated routing. They can append new information such as buying committees or sales signals to all accounts within the CRM. And they can track data changes through dynamic triggers to allow teams to take action on any detected changes at scale. For example, we will capture relevant sales signals such as a key contact moving to a new company and then automatically capture replacement contact at the account and alert the sales reps so they can take action on this change while automatically generating related records in the CRM.\n\nAnd from a data access standpoint, we delivered massive performance improvements to our APIs, reducing our API call time by 55%. The enterprise demand for our APIs has grown rapidly with the number of API customers more than doubling this year alone. ZoomInfo APIs not only provide organizations with a means of connecting systems and applications but often play a critical role in companywide digital transformation initiatives. A second focus area in Q3 was to introduce new market signals to help provide our customers with the most actionable and complete data set.\n\nIntent data is an extremely important signal that sales and marketing teams increasingly rely on for prioritizing the right accounts to engage with. This quarter, we introduced the ability to bring outside intent sources into the ZoomInfo platform, starting with G2 intent data, layering G2's intent signals on top of our powerful company and contact intelligence allows customers to take better advantage of their G2 intent signals by enabling direct action against those signals in our platform. In addition, we've improved our website offering so that customers can indicate high, medium and low buying intent, driven by visits to individual web pages, such as a pricing page visit being a higher buying signal than a visit to our careers page. These signals can then be leveraged to create high-intent audiences to power advertising campaigns or sales outreach.\n\nThe third area of focus was to reduce friction and set up end user management processes for admin. As ZoomInfo's RevOS platform has become a solution for entire go-to-market team, we are focused on delivering deeper account control with frictionless setup. We have made multiple updates to automate the provisioning and deprovisioning of users, the ability for admins to manage and connect email accounts across their user base, driving better adoption within Chorus, as well as a self-service path for purchasing additional seats, data credit and advertising media spend. And lastly, we've made continued investments to our data foundation, further deepening our competitive advantage.\n\nFrom a data coverage standpoint, we've invested in machine learning, data acquisition and enhanced location-based matching technologies, increasing our data coverage. We nearly doubled our non-headquarter company locations to more than 35 million locations. We now list revenue headcount and industry classifications for 100% of companies, including their NAICS and SIC codes. And we also expanded our technographic data set, and now track more than 300 million pairing between companies and the distinct technologies, platforms, programming languages and hardware they use.\n\nZoomInfo can identify technologies across more than 200 technology categories, including a company's CRM, corporate performance management system or even their travel and expense management system. Companies can leverage our technographics data to identify their competitors' customers, allowing sales teams to make their case for displacement and win back business or to gauge the relative sophistication of customers and determine their ideal customer profile. Nearly 90% of our active tech-to-company pairings have been updated within the past three months. Before I wrap up, I wanted to welcome the newest members of the ZoomInfo team, including the recently added leaders in HR, sales, marketing and security and the more than 150 employees across the company that we hired in Q3.\n\nThere remains a huge opportunity ahead of us, and we continue to upgrade our team to support our long-term growth outlook while prudently investing in the business in the short term. In closing, we are the clear platform leader, companies in all industries are looking to drive efficiencies across their go-to-market motion, and we are well-positioned to capitalize on the generational shift as more and more sales teams use data and insights to drive their go-to-market motion. We have an amazing group of customers from enterprise to small businesses that we're helping grow efficiently, and we continue to invest in the platform and the team to drive customer success, a key part of the sustainable long-term growth plan. While the economic outlook remains uncertain, we remain committed to driving improved margin performance.\n\nOur financial model puts us in the elite category of high-growth software companies that are delivering expanded profitability and free cash flow at scale. With that, I'll hand it over to our chief financial officer, Cameron Hyzer.\n\nCameron Hyzer -- Chief Financial Officer\n\nThanks, Henry. Q3 was another quarter of consistent execution and we again delivered results that exceeded our expectations and guidance. We prudently adjusted our expense profile driving better-than-expected profitability in the quarter and showing the inherent leverage in our model. We are pleased to be in a position to again raise our top and bottom-line guidance for the year.\n\nWhile we are more insulated from macro challenges relative to many companies and we benefit from long-term secular trends toward digitization, we are not immune to the macroeconomic environment in the short term. Towards the end of Q3 and as we entered Q4, we saw a greater level of financial scrutiny from buyers, which further elongated sales cycles. All deals, including straight renewals are requiring more effort to reach an outcome, which stretches our sales team and capacity. As reps are spending more time on renewals, we see that their capacity to drive incremental upsells is becoming a limiting factor to growth of existing customers.\n\nAs a result of the more challenging environment, we now expect dollar-based net retention in 2022 to retrace the gains that we were able to achieve in 2021. In short, we are taking a prudent view of the near-term growth expectations for Q4 and 2023 until we see more definitive signs that the economic environment is improving. That said, we are still raising our guidance for the year and are confident in the value proposition that we deliver to our customers. For 2022, we now expect revenue to be in the range of $1.094 billion to $1.096 billion.\n\nWe expect adjusted operating income to be in the range of $442 million to $444 million. At the midpoint, this represents revenue growth of 47% relative to 2021 and adjusted operating income margin of 40%, and we expect to deliver more than $1 per share in unlevered free cash flow in 2022. In Q3, we delivered GAAP revenue of $288 million, up 46% year over year, which implies 7% sequential growth compared to Q2 2022 as adjusted for days in the quarter. Excluding the impact of acquisitions in the first 12 months, we maintained organic revenue growth for the quarter at 42%, consistent with Q2.\n\nAdjusted operating income in Q3 was $118 million, a margin of 41%, the highest level of margin performance in the last 12 months. We continue to place an emphasis on efficiency and profitability we expect to increase adjusted operating margins over time. Turning to the balance sheet and cash flow. We ended the third quarter with $445 million in cash, cash equivalents and short-term investments.\n\nOperating cash flow in Q3 was $86 million, which included approximately $18 million in interest payments. Unlevered free cash flow was $100 million for the quarter or 84% of adjusted operating income. While this was consistent with seasonal patterns, we are adjusting our cash flow expectations in the short term to reflect the potential for more flexibility in payment terms related to a worsening macro environment. With respect to liabilities and future performance obligations, unearned revenue at the end of the quarter was $381 million and remaining performance obligations, or RPO, were $979 million, of which $757 million are expected to be delivered in the next 12 months.\n\nWe believe that calculated both billings, bookings and RPO are imprecise metrics to assess in-period activity in forward momentum. If you are analyzing similar metrics, it is important to remember that the comparative period of Q3 2021 should be adjusted for acquisitions. Because of the inherent noise in those metrics, we focus on days adjusted sequential revenue growth. We delivered 7% days adjusted sequential revenue growth in the third quarter.\n\nWith respect to debt, at the end of Q3, we carried $1.25 billion in gross debt, all of which has fixed or hedged interest rates, with about half of that coming due in 2026 and the remainder coming due in 2029. With continued growth and profitability, we again drove an improvement in our leverage ratios with a net leverage ratio of 1.9 times trailing 12 months adjusted EBITDA and 1.6 times trailing 12 months cash EBITDA, which is defined as consolidated EBITDA in our credit agreements. With that, I will provide our outlook for the fourth quarter and our increased outlook for the full year 2022. For Q4, we expect GAAP revenue in the range of $298 million to $300 million and adjusted operating income in the range of $121 million to $123 million.\n\nNon-GAAP net income is expected to be in the range of $0.21 to $0.22 per share. Our guidance implies year-over-year GAAP revenue growth of 35% at the midpoint and an adjusted operating income margin of 41%. We are providing updated full year 2022 guidance as follows: we expect GAAP revenue in the range of 1.09 to 1.09 -- sorry, $1.094 billion to $1.096 billion, up $10 million from our prior guidance at the midpoint and adjusted operating income in the range of $442 million to $444 million, up from $435 million at the midpoint of our prior guidance. We expect non-GAAP net income in the range of $0.83 to $0.84 per share based on 411 million weighted average diluted shares outstanding, up from $0.79 at the midpoint previously.\n\nFor unlevered free cash flow, we expect to generate between $430 million and $435 million as compared to $442 million at the midpoint of our prior guidance. Our full year guidance implies 47% GAAP revenue growth at the midpoint, and both adjusted operating income margin and unlevered free cash flow margin of approximately 40%. With that, let me turn it over to the operator to open the call for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from DJ Hynes from Canaccord. Your line is open.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nHey, good afternoon, guys. So Cameron, I'll start with you. So you alluded to this in your comments, but we're getting sub-20% calculated billings growth, so 20% CRPO-based bookings, calcs. You mentioned this, but sometimes we can kind of glean false signals from these data points.\n\nI'm curious, in this case, just given kind of the slowdown you're talking about, is that a decent barometer for kind of organic bookings growth? Or is there something we should be aware of that's impacting these metrics in the quarter?\n\nCameron Hyzer -- Chief Financial Officer\n\nAnd certainly, we focus on sequential revenue growth as a better indicator of in-period activity. I think, particularly if you're looking at bookings growth and billings growth for that matter, you need to adjust for the acquired RPO and acquired unearned revenue in Q3 of last year. RPO, as an example, was close to $24 million of acquired -- those acquired in Q3 of 2021, it needs to be adjusted for. And billings similarly, I get a number that's closer to 30% when I adjust for those things overall.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nOK. OK. That's helpful commentary. And then, Henry, maybe as a more strategic follow-up for you.\n\nJust how do you think about kind of the investment strategy in this slower growth environment? I mean, you already have best-in-class margins. Do you use that to your advantage? And do you continue to invest? Or do you think about getting more measured with your spend, maybe investing perhaps a little bit more kind of behind the demand curve?\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nYeah. I think, first, we're going to continue to manage the business from a margin perspective prudently. And as we've said before, as growth slows, we expect margins to increase, and that will continue to be a guiding philosophy in our business. That being said, I think where you will see us invest is to continue to build sales capacity and account management capacity in our customer base.\n\nWe see that as the leverage point to continue to grow the business. And so, that would be the area where we continue to invest.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nOK. Thank you, guys.\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nThank you.\n\nOperator\n\nOne moment for our next question. Our next question comes from Brent Bracelin with Piper Sandler. Your line is open.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nThank you. Good afternoon. Cameron, we'll start with you here. You talked about additional layers of scrutiny on new deals and renewals.\n\nCertainly not surprising to hear that given the current environment. But wondering if you could provide just another layer of detail around the renewal discussions. Is it just taking longer to close the renewals? Are customers looking to downsize the size of a renewal? Or are they looking for more flexible payment terms from a timing perspective? Thanks.\n\nCameron Hyzer -- Chief Financial Officer\n\nYes. So from a renewals perspective, we're actually seeing continued levels of really high gross retention. So we're continuing to see those renewals happen. And we are -- I think, as you might expect, customers are looking for flexibility in other places, including payment terms.\n\nI think, one of the things about our business that's important to remember is that we're really driving value for an individual salesperson. And sometimes the decision-maker might be a little further away from that pain or the value that we're providing. So I think, in a time when people are layering on additional scrutiny on all of their vendors, it takes a little bit more effort for us to make sure that those decision-makers are hearing from the users themselves on how important this is in terms of driving their success and efficiency within the sales and marketing motions. So that incremental effort is, obviously, weighing on our team, a team that's already really efficient and doesn't have slack in the system to go out and necessarily just put in that incremental effort, which then impacts some of the upsell efforts that we're able to go after.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nHelpful color there. And then, Henry, certainly encouraged to see several wins and expands outside of the software tech vertical that you're so strong in. I think, you talked about Ryder, M&T Bank, FactSet, Unilever. What can you do to further accelerate the adoption of ZoomInfo outside of that core software tech vertical?\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nOne of the things that we're seeing in this macroeconomic environment is that there are industries and companies that are much more immune to the macro changes. You see that in insurance, you see it in financial services. You see it in banking and transportation and logistics. And so, we've identified those industries and the companies within those industries, and we're making sure that our sales teams are focusing around those companies during this period of time.\n\nAnd it's mainly a sales capacity opportunity for us to really increase capacity across those additional industries.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nHelpful color. Thank you.\n\nOperator\n\nOne moment for our next question. Our next question comes from Alex Zukin from Wolfe Research.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nHey, guys, thanks for taking the question. I guess, maybe just a few for me. I guess, first, Cameron, can you talk about just some more color on a couple of things, maybe days sales outstanding growth exiting September? Was the renewal commentary? Was this a couple of deals? Is this one very large deals that -- and these renewals that seemly were pushed, are they on track to close this quarter. And then, can you be a little bit more specific on the retracing of the dollar -- of the net expansion rate? Is that to $116 million from the end of last year or $108 million the year before?\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nLet me take the first part. We've already had a number of deals that slipped from Q3 into Q4 that have already closed. Some are sort of larger deals that slipped out of the quarter. And those have already come in.\n\nWe saw a similar trend in Q2 to Q3. And so, that elongation of the cycle we're seeing these deals, again, come to fruition and our gross retention rates have stayed largely the same. And so, those are closing. They're just taking longer to close, and we've already seen a number of them come through.\n\nCameron Hyzer -- Chief Financial Officer\n\nYeah. The way that we think about payment terms, we do see a little bit less kind of upfront annual payments. So it's down about 5% from where we saw last year in terms of annual upfront payments as a percentage of the total deals that we have. We think of the sales outstanding, actually, in terms of these billings outstanding and those are a little bit behind where we were previously.\n\nBut I think, most of our expectation is that a number of customers are focusing more on cash contribution, and we're prudently expecting that could deteriorate additionally. When we think about net retention, we've had improved in 2021, up to 116% from -- previously, we've been in the mid- to high kind of single digits, over 100%. I think that the complexion of retention will be a little bit different than what we saw historically in that kind of mid- to high single digits, over 100%. What we are seeing is that gross retention continues to be really strong, over 90%.\n\nSo we still have customers that are renewing, and we have seen an acceleration in terms of functionality upsells. Where we're seeing more pressure is with respect to the seat expansions and data expansions that we had seen historically. That's the area where we feel our team isn't able to go after as much of the upsell opportunity given the incremental time that they're spending on renewals and deals in general. As a kind of data point, we found that overall, our conversations are -- or effort required to get to an outcome with respect to any with respect to any BO's 20% higher than it used to be.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nUnderstood. And I guess, maybe just a broader macro question then for Henry. If we think about where -- is there any concentration of these issues in a particular vertical, like tech or software? Or is it broad-based? Is it one geography that may have been weaker than others? Like what was the kind of incremental surprise for some of this from what you were previously thinking?\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nI think, in the second quarter, we saw more of this materialize or more of the environment pressure materialize in Europe and in larger deals. I think, in Q3, you saw sort of these cycles elongate really across the board, and so there isn't an area of specific concentration. But then, you saw industries that were largely immune to this. And so, you saw transportation and logistics and media and insurance and financial services stay largely unaffected here.\n\nAnd so, there are areas of opportunity that we are focusing on, focusing our sales teams on to sort of shift away from the areas that are less immune right now.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nPerfect. Thank you, guys.\n\nOperator\n\nOne moment for our next question. Our next question comes from Phil Winslow of Credit Suisse.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nHey, guys. Thanks for taking my question. I just want to follow up on the push deals. I appreciate your comments about geography and industry vertical, but is there anything else that's sort of consistent among them? Are they really for the multiproduct deals, sort of the multiple components of RevOS? Or are these push deals sort of across the board? Any extra color there kind of from a product level would be helpful.\n\nThank you.\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nFor sure. When we're selling a consolidated platform, there is a slightly longer sales cycle as we're displacing numerous point solutions. So if you take a look at sort of those three companies I talked about Ryder, USI, Taylor Corporation, we consolidated throughout those accounts, sales engagement, conversation intelligence, account-based marketing platforms and data providers, and so it takes a bit more time to do those consolidations. That's irrespective of the macro environment.\n\nI think, what we're seeing as part of the macro environment -- of the macro changes here is just sort of broader based additional levels of scrutiny and review. And so, instead of a deal getting done at a director level or a VP level, you see that deal go to a U.S.-based CFO than a global CFO. That not only drags the deal out, but it also drags the time and effort that our account managers are spending per deal. It limits their capacity in that way, more calls, more emails, more executive business reviews.\n\nAnd that's really what we're seeing affect our ability to continue to upsell within the customer base.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nGot it. And just a follow-up on that. Obviously, we saw a deceleration of sales and marketing spend in Q3, obviously, off of sort of elevated organic and inorganic levels. Cameron, wonder if you could give some color on sort of your expectations Q4 and to your point about sort of managing both margin and growth sort of in the context of sales and marketing efficiency and capacity.\n\nCameron Hyzer -- Chief Financial Officer\n\nYeah, so we're continuing to invest into sales and marketing capacity. Obviously, we'd love to continue to see improvements in terms of the efficiency that we're getting out of those kind of those investments. Certainly, there is a natural level of operating leverage that we get from sales and marketing. So in this quarter, sales and marketing as a percentage of revenue is down, but we want to continue to see that drive more and more net new revenues.\n\nWe're continuing to move forward.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nGot it. Thanks.\n\nOperator\n\nOne moment for our next questions. Our next question comes from Mark Murphy with J.P. Morgan.\n\nMark Murphy -- J.P. Morgan -- Analyst\n\nYes. Thank you very much. I'm curious, Henry, when you're out there speaking with customers, I know this just came up recently, but what do you think would calm their nerves or instill more business confident? For instance, do you think that they're waiting to see a Fed pivot or waiting to see lower inflation numbers? Or is there some other kind of macro kind of indicators that you think that they're waiting on?\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nI don't know if -- thanks, Mark. I don't know if they're waiting on a macro indicator more than their -- they are experiencing similar levels of additional scrutiny and executive reviews in their own businesses. And I think, what they're looking for is the change in that environment. What I will tell you is the largest new business deal and the largest expansion deal in our history, those customers are coming to us and saying, listen, I'm going to forego the next three or four headcount from a sales perspective.\n\nAnd I'm going to use those dollars to invest in ZoomInfo and make the entire additional team more productive, more efficient and more effective. We hear that over and over again. And so, I think that thinking around how do I make the rest of my team more efficient? How do I make everybody more efficient is starting to materialize throughout our customer base and throughout our new business prospects. Where the historical view of how do I grow has been, I just need to add another headcount, another five headcount, another 10 headcount.\n\nI think, teams across the world are saying, how do I grow without adding headcount? How do I make all of my team more efficient and more productive? And that's the message that we're trying to land with our customer base as well.\n\nMark Murphy -- J.P. Morgan -- Analyst\n\nOK. And as a quick follow-up, I guess, I'm curious, what is your gut feel on IT budget flush spending activity at year-end here in Q4. Presumably, you think that that will be a bit compressed, but do you see that maybe dragging down the 7% days adjusted figure? Is that something that would -- that would kind of compress lower in Q4 even kind of despite the potential for some of that budget flush activity?\n\nCameron Hyzer -- Chief Financial Officer\n\nMark, I'd say that historically, we don't play as directly in the IT budget as many software companies. I think, we are purchased largely by a sales leader that's looking at his team and saying, how can I make this more effective and efficient. They're effectively creating budget as opposed to dipping into a pool that's set at the beginning of the year. So I don't think we've focused on budget flush as a kind of driver historically and don't necessarily expect that to happen as much this year.\n\nHonestly, I feel like in this environment where people are scrutinizing everything or more seriously than they have before. I do worry that for other folks that need that budget push doesn't exist to the same extent that it has in the past.\n\nMark Murphy -- J.P. Morgan -- Analyst\n\nYes. OK. And then, maybe just in a similar form, do you think that that 7% days adjusted figure is -- I mean, do you think at some point that will be compressing a little bit lower given all the macro headwinds out there?\n\nCameron Hyzer -- Chief Financial Officer\n\nAnd we're, obviously, guiding to a lower level than that. And certainly, our guidance contemplates that there's a wide variety or kind of spectrum of potential outcomes that include a degradation in the overall environment that would drive that.\n\nMark Murphy -- J.P. Morgan -- Analyst\n\nThank you.\n\nOperator\n\nOne moment for our next question. Our next question comes from Elizabeth Porter of Morgan Stanley.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nGreat. Thank you so much. I wanted to follow up on the payment flexibility that you noted. Is that something that's impacting Q3? Or is that something incremental that could happen in Q4? And any sort of way for us to potentially size what the impact could be from payment flexibility?\n\nCameron Hyzer -- Chief Financial Officer\n\nYeah. So certainly, it has impacted the year thus far, including Q3. We've seen that our annual payments as a percentage of the total is down roughly 5% versus where it had been. Historically, we've always seen annual payments to be more than half of the kind of total, but we are seeing customers that are requiring or looking for additional flexibility.\n\nCertainly, that's part of our expectation and guidance that we're -- that it could impact Q4 even more than it has so far this year.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nGot it. And then, as it relates to the go-to-market strategy, you mentioned you focus -- opportunity to focus on some verticals like transportation that weren't as impacted, but anything else that you guys are doing just to adapt the go to market to the current environment, whether it's focusing more on the existing or new or moderating Europe? Any color there would be helpful.\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nYeah. One of the things we've done, we've made a number of personnel moves across the account management organization to make sure that we're building in more capacity for our account management team, so that they're able to drive more upsell and cross-sell into our base. We're leveraging our enablement function to drive the ability of our full account management team to sell additional products like Chorus and Engage, instead of those being owned solely by our overlay teams. And so, we'll get a bigger impact by having a full set of account managers selling these additional products.\n\nThose are two big areas.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nOne moment for our next question. Our next question comes from Brad Zelnick of Deutsche Bank.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nGreat. Thanks very much for taking my questions. Henry, in the end of September, you announced the hiring of a senior vice president of business development. In the press release, you talked about him, \"redefining ZoomInfo's go-to-market process, playbooks and training,\" which was a little surprising to me given your go-to-market has always seemed very unique and special to many of us.\n\nAnd I can understand the need to continuously evolve, but why the need to redefine?\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nI mean, I think, we are shifting from being playing in a $24 billion total addressable market that's focused on global and domestic data to a $100 billion total addressable market that drives a full go-to-market end-to-end revenue operations suite. That includes solutions like conversation intelligence and sales automation and B2B chat and an ad account-based marketing platform on top of our best-in-class data asset. And so, I think, as we shift to having more platform-related conversations, we're going to enable our sellers in a more robust way. Now upfront, we may land most often with sales intelligence, our core sort of data and sales intelligence.\n\nBut as we expand those accounts, our expansion motion is much more focused on selling a holistic platform story. And we see that landing 75% -- more than 75% of our MarketingOS customers are also SalesOS customers. They're buying MarketingOS and SalesOS together so that they can unlock that sales and marketing alignment that is so searched for within companies. But it does require us to tell a broader story.\n\nAnd so, that's what we were getting at with that comment in the press release.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nThat makes a lot of sense, and I appreciate that. Maybe just a follow-up for you, Cameron. There was no mention of win rates changing. So I'll assume and it would be great if you could confirm that they're more or less in line with what they've been historically.\n\nBut as well, when we think about retracing on NRR and you talked about expansion being more limited, is there also any change in gross churn across the different market segments that's worth noting? Thanks.\n\nCameron Hyzer -- Chief Financial Officer\n\nYeah, so I think, deals are taking longer. So we do see the highest levels of demand that we've seen. We're continuing to win those, but it's taking more effort and more longer time. So -- and I have to expand the time frame that you're defining the win rates over in order to --\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nI mean, competitive win rates in terms of win-loss analysis.\n\nCameron Hyzer -- Chief Financial Officer\n\nOh, yeah, from a competitive perspective, we actually see a number of our kind of competitors pulling back on the resources that they are pushing into the market. So I think that we continue to see really strong competitive win rates overall. And then, the second part of your question was?\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nGross churn?\n\nCameron Hyzer -- Chief Financial Officer\n\nGross churn. So gross churn actually hung in very well despite the macroeconomic environment. So when people were using ZoomInfo, they're continuing to renew the gross churn rate or gross retention continues to be well over 90%. So I think that we feel really good about that.\n\nThe change in the NRR aspect has much more to do with those seat-based expansion opportunities that our team is spending more time getting those renewals just based on greater scrutiny that's being applied by our customers, and therefore, is getting less opportunities to go out and really push those upsells that we've seen historically.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nIt's very helpful. Thanks, guys.\n\nOperator\n\nOne moment for our next question. One moment, please. Our next question comes from Koji Ikeda with Bank of America.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys, thanks for taking my questions. I wanted to follow up on Mr. Zelnick's question here and thinking about kind of the sales organization. It sounds like you're shifting some resources over to the account management but also shifting some resources to higher level sales processes.\n\nSo it does sound like it's a pretty big kind of sales reorganization. I mean, is that the right way to think about it? And if so, are all the sales reorgs shifts completed for the growth strategy for the next 18 to 24 months?\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nNo, it's not a major sales team reorganization. It's really just inserting some additional resources into the account management and the client base and the customer base to give some capacity back to the account managers who are spending more time on renewals and more time on upsells and cross-sells than they had historically. It's nowhere near the magnitude of a major sales reorganization.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks, Henry, for that. And then, I just wanted to follow up real quick here on the account management focus. You were talking about more time on renewals.\n\nAnd one question I get from investors a lot is any sort of kind of unused licenses in sales, marketing and recruiting departments. Is it -- is this an area of focus maybe heading into renewal periods? And if so, could you maybe talk about how sales teams are focusing on retaining that kind of customer spend? Thanks, guys.\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nYeah, look, I don't think that's a huge part of what we see. I think, the big thing that we see and that we're seeing is really over the last two quarters, there have been some meaningful macro-related changes. Those first materialized with deal cycle elongation. But ultimately, what those longer sales cycles actually end up causing is a drag on the capacity of our frontline sales and account management team.\n\nDeals taking longer just means more meetings, more reviews with leadership, more calls and emails to drive the same outcome that we were getting historically. And so, while our gross retention has stayed largely the same, our upsell motion has seen those more macro headwinds. Now at the same time, in the quarter, we closed the largest new business deal of our company's history. We closed the largest expansion deal in our company's history.\n\nWe're seeing new business ACV on our MarketingOS platform be close to three times the ACV of our SalesOS platform. We see the majority of our MarketingOS customers also buy SalesOS, so they can unlock that platform story. We're seeing meaningful consolidation uplifts with customers like Ryder and USI and Taylor Corporation, who all consolidated multiple point solutions on to ZoomInfo's RevOS platform. But ultimately, the macroeconomic situation creates sales elongation, sales elongation creates more time spent by our sellers.\n\nAnd ultimately, that's a capacity drag. And so, we're trying to make sure that we're making the right decisions from an organization perspective to make sure that we're relieving as much of that drag as possible.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nThanks, Henry. Thanks so much.\n\nOperator\n\nOne moment for our next question. Our next question comes from Siti Panigrahi from Mizuho.\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nThanks for taking my question. Henry, you talked about the macro pressure and sales elongation. I'm just wondering what sort of trend you are seeing on the pipeline mainly top of the funnel? And also you talk about pressure on seat expansion and data expansion, but what do you expect if macro worsened demand for your newer product, like SalesOS, MarketingOS. Do you expect that to offset any kind of slowdown?\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nI think, first, we're continuing to see really strong demand. In the quarter, we had the highest delivered marketing qualified leads to the sales and account management organization. I think, again, what we're seeing is, even though we're seeing a really strong demand environment, those deals are just taking longer to get to close. MarketingOS is the fastest-growing product -- is the fastest-growing platform, we believe.\n\nWe're really excited about that. Today, it's still a small portion of our business. So while we anticipate that we'll continue to sell more MarketingOS, more data orchestration on RingLead, more Chorus and conversational intelligence, those are still small portions of our overall revenue base.\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nOK. And then, a follow-up on your international expansion opportunity, that's one of your growth driver. What sort of progress you are doing at this point, given all these geopolitical uncertainty in Europe?\n\nCameron Hyzer -- Chief Financial Officer\n\nAnd so, from an international perspective, we still are seeing growth, again, stronger than the accelerated growth relative to the rest of our business. Certainly, particularly in Europe, we've seen headwinds from the geopolitical situation. So we're not growing as quickly as we did in 2021. We're continuing to invest in Europe and our other international venues and customers in order to take advantage of that long-term opportunity itself.\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nOne moment for our next question. Our next question comes from Michael Turrin of Wells Fargo Securities.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nOK. Great. Just on margin, can we go back to just some of the comments around resilience and the margin offsets, Cameron. Are you still confident in the offsets you have there if growth starts to moderate more meaningfully than what we're seeing currently? And then, between op margin and free cash flow conversion, I think, the implied for Q4 and what we're seeing in Q3 is below the target levels.\n\nThere have been some comments just around some of the adjustments you're making in payment terms in other areas. But anything you can add there and around just confident in the ability to return to the targeted levels if that remains the case.\n\nCameron Hyzer -- Chief Financial Officer\n\nSure. So from a margin perspective, I think, we're continuing along the path that we had originally laid out for this growth moderates, we expect the natural operating leverage in the business to continue to push margins up over time. I think that that -- that's the expectation that we continue to have. We're certainly not going to see a step function in margins go up, and I do think where we expect a steady increase in the margins as we realize the operating leverage.\n\nAnd part of that is just natural operating leverage in the sales and marketing side as growth moderates, but we should see sales and marketing as a percentage of revenue go down when that happens. In terms of unlevered free cash flow, we are seeing some flexibility that customers are requiring or asking for in terms of payment schedules. And that certainly in the short term has an impact on the conversion of free cash flow from adjusted operating income. And so, I think, we've -- we're prudently setting expectations that we could see that conversion rate be a little lower than what we would expect in a more normal operating environment.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nThat's helpful. Just a small follow-on to a prior question, if I may. You had a few stats that you laid out around annual payments and maybe that duration is changing from what you've seen in prior periods. Do you have the duration mix or average duration in front of you? And anything you can add just around how it compares currently versus what you've been seeing in prior periods.\n\nI think, it's just helpful for adding context on some of the impacts if you have it? Thank you.\n\nCameron Hyzer -- Chief Financial Officer\n\nYeah. So the duration mix, historically, we've seen well over half of the payments that we received the annual upfront payments. What we've seen is that that has decreased by about 5 percentage points, which, obviously, changes the overall mix. I do think that that percentage of annual payments has the potential to move around over time.\n\nAnd as an example, that decrease is far smaller of a decrease than we saw it and say, Q1 and Q2 of 2020. But certainly, the attitude of customers is that they are looking for more flexibility, as they're dealing with similar pressures to we are in terms of macroeconomic challenges.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nThank you. Excellent.\n\nOperator\n\nOne moment for our next question. Our next question comes from Rishi Jaluria with RBC Capital Markets.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nWonderful. Thanks so much for squeezing me in. First, I just wanted to start with -- you talked about this metric of 30% of ACV coming from advanced functionality and it continues to go in the right direction, but that seems to be only up slightly from Q2 when it was 29%. And if my numbers are right, back at the end of last year, that was 24%.\n\nSo the growth rate there seems to have slowed down, I think, pretty quickly. Maybe can you walk us through what the dynamics going on there might be? And why we shouldn't be too worried about this as a leading indicator and something that could maybe spread to a slowdown at the core. Then I have a very quick follow-up.\n\nCameron Hyzer -- Chief Financial Officer\n\nSure. So I think, we continue to see a strong uptake in the advanced functionality, but most of that is upsold to our existing customers. And while it's less impacted than just data, it is impacted by the capacity issue that we've discussed overall. So I don't see that as being a long-term indicator in terms of the growth of advanced functionality.\n\nCertainly, as it gets off a bigger and bigger bases of percentage, the continued growth of the core intelligence business is also going to continue as well and make those just absolute number of changes, so a little smaller over time as well.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nOK. Got it. That's helpful. And then, just a very quick point.\n\nAnother question had mentioned about licenses that maybe were sitting unused. I want kind of flip that. Is there any worry heading into more uncertainty in the macro environment that we could see outright license sharing? Or are there measures that you take to limit or prevent that from happening? Thanks.\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nYeah, there are all sorts of measures and technical implementations that we put in to avoid license sharing. And we've done that for a long time.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nGot it. Thank you so much.\n\nOperator\n\nOne moment for our next question. And our next question comes from Taylor McGinnis with UBS.\n\nTaylor McGinnis -- UBS -- Analyst\n\nHi. Yeah, thanks. Thanks so much for taking my question. Can you comment on what you're seeing with new logo activity and like the size of average lands? And how much of the lighter outlook was attributed to softness here? And I guess, just as a second related question, with expansion rates coming down, are you assuming more growth needs to come from new business than recent trends? And does that impact at all your comfort with some of the out-year rev targets that you guys had in the coming years?\n\nCameron Hyzer -- Chief Financial Officer\n\nSo we continue to see strength on the new business side. As we are able to attach more of the advanced functionality. And as we're seeing some larger customers, we've actually seen ASP go up in Q3 and continue to see strong new business activity. So I would say that we're continuing to, obviously, raise our expectations.\n\nBut new business continues to do well, much better, I think, relative to the historical trend, whereas the capacity on the AM side is a short-term impact that we see from the macroeconomic challenges. I think, overall, we do expect that that macroeconomic challenge, we don't know how long it's going to last, but I would expect that those retention rates would go back up, as the situation for buyers stabilizes over time.\n\nTaylor McGinnis -- UBS -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOne moment for our next question. Our next question is from Terry Tillman with Truist Securities.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nYeah, thanks for putting me in here. I know you've had a lot of questions and multipart questions. I guess, maybe, Henry, a big picture question for me is just related to the theme of vendor consolidation, it does seem like that's probably going to pick up steam as the macro continues to be weak, if not worsen. So my big picture question relates to -- I mean, there's a lot of $100 million-plus sales engagement and CI tool vendors.\n\nWhat are you seeing right now? What do you think the tipping point is for you all to potentially be able to win that vendor consolidation opportunity? Is that something that you think kind of plays more out into '23 under a punk macro? Or just a little bit more on a tipping point on just more broad-based vendor consolidation? Thank you.\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nLook, I think that we're in the early innings of people really thinking about vendor consolidation. I think, the vendor the consolidation stories that we've outlined here around the platform, they're not macro-driven. They're just good business-driven. And so, I think, as the macro pushes or the macro environment continues, companies will take this idea of consolidating to a strategic vendor much more seriously, and we'll gain a lot of mind share as that happens.\n\nBut today, I think, the wins that you're seeing and the wins that we're really proud of, we would have achieved whether there was a macro uncertainty or not. And so, we'd expect that to accelerate, especially as we continue to enable our sellers around the top tracks and the ways to position value around a full consolidation.\n\nOperator\n\nI would now like to turn it over to Henry for closing remarks.\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nThank you, everybody, for your time tonight. We have an active IR calendar coming up, and we look forward to speaking with everyone and seeing you all over the course of the next several weeks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJerry Sisitsky -- Investor Relations\n\nHenry Schuck -- Chief Executive Officer and Founder\n\nCameron Hyzer -- Chief Financial Officer\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nMark Murphy -- J.P. Morgan -- Analyst\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nTaylor McGinnis -- UBS -- Analyst\n\nTerry Tillman -- Truist Securities -- Analyst\n\nMore ZI analysis\n\nAll earnings call transcripts"
}