{
  "companyName": "DocuSign",
  "companyTicker": "DOCU",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/08/docusign-docu-q2-2023-earnings-call-transcript/",
  "content": "DocuSign (DOCU -0.59%)\nQ2 2023 Earnings Call\nSep 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen. Thank you for joining DocuSign's second quarter fiscal year 2023 earnings conference call. [Operator instructions] As a reminder, this call is being recorded and will be available for replay from the Investor Relations section of the website following the call. [Operator instructions] I will now pass the call over to Heather Harwood, head of investor relations.\n\nPlease go ahead.\n\nHeather Harwood -- Head of Investor Relations\n\nThank you, operator. Good afternoon, and welcome to the DocuSign Q2 2023 earnings call. I'm Heather Harwood, DocuSign's head of investor relations. Joining me on the call today are DocuSign's interim CEO, Maggie Wilderotter; and our CFO, Cynthia Gaylor.\n\nThe press release announcing our second quarter results was issued earlier today and is posted on our Investor Relations website. Now let me remind everyone that some of our statements on today's call are forward-looking. We believe our assumptions and expectations related to these forward-looking statements are reasonable, but they are subject to known and unknown risks and uncertainties that may cause our actual results or performance to be materially different. In particular, our expectations regarding the pace of digital transformation and factors affecting customer demand are based on our best estimates at this time and are therefore subject to change.\n\nPlease read and consider the risk factors in our filings with the SEC, together with the content of this call. Any forward-looking statements are based on our assumptions and expectations to date, and except as required by law, we assume no obligation to update these statements in light of future events or new information. During this call, we will present GAAP and non-GAAP financial measures. In addition, we provide non-GAAP weighted average share count and information regarding free cash flows and billings.\n\nThese non-GAAP measures are not intended to be considered in isolation from, a substitute for or superior to our GAAP results. We encourage you to consider all measures when analyzing our performance. For information regarding our non-GAAP financial information, the most directly comparable GAAP measures and a quantitative reconciliation of those figures, please refer to today's earnings press release which can be found on our website at investor.docusign.com. I would now like to turn the call over to Maggie Wilderotter.\n\nMaggie?\n\nMaggie Wilderotter -- Interim Chief Executive Officer\n\nThanks very much, Heather. And good afternoon, everyone, and thank you for joining us today. First, let me introduce myself. I have been on the DocuSign board for over five years and board chair for the last few years.\n\nIn addition to my board service here at DocuSign, I also sit on several other public and private boards. I've had the privilege to serve on 51 corporate boards in my career, 36 public and 15 private, starting at age 28 when I first joined a corporate board. I also have 18 years of CEO operating experience at private and public companies and most recently was CEO of a Fortune 500, Frontier Communications, for 12 years, retiring five years ago. I have had the privilege in my career to hire and lead great teams, to find clear strategies for success, driving results through clarity of deliverables and accountability.\n\nAnd I've also done so with a maniacal focus on serving customers, both internal and external. I am taking the same approach in my interim role as CEO of DocuSign. Since joining as CEO, I prioritize connecting with customers and employees around the globe through frequent town halls, office visits, virtual connections and in-person meetings. This broad focus on listening, learning and interacting has enabled me to move quickly to set a new agenda for success.\n\nWe entered Q3 with a clear set of vital few deliverables for our people initiatives, product road map and our focus on improving sustainable and profitable growth at scale. Six of our eight executive leaders joined during Q2 and are seasoned scale players. They joined Cynthia Gaylor, our CFO, that you're going to hear from after me; and also Shanti Iyer, our CIO, on the executive leadership team. Our new executive leadership team and I have worked together over the past few weeks to clarify a clear strategic focus and define what is required from all employees for DocuSign to be successful.\n\nLet me start with our strategy. DocuSign is the leader in providing end-to-end digital agreements on a fully integrated platform. This starts with delivering simple, intuitive, integrated and trusted customer and partner experiences that remove friction from all steps in creating, using and managing digital agreements. To support this strategy, we have upgraded talent; launched retention initiatives to include a new employee training program that will commence this month, teaching our teams how to operate with excellence.\n\nInhi Suh, our new president of product, has already put in place a clear product road map, with mapped-out releases starting next month. Steve Shute, our new president of go-to-market, has revamped our selling motion and performance expectations for the small, medium business and enterprise segments. Our marketing team is delivering new collateral, messaging and tools for Steve's team, as well as a simplified digital motion for consumers and one-time users. Finally, DocuSign has also added two additional seasoned scale leaders.\n\nI'm pleased that Jennifer Christie is our new chief human resources officer; and veteran, Jim Shaughnessy, is our new general counsel. I am privileged to lead such a terrific group of executives who have all hit the ground running by working together with a single focus, set the company on a path for continuous performance improvements in Q3 and Q4 and beyond. I'm optimistic about the power of our brand, our value proposition for customers and partners and the renewed results orientation being embraced by our employee base. Finally, the search for our next CEO is a top board priority.\n\nAll of our independent directors have been actively interviewing great candidates, and we are close to making a decision. A terrific candidate pool participating in this process has reinforced the strength of our brand and the shared belief that DocuSign has a tremendous future growth opportunity. I look forward to letting you know who the next CEO will be. With this preface, let me turn to some other Q2 results highlights.\n\nAs you have seen in our earnings release, Q2 revenue was $622 million, representing a 22% year-over-year increase. We added 44,000 new customers during the quarter, again a 22% increase year over year, which brings our total global paying customer count to 1.28 million. We delivered an 18% operating margin in Q2 as well. For the second half of this fiscal year, our goal is to drive operating expense reductions in order to meet the current operating margin guidance range of 16% to 18% that we had previously communicated to you.\n\nWe are reviewing all categories of expenses and will adjust our spending accordingly. These expected expense reduction initiatives will create capacity for the right investments for our expected scale growth. For example, our IT and internal systems development teams are focused on key automation and software system upgrades, including our planned ERP system cutover this quarter. These enhanced capabilities will enable us to eliminate current manual processes resulting in lower operational costs in the back half of this fiscal year, and it will also improve our customer and partner experiences.\n\nI am excited to share that we closed a number of large enterprise deals during the quarter that include both Microsoft and Goldman Sachs. In addition, our focus on partner expansion includes a new integration with Stripe, to enable users of both product sets to view DocuSign agreements and Stripe payments side-by-side. Stripe customers can also create new DocuSign agreements directly from Stripe dashboards. This is another strong example of taking friction out of the customer agreement transactions.\n\nOver the past few months, with increasing interest rates and inflation on a macroeconomic level, we also have started to see some softness in certain verticals, like real estate and financial services. But despite these headwinds, our business model benefits from a well-diversified customer base across industries, geographies and segments. Our products help all of our customers, from large to small, improve their productivity, be more efficient and improve their time-to-value creation. In closing, I am honored to continue to lead the DocuSign team until a successor is in place.\n\nDuring this time, we remain committed to stay focused on our vital few priorities, driving profitable growth at scale and delivering further enhancements to the digital agreement platform to delight our customers. We have a $50 billion global market opportunity with an industry-leading product and market share position. We will use this position to aggressively expand our capabilities through wise investments, focus and continuous improvement in our performance. DocuSign cannot be successful without strong shareholder support.\n\nSo let me end my remarks here with thanking all of you for your continued support of our company. We know our results over the previous three quarters did not meet expectations. We got the message. That change was needed, and I hope you can see that we are fully committed to build upon our current momentum, to deliver for all of our stakeholders.\n\nI will now hand it over to our CFO, Cynthia Gaylor, who will walk you through our Q2 financial results and outlook. Cynthia?\n\nCynthia Gaylor -- Chief Financial Officer\n\nGreat. Thanks, Maggie, and good afternoon, everyone. We delivered a solid Q2 and continued to make progress against our top priorities as we drive the business forward. We landed ahead of our expectations for last quarter on multiple fronts.\n\nImportantly, we further expanded our customer installed base during the quarter and continued to execute toward our long-term goals, successfully balancing growth with improved profitability. Delivering our customers an unmatched and innovative value proposition will remain our top priority. Our mission is also uniquely aligned with today's macro backdrop, delighting our customers with high ROI products that are easy to use, efficient and both cost-saving and cost-effective, all while helping the environment. Let me review some key highlights within our Q2 results.\n\nTotal revenue increased 22% year over year to $622 million, and subscription revenue grew 23% year over year to $605 million. The strengthening of the U.S. dollar during the quarter resulted in a couple-of-point headwind to total revenue growth, though it was not a meaningful factor in the quarter. Our international revenue grew at 35% year over year to reach $154 million in the second quarter and was 25% of our total revenue.\n\nSecond quarter billings rose 9% year over year to $648 million, with a four-quarter rolling average growth of 19%. Customer growth remained strong as we added approximately 44,000 new customers during the quarter, bringing our total installed base to 1.28 million customers worldwide at the end of Q2, a 22% increase compared to a year ago. This includes approximately 10,000 additional direct customers, to reach a total direct customer base of 191,000 and 29% year-over-year increase. We saw a 39% year-over-year increase in customers with an annualized contract value greater than $300,000, reaching a total of 992 customers.\n\nHowever, while we successfully delivered strong results related to key metrics, we too are seeing more measured buying patterns noted by our peers, coupled with generally longer conversion cycles within some areas of our business. This is more pronounced in real estate and within those verticals exposed to the lending market. However, with our diversified customer base, we saw relative strengthening in technology, food and beverage and manufacturing verticals. It's also notable that SMB continues to show signs of durability within our direct business, with higher relative growth.\n\nEnhancing our go-to-market effectiveness also remains a key priority to drive top line growth and ensure solid profitability. While progress in our go-to-market activities will take some time to meaningfully resonate in our quarterly results, we have taken a number of tangible steps to drive future success, including rounding out the leadership team, stabilizing the sales force, aligning sales goals to current expectations and driving accountability throughout the field. Our team is focused on ensuring that customers understand the many ways DocuSign positions them for success over time. Furthermore, innovation across our product portfolio continues to drive future growth and remains core to our differentiation in the marketplace.\n\nTo share one example from our enterprise business, we recently expanded our relationship with one of Latin America's leading pulp and paper companies. As an existing eSignature customer, this client expanded its DocuSign footprint by purchasing CLM to digitize their forest department's agreement process. CLM therefore enabled our client to automate various stages of the agreement process, including contract drafting and automatic task delegation, which has since saved hours of valuable time and manual work, while mitigating human error. We initially began our relationship with fewer than 50 CLM users.\n\nToday, this customer has leveled up to 500 users on our platform. This is one of many examples which underscores our successful strategy of landing and expanding customers who then grow with us over time in new use cases with new products or features to address their evolving business needs. Another example in core eSignature is a long-term DocuSign customer, a notable clean energy fintech company, which expanded its use of DocuSign to address an important gap in their eSignature experience. Our team identified this customer's need for increased optimizations in their eSignature journey as many of their customers signed via mobile.\n\nWe leveraged our unique product and future expansions to ensure that signers now have the appropriate functionality and security through their mobile device. This includes our responsive signing and Smart Sections viewing features, with added security through SMS and ID verification. Now turning back to our Q2 results. We achieved 110% dollar net retention for the quarter, which was slightly below the low end of our 112% to 119% historic range.\n\nAs we noted last quarter, our customer base continues to expand, however at a lower rate relative to the peak expansion rates. Given these moderating expansion rates, coupled with the macro environment we're seeing, we expect our dollar net retention rate for Q3 to remain below the historic range. Total non-GAAP gross margin for the quarter was 82%, in line with last year, while subscription gross margin was 85%, also in line with last year. Q2 non-GAAP operating profit reached $112 million, compared with $100 million last year.\n\nNon-GAAP operating margin was 18% compared to 19% last year. Non-GAAP net income for Q2 was $90 million, compared with $98 million in the second quarter of last year. As discussed last quarter, we introduced a non-GAAP tax rate in our non-GAAP net income calculation as we reach consistent non-GAAP profits for the prior three years. We're using a non-GAAP tax rate of 20% for fiscal '23.\n\nQ2 non-GAAP EPS is $0.44, which includes the impact of the 20% non-GAAP tax rate. We ended the quarter with 8,061 employees, a 22% increase compared to last year. We have seen attrition rates moderate with new leaders now on board as teams settle in with clearly defined priorities and against the backdrop of a changing macro environment. We are encouraged by the improvements we're seeing.\n\nWe exited Q2 with over $1.1 billion in cash, cash equivalents, restricted cash and investments. Operating cash flow in the second quarter was $121 million or 19% margin. This compares with $178 million or a 35% margin for the same quarter a year ago. Free cash flow came in at $105 million or a 17% margin in the quarter, compared to $162 million or 32% in the prior year.\n\nWe are in the process of implementing a new ERP platform, which will enable improved management of our business as we continue to scale. Looking ahead, Q3 operating cash flow and free cash flow could be impacted by the timing of collections related to our expected ERP implementation, as well as by one-time lease modification expenses. Now turning to our share repurchase program announced earlier this year. We repurchased 400,000 shares during the second quarter for approximately $25 million.\n\nAs of the end of Q2, we had approximately $175 million in remaining buyback capacity, which demonstrates our confidence in the strong fundamentals of our business and in the opportunities which lie ahead. We remain committed to opportunistically returning capital to our shareholders. Taking a step back, we have operating leverage in our business and are evaluating our investments against the vital few priorities we've identified, with an eye toward ensuring sustainable growth at scale. We are committed to achieving our long-term target margins of 20% to 25%.\n\nTo that end, Maggie has charged our leaders with taking a careful look to ensure our teams are aligned to our vital few priorities and to identify areas where our business can be further streamlined and optimized. For example, we are reassessing our overall expense base, which includes a careful review of our people, programs, consultants and T&E spend. Along these lines, we're also taking a measured approach to hiring. And as we progress toward a more scaled model with improved operating efficiencies, investments will continue to be directed toward our systems and tools, specifically ERP as a foundational business system.\n\nFurther, we're evaluating our global real estate portfolio to optimize for team collaboration and our physical footprint. This rigor and discipline will ensure we operate from a position of strength and fiscal flexibility. With that, let me now turn to guidance. For the third quarter and fiscal year '23, we anticipate total revenue of $624 million to $628 million in Q3 or growth of 14% to 15% year over year and $2.47 billion to $2.482 billion for fiscal '23 or growth of 17% to 18% year over year.\n\nOf this, we expect subscription revenue of $609 million to $613 million in Q3 or growth of 15% to 16% year over year and $2.405 billion to $2.417 billion for fiscal '23 or growth of 18% to 19% year over year. For billings, we expect $584 million to $594 million in Q3 or growth of 3% to 5% year over year and $2.550 billion to $2.570 billion for fiscal '23 or growth of 8% to 9% year over year. We expect non-GAAP gross margin to be 79% to 81% for both Q3 and fiscal '23. We expect non-GAAP operating margin at 16% to 18% for Q3 and fiscal '23.\n\nWe expect to see a de minimis amount of interest and other income. And as noted, last quarter, the fiscal year 2023 non-GAAP tax rate remained at 20%. We expect a non-GAAP fully diluted weighted average shares outstanding of 205 million to 210 million for both Q3 and fiscal '23. In closing, we delivered a solid Q2 amid a time of transition and despite continued macro headwinds.\n\nOur focus as a leadership team remains steadfast in serving our customers, employees and investors as we continue to innovate, build and position DocuSign for the unmatched opportunity which the future holds. This quarter has further demonstrated that digital transformation continues to be our customers' priority and that DocuSign enables the world to nimbly adapt to today's dynamic environment as once customers move from pen and paper, they don't go back. We will maintain our disciplined and focused investment approach across our top priorities as we further operationalize the business at scale. We are committed to achieving our long-term operating margin targets while driving sustainable growth with profitability as we navigate the current environment.\n\nThe progress we've made thus far is gaining traction driven by our team's commitment to delivering value for our customers and results for our stakeholders. Thanks again for joining us today. With that, operator, we can now open up the call for questions.\n\nOperator\n\n[Operator instructions] And our first question comes from the line of Josh Baer with Morgan Stanley. Please proceed with your question.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nGreat. Thanks for the question, and congrats on outperformance in the quarter. I wanted to dig in on some of the categories of expenses that you're reviewing to make capacity for those needed investments. I mean it seems very broad-based sort of listing people and programs and real estate.\n\nI was hoping you could dig into some of the specific areas of spend that will contribute the most to operating efficiency.\n\nMaggie Wilderotter -- Interim Chief Executive Officer\n\nHi. This is Maggie. I just wanted to say that we are in the process right now as a leadership team of identifying what goes underneath each of those broad categories that Cynthia mentioned. So I don't have a list in front of me that I can say, oh, this, we're going to do this, this, this and this.\n\nBut I will reinforce that there are no expense categories in the company that will not be reviewed for where we can get efficiencies and effectiveness for the business.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nOK. Got it. That makes sense. And then, Maggie, I wanted to ask on the new messaging from a marketing perspective, if you could sort of expand on some of those changes from that marketing message.\n\nAnd that's it for me. Thanks.\n\nMaggie Wilderotter -- Interim Chief Executive Officer\n\nYeah. So I think one of the things that I'm most excited about and so is the team is to look at the creation of a digital agreement platform versus a focus on a cloud environment. When we think about cloud, cloud is a repository for a lot of different things that don't necessarily integrate or talk to each other. And what we want is the end-to-end digital agreement to be fully integrated with each of the different capabilities of that agreement, as well as with eSignature.\n\nSo for example, document generation, along with forms or identity or notary or monitor, should all be integrated with eSignature. And that also includes our CLM product sets, too. So I think when you think about what we've been doing, the elegance of coming to this new way of thinking about the agreement creates an environment where customers don't have to go anywhere else for pieces of the agreement platform. They can get it all from DocuSign.\n\nAnd having that end-to-end approach to what we're doing is something that we're very excited about, and the customers we've talked to about it are excited about it as well.\n\nCynthia Gaylor -- Chief Financial Officer\n\nYeah. And I might just elaborate on that a little bit more. I think it's really about amplifying the key messages that make DocuSign special and really serve our customers. So when you think about our innovation and differentiation, right, we are positioned with customers across the agreement platform, but making sure we really stitch together all the different pieces of the functionality to make it really frictionless for the customer.\n\nWe also, in today's environment, with some of the macro headwinds, are making sure that customers really understand the value proposition, right? We have a very high NPS score with customers in terms of delighting them. It's easy to use. It reduces friction with their customers, which is why they love using DocuSign. So I think really helping customers understand just the efficiency and effectiveness in the belt-tightening environment that we're in, our marketing team is really focused on amplifying that because we have very much a land-and-expand model where we start small.\n\nWe serve some of the smallest customers around the globe and some of the largest, but many of them, regardless of their size, they start small with us and land-and-expand. And so the value is really there, but I think also just really sharpening our focus in marketing around that, so customers understand that, out of the gate, is one of those key areas.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nOur next question comes from the line of Tyler Radke with Citi. Please proceed with your question.\n\nTyler Radke -- Citi -- Analyst\n\nHi. Thanks for taking the question. I wanted to ask you about what you're seeing with customer renewals. There's been some chatter about some downsells just given economic activity is under pressure and customers are optimizing investments.\n\nI guess two questions related to that. First, do you feel like you've processed most of kind of these renewals at a normalized rate? And secondly, how much of that, if you are -- to the extent you are seeing some compression on the renewals, is related to macro factors versus potentially competitive or other factors? Thank you.\n\nCynthia Gaylor -- Chief Financial Officer\n\nYeah. I'll take that one. Thank you for the question. So renewals in kind of our book of business is a very important part of the business.\n\nAnd as you know, we've doubled the size of the business in a very short period of time, going from $1 billion in revenue, to over $2 billion. So that renewal piece of the book of business is very important in terms of continuing to scale it, but also, it provides a lot of predictability to our business model because we have a large customer base who's using the product. We know once people get on the platform, they're not going back to pen and paper. And because of the land-and-expand, we really have a lot of operating leverage in that model.\n\nThat being said, and we talked about this a little bit in the last few quarters, we are seeing smaller expansions, right? So during the peak of the pandemic, the expansions, we had customers who bought conservatively because they didn't know how long the pandemic would last. And then they had to expand because things lasted longer than they thought. But also, once they started using the product, they were using it in many, many use cases. I think as we got to scale, to the place we are now, we're seeing smaller upsells and expansions as customers continued to consume what they bought, and the timing of those renewals also impacts kind of those expansion rates.\n\nAnd you see that a little bit in our dollar net retention metric, that's kind of related to that expansion and renewal base. But we still see a very strong base of renewals, expansions within the renewal base. And of course, dollar net retention also reflects any downsized renewals or downsides of churn, but those are -- it's more of a backward-looking metric than a forward-looking metric. So I tried to be comprehensive in that answer.\n\nHopefully, that was helpful.\n\nMaggie Wilderotter -- Interim Chief Executive Officer\n\nYeah. The only thing I would add to that, Tyler, is over the last quarter, we have not really had the leadership in the customer success organization because we had a fair amount of turnover. And when we think about customer success at DocuSign, those are our teams that will work with existing customers to expand into use cases in other areas of the business. And so we're really excited.\n\nWe have a brand-new chief customer officer, who's got great operating experience at scale, who has joined the company and just started this week. And one of the priorities we're doing on the go-forward basis is really getting that muscle back into the upgrade land-and-expand motion that we've enjoyed in the past and have really helped us take a small deal that gets done with a customer and expand it throughout an organization. So you're going to see a lot more focus on that in the second half of the year.\n\nTyler Radke -- Citi -- Analyst\n\nThat's helpful. I guess would it be fair to say that you think the worst from an attrition perspective, in terms of employee attrition, is behind you? And consequently, how should we think about that layering on of incremental sales capacity and customer support capacity to drive expansion rates over time? In other words, when would you expect that net retention rate to resume toward historical levels? Thank you.\n\nMaggie Wilderotter -- Interim Chief Executive Officer\n\nWell, I can say that, at this point, we have definitely stabilized the attrition, again by bringing in great scale leaders and having everybody focus on their people as a No. 1 priority in our vital few deliverables. We want to make sure our people are well taken care of, that they have the tools and capabilities to do their jobs, that they understand what's expected of them from an accountability perspective, and we're going to measure that success and reward that success. And I truly do believe too, that we filled in a lot of the blanks over these last several months of key management positions that were left open, especially in the sales and go-to-market, which was necessary for us to fill in order to get the coverage back out with the customer base that we needed.\n\nSo I'm cautiously optimistic. I also think that there has been some tightening in terms of job availability, especially in the United States and over in certain areas of Europe. That has also enabled us to have a little bit more stability with the current workforce that we have.\n\nTyler Radke -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Rishi Jaluria with RBC. Please proceed with your question.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nWonderful. Thanks so much for taking my question. Maybe I just wanted to start out with, I mean, you talked a lot about some of the cost-cutting measures and being really disciplined. While obviously, I applaud focusing on not wasting money, you're not a super-high cash burner, and it feels like a higher priority might be sales execution, finding new use cases, expanding internationally.\n\nSo why spend so much management time and attention right now, identifying areas for cost savings, scrutinizing cost savings and for that matter, upgrading, migrating your ERP system as well, when realistically, it feels like, from my perspective, it should be on sales execution and that kind of stuff and then maybe identify cost savings later? Maybe some color there would be helpful. And then I have a follow-up.\n\nCynthia Gaylor -- Chief Financial Officer\n\nYeah. Rishi, thanks for the question. It's Cynthia here. So a couple of things.\n\nI think we've always talked about prioritizing growth, and we'll invest for growth. And so I think part of the initiative right now is making sure that the spend across the company is productive spend and that we're freeing up resources for growth. And so part of that is we scaled really quickly in a very short period of time, and there were a lot of things we didn't operationalize efficiently. So I think part of the exercise, it's partly expense, but it's also streamlining processes, managing complexity at scale, those types of things.\n\nWhen we look at the go-to-market specifically, there is a focus on the vital few, which begins and ends with selling software and making our customers successful. There is a stabilization of the team there, providing accountability within the field and importantly, aligning goals with the current outlook at the company. So that is very much front and center because at the end of the day, we're a subscription software company. We're growing at scale.\n\nWe want to continue to grow at scale, and we've had some speed bumps, right, coming out of the pandemic. So the cost piece of it is really to free up investment, to focus on top line growth, but it's not top line growth at any cost. We're also very focused on profitability. And as you noted, we have strong cash flow.\n\nWe have a strong balance sheet. And so we would expect that to continue, and it's something we're monitoring very closely.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nAll right. Got it. That's really helpful. And then just as I think about the guidance, right, you're talking about mid-single-digit billings in the near term, and I guess, turnarounds take time.\n\nSo maybe help us understand, looking beyond this year, and I'm not asking for guidance for next year, but what sort of underlying growth rates would you be pleased with or happy with? And what are kind of the steps to get from that mid-single-digit level, which if we're looking at billings is the best leading indicator, to a healthier kind of more robust growth rate? Thanks.\n\nCynthia Gaylor -- Chief Financial Officer\n\nYeah. Thanks, Rishi. So I think we were really pleased to be able to raise the full year guide here in -- for the year, at this point in the year, and maintain our margin. And so that's really based on the progress that we've made to date and what we're seeing in the business.\n\nThat being said, there's still macro headwinds that are really on a global basis. And our visibility into the business is still not what we would like it to be. So that's reflected in the guide. But again, we were really pleased to be able to raise the guide for the full year at this point.\n\nI think when we look into next year, there's a couple of things that we're looking at. One is we are encouraged by the progress. I think part of it is next year's growth will be a function of several factors. Part of it is stabilizing the business and the go-to-market motion, some of the things that Maggie was talking about, and positioning ourselves for further growth headed into fiscal '24.\n\nPart of that is based on where we land for the year. Part of it will be the AEs and the reps that we brought on board. They need time to ramp, and it's a multi-quarter process. So that's in process.\n\nAnd that will be a key factor heading into fiscal '24. And then as well, the macro environment will be important there. So I think when we look into next year, there's kind of the importance of where we land. There's the importance of how we set up the capacity model across the field going into next year and really operationalize some of the things that got ahead of us during the peaks of the pandemic and operationalizing those at scale.\n\nMaggie Wilderotter -- Interim Chief Executive Officer\n\nYeah. The only thing I would add, Rishi, this is Maggie, is we are also investing and shifting investments into the product road map and the product portfolio, not only to get the entire digital agreement platform integrated, but to add enhancements that improve our customer and partner experiences and simplify that. And we're also looking at the modernization of our product architecture, so we can make changes more quickly and continue to bring out new enhancements with different types of use cases as an example. And we really do believe, by driving a product portfolio that can really expand into companies in a very specific way, where you have use cases for purchasing versus use cases for human resources, etc., we can establish a better alignment with our customers in terms of what they're trying to do with digital transformation.\n\nSo I really do believe that with the ramp that we're doing with our sales force, especially with a lot of the new people that we've hired, in addition to bringing in people still into the sales organization that are seasoned, scaled, the sales executives, that combination will definitely set us up, that by the end of the year, we'll have a better flywheel of anticipated growth that we'll see next year, year over year.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nAll right. Wonderful. Thank you so much.\n\nOperator\n\nOur next question comes from the line of Brad Sills with Bank of America. Please proceed with your question.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks for taking my questions. I think you alluded to, a little to this, on the previous question, but curious now that you're several quarters into this effort to pivot back to expansion deals, it sounds like you're seeing some progress already. Are there any use cases or areas where you've seen some early signs of improvement? I know it's still a work in progress, but any areas that you've seen some progress so far? And are there others that we should expect to improve from here?\n\nCynthia Gaylor -- Chief Financial Officer\n\nYeah. So we continue to see progress in expansion across the business. In my prepared remarks, I noted two customers. We also have seen some long-term customers even in the financial services segment, which has seen more headwinds in various pockets.\n\nBut we had a large money manager this last quarter who conservatively bought during the pandemic. They've been a long-term DocuSign customer, but they're experiencing faster digitization and they're further expanding their eSignature footprint with us during the second quarter. So not only do they see heightened demand across their internal business lines, but they have a very trusted relationship with us with their customers in terms of our branded products for their end customers. So they're really using DocuSign to strengthen their own relationships with their end customers.\n\nAnd I think that would be a really great example of strong expansion rates, long-term customer, land-and-expand, a very notable global money manager doing a lot with us in that core eSignature piece. I think there's -- in the -- on CLM, we've also seen quite a bit. You may have seen we announced the Slack integration with CLM earlier this week which, again, is really about embedding DocuSign in workflows that already exist, and it's a key innovative differentiator for us in terms of the AI and analytics around those types of products within workflows that companies are using. So I think that's another really big opportunity as we continue on the product road map and to innovate where customers will see a lot of value and will see further room for expansion.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nGreat to hear. Thanks, Cynthia. And then one more, if I may, just on the guidance here for billings. It assumes, it looks like, a 9% sequential decline.\n\nYou don't typically see that decline in billings quarter on quarter in Q3. You did last year, but that was also a quarter in which you were experiencing some of these expansion deal softness. So just curious, it sounds like execution is improving here a bit as some of these changes that you put forth are having effect. The macro is moving away a little bit from you.\n\nWhat's assumed in the guidance for Q3 in billings? Thank you.\n\nCynthia Gaylor -- Chief Financial Officer\n\nYeah. Thank you for the question. So as you know, billings, there's puts and takes in billings, timing of deals, billings can fluctuate quarter to quarter around timing of deals; start dates, when an expansion or add-on happens relative to the timing of the overall contract. A customer who may have early renewals also impacts that.\n\nI would say Q2 was certainly a little bit stronger than we were anticipating. And so I would say Q2 was probably stronger given some of those factors, like timing of deals and start dates. And similarly, I think Q3 just seasonally is not as strong a quarter for us. So I think that's embedded.\n\nBut again, we were really pleased to be able to raise the full year guide range across that metric, but recognize that Q2 to Q3, that dynamic we have seen in the last few years and Q3 tends to not be as strong. The only other thing I would note is we did continue to see softness in linearity within Q2, and so as we exited Q2 and entered into Q3, and so that certainly is embedded in the guide just given some of the softness related to macro and then as our field teams ramp.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nThat's really helpful. Thanks, Cynthia.\n\nOperator\n\nOur next question comes from the line of Kirk Materne with Evercore ISI. Please proceed with your question.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nYeah. Thanks. Maybe two, one for Cynthia, one for Maggie. Cynthia, just on the real estate and banking side, perhaps the areas where you're seeing some more pressure, which makes sense given the macro environment, do you feel like you have better visibility into the companies that perhaps either over-provisioned or -- during COVID, so that you guys have a better sense of where they're at in terms of the usage patterns today versus maybe six months ago, when you were sort of just lapping them, it was more uncertain.\n\nI was trying to get a sense on just sort of your visibility into that particular part of the business. And then, Maggie, Steve obviously started, I think, four, five months ago. I was just kind of curious what he's been doing from a sort of sales organization perspective to try to help get greater cross-selling going in terms of selling the full agreement platform. I think it's something that sort of got -- people got sidetracked because there's so much demand for eSignature in COVID.\n\nSo I was kind of curious if there's anything you're doing in particular around selling the fuller suite from a sales perspective. Thanks.\n\nCynthia Gaylor -- Chief Financial Officer\n\nSure, sure. So I think on the consumption patterns and cohorts, we do very detailed analysis on the cohorts and how they're expanding, how they're consuming. With our new success officer, I think there will be even more focus on some of those metrics at scale. I would say we're still in a period where we don't have precise visibility across the cohorts in the way that we would like.\n\nPart of that is scale, but part of that is, during the pandemic, which has really been the last eight to 10 quarters, different cohorts have expanded at different rates and also within different verticals. So the one thing I'll leave you with there is part of the beauty of our model is the diversification of those cohorts and verticals. And so verticals that maybe were quite strong during the pandemic, we're still seeing expansion, but it would be more in pockets, right? So it's just the things that are more susceptible to the lending environment may not be as strong now, whereas things related to like My Money Manager, for example, might be showing more strength. Similarly, sectors like food and beverage or technology or even travel and entertainment, manufacturing, those segments have been growing on a relative basis relative to some of the other ones that were stronger.\n\nSo I think part of that is just the diversification of our customer base. And then we'll continue to look at kind of the cohorts. But the cohorts don't show perfect information. I would say they show directional because even within those cohorts, you have pockets of different verticals or size of companies that may be having different impacts depending on what's going on within their sector.\n\nMaggie Wilderotter -- Interim Chief Executive Officer\n\nHi, Kirk. This is Maggie. With regard to your question on Steve Shute and the sales organization and their cross-selling and motions, I will say this, Steve has been rebuilding that organization. And part of that rebuild is to really come up with a list of areas of opportunity for us to expand, not just in the enterprise space, which is -- has a long sales cycle today.\n\nSo one of the things that we're doing differently in enterprise and what we've done before, is I have -- after running a Fortune 500 for many years, I have a very large network at the top of the house for big enterprise customers. And I'm opening doors at the CEO level of those companies, which also allows us to get in front of the top leaders of the company, i.e., the executive team, reporting also to the CEO, with the CEO's help. And that is an ability for us to accelerate going in and looking at an enterprise agreement that's end-to-end from multiple departments at the same time versus just a land-and-expand in one certain department. And we give that visibility to those leaders and would be able to get agreements that have more use cases when we get started because we also find, with our customers, the more use cases they have, the less likely they are to leave DocuSign or to take business away from us.\n\nIt really makes them very sticky. So the other part of that is partnering with our product portfolio folks and with Inhi Suh and her team on making sure that we are coming up with the right capabilities or product for these customers and APIs for our partner portfolio. Because in a lot of cases with enterprise, we have SIs and ISVs that have to go in and really help integrate what we're doing with other capabilities that they already have in place at the enterprise level. We've been doing some one-off of that over -- in the past, which also slows down our implementations.\n\nBut by being able to get some standardization in how we can expand into enterprise in a faster way has been part of the work that Steve has been doing also with Inhi over the last couple of months. And just the last thing I will say is we are also taking friction out of the digital motion. We have a lot of customers, millions of customers that come to our website every month in order to sign a document and create a document. And these are usually one-offs.\n\nBut if you can get more take rate of the folks that visit to do that and completion, there's a lot of money that we can add to the bottom line by doing that in a more frictionless way. And then as Cynthia mentioned, we did have pretty strong small and medium business growth. That's been a heartbeat for our company for many, many years, and we're going to continue to keep our heads down on what makes sense for the use cases for that set of customers as well.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Karl Keirstead with UBS. Please proceed with your question.\n\nKarl Keirstead -- UBS -- Analyst\n\nGreat. Maybe I've got two questions. Cynthia, a few on billings. One is did the large deals you flagged, Microsoft and Goldman Sachs, did that have any material impact on either 2Q billings or the second half outlook?\n\nCynthia Gaylor -- Chief Financial Officer\n\nWell, so I would, first off, say we were very pleased with those deals, but I would say no. We have a very diversified business. So one or two deals don't really put us over the edge, one way or the other. So I would say no.\n\nBut I would say more generally, the timing of deals, the timing of renewals, early renewals or late renewals and start dates, can impact billings, but I would not say that those two deals impacted the rate one way or the other.\n\nMaggie Wilderotter -- Interim Chief Executive Officer\n\nAnd Karl, I just want to add to that, is, for example, like the Goldman Sachs deal was just done in the last week or so, so they're not implemented yet either in some cases.\n\nKarl Keirstead -- UBS -- Analyst\n\nGot it. OK. I just wanted to check. Thank you.\n\nAnd then maybe, Cynthia, just on the fourth quarter billings. If I look at your 3Q guide, look at your full year guide back into implied 4Q billings, it's $709 million. So that's $120 million sequential increase, 3Q to 4Q. That's your strongest ever and much stronger than the prior 4Qs.\n\nIs there anything you would help us understand, point to about 4Q, maybe you've got a better renewal base or you're counting on something that might get us comfortable with that outlook? Thanks so much.\n\nCynthia Gaylor -- Chief Financial Officer\n\nYeah, it's a great question. Thank you. So Q4 is seasonally our strongest quarter, and we expect this year to be no different. I think some of the actions that we've been talking about across the go-to-market, we're expecting to see results from the progress that we're making as we move into Q4.\n\nAgain, we've stabilized the team there. We're making progress with the leaders. We've brought in quite a few new leaders in enterprise, commercial, SMB, customer success. And so we would expect, as we move through the year, that we'll continue to see progress as those teams ramp, in addition to Q4 seasonally being a strong quarter for us.\n\nKarl Keirstead -- UBS -- Analyst\n\nOK. That makes sense. Thank you, both.\n\nOperator\n\nOur next question comes from the line of Alex Zukin with Wolfe Research. Please proceed with your question.\n\nAllan Verkhovski -- Wolfe Research -- Analyst\n\nHey there. This is Allan Verkhovski on for Alex Zukin. Again, thanks for taking the question. Just a quick one for me.\n\nI want to -- if you look at the ARPU for new bookings this quarter and how that compared to last year, would it be the same, higher or lower? And can you further tie this to the level of discounting being done right now by DocuSign, as well as competitors, along with any kind of commentary you think is important to flag in the competitive environment right now?\n\nCynthia Gaylor -- Chief Financial Officer\n\nYeah. Thank you for the question. So I would say we don't look at ARPU in the way you're describing it. But what I can tell you is we do have this land-and-expand model, where customers start out small and expand over time.\n\nAnd we have seen kind of those expansions come in. So that may be a triangulation on the metric that you're looking at. I think when we look at the competitive environment and pricing and how we think about pricing and packaging, we're always looking to stay competitive in the market, but we also don't race to the bottom, right? And so our goal is to really serve customers, create value and innovate and then monetize around what customers need and the products and the innovation we have for customers and really reducing the friction there. So I would say we haven't seen material changes in the competitive landscape or pricing from that perspective, although our goal is we'll compete in the low end and we compete on the high end given all the differentiation.\n\nSo it depends on what customers need, the features, functionality, and then how we cross-sell and upsell products as customers expand. I would also just note, I think our NPS score is quite high and continues to be quite high. And so we really think of that as a metric that's around delighting our customers. The ease-of-use of what we do, even given some of the underbelly of the complexity of the product, I think is really a testament to that high ROI and what customers get from using DocuSign.\n\nAnd we think that's a big differentiator in the marketplace.\n\nMaggie Wilderotter -- Interim Chief Executive Officer\n\nAllan, hi. This is Maggie. Just to put an exclamation point to what Cynthia has just said. With Adobe, for example, we don't see any real change in that dynamic.\n\nWe do see, at times, lower-end use cases are the most vulnerable for us. So we are actually in the process right now of putting in a differentiated use case and use case pricing based upon high-end premium use cases and then sort of medium and lower-end use cases. And we also think by doing that, it helps streamline, for our customers to do business with us and get the benefits that they're looking for from that price value.\n\nAllan Verkhovski -- Wolfe Research -- Analyst\n\nThank you.\n\nOperator\n\nAnd we have reached the end of the question-and-answer session. I'll now turn the call back over to Maggie Wilderotter for closing remarks.\n\nMaggie Wilderotter -- Interim Chief Executive Officer\n\nThank you again, operator, for facilitating for us. And thank you all for joining and for your continued support of DocuSign. I think you can rest assured that the leadership team here in the company will continue to keep our heads down and focus on delivering enhancements and profitability for the company, as well as expanding and delighting our customers on a day-to-day basis. We also look forward to providing you with continued updates on our progress.\n\nSo thank you again for joining us today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHeather Harwood -- Head of Investor Relations\n\nMaggie Wilderotter -- Interim Chief Executive Officer\n\nCynthia Gaylor -- Chief Financial Officer\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nTyler Radke -- Citi -- Analyst\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nKirk Materne -- Evercore ISI -- Analyst\n\nKarl Keirstead -- UBS -- Analyst\n\nAllan Verkhovski -- Wolfe Research -- Analyst\n\nMore DOCU analysis\n\nAll earnings call transcripts"
}