{
  "companyName": "Agrify Corporation",
  "companyTicker": "AGFY",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/agrify-corporation-agfy-q2-2022-earnings-call-tran/",
  "content": "Agrify Corporation (AGFY 0.97%)\nQ2 2022 Earnings Call\nAug 15, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to Agrify's second quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question and answer session.\n\n[Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Anna Kate Heller. Please go ahead.\n\nAnna Kate Heller -- Senior Vice President, Investor Relations\n\nGood morning and welcome to Agrify's second quarter 2022 earnings call. With us on today's call are Raymond Chang, chief executive officer; and Timothy Oakes, chief financial officer. Today, management will review the highlights and financial results for the second quarter and provide a business and operational update. Following management's remarks, there will be a question and answer session.\n\nA reminder that today's conference call is being recorded and a replay will be available on Agrify's investor relations website at ir.agrify.com. Please note that we'll be referring to information that's contained within our press release, which can be accessed on the website as well. Before we begin, we would like to remind everyone that management's remarks contain forward-looking statements. And management may make additional forward-looking statements in response to your question.\n\nSuch statements involve a number of known and unknown risks and uncertainties, many of which are outside the company's control that could cause its future results, performance, or achievements to differ significantly from results, performance, or achievements expressed or implied by such forward-looking statements. Important factors that could cause or contribute to such differences include the risks detailed in our public filings with the Securities and Exchange Commission and those mentioned in the earnings release. Except as required by law, we undertake no obligation to update any forward-looking or other statements, whether as a result of new information, future events, or otherwise. I will now turn you over to Raymond.\n\nRaymond Chang -- Chief Executive Officer\n\nThanks, Anna Kate, and thank you, everyone, for joining us on a call today. I'm going to begin by providing some recent updates on our business. And then our CFO, Tim Oakes, is going to discuss our Q2 financial results in greater detail. After that, I'll go over our outlook for the remainder of 2022, and then, we will open up for questions on the call.\n\nThe second quarter was a challenging quarter for the entire cannabis industry. Unfortunately, we are not immune to what's been happening around us. We're currently seeing cannabis prices plummeting in several key states. Significant capital constraints, delays in construction, and local permitting.\n\nAnd license issuance across many of our customers. Global supply chains continue to be an issue, which leads to a longer lead time for critical components and equipment. For the second quarter, we ended up generating $19.3 million in revenue, which equates to a 63.5% increase from the period -- for the prior year period. We also generated approximately $29 million in new bookings.\n\nEven though we believe that our temporary dip in performance was largely attributed to the significant changes in a broader business environment. We also determined that there were a number of adjustments that we could make in order to better align our strategy, resources, and execution plan with the new realities of the market. The advantage of Agrify is that our organization and technology are incredibly versatile, which allows us to transform our business based on changing market conditions and customer needs. Before diving into some of the substative changes we have made in response to the industrywide pressures.\n\nI would like to quickly highlight some of the things that are already working in our favor as we persevere through this turbulent time. One, interest in enthusiasm in a highly differentiated portfolio of cultivation extraction solutions remains strong. Our pipeline would qualify as a sales opportunity that currently stands at over $250 million. Our diversified mix of products and services gives us tremendous flexibility to adjust our sales approach, to capitalize on whatever market opportunities are most attractive at any point in time.\n\nOur continued emphasis on innovation has resulted in a flourishing product development pipeline. In June, Lab Society introduced the CannaBeast 13 short path thin film distillation system to the market. Precision Extraction Solution just launched the PX10 Hydrocarbon Cannabis Extraction equipment. We will be starting production on the new version 3.7 of our Vertical Farming Units the VFUs.\n\nAnd we have enhanced our rapid deployment program, which I will touch upon later on in the presentation. Our products continue to have a global appeal, even though some of the domestic markets that we serve have temporarily softened. We are getting tons of interest in cultivation extraction solutions from a wide variety of international customers. And is worth noting that we are currently having minimal marketing dollars spent allocated to this global growth initiative.\n\nWe have a massive customer database to leverage for some compelling cross-selling and upselling opportunities. And lastly, with many companies struggling to succeed in this new macro operating environment, we expect that there will be more consolidation in the industry. We obviously have done M&A in the past, as well as post-merger integration, and believe we are uniquely positioned to potentially fortify our business further through additional strategic acquisitions. To combat what we're seeing in the markets, we have decided to take a different approach to build our install base and capture market share on the cultivation site.\n\nWhile we continue to believe in the long-term vision of Agrify's total turnkey solution TTK, deployments of this magnitude become far less practical in an environment where access to capital is difficult and expensive. Consequently, we have decided not to pursue any additional TTK opportunities without a pre-committed construction loan partner. This should help us with cash conservation, as less capital would be tied up in projects where substantial upfront capital is required. Plus usually a 15-plus month construction period.\n\nInstead, we are going to shift our focus to the following, number one, finalizing our existing TTK projects. We have two TTK customer sites coming online in Q3 with another one going live in Q1 of 2023. The total number of VFUs in these three facilities will be approximately 800 plus and we expect SaaS revenue to start in the fourth quarter this month -- this year and production success fees to kick in in Q1 of 2023. Admittedly, we did encounter some unforeseen delays in the late stages of our two projects with construction and permitting issues.\n\nBut we have learned from that and are pleased to report that we have overcome most of these major hurdles. We believe these three imminent TTK engagements with customers in Nevada, Washington, and Massachusetts will serve as an excellent proof of concept for the underlying business model and the attractive returns to our TTK program. Ultimately, we are confident that this will help attract third-party financing partners for other TTK projects in the future. Second, given this new operating environment in which capital has become increasingly difficult to access.\n\nWe will be focusing the majority of our new business development efforts on further activating and accelerating our rapid deployment program officially launched in the spring of this year. We have since refined and enhanced our rapid deployment program RDP based on customer feedback. The RDP is designed to offer our customers best-in-class plug-and-play cultivation extraction capability with an accelerated path to profitability. RDP program features eight vertical farming units with an option for a small extraction laboratory add-on.\n\nAll in a package -- prepackaged self-contained and quick to deploy format. Simply put, the RDP program will allow us to show up at our customer's facility with two trucks and get them up and running in less than 30 days. The only requirement will be power, water, and an existing or modular clean room. This program lowers the entry barriers and upfront investment for organizations and entrepreneurs who want to experience the many benefits of our complete solution with urgency and allows our customers to get to cash flow much sooner.\n\nThe modular nature of our VFUs manages itself to frictionless expansion opportunities. In the current environment where capital is limited, this solution offers the quickest way to accelerate the widespread adoption of VFUs Agrify's Insight software as well as our extraction solutions. We understand and recognize changing industry dynamics and have pivoted our approach, lower the entry barrier, build the install base, and create a quicker path to high margin, recurring SaaS, consumable, and production revenues. We plan to roll out this offering to a limited set of customers in Q3 and Q4.\n\nIt will officially showcase our RDP offering at the MJBizCon later this year. We intend to start taking orders for a greater volume of our RDP starting in Q1 of 2023. Three, pursue more global opportunities. Within the last few months, we have received VFUs orders from two international markets, Portugal and New Zealand.\n\nAs cannabis liberalization and legalization movements continue to gain momentum globally, we intend to achieve even more strategic growth abroad in the future. In looking specifically at countries in the European Union, quality control is absolutely imperative because EU-GMP standards are very high. And EU-GMP certification is a top priority for medical cannabis producers. Agrify's solution fills the need for quality control to a level position that is unparalleled.\n\nOur VFUs in Agrify's Insights software provides clearly defined processes with controls and accountability at every step, which enables consistency far beyond that of other modern cannabis cultivation methodologies. Additionally, any producers with export and import licenses in the EU can sell to any other EU country, making cross-border commerce fluid and giving producers the runway to scale quickly. As a result, we are very confident that our offering will become highly attractive throughout the European markets, which is expected to eventually become one of the world's largest markets for legal cannabis. As for extraction, I will leave the extraction brand to continue to innovate.\n\nIn June, Lab Society introduced CannaBeast 13 to the market. This cutting-edge short path thin film distillation system offers cannabis operators unprecedented flexibility, ease of use, dependability, consistency, and quality when extracting cannabis oil. Earlier this month, our Precision Solution launched the new PX10 Hydrocarbon Extraction equipment, which offers two times the capacity and twice the output of its predecessor, the PX5. By bringing four of the top extraction companies into our broader organization, we now offer the most comprehensive set of extraction solutions on the market and are also full of innovative products and see them grow.\n\nIn recent months, we have also integrated all of our individual abstraction sales teams into a single entity, and we have aggregated their individual self-database to form a centralized database that can be leveraged for a variety of interesting cross-selling and upselling opportunities. We believe there are synergies that we are just starting to tap into and we believe this will pay off eventually with more dividends in the future. Our notable MSO wins in the abstraction site in the second quarter include $1.3 million from Trulieve and an $800,000 order from Verano. The ultimate validation for the broader vision of our combined entity is encapsulated in our recent agreement with New Zealand-based Ora Pharm, which we announced at the end of June.\n\nOra Pharm, which is a licensed cultivator and distributor of medical cannabis, admitted to purchasing 20 VFUs that will be used to grow cannabis, as well as several cutting-edge extraction technologies. Includes our C1D1 extraction pot, a C15 interfuse extraction system, and the Cannabis 13 thin film distillation system. We expect to form many more partnerships in the future, both domestically and globally, where we provide our customers with a complete package of cultivation and extraction solutions. Given the industry downturn, we've also implemented a series of cost reduction and cost efficiency measures in order to preserve cash during these challenging times.\n\nFor example, we reduce our headcount by 7.5%, which is [Inaudible] results in millions of dollars of annualized cost savings. We have brought the marketing activities in-house and have decreased our marketing spend substantially. Our marketing team has a proven track record and is in Agrify of being able to drive impact while operating in a very lean manner. We have consolidated many of our facilities into fewer locations in order to streamline operations.\n\nFor example, we consulted five locations in Georgia into one building. And in Colorado, including all our Portland locations of four Lab Society locations into one Denver complex. We will be repatriating our production for our contract manufacturing back to all facilities in Georgia during the fourth quarter as we attempt to materially reduce the cost of VFUs and improve capacity. We are actively managing our supply chain and inventory needs to be closely aligned with our near-term revenue expectations.\n\nAnd lastly, we are no longer offering customers cellphone credit, which will ensure we will receive a higher portion of revenue upfront. Despite the tough macro environment, I want to assure you that the underlying health of our company is strong and we will remain undeterred in our quest to be hugely successful over the long run. In summary, the ability to respond swiftly to challenges and remained nimble in a dynamic operating environment is at the core of who we are in Agrify. We believe we have a responsibility to adapt to the headwinds that we are currently facing, and we have instituted appropriate measures to confront these obstacles head-on.\n\nNow I like to turn the call over to Tim to talk about the financial results for the second quarter.\n\nTimothy Oakes -- Chief Financial Officer\n\nThank you, Raymond. Good morning, everyone, and thank you for joining us on today's earnings call. Let to our recent earnings call as I'll speak to our second quarter 2022 financial results, and then, I'll pass the call back to Raymond for closing remarks. I would caution this is going to be a bit lengthy, so please bear with me.\n\nRevenue in the second quarter of 2022 was $19.3 million compared to revenue of $11.8 million in the second quarter of 2021. This represents a $7.5 million or 63.5% year-over-year increase in comparative quarterly revenue. The increase in our second quarter 2022 revenue was solely attributable to the incremental revenue generated by our extraction division of approximately $10 million, which was partially offset by a decline in our design and build revenue of approximately $1.7 million and cultivation equipment revenue of $759,000. The second quarter of 2022 revenue performance was clearly below our expectations.\n\nOur second quarter revenue, most notably our extraction-related revenue, was materially impacted by the current instability in the overall cannabis industry, which resulted in a slowdown in new bookings as well as customer-requested delays in shipping. Both of these factors combined to reduce our anticipated second quarter 2022 extraction-related revenues. Our design and build revenue performance was as expected, given the near completion status of several of our TTK projects. Bookings for the second quarter of 2022 were approximately 29 million, of which 10.6 million of bookings amount were related to extraction products.\n\nThe booking amount also includes TTK-related bookings, which consist of construction and recurring SaaS and production fees as well as product bookings, both include cultivation and extraction equipment amounts. We enterd the third quarter of fiscal 2022 with approximately 779 million in the backlog. A significant portion of our reported backlog amount is derived from future TTK-related recurring revenue streams associated with both our SaaS and production successes, which account for 89% of the total backlog amount. Total gross profit and the associated gross profit margin in the second quarter of 2022 was $1.6 million or roughly 8% of total revenue, compared to gross profit of $527,000 or 5% of total revenue in the year-ago quarter.\n\nGross profit and gross margin improvements in the comparative year-over-year quarterly periods are driven by the incremental profit and margin contributions from our extraction-related product sales. Extraction-related revenues achieved a gross margin of approximately 23% in the second quarter of 2022, with cultivation-associated revenue, including TTK-related revenues, which in the current quarter consisted primarily of design-build revenue, contributing a negative gross profit margin of approximately 7%. The primary driver of our lower than anticipated gross profit performance in the second quarter of 2022 is directly related to the quarterly reserves that were provided for slow-moving inventory and warrants and costs, which totaled 929,181 respectively. In total, these items accounted for a 570 basis point decline in our second quarter gross profit margin.\n\nMoving on to operating expenses. Second quarter of 2022, general and administrative expenses increased by $15 million or 341% to $19.4 million compared to $4.4 million in the year-ago quarter. The comparative increase in G&A expenses in 2022 is largely attributable to an $8.6 million increase in bad debt reserves associated with trade and notes receivable and 800,000 accruals in accordance with a tentative agreement to settle one of the company's legal disputes and increases in G&A expenses related to the incremental G&A assumed in connection with our recent acquisitions. Additional drivers of the comparative increase in the second quarter of 2022 G&A expenses are related to increases in depreciation and amortization expense associated with the intangible assets and one-time charges related to restructuring charges and direct acquisition costs.\n\nAs it relates to our second quarter 2022 increase in bad debt reserves, approximately 7.1 million of the current quarter reserve is specifically related to Greenstone Holdings. The company established the reserve based on its review of Greenstone's financial stability, which could impact the future collectability of the amounts over the Agrify. Greenstone's financial instability is in large part associated with the unfavorable conditions within the Colorado cannabis market. The company will continue to monitor the operations of Greenstone in an effort to collect all outstanding receivables.\n\nBut due to the uncertain nature of Greenstone's business at this time, the company has made the decision to place a partial reserve against the outstanding receivable amounts. Sales and marketing expenses totaled $2.3 billion in the second quarter of 2022, compared to $782,000 in the second quarter of 2021. The comparative increase in the second quarter of 2022 sales and marketing expenses is also directly related to the company increasing the scale of its business and strategically focusing on investments in sales and marketing activity such as headcount, trade shows, and marketing programs. Each of these is necessary to drive rapid growth.\n\nResearch and development expenses in the second quarter of 2022 totaled $2.4 million compared to $774,000 in the year-ago quarter. The increase in recent research and development expense is essentially reflective of the company's need to improve and upgrade our Agrify's Insight SaaS software, as well as the hardware features and functionality of our vertical farming units. Comparative second quarter 2022 increases in R&D expenses are related to current quarter additions of the extraction division, R&D teams, third-party consulting and payroll, and related expenses, as well as additional material costs. We expect to continue to invest in future developments of VFUs, our Agrify insights, cultivation software, and our extraction products.\n\nAlthough we will continue to invest in future R&D activities, we will seek to streamline our R&D processes and reduce R&D expenses as we move through the rest of fiscal 2022. Operating expenses in the second quarter of 2022 include a $69.9 million non-cash charge associated with the full impairment of our goodwill and intangible assets. During the three-month period ended June 30, 2022, the company identified a potential impairment triggering event related to both a sustained decline in our stock price and our associated market capitalization, as well as a second quarter slowdown in the cannabis industry as a whole. In light of those factors, we deemed that it was necessary to perform an interim detailed analysis to support the current carrying value of our long-live assets, including our goodwill and intangible assets as of June 30, 2022.\n\nThe results of our interim testing identified that the carrying book value of the cultivation and extraction divisions' equity balances significantly exceeded their calculated, fair value of equity by an amount greater than the aggregate value of our goodwill and intangible assets. Accordingly, the company concluded that the entire carrying value of its goodwill and intangible assets should be impaired, resulting in the second quarter non-cash impairment charges of $69.9 million. The company as of June 30, 2022, is currently monitoring two separate contingent earn-out consideration arrangements associated with the acquisitions of peer pressure in Lab Society. Each of the arrangements contains two consecutive 12-month earn-out periods.\n\nA potential additional consideration that can be earned under each of the two earn-out is capped at $1.5 million per year under the pure earn-out arrangements and $1.75 million per year under the Lab Society earn-out arrangements. The company made initial estimates with respect to the probability of achievement of the additional consideration to be earned under each respective earn-out period and recorded it as part of our initial purchase price accounting associated with each acquisition. Operating expenses in the second quarter of 2022 also include a $907,000 reduction in operating expenses, which is primarily attributable to a change in our fair value estimate of the contingent consideration associated with the currently active Lab Society. During our periodic review of our fair value estimates, we noted that Lab Society's actual revenue performance related to the first earn-out period trailed our initially projected estimates.\n\nAccordingly, we revised our estimated probabilities of earn-out achievement, which resulted in a reduction of the original estimated earn-out achievement of approximately $1 million. This change in contingent consideration as required by GAAP, which was recorded as the current period reductions to operating expenses. We will continue to evaluate on a routine periodic basis future performance against our initial assumptions and estimates on a quarterly basis. Any identified changes to our regional functions that generate a change to our fair value estimates of probable earn-out achievement will result in either an increase or a reduction in our future periodic operating expenses.\n\nLightly touching upon other income and expenses the company is reporting a total interest expense of $1.9 million during the second quarter of 2022, compared to an interest income of $55,000 in the second quarter of 2021. The primary driver of the increase in interest expense during the second quarter of '22 is directly related to interest expense associated with our $65 million debt facility, combined with the current quarter amortization of the associated debt discount. The interest expense was partially offset by interest income recorded on our TTK-related construction advances. The company is recognizing a $62,000 income tax benefit during the second quarter of '22.\n\nNo provision for income taxes was recorded during the second quarter of 2021. The income tax benefit in the three months ended June 30, 2022, was primarily attributable to the goodwill and intangible asset impairment charges recorded during the second quarter of 2022, which resulted in a $62,000 tax benefit related to the reversal of the deferred tax liability on indefinite-lived assets. We can validate the results of operations of less than wholly owned entities into our consolidated results of operations, Agrify-Valiant LLC is a joint venture limited liability company in which we are 60% majority owner, and Valiant America LLC owns the remaining 40%. The reported net income or loss in each of the presented quarterly periods ended June 30, 2022, and 2021 represents the portion of the periodic income or loss attributable to the non-controlling partners.\n\nFinally, the net result of the previously discussed changes in revenue, gross margin, and operating expenses resulted in a net loss of $93.4 million or $3.51 per diluted share during the second quarter of 2022, compared to a loss of $5.6 million or $0.28 per diluted share in the year-ago quarter. Adjusted EBITDA amounted to a loss of $19.4 million during the second quarter of 2022, compared to an adjusted EBITDA loss of $4.5 million in the year-ago quarter. Additional information regarding our use of non-GAAP measures, including a reconciliation to the most comparable GAAP measures, can be found in the press release we issued earlier this morning, which is also available on the investor relations section of our website at www.agrify.com. Quickly providing an update on our cash, restricted cash, and marketable security balances.\n\nWe entered the third quarter of 2022 with a combined amount of cash, restricted cash, and marketable securities of $59.9 million compared to a balance of $56.6 million as of December 31, 2021. As of June 30, 2022, the company is in default of certain financial debt covenants associated with its 65 million senior secured promissory notes. Specifically, the company did not achieve its second quarter revenue or adjusted EBITDA targets. We have reached a tentative agreement in principle with our institutional failure to amend our existing credit facility to modify and eliminate certain financial covenants, which, once complete, should give us additional flexibility to operate and meet our long-term strategic goals, while also allowing us to responsibly adjust to the challenges currently facing the cannabis industry.\n\nWe expect that the restructuring will involve repayment of the existing notes with a combination of cash on hand and through the issuance of a new no with a reduced principal amount, no amortization of monthly loan repayment, and the flexibility of early repayment. We will provide a further update once the agreement has been finalized. That concludes our prepared financial comments. And with that, I will now turn the call back to Raymond for final comments.\n\nRaymond Chang -- Chief Executive Officer\n\nThank you, Tim. I would like to [Inaudible] guidance for the fiscal year 2022. Given the wide pressures we have discussed during this call in our decision to temporarily move resources away from pursuing more TTK customers, which will lead to a notable reduction in our low margin revenue from our facility design and build services, we're updating our revenue expectations to between $70 million to $75 million, reflecting an increase of approximately 7% when compared to $59.9 million generated in 2021. I would now like to open up the call to questions.\n\nOperator, please, go ahead.\n\nOperator\n\nCertainly. [Operator instructions] One moment. And our first question will come from Scott Fortune of ROTH Capital Partners. Your line is open.\n\nScott Fortune -- ROTH Capital Partners -- Analyst\n\nYeah. Good morning. Can you kind of unpack a little bit more of the revenue mix and provide a little more color on the changes there in the quarter as far as the businesses segments regarding, obviously there's extraction TTK-construction and the VFU installments kind of what shifted kind of the change have you seen kind of going forward into the second half, as far as the mix of your business here going forward? That'd be helpful.\n\nTimothy Oakes -- Chief Financial Officer\n\nSure, Scott, I'll start with the easy part, which is just going to be the breakdown of the revenue number. And then Raymond will jump in and just give you the overall flavor and flair as to what's going on within the specific channels, of the $19.3 million in revenue in the second quarter, about $10 million of that is extraction equipment related. And then the residual $9.3 is primarily the design and build as well as some other stand-alone VFU equipment revenue.\n\nRaymond Chang -- Chief Executive Officer\n\nYeah. So, Scott, I think basically only going for bases, we still expect to have continuous strong demand for our extraction equipment that will continue. And I think basically what's happening on the VFU side, as I mentioned on the call, our goal right now is to really just finalize our three existing facilities and it's just two of the three will actually be coming online this quarter. The design and built revenue obviously will decline significantly.\n\nAnd but I do believe that with the RDP program that we plan to launch at MJBizCon, we believe that it will be a significant pick up of the cultivation of VFU-related revenues probably starting from Q1 to 2023.\n\nScott Fortune -- ROTH Capital Partners -- Analyst\n\nOK. And well, can again, extending upon that, can you provide some expectations, as you roll out this rapid deployment program, kind of what are you targeting for expectations for the average number of VFU for this program to get up and run the quick deployment, as you mentioned? And are there any supply chain issues to provide that number of VFUs for these opportunities, just kind of provide a little more color on the kind of expectations for the, obviously VFU to start to deploy, and then, obviously, there's going to be follow on as they realize the growing potential for these VFUs from that standpoint?\n\nRaymond Chang -- Chief Executive Officer\n\nSure. Happy to start. So basically, the VFUs, the RDP program, you will be rolling out a set of eight VFUs, a multiple of eight at a minimum, we can show up at the facility with eight of our VFUs in one truck and literally, there will be a plug-and-play solution and you can get up and running in less than 30 days. This is actually a significant, significant improvement compared to -- in the past when it usually typically is a 15-plus month construction period.\n\nThis is really a plug-and-play solution where everything is hooked up. All you need is a clean room, power, and water source and we can get you up and running in no time. Several reasons why we pick, a multiple of eight, right? One is because we expect the cultivation period to be about eight weeks cycle. So basically, we want you to harvest on a weekly basis, but just cycle through with the AVFUs one week at a time, right? So it's basically the multiplication of eight.\n\nAnd then secondly, it just so happened that it fits very nicely in one of our trucks and so we can deploy that very quickly. But you could actually purchase, again, multiple sets of eight. And on top of that, you also do have the option to add on an extraction, a small extraction lab. And so, if you actually purchase the VFU alone, you'll be less than a million dollars.\n\nAnd if you add on an extraction, you'll probably be about at $1.5 million to $1.6 million in total investments. But you could get up and running in no time, and start cash flowing, right? And basically start taking advantage of the integrated cultivation extraction solutions that we offer. I really believe that is a huge advantage associated with this RDP program, lowers the entry barriers significantly, and then now, basically becomes very quickly deployable. And, you can scale your business from there.\n\nStart with one of our solutions. If you like it, we can have multiple sets of eight and get you up and running in no time.\n\nScott Fortune -- ROTH Capital Partners -- Analyst\n\nOK. I appreciate the color. I will jump back in the queue. Thanks.\n\nOperator\n\nThank you. One moment. And our next question comes from Anthony Vendetti of ROTH Capital. Your line is open.\n\nAnthony Vendetti -- Maxim Group -- Analyst\n\nThanks. Yes. It's Anthony from Maxim Group. OK.\n\nJust a couple of quick questions. The sales cycle, Raymond, you mentioned has been extended. What was the sales cycle prior to this quarter and how long do you think it's been extended? And then, I just got a couple of questions on the VFUs.\n\nRaymond Chang -- Chief Executive Officer\n\nYeah. I think, Anthony, as in the past, with our large deployment of VFUs, it's not so much the cell cycle, but it's just the time it takes to get one of these facilities up and running. Typically, it's a 15-plus month, construction period, right? Because essentially sometimes it's Greenfield, even if it's not Greenfield, typically you get a large 50,000 to 60,000 square feet facility up and running. It's a 15-plus month, cycle construction period.\n\nSo it's basically a very long time until we start seeing the first recurring revenue kicking in. Obviously, the RDP program is going to shorten that significantly. It lowers the entry barriers. So instead of having to make a $20 million, $25 million, $30 million investment decision, it is now basically a $1.5 million, $2 million investment decision.\n\nAnd we can get you up and running with eight of our VFUS, you'll get somewhere around 350 plus pounds of production on the annual basis, and you start you can start cash flow, right? So it's actually a very, very significant game changer in our minds. But we are also seeing, as I mentioned on the call as well, just delays in permitting construction. So for example, on our extraction site before it used to be a much quicker book-to-burn ratio, meaning, we would put the sales in immediately almost like within I would say two months and we ship out the products, but we are seeing actually more and more delays because a lot of the customer facilities are just not ready to receive our products. So we are seeing a slower, book-to-burn on the extraction site.\n\nAnd I think that's basically like a common theme across where we actually see, basically, it takes a long time to actually get local permitting. And [Inaudible] basically just completing the construction of all these facilities.\n\nAnthony Vendetti -- Maxim Group -- Analyst\n\nOK. Great. And then just a quick. You can just update it.\n\nI don't know if you gave this number, but how many VFUs do you currently have under contract where you have contractual commitments at this point?\n\nRaymond Chang -- Chief Executive Officer\n\nYeah. I'll take that. In total, we have commitments for about 3,500 VFUs, just a little over 3,500, and those are views that are deployed or are to be deployed under TTK arrangements as well as VFUs that have been shifted sort of on a stand-alone cash sale one-off equipment basis.\n\nAnthony Vendetti -- Maxim Group -- Analyst\n\nOK. And I mean, just looking at it like we just went through the construction period and 350 pounds, I guess, of production per year. With the rapid deployment program, is there a price per pound for cannabis that it becomes just -- maybe not profitable out of the gate? Or it takes much longer instead of a year, it could take longer. And what's your sense of where the price per pound of cannabis is heading? Are you doing any forecasts on that or what seems to be the current market conditions?\n\nRaymond Chang -- Chief Executive Officer\n\nGreat question. So obviously, with our TTK program where we charge, $600 per pound on a production front, we are limiting that offering only to highly attractive, limited license states, right? Where the wholesale pricing would have to be, for example, around $1,800 to $2,000 plus, plus to be able to justify that kind of, unit economics, right? Because we are taking, $600 per pound on plus the SaaS fee on the production. However, the rapid deployment program is very different. We're basically selling the hardware.\n\nSo we will have a positive margin on the hardware and we are basically going to have recurring SaaS fees plus consumables on top of that, much low much lower production fees finalizing all these economics with our test customers at this point. But it will be very different economics with the RDP program that, I think will be a lot more universally adaptable and, very different from our TTK. Our TTK obviously is, where we have to make substantial investments, on our fronts. We need to make sure that we get the proper return on investment.\n\nBut with the RDP program, it's going to be very universally adaptable because like I said, it's, 350-plus pounds of production. It gets you up and running in less than $1.5 million dollars. You won't see that kind of offering anywhere else in the industry today.\n\nAnthony Vendetti -- Maxim Group -- Analyst\n\nOK. Great. OK. Thanks.\n\nI'll hop back in the queue. Appreciate it.\n\nOperator\n\nOne moment. And our next question will come from Eric Des Lauriers of Craig-Hallum. Your line is open.\n\nEric Des Lauriers -- Craig-Hallum Capital Group -- Analyst\n\nThank you for taking my questions. So first on the pipeline, you mentioned 250 million. I think last quarter, you mentioned 375 million. I know that's a multi-year kind of pipeline.\n\nCould you just help us understand what has changed in the pipeline to make it go from about 375 million to 250 million? Thanks.\n\nRaymond Chang -- Chief Executive Officer\n\nWell, Eric, as I mentioned, going forward, we are not entertaining any more TTK -- large TTK, basically deals unless there's a construction partner secured. So basically we're narrowing our focus on the TTK front. And as TTK is usually a three-year forward-looking, so those numbers tend to be much larger. But I think the elimination of basically TTK projects for now obviously impacted the pipeline number.\n\nOn the other hand --\n\nEric Des Lauriers -- Craig-Hallum Capital Group -- Analyst\n\nSo I just like to verify, is that -- sorry, I'm just looking to clarify if maybe that previous pipeline number included unannounced wins. I'm just -- I guess I'm looking to clarify if there are any announced TTK customers that are no longer on the table here.\n\nRaymond Chang -- Chief Executive Officer\n\nSo, Eric, I think there's a conclusion may be that the difference between pipeline and backlog pipeline are opportunities that we have not yet secured. But we are in the conversations, right? At various stages of conversation from internally, we call it the P1 to P4 depending on what stage they're in. But what I think what you're referring to is actually our backlog number, which is basically confirmed deals that we intend to roll out in the future. So I think I think those maybe -- that's where maybe the confusion is.\n\nEric Des Lauriers -- Craig-Hallum Capital Group -- Analyst\n\nSo yeah, now that that helps things. So in terms of the TTK deals that you have left and maybe, any other sort of working capital needs that you and Tim see on your plate here, understanding there's a big, sort of repayment, refinancing going on. What are your cash needs right now in terms of servicing TTK and any other sort of working capital requirements?\n\nTimothy Oakes -- Chief Financial Officer\n\nYeah. In terms of that, right? So, as Raymond mentioned, we're not going to do TTK without every part of our financing partners. So you look at what we've done for cash burn for Q1, and Q2, we've been in the ballpark of $30 million each quarter. I'm going to round a lot of that money has obviously been spent to fund the construction aspect of TTK as well as build inventory.\n\nAs we look at sort of a Q3 cash need as well as the repayment opportunity on the debt that's outstanding. In Q3, we would expect to be a significantly lower cash burn, given the fact that we have ordered a lot of our long lead items. I think Scott had asked about what inventory is on hand to sort of execute the RDP initiative, right? We have enough inventory on hand right now so we can pull in that throttle, if you will, or pull that lever to reduce spending. After repayment, Q3, and Q4, we envision that we have enough cash to get us into Q1 before we kind of have to look at, what we do next in terms of capital raises or seeking additional capital.\n\nEric Des Lauriers -- Craig-Hallum Capital Group -- Analyst\n\nOK. OK. So I guess it sounds like you maybe have a principal amount already sort of agreed in principle with this new refinancing. Are you able to share that sort of potential new principal amount on the loan? Or what your sort of cash balance after this refinancing is expected to be?\n\nTimothy Oakes -- Chief Financial Officer\n\nYeah, I'm going to hold off on that, right? Just out of sensitivity to where we are, right? Yes, you are correct. We do have a lot of the material major terms in terms of what the restructure is or will be in terms of form. I would just be hesitant from just a risk protection point of view to go out with specific terms right now. But what Raymond and I have said in both of our comments, or as we've talked about it.\n\nOnce we are done, which we expect to be in a very near-term window, we will obviously update the marketplace in terms of what the final agreements are as it relates to what the final arrangements are, as to what it relates to, and what the terms of that restructure are.\n\nEric Des Lauriers -- Craig-Hallum Capital Group -- Analyst\n\nThat makes sense. And then, so I guess the last one for me here. Guide implies a sort of $25 million to $30 million in revenue for the second half. I know there's just kind of lots of moving parts, in this more sort of construction side of the business.\n\nCould you just give us -- help us understand sort of roughly how you're expecting that $25 million to $30 million to flow through in terms of, extraction, or other hardware and any sort of help with that sort of second-half implied revenue guidance would be great? Thanks.\n\nTimothy Oakes -- Chief Financial Officer\n\nYeah. And just thinking about that, Q3, Q4, a lot of that revenue, Eric, or I'd say a significant portion of that revenue is going to be extraction related. We are somewhat conservative looking in terms of what we expect extraction to do, given what we've seen right now in the near-term window over the last 90 days, right? Raymond mentioned a lot of the customers are delaying shipment or pulling back because of construction issues on their end. So given the slowdown in our ability to convert book-to-burn backlog into revenue on extraction, we've taken a conservative approach in terms of what we expect the roll to be in three and four.\n\nBut the majority of the bulk of that revenue will be extraction-related, and design-build revenue will come down again in Q3 and Q4 relative to Q2 and Q1 of the first half of this year. Because, as Raymond said, a lot of the legacy construction projects are coming to a close as well as, the ones we are committed to. We will continue to fund, but for anything new, we'll have a co-funding partner so that will reduce the need for the company to utilize balance sheet capital to fund the additional TTKs.\n\nEric Des Lauriers -- Craig-Hallum Capital Group -- Analyst\n\nAll right. I appreciate the color. Thanks, Tim.\n\nOperator\n\nOne moment. Our next question will come from Aaron Grey of Alliance. Your line is open.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nHi. Thank you for the questions. So the first question for me, want to double back in terms of, the pricing in some of the markets and focus specifically, more on Massachusetts. Obviously, one, we're about a year ago, you see pricing down from about $400 retail to under $300 now.\n\nJust looking at the state-reported data. So just in that state, we have a pretty sizable TTK exposure kind of coming online. And how do you think about that $600 per pound like I know for Colorado, you had done a $300 per pound production fee with Greenstone back on your product, your 10-K. So just getting a better dynamic of, how you might have to adjust that as prices fall.\n\nAnd specifically using the Massachusetts example to provide some current terms of the comparability in terms of, the wholesale pricing in the market relative to the production service you need to have to make sure your partner can be successful. Thank you.\n\nRaymond Chang -- Chief Executive Officer\n\nYeah. So, Aaron, great question. I think, basically, in fact, we are monitoring that number almost on a weekly basis. I think 20 -- Massachusetts is actually holding pretty nicely at roughly about $2,200 per pound.\n\nAnd I think, I believe that at that level, the $600 per pound fee that we're charging still makes a lot of sense. In fact, what we're doing is also if you actually layer on top extraction, it's the customer could still be very, very, very profitable and the next one that where we have a commitment, a partnership under the TTK is down in Florida. And Florida also, it's still one of those markets that still holds the wholesale pricing quite nicely. So, again, TTK is not for every single state.\n\nThat's the reason why we're getting out of Colorado and places where the prices have plummeted. But in places that are ongoing in Massachusetts in Florida. Yeah, I believe that the $600 per pound fee pretty much still makes sense.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nOK. Great. Thanks for that color there. And then you mentioned in your prepared remarks you expect some consolidation in the industry to help fortify your own position.\n\nSo I believe you're talking about that more from an ancillary right position to expand to more in the extraction category in otherwise. But I just want some for the color because it would seem your M&A targets would be more ancillary players, which they themselves benefit from expansion in Category B at new MSOs or other operators. So just wondering, how you're thinking about the positioning of being able to fortify your own as you're seeing the sales kind of come in from those ancillary, B2B, be reliant players, and whether you're trying to fortify your own current position while also potentially seeing M&A opportunity, especially given your current capital position. So you could expand upon that commentary, that sort of framework that would be helpful.\n\nThanks.\n\nRaymond Chang -- Chief Executive Officer\n\nSure, Aaron. I think that definitely the additional add-ons that we're considering are in the ancillary categories and they're looking at other unique technologies that we can add on. And the -- but here's the situation, we have been actually out there talking to a lot of the ancillary players. The truth of the matter is a lot of big MSOs are cutting back on their, spending at this point, projects are getting delayed.\n\nSo, I think even the ancillary players are really hit, basically taking a hit at this point. And what they realized is that they need to basically join, companies like Agrify, where, we can offer a very comprehensive set of solutions to basically have continued to have these conversations with the MSOs. If you actually go in there with just a single piece of equipment, it's hard to get their attention. I think they actually going in there, they look, we got a solution on this and we got a solution on that.\n\nAnd by the way, we could actually potentially upsell you, on some of these consumables that basically makes it a very different conversation. And the fact of the matter is if you look at the combination of the five-day customer database that we have, right, it's the combination of the four extraction companies. And with Agrify, we touch roughly 96% to 97% of all licensed cultivators out there. There's no one else in the industry, that sort of thing.\n\nAnd I think city were and really into -- yeah, sorry about that. But that's where our advantage really shows up. And, and that's the reason why a lot of people, they really want to basically work with us because they know that we can actually add on their products and be able to, penetrate the market deeper with that with our, strong presence in the market.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nOK. Thanks a lot, Raymond. I really appreciate the comment. I'll jump back into the queue.\n\nOperator\n\nI would now like to turn the conference back to Raymond Chang.\n\nRaymond Chang -- Chief Executive Officer\n\nWell, thank you all for attending the call today [Inaudible] forward to our next quarter call. Very much appreciate it.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAnna Kate Heller -- Senior Vice President, Investor Relations\n\nRaymond Chang -- Chief Executive Officer\n\nTimothy Oakes -- Chief Financial Officer\n\nScott Fortune -- ROTH Capital Partners -- Analyst\n\nAnthony Vendetti -- Maxim Group -- Analyst\n\nEric Des Lauriers -- Craig-Hallum Capital Group -- Analyst\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nMore AGFY analysis\n\nAll earnings call transcripts"
}