{
  "companyName": "Zeta Global Holdings Corp.",
  "companyTicker": "ZETA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/zeta-global-holdings-corp-zeta-q3-2022-earnings-ca/",
  "content": "Zeta Global Holdings Corp. (ZETA 0.49%)\nQ3 2022 Earnings Call\nNov 01, 2022, 5:00 p.m. ET\n\nOperator\n\nThank you for standing by. This is the conference operator. Welcome to the Zeta third quarter 2022 conference call. As a reminder, all participants are in listen-only and the conference is being recorded.\n\nAfter the presentation, there will be an opportunity to ask questions. [Operator instructions] I would now like to turn the conference over to Scott Schmitz, senior vice president, investor relations. Please go ahead.\n\nScott Schmitz -- Senior Vice President of Investor Relations\n\nThank you, operator. Hello, everyone, and thank you for joining us for Zeta's third quarter 2022 conference call. Before we begin, I would like to mention that today's presentation and earnings release are available on Zeta's Investor Relations website at investors.zetaglobal.com, where you will also find links to our SEC filings, along with other information about Zeta. Joining me on the call today are David Steinberg, Zeta's co-founder, chairman, and chief executive officer; and Chris Greiner, Zeta's chief financial officer.\n\nBefore we begin, I'd like to remind everyone that statements made on this call, as well as in the presentation and earnings release contain forward-looking statements regarding our financial outlook, business plans and objectives, and other future events and developments, including statements about the market potential of our products, potential competition, and revenues of our products and our goals and strategies. These statements are subject to risks and uncertainties that may cause actual results to differ materially from those projected. These risks and uncertainties include those described in the company's earnings release and other filings with the SEC and speak only as of today's date. In addition, our discussion today will include references to certain supplemental non-GAAP financial measures, which should be considered in addition to and not as a substitute for GAAP results.\n\nWe use these non-GAAP measures in managing the business and believe they provide useful information for our investors. Reconciliation of the non-GAAP measures to corresponding GAAP measures, where appropriate, can be found in the earnings presentation available on our website, as well as in the earnings release and our filings with the SEC. With that, I will now turn the call over to David.\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nThank you, Scott. Good afternoon, everyone, and thank you for joining us today. Our third quarter results were an incredible way to celebrate our 15-year anniversary. Our year-over-year revenue growth rate further accelerated to 32% or $152 million with adjusted EBITDA of $22.4 million, which was up 40% year over year.\n\nWe generated $19.5 million in cash from operations up 92% year over year with $9.4 million in free cash flow, up 152% year over year. On the back of this momentum, we are once again increasing our fourth quarter and full year 2022 revenue and adjusted EBITDA guidance, which Chris will discuss in further detail shortly. Zooming out, there is no question that the macro environment is creating more uncertainty and driving more scrutiny on how and where enterprises invest. The pressure for enterprises to improve their ability to acquire, grow, and retain customers at a lower cost is greater now more than ever.\n\nIn the spirit of never wasting a crisis, CMOs are looking to emerge with a more efficient and effective solution with a better return on investment, which Zeta delivers. Marketing spend tied to measurable outcomes that delivers a strong verifiable return on investment has shifted from one of many objectives to the primary objective. That is why enterprises continue to invest in first-party data and customer data platforms or CDPs. That is why enterprises continue to invest in digital transformation.\n\nThat is why enterprises continue to invest in more addressable and accountable methodologies that deliver greater precision and measurable value. In short, we believe the market is moving even closer to Zeta's sweet spot, where our value proposition shines. And because we make sophisticated marketing simple and address the requirements for both revenue generation and cost savings. Our growth rate has continued to accelerate.\n\nThe Zeta Marketing Platform or ZMP was purpose built to improve marketing efficiency and efficacy, bringing marketers an array of benefits with data, AI, and activation in a single platform, a unique advantage that we have over our competitors. By resolving identity with our data cloud, we reduce waste, improved personalization, and bring more precision to measurement. By enriching a brand's knowledge of their customers, we uncover new insights and unlock new growth opportunities. And by leveraging cutting-edge technology that is flexible, modular, and scalable, we can wrap around an existing enterprises tech stack reducing the time to implementation to days or weeks and establishing a land to expand sales motion.\n\nThis allows us to generate new relationships, even when most enterprises are looking to reduce their numbers of partners, as evidenced by the record 16 new scaled customers we added this quarter on the back of record RFP activity. We're replacing multiple incumbents as the broad capabilities of our platform enable enterprises to consolidate multiple point solutions and simplify their environment and further cut costs. The theme of driving through times of uncertainty was also front and center at our Zeta Live conference, a little over one month ago in New York City with combined in-person and virtual viewers of over 8,000 people. The event generated over 1,500 new prospects for the company and continue to raise our profile.\n\nIn attendance were Fortune 500 brands and many of the largest agency-holding companies, as well as world-renowned entrepreneurs, marketers and, business leaders. With over half of the 50-plus guest speakers representing women and people of color, the events panelists were not only exceptional they were also as diverse as the market segments they represent. We were excited to bring many of the conversations Zeta has had with marketing leaders on a daily basis into a broader form to help other brands adapt and strengthen their own approach to marketing. If you miss any of the remarkable content, I would encourage you to view a replay of the panels, which are available on our website at zetaglobal.com.\n\nA good example of an enterprise that made significant strides this quarter was one of the largest consumer goods companies, which began using our CDP to better identify and understand its existing customers and reduce their reliance on paid media channels. Our Agile Intelligence product delivered sharp insights and accelerated their time to revenue and ultimately return on investment. This case study highlights two themes: consolidating vendors and driving more activation to our platform. This starts with a better understanding of an enterprise's customers by creating more personalized experiences is across channels then we're able to help them measure with greater certainty, which continuously makes our AI platform smarter and the results continue to get better and better.\n\nThis is ROI realization and action and is what makes our customer relationships sticky with a high degree of visibility. One of our Fortune 100 customers stated during Zeta Live, the more data we put into the CDP, the more activation we deliver through Zeta's marketing platform, and the better the results we see. That same customer identified Zeta as a mission-critical partner and expects to allocate more of their spend to us next year. This virtuous cycle is evidenced in another example, a leading automotive aftermarket retailer, which was already using Zeta's CDP for retention marketing, extended their use cases by launching acquisition marketing with audio and CTV channels.\n\nThrough the same platform, they were able to plan, execute and measure the efficacy of audio and CTV impressions against in-store and online sales. This is one of the reasons we saw more than a 250% growth rate in our CTV business this quarter, and it also highlights the power of our CDP, which was recently identified as one of the largest and fastest-growing CDPs according to IDC. As I mentioned in my opening remarks, this past month was our 15th anniversary as a company. We celebrated with a day of service across the company, as we look to give back to our communities.\n\nOver the course of this year, we have also begun taking steps toward reducing our carbon footprint. We are working with cloud and technology partners to adhere to GHG standards and make sustainability a business imperative. I am incredibly pleased to announce that we are on track to achieve our goal of net carbon neutrality for Zeta in 2022. I am incredibly proud of the business we have built and the virtues embraced by our people.\n\nOur founding vision of using data and software to deliver a better and substantially more efficient marketing platform range true more than ever in the current environment. And while we have come a long way, as we like to say at Zeta, we are just getting started. I would like to sincerely thank our Zeta team, our customers, our partners, and all of our shareholders for their ongoing support of our vision. Now, let me hand it off to Chris to discuss our results in greater detail.\n\nChris?\n\nChris Greiner -- Chief Financial Officer\n\nThank you, David, and good afternoon, everyone. Three themes highlight another very strong set of results, all of which we will dive into more detail. First, we extended our track record of beat and raise execution with accelerating revenue growth and increasing profitability and cash generation. Second, the third quarter's outperformance was broad-based across industries, channels, and use cases, as well as throughout our Zeta 2025 KPIs, serving as a powerful demonstration of our ability to execute through a tough macro backdrop, along with demonstrating our business model's balance and our value proposition's durability.\n\nAnd third, on the back of this momentum, we're raising fourth quarter and full year 2022 guidance for revenue and adjusted EBITDA, with momentum across the business our confidence is increasing. We can exceed our targets of at least $1 billion in revenue and at least 20% adjusted EBITDA margins by 2025. Now let's dive into the results. While our overall business grew 32% this quarter, this elevated 30% plus growth rate has been evident across multiple areas of our business for many quarters now.\n\nU.S. revenue in the third quarter was up 36%, representing 96% of total Zeta revenue. And year to date, the U.S. is up 32% year to year.\n\nScaled customer revenue was up 34% year to year, now representing 98% of total data revenue. Year to date, scaled customer revenue is up 30% year to year. Direct platform revenue was up 33% year on year, representing 74% of Zeta revenue. And on a year-to-date basis, direct revenue was up 35% year to year at a mix of 78%.\n\nAnd once again, six out of our top 10 industries grew 25% or more. We also executed ahead of plan against our five beta 2025 KPIs. Scaled customer count grew from 373 in 2Q to 389 in 3Q and is up 42% compared to 3Q 2021 or up 12% year to year. In fact, year to date, we've added three times more scaled customers versus a year ago, tasting twice as fast as our Zeta 2025 model of 6% scaled customer count growth year to year.\n\nDigging a layer deeper provides context into the quality of new customer additions we continue to make. Speaking first to their size, we added six new superscale customers quarter to quarter, bringing our total to $106 greater than $1 million customers. From a breadth of industry contribution perspective, of the 16 new scaled customers we added nine came from consumer retail, three came from technology and media, while the remaining four came from advertising and marketing, among others. In terms of new versus existing, of the incremental 16 net new scale customers added, five were new to Zeta, and 11 were existing customers that became scaled in the quarter.\n\nThat's our go-to-market model working as designed. And finally, in terms of linearity, just like in 2Q, we saw steady additions in scaled customers each month of the quarter, adding six in July, three in August, and seven in September. This acceleration in new customers reflects the growth of our pipeline, which is up 50% year to year, coupled with our strong win rates. And contributing to pipeline expansion is our growing IT analyst industry recognition from Forrester, Gartner, and IDC, which has translated into third quarter RFP activity, up 70% year to year.\n\nScaled customer ARPU grew 19% year to year in 3Q, ahead of the data 2025 model of 14% year-to-year growth. Powering ARPU expansion is the continued growth in super scale customers, whose average annualized ARPU of $4.5 million is more than 10 times greater than the 100,000 to 1 million cohort of 375,000 ARPU. The sales motion moving scaled customers to superscale customers is cross-selling more channels and use cases. This quarter, the average channels per superscaled customer increased by 25% year to year to 2.6 in the number of scaled customers using more than one use case grew by 36% year to year to 39%.\n\nAnd this is a big future opportunity for Zeta. These data points speak to the strong productivity of our hunters and farmers and the outstanding leadership of our CROs and their sales leaders. And because we're seeing a strong ROI on our sales and marketing investment, we continue to add quota-carrying headcount, consistent with the Zeta 2025 plan we communicated in February. In that setting, from a sales capacity perspective, year to date, we have 121 quota carriers, pacing to our year-end projection of 120 to 130 quota carriers, but it's not just about quantity, quality matters most, our sales academy, training programs, and product certification processes enable our sales teams to ramp quickly, while our sales management systems are viewing a sales excellence culture.\n\nWe continue to experience good stickiness, and we are tracking to our full year guidance range for net revenue retention of 110% to 115% for total data. Third quarter direct revenue mix was 74%, with year-to-date mix of 78%, which compares to 75% year to date in 2021. This leaves third quarter integrated platform revenue mix of 26%, higher than a year ago of 19% due to channel mix and political candidate revenue, which was $3 million in the quarter and $2 million better than what we assumed in our third quarter guidance. As I spoke about in our second quarter call, we expected this seasonal mix change, which is the driver of our cost of revenue percentage increasing 2Q to 3Q by 100 basis points to 37.8%.\n\nIt's worth noting, despite the same revenue mix as a year ago, our cost of revenue is better by 90 basis points through better scale and a more favorable mix within direct channels. Bringing it all together, we remain on track to reduce cost of revenue by 200 basis points this year, well ahead of our annual data 2025 model of 60 basis points. On a GAAP basis, our net loss was $69 million, which includes $75 million of stock-based compensation. Excluding the accelerated expensing related to our IPO stock-based compensation would have been $16 million.\n\nFrom an expense-to-revenue perspective, we continue to drive strong operating leverage in R&D and G&A, both of which decreased by 120 basis points and 170 basis points year to year, respectively, excluding stock-based compensation. These points of leverage helped to generate $22.4 million of adjusted EBITDA, up 40% year to year with 14.7% adjusted EBITDA margin, up 90 basis points year to year. Finally, from a cash perspective, it was also a strong quarter as we remain focused on driving higher conversion rates. Year to date, 42% of our adjusted EBITDA converted to free cash flow, up from 7% through the first three quarters of 2021.\n\nCash flow from operating activities was $19.5 million with free cash flow generation of $9.4 million, up 152% year to year. We ended the quarter with a cash balance of $115 million after using $4.3 million for our share repurchase program. Now, I'll transition to our increased 2022 guidance. Based on the strong underlying fundamentals of our business, we're increasing our fourth quarter and full year 2022 guidance putting us ahead of pace to achieve our Zeta 2025 plan.\n\nAnd like last quarter, even with this increase, we believe guidance continues to have a derisked profile. Full details, including guidance ranges, can be found on slide 14 of our earnings supplemental. For the fourth quarter of 2022, we're increasing the midpoint of revenue guidance by $2 million to $160 million, up 19% year to year. And for clarity, we're assuming $4 million of political candidate revenue contribution in the fourth quarter, no change from prior guidance assumptions.\n\nWe're increasing our fourth quarter adjusted EBITDA by $300,000 to $29.5 million, up 29% year to year and representing 18.4% margin at the midpoint of guidance. Combination of our third quarter upside and higher fourth quarter outlook raises the midpoint of our full year 2022 revenue guidance by $13 million to $576 million, representing 26% growth year to year. On an adjusted EBITDA basis, we're increasing the midpoint of our full year 2022 guidance to $89.3 million, up 41% year to year. At the midpoint of our increased full year guidance, adjusted EBITDA margins would expand 170 basis points year to year to 15.5%.\n\nAnd as I've stated before, we're cementing a culture of high performance and a track record of consistent and predictable execution. With that, let me hand the call back to the operator for David and me to take your questions. Operator?\n\nOperator\n\nThank you. We'll now begin the question-and-answer session. [Operator instructions] Our first question is from Ryan MacDonald with Needham. Please go ahead.\n\nMatt Shea -- Needham and Company -- Analyst\n\nHey, guys. This is Matt Shea on for Ryan MacDonald. Thank you for taking the question, and congrats on a really nice quarter here. So first, I wanted to start with the 16 new scaled customers, some strong growth there.\n\nWith the five upsells, that seems to be tracking ahead of expectations. So just curious, what is driving these strong up-sells? And then, understanding is the upsells are not included in the 2025 outlook, so given their kind of strong contributions, how is that changing your long-term vision?\n\nChris Greiner -- Chief Financial Officer\n\nHey, Matt. Good to hear from you. A couple of data points. First, on the mix of the net new 16 added, five were actually new to data and 11 were existing customers, so just kind of on the highlights there.\n\nAnd I'll go through and hand it to David on how we make them bigger and how we bring them in kind of on the go-to-market motion. But just some stats for you that I think are important that speak to not just the record number of 16 that we added, but in our view, why it was such a quality number. So I think first, starting with the linearity across the quarter, we added six in the month of July. We added three in the month of August and seven in September.\n\nSo really just a nice distribution across the quarter. The size was great, adding six new superscale over 1 million customers is really, really powerful for us. I think it's over 24% growth on that number year over year. In terms of the industry representation, industries that probably you and I would suggest -- be under pressure right now macro, nine of the 16 came from consumer retail.\n\nAnother three came from the technology and media, another two in advertising marketing, and there were a couple of others sprinkled in terms of the other industries. So it was a really good quality result, David will speak to how we make them bigger.\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nWell, I also want to point out, but I think that what Chris just pointed out is emblematic of what we're seeing in the marketplace, right? CMOs are under more pressure than ever to focus on the efficiency of their marketing dollars. They're being -- their CEOs are coming down every day and saying, how do we do more with our existing budget? And one of the reasons we were able to win so many of these clients was our sales motion starts with a pilot that starts with a $50,000 or $100,000 test where we're testing in the market where we take their data, we put it into a CDP, we match it to our data ecosystem, and we're able to really rearchitect the journey that every one of their existing high-quality customers followed before becoming one of their customers. And we're able to then go find others in the over 235 million Americans who are opted into our data cloud today, and we're able to take out of the marketing funnel all of the people who either would not be interested in their product, are not currently in market for their product or wouldn't be credit approved for their product in certain cases. By removing all of that excess, you're able to target on the people who are in market qualified for your products and launch your products.\n\nSo you're able to be substantially more efficient and we're able to move through that sales motion of a $50,000 to $100,000 test, and we were able to move, as we said, 16 customers pretty quickly into scaled customers. And I think also, as Chris pointed out, I'm also really excited we were able to have a very large increase in our super scale customers. And we think that we can continue to move from pilots to scale to superscale as the efficiency of the platform, the data and the artificial intelligence gets smarter and smarter, we have case study after case study that the longer a platform -- an enterprise uses our platform, the more efficient the marketing gets, the better the return on investment for the enterprise client the more they spend on the Zeta marketing platform.\n\nChris Greiner -- Chief Financial Officer\n\nMatt, one thing I wanted to point out on your question around being incremental to the model. You're correct in that we modeled ARPU growth in data 2025 on channels and the addition of channels. So as you heard in the prepared remarks, we grew the average channels per scaled customer by 15%. We're now at $1.94 per and we added another 24% in terms of channel growth for superscale customers.\n\nThey're now at an average of 2.6%. But to your point, what's incremental to the model is the expansion of use cases. And as I talked about in this quarter's call, we now have 39 of our 389 scaled customers is still a big, big opportunity for us that are now using more than one use case. That's up 36% year over year.\n\nThat is the piece that you're correct is incremental to our ARPU, but the channels is built into it, just to be clarified.\n\nMatt Shea -- Needham and Company -- Analyst\n\nGreat. Thanks. Got it.\n\nScott Schmitz -- Senior Vice President of Investor Relations\n\nNext question, please.\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nThanks, Matt.\n\nOperator\n\nThe next question is from Jason Kreyer with Craig-Hallum. Please go ahead.\n\nJason Kreyer -- Craig-Hallum Capital Group -- Analyst\n\nThanks, guys, and congrats on just a phenomenal quarter. I wanted to ask about the six superscaled customers. Are there any metrics you can give on that, the timeframe to get to that superscaled level? And then any callouts just in terms of the use cases or the channels where you're seeing some acceleration that's getting to those -- that's helping customers get to that level more rapidly?\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nYeah. So what I would say is it really does differ by customer, Jason, how quickly they scale. What we've said and what I'll continue to say is we're seeing faster growth from pilots to superscaled customers than we've ever seen before. And I think that is shown in the record scale client growth.\n\nI don't know if we can say that this was a superscaled client growth record, but I can't remember ever adding this many before. But the reality is that -- what's happening today is in the time of uncertainty, we are seeing clients grow faster than ever as they're consolidating from multiple vendors to a one-point solution, which quite frankly, I think we're the only company I know of that can be that true single point solution. And we're seeing them consolidate those spends onto our platform faster than they have in the past. The other thing we've said is we continue to be at record RFP requests.\n\nAnd I think a lot of that is also what's going on in the market. So listen, as Machiavelli once said, never waste a crisis, and we are investing heavily into our sales team, our sales motion, and we are making sure that we are getting the word out. I think Zeta Live, I want to reiterate again, not only did we have over 8,000 people attend either in-person or virtually, but we generated over 1,500 high-quality leads for the company to have our sales team go really get after. So we're really seeing a really exciting time right now at Zeta.\n\nChris?\n\nChris Greiner -- Chief Financial Officer\n\nYes. Jason, on the -- some color around the channel growth and use case growth, CTV continues to be a great standout. It's incredible. A year ago, it was in the low single digits percentage of usage on the platform.\n\nIt's now gotten into double digits, which is great. Its growth was 250%. But back to the broad-based strength in the quarter, all of our channels grew very strong double digits. So it was a nice distributed performance even setting aside CTV's outstanding growth.\n\nIn terms of use cases, all grew year over year, which is, I think another testament to the balance. The acquiring grow use cases are really firing. So that's -- that continues to be a good thing. That's just a bit more color to your question.\n\nJason Kreyer -- Craig-Hallum Capital Group -- Analyst\n\nThat's great. Thank you.\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nThanks, Jason.\n\nOperator\n\nThe next question is from Elizabeth Porter with Morgan Stanley. Please go ahead.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nHi. Great. Thank you so much. Just a question on Q4 guidance implies about 2018 to 2019 growth year over year compared to just over 30 that you did in Q3.\n\nSo just wanted to figure out what conservatism have you baked in for macro, just given that usually Q4 is a pretty strong quarter and any assumptions that you're including into the outlook. Thank you.\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nHi, Elizabeth. Always great to hear from you. I think that what we're focused on right now is executing. And we're seeing the business executing extremely well.\n\nAt the same time, we're trying to make sure that we put out, as conservative guidance as we possibly can. We -- now I think Chris will correct me, if I'm wrong, but we beat and raised six quarters in a row as a public company. And we want to make sure that we continue to put ourselves in a position that we can do so. We're not seeing anything in the business today that is slowing down.\n\nYou would also look at the fact we're seeing sizable growth in the business. We had a pretty big fourth quarter last year. So we're putting ourselves in a position where we can continue to be successful, but we're not seeing a deceleration in the business.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nGot it. And then, I just had a quick follow-up on the impressive kind of new customer adds. I know that the partnership with AWS and Snowflake has an opportunity to kind of introduce you to new customers. So is that starting to have a benefit, or is that still a separate opportunity that we should kind of look forward to in the future that hasn't yet shown up in results?\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nThat's actually a great question, Elizabeth. The answer is that we're seeing more deal flow from strategic partners than we've ever seen before. But quite frankly, it's not resulted in what you're seeing in the current results. I think it's going to continue to fuel the business going into next year.\n\nAnd will help us continue to grow the business at a sizable pace. What I would tell you is that a number of clients that we have engaged have been because we're integrated into AWS and because we're integrated into Snowflake, they haven't come in through those channels, although, I would say that a big part of the record RFPs that we're seeing are now coming through those channels, if you know what I'm saying. So I think, they've been incredibly important partners from credibility and a technology perspective to date, I think they will be incredibly important clients from a new scaled customer adds going into the foreseeable future. Chris, does that make sense?\n\nChris Greiner -- Chief Financial Officer\n\nYeah, yeah. Totally.\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nThanks, Elizabeth.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nThe next question is from Arjun Bhatia with William Blair. Please go ahead.\n\nArjun Bhatia -- William Blair -- Analyst\n\nPerfect. Thank you, and congrats on another great quarter, guys. I wanted to maybe just continue on the theme of the customer additions. I mean, it's not just customer additions, right? I think you're seeing pretty good ARPU growth.\n\nYou're seeing large customers. You're seeing your superscaled customers, add to your cohorts. But when you just think about the business for 2023, we know we're entering a little bit more of an uncertain macro here. What does that do? What does this traction that you're seeing today with new customers do for your confidence in your 2023 growth plans? And then, what does it do, Chris, for visibility into your future revenue streams now that you have a more -- a larger and more established base of customers that you can sell into, if things do get tougher.\n\nChris Greiner -- Chief Financial Officer\n\nYou're right. What we've said is that our confidence is increasing that we can exceed the 2025 plan. And we think it's -- it's why it was so important for us to not just throw the GAAP on the revenue and where prop could be. But to give you and our investors the mile markers along the way of scaled customer count of ARPU of mix of net revenue retention, so that we have the same yardstick for the type of progress we're making.\n\nWe'll talk about 2023 in February. But you should leave this call feeling like our confidence has only been increasing with the quarters that we're putting up. And you're right, in terms of the super scaled customers, they have a higher net revenue retention rate than those that are $100,000 to $1 million, which makes them very sticky, easier to predict and rely upon, but also there's a 10x difference in the ARPU for greater than $1 million customer versus $100,000 to $1 million. As David said, the faster and faster we're getting them to that $1 million-plus, you can almost see the moving as fast past that $1 million to the average of what is now over $4 million per.\n\nDavid?\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nYes. And I -- without touching on 2023 because obviously, we've not given guidance on that, I think we'll do that in February, right? Right, Chris. But we believe that the times of uncertainty and the potential of a downturn is a net benefit to our firm. I don't want to insinuate we're countercyclical.\n\nWhat I want to insinuate is that, as times get tougher, marketers inside of companies look for new methodologies to cut costs. We are the single most efficient marketing platform that I'm aware of in the marketplace. And when you think about that at scale, what we're seeing and what we've publicly said is we currently are dealing with record RFP requests. In fact, we're hiring people to try to respond to all of the RFPs that we're getting.\n\nAnd then you couple that with Zeta Live coming out with 8,000 people attending, 1,500 high-quality leads, which for us, of course, is a big chunk. And you look at where the business is executing, I would actually argue that, as things get more turbulent, it's actually a net benefit to us, and we don't want to waste this crisis. We are continuing to add great salespeople. And I want to reiterate, again, we said we'd get to 120 to 130 by the end of the year.\n\nWe said we're above 120 now. That's quality. We're still pruning the ones that are not exceptional. And we would have had a much higher number had we not pruned.\n\nWhat I would also tell you is that, as times get uncertain, we get better flow of potential salespeople and engineers. So as we're seeing the marketplace where we're beating other companies on RFPs, the salespeople who are working for those other companies are calling us and saying, we want to come over here. One of the metrics we didn't get into today, that Chris and you can't get into every metric on every call, is how incredibly fast our new salespeople are getting to their first transaction. I know it's faster than we've ever seen in the past.\n\nAnd a lot of that is the quality of people we're onboarding, the sales motion, our sales university. And in a downturn, I think we'll be able to accelerate hiring of great people, and I think we'll see more enterprises willing to take the risk on a pilot when we can come in and say, we can cut your cost to create, maintain and monetize customers by up to 50%.\n\nArjun Bhatia -- William Blair -- Analyst\n\nPerfect. That's super helpful. And then, maybe just the last one for me. And David, you kind of touched on it a little bit there, but I was hoping to put a finer point on it is, when you think about investing, not just in the go-to-market motion, but also in developers and product, how are you approaching that at this time? Should we expect a balance between growth profitability? Are you leaning one way or another as the market evolves here?\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nI think one of the great things about our budgeting process and how flexible we are is we build a rollable budget, so we sort of look at the first quarter before we make all of our investment decisions for Q2 and Q2 for Q3. So we don't take any meaningful risk there. Although, before I throw it over to Chris to give better detail on that, I've been speaking, and I regularly speak to a lot of business leaders, and it's funny. I continue to hear from a lot of other business leaders.\n\nMy business is executing incredibly well, I'm seeing my pipeline full. I'm seeing more requests than I've seen in the past, but I'm really nervous because of all of the noise out there and everybody talking about it. I think we'd be naive, if we weren't at least thinking about how we would roll forward that investment, but we're prepared to make the investments we need to execute on the business that we're closing we can do it on a rolling basis, which I think gives us a lot of flexibility. Chris?\n\nChris Greiner -- Chief Financial Officer\n\nYes and Arjun, we'll do what we said we would do in the dated 2025 plan. So as David mentioned earlier, we'll continue to invest in sales and marketing. We've said it will grow on an absolute dollars basis as fast or slightly faster than revenue growth. And on R&D and G&A, like you saw this quarter, where the R&D ETR was better 120 basis points, and the G&A ETR was better 170, similar mix last quarter in 2Q, we'll get efficiencies.\n\nWhat the team has done exceptionally well as continue to utilize a global footprint for both R&D and G&A. So we can add people at a very compelling cost point. And we've done so, right? I think that's something we'll continue to focus on.\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nThanks, Arjun\n\nArjun Bhatia -- William Blair -- Analyst\n\nVery helpful. Thank you, guys.\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nThank you\n\nOperator\n\nThe next question is from Richard Baldry with ROTH Capital. Please go ahead.\n\nRichard Baldry -- ROTH Capital Partners -- Analyst\n\nThanks. Can you talk a little bit about the competitive win rates? I'm sort of curious as the RFP percentage or growth in RFPs goes up so much. Are those more competitive, or are you seeing sort of the same people involved, or are they somehow less competitive because they're only targeting a limited number of vendors that they invite in?\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nThat's a great question as usual, Rich. So I would expect the percentage of RFPs we close to actually lower as a percentage from a win rate perspective. Like you can't quadruple the number of RFPs and still win 50-plus percent of them, right? But what we're seeing is we continue to win a disproportionately high percentage of them, substantially higher than our market share. And yes, we -- as we get a bigger reputation, we're just naturally going to start to get some RFPs that the company literally just has to go out to RFP and doesn't want to change your existing vendor.\n\nAnd we used to not even bother to respond to those because we didn't have the bandwidth to respond to them. We're now responding because we want to show those companies, even if they're not seriously considering leaving our RFP response might be we can sit alongside of that. Because to remind you, as you know, one of the great things about our platform is we can wrap around an existing tech stack. So if another company is the CRM of record, we can become the customer acquisition platform.\n\nIf another company is using a particular agency for their customer acquisition versus a software platform like ours and doing it internally, it's very easy for us to plug into the CRM. So I think we're going to -- we haven't really tabulated. I think we actually did win over half last quarter. But at the end of the day, I would expect that percentage to trail down to the 30s or 40s.\n\nBut if you've got four times as many RFPs and you're closing 33% of them, that's better than closing 50% of that 25% of that number. And we're trying to keep our eye on the ball here where we are coming up against. And to answer the second part of your question, we're not seeing any new entrants into our ecosystem, right? There's only so many companies that can handle the type of scale enterprise that we can handle. And we're seeing a couple of the very large incumbent fall off the map almost completely.\n\nAnd we're seeing a couple of the very large incumbents continue to win as enterprises look at their total suite of products, which does – which includes many products we don't sell. We're not in the sales force automation play and we're not in the publishing world. But as we are even seeing companies that centralize on those guys come back to us and say, hey, can you wrap around this and help us with this component?\n\nRichard Baldry -- ROTH Capital Partners -- Analyst\n\nOne for Chris, it's good to see the buyback start up. You talked about using more on cash flow than drawing down the balance sheet. But you're still under half of which your free cash flow was in the quarter. So I'm sort of curious your thought process around how aggressive you expect to be on that, either finishing up the year on a go-forward basis overall? Thanks.\n\nChris Greiner -- Chief Financial Officer\n\nYeah. You're right. We devoted $4.3 million toward the programs. What we said is that, we've kind of earmarked in our own minds, if you will, anywhere around 50%, maybe as high as 75%, but probably more likely 50% of the free cash flow we generated.\n\nSo, we kind of right on plan for this quarter.\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nYeah. Remember, $9.6 million, $9.4 million in free cash flow, $4.2 million in buyback we were slightly below that. But I think we'll continue to target around 50%.\n\nChris Greiner -- Chief Financial Officer\n\nThanks, Rich.\n\nRichard Baldry -- ROTH Capital Partners -- Analyst\n\nThanks.\n\nOperator\n\nThe next question is from DJ Hynes with Canaccord Genuity. Please go ahead.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nHey, guys. Congrats on the results and nice to hear of the continued pipeline strength. I have two questions for Chris. So, Chris, I'm often asked by investors about visibility into variable or usage-based revenue.\n\nCan you just quantify how much that accounts for, how you think about forecasting that part of the business? Any color on kind of the commitments that are made to you on that front? That would be helpful.\n\nChris Greiner -- Chief Financial Officer\n\nYeah. I think the simplest way to think about it, and one of our customers said this at Zeta Live, which is the more data they run through our CDP, it results in the more they want to activate. And it's that activation that happens that's the point of ROI realization. And that's what compels them to continue to double down and spend more on that part of our revenue stream.\n\nSo as long as we continue to tie our results to the ROI and they get it in a very fast time to value, that revenue becomes very easy to predict. It's frankly, if you – when working with my team on the planning side, it's one of the fastest models they're able to pull together, because there are so many customers, with so much predictable replenishment – and for many of our contracts, as we've said, are getting longer in duration, has only added to our ability to predict it, forecast it and rely on it as a solid revenue stream.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nYeah. OK. That's helpful and good to hear. And then the follow-up would be, look, we have your data 2025 targets, right, $200 million plus in EBITDA.\n\nYou're clearly tracking ahead of that for now. what do you think free cash flow conversion on that $200 million in EBITDA might look like? Have you put any thought to that?\n\nChris Greiner -- Chief Financial Officer\n\nIt's -- we get the question a lot from the analyst community and investors. It's certainly something that we're considering updating as part of our 2023 and update on data 2025 in February. But I think the progression that you've seen from where we are today versus where we were a year ago, we've got 42% conversion year to date. That compares to 7% year to date last year.\n\nThe way that we're running the business is, we're driving very profitable contracts, and we're having more and more of a drop to the free cash flow line. But I'd expect that to be something we comment on in more detail when we're in February.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nYes. It sounds like a plan. Well, congrats on the results. Thanks, guys.\n\nChris Greiner -- Chief Financial Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] The next question is from Ryan MacWilliams with Barclays. Please go ahead.\n\nRyan MacWilliams -- Barclays -- Analyst\n\nThanks for taking the question. Please see – three straight quarter of accelerating top line. Guys, given your improving market opportunity, any additional interest in adding new features to acquisition? And maybe any areas, in particular, that might make sense there? Thanks.\n\nChris Greiner -- Chief Financial Officer\n\nYes. So thank you, Ryan. I think -- listen, we've been, I think, over the years, incredibly opportunistic as it relates to M&A. And we're going into a period of time where I think you could see some opportunities that are out there.\n\nWe feel like we have developed internally the vast majority of the sort of features and functions we need in the platform. But as you know, we're always looking to add additional great people -- we're always looking to add additional data that is proprietary and differentiated in the marketplace. And we continue to believe that the future of marketing is going to be with CDPs and CTV and as we look out on to the landscape, we think there are some interesting potential opportunities, but I want to reiterate again and I want to be super clear about this. Zeta has never done a transformative acquisition, and we have none currently on the roadmap, right? We continue to focus on smaller businesses where we can pick up great people and great products and wrap them into our platform and now roll them out to our 1,000-plus global enterprise clients.\n\nAnd we'll continue to look at that. But we're always sort of on the lookout for deals and always looking to do interesting tuck-ins.\n\nRyan MacWilliams -- Barclays -- Analyst\n\nAppreciate the color there. And it's also nice to see that the scaled customers are using more than one use case that's up 36% year over year. Any use case, in particular, that's particularly resonating with these scale customers, maybe it's CDP or opportunity explorer, a little more color there? Thank you.\n\nChris Greiner -- Chief Financial Officer\n\nYes. CTV and CDP, what David said is we see as our big, big future growth products, are the products being most added by superscale customers and scaled customers.\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nThe other thing we debuted at Zeta live, which I am super excited about is our agile intelligence product, which it's really the evolution of the opportunity explorer, Ryan, what that does is not only does it put all of the data at the fingertips of the marketer, it puts all of the data at the fingertips of the business intelligence assets inside our enterprise clients. So, they're able to use that data to figure out everything from where should they put their next physical location to where should they be investing the next best marketing dollar. And as we evolve Internet -- I'm sorry, as we evolve our Explorer product to the Agile Intelligence product, I think it just is going to go to the next level. Now, I'm old that I talked about Internet Explorer instead of opportunity Explorer, but I hope you all know what I meant.\n\nRyan MacWilliams -- Barclays -- Analyst\n\nWe got the picture. I appreciate the color there. Thanks so much, guys.\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nThanks, Ryan.\n\nOperator\n\nThis concludes the question-and-answer session. I'd like to turn the conference back over to David Steinberg for any closing remarks.\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nWe feel like we did an exceptional job this quarter. It really comes down to the people that we have at Zeta. We have some of the most amazing people I've ever had the honor of working with and you're seeing people's grip, you're seeing their focus, and you're seeing it first through a global pandemic, now you're seeing it through probably the first rising interest rate environment that the vast majority of them have ever experienced in their careers. Most of them are not, sort of, old like me, and you're seeing it in an environment where competition is as tough as ever.\n\nOur people continue to be what drives us to the next level: grit, hard work, and wanting to win is really the culture that we focus on here. And I'll tell you, I could not be more proud of this quarter, I could not be more proud of this team, and I could not be more proud to be the leader of Zeta Global. I hope everybody has a great day, week, and month. Take care.\n\nBye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nScott Schmitz -- Senior Vice President of Investor Relations\n\nDavid Steinberg -- Founder, Chairman, and Chief Executive Officer\n\nChris Greiner -- Chief Financial Officer\n\nMatt Shea -- Needham and Company -- Analyst\n\nJason Kreyer -- Craig-Hallum Capital Group -- Analyst\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nArjun Bhatia -- William Blair -- Analyst\n\nRichard Baldry -- ROTH Capital Partners -- Analyst\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nRyan MacWilliams -- Barclays -- Analyst\n\nMore ZETA analysis\n\nAll earnings call transcripts"
}