{
  "companyName": "Datadog",
  "companyTicker": "DDOG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/datadog-ddog-q3-2022-earnings-call-transcript/",
  "content": "Datadog (DDOG -0.59%)\nQ3 2022 Earnings Call\nNov 03, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day and thank you for standing by. Welcome to the Q3 2022 Datadog earnings conference call. [Operator instructions] I would now like to hand the conference over to your speaker today, Yuka Broderick, vice president of investor relations and strategic finance. Please go ahead.\n\nYuka Broderick -- Head of Investor Relations\n\nThank you, Lauren. Good morning and thank you for joining us to review Datadog's third quarter 2022 financial results, which we announced in our press release issued this morning. Joining me on the call today are Olivier Pomel, Datadog's co-founder and CEO, and David Obstler, Datadog's CFO. During this call, we will make forward-looking statements, including statements related to our future financial performance, our outlook for the fourth quarter and the fiscal year 2022, our gross margins and operating margins, our strategies, our product capabilities, and our ability to capitalize on market opportunities.\n\nThe words anticipate, believe, continue, estimate, expect, intent, will, and similar expressions are intended to identify forward-looking statements or similar indications of future expectations. These statements reflect our views only as of today and are subject to a variety of risks and uncertainties that could cause actual results to differ materially. For a discussion of the material risks and other important factors that could affect our actual results, please refer to our Form 10-Q for the quarter ended June 30, 2022. Additional information will be made available in our upcoming Form 10-Q for the quarter ended September 30, 2022 and other filings with the SEC.\n\nThis information is also available on the Investor Relations section of our website along with the replay of this call. We will also discuss non-GAAP financial measures, which are reconciled to their most directly comparable GAAP financial measures in the tables in our earnings release, which is available at investors.datadoghq.com. With that, I'd like to turn the call over to Olivier.\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nThanks, Yuka, and thank you all for joining us this morning. We are pleased to report strong results in Q3 as we continued to execute on our platform vision. Let me start with a review of our financial performance. In Q3, revenue was $437 million, an increase of 61% year over year and above the high end of our guidance range.\n\nWe had about 22,200 customers, up from about 17,500 in the year-ago quarter. We ended the quarter with about 2,600 customers with ARR of $100,000 or more, up from about 1,800 in the year-ago quarter. These customers generated about 85% of our ARR. We generated free cash flow of $67 million, with a free cash flow margin of 15%.\n\nAnd our dollar-based net retention rates continued to be over 130% as customers increase their usage and adopted more products. Next, our platform strategy continues to resonate in the market. At the end of Q3, 80% of customers were using two or more products, up from 77% a year ago. 40% of customers were using four or more products, up from 31% a year-ago and 16% of our customers were using six or more products, up from 8% a year ago.\n\nWe continued to be pleased with this continued adoption of multiple products in our platform, which indicates the additional value we are bringing to our customers. We continue to see strong ARR growth with our newer offerings and our products introduced since 2019, which excludes infrastructure monitoring, core ATM and wealth management remain in hyper growth mode. I also want to highlight a couple of our newer products, Database Monitoring and CI Visibility. We started charging for these products three and two quarters ago, respectively, and each has already exceeded in ARR and more than 1,000 customers.\n\nAnd as we are further developing them, we are confident these products will lead to a broader set of use cases for a larger set of customers over time. Now moving on to this core business drivers. At a high level, Q3 was overall very similar to Q2 with strong performance in new logos and new product attach activities tempered by growth of user from existing customers that further healthy was below our long-term historical average. This added up to sequential net ARR added that was slow to Q2.\n\nTo give you a bit more color, first, on the usage trend. As we said, user growth was overall solid, but consistent with Q2 trends. From a product perspective, Nostra was more homogeneous among our major products than it had been in Q2. Looking at industry verticals, similar to last quarter, we continue to see a more pronounced effect in consumer discretionary and in particular with our customers that are cognitive and fully scaled into public cloud.\n\nNote that the consumer discretionary vertical represents low-teens percent of ARR and increase e-commerce as well as food and delivery. All that said, we are pleased with our Q3 strong performance. Revenue in Q3 grew 61% year over year and 7% quarter over quarter. With all of our products meaningfully outperforming the growth of the large cloud providers.\n\nWhile the macroeconomic environment is likely to remain a headwind in the near-term, we continue to see positive trends underpinning our business and remain bullish about the long-term opportunities and aggressive with our investment plan. First, we continue to see strong growth in new logo ARR, including some large wins in traditional industries. We'll talk about some of those in a bit. Second, our sales pipeline is strong heading into Q4 for both new logos and new products.\n\nAnd we're seeing great opportunities across customer prices, geography, and industry. Alongside our strength in new logo ARR, which gives us confidence that visual transformation and cloud migration remain a top priority. It's perhaps even more critical in difficult times when businesses need to be more agile and do more with less. Remember that with our usage specifically models, new logos wins generally do not immediately translate into meaningful revenue, but they are very important to us as new customers expand their usage in subsequent new quarters and subsequent years.\n\nThird, we are seeing continued expansion on our platform as indicated by customers adopting more of our products. And finally, churn remains low and hasn't changed with gross revenue retention steady in the mid to high 90s. We believe this high gross revenue retention is indicative of the business criticality to have Datadog for our customers. Now let's move on to product and R&D.\n\nFew weeks ago, we had our Dash user conference, which was an occasion to showcase the expansion of our products and the results of our R&D investments. Let me go through some of these starting with visibility before moving on to security, developer experience; and finally, the ability to take action within Datadog. First, we are doubling down on our investments in the visibility, starting with two new products, Data Stream Monitoring and Cloud Cost Management, both addressing growing needs and strong demand from our customers. We also extended our APN fleet to offer mobile app testing, map and dynamic experimentation.\n\nOn the network side, we added traps and monitoring products. On the learning side, we announced low-forward, which coupled with live archives and the visibility pipeline retested at the center of our customers better management. Responding to customer demand. We also expanded our sensitive data scanner beyond logs to identify sensitive data across APM and RAM.\n\nAnd across the platform, we've announced expanded support for open telemetry, PCI compliance where we have on log, as well as EPA compliance across most of Datadog. Second, we are extending our security platform. We announced cloud security management, which brings together cloud security, cloud security posture management and resource catalog as a frictionless reach and context aware, cloud native application correction platform or CNAP. We launched massive protection for application security management to enable blocking attacks in real time directly with the Datadog platform.\n\nAnd we now provide renewability monitoring to give our users a high-fidelity picture of all applications production as well as the dependencies, renewability, and the attach rate base. Third, we follow through with our recent entry in developer experience. We announced continuous testing to facilitate end-to-end testing as soon as the cloud is develop, which increases quality and velocity at the same time. And we showcase intelligent test run using our rich APM and propylene data to automatically keep united tests and drastically reduce soon money spent on CICD.\n\nFourth and last but not least, we announced new product areas that take our platform for observing to allowing our users with action and response all within Datadog. We announced our asset management products to allow users to correlate and summarize alerts, events and issues, movies in order to resolve problems directly from the Datadog area of concern. We also announced that the workflow, which allows customers to develop and run ultimately develop or security remediation using no code editor and already more than 200 integrations to furbishing. We announced lease availability for hosting the collaboration meeting tool that we acquired last year, RUM's real-time screen sharing installation point in Datadog.\n\nAnd finally, we kept on expanding the scope of our watchdog AIM energy. Further automating the detection and guiding the resolution of application in the cost problems. As for dominance from NASH. And as you can tell, the team has been hard at work, and I'm extremely proud of our innovation velocity and focus on our customers.\n\nAnd lastly on products. As we announced in the press release issued this morning, we acquired Cloud Craft, a planning design tool used by tens of thousands of cloud architects to create lifetime, including real-time health, configuration and cost data and we are very excited for their team to bring to Datadog. Now moving on to sales and marketing. Let's discuss some of our wins in Q2.\n\nFirst, we signed a 7-figure land with a Fortune 100 grocery chain. This company was mitigating to Azure but was held back by their open source solution. And because this grocery chain has fanatic better controls around personally investing fair information. Our extensive data center and our HIPPA compliance filled that gap and were differentiators for Datadog giving this opportunity.\n\nNext, we signed a seven-figure land with a major multinational restaurant chain, this company had a legacy availability solution that wasn't able to scale with their vision of subunits and severe environment. They also needed an end-to-end view of their customer journey, and we will now use their paradox products, including Synthetics and RUM to drive customer experience improvement. Next, we signed a seven-figure land with a social networking app. This company was previously a Datadog customer but had moved several years ago to a competitor as maybe certain languages where APM product is going to go well at the time.\n\nToday, our APM not only magical abilities of the solution, but presented significant advantages in terms of either deployment, alerting and [Inaudible] detection. And we also plan to take advantage of our new service catalog, taking Datadog at the center of the operation. Next, we had a seven-figure up-sell with a large Asia-based technology conglomerate. This company is many business units include consumer electronics and IoT.\n\nAnd the use of Datadog has grown rapidly with the number of devices we are managing. We had a number of benefits from using Datadog including lowering the amount of buckets by 25% and a high time to resolution by 50%. We have also seen a significant sensing in incident response activity by encode engineers from 20 hours, 22 hours per week. With this new, this customer has now adopted 14 Datadog products.\n\nNext, we had an eight-figure multiyear upsell with a large e-commerce company. This customer had been using primarily infrastructure monitoring and APM with Datadog and he was also operating an open source of input. Using Datadog led to significant efficiency including certain customer impacting incidents by close to two-thirds and reducing the number of employees required to address each incident by one-third. With this renewal, they are adopting Datadog Log Management and ROM and consolidating multiple home growth and cloud-mated tools as well as a commercial competitor.\n\nThat's it for this quarter's customer highlights, and I'd like to thank our go-to-market team for the award and for delivering another strong quarter. Now let me speak to our longer-term outlook. We recognize the macro environment remains uncertain. We continue to see no change to the multiyear trend toward digital transformation and cloud migration.\n\nAnd we remain confident that we can help our customers with their efforts to sell on costs, drive credit engineering efficiency and take advantage of the benefits of cloud and other next-gen technologies. So we are continuing to invest in our strategic priorities to capture our long-term opportunity. We remain laser focused on bringing value to our customers as we manage through more challenging economic environment. With that, I will turn the call over to our CFO for a review of our financial performance and guidance.\n\nDavid?\n\nDavid Obstler -- Chief Financial Officer\n\nThanks, Olivier. In Q3, we continued to execute well and support our customers. Revenue was $437 million, up 61% year over year and up 7% quarter over quarter. To dive into some of the drivers.\n\nFirst, we experienced strong new logo ARR growth and continued low churn again this quarter. We saw existing customer usage growth remain at levels similar to Q2 as customers continue to be more cost-conscious as they manage their businesses. As Olivier noted, we saw a roughly similar sequential growth in ARR dollars added in Q3 as in Q2. And we saw a relatively homogenous usage growth among our major products during Q3.\n\nAs with Q2, we saw relatively more deceleration in the consumer discretionary vertical, particularly in e-commerce and food and delivery. And we saw similar growth across geographies. As a reminder, we bill all of our revenue in US dollars, and we do not price in local currencies. Our dollar-based net retention remained at strong levels above 130% for the 21st consecutive quarter.\n\nOur land and expand model, aggressive product innovation and our customers' motion to the cloud continue to drive expansion opportunities with our existing customer base. Overall, the customer usage growth we're seeing remains higher than the trough growth we experienced at the beginning of COVID in 2020, and we're pleased with our 61% year over year and 7% quarter-on-quarter revenue growth this quarter. Meanwhile, gross revenue retention was unchanged and steady in the mid to high 90s. Regardless of the macroeconomic environment, our customers still need to serve their clients and moving to the cloud enables better service and cost savings against people intensive or on-prem technology based offerings.\n\nWe believe our high and steady gross retention indicates that Datadog is critical to our customer's ability to deliver services to their clients digitally. And as Oli mentioned, on new logos, we saw continued strong new logo ARR growth across geographies, industries and company sizes, and we have a strong pipeline of opportunities in Q4. Finally, our platform strategy continues to resonate with customers with 80% of our customers using two or more products, 40% using four or more products and 16% using six or more products as of the end of Q3. Moving on to our financial statements, billings were $467 million, up 51% year over year.\n\nBillings duration was slightly lower year over year. Remaining Performance Obligations, or RPO was $941 million, up 31% year over year. Current RPO growth was in the mid-40s year over year. As a reminder, we signed several large multiyear renewals in Q3 2021, which may make current RPO, a more useful indicator with -- as it excludes the multiyear duration impact.\n\nWe also had a challenging comparables of that metric as Q3 of last year, current RPO growth was about 100%. We continue to believe revenue is a better indication of our business trends than billings or RPO as those can fluctuate relative to revenue based on the timing of invoices and the duration of customer contracts. Now let's review some key income statement results. Unless otherwise noted, all metrics are non-GAAP.\n\nWe have provided a reconciliation of GAAP to non-GAAP financials in our earnings release. First, gross profit in the quarter was $348 million, representing a gross margin of 80%. This compares to a gross margin of 81% last quarter and 78% in the year ago quarter. We continue to experience efficiencies in cloud costs reflected in our cost of goods sold this quarter.\n\nIn the medium to long-term, we continue to expect gross margin to be in the high 70s range. Our Q3 non-GAAP opex grew 65% year over year as we continue to grow our headcount in R&D and go-to-market. Q3 operating income was $75 million or a 17% operating margin compared to an operating income of $44 million or a 16% operating margin in the year ago quarter. Then turning to the balance sheet and cash flow statements.\n\nWe ended the quarter with $1.8 billion in cash, cash equivalents, restricted cash and marketable securities. Cash flow from operations was $84 million in the quarter after taking into consideration capital expenditures and capitalized software, free cash flow was $67 million for a free cash flow margin of 15%. Now for our outlook for the fourth quarter and fiscal year 2022. First, informing our guidance, we continue to use conservative assumptions as to the organic growth of our customers.\n\nAnd as usual, we are basing our guidance on current economic conditions, which includes slower than historical growth in usage among existing customers as we have seen in Q2 and Q3. For the fourth quarter, we expect revenue to be in the range of $445 million to $449 million, which represents 37% year-over-year growth at the midpoint. Non-GAAP operating income is expected to be in the range of $56 million to $60 million. And non-GAAP net income per share is expected to be in the $0.18 to $0.20 per share range based on an approximate 347 million weighted average diluted shares outstanding.\n\nFor fiscal year 2022, we expect revenue to be in the range of $1.65 billion to $1.654 billion, which represents 61% year-over-year growth at the midpoint. And non-GAAP operating income is expected to be in the range of $300 million to $304 million with non-GAAP net income per share expected to be in the range of $0.90 to $0.92 per share, again, based on an approximate 346 million weighted average annual diluted shares. Now some notes on guidance. As we discussed last quarter, Q4 includes some large input person events, including our Dash user conference, which was held two weeks ago, and AWS Reinvent, our largest trade show event of the year.\n\nThe cost of those events will result in an approximate 300 to 400 basis points effect on margins. As it relates to our capital expenditures, we are adding more office space around the world as we continue to return to office. We expect capex of about $15 million in Q4. In conclusion, while we recognize macroeconomic uncertainty continued into Q3, we see no change in the importance of cloud migration and digital transformation, which are critical to our customers' competitive advantage.\n\nWe believe we are well positioned to help our customers embark on these journeys and we are investing aggressively into our long-term opportunities while maintaining our financial stress. I want to thank Datadogs worldwide for their participation in these efforts. And with that, we will open the call for questions. Operator, let's begin the Q&A.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Raimo Lenschow with Barclays. Raimo, your line is live.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nThank you. Congrats on a great Q3. Olivier, like a quick question for me. The first one is on, if you compare the current situation and the current environment and what you saw in the pandemic.\n\nBack then, the hyperscalers kind of talked about cost optimization and customers calling back a little bit. It does seem it's slightly different now. Could you maybe talk a bit about some of the factors that you're seeing out there? And then I have one follow-up for David.\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nYes, the situation is fairly different now from what we saw in Q3. First of all we got was very good, very broad, everyone was planning to serve money as quickly as possible, which is not what we see that we're seeing today, few of things actually. First of all, everything that is related to direct transactions with customers, whether it's new logos or new products, all of that is actually working great, but the demand we can see there is as strong as we've seen it. When you look at the usage and where you might see cost optimization, I think there are two different stories there.\n\nThere's these customers that are largely cloud native and normally pretty scale in the pub environment, so then have cloud end-to-end on public cloud that are definitely planning to save money. And these are companies that, in general, also tend to have their own growth rates affected or probably affected in the future by the macro trends. So that's why they're doing that. But when you look at the other customers, the ones that are earlier in their cloud migration, they are actually not slowing down, and we see the same urgency and eagerness for them to keep scaling and keep moving into the cloud.\n\nAnd that's also where the bulk of our opportunities. When you compare us to the hyperscalers, the -- we are seeing some expenses they see when -- and by the way, I should say, it's always hard to do -- to draw a direct comparison between the numbers of hyperscalers and ours. There the numbers include a bunch of a lot of things beyond infrastructure. And we're also not just in public cloud, but also might quite a bit of a private environment as well.\n\nBut we're seeing some of what they're seeing to optimization. We're a little bit less sensitive to it because of what we do, we tend to skew toward more critical environment than everything that might in the hyperscaler. And overall, all of our products meaningfully outperformed the growth of the hyperscalers.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nOK. Perfect. And then David, in these kind of uncertain times, a lot of the time you have negotiations or a vendor has negotiated with customers around billing, billings terms, etc. Have you seen anything that is impacting you or that you can note? Thank you.\n\nDavid Obstler -- Chief Financial Officer\n\nNo, we really haven't seen any difference in billing terms or DSOs for that matter. So on that side, given the mission-critical nature of the product, we haven't seen any material changes in that.\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nAnd again, that is different from COVID times, that really a cash [Inaudible] that was a little bit about. And so they are trying to prevent money from going out of the door right way. Like in this case is more preparing for an environment where they might want to watch a profitability a bit more. And customers, when they negotiate on these difficult ones that are fully scaled, the one thing they look for is more cautionary in terms of how long they can be for and how much it can follow period of time when they're -- especially when they be unsure of their own growth rates.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nOK. Perfect. Thank you. Congrats.\n\nOperator\n\nThank you. Our next question comes from Fred Lee with Credit Suisse. Fred, your line is now open.\n\nFred Lee -- Credit Suisse -- Analyst\n\nHey. Good morning and thank you for taking my question. I was wondering if you could comment a little bit on your traction in security. What segments you're seeing the most traction? And also bigger picture, what you're seeing in the wake of the silos breaking down between second DevOps overall?\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nYes. So bigger picture we -- I mean, fairly well, everybody is talking about it. I could imagine they are the only ones speak about, they need to bring security to get an app, and have given up their -- a lot of responsibility in that. So -- and we're confident that this is -- we see that developing in a way that's very similar to what we see with DevOp about a decade ago.\n\nSo this gives us that confidence. In terms of our traction, we're happy with where we are. We mentioned earlier, thousands of customers will not give the products, the customer business is growing fast, the revenue is growing fast, but it's not like growth for grow in the end, typically this product is very fast. And what we see is a lot of market pull of attraction with.\n\nThere's a lot of customers who want us to be there, and there's a lot of product investments we seen here today. Some of that in a Dash and there's a lot more coming. So it's working as planned that we'd say at this point.\n\nFred Lee -- Credit Suisse -- Analyst\n\nThank you. Great quarter.\n\nOperator\n\nThank you. Our next question comes from the line of Mark Murphy with J. P. Morgan.\n\nMark, your line is open.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nYes. Thank you very much, and I will add my congratulations on a nice performance. So Olivier, many customers had said that your Cloud Cost Management Solution is extremely well timed. And they're saying that because they're seeing interest in cost optimizations that didn't exist about six months ago.\n\nI'm wondering if that aligns with your view, and does that feel like a product to you that can get off to a pretty fast start in this environment? And then I have a quick follow-up.\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nI mean, you're right that cost won't see that -- a lot of people's minds right now. But I would say that it was a really big case six months ago and even a year ago. I think any company that is fully scaled into the cloud cares about their efficiency and they seem that have quite a bit of leverage in terms of cost improvement if they get it the right way with the right tool. So we think it's a product that, yes, it's well timed, but we think it's a product that's going to be -- that has the potential of being very adaptive and very useful for a very long time even after we come out of this challenging macro environment.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nOK. Understood. And then, David, just as a quick follow-up. Looking at the sequential growth in Q3 is around 7%, and the way it appears in guidance for Q4, just thinking about your cadence, that would seem to compound at a year-over-year growth rate around 30%, thinking forward is that type of cadence a fairway to try to conceptualize the glide path into next year, just figuring somewhere around 30%.\n\nIf we want to derisk the models, or do you think that Q3 and Q4 are maybe not so representative of where the puck is going to be heading here?\n\nDavid Obstler -- Chief Financial Officer\n\nYeah. As a reminder, we provide guidance in a consistent way. We essentially look at the environment, the performance and given the usage model, we put conservative assumptions on top of that. We employed that for the guidance we gave here in Q4.\n\nFor next year, we'll provide guidance when we report Q4 and plan to update everybody at that time.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nKeep in mind that different aspects that the -- part of it is driven by the new logos where we're getting from customers. Part of it is driven by the growth of existing customers. And the one we actually get also is -- it's tougher to grow customers very fast when they're growing with us a lot over the past few years when customers have grown in the 80% year over year, 30% year over year through all these years, they may go away before after that. But in turn, it might give us an easier compare for the future.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nThank you, Olivier.\n\nOperator\n\nThank you. Our next question comes from the line of Sanjit Singh with Morgan Stanley. Sanjit, your line is now open.\n\nYuka Broderick -- Head of Investor Relations\n\nSanjit, we can't hear you. Can you please get near to your mic?\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nSorry about that. Appreciate guys taking the question. My question is really around competitive displacements and potentially observability consolidation within your customer base? To what extent are you seeing customers either consolidate open source or other commercial tools and standardize on Datadog, not just to benefit from the innovation that you're seeing from the Datadog's platform, but also to lower their overall observability monitoring spend as they go into next year?\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nWell, we do see a little bit of both. I think it's interesting what we've seen in the past. There's no other new trend there, but we see that happening across our customers. We think also in the future, this is going to only become more compelling when customers also bring to us more of their security use cases, more of their user analytics use cases.\n\nSo these so far have required different copies of the data to different to different vendors, and this tends to be the most expensive part of the other one, the part of the cost structure that scales in the [Inaudible] vendors. So we think we make a very compelling long-term proposition with these customers.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nThat makes a lot of sense. And then I think, Olivier, in your script, you called out a customer that's using 14 different products, which is pretty incredible to think about. For customers that's adopting that many different product capabilities, how is that contract structured? And how does that adoption happen? Is it through some broader, flexible credit system, or are they being -- are these products being sold or priced individually? Can you just give us a sense for a customer that gets up to that level of adoption, how does the contracting work for that type of customer?\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nYeah. So the majority of those contracts for large customer view of products are made on what we call the drawdown, which is basically setting committed amount of credit that customers can use. In relation to that, they get a red card for all the values queue that are going to consume. And those red clients can also be negotiated.\n\nSome customers use very large amounts of certain products, they can get a better rate of those specific products as well as to negotiate that. I think that's where it gets a little bit taller to that specific use cases in the business.\n\nDavid Obstler -- Chief Financial Officer\n\nAnd not to add, that's what we've been talking about the frictionless adoption where the client is using the platform. And given this drawdown with a rate card, they can use the products in a frictionless way as they expand their use of the Datadog platform.\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nThe benefit for them is just -- they usually don't know how much of each of the products they are going to consume ahead of time. But overall, with the shape up there or the size of the environment is going to be, but also don't know within this environment how much APM traces that would need versus logs versus metric versus really use our monitoring, is there anything else that we produce. So it gives them the flexibility there. And again, that's another reason to bring in more tooling of platform because they don't have to pre-commit everything in separate buckets basically.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nBest of luck and thank you for the color.\n\nOperator\n\nThank you. One moment for the next question. Our next question comes from the line of Koji Ikeda with BofA Securities. Koji, your line is open.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nHey, Olivier. Hey, David. Thanks for taking the question. I just wanted to dig in here on the consumer discretionary, and I appreciate all the comments you had in the prepared remarks.\n\nBut was really wondering how much of that vertical is international? Just thinking about FX and the potential effects of FX there if the USD strength persists in the future? Thanks guys.\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nYes. So on FX, sorry, David, if I'm stealing your thoughts out. The -- we charge in dollars everywhere. So we don't have any formal FX risk.\n\nWe don't provide any adjusted numbers for FX, any of that. We do, however, our customers buy our products from Europe and from Japan, their budgets are still in Japanese yen or in euros. And so we do think that the strong dollar is a headwind for us. We don't see very dramatically different growth rates between Europe, Americas and APAC.\n\nSo we think we might see higher growth in APAC and Europe, which are smaller parts of our revenues and less mature if the dollar was weaker. It is conjecture. We can't actually quantify that because we're charging dollars everywhere, but that's something that we are aware of.\n\nDavid Obstler -- Chief Financial Officer\n\nBut in that -- just to add, in that sector, we commented on the predominant effect would be what's happening in their business, in their sector rather than geographical location of the company and its customers.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Great guys. Thanks so much for that.. And just one follow-up, if I may, here on the Cloudcraft acquisition.\n\nJust any color on how big this company is? The press release, it says, hundreds of thousands of engineers. So how does that equate to maybe customer overlap? And does Cloudcraft open the door to maybe new personas to sell into within organizations? Thanks so much guys for taking my questions.\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nYes. So Cloudcraft is very interesting, because it's a very great product. There are lots of opportunities in terms of integrating product with ours. There are opportunities also with some part of this product many stand-alone.\n\nIt's a product that works very well for planning and for cloud architects in general to start their planning their document in cloud migration. It's also interesting for us from a distribution perspective because it has a lot of different users today, it has a very broad reach. It's also very easy to embed on third-party sites. So there are a number of opportunities we're excited about with Cloudcraft.\n\nYou'll see more as we integrate and as we pursue these opportunities. But we're very excited with the opportunity that we have been tracking for a while.\n\nDavid Obstler -- Chief Financial Officer\n\nJust to make sure it's clear, it's a small company. It's an acqui-hire like we've done, meaning we are bringing on board the engineers, it does come with a customer base. It's an immaterial amount of revenues relative to our total. And as Oli mentioned, provides an extension of the platform, as well as potentially some leads and some lead generation in the customers and personas.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nThanks, Oli. Thanks, David. Thanks so much.\n\nOperator\n\nThank you. One moment for the next question. Our next question comes from Matt Hedberg with RBC. Matt, your line is now open.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nGreat. Thanks, guys. David, for you. Last quarter, you talked about a stronger July versus June.\n\nI'm wondering if you could comment a little bit on how the linearity of the quarter played out, and then maybe also how is -- how did October trend relative to September?\n\nDavid Obstler -- Chief Financial Officer\n\nYeah. So for linearity, it was very similar linearity to what we've had. There was no difference. And so we saw -- unlike last quarter a bit, we saw pretty much of a pro rata type of quarter.\n\nAnd we normally have a strong October in terms of the flow of our customers and what they're doing in the platform before pro freezes. We're pleased with what we have seen so far, but still recognize that October is usually strong for us. And it's only the beginning of the quarter. Oli, anything else you want to add that?\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nNo, I think the one thing you're trying to get through the over time during the quarter, we exited the quarter pretty much at where we entered it. There's no change there. And again, as David said, we're happy with what we see there, and we're also usually happy with our product. Q4 has a bit more seasonality in other quarters, in particular, December tends to be a little bit weaker as a lot of our customers take time off and sit down their development environment and things in that.\n\nIt's also been a little bit harder to forecast in recent years with the pandemic and the vacation behavior that change after the pandemic. So we are little bit careful with that, and that's all incorporated in our guidance.\n\nDavid Obstler -- Chief Financial Officer\n\nYeah. And remind everybody what we said in the script was that the Q3 performance was very similar in its drivers to Q2. So that's further evidence of, as Oli said, that's the conditions that we ended Q2 will continue throughout the Q3.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThanks for the color guys. Appreciate it.\n\nOperator\n\nThank you. One moment for the next question. Our next question comes from Brent Thill with Jefferies. Brent, your line is now open.\n\nBrent Thill -- Jefferies -- Analyst\n\nDavid, a question on investment philosophy. Going into the pandemic, you didn't really pull the throttle back. You had at 11% -- going into these times, are you thinking differently about your investment philosophy in this cycle? And can you talk about quota-carrying reps in terms of -- are you at -- on pace to hire what you thought at the beginning of the year, are you pulling back a little bit given some of the current macro jitters.\n\nDavid Obstler -- Chief Financial Officer\n\nYeah. I think as we remind everybody, we've always lived within our means and been limited more by our ability to integrate in a responsible way of quota-carrying reps or R&D for that matter into our company. And we really have not made changes. We had a prudent plan and continued as a reminder to everybody, we think there's a very long-term opportunity, and we're investing behind that.\n\nWe are cognizant that there's more volatility in microeconomic conditions, and we're looking at everything, but we didn't get out over our skis up to begin with in our plan. So it allows us given our model and the way we run the company to continue that investment in a systematic way.\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nJust to restate that, we did make changes, we're investing from an R&D perspective, this was so early, there's so much we want to do, and we have great tractions on the products, and we keep investing there. From a go-to-market perspective, as I mentioned on the call, we actually have a very strong pipeline and the conversion with customers are going right in terms of new logos and new products. And so there is value in growing the CRC and there is short-term and long-term value there. So we keep doing that.\n\nAnd the last thing I'd say is we -- remember, I keep putting, but we bought only $30 million from inception to the new company public, we generated a lot more cash since then. We have efficiency that's one of the core parts of our culture. That's how we run the business, where we built it. And as for the model, we've built in terms of fiction-less expansion and other – some of our products.\n\nSo we trust that we have the levers and the way we hope to use them to make sure we have the right profitability as well.\n\nBrent Thill -- Jefferies -- Analyst\n\nAnd just a quick follow-up on the CRP. I know David, you mentioned, stay focus on that. It is continuing to decelerate, I guess, is that just a function of the large comps? Are you seeing larger enterprise customers? You've seen a slower cadence of large deals come in. Can you give us your take on that?\n\nDavid Obstler -- Chief Financial Officer\n\nYeah, I think the comps are very significant in this quarter. In Q3 of last year, and I think we said this at the time, we had some large multiyear deals. As a reminder, we don't try to target multiyear deal we had from the client side. So that's why the current probably is more over time correlated.\n\nIt is also moves. So if you look at the average of this, it tends over the longer time to correlate with revenues, but there's a lot of noise in this number. So we steer everyone back to revenues and then the computation we've given everybody how to convert revenues into ARR.\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nOne big change again -- one big driver for this is -- our early customers we knew because they try to get ahead of the growth and secure better economics. And in times of uncertainty like this one, customers tend to wait and see more. And sometimes, we have slightly work economics a little bit, but there have been many optionality. And so this is why those numbers moved quite a bit.\n\nAnd again, the best predictor of what's going to happen next year, the revenue ramp on which we are. Everything else is a little bit more historic.\n\nBrent Thill -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment for the next question. Our next question comes from Kamil with William Blair. Kamil, your line is open.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nThank you and congrats on a strong quarter. It sounds like international demand has remained relatively unchanged from June. Was that consistent across regions? And what do you think is unique about Datadog that is major sales in Europe, more resilient than some of your peers?\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nI mean, look, we see them everywhere. We're growing our teams everywhere. We're going to see on the right relative basis faster in Europe and in APAC than we are in the US. We're also doing the teams in Latin America, which is doing very well for us.\n\nSo we -- from where we see, we see them in everywhere. We see Europe and Asia are a little bit behind the Americas in terms of maturity of the cloud migration. But they are scaling and it's happening there, the same way it happened in the past. From a competitive perspective, the situation is about the same everywhere, and it hasn't changed in any notable way over the past year, I would say.\n\nSo there's nothing shocked to say there.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nThat's helpful. And if I could just follow-up. You called out some vendor displays in your prepared remarks. Can you maybe comment on how much of your new customer wins are coming from competitive displacements versus greenfield opportunities? And between the two, are you seeing any difference in the macro impact that are companies that are using competitors, maybe revisiting alternative solutions to optimize pricing, or is the mix shift predictable?\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nIt's still a small minority of the deals. It tends to be the only one that are very large because our customers already had something. They already have a large footprint, and we need to migrate over. So these are deals that are large and the one, which is not a matter of the deal.\n\nThe last matter [Inaudible] are small and grow from there. These are the ones we tend to mention because these are the ones that are most interesting to look at from day one, but this is still a low minority, but we do. We also don't particularly seek those deals. We train our sales team to land as many new logos and new products as possible.\n\nAnd it's better for them to do 10 smaller ones than one larger one. And those 10 smaller ones will each be as big as the one large one in the end. So that's instead of dollar we make for dollar sale activity we spend that's most productive.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nThat's helpful. Thanks again.\n\nOperator\n\nThank you. One moment for the next question. Our next question comes from Fatima Boolani with Citi. Fatima, your line is now open.\n\nFatima Boolani -- Citi -- Analyst\n\nHey. Good morning. Thank you for taking my questions. Oli, I've got one for you and one for you, David.\n\nOli, to your commentary on the usage moderation persisting in the consumer discretionary vertical. I know this is a hard question, but what are some of the signs or signals from that vertical that would lead you to suggest or lead you to conclude that maybe there's more moderation to come. And I'm thinking about this in the context of big tech in the realm of digital advertising and all of the larger companies just beyond and outside of the CDP Vertical. So just any signals or signs that would lead you to conclude one way or the other is the worst of the moderation on the platform expansion is behind us? And then a quick follow-up for David, please.\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nWell, I think the question is -- I mean, it's mostly what we see the most case in the customers that are fully in the cloud, fully scaled in the cloud. And there, basically, we should expect their cloud bank to grow at the same rate of their top line in the end. And so when their top line part is slowing down a bit, or what is certainly slowing a bit -- they try and slow the expenses as well, which is what we've seen. I think what we can tell you is whether the top line will slowdown and start narrow a little bit or it's getting compressed, I think it all depends on how big of an economic downturn we face, if any.\n\nWe're not really the business of predicting that. But what we see is for much of those customers, we got a pretty good idea of where they stand because we see what their projected spend growth is when it relates to the relative growth of the business.\n\nFatima Boolani -- Citi -- Analyst\n\nThank you. David, last quarter, you sort of mentioned to us that a lot of customers and prospects are thinking about reduced commitment levels out the gate. So I'm curious about how that's trending this quarter and what your expectations are with what you're seeing with new customers in terms of commitment levels out the gate. And within this quarter, how much of that austerity, if you will, around commitment levels? How much of that austerity contributed to maybe usage upside beyond the commitment levels this quarter, just given the strength in the quarter? Thank you.\n\nDavid Obstler -- Chief Financial Officer\n\nJust to clarify, so that's not exactly correct what you said. So it is -- so essentially, most of our customers are essentially land and expand and then commit and then grow their usage over time. And that has been going on in the whole model of the company. What we said last time was -- this is not related to they're cutting their commitment.\n\nThis is related to when there are an overt on demand whether they decide to do a new commitment or stay on demand longer and to be able to get greater visibility. The comment from last quarter was really more about billing and those metrics then about customer usage. We said that customer usage has been lower than historical trends, but not as low as it was in COVID. So that's another effect.\n\nAnd what we talked about last quarter was more about the billing effect. So we continue to say that customers are, as we talked about, cautious, but that really only has a marginal effect in the billing. And actually, when a client decides that and stays on demand, it has a positive effect on the revenue side in that micro decision.\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nAnd I'll just add one thing to your first question. Some part of the question is how do we know things are going to get better or worse in the future? I remind you that we have a usage technology for revenue, and we don't have to wait until the mix renewal to give the new some customers on whether this is better or worse. But the news is good or bad, we get it early. And an example of that is that while the -- broadly in the world, we see Q3 being worse at a macro level than Q2.\n\nAs far as our business is concerned, Q3 is very, very much in line with Q2 and whatever step function there was in terms of changing the growth rates, so some customers happened in Q2 already and didn't change in Q3. So we are fairly confident that whatever happens with CPC this year.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Ittai Kidron with Oppenheimer and Co. Ittai, your line is open.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nThank you. Congrats guys, great quarter. David, I just want to have one question for you on the net dollar expansion rate, great to see it well above 130. But I was hoping if you could give a little bit more color on that, specifically directionally, did it go down quarter over quarter? And perhaps, is there a way for you to break down the mix of existing solution expansion in that mix versus new solution adoption.\n\nI'm just wondering maybe not in absolute terms, but perhaps on a relative basis how that mix has changed over the last two, three quarters?\n\nDavid Obstler -- Chief Financial Officer\n\nSure. So we don't give more pointed net retention, but it is a fact that if the organic rate -- expanding rate of customers is lower than it was in previous periods, and we said that the rate is lower than it was at the peak but not as low as it was at the low and COVID in the middle that, that would indicate that net retention would be going down mathematically. But we don't give more information than that. As far as the -- and I think we said a little bit about this in the past, as far as the mix between expansion of existing solutions and new as clients adopt more of the solution in their land, which we said is happening.\n\nWhat happens again, mathematically is that the percentage of the net retention from existing products goes up despite the fact that, as we said, we have very strong adoption of additional products. But we also have very strong momentum in client landing with more products, which affects that number directionally, if that makes sense.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nThat's helpful. And then maybe, Oli, for you, on the database monitoring. It seems like you're off for a good start there. Just from a persona standpoint, does this expand the personas that you're touching, I mean, do you need to be engaged more with this admins in order to sell this product or I'm just trying to think from a go-to-market standpoint, what is needed to keep driving progress here?\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nIn terms of from a go-to-market perspective, it was similarly as the rest of what we deliver, it expands nicely on top of the rest of the platform. You're right though that we're reaching to some of the more specialized function around like DDAs and people like that. But we also have -- who are not trained as DDAs, solve the issues and role as DDA security there. So we run it, there's a little bit of a difference there.\n\nI think today, because of the better business we just reported today, it's not as pronounced as it might be in the future when we start supporting that this is like [Inaudible], for example, where the position of the DDA is more formalized, I would say.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nVery good. Thanks.\n\nOperator\n\nThank you. Our final question will come from the line of Michael Turits with KeyBanc. Michael, your line is live.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nHey, so two quick questions. I think you talked about the growth rates of a number of hosts monitored last quarter is an indication that you really weren't seeing any slowing in the underlying capacity of what needed to be monitoring. Is that growth rate still the same?\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nIt's -- if you look at the growth by product this time, it's not only closer than it needs to be, there's some variations quarter-to-quarter, a lot is about the same in growth rate. APM is a little bit better and I'm not sure if it's down, but there's nothing really meaningful there. I think some of the effects you might expect from what you have from the hyperscale, we see maybe some of that in the infrastructure, but it's not extremely pronounced. So that's why we can't comment on this.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nOK. And then David, just on the capex that you called out that was having to do with headquarters, $15 million extra, I believe you said in this quarter. So I know you're not giving guidance for next year, but is that a one-quarter phenomenon, a multiquarter phenomenon, how big an impact longer term on capex?\n\nDavid Obstler -- Chief Financial Officer\n\nYeah. Just clarify that wasn't extra. That's just the total amount, not the delta between the quarters. We haven't provided that type of guidance.\n\nWe are expanding and building out offices. And again, when we provide guidance for next year, we'll endeavor to provide some guidance that will help in the modeling. Thanks.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nOK. Great. Thank you very much.\n\nOperator\n\nThank you. At this time, I would like to turn it back to Olivier Pomel for any further comments.\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nThank you. Thank you all for listening. I also want to thank, obviously, all Datadogs around the world for working so hard this quarter and that we have been another great quarter. And I want to thank our customers for trusting us with their business and joining us at Dash also for the great event.\n\nSo thank you all, and we'll speak again in Q4.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nYuka Broderick -- Head of Investor Relations\n\nOlivier Pomel -- Co-Founder and Chief Executive Officer\n\nDavid Obstler -- Chief Financial Officer\n\nRaimo Lenschow -- Barclays -- Analyst\n\nFred Lee -- Credit Suisse -- Analyst\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nFatima Boolani -- Citi -- Analyst\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nMore DDOG analysis\n\nAll earnings call transcripts"
}