{
  "companyName": "Credo Technology Group Holding Ltd",
  "companyTicker": "CRDO",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/credo-technology-group-holding-ltd-crdo-q1-2023-ea/",
  "content": "Credo Technology Group Holding Ltd (CRDO 1.06%)\nQ1 2023 Earnings Call\nAug 31, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. [Operator instructions] I would now like to turn the conference over to your host, Mr. Dan O'Neil. Please go ahead, sir.\n\nDan O'Neil -- Vice President Corporate Development and Investor Relations\n\nGood afternoon, and thank you all for joining us today for our fiscal 2023 first quarter ending earnings call. Joining me today from Credo are Bill Brennan, our chief executive officer; and Dan Fleming, our chief financial officer. I'd like to remind everyone that certain comments made on this call today may include forward-looking statements regarding expected future financial results, strategies and plans, future operations, the markets in which we operate, and other areas of discussion. These forward-looking statements are subject to risks and uncertainties that are discussed in detail in our documents filed with the SEC.\n\nIt's not possible for the company's management to predict all risks nor can the company assess the impact of all factors on its business or the extent to which any factor or combination of factors may cause actual results to differ materially from those contained in any forward-looking statements. Given these risks, uncertainties and assumptions, the forward-looking events discussed during this call may not occur, and actual results could differ materially and adversely from those anticipated or implied. The company undertakes no obligation to publicly update forward-looking statements for any reason after the date of this call to conform these statements to actual results or to changes in the company's expectations except as required by law. Also during this call, we will refer to certain non-GAAP financial measures, which we consider to be an important measure of the company's performance.\n\nThese non-GAAP financial measures are provided in addition to and not as a substitute for or superior to financial performance prepared in accordance with U.S. GAAP. A discussion of why we use non-GAAP financial measures and reconciliations between our GAAP and non-GAAP financial measures is available in the earnings release we issued today, as well as in our SEC filings, which both can be accessed using the investor relations portion of our website. With that, I'll now turn the call over to our CEO.\n\nBill?\n\nBill Brennan -- President and Chief Executive Officer\n\nThank you, Dan. Good afternoon, and thank you to everybody for joining the call. During this call, I'll review our fiscal Q1 results and then share why we continue to be excited about our progress and our plans moving forward. When I conclude, Dan Fleming, our chief financial officer, will provide a detailed review of our financial results and expectations moving forward.\n\nCredo's mission is to deliver high-speed connectivity solutions to break bandwidth barriers on every wired connection in the data infrastructure market. We provide innovative, secure, high-speed solutions that deliver improved power efficiency and cost as data rates and bandwidth requirements increase exponentially. Our connectivity solutions are optimized for both electrical and optical Ethernet applications, including the 100 gigabits per second, 200 gig, 400 and 800 gig port markets. All our products are built with our proprietary SerDes and DSP technologies.\n\nOur product families include integrated circuits or ICs, active electrical cables or AECs and SerDes chiplets. Our intellectual property or IP solutions consist primarily of SerDes IP licensing. I'm happy to report that in the July quarter, we continued our strong execution, achieving $46.5 million in revenue, an increase from $37.5 million from the last quarter, up 24% sequentially. Our product revenue, which is a key indicator we track closely, was up 37% sequentially, showing the strong progress we're making ramping our AEC products.\n\nI would like to now provide an update on our product and SerDes IP licensing businesses. Starting with an update on active electrical cables, our AEC solutions represent a new high-speed connectivity product category, the Credo pioneered. As connection speeds increase, passive copper cables or DACs become obsolete due to severe signal integrity and size challenges. Optical connections or AOCs have prohibitive challenges with power and cost.\n\nAECs offer compelling in-rack solutions, achieving half the power, half the cost with better reliability and a more rugged physical design than AOCs. We continue to gain traction due to our engineering ingenuity and customer-first mindset. To date, we've sold AECs to more than 30 customers, including solutions for 50 gig, 100 gig, 200 gig, 400 and 800 gig ports. Our target customers include data centers, 5G carriers, networking OEMs and ODMs, as well as others in the Ethernet ecosystem.\n\nDuring Q1, we continued to ramp the first two programs at our first major data center customer. We also had our first revenue shipments to that same customer on a third next-generation program. With regards to our second major data center customer, we continue to make progress, shipping the first preproduction AEC units for qualification prior to their ramp. We remain encouraged by our prospects at this customer, given the innovative nature of our AEC solution, and we continue to expect the initial ramp of this customer to happen toward the end of this fiscal year.\n\nI'm pleased to share that we've fully recovered from the supply chain shortfall caused by the COVID shutdowns in China last quarter, successfully meeting demand in Q1 while building a buffer inventory that will help to minimize the impact of any supplier manufacturing disruptions in the future. We continue to invest aggressively in our next-generation 800-gig port AEC solutions with our leading 100-gig per lane SerDes technology. We've been working closely with our AEC customers to meet their future needs with innovative solutions to address opportunities for both the server rack and the disaggregated switch rack applications. To this end, we've delivered and verified 800 gig port AEC solutions to multiple data center customers, multiple networking OEMs, as well as additional ecosystem partners.\n\nNow turning to our optical solutions. In this market, we work closely with both optical module manufacturers and data center customers to deliver disruptive solutions for optical DSPs, laser drivers and TIAs. We are in production with two data center customers through numerous optical module manufacturers in a joint development model, or JDM, where our data center customers specify the key components to be used in our optical modules, such as Credo optical DSP. We are also engaged with several optical manufacturers across various applications, including 100-gig, 200-gig and 400-gig Ethernet solutions and beyond the data center, including PON, 5G and fiber channel.\n\nNotably, during Q1, we began production with a leading networking OEM for a 64 gig fiber channel optical module. We recently announced our optical DSP with integrated laser driver solutions for next-generation 800-gig and 400-gig optical modules with 100-gig per lane SerDes technology. Credo is now in a strong position to continue to deliver the same disruptive advantages on the combination of performance, power efficiency and cost for these next-generation 100-gig per lane deployments. With this strong progress, we continue to expect our optical solutions will contribute significantly to our growth in the future.\n\nAnd moving to our Line Card PHYs, we are very pleased with our progress here as well. Credo has quickly become a leader in MACsec solutions that provide data encryption for the growing number of applications requiring high security. We're happy to report that we are now ramping production directly with a second major data center customer deploying our 400-gig port MAXsec solution. We see the market trend toward high-security applications growing significantly in the future, and we remain bullish on this business.\n\nWe continue to make strong progress with our Black Hawk 400-gig port retimer solution as well. Numerous networking OEM and ODM customers are currently transitioning from qualification to mass production. As the market trends toward higher speeds, we will continue to see increasing demand for retimer and gearbox solutions, given the signal integrity challenges at 100-gig per lane. Credo is well-positioned on our next-generation 800-gig Line Card PHY solutions, driven by the same theme of delivering disruptive performance, power efficiency and cost.\n\nEarlier this year, we announced our first generation 800-gig port Line Card solutions, and I'm happy to say that Credo has already been adopted by several customers as they develop their next-generation 100-gig per lane platforms. Finally, we had another strong quarter with our SerDes IP licensing and SerDes chiplet business. This market is very strategic for us, and we had a strong revenue contribution in the quarter. Since our last earnings call, we made two significant announcements on our SerDes IP offerings.\n\nWe announced the industry's first 40 gig PAM 3 SerDes IP, which will be important for next-generation consumer designs. This SerDes IP is leveraged from the work we've done with our lead consumer partner, making our IP a clear choice for next-generation consumer designs. We also recently announced availability of our 112-gig SerDes IP in TSMC's five- and four-nanometer processes. We believe we've set a new industry benchmark for lowest power across a broad range of reach requirements, delivering a comprehensive family of options to span from longest reach LR+ links with more than 40 dB loss to the short XSR links required in multi-chip module SoC designs.\n\nCredo is unique compared to other Serdes IP providers in that Credo will develop and deploy this same IP in our next-generation five- and four-nanometer products for our AEC, optical PSP and Line Card PHY solutions. This becomes a great benefit to our IP licensing partners since Credo is walking the walk on product deployments right in step with our SerDes IP customer deployments. I will also say that we expect to again deliver the best power and performance combination for all our IP and product solutions in five and four nanometer. In the past, we've talked about Credo's core advantage of using more mature and less expensive process technology while delivering lower power and smaller die sizes than our competition.\n\nWe refer to this as an N-1 process advantage. We believe we've extended this N-1 process advantage to five and four nanometer and that our competition will need to move to more advanced and expensive processes to be competitive with Credo. Regarding our SerDes chiplet efforts, we were honored to be mentioned by Tesla at TSMC's Technology Symposium in June as their key connectivity partner for their leading-edge Dojo supercomputer design, where Credo provided their 112-gig XSR SerDes IP and their 3.2 terabit per second chiplets. Also notable, we recently became a UCIe-contributing member, building on the market momentum for our industry-leading XSR SerDes IP and our two 3.2 terabits per second production chiplets.\n\nIn summary, we continue to be excited about our progress as we deepen relationships with current customers and as we receive commitments from new customers. We're also encouraged by the prospects of our next-generation 100-gig per lane solutions based on strong customer feedback and engagement. Near term, we remain focused on delivering strong results in our fiscal '23 as we continue to expect to achieve at least $200 million in revenue, which would represent an annual growth of more than 88%. Now I'll turn the call over to our CFO, Dan Fleming, to provide more details on our first quarter and to give guidance on Q2.\n\nDan Fleming -- Chief Financial Officer\n\nThank you, Bill, and good afternoon. I will first review our Q1 fiscal '23 results and then discuss our outlook for Q2 of fiscal '23. As a reminder, the following financials will be discussed on a non-GAAP basis, unless otherwise noted. I'm pleased to share with you that in Q1, we achieved another quarter of record revenue at $46.5 million, above the midpoint of our guidance range and up 24% sequentially.\n\nSequential growth was driven by strong revenue growth of our products, which also reached a record of $36.1 million for the quarter, up 37% sequentially. This growth in product revenue was led by a continued wave of AEC adoption that will continue to transition our revenue mix from being IP focused to product-focused. The fundamental driver of our product growth, a strong HSDC expansion outlook at the highest speeds remains in place in the face of an uncertain economic and geopolitical landscape. Our IP business generated $10.4 million of revenue in Q1.\n\nIP remains a strategic part of our business, but as a reminder, our IP results may vary from quarter-to-quarter, driven largely by specific deliverables to preexisting contracts. While the mix of IP and product revenue will vary in any given quarter over time, our revenue mix in Q1 was 22% IP, above our long-term expectation for IP, which is 10% to 15% of revenue. With a strong product result this quarter, we delivered gross margin of 60.5% above the midpoint of our guidance. This was down 316 basis points sequentially, driven principally by revenue mix changes.\n\nOur IP gross margin was 91.2% in Q1 and our product gross margin was 51.8% in the quarter, up 326 basis points sequentially and up 11.6 percentage points year over year. This product gross margin expansion is principally due to leverage from our strong product growth. Total operating expenses in the quarter were $22.6 million at the midpoint of our guidance and up 43% year over year as we scale the organization for growth. We expect to continue to deliver considerable leverage in the business.\n\nOur opex increase was driven by a 50% year-over-year increase in R&D as we continue to invest in the resources to deliver innovative solutions. Our SG&A was up 33% year over year as we continue to build out public company infrastructure. We delivered operating income of $5.7 million in Q1, up 138% sequentially. Our operating margin was 12.2% in the quarter, up 584 basis points quarter over quarter as we continue to gain operating leverage.\n\nWe delivered net income of $5.4 million in Q1, up 96% sequentially. The cash flow from operations in the first quarter was negative $12.2 million, a decrease of $14.6 million sequentially as a large receivable of $11.5 million came in the week after our quarter ended. capex was $5.3 million in the quarter, driven by production mask spending and free cash flow was negative $17.5 million, a decrease of $7.2 million year over year. We ended the quarter with cash and equivalents of $243.8 million, a decrease of $15.5 million from the fourth quarter.\n\nThis decrease in cash was a result of continued working capital investments to support our top line revenue growth. Our accounts receivable balance increased 86% sequentially to $54.8 million, while days sales outstanding increased to 107 days, up from 72 days in Q4. Our Q1 ending inventory was $37 million, up $9.7 million sequentially as we continue our product ramp while successfully building AEC buffer inventory to minimize the impact of any manufacturing disruptions in the future. Now turning to our guidance for the second quarter.\n\nWe currently expect revenue in Q2 fiscal '23 to be between $48.5 million and $52.5 million, up 9% sequentially at the midpoint and 91% year over year. We expect Q2 gross margin to be within a range of 59% to 61%. We expect Q2 operating expenses to be between $23.5 million and $25.5 million. And finally, we expect Q2 weighted average diluted share count to be approximately 159 million shares.\n\nAs Bill mentioned, we remain on track to achieve at least $200 million of revenue in fiscal year '23. And coupling our strong growth with our fiscal discipline, we will continue to generate leverage in the business and expect to deliver a double-digit operating margin for the full year. And with that, I'll open it up for questions. Thank you.\n\nOperator\n\n[Operator instructions] Your first question comes from Vivek Arya of Bank of America. Your line is open.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\n[Audio gap] the fiscal year. But I'm curious, how are you thinking about the mix between AEC, optical, Line Card PHYs and IP now versus what you thought three or six months ago, how has that mix evolved? And have you seen any headwinds or pushback at all from a macro perspective that a number of your larger peers have pointed to in their recent earnings calls?\n\nBill Brennan -- President and Chief Executive Officer\n\nThanks for the question. I appreciate that. From the mix perspective, I think we're right on track with what we expected six to nine months ago. Of course, we've quickly seen our AEC business turn into our largest from a revenue standpoint.\n\nLine Card follows and then optical is going to be next. Long term, we expect that our revenue mix will really match the market TAM in a sense that long term, we expect AEC to be our largest product business, followed by optical and then followed by Line Card. So really no changes there. And then on a macro level, I think we're in a very good position generally.\n\nIf you look at our engagements with our customers are all really on the leading edge for new technology deployments that really deliver the necessary next-generation bandwidth that is really forefront in their requirements. And so if decisions are made by our customers to slow the quantity and rate of deployments, we still see large and ramping volumes for the programs that we're on. So I would say that we're not seeing the same kind of macro level impact to our business, just given our positioning.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nAll right. And for my follow up, Bill, on the topic of AEC and your lead customer, I'm curious, which innings of adoption do you think your product is in? If you would look at the total number of high-speed ports being deployed at your large customer, and you look at the adoption of your AEC, where are we in that adoption phase? Because I'm trying to determine whether we should be expecting a digestion phase? Or is it too early in the ramp? Do you expect any kind of digestion phase? Just where are you in the adoption process at your largest customer?\n\nBill Brennan -- President and Chief Executive Officer\n\nSure. Again, thanks for the question. I would say that we're in the middle innings of the first initial ramp. So it's reflected in the fact that we grew so significantly this quarter.\n\nAnd our expectation is that ramp will really continue through the next quarters.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nDo you expect it to grow next year as well?\n\nBill Brennan -- President and Chief Executive Officer\n\nWell, generally speaking, the opportunity that we've got really matches the number of servers that are deployed at each one of our hyperscale customers. And so I would say that also, we're engaged in multiple programs as they change technology for their network interface card or NICs at the server level. And so ultimately, I believe that the ramp that we've got with our first customer will continue. It's hard for me to say, from a volume standpoint, will the volumes continue to increase after we were fully ramped.\n\nBut then we expect to add more customers to our mix that will be significant in the fiscal '24 time frame.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Toshiya Hari of Goldman Sachs. Your line is open.\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nThank you so much for taking the question. I had two questions as well, one for Bill and one for Dan. I guess in terms of your optical solutions business, Bill, I think you did a great job in talking about your customer engagements qualitatively. I was hoping you could give perhaps some guidance on the quantitative front.\n\nYou talked about it being a big growth contributor over the next couple of years. How should we think about fiscal '24 and beyond for optical solutions?\n\nBill Brennan -- President and Chief Executive Officer\n\nWell, I think the progress that we're making is, I think, very strong. I think we're right on track with where we expected to be. I would say that the base that we're growing from is small. So we believe that this is going to be the fastest growth from a percentage perspective out of the different products that we're promoting.\n\nI will say that there is some surprising trends in the end markets where we see that the 200 gig optical module is much, much higher volume than the forecasters showed going back two or three years ago. 400-gig, we see is something that's really still increasing, where it was really a small percentage of the market up until the first major hyperscaler rounds. But we see others adopting 400. 800 gig, we see it will not be adopted by every hyperscaler in the market as some look toward the next generation 1.6 T.\n\nSo in general, we look at every hyperscaler as an independent market, and that's really how we're pursuing the different opportunities. So we've got many irons in the fire across the industry on many different port markets really from 100 gig through 800 gig, and even we have early conversations going on about 1.6 T.\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nGot it. So just as a follow-up, Bill, is it fair to assume that some of the commentary that you provided at the time of your IPO still stand today, you're on track to hit kind of the medium to long-term numbers in optical DSP?\n\nBill Brennan -- President and Chief Executive Officer\n\nYes, we believe we're on track.\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nOK. Got it. And then as my second question for Dan. Product gross margins were up nicely, both sequentially and year over year in the quarter.\n\nAs we think about the next couple, if not several quarters, as you continue to ramp at your largest AEC customer, your second customer comes in toward the end of the fiscal year. And from a low base, your DSP business starts to ramp. How should we think about your product gross margins evolving over the next, call it, four quarters? Thank you.\n\nDan Fleming -- Chief Financial Officer\n\nYeah, thanks. That's a great question. And if you recall, as we had laid out our gross margin kind of trajectory through our discussions over the last quarters, fundamentally, nothing has really changed. A couple of things to point out, obviously, just as you're highlighting, our product gross margin expanded more than 300 basis points from Q4 to Q1.\n\nAnd we've demonstrated throughout all of fiscal year '22 and now starting into fiscal '23 that these product gross margins will expand as we gain scale. So we expect that expansion to continue fundamentally just because of the scale we're attaining over the next three to four quarters. Beyond that, the fiscal year '24 and fiscal year '25 stories are similar to what we had described before, there will be, we believe, some favorable revenue mix trends over those years that will help further expand that gross margin. And some of the dynamics in the AEC market will also contribute to that margin expansion when 800 gig ports are kind of the predominant ports.\n\nSo there's a lot of different trends that we've seen, that we've described in the past that we believe we expect to see, as we've described in the past. \n\nToshi Hari -- Goldman Sachs -- Analyst\n\nVery helpful. Thank you.\n\nOperator\n\nThank you. Our next question comes from Vijay Rakesh of Mizuho. Your line is open. Please make sure your phone isn't on mute.\n\nVijay Rakesh -- Mizuho Securities -- Analyst\n\nSorry, I was on mute. Thanks for that. Hey, Bill and Dan, just on the 64 gig optical transceiver side, I mean, how many customers would you be engaging with? Are you seeing basically the ramp going with multiple customers? Or are you starting with one and then slowly ramping other ones into fiscal '24, '25?\n\nBill Brennan -- President and Chief Executive Officer\n\nGood question. And so our main partner is a large networking OEM. We are shipping these optical DSPs, the 64 gig single lane to multiple optical partners that are fulfilling that demand that comes from the networking OEM that we're working with.\n\nVijay Rakesh -- Mizuho Securities -- Analyst\n\nGot it. And on the supply side, I know you guys have been building a buffer inventory etc., but can you talk to how you have probably improved your supply chain logistics etc., as why inventory is up a little bit. But can you talk to what you're doing there in terms of securing your forecast and securing the supply side as well, giving that customer supply assurance at least? Thanks.\n\nBill Brennan -- President and Chief Executive Officer\n\nSure, sure. Yeah, that's a very good question. I would say from a supply standpoint, we find ourselves in a much better shape right now than we were in the past quarter when we had the issue with the shutdowns in China. And so there's different elements of our supply chain that we look at.\n\nOf course, we are actively planning wafers with TSMC, and that's a very regular discussion we have with them. We see no issues for the foreseeable future there. Packaging substrates are another very frequent conversation we're having with our partners. We feel very good about our position today with those supply chain partners as well.\n\nAnd then finally, with our AEC supply chain partners, we find ourselves in a much better position now. We did exactly what we said we were going to do on the last call from June 1 to avoid any kind of near-term disruptions that are caused by COVID in China, we built in inventory, and that's why you see the inventory tick up. So we're not surprised. It's absolutely right on track with where we wanted to be.\n\nLonger term, we mentioned also that we're going to be working toward having geographic diversity. It's going to time, but we have made progress during the last quarter in starting and making progress with those discussions. Generally, I think we're in good shape from a supply chain partner perspective. Yeah.\n\nGenerally, I think we're in good shape from a supply chain partner perspective.\n\nVijay Rakesh -- Mizuho Securities -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Suji Desilva of ROTH. Your line is open.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nMaybe asking the cabling question a little differently for the customers that are going to ramp up. Should we expect pricing to trend similar to the initial customer or higher with more features? Just any indication there would be helpful along with the margin discussion you already gave us.\n\nBill Brennan -- President and Chief Executive Officer\n\nSure. That's a good question. I would say that not every one of the AECs that we're building is similar. And so as we develop AECs with -- that are built toward a different specification, there will be some variance in the ASPs.\n\nI would say right now, with the current AECs that we're shipping, I think there is opportunity for the ASPs to increase from that point. And it's really based on the type of AECs we'll be shipping, as well as, as we move toward increasing speed. The first products that we're shipping are really tethered to the passive cable market. And so there's a real perception that our AECs are a premium over these passive copper solutions.\n\nAnd so we've been a bit tethered in a sense when we're having the discussions when it relates to our 100 gig or 200 gig or 400 gig AECs. As we start looking at the future, 800 gig, passive copper cables will not be in the conversation. And so this is really where the solutions that are alternatives to ours. We're going to be in a much, much better position from a pricing and power standpoint.\n\nAnd so in a sense, we will be untethered at that point, and we expect that ASPs will naturally rise as a result. So I would say that near term, as we look at ramping our second customer, and we look at fiscal '24 in particular, that because the cable that we're building is a much more complex cable, the ASPs will be a bit higher. And so we'll see it trending up just based on the fact that we're shipping AECs that are more complex to build with a heavier cost content.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nThat's very helpful. Appreciate the detailed color there. And then maybe for Dan, on the five-nanometer four-nanometer products coming, can you give us a sense of the timing of when the R&D and capex mask costs might come in? And whether there will be a bump up there or whether that will be absorbed with the overall budget?\n\nDan Fleming -- Chief Financial Officer\n\nYeah. Much of that cost, of course, from a production asset perspective, becomes fixed assets for us. And so there will be a consumption of cash, but that's really FY '24 and beyond. We've got engineering tape-outs before that point in time.\n\nBut they're baked into our opex forecast, and they're not overly material from that perspective.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nOK. Thanks, guys.\n\nOperator\n\nThank you. Our next question comes from Matt Ramsay of Cowen. Your line is open.\n\nUnknown speaker\n\n[Inaudible] on behalf of Matt. Thanks for taking my question and congrats on the results. I wanted to ask about your data center exposure. There have been some well-documented delays in CPU upgrade cycles that have IO upgrades to DDR5.\n\nIs there any line that we should be drawing between your exposure and upgrade your customers to the CPU upgrades? Or is it sort of irrelevant at this standpoint?\n\nBill Brennan -- President and Chief Executive Officer\n\nGood question. I would say for the first customer that we've ramped with and that we continue to ramp with, there's really nothing on that front. These are our mix with 25 gig per lane connectivity. As we look at the next generation, there's a series of upgrades that will from a connectivity standpoint is really the way we view it.\n\nThey'll be moving to lanes of 50 gig per lane and then lanes of 100-gig per lane. And so we're not going to ship AECs until these new NICs and servers are shipping. And so there is some dependence there. And that's why we can't be too specific with the timing of the ramp.\n\nIt's really based on the best feedback that we're getting as our customers go through their next-generation development and planning on their deployments.\n\nUnknown speaker\n\nUnderstood. Thank you. That's very helpful. And then I know you mentioned that the IP license revenue has been running higher than the target 10% to 15%.\n\nHow should we, I guess, square that away with the sort of the flat gross margin guidance? Should we expect licensing to remain elevated near term? I don't know how the Tesla Dojo supercomputer is layering in or if there is a consumer piece in there, or is it just licensing is expected down next quarter, but it's going to be made up for by improving product margins as you scale? Thanks, guys.\n\nDan Fleming -- Chief Financial Officer\n\nYeah. Let me address that. So great question. IP, as Bill mentioned, is considered a very strategic part of our business.\n\nAnd one thing about the revenue recognition process when it comes to license revenue is it can vary quite a bit from quarter-to-quarter. So as you look at our quarter-over-quarter results, it's a little bit more challenging to figure out what that overall revenue mix is going to be, whereas over a full fiscal year, we have a high degree of confidence in the overall revenue mix that we see. So from that standpoint, you see our IP revenue went from about 30% of revenue in our Q4 to 22% in Q1. Long term, we said it will be 10% to 15%.\n\nSo over the course of the next few years, we'll get to that range, but there's going to be some variability from quarter to quarter as we get there. But hopefully, that's helpful.\n\nUnknown speaker\n\nThat is. Thank you, guys. I'll hop back in the queue.\n\nBill Brennan -- President and Chief Executive Officer\n\nOn our end, we're not hearing anything. There's some sort of difficulty.\n\nOperator\n\nMr. Svanberg, please make sure your phone isn't on mute.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nYes. Thank you. I didn't hear anything either. But I assume, yeah, this is Tore Svanberg from Stifel.\n\nSo I had a question on sort of your revenue mix. So obviously, you have a lot of greenfield opportunities, and you've got new businesses ramping. But we are obviously hearing selectively about some softness here and there, even on the data infrastructure side of things. So could you quantify for us how much of the business may be subject to softness on the data infrastructure side?\n\nBill Brennan -- President and Chief Executive Officer\n\nSure. It's a good question. The -- If we look at our end customer for Ethernet products, it's really data centers and supply chain partners of data centers, so networking OEMs and ODMs, as well as optical manufacturers. And so definitely, there is a high dependence on the data center market in general.\n\nFor us, near term, we are not going to be impacted as much by changes that happen within that group of players, really because we're ramping on new next-generation technology deployments that really deliver the necessary bandwidth increases that everybody has planned. And now we expect that our customers are going to ramp new technology as fast as they can. And because we're in an early stage in our company development, many of the programs that we ramp are really the first programs that we're ramping with a given customer. And so although they may decide to spend a little less or spend at a rate that's less than they had originally planned, what we see is ultimately large volume ramps, whether they're slightly down compared to what was planned.\n\nTo us, it gives us, as you said, a greenfield new ramp. So I don't expect near term for our business, meaning the next year, two years, that we're going to track with any kind of changes within our customer base since we're really on the new technology end of the spectrum.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nYeah. Thank you, Bill. That's a great perspective. My other question is on supply.\n\nYou did talk about some of the disruptions now being behind you. I know you're also working on further diversifying your supply chain. So I was hoping you could update us with a little bit more detail there? And when would you expect, especially on the AEC side to have a more diversified supplier?\n\nBill Brennan -- President and Chief Executive Officer\n\nGood question, good question. So we've been working very closely with two different partners, really over the past several years as we've pioneered this market. We are in production mainly with one of those suppliers now. And the second supplier will ramp really in the near term in the upcoming couple of quarters.\n\nSo we'll have nice diversity as we look at fiscal '24.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nGreat. Just one last question for Dan. Dan, you talked about some of the working capital dynamics and especially with the DSOs, that being higher than usual. But any read over the next few quarters, how the DSO will trend?\n\nDan Fleming -- Chief Financial Officer\n\nYeah, we would expect it to come down, certainly. As we mentioned, the timing of AR sometimes is a little bit out of our control. And as we have more customers ramping our AR, just specific invoices have become much larger, and we received one particular one, four days after the quarter ended. So when you start calculating balance sheet metrics, that actually has a significant impact on things.\n\nSo quarter over quarter, we're going to see fluctuations in these working capital items, including payables and some other accruals. But over the long term, it will smooth out and we expect DSOs, DPOs and even days of inventory will normalize over the next year or so.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nSounds good. Congrats on the result. Thank you.\n\nDan Fleming -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Trevor Janoskie of Needham & Company. Your line is open.\n\nTrevor Janoskie -- Needham and Company -- Analyst\n\nYeah. Hi. This is Trevor on for Quinn Bolton, and thanks for taking my question. I'm wondering, have you seen any competitors begin designing solutions that could compete with your AEC opportunities at the first and second hyperscale customers? Or do you see Credo as the sole supplier through fiscal '24?\n\nBill Brennan -- President and Chief Executive Officer\n\nGood question. And so for sure, we've seen competitors beginning to make investments in this space. And I think that's a great indicator that at an end customer perspective that it's of high priority, and that's why anybody would start investing in a new business, really based on customer driven demand. We haven't really seen competitors begin to deliver products that we would see in the field.\n\nBut we know that there are several companies that are making large investments. So we feel comfortable with where we are competitively. And I think that as it relates to the first couple of ramps that we'll go through, we never take anything for granted. I'm never going to say that our customer base is comfortable with a single supplier, just like we would be uncomfortable in that same situation.\n\nAnd so I will say that from the standpoint of the demand forecast that we've got, I feel very confident in the demand forecast. And in the near term, I think we expect it to be quite predictable.\n\nTrevor Janoskie -- Needham and Company -- Analyst\n\nThank you. And in your comments, you mentioned being in the middle innings of the ramp with that large customer. Does that mean that your large customer is still providing order forecast that extend past 12 months? Or has that visibility come in at all?\n\nBill Brennan -- President and Chief Executive Officer\n\nYeah. Our relationship with the first customer is one where they frequently give us a 12-month outlook. And I can say that for the 12-month outlook, I think everything makes sense. And every time we get extended another month to date, there's been no surprises.\n\nSo our expectation is that this program is going to run through calendar '23 and into '24. But we're well-positioned for the next-generation programs, as well as they would maybe ramp down that given technology deployment and ramp into the next-generation one. So that's really the goal that our team has in working with this customer, as well as every other customer that we're engaged with.\n\nTrevor Janoskie -- Needham and Company -- Analyst\n\nAwesome. Thank you.\n\nOperator\n\nThank you. Our next question [Technical difficulty] of Craig Hallum. Your line is open.\n\nUnknown speaker\n\nHey guys, thanks for taking my question. A quick follow-up from an earlier question regarding supply diversification on AEC. Is this a diversification by supplier? Is it also diversified by geography, meaning out of the, I think, the Shanghai area or you've been out of China?\n\nBill Brennan -- President and Chief Executive Officer\n\nGood question. The diversification that we'll see near term is with supply partners. So we'll go from having one in production, having two in production. Geographically, that will come a bit later.\n\nThat will be later in calendar '23. So just as expected, we're right on track. So both suppliers will be building in China short term, and then we'll look to build diversity geographically following that.\n\nUnknown speaker\n\nOK. Perfect. Thank you for that, Bill. My follow-up question is on AECs.\n\nCan you guys talk about the applications and the specific products you're referring to? I know that with the first partner. I think at least the first two are NIC two TOR, and I think maybe your second customer is also a similar approach here. Are you seeing any expansion into your other AEC categories like the switch or the span or anything like that? So when do we start to see that happening?\n\nBill Brennan -- President and Chief Executive Officer\n\nSure. You're right that the first two customers that we've talked about, these are both server rack or NIC two TOR applications. We do also see customers that are looking to adopt our AECs for the switching and routing layer as well. And these are primarily 400 gig.\n\nBut as we look at 800 gig or 100 gig per lane, I think it's going to be quite common for those customers that choose to go with disaggregated switch racks. But I think near term, say, this year and next fiscal year, predominantly we'll be shipping AECs that are in a server rack application.\n\nUnknown speaker\n\nOK. Perfect. That's a great detail, and that's all for me, Bill. Thank you.\n\nOperator\n\nThank you. [Operator signoff]\n\nBill Brennan -- President and Chief Executive Officer\n\nThank you.\n\nDuration: 0 minutes\n\nDan O'Neil -- Vice President Corporate Development and Investor Relations\n\nBill Brennan -- President and Chief Executive Officer\n\nDan Fleming -- Chief Financial Officer\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nVijay Rakesh -- Mizuho Securities -- Analyst\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nUnknown speaker\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nTrevor Janoskie -- Needham and Company -- Analyst\n\nMore CRDO analysis\n\nAll earnings call transcripts"
}