{
  "companyName": "Match Group",
  "companyTicker": "MTCH",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/match-group-mtch-q3-2022-earnings-call-transcript/",
  "content": "Match Group (MTCH 0.97%)\nQ3 2022 Earnings Call\nNov 02, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and welcome to the Match Group third quarter 2022 earnings conference call. All participants are in a listen-only mode. [Operator instructions] Please note this event is being recorded. I like to turn the conference over to Tanny Shelburn, SVP of investor relations.\n\nPlease, go ahead.\n\nTanny Shelburne -- Senior Vice President, Investor Relations\n\nThank you, operator, and good morning, everyone. Today's call will be led by CEO, Bernard Kim; and CFO and COO, Gary Swidler. They'll make a few brief remarks and then we'll open it up for questions. Before we start, I need to remind everyone that during this call we may discuss our outlook and future performance.\n\nThese forward-looking statements may be preceded by words such as we expect, we believe, we anticipate, or similar statements. These statements are subject to risks and uncertainties, and our actual results could differ materially from the views expressed today. Some of these risks have been set forth in our earnings release and our periodic reports filed with the SEC. With that, I'd like to turn the call over to BK.\n\nBernard Kim -- Chief Executive Officer\n\nThanks, Tanny. Good morning, everyone, and thank you for joining today's call. I'm delighted to be on our second earnings call at the company. The time has flown by and I attribute that to the team coming together, making decisive calls, and taking real action to accelerate momentum.\n\nAs our third quarter results demonstrate, we have a lot to be proud of. When you exclude FX impact, we saw double-digit growth. There is still a lot of work to do. And while the macroeconomic environment is proving more challenging, we have a great team and an excellent portfolio of brands.\n\nThat makes me optimistic that we can create significant long-term shareholder value. After just a few months, the team at Tinder is gelling well together and there has been a palpable change in the culture. We have made some big changes to improve organizational efficiencies and operations to get the team shipping product and accelerating growth. Some examples of this are bringing the revenue and product teams together, so they're collaborating and supporting one another as one team in our shared mission.\n\nThe marketing team is also working with and challenging the product teams to ensure that we're building features that users can get excited about. Whenever reorganizations occur, there's always a risk of attrition. But with this new team in place, we haven't seen any, that's promising. We aren't dealing with massive disruption.\n\nInstead, we are getting more products into testing, working together to eventually return Tinder to previous growth levels. That won't happen overnight, but we are moving in the right direction. I am excited about how our 2023 roadmap is beginning to take shape, which centers on four key areas, providing our women users more tailored experiences targeting Gen Z through various product initiatives, evaluating virtual goods and coins to unlock untapped power users, and finally creating more targeted monetization opportunities, including an expanded focus on users who have not previously paid. Additionally, we have let the market tell the brand narrative about Tinder for too long.\n\nWe recognize that a powerful Tinder narrative is a critical component to accelerating growth again. Going forward, we are working to activate levers across global marketing brand campaigns to bring to life the endless Tinder success stories over the past 10 years. The marketing team is working hand in hand with products to redefine the narrative for the next generation of singles. While it will take some time to see measurable changes overall, I fully believe in the team's ability to experiment, learn, build, and ultimately deliver the best dating experiences for our users.\n\nTinder has transformed the dating category over the last 10 years, and I am committed to making the next 10 even more exciting. Our search for a full-time CEO at Tinder is ongoing. We've met a broad set of talented and diverse leaders with a deep bench of consumer digital experience. I'm leading the charge on the search.\n\nBut it's worth pointing out that we've already done a lot of the hard work that a new CEO typically has to do, like establishing the leadership team, making the organization more nimble, and increasing collaboration. It is critically important to me that this new leader can seamlessly move into the role and work with the current team with minimal disruption, with a focus on growth and profitability. This is a role that I want to be very deliberate about. So in the meantime, I will remain interim CEO.\n\nThe business plans are moving forward and I'm expecting execution and performance will continue to improve over the next coming months. Hinge continued to be a bright spot this quarter. They are delivering on their localization strategy to grow users and market share globally with a successful launch in Germany and reaching new markets throughout Europe. In October, Hinge hit record downloads in both the US and globally.\n\nIn the US, where Hinge has quickly become the third most popular dating app by downloads. The brand continues to innovate the product experience. After the successful launch of audio prompts last year, the team was quick to roll out video prompts and prompt polls, giving daters more ways to express themselves and hopefully land a date. Later this month, Hinge will start testing a new premium subscription tier.\n\nWe have decided to hold back the full launch of the new tier until Q1, the peak season for dating. I'm really excited about how it's coming together and I'm confident that it will resonate with the user base and provide an opportunity to drive RPP meaningfully higher. As a company, we have achieved a lot in a short amount of time. We have worked diligently to right the ship at Tinder, pushed forward with our growth plans at Hinge, and have continued to navigate the current challenging operating environment.\n\nAt the same time, there is a significant amount of work to be done and innovations to be built that will further accelerate our growth. We are currently in the middle of our planning process for 2023 across the portfolio and I look forward to sharing more during our next earnings call. One thing I did want to call out as I've spent more time with the business, is that we have different brands in different stages of growth given the current macro environment. We must focus our investment on brands that are growing and pull back in areas that are not driving growth.\n\nThis has become a strategic and imperative for us in 2023. I'll be able to share more on this strategy after we complete our strategic plans for next year. Our world has never been more connected and I'm so proud that we are continuing to deliver on our company's mission of connecting millions of people around the world in meaningful ways. As I've told everyone before, I'm passionate about people, culture, and products and look forward to improving the overall user experience across the portfolio with our talented group of technologists around the world.\n\nAnd with that, I'll turn it over to Gary.\n\nGary Swidler -- Chief Financial Officer and Chief Operating Officer\n\nThanks, BK. And hello again, everyone. In a tough environment, we had a solid Q3 with total revenue of $810 million, up 1% year over year. The FX headwinds were severe once again as our revenue would have been $883 million, up 10% year over year on an FX-neutral basis.\n\nThe FX impact was $8 million worse than we expected when we provided our Q3 outlook on our August earnings call. Our Direct revenue also grew 1% year over year. It grew 5% year over year in the Americas with growth at Tinder, Hinge, BLK, and Chispa, but declines the established brands. Direct revenue declined 1% year over year in Europe, but was up 15% on an FX-neutral basis, driven by Tinder and Hinge.\n\nDirect revenue declined 5% in APAC and others but was up 16% on an FX-neutral basis driven by Tinder. Total payers were 16.5 million, an increase of 2% from the prior-year quarter. Payers were down 1% year over year in each of the Americas and Europe and up 12% in APAC, and others. Tinder payer additions came in stronger than we had expected while our established brands, including Match, Meetic, OkCupid, and Plenty of Fish saw year-over-year payer declines of over 15% in aggregate.\n\nRPP is flat year over year at $16.02 in Q3. RPP was up 6% in the Americas, a one-point sequential improvement reflecting higher average rates for subscriptions and increased average a la carte purchases per payer at Tinder and Hinge. RPP was flat year over year in Europe, where contributions from Tinder and Hyperconnect were offset by the strength of the US dollar compared to the euro and the British pound. RPP was down 14% in APAC and others, due to the strength of the dollar relative to the yen and the Turkish lira.\n\nOn an FX-neutral basis, RPP was up 9% companywide again in Q3, up 16% in Europe and 4% in APAC, and others. Tinder performed slightly above our expectations in the quarter, delivering direct revenue of $460 million, up 6% year over year, and 16% on an FX-neutral basis. Tinder had payers growth of 7% year over year, adding 700,000 payers to 11.1 million, and a 1% RPP decline year over year in the quarter, which again shows the impact of FX. Tinder RPP is up 8% on an FX-neutral basis.\n\nRecall that Tinder made several beneficial payrolls and other optimizations in Q3 '21, which drove record sequential payer additions and strong revenue in that quarter. We're now facing that challenging comp. All other brands' Direct revenue was down 5% year over year in Q3, driven by an 8% payer decline and 3% RPP growth, Hinge, BLK, and Chispa continued to drive the growth. We continue to pull back on marketing spending for some of our established brands and Plenty of Fish in particular continues to be impacted by macroeconomic conditions.\n\nIn Asia, Hyperconnect as our app revenue was down 7% year over year. However, on an FX-neutral basis, it was up more than 10% due to the strength of the US dollar against the Turkish lira and the Japanese yen. Hakuna continues to face challenges, with revenue down low double digits, year over year. Payers continued to be affected by market softness in Japan, with only a slight year-over-year increase in revenue, but down more than 15% as reported.\n\nIndirect revenue was $14 million in the quarter flat to Q2 but down 11% year over year. Operating income was $211 million in Q3, with margins of 26%. Adjusted operating income was flat year over year at $284 million, representing a margin of 35%. Overall expenses, including SBC expenses, grew 3% year over year in Q3.\n\nCost of revenue grew 6% year over year, primarily due to higher app store fees, including the $8 million placed into the escrow for the Google litigation. Cost of revenue represented 31% of total revenue, up two points year over year. Selling and marketing spending decreased by $24 million or 16% year over year. The second consecutive quarter where we've seen a year-over-year reduction as we continued to reduce marketing spending at our more established brands and to show ROI discipline overall.\n\nSelling and marketing spending was down three points year over year as a percentage of total revenue to 16%. G&A expenses rose $11 million or 10% year over year. G&A comprised 14% of revenue, up one point from the prior year's quarter. The increase in G&A expenses reflects lower legal fees, but higher compensation and headcount expenses, as well as an increase in travel expenses of $4 million.\n\nAs we continue to return to a more normal cadence of business travel. Product development costs grew 31% year over year and were 11% of revenue As we increased headcount, particularly at Tinder and Hinge. Our gross leverage was 3.5 times the trailing adjusted operating income, and our net leverage was 3.1 times at the end of Q3. We ended the quarter with $398 million of cash, cash equivalents, and short-term investments on hand.\n\nWe deployed $267 million in the first month of Q3 to buy back 4.3 million of our shares at a VWAP of approximately $63 per share on a trade date basis. While the stock continued, declined significantly after we deployed our buyback. We believe our stock repurchase represents a sound long-term investment. We currently have 5.3 million shares remaining under our buyback authorization.\n\nFor Q4, we expect total revenue for Match Group of $780 million to $790 million. We anticipate nearly $70 million of year-over-year FX headwinds in Q4, meaning a total revenue growth would be nearly nine points higher on an FX-neutral basis. This FX headwind is $14 million more than we anticipated at the time of our last earnings call. We expect Tinder's Q4 Direct revenue to be relatively flat year over year, up high single digits on an FX-neutral basis with mid-single digit payers' growth, as ALC softness due to weak macroeconomic conditions impacts payers.\n\nWe plan to adjust some of our merchandising tactics to help offset this. Historically, we've primarily offered large high-cost bundles of ALC features, for example, $30 bundles of super likes which had been quite successful. In the current environment, we're adjusting our merchandising to emphasize smaller, lower-priced bundles to our users who see value in these ALC features but are now more price sensitive. For all other brands, Direct revenue is expected to be down mid-single digits, but up low single digits on an FX-neutral basis.\n\nWe expect Hinge, BLK, and Chispa will continue to drive the growth, helping offset declines at the established brands as well as at payers and Hyperconnect due to FX. We expect Indirect revenue to be down about 20% year over year given the pressures we're seeing building in the ad sales market. We expect adjusted operating income of $270 million to $275 million in Q4, representing margins of about 35% at the midpoint of the ranges. In Q4, we plan to increase marketing spending at Hinge, both in the US, where we see terrific momentum, as well as in its international expansion markets as per its plan.\n\nWe also expect to spend up slightly at Tinder and to launch a new brand marketing campaign at our Match brand. Given the lower spending at our other brands. We expect meaningfully lower year-over-year aggregate selling and marketing spend again in Q4. While visibility into 2023 is challenging.\n\nWe're focused on delivering 5% to 10% year-over-year revenue growth in 2023. We believe Tinder is positioned to deliver a similar range of growth. This equates to total revenue up high single digits to low double digits on an FX-neutral basis, as we expect FX to be about a three-point drag in 2023. We anticipate that emerging brands such as Hinge, Chispa, and BLK will deliver sufficient growth to offset the declines at the established brands.\n\nWe expect Hinge to deliver at least $100 million of incremental revenue in 2023. We expect the company as a whole to have to accelerate year-over-year revenue growth as we move through 2023, driven by improved product execution leading to improved revenue momentum at Tinder. The 5% to 10% topline range reflects three key variables. One, the quality of product execution and the timing/success of initiatives at Tinder.\n\nIf Tinder executes well, growth will be on the higher end of the range. Two, the strength of the contribution from international expansion and the new premium tier at Hinge. And three, macroeconomic impacts, particularly on lower-income consumers and especially on a la carte purchases primarily at Tinder. On the AOI side, we're still calibrating spending levels and the investments that we want to make in 2023.\n\nWe expect incremental sales and marketing spending at Hinge to support its global user growth, including in its expansion across Europe. Despite the investment we expect hinge to maintain AOI margins of 30% plus. We expect to spend incremental marketing at Tinder to support its product enhancements and drive user growth. Even with that, we're confident Tinder can continue to achieve AOI margins in the 50% range.\n\nWe also intend to invest in The League, which we acquired earlier this year and believe has solid growth potential. We plan to invest in incubating a couple of new apps, which we're confident can better serve certain demographic groups than the existing offerings. To enable us to make the investments in our growth businesses. We plan to reduce operating expenses in other areas of the company to ensure that we can deliver at least flat year-over-year margins in 2023.\n\nThis assumes no change to current app store policies. We believe our business continues to achieve profitability and cash flow generation that has few parallels in consumer tech. We've always been conscious of delivering profitability and cash flow, but in the current operating environment, our focus on these items is being sharpened significantly. Our job for the coming year is to invest wisely in select growth opportunities and to manage costs judiciously elsewhere and our team is up to the task.\n\nWith that, I'll ask the operator to open the line for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Deepak Mathivanan with Wolfe Research. Please, go ahead.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nGreat. Thanks for taking the question. So I just wanted to ask a little bit more about the weakness in a la carte. Is this impact more acute in certain markets, given the macro headwinds have been relatively somewhat different in various regions, or is it more broad-based? Can you also provide a little bit of additional context on some of the brands that are experiencing it? Thank you so much.\n\nBernard Kim -- Chief Executive Officer\n\nThanks for the question, Deepak. I want to start off by saying ALC purchases from our power users still remain very strong and we're seeing strong subscriptions and they remain very sticky. The main impact that we're seeing is from impulse and occasional buyers, as they tend to be more price sensitive and they're impacted more by macroeconomic factors. As Gary pointed out, we've historically marketed our ALC products in large bundles and that has led to significant purchases of these large bundles.\n\nTherefore, we're moving quickly and we're adjusting our ALC merchandizing to emphasize smaller bundles to more price-sensitive customers. The customers that are most affected are younger users with less discretionary income, but we don't see a difference across geographies. This is a reminder that conditions are ever-changing. The macroeconomic environment is uncertain, and we have to be nimble and be able to react to our consumers throughout the year.\n\nI am impressed by the speed at which Tinder can diagnose and react to these types of effects. The Tinder team is actively working on mitigating this as much as possible. But I expect this is going to take some time and iteration.\n\nOperator\n\nOur next question comes from James Heaney with Jefferies. Please, go ahead.\n\nJames Heaney -- Jefferies -- Analyst\n\nThanks, guys. I have a couple of questions on Tinder. What drove the upside to revenue growth versus your expectations in Q3? And then for Q4, it sounds like you have a lot of pretty strong momentum behind Tinder. You're going to increase marketing spend launching a slate of new products.\n\nCurious then why you're expecting more of a deceleration in Q4. Thank you.\n\nGary Swidler -- Chief Financial Officer and Chief Operating Officer\n\nSure. Why don't I go ahead and take that? I think when you look at our Q3, we provided a pretty conservative outlook for the quarter, in part because of all the disruption that was going on at Tinder. We weren't sure exactly how things were going to react to all the changes that we made. And so we wanted to be a little bit conservative in the Q3 outlook and I think that led to the improvement versus expectations.\n\nIn Q4, though, we're seeing a pretty significant deterioration in trends even over the last few weeks. We think the macro environment has gotten much more challenging and we're nervous about it for Q4 and going forward. And so as a result of that, our outlook for Q4 is perhaps lower than you would have thought because we think the caution is warranted given the change in trends and the weakness in the overall macro environment, which, as BK just said, is really affecting Tinder on the a la carte side, as users, especially younger users have less discretionary income, are being a little bit more cautious in their purchasing. And we think that effect is going to linger for a period of time.\n\nWe are taking actions to offset that and I think some of those will help offset the effects of it. But it is going to take some time for that to work its way through as well. The other thing I would point out is that we have less product momentum going into Q4 than we typically have and certainly more than we did last year when we had very successful Q3 product adjustments that led to solid momentum in Q4. And remember, product work in the previous quarter or the previous two quarters gives us momentum into the next quarter.\n\nSo we don't have the momentum we'd like to see or that we typically have leading into Q4. But it is building as the Tinder team makes more progress and implants new things. And so we think that that momentum will build and that gives us optimism that as the team continues to execute the way they need to execute, we'll start to see some improved momentum into 2023. Next Question, please.\n\nOperator\n\nOur next question comes from --\n\nGary Swidler -- Chief Financial Officer and Chief Operating Officer\n\nGo ahead, please.\n\nOperator\n\nOur next question comes from Mark Kelley with Stifel. Please, go ahead.\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks very much. Good morning, everyone. I want to ask, too.\n\nThe first one is the letter mentions an expanded advertising component of Tinder. Is that an area of focus again? And I guess what's the right way for us to think about advertising as a percentage of the business over time? And then second, the letter sounded like you're a bit more optimistic on virtual goods and currencies, maybe relative to when you joined, BK? Am I reading a little bit too much into that? And if not, I guess, what has changed? Thanks.\n\nBernard Kim -- Chief Executive Officer\n\nThanks, Mark, for the questions. Let me take your second question first about virtual goods. So to clarify, I always thought that virtual goods and currencies made sense in the Tinder ecosystem and are a big opportunity. But we want to do this right.\n\nAnd to do this, we have to build virtual goods and then create the demand. After that, you can create a coin economy to purchase those goods. I ask the teams to rethink that roadmap and delay the launch into next year. They've been working on it.\n\nI'm excited because the Tinder CPO has great experience in building these types of economies. I'm really excited to see this roll out in 2023. And then to your question about advertising. Over the last five years, advertising has been a modest focus at Tinder.\n\nBut the reality is over 85% of our users don't pay us anything. In my previous history, I've seen real success in monetizing users that don't pay. So I've asked the team to embrace advertising monetization culturally. I think there's a real opportunity to implement proven ideas from games that I've utilized in the past.\n\nFor example, rewarded video. I think over time I would like to see us get to $100 million in advertising revenue, which is about double the revenue that we have today. Thanks so much for the questions.\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from Shweta Khajuria with Evercore ISI. Please, go ahead.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thanks a lot for taking my question. I have a -- I have one on Hinge's premium tier. So could you please talk about the launch? You mentioned Q1 of next year, but is that globally for the entire rollout? And how should we think about your goal for how many peers you may be targeting with that tier? Thank you.\n\nBernard Kim -- Chief Executive Officer\n\nThanks, Shweta, for the great question. We'll start testing Hinge's new subscription later this quarter and will begin rolling it out globally after the new year. We believe that this can drive good conversion and strong RPP. Our outlook for 2023 has assumed a relatively modest take on the new tier.\n\nWe think it's more comparable to Tinder platinum than Tinder gold, but we'll know a lot more after we begin testing later this month. Given the delay of the full rollout of this offering and FX headwinds, especially in the UK, we do expect Hinge to fall about $15 million short of its revenue goal this year. But we like subscription monetization opportunities with Hinge -- with the Hinge user base. As with any big changes to tiers, we'll continue to optimize the offering throughout 2023.\n\nSo we're really excited about that.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nThanks, BK.\n\nOperator\n\nOur next question comes from Cory Carpenter with JPMorgan. Please go ahead.\n\nCory Carpenter -- JPMorgan Chase and Company -- Analyst\n\nHey, thanks for the question. Just giving a lot of moving parts with Japan and Hyperconnect, hoping you could talk about your expectations and your assumptions for the APAC region next year. Thank you.\n\nGary Swidler -- Chief Financial Officer and Chief Operating Officer\n\nLet me take that. Cory, thanks for the question. You're right, our outlook as it relates to APAC businesses next year is a bit challenging just given all the moving parts, as you say. And so in Japan, what we've assumed is really no material change in the trends that we're seeing in the Japanese market next year.\n\nI'm hopeful we can do a little bit better than that and start to see some recovery, but we're not really seeing that yet. And so we've assumed that the conditions largely stay the same next year, which basically means we think that our payers' business can achieve some modest improvement in revenue next year. But probably going on an FX -- on a US dollar basis, it's probably going to be down year over year. So modestly up in local currency but down on a dollar basis.\n\nAnd I think that business can probably achieve something in the neighborhood of 25% margins. So a reasonably profitable business, but the growth trajectory has really changed and I'm hopeful that will change for the better leading into the future. Hyperconnect has a couple of moving parts as well. The Azar business is very encouraging, as we showed in the letter and we've talked about.\n\nWe feel good about that and I think we will continue to see some reasonable level of growth from the Azar business. Hyperconnect -- sorry, Hakuna at Hyperconnect is more challenged and we're assuming a little bit of improvement in that business next year compared to this year, but not dramatically so. And so when you put that all together, I think that Hyperconnect overall will show some modest level of revenue growth next year in local currency. But again, when your FX effect it, I think we will be down on a US dollar basis.\n\nSo that's what we're planning for. So there are some headwinds from a dollar perspective both on the Japanese business of pairs and on the Hyperconnect businesses. I think Azar and Hakuna together can probably do about a 10% adjusted operating income margin. We're going to be disciplined on marketing spend and headcount there to try to drive improving margins.\n\nAnd we've got to keep driving margins up in that business. And that is something that our new team there working with our existing CEO, Sam Ahn is very focused on.\n\nOperator\n\nOur next question comes from Justin Patterson with KeyBanc. Please, go ahead.\n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nGreat. Thank you. Try a multi-parter on Tinder marketing. BK, could you talk about how you see this tighter integration between marketing and product teams influencing the growth of Tinder ahead? It sounds pretty similar to your bold beat strategy over at Zynga.\n\nAnd then for Gary, appreciate the details you gave on Tinder margin still being best-in-class at around 50%. Could you talk a little bit more about just the puts and takes on whether this is kind of a temporary or permanent shift in marketing spending? And what kind of assumptions are to maintain those best-in-class margins? Thank you.\n\nBernard Kim -- Chief Executive Officer\n\nThank you, Justin. Great question. I'll try to answer this question on my own. We love the questions around marketing.\n\nSo traditionally, Tinder has not spent much on marketing. They've always spent about less than 10% of revenue. And we don't see that changing. Thankfully, Tinder is not reliant on marketing to grow the business.\n\nHowever, this is a 10-year-old brand, and especially with younger users who are new to the category, we haven't taken the opportunity to establish our narrative. I believe that Tinder, which is a category leader, has been too quiet in the market for too long. In 2023, we're going to increase marketing spending to establish a stronger brand narrative. But to answer your question, it's still going to be below 10% of revenue.\n\nWith our new CMO, we see great opportunities to get the brand message out there in a creative manner and market. Some of our newer product features that we have planned for next year. These two together should help accelerate user growth at Tinder and even -- once again, even with incremental marketing spend, we expect Tinder margins in 2023 to be in the 50% range, as they always have been. Thanks for the question.\n\nOperator\n\nOur next question comes from Youssef Squali with Truist. Please, go ahead.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nGreat. Thank you very much. And guys, thanks for sharing the initial outlook for 2023. We understand how challenging visibility is at this point, but still I appreciate it.\n\nSo maybe just a follow-up to the last question about marketing, since BK like marketing questions. So if I understand it correctly, and this is a question about 2023, it seems like Tinder, Hinge in Match will see an increase in marketing spending while all the other brands would be down. I guess the question is, is this a temporary strategy to weather the macro environment in 2023? Or do you see this more as a permanent pivot, a permanent shift in your strategy going forward? And maybe just a quick one. You guys talked about how Hinge should contribute at least an additional $100 million dollars in 2023.\n\nWhat do you expect that business to contribute in 2022 just to have that base to work off of? Thank you.\n\nGary Swidler -- Chief Financial Officer and Chief Operating Officer\n\nLet me take the Hinge question first. I think BK, mentioned that Hinge is probably about $15 million behind the goal for the year. Mostly because of FX. It's got a big UK business in particular, and it's feeling the impact of FX, especially on the pound.\n\nAnd so, we had targeted $300 million I think will probably fall about $50 million short of that. So let's call it $285 million, or so for the year. And then we said we think we can deliver at least $100 million of incremental revenue next year so that you can add that together. Obviously, the $100 million depends really on the success of the international expansion, but more importantly on the success and take rate around the new pricing tier, the new premium tier.\n\nAnd so that's really the thing that we don't know. We've made some, reasonable estimates on what we think are going to happen with that tier, but we'll know a lot more in a few weeks or certainly by the end of the year as we're planning to start testing the middle of this month. And so by the end of this year, we'll have a much better sense. And so when we get back together again in February, we'll be able to give you some updates on that tier as well as on the overall outlook for Hinge revenue growth next year.\n\nThat was one piece of your question. I also just want to comment on the 2023 outlook, just since you raised it, which is, by necessity, we wanted to provide an outlook for next year, as we often do on this call. But this year that is particularly challenging because there are so many moving pieces both in our business and from a macro perspective. And so, we don't really know what the macro environment is going to be through next year, what's going to happen from rates and recession and all the things that well.\n\nSo we've tried to make our best guess at that. But clearly, we'll have to see how things play out in the coming months to get a better sense of what 2023 looks like. But I'm sitting here today making our best guess on what economic conditions are going to be for next year. We're confident in that 5% to 10% growth for the overall company as well as at Tinder on the revenue side.\n\nSo I just wanted to kind of mention some of that so everyone understands how we've approached providing an outlook for next year at this point, given all the various crosswinds. And then, on the last question about the marketing spending, you are right to assume that we're going to see marketing spending increases next year at Tinder for the reasons that BK. explained about wanting to make sure we establish the brand narrative better than we have in the past, as well as at Hinge, which we've talked about extensively. And that's really two things.\n\nOne is to keep supporting its really strong and impressive user growth in the English-speaking markets, the US, and the UK in particular, as well as continuing to build around the world where there's a lot of momentum. Things are going well more than according to plan. And we feel great about our international expansion opportunity at Hinge, and we want to keep investing in that. So those are the places where we are clearly investing meaningful dollars on the marketing side.\n\nI do want to correct you said you thought there would be an increase in marketing spend at our Match brand next year, I don't think that's going to be the case. There is going to be an increase in our marketing spend at the Match brand in Q4 of this year, but that's because we have a discrete new brand campaign that we're launching. So there will be a year-over-year increase in Q4 of this year at Match, but we're not planning for that next year. In fact, we expect marketing spending at all of these established brands, including Match to be down in 2023 over 2022.\n\nAnd we're using that to offset the investments we're making at the Hinge brand and at the Tinder brand. I would also say that our approach to marketing spending and how we're thinking about our strategy around that is not about weathering the current macroeconomic environment and it's also not a permanent strategy. It's really a plan for targeted spending increases to achieve our strategic goals. So our strategic goals are at Hinge to grow the business internationally, and that's why we're investing.\n\nOur strategic goals at Tinder are to establish the brand narrative and take back some of the brand narratives and make some more noise in the market. And we're planning to do that with increased marketing spending next year, and then we'll sort of go from there. We're nimble and marketing spend, and we will continue to spend where we think it makes sense, and pull back where we think it doesn't make sense. A couple of other areas I would point to where we think we will spend up next year.\n\nOne would be The League which we recently acquired, and we think there's a significant opportunity for growth of The League and we plan to invest in that business. On the marketing side, we're excited about the opportunities there. And then second is some new apps that we're thinking about incubating. We think there are some markets where the demographics are underserved and we can build some apps that really satisfy those demographics better than the current offerings.\n\nAnd we do that user growth will be a priority. Driving user growth and marketing will be a component of that strategy in 2023 once we incubate the new app. So we expect to spend up to the extent we incubate some new apps, which is in our plan for 2023. And then, I would just add that philosophically, we're maintaining strict ROI discipline on our marketing spending, as we always do, but especially in a tougher environment.\n\nAnd we believe that all of our brands and our marketing spend are meeting or exceeding our ROI threshold. So that is a lens we're going to continue to apply very, very carefully, especially in a challenging environment. We're hopeful that if the economy does soften, we will see some relief in terms of what has been an expensive and competitive marketing environment, but we have not seen that yet. I think it's logical to think it's coming given all the headwinds in the economy.\n\nBut if we do see that, we would look to capitalize on that as well. So hopefully that answers the different parts of your questions. And thank you for your questions.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nYeah, excellent. Very thorough. Thanks, Gary.\n\nOperator\n\nOur next question comes from John Blackledge with Cowen. Please, go ahead.\n\nJohn Blackledge -- Cowen and Company -- Analyst\n\nGreat. Thanks. Could you provide some more color on Hinge's international expansion efforts, kind of what you're seeing? And then can you talk about, kind of upcoming market launches in the fourth quarter and in 2023? Thank you.\n\nBernard Kim -- Chief Executive Officer\n\nThanks, John, for the great question. We have a lot of exciting things that are happening at Hinge right now. We've confirmed two things. The product has appeal beyond English-speaking markets and our marketing and localization tactics are working well.\n\nHinge has found a great fit for singles that are in English markets and now -- in English-speaking markets. And now it's clear that the product resonates in other international markets also. The team is really innovative and laser-focused on getting people on great dates. So it shouldn't be a huge surprise that it's growing so well.\n\nThe launch in Germany and Sweden has been really great to watch and we're rolling out localized versions in France, Italy, and Spain this quarter as well. We'll start marketing in those countries in 2023, and we expect Hinge to keep growing across Europe next year. We still have a lot more countries to go to and will continue to roll out new markets which should drive growth for Hinge over the next few years.\n\nJohn Blackledge -- Cowen and Company -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Lauren Schenk with Morgan Stanley. Please, go ahead.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nGreat. Thanks. BK you mentioned in the letter you're seeing some promise, some early Tinder results, just hoping you could maybe elaborate and share a few examples there. And then there's is there a timeline that we should be thinking about in terms of announcing the new Tinder CEO? And then, Gary, you just had one quick follow-up, if I can, on your comments about seeing some deterioration over the last few weeks.\n\nDoes that fourth quarter guide assume that that level of softness continues for the rest of the quarter? And is that softness broad-based? And just on a la carte spending in payers? Thanks.\n\nBernard Kim -- Chief Executive Officer\n\nSo thanks for the questions. I'll handle the first part. And Gary, you can jump in on the back end on the second question. So the team is working really well together and we're shipping products out faster.\n\nWe gave them a goal to launch weekly subscriptions, boost optimizations, and relationship intent in Q3, and they accomplished all of that. Now we're in the process of crystallizing our product plans for 2023. I'm happy with how that's going and we'll have more specifics to share in our next earnings call. But I do expect to name a CEO at Tinder.\n\nWe have a really strong leadership team in place, and I want to make sure that the new CEO is going to work really well with each of them. We're looking for someone with deep consumer product expertise who can hit the ground running and further galvanize the team around a long-term vision. It's important for us to find someone that will be on Tinder for a long time. So we want to spend the right amount of time doing the diligence and finding the right leader.\n\nIn the meantime, I'm happy to stay as interim CEO. Gary, do you want to handle the second part?\n\nGary Swidler -- Chief Financial Officer and Chief Operating Officer\n\nYeah, obviously we're partway through the quarter and Q4, so visibility into Q4 is a lot easier than visibility into 2023. And we have seen deterioration in the last few weeks. It's primarily -- it's not broad-based. It's primarily on a la carte at Tinder.\n\nIt is existing in some other pockets like our Plenty of Fish business as well. And look, it's hard to tell exactly how much macro weakness we're seeing across the portfolio. But the thing that we're particularly focused on is the weakness on the ALC side at Tinder. I think we've made some reasonable assumptions based on what we're seeing for Q4 that give me confidence in the range that we provided for Q4.\n\nObviously, I don't know how much things are going to deteriorate or not in 2023. And so that's what makes guiding for 2023 more challenging. But right now, the trends that we see, do indicate some consumer weakness. And we have factored that in at least into our Q4 outlook.\n\nAnd we've tried to make some best guesses around it for 2023 as a whole as well.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nVery helpful. Thank you.\n\nOperator\n\nOur next question comes from Alexandra Steiger with Goldman Sachs. Please, go ahead.\n\nAlexandra Steiger -- Goldman Sachs -- Analyst\n\nThank you very much. I wanted to follow up on Q4 and '23 margins. So given the guidance for slower top-line growth at Tinder and your comments around increased marketing investments versus some targeted cost reduction efforts, how should we think about the cadence of adjusted operating income margins from here and over the next few quarters given the timing of these initiatives? Thank you.\n\nGary Swidler -- Chief Financial Officer and Chief Operating Officer\n\nThanks, Alexandra. So, you're right. And I said it before, we're investing marketing dollars in the businesses where we see growth opportunities, Tinder Hinge, The League, etc., and we're offsetting those with reductions in the more established brands. The net result of that is that we expect marketing spending next year to be roughly consistent as a percentage of revenue with what we've seen in 2022.\n\nAnd so overall, our goal for next year is to have flat margins for the year and hopefully do better than that, but that's our target. But you may see small fluctuations quarter to quarter depending on the cadence of marketing spending. If we, spend on a bigger campaign in Q1 that might have some effect on margins versus if we don't have that in Q2. So you might see margins be plus or minus a little bit year over year and each quarter depending on the marketing spend cadence and what's going on from a campaign perspective.\n\nOutside of marketing spending, we're going to offset any incremental margin headwinds that exist with improvements elsewhere to hit that goal of at least flat margins. And then you're right, Tinder is a very high-margin asset for us, and we talked about that already. And so, improvement in margins and ultimately hitting our long-term margin goal really is dependent on or at least it's a key factor that Tinder really accelerates its growth and really contributes meaningful growth to us. That is the number one job for the company is to really accelerate Tinder's growth and get it back to where it's been historical.\n\nOr at least closer to that, which will help us get closer to our overall long-term margin target. The only other thing I'd point out around margins and we mentioned this in the letter, is that our outlook for margins doesn't assume any relief from the app stores at all, which we think is the prudent thing to assume at the moment. That being said, the Digital Markets Act went into effect yesterday in the UK and we are expecting changes to app store policies as a result of that. And there are actions in other jurisdictions as well, markets like India, for example.\n\nAnd so, we believe that it's likely that we're going to see relief from app stores in 2023, if not in 2024 at the latest. And so I do think there's an upside to our margins as that plays through. But right now, our outlook doesn't contemplate any of that.\n\nAlexandra Steiger -- Goldman Sachs -- Analyst\n\nVery helpful. Thank you.\n\nOperator\n\nOur next question comes from Benjamin Black with Deutsche Bank. Please, go ahead.\n\nBenjamin Black -- Deutsche Bank -- Analyst\n\nGreat. Just a follow-up on expenses. I think in the letter you spoke about accelerating sort of broader cost controls next year. When should we expect to see those sorts of initiatives impact P&L? And could you sort of unpack exactly what those cost controls should look like? Thank you.\n\nGary Swidler -- Chief Financial Officer and Chief Operating Officer\n\nSure. Let me take that one as well. When you look at our P&L, a lot of our costs come out of IFBs, which obviously we're nowhere near in control over, as well as things like web hosting, AWS, and things like that, which are difficult for us to affect. So when you look at what we can control, and we do want to control what we can control in the current environment, marketing and headcount, as well as some other operating expense items, are things that we really can control and we can control costs on those fronts.\n\nI just talked in response to Alexandra's question about the marketing spend, where we're increasing it in certain of our businesses and we're offsetting that with reductions elsewhere to be neutral from a margin perspective, so that's one piece of it. In terms of the headcount, we've actually dramatically slowed our hiring since the middle of this year and we expect very few, if any, additional hires in 2022. Really only critical hires in growth businesses are the only additional headcount that we would add in 2022. And I think in 2023 the same philosophy will apply, meaning that for growing businesses and really critical hires we'll make them, but other than that, we're going to be really judicious.\n\nSo specifically, I'm expecting hiring in Hinge, which is a bright spot for us, a fast-growing business. But I'm not expecting meaningful headcount increases elsewhere across the company. And to the extent that headcount does lead to incremental margin impact on the negative side, we would need to offset that with reductions in other parts of the business. And so when you think about where those could be.\n\nOne is just general corporate overhead, things that are nice to have that we can do without, or costs that have crept into the business over the last few years that we think we can reduce and pare back on without impacting the performance of the business. And there are some of those, and we've identified those and we're imminently taking action on some of those. So you'll see the impact of that flow through the P&L, if not in the fourth quarter, then certainly as we make the turn into 2023. Also in our real estate portfolio, obviously post-COVID, things are not the same from a real estate perspective as they were pre-COVID.\n\nAnd to the extent it makes sense to adjust our real estate footprint, we're looking at doing so. So corporate overhead, corporate cost generally, as well as real estate, are places that we're targeting for reductions. And we can hopefully use some of that to reinvest in the businesses in new growth initiatives, in marketing at Tinder and Hinge, and so forth. And so that's part of our plan.\n\nAnd look, I would just say we think these are the responsible things to do. There are a lot of macro headwinds out there that are very difficult to predict. And so we would rather be proactive on this front. And if the environment next year is not as bad as we are anticipating, then the business will improve from a profitability standpoint.\n\nSo that's the approach that we're taking. And we're also mindful that the trajectory of certain of our businesses is growth challenged. And we also have to factor in that we need to be more disciplined on costs as a result of the growth challenges in some of our businesses. So I just want to, kind of conclude by saying we have guiding principles around this.\n\nWe're making targeted investments in businesses that we think can grow. Tinder Hinge, The League, Chispa BLK, are some of these new apps that we might incubate that is philosophically what we're trying to do. And we're making expense reductions in businesses where we have less confidence in the growth, primarily the established brands. So it's not a one size fits all approach.\n\nIt's not a complete, broad-based approach. It is targeted investment in some parts of the businesses and reducing costs in corporate and other brands that aren't growing on the flip side. And that's how we're approaching the cost reductions that we're thinking about. And then the last thing I wanted to add before we just wrap the call up is that any investments we're going to make in new businesses next year going forward are going to face a very high bar, especially given the environment we're in.\n\nWe need to apply a very disciplined lens to making any investments. And so we're reviewing everything very carefully and we're going through our process now to do all of that. And so we'll have a lot more to communicate both on the cost and margin side on the investment side, as well as what we see as the environment from a macro perspective and revenue growth. When we get together again in February on our next call.\n\nAnd I look forward to seeing you all that. BK any last comments from you?\n\nBernard Kim -- Chief Executive Officer\n\nThanks, everyone, for joining the call today. We feel like we've made a lot of great progress in a short amount of time. We look forward to sharing more with you during our next earnings call. Thanks so much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTanny Shelburne -- Senior Vice President, Investor Relations\n\nBernard Kim -- Chief Executive Officer\n\nGary Swidler -- Chief Financial Officer and Chief Operating Officer\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nJames Heaney -- Jefferies -- Analyst\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nCory Carpenter -- JPMorgan Chase and Company -- Analyst\n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nYoussef Squali -- Truist Securities -- Analyst\n\nJohn Blackledge -- Cowen and Company -- Analyst\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nAlexandra Steiger -- Goldman Sachs -- Analyst\n\nBenjamin Black -- Deutsche Bank -- Analyst\n\nMore MTCH analysis\n\nAll earnings call transcripts"
}