{
  "companyName": "Johnson & Johnson",
  "companyTicker": "JNJ",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/18/johnson-johnson-jnj-q3-2022-earnings-call-transcri/",
  "content": "Johnson & Johnson (JNJ -0.51%)\nQ3 2022 Earnings Call\nOct 18, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to Johnson & Johnson's third quarter 2022 earnings conference call. [Operator instructions] This call is being recorded. If anyone has any objections, you may disconnect at this time. [Operator instructions] I will now turn the conference call over to Johnson & Johnson.\n\nYou may begin.\n\nUnknown speaker\n\nPlease note that today's meeting may include forward-looking statements relating to, among other things, the company's future financial performance, product development, market position, and business strategy, and the anticipated separation of the company's consumer health business. You're cautioned not to rely on these statements, which are based on current expectations of future events using the information available as of today's date and are subject to certain risks and uncertainties that may cause the company's actual results to differ materially from those projected. In particular, there is significant uncertainty about the duration and contemplated impact of the COVID-19 pandemic. A further description of these risks, uncertainties, and other factors can be found in our SEC filings, including our 2021 Form 10-K, which is available at investor.jnj.com and on the SEC's website.\n\nAdditionally, several of the products and compounds discussed today are being developed in collaboration with strategic partners or licensed from other companies. These clients acknowledge those relationships.\n\nJessica Moore -- Vice President, Investor Relations\n\nGood morning. This is Jessica Moore, vice president of investor relations for Johnson & Johnson. As a reminder, you can find additional materials, including today's presentation and associated schedules, on the Investor Relations section of the Johnson & Johnson website at investor.jnj.com. In addition to today's presentation and associated schedules, we will be posting the transcript of today's call, as well as an Excel version of key financial schedules.\n\nI will now review the third quarter sales and P&L results for the corporation and highlights related to the three segments. Joe will then provide additional business and financial commentary before sharing an overview of our cash position, our capital allocation priorities, and updated guidance for 2022. The remaining time will be available for your questions. We anticipate the webcast will last approximately 60 minutes.\n\nNow let's move to the third quarter results. Worldwide sales were $23.8 billion for the third quarter of 2022, an increase of 1.9% versus the third quarter of 2021. Operational sales growth, which excludes the effect of translational currency, increased 8.1% as currency had a negative impact of 6.2 points. In the U.S., sales increased 4.1%.\n\nIn regions outside the U.S., our reported sales declined 0.3%. Operational sales growth outside the U.S. was 12.3%, with currency negatively impacting our reported OUS results by 12.6 points. Excluding the net impact of acquisitions and divestitures, adjusted operational sales growth was 8.2% worldwide, 4.2% in the U.S., and 12.4% outside the U.S.\n\nTurning now to earnings. For the quarter, net earnings were $4.5 billion, and diluted earnings per share was $1.68 versus diluted earnings per share of $1.37 one year ago. Excluding after-tax intangible asset amortization expense and special items for both periods, adjusted net earnings for the quarter were $6.8 billion, and adjusted diluted earnings per share was $2.55, representing decreases of 2.7% and 1.9%, respectively, compared to the third quarter of 2021. On an operational basis, adjusted diluted earnings per share increased 5.8%.\n\nI will now comment on business segment sales performance highlights. Unless otherwise stated, percentages quoted represent the operational sales change in comparison to the third quarter of 2021 and, therefore, exclude the impact of currency translation. Continuing with the streamlined remarks shared in the prior two quarters, we plan to keep our comments brief to leave more time for Q&A. Please refer to the slides for additional segment and franchise commentary.\n\nBeginning with consumer health. Worldwide consumer health sales of $3.8 billion decreased 0.4%, with an increase of 2.1% in the U.S. and a decline of 2.3% outside the U.S. Excluding translational currency, worldwide operational sales growth increased 4.7%.\n\nAnd outside the U.S., operational sales growth increased 6.7%. Excluding the impact of acquisitions and divestitures, worldwide growth was 4.8%. Results were primarily driven by strategic price increases; growth in OTC due to a strong cold, cough, and flu season; and OUS growth in Neutrogena and Aveeno due to market growth and new product launches. This growth was partially offset by supply constraints in the U.S.\n\nand suspension of sales of personal care products in Russia. Moving on to our pharmaceutical segment. Worldwide pharmaceutical sales of $13.2 billion increased 2.6%, with growth of 3% in the U.S. and 2% outside of the U.S.\n\nExcluding translational currency, worldwide operational sales growth increased 9%; and outside the U.S., operational sales growth increased 16.7%. Excluding the impact of acquisitions and divestitures, worldwide growth was 9.2%. Excluding COVID-19 vaccine sales, worldwide operational sales growth increased 8.9%; U.S. operational sales growth increased 7%; and outside the U.S., operational sales growth increased 11.3%.\n\nPharmaceutical growth was driven by strong commercial access and execution, enabling us to continue to deliver above-market adjusted operational sales growth, including five assets with double-digit growth. Growth was driven by Darzalex, Tremfya, Stelara, and Erleada, as well as our paliperidone long-acting portfolio, and was partially offset by biosimilar competition for REMICADE, along with a decrease in Imbruvica sales. Within our oncology business, Darzalex and Erleada continued to drive strong sales growth with increases of 38.7% and 51.2%, respectively. Imbruvica sales declined 7.2% worldwide due to increased competitive pressures.\n\nIn the U.S., the CLL market remains below pre-COVID levels, while in the EU, results were negatively impacted by government clawbacks. Overall, Imbruvica maintains its market leadership position worldwide. In our immunology business, Tremfya grew 41.9%, driven by share gains in psoriasis and psoriatic arthritis, with gains of 3.2 points and 1.7 points in the U.S., respectively, along with market growth. Stelara growth of 8% was driven by strong market growth and share gains in Crohn's disease and ulcerative colitis with gains of 5.2 points and 6.9 points in the U.S., respectively.\n\nResults in the quarter were partially offset by a net unfavorable prior-period adjustment of approximately 600 basis points on worldwide growth. We remain confident in our ability to deliver our 11th consecutive year of above-market adjusted operational sales growth in 2022. I'll now turn your attention to the medtech segment. Worldwide medtech sales of $6.8 billion increased by 2.1% with growth of 7.7% in the U.S.\n\nand a decline of 2.9% outside of the U.S. Excluding translational currency, worldwide operational sales growth increased 8.1%; and outside the U.S., operational sales growth increased 8.5%. Excluding the impact of acquisitions and divestitures, worldwide growth was 8.1%. Drivers for growth across medtech include procedure recovery, as well as focused commercial strategies and differentiated new products, such as Enseal X1 devices in energy; Velys digital solutions across our orthopedic platforms; and additional solutions enhancing our industry-leading electrophysiology portfolio.\n\nBased on our most recent share data, we continue to enhance or sustain market share positions in the large majority of our 11 priority platforms. As a reminder, these 11 platforms each generate over $1 billion in annual sales. Partially offsetting growth in the quarter is the impact of volume-based procurement in China and timing of international tenders primarily in orthopedics and supply challenges primarily in surgical vision. Aligned with our previously communicated expectations, medtech operational sales grew sequentially versus the prior quarter.\n\nAnd for additional context, selling days had an immaterial impact on results in the quarter. Now turning to our consolidated statement of earnings for the third quarter of 2022. I'd like to highlight a few noteworthy items that have changed compared to the same quarter of last year. Cost of products sold deleveraged by 170 basis points, primarily driven by unfavorable currency impact in the pharmaceutical business and commodity inflation, partially offset by supply chain efficiencies in the medtech and the consumer health businesses.\n\nWe continue to invest strategically in research and development at competitive levels, investing 15.1% of sales this quarter. The $3.6 billion invested was a 5% increase versus the prior year, primarily due to portfolio progression in the pharmaceutical business and increased investment across multiple franchises in the medtech business. The other income and expense line was an expense of approximately $500 million in the third quarter of 2022, compared to an expense of $1.9 billion in the third quarter of 2021. This was primarily driven by lower litigation expense, partially offset by losses on securities, consumer health separation-related costs, and COVID-19 vaccine-related costs in the current quarter.\n\nRegarding taxes in the quarter, our effective tax rate was 23.4% versus 4.7% in the same period last year. This increase was primarily driven by 2022 tax costs incurred as part of the planned separation of the company's consumer health business due to the reorganization of certain international subsidiaries, a one-time special item in Q3 2021 that reduced taxable income in the quarter, and unfavorable income mix. Excluding special items, the effective tax rate was 16% versus 13.5% in the same period last year. I encourage you to review our upcoming third quarter 10-Q filing for additional details on specific tax matters.\n\nLastly, I'll direct your attention to the box section of the slide where we have also provided our income before tax, net earnings, and earnings per share adjusted to exclude the impact of intangible amortization expense and special items. Now let's look at adjusted income before tax by segment. In the third quarter of 2022, our adjusted income before tax for the enterprise as a percentage of sales decreased from 34.5% to 33.9%, primarily driven by unfavorable currency and commodity inflation impact on cost of products sold. Pharmaceutical margins declined from 43.8% to 41.9%, primarily driven by unfavorable currency and cost of products sold.\n\nMedTech margins remained flat at 25.5%. Commodity inflation and increased investment in research and development were offset by supply chain efficiencies in sales, marketing, and administrative leveraging. Finally, consumer health margins improved from 24.2% to 24.3% despite inflationary pressures, driven by price actions and investment prioritization. This concludes the sales and earnings portion of the Johnson & Johnson third quarter results.\n\nI'm now pleased to turn the call over to Joe Wolk. Joe?\n\nJoe Wolk -- Executive Vice President and Chief Financial Officer\n\nThank you, Jess. Good morning, everyone. We appreciate you joining us today. As Jess just shared, we are pleased to report solid results across our business segments in the third quarter.\n\nWe accelerated operational sales growth across all three segments, and we're able to meet earnings expectations despite significant inflationary impacts to input costs. This performance reflects the strength of our business and versatility of our operations despite persistent global macroeconomic challenges. Given Johnson & Johnson's 136-year history, we are no stranger to periods of unfavorable macroeconomic conditions, but we have a proven track record of navigating through periods of challenge and volatility. With a diversified portfolio and strong balance sheet, we've repeatedly demonstrated our ability to deliver results in the short term while executing against our long-term strategy, focused on improving health outcomes and access to care.\n\nLet me share a few enterprise highlights from the quarter. We continue to deploy effective strategies to provide the products, medicines, and treatments that consumers and patients rely on in the face of supply chain pressures. Our teams have been working tirelessly to help mitigate the impact of these challenges by working with our partners to make sure we're meeting demand. We continue to invest for growth, driven by innovation, as demonstrated by the recent opening of our R&D campus in San Francisco, which will expand our R&D presence in the Bay Area.\n\nI had the pleasure of being at the opening for this campus. Seeing it in person only reinforces for me that the combination of science, technology, and data analytics will be the future of medicine. We also made further progress in the separation of Kenvue, the name of the planned new consumer health company. In addition to announcing the name, brand, visual identity, and purpose, Larry Merlo was named as the nonexecutive chair designate.\n\nCongratulations, Larry. Thibaut, Ashley, and Jennifer will provide updates on notable events for their segments later in the call. Turning now to cash and capital allocation. Year to date, we generated free cash flow in excess of $13 billion.\n\nAt the end of the third quarter, we had approximately $34 billion of cash and marketable securities and approximately $32 billion of debt for a net cash position of approximately $2 billion. Our capital allocation priorities remain unchanged, and our strong balance sheet affords us the flexibility to pursue multiple capital allocation priorities concurrently. Investing in innovation and R&D is our top priority. And through three quarters, we have increased our R&D investment by approximately 8% over the same period last year.\n\nIn addition to investing in organic growth opportunities, our team continues to evaluate strategic acquisitions and other external collaborations that would enhance our current portfolio, build upon our capabilities and enable us to play in higher-growth markets while delivering strong financial returns. In mid-September, our board of directors authorized a share repurchase of up to $5 billion of Johnson & Johnson common stock. This program underscores our confidence in the business and our pipeline while also delivering returns for our shareholders. This program, combined with our dividends, has yielded nearly $11 billion being returned to shareholders already in 2022.\n\nMoving on to full year 2022 guidance. As evidenced by the third quarter operational sales growth across all three businesses, healthcare, as well as our business, continues to be rooted in strong fundamentals despite various macroeconomic pressures. We continue to see a strengthening U.S. dollar relative to other currencies.\n\nAnd as seen on this slide, inflation in the U.S. remains at levels not experienced in decades and not unique to the U.S. You saw some of this impact reflected in this quarter's gross margin, eroding in comparison to Q3 2021, attributable to both currency and higher input cost. Despite these pressures, we are reaffirming our operational sales and reported adjusted earnings per share midpoint and tightening the ranges.\n\nOn sales, we are narrowing our base business operational sales range to $97.5 billion to $98 billion, or a growth rate of 7% at the midpoint. While this full year operational sales guidance is an acceleration to our year-to-date growth, it does imply a slight deceleration when comparing to the third quarter growth, driven by the loss of exclusivity of ZYTIGA in EMEA during the month of September. We don't speculate on currency impacts. However, using the euro spot rate relative to the U.S.\n\ndollar as of last week at 0.97, there is an estimated negative impact of foreign currency translation of approximately 490 basis points, resulting in an estimated reported sales growth between 1.8% to 2.3% compared to 2021 or $93 billion to $93.5 billion. Regarding other lines on the P&L. While we were able to absorb some of the inflationary pressures this year, we are lowering our full year operating margin projection due to the impacts of inflation across most spend categories to a decline of approximately 50 basis points. Given year-to-date trends on favorable employee benefit-related items, we are increasing our other income estimates to a range of $1.7 billion to $1.8 billion.\n\nRegarding interest income and expense, again, based on our year-to-date experience whereby we have a higher cash balance earning at rates higher than previously anticipated, we are increasing the range of our estimate to $175 million to $200 million of income. And finally, we are maintaining our effective tax rate estimate, which is reflective of current law, to a range of 15% to 15.5%. Considering these revised estimates, we are increasing our adjusted earnings per share on a constant-currency basis of $0.03 at the midpoint. The updated range is $10.70 to $10.75 or a midpoint of $10.73, reflecting a growth rate over 2021 of 9.5%.\n\nWhile not predicting currency movements, but to provide some insights on the potential impact on EPS, our reported adjusted EPS is expected to be negatively impacted by approximately $0.68 per share. As a result and by tightening the range, our reported adjusted earnings per share is $10.02 to $10.07, which maintains the previous midpoint of $10.05. I appreciate that many of you are turning some of your attention to 2023. We are actively finalizing our plans for next year, but allow me to provide some preliminary qualitative perspectives to consider as you develop your models.\n\nWe remain confident that we'll continue to grow our pharmaceutical business every year toward our goal of $60 billion in pharmaceutical sales by 2025 despite the Stelara LOE, which is anticipated to occur in the second half of 2023 in the U.S. For medtech, we expect our investments in innovation and commercial capabilities to continue to enhance our competitiveness. At this time, we anticipate positive procedure trends with the caveats that COVID-19 continues to be a dynamic situation regionally, lingering headwinds from hospital staffing, and some impact from volume-based pricing in China. For consumer health, prior year are seeing the benefits of our strategic price increases and a reduction in supply chain disruptions, although some challenges are expected to continue into 2023.\n\nWe expect inflationary pressures and higher input costs to persist, and we are continuing to take actions to offset these challenges. While some inflationary pressures are improving, keep in mind that certain products we manufacture in 2022 will be sold and flow through our P&L in 2023. As far as standing up Kenvue as an independent company, we expect to announce further details on the type of separation, as well as stand-up cost estimates and how we are addressing stranded costs later this year or early in 2023. We remain on track to complete the separation in mid to late 2023, as indicated in the initial announcement we made in November of 2021.\n\nFinally, as previously mentioned, we don't speculate on currency movement, but utilizing the euro spot rate of last week, we estimate an unfavorable currency impact on 2023's adjusted earnings per share of approximately $0.40 to $0.45 or $0.10 more than the $0.30 to $0.35 impact I referenced in July's call. 2022 has proven to be an active and unpredictable year, yet Johnson & Johnson continues to reliably meet the needs of patients while navigating the volatile global economic and operating environment. The executive committee could not be prouder of our team members across the globe for their commitment to excellence. We are continuously inspired by their dedication and unwavering focus on delivering growth for our stakeholders while staying true to our credo.\n\nI am now pleased to welcome our worldwide chairs, starting with Thibaut for consumer health, soon to be officially Kenvue.\n\nThibaut Mongon -- Executive Vice President, Worldwide Chairman of Consumer Health\n\nThank you, Joe, and good morning to all of you. We are indeed very proud of the achievements we have completed so far in 2022. As we shared with you throughout the year, we told you that consumer health would deliver improved performance starting in the second half of the year, and that is exactly what you saw with our good performance in the third quarter. Our strategy is working.\n\nOur pricing actions were realized, supply chain constraints eased, and we are also against easier prior-year comparables. Our third quarter results reflect those dynamics and really demonstrate our ability to achieve results despite the macroeconomic environment that Joe referenced and that continues to be volatile. And all of this thanks to the strength of our brands and the quality of our teams. So looking toward 2023 and in line with our results to date, we do anticipate that the strength and resilience of our well-balanced portfolio, together with the consumer loyalty to our brands, will continue to position our business to perform competitively with the market.\n\nNow regarding our future, as you just heard from Joe, we are making great strides toward the planned separation of the consumer health business, including our recent announcement of our new name, Kenvue. So as you can imagine, a lot of thought and care was taken to ensure that the name was memorable, distinctive, easy to pronounce in multiple languages. We then applied our expert brand-building skills to create a brand identity that reflects our new name, but also leave space for iconic brands that touch the lives of more than 1 billion people around the world every day. Every element was chosen to truly represent us as a future stand-alone company with the core attributes demonstrating an association with trust, care, science, and positioning Kenvue as a modern digital-first company.\n\nWe also unveiled our purpose this quarter, which is Realize the Extraordinary Power of Everyday Care. And in these seven words, we reflect our heritage of caring, but also play back what the world expects of us and the role we need to fulfill in society. We indeed believe that daily self-care rituals add up over time and have a profound cumulative impact on well-being. And our work at Kenvue will be to put that power into the hands of consumers around the world.\n\nSo we're excited for the journey ahead now with Larry Merlo named as our designate nonexecutive chair, and our teams are all focused on continuing to deliver results while progressing toward realizing the full potential of Kenvue. And now let me hand over to Ashley.\n\nAshley McEvoy -- Executive Vice President, Worldwide Chairman, Medical Devices\n\nThank you, Thibaut. Well, good morning. So last year was clearly a banner year of our new product innovation, and we are continuing that momentum in 2022 with four new products launched, first-in-kind new products launched just in third quarter alone. And clearly, these launches are really contributing to our enhanced competitiveness.\n\nSo in quarter 3, we launched our next-generation TECNIS Symfony OptiBlue, it's our latest presbyopia-correcting intraocular lens; our Acuvue Oasys Max contact lens; the Heliostar balloon ablation catheter; and the OCTARAY mapping catheter. So to just have a quick refresh on Acuvue Oasys One-Day Max, all of us know, we live digitally intense lives, and this lens was custom designed to really meet those digitally intensive lifestyles. It builds upon our industry-leading portfolio. Oasys is ranked No.\n\n1. It's the largest brand in the category, and it's unbeaten in comfort across 31 clinical trials. Moving over to our Biosense Webster business. We have a launch of our Heliostar balloon ablation catheter.\n\nThis catheter is unique. It's a one-shop balloon technology, and it enables PV isolation in 12 seconds with customized energy delivery and our one integrated 3D mapping solution. So we are already seeing the impact. Heliostar has resulted in an 86% freedom from documented atrial arrhythmia at 12 months.\n\nSo this is our entry into the single-shot ablation. Really just a couple of the ways that our team is delivering differentiated solutions really through a focus on breakthrough science and a consistent focus on doctors' critical needs. So I'm very encouraged by the strong innovation to date and even more excited about the potential of our pipeline to come. And when I start to think about 2023, we are very focused on our mission to make the future of healthcare smarter, less invasive, and more personalized.\n\nYou've heard me consistently say this is how we can show up in healthcare. We will continue, particularly in today's times, a little bit of uncertain times, to prioritize programs that are strengthening our core, that are really getting us on the forefront of shaping the new frontiers in medical intervention and a consistent drumbeat of always improving our competitiveness. We know that healthcare has an unbelievable amount of humility, but also amazing purpose. And as Joe has mentioned, we are -- it's very clearly in a dynamic time.\n\nWe're going to continue to manage through the macroeconomic factors like hospital staffing, like inflation, like supply constraints, and some of the overhang of the pandemic. But we are encouraged with procedural volumes in many parts of the world. They're recovering quite nicely. Some parts of the world are still a little bit below pre-COVID levels, but we are confident in the resiliency and agility of the medtech industry and our anticipated continued recovery across the world.\n\nSo thank you, and I'm pleased to turn it over to Jennifer.\n\nJennifer Taubert -- Executive Vice President, Worldwide Chairman, Pharmaceuticals\n\nGreat. Thank you, Ashley, and hello, everyone. Good morning. I'd really like to start off by thanking my pharmaceutical colleagues for another strong quarter with operational growth of 9%.\n\nThat was broadly based across our portfolio and our regions. As Jess noted, we continued to maximize the value of our diverse leading portfolio, delivering above-market growth with a number of key drivers: Darzalex, Tremfya, Stelara, Erleada, also Uptravi, Xarelto, and our long-acting paliperidone portfolio. So really great performance across the portfolio and throughout the globe. In addition to our strong performance, the pharmaceutical business achieved some important milestones during the quarter, both in terms of approvals and new data readouts.\n\nSo first, we're really pleased to announce our first approval globally for Tecvayli. This is our first-in-class, off-the-shelf bispecific antibody for patients with relapsed and refractory multiple myeloma, and this approval was from the European Commission. And we are on track to receive approval from the U.S. FDA before year end.\n\nTecvayli is a really important addition to our multiple myeloma portfolio, particularly for this difficult-to-treat patient population. Also in multiple myeloma, the final analysis from our Phase 2 GRIFFIN Study of a Darzalex-based investigational quadruplet regimen was presented, really highlighting the potential benefit of adding Darzalex to this frontline treatment regimen in multiple myeloma in newly diagnosed transplant-eligible patients. Separately, we received two approvals for Imbruvica. So European Commission approved an all-oral, fixed-duration treatment combination with venetoclax in frontline CLL.\n\nAnd the U.S. FDA granted approval for pediatric patients with chronic graft-versus-host disease, marking the first pediatric approval for Imbruvica and making Imbruvica the only BTKi with 12 FDA approvals across seven indications. If we turn to solid tumors, data from our early stage trials from our combination of amivantamab plus lazertinib were presented at WCLC. Importantly, these data demonstrated a benefit in frontline treatment of EGFR mutant non-small cell lung cancer, and we look forward to data from our Phase 3 MARIPOSA Study in the future.\n\nAnd last, in immunology, we presented new data for Tremfya from the Phase 3b GUIDE Study, which demonstrated even higher rates of complete skin clearance in adult patients with moderate to severe plaque psoriasis who were started earlier in the course of their disease. So it bodes well for earlier treatment for Tremfya and continued growth. As I said, I'm really proud of our pharmaceuticals team and what we accomplished in the third quarter, and I look forward to finishing the year strong. As we look ahead, with our focus on transformational medical innovation, our pipeline of current medicines, our robust pipeline of new medicines, and world-class capabilities, we remain really confident in our growth expectations, the ones that we outlined in our pharmaceutical business review last November, including the fact that we expect to be a $60 billion pharmaceutical company by 2025.\n\nSo thank you very much. And Jess, I'll turn it back over to you.\n\nJessica Moore -- Vice President, Investor Relations\n\nThanks, Jennifer, Thibaut, and Ashley. This concludes the prepared remarks portion of our earnings call. Kevin, could you please provide instructions and open the line for Q&A?\n\nOperator\n\nCertainly. [Operator instructions] Our first question is coming from Chris Schott from J.P. Morgan. Your line is now live.\n\nChris Schott -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks so much. Just a couple of -- just a two-parter for Joe. Can you just elaborate a little bit more on 2023 operating margin dynamics? It seems like you're seeing some modest operating margin erosion this year due to inflation.\n\nShould we be thinking about a similar step down in 2023? Or is there a better ability to manage some of these inflation pressures as, I guess, some of these start to ease as you go through the year? And maybe a second question, just as we think about '23, just tying some of the segment comments together and as we think about top line, is there any reason to assume a meaningful deviation from the operational growth trends that you're seeing in 2022 as we look out to 2023? And I guess maybe specifically in that, is the Stelara LOE a large enough of a headwind next year that we need to start to think about that impacting growth? Or is that more like a 2024 and beyond issue? Thanks so much.\n\nJoe Wolk -- Executive Vice President and Chief Financial Officer\n\nHey, good morning, Chris. Thanks for your questions. What I'll do is I'll give you some insights around 2023 op margin. And then maybe I think it might be productive to turn it over to each of the segment heads to talk about what their outlook is for 2023 in a qualitative way at this point.\n\nSo for 2023 op margins, I think you have a couple of dynamics that we're facing. Clearly, the macroeconomic pressures that all industries and all companies are facing is something that we have to address as well. While healthcare is a very, very good business and more resilient than most, it's not as if we're immune to some of those dynamics. So as we finalize our plans for 2023, we will be looking at prioritizing our resource deployment to those initiatives, those projects, those services that deliver the most value for patients, which in turn is then healthy for our business.\n\nThe other dynamic that's at play, Chris, and maybe why I'm a little bit hesitant to give you specific guidance at this point in time, is the separation of the consumer health business. So we're going through some of our plans now. We have the opportunity, as we said on prior calls, to rightsize our infrastructure for a two-segment company versus a three-segment company that we've had historically. And so we're looking at opportunities there as well.\n\nI think given the pressures from both of those fronts, we take it as our responsibility here at Johnson & Johnson's management to ensure that we mitigate those, we prioritize every dollar that we have that goes to securing our long-term future, specifically in innovation and R&D. And that's where we'll continue to focus. We know that that has a proven track record of success when we do that, specifically when we focus on those precious few projects that matter the most. And that's what we'll continue to do in 2023.\n\nSo more to come on op margins, but we will -- we're not oblivious, obviously, to the world around us, and we're going to manage those very, very effectively. Why don't I turn it over to Jennifer to maybe give an outlook on pharmaceuticals and specifically address the impact for Stelara next year?\n\nJennifer Taubert -- Executive Vice President, Worldwide Chairman, Pharmaceuticals\n\nYeah. Hi, Chris. Good morning. So for 2023, we anticipate another year of above-market growth for the pharmaceuticals group.\n\nThese results, we anticipate to be driven by continued growth of our key brands like Darzalex, Tremfya, Erleada, Invega Sustenna, and Uptravi. And this really coming from a combination of increased penetration, as well as continued market share gains. And then we also continue -- or expect continued uptake of our new launches, so products like Carvykti, Tecvayli that I just mentioned, products like Spravato, etc. And so while we do anticipate Stelara LOE really in that late September time frame or toward the end of the year, we believe that we've got a lot of tailwinds with our existing portfolio and our new launches to continue to have another year of above-market growth in 2023.\n\nJoe Wolk -- Executive Vice President and Chief Financial Officer\n\nThibaut, you might want to say a few words on consumer's outlook.\n\nThibaut Mongon -- Executive Vice President, Worldwide Chairman of Consumer Health\n\nYeah, absolutely. 2023, we expect that the world will continue to be extremely volatile, inflationary pressure, supply chain disruption, geopolitical environment, and continued impact from COVID pandemic in certain parts of the world. So we -- with that in mind, we are certainly prepared to navigate this environment, thanks to the quality of our brands, the strengthening of our execution capabilities around the world. And as you referenced, Joe, innovation will continue to play a big part in our results.\n\nMoving forward, we see that the innovation we bring to market this year are extremely well received by consumers around the world, and we expect this to continue in 2023.\n\nJoe Wolk -- Executive Vice President and Chief Financial Officer\n\nAshley?\n\nAshley McEvoy -- Executive Vice President, Worldwide Chairman, Medical Devices\n\nI would just say consistent, really building on the momentum in 2022. So for the first three quarters of the year, we're looking at near-7% growth. And so our eye is around keeping that momentum from a demand generation on revenue next year and having a revenue number that beats the market. Clearly, in today's environment, the cost of doing business has gone up.\n\nAnd so we are doing everything we can to manage and mitigate that to remain competitive from -- typically, we have 1 or 2 points of price erosion. We've actually been commanding price/mix realization in today's environment through supply chain efficiencies, admin efficiencies, and some price/mix realization. We do see some of the downsides in China from VBP that we're weathering through those and earning some of those tenders going forward. But we'd like to very much keep the investment going in R&D because, as you can see in the past couple of years, it's really benefited from accelerating our growth curve.\n\nJoe Wolk -- Executive Vice President and Chief Financial Officer\n\nSo Chris, hopefully, that answers your question. But I think what you should take away is, clearly, the breadth of our portfolio, the reach of our geographic presence positions us very, very well. While Stelara is certainly a big product, I think it's Johnson & Johnson's largest product ever, we're not dependent on one product alone. And so the breadth of the portfolio that exists today as well as that, which is on the come, I think, bodes extremely well for continued growth that investors have come to expect.\n\nOperator\n\nThank you. Our next question today is coming from Larry Biegelsen from Wells Fargo. Your line is now live.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nGood morning. Thanks for taking the question, and congratulations on a nice quarter here. I have one for Ashley, one for Joe. Just Ashley, I'd love to hear your thoughts just on the macro trends impacting medtech, a little bit more color on what you're seeing in China, some of the supply constraints and staffing shortages, and how you see those playing out in Q4 and 2023.\n\nAnd Joe, you've been talking about taking bolder steps in M&A. Why haven't we seen more M&A from J&J so far in 2022? And has anything changed with regard to your priorities? Thank you.\n\nAshley McEvoy -- Executive Vice President, Worldwide Chairman, Medical Devices\n\nSure. Thank you, Larry. I have to, first, by giving a shout-out to the medtech team, it was a really strong quarter of 8% and 7% year to date. And they just have really a maniacal focus is what I would say on competitiveness and customer-centricity.\n\nWhen we -- and Joe alluded to this, Larry, if you look at -- I'll go around the world a little bit. We are seeing procedures recovering. I think we're benefiting in that, posting very strong September but also a quarter end of 8%. In the United States, we started to see surgical procedures tick up predominantly at the latter part of the quarter.\n\nWe do see diagnostic procedures more in the mid-single digits, so colonoscopies as an example, in quarter 3. So we're expecting that to continue. Now you'll recall that we're anniversary-ing Omicron hitting kind of in the Thanksgiving time frame in December, so that should be a healthy comp, but we also expect in a very focused micro surges in the winter surge. Europe is recovering nicely.\n\nAugust was a little bit of a slowdown given the holiday season, but really September picked up. Asia is in fast recovery, I would say, in India and Japan. And China is still -- quarter 3 recovered nicely versus quarter 2, but they're still below pre-COVID levels. So we expect that bolus to continue.\n\nWe are moving forward. We have a strong position in China. We have a very diversified position in China. We are moving through some of the VBP actions.\n\nThat's why you saw in our Joints business, we were actually up 10% in our knees and our hips in the United States, but we had negative growth in the quarter really due to the volume-based procurement wins on pricing actions that we'll come through that for next year. So thank you for the question, Larry.\n\nJoe Wolk -- Executive Vice President and Chief Financial Officer\n\nYeah. Larry, regarding M&A, well, first off, let me start with just reiterating the strong free cash flow that we have year to date, over $13 billion. Also very proud of the fact that we've been able to distribute nearly $11 billion to shareholders through the form of our dividend program, as well as the repurchase program that was announced just mid last month. So we feel really good on that front.\n\nBut as you likely noticed in today's comments, we still hold $34 billion of cash, which positions us extremely well to continue exercising that lever of capital allocation around acquisitions or significant collaborations going forward. So our priorities have not changed. In fact, maybe we're even a little bit more bullish and eager to do something. But as folks come to know us, we're not going to do anything haphazardly.\n\nWe're not -- the aspect of this company that is really enjoyable as being the CFO is we don't have to do anything out of desperation. We're going to find those assets that have a great strategic fit and then make sense from a financial perspective with respect to returning to shareholders something that compensates them for the risk that we're bearing on their behalf. The market is a little bit funny. The volatility actually doesn't help for a conducive M&A environment right now because you have sellers, potential sellers holding on to 52-week highs or all-time highs, which, quite frankly, aren't too distant in the rearview mirror.\n\nWe're going to approach it with a very fundamental discounted cash flow analysis to make sure we're bringing value forward. But the short answer to your question is our priorities have not changed. We're looking to complement the already strong portfolio you heard in the first round of responses.\n\nOperator\n\nNext question is coming from Louise Chen from Cantor Fitzgerald.\n\nLouise Chen -- Cantor Fitzgerald -- Analyst\n\nCongratulations on the quarter. So I wanted to ask you if you have any updated thoughts on getting to that $60 billion of pharma sales by 2025. And is this all organic growth? And if it's not, where could sales go with M&A? And what areas are you seeing the best opportunities in M&A?\n\nJennifer Taubert -- Executive Vice President, Worldwide Chairman, Pharmaceuticals\n\nLouise, thanks so much for the question. So the projections that we gave you about the $60 billion in revenue by 2025 really is all based on our current portfolio and our current pipeline, so that doesn't have anything factored in right now in terms of M&A. Anything that we did there, we would look at to be additive. When we take a look at how we're going to get there, we really believe we're going to have a compound annual growth rate of at least 5% with growth in every year, and that includes through the Stelara LOE.\n\nWe think we've got eight key brands that will be able to post double-digit growth through 2025. And as we take a look through our pipeline and portfolio between now and then, 14 novel therapies filed with potential to exceed $1 billion, and we've got five of which we think actually have potential to exceed $5 billion. So that's products like milvexian, which is in our partnership with Bristol-Myers Squibb; amivantamab and lazertinib combination, which I mentioned for non-small cell lung cancer that we've got good data coming through; nipocalimab, which is progressing really nicely through the various stages of clinical development, that's the auto antibody asset that we brought in from the Momenta acquisition; we have our Taris platform that is progressing nicely for bladder cancer, and we have Carvykti. While we're still in the early stages of launching and ramping that asset, based on the strength of the data and the clinical trials, we remain really bullish on what Carvykti is going to mean for patients with multiple myeloma around the world.\n\nAnd so I think based on our existing assets and the continued growth, I mean, if you take a look at Darzalex and the results that we just posted for the quarter, 39% growth, consistent with what we've been seeing, as well as growth in assets like Tremfya, Erleada, etc., you take a look at the strength of the existing portfolio, you layer in on top of that what's coming through with the pipeline, and that's what gives us the confidence to hit that $60 billion organically. That being said, in line with Joe, we're constantly looking for ways that we can continue to augment and further build our pipeline and to do so out of a position of strength. And so predominantly, we keep our innovation engine going, bringing in things in the earlier stages, which is usually our sweet spot because we can put our R&D machinery against it, as well as our terrific regulatory and commercial and market access capabilities to really build things out. But that doesn't rule out later-stage acquisitions or in-market acquisitions as well.\n\nOperator\n\nThank you. Our next question today is coming from Joshua Jennings from Cowen. Your line is now live.\n\nJoshua Jennings -- Cowen and Company -- Analyst\n\nHi. Good morning. Thanks for taking the questions. I wanted to just ask Ashley and maybe Joe as well, just to comment on your thoughts on the resiliency of the medical device industry during a recession and, in particularly, Johnson & Johnson's Medical Device business and maybe parse out which device franchises could be more resilient, which could be less.\n\nAnd then a quick follow-up, just partly related with cardiology procedures thought to be more resilient during recession being -- most of them being life-saving. Any updated thoughts just on strategic rationale to build out your cardiology franchise and add to the Biosense Webster division? Thanks for taking the questions.\n\nAshley McEvoy -- Executive Vice President, Worldwide Chairman, Medical Devices\n\nYeah. Thank you, Josh. I mean, I think -- let me start with the macro. I think the health of the end-state markets in medtech are quite vibrant.\n\nAs we've talked, there's been bumpiness because of COVID that we're still having some of that. But there is patient demand that is still yet to be met, and that's really what we're experiencing in quarter 3, and we still think that will continue into 2023. And you're seeing procedures that are more insulated, like the cath lab is more protected in a hospital environment. Volumes have been going quite nicely.\n\nI have to give a huge shout-out to the BWI team in the U.S., grew near-24% growth in quarter 3. So -- and we're continuing to invest, to your point, in cardiology. We have a very active program in pulsed-field ablation, and we have a clinical trial in Europe that just completed in quarter 2. We're looking at a 12-month readout of that on safety and efficacy and to file this year.\n\nAnd we're also in clinical trial in the United States for our pulsed-field ablation we enrolled in May 2022. And we actually think the combos are going to be quite complementary, radio frequency coupled with pulsed-field ablation. But -- so that's a bit about the cath lab. We're seeing bariatric procedures, which are more elective in nature, really clearing through the backlog.\n\nThe ones that tend to be laggards are things like spine. And we're seeing cataract surgery at a certain point becomes less elective. And the pacesetters, if you will, are areas like stroke, like trauma that are much more less elective in nature. And then I would just say from a creating patient demand, there's been a huge initiative on behalf of Johnson & Johnson and the industry to kind of move to sites of care that patients are really preferring.\n\nAnd those areas like ambulatory surgery centers in the United States, our team predominantly in joints, as well as sports, they've grown market share 20% over the past two years in those emerging channels. In areas like tier two and tier three cities in China with a population of 1.4 billion patients, continue to grow and expand. So we're going to see some of those shifts that happened during the pandemic really start to, I think, pick up where patients can get a sense of comfort. And hopefully, we can kind of diffuse some of that, the scarcity of label into the right sites of care.\n\nOperator\n\nThank you. Our next question is coming from Joanne Wuensch from Citi. Your line is now live.\n\nJoanne Wuensch -- Citi -- Analyst\n\nGood morning, and thank you for taking the question. Nice quarter. Quickly to follow up on your comments on electrophysiology, those numbers were particularly strong. Could we pull that growth apart and discuss maybe how much of this is market growth, market share stocking maybe, or possibly price? And then my big-picture question has to do with Ashley's comments of dealing with -- I want to get the right words here.\n\nUsually, you have 1 to 2 points of mix erosion, and you're now commanding price. I want to make sure I heard that right and then understand it a bit better. Thank you.\n\nAshley McEvoy -- Executive Vice President, Worldwide Chairman, Medical Devices\n\nYeah, no. Thank you, Joanne. We always talk about BWI because it is a market leader, and yet the category still has very low penetration. Less than 12% of eligible patients are actually getting cardiac ablation.\n\nAnd we love this example because we think when we think of healthcare, we love to kind of intercept disease before it sets in. And if you can go manage cardiac arrhythmia through cardiac ablation, you can really prevent a stroke. So just a huge acknowledgment of how close that team is to customers really around the world. How -- the innovation cadence, they really have many first in kind.\n\nAnd if it's not first in kind, their second generation will ultimately become the standard of care is what they've shown and just a true sense of competitiveness. So in quarter 3, BWI was up about 19%, Joanne, and as I mentioned, about 24% in the U.S., but 13% OUS, and a very healthy growth in Europe, a very healthy growth in Asia. That is a category that, like joints, is going to go through a bit of a VBP impact in some quarters to come, but we have very differentiated innovation, and we're building kind of local on-the-ground capability to endure through those. And when I think about the state of innovation, it's just making sure that we can, from an industry penetration, take that from 12% penetration and double that.\n\nAnd that really is the single-minded focus of all of the innovation is to locate better lesions, deliver better lesion, make it a safer, less fluoro in the procedure, make it safer for electrophysiologists, and, quite frankly, scale it. There's a shortage of electrophysiologists, so we invest a lot of money on market creation. Thank you, Joanne.\n\nOperator\n\nThank you. Our next question today is coming from Geoff Meacham from Bank of America. Your line is now live.\n\nGeoff Meacham -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks so much for the question. Just had a few pharma ones. On the I&I market, I know you guys obviously have the Stelara LOE next year.\n\nBut would you expect there to be a lot of market disruption from the flood of Humira biosimilars launching before? I'm just trying to think of the indirect impact on your business. And then the second question is on your cell therapy portfolio. You guys called out Carvykti. Any qualitative comments you have on the commercial rollout, one more quarter in? And is there an update on the CARTITUDE-4 timing that you could provide for us? Thank you.\n\nJennifer Taubert -- Executive Vice President, Worldwide Chairman, Pharmaceuticals\n\nGot it. Thanks so much for the question, Geoff. So if we start off with immunology, yes, I mean, the market will be experiencing a significant event, at least in the U.S., with some competitive biosimilars coming in against other assets. We do anticipate that that will cause a bit of disruption.\n\nBut when we take a look at our business and Tremfya, so focusing on Tremfya for psoriasis and psoriatic arthritis, I think based on what this is as really the first IL-23 is delivering and delivering for patients, we can anticipate that there will still be strong continued growth for that asset. We're very, very confident in our access positions there and being able to retain that, even in the face of biosimilars, to other products that are launching. I'll also put in a plug while we're at it, when I'm talking about Tremfya, that we also feel really good about how our product Tremfya is working through the Phase 3 clinical trials for Crohn's disease and ulcerative colitis and look forward to hopefully getting that data in through the regulatory process and launching to bring even more benefit to patients with that. So we do anticipate continued growth there.\n\nAnd then on Carvykti, we're really pleased with how the product is performing for patients and the data that we're continuing to see. Maybe if I start off on CARTITUDE-4, and then I'll come back on the launch, we do anticipate CARTITUDE-4 hopefully reporting by year end. It's an event-driven trial. So we have to wait until we have all of the events.\n\nBut that's currently what we're planning for now so that everyone knows CARTITUDE-4 is our study that takes a look at Carvykti in one to three prior lines of therapy. We're really interested and looking forward to seeing those results. So if we take a look at the early launch for Carvykti, we've always talked about this being a really planned and thoughtful approach to scaling it. And so we're in the process right now.\n\nWe've really been working closely with the centers where we had done the clinical trials to work through the initial phases. I know everyone knows about the worldwide lentivirus shortage. We've made really good progress on that and have good line of sight to that not being something that we're dependent -- that not being a rate-limiting factor in the future. We're also working toward really being able to scale this at a broad level to be able to accommodate what we're seeing as both great demand for the product right now, but also what we anticipate with CARTITUDE-4, as well as hopefully with CARTITUDE-5, which would be in frontline therapy.\n\nSo we reconfirm this as really a big asset with a lot of growth potential and one of our potentially $5 billion-plus brands.\n\nJessica Moore -- Vice President, Investor Relations\n\nThank you, Geoff. Kevin, we have time for one last question.\n\nOperator\n\nThank you. Our final question today is coming from Terence Flynn from Morgan Stanley. Your line is now live.\n\nTerence Flynn -- Morgan Stanley -- Analyst\n\nThanks so much. Maybe a couple of pharma ones for me as well. I was just wondering, as you think about the combined franchise for Stelara and Tremfya next year, can that grow versus this year? And then based on clinicaltrials.gov, it looks like the nipocalimab Phase 2 RA trial recently completed. So just wondering if you can provide any color if you're going to advance that into a Phase 3 trial for RA.\n\nThank you.\n\nJennifer Taubert -- Executive Vice President, Worldwide Chairman, Pharmaceuticals\n\nThanks, Terry. So first question, so Stelara and Tremfya, we're not -- we don't provide sort of guidance by product or combinations of that. What I can say is that we do anticipate continued robust growth for Tremfya. Next year, as I indicated, Tremfya in psoriasis and psoriatic arthritis is really showing very strong market share gains and penetration in that market.\n\nStelara really competes, and its strong growth has been in Crohn's disease and ulcerative colitis. And so when you take a look at those two markets, we do anticipate both of those continuing to show really good growth, at least through the first three quarters of next year with Stelara, then post-September being impacted by biosimilars. And then on nipocalimab, so I don't have really anything to share there yet for nipocalimab. Consistent with all of our processes when we finish our studies, we go ahead and submit them to major medical meetings and get them published.\n\nI remain really confident in nipocalimab as an asset, and we've really taken a look at building that out across 10 or 11 different indications, including the potential for RA, which we think could be a big one. So definitely more to come on that as we can share it.\n\nJessica Moore -- Vice President, Investor Relations\n\nThank you, Terence, and thanks to everyone for your questions and your continued interest in our company. We apologize to those that we couldn't get to because of time but don't hesitate to reach out to the investor relations team with any remaining questions you may have. I would now like to hand it over to Joe for some closing remarks.\n\nJoe Wolk -- Executive Vice President and Chief Financial Officer\n\nGreat. Thanks, Jess. Thank you, Thibaut, Ashley, Jennifer, and Jess, for participating in today's call. And as Jess said, thanks to all of you for your time today.\n\nHopefully, you saw with our third quarter performance the strength of Johnson & Johnson across all of our segments and our collective ability to manage macroeconomic headwinds, as well as the unfavorable impact from a stronger U.S. dollar. We certainly take seriously our responsibility to be a reliable, strong investment in many ways for shareholders, even though uncertainty may be high. Have a great day, and we look forward to our next conversation.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nUnknown speaker\n\nJessica Moore -- Vice President, Investor Relations\n\nJoe Wolk -- Executive Vice President and Chief Financial Officer\n\nThibaut Mongon -- Executive Vice President, Worldwide Chairman of Consumer Health\n\nAshley McEvoy -- Executive Vice President, Worldwide Chairman, Medical Devices\n\nJennifer Taubert -- Executive Vice President, Worldwide Chairman, Pharmaceuticals\n\nChris Schott -- JPMorgan Chase and Company -- Analyst\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nLouise Chen -- Cantor Fitzgerald -- Analyst\n\nJoshua Jennings -- Cowen and Company -- Analyst\n\nJoanne Wuensch -- Citi -- Analyst\n\nGeoff Meacham -- Bank of America Merrill Lynch -- Analyst\n\nTerence Flynn -- Morgan Stanley -- Analyst\n\nMore JNJ analysis\n\nAll earnings call transcripts"
}