{
  "companyName": "Unity Software Inc.",
  "companyTicker": "U",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/unity-software-inc-u-q3-2022-earnings-call-transcr/",
  "content": "Unity Software Inc. (U 0.39%)\nQ3 2022 Earnings Call\nNov 09, 2022, 6:00 p.m. ET\n\nRichard Davis\n\nThank you, and welcome to Unity's third quarter 2022 earnings call. After the close of the market today, we issued our earnings press release and earnings presentation. These materials are available on our investor website at investors.unity.com. Today, I'm joined by John Riccitiello, our CEO, president, and chairman; and by Luis Visoso, our CFO.\n\nNow, before we begin, I want to note that today's discussion contains forward-looking statements, including statements about goals, business outlook, industry trends, market opportunities, expectations for future financial performance, and similar items, all of which are subject to risks, uncertainties, and assumptions. You can find more information about these risks and uncertainties in the Risk Factors section of our filings at sec.gov. Actual results may vary, and we take no obligation to revise or update any forward-looking statements. As in prior quarters, we are providing both GAAP and non-GAAP financial measures.\n\nUnless otherwise noted, we will be speaking to non-GAAP financial measures when describing our results. The earnings presentation and press release are available on Unity Investor Relations tab, as well as sec.gov, and they include full GAAP and non-GAAP reconciliations. And in the fourth quarter, we plan to present at investor conferences with BTIG, Credit Suisse, and Barclays. Full details are also available on our website.\n\nWith that, I will turn the call over to John.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nThank you, Richard. I want to start the call welcoming everyone at ironSource to Unity. The merger closed on Monday, as expected. We will report consolidated results starting in the fourth quarter of 2022.\n\nTogether, Unity and ironSource will write the next chapter of Unity's journey as we capture the large real-time 3D opportunity in front of us. In fact, we feel more positive about the merger now than we did when we announced the deal on July 13. Today, only a fraction of creators succeed in the creator economy. We are passionate about changing this reality because we believe the world is a better place with more creators in it.\n\nBy combining forces, we believe Unity and ironSource will transform the industry and increase creators' success by replacing luck with science. We expect to achieve this through an end-to-end platform that enables creators to build better games and better user acquisition and everything in between by solving our customers' toughest problems. And as a result, we expect to be a highly profitable company operating with positive cash flow. Moving on to the financial performance of the third quarter.\n\nUnity delivered a good quarter with revenue and non-GAAP operating income in line with guidance. Create posted a strong quarter, and our internal performance challenges in Operate are behind us. Total revenue for the third quarter was $323 million, up 13% year over year. Create delivered $129 million in revenue this quarter, an increase of 54% year over year.\n\nOperate delivered $172 million, down 7% year on year and up 8% as compared to the previous quarter. Strategic partnership revenue of $23 million this quarter is up 28% year over year. Non-GAAP loss from operations of negative $37 million came in at the better end of the guidance range as we continue to make progress with our cost structure on our way toward breakeven by the end of the year. Now, let's dive into Create.\n\nQ3 was another strong quarter for Create Solutions. We continue to have strong customer pull in our core Unity Engine and our newer segments of Digital Twins and Artistry. We are enabling our customers to create extraordinary real-time 3D experiences in games and across industries, which we believe will accelerate our growth. Innovation is the foundation of everything we do at Unity.\n\nA great example of this is our Data Oriented Technology Stack, or for short, DOTS. DOTS allows creators to get more performance and more scene density on any device they target by optimizing real-time 3D experiences in ways that take better advantage of modern chip architecture. This quarter, we released our Entities 1.0 experimental release. This release includes critical functionality to allow creators achieve native code performance with the ease of C# development, support massive data streaming through all Unity rendering pipelines with significant improvements in rendering performance with our updated occlusion culling system.\n\nIt's an encouraging thing to see compelling examples of creators using these tools to deliver spectacular games of all types, from open-world MMOs to strategy to racing. Some recent games that use DOTS include V Rising by Stunlock Studios, Zenith: The Last City by Ramen VR, IXION by Kasedo Games, and Detonation Racing by Electric Square. Another good example of the end-to-end focus on enabling creators to build, launch, and scale terrific games is our work with Marvel:Snap developed by SecondDinner. SecondDinner developed their game using Unity and are also using a Unity Game Services customer.\n\nWe love the success they're seeing in their new launch, currently No. 1 on iOS and Android app stores in their category. As Aaron Brunstetter said, the senior director of software engineering at SecondDinner, \"Unity is a very close relationship for us. It feels like we're one team with a shared purpose, taking on challenges together.\n\nThat's thanks to everyone here who has joined us on this journey, which, in all reality, is only just getting started.\" We couldn't agree more. Outside of Games, we are seeing similar results. This quarter has continued our strong momentum in Digital Twins. A few examples.\n\nTilbury Douglas just launched their Connect Configurator. This enables them to bring forward insights and better decision-making with their clients earlier in the construction process, eliminating delays, material waste, and rework. The Orlando Economic Partnership is working on the initial phase of the world's first immersive 3D regional Digital Twins. This project combines 80 different existing data sources, over an 800-square-mile region to provide an immersive 3D experience, and provides companies looking to expand their businesses to the Orlando region with a much more effective and engaging way to understand the region, infrastructure, and demographics.\n\nI also want to talk about our progress with Parsec and SyncSketch, which, together, make up our Create Anywhere business. We continue to see very strong demand as companies around the world reconfigure and make permanent investments to support creators collaborating and creating in hybrid work scenarios. The combined ARR of the businesses in Create Anywhere grew north of 100% year over year through product innovations that continue to help scale our product-led growth and accelerate our enterprise sales. In fact, in the third quarter, we closed our largest Parsec enterprise deal to date, which was over $1 million in ARR.\n\nIn Create Anywhere, we now have 25 customers contributing over $100,000 in annual recurring revenue. SyncSketch has become the go-to collaboration tool for creators in the media and entertainment industry. Recently, Raised by Wolves, an HBO Max show from executive producer Ridley Scott, who has a very high bar for visual quality in their futuristic sci-fi world, relying on SyncSketch to collaborate on nearly 3,000 complex visual effect shots with a geographically distributed team. The Raised by Wolves team was able to work with executives, vendors, and the production team for reviewing sessions throughout pre and post production.\n\nPutting all this collaboration online made it easy to meet deadlines and deliver a world-class production. Last quarter, we announced and launched a significant pricing and packaging change within our Unity Pro, Unity Enterprise, and Unity Industrial Collection offerings. We raised the price between 13% and 25% across these offerings, the first significant price change in three years. More importantly, we align these offerings to better fit the needs of subsegments and creators.\n\nThis means adding functionality like MARS, our XR authoring environment; and Havok, a high-performance physics engine often used in the creation of advanced games, as well as optimizing support and customer success for Unity Pro, Unity Industrial Collection, and Unity Enterprise offerings. Unity Enterprise customers also receive read-only source code to enable more rapid debugging and optimization and an extra year of long-term support for enhanced stability, both highly demanded by these customers. These are foundational changes that we'll continue to build to improve our take rate significantly by adding value our customers are happy to pay for. We also continue our shift toward the cloud, enabling ratable revenue.\n\nThis quarter, we released a private alpha of our cloud-based Digital Twin solution. This platform is designed to enable the end-to-end creation and use of real-time interactive in 3D Digital Twins with capabilities across any industry, all powered by cloud services. The platform is in private preview internally and with select customers in information technology, energy, and construction. We'll have more details on this platform as we move beyond our alpha stage.\n\nAcross Artistry, Digital Twins, and Games, we are encouraged in the momentum we see in customer demand and the large market opportunity across short, medium, and long term with Create. Moving on to Operate. Again, I want to welcome team ironSource to Unity. From here, we're merging ironSource and Unity, and the combined teams will come together under Tomer's leadership.\n\nWe will refer to this larger combined business as growth solutions. Ingrid and her team will form a key part of the new team, as will the founders and teams at ironSource. With that, I will now speak to Unity Operate in Q3. Operate delivered sequential progress in the third quarter with 8% quarter-on-quarter growth.\n\nThis quarter, we increased competitiveness in our core product. And as a result, we are growing our share of wallet with several of our largest customers. With increased trough comes increased spend on our platform. We continue to improve our models and have a healthy pipeline of ongoing initiatives.\n\nWe also saw an increase in new publishers partnering to integrate advertising placements with Unity. Looking at 2022 as a whole, there's no doubt that the ad side of Unity Operate has experienced a challenging year. Between 2019 and 2021, the team navigated essentially flawlessly through complexities that have tripped up many others, and they grew revenues at a 55% CAGR. We undoubtedly benefited from COVID stay-at-home mandates.\n\nBut in 2022, we experienced the operational challenges we have well described in prior calls. These problems have been addressed and are now in our rearview mirror. Our teams have rallied and executed well to begin the process of regaining market share and position. Moving on to Unity Game Services or UGS.\n\nWe are pleased with the uptake for UGS since going general availability this summer. UGS unifies in a single suite more than a dozen analytics tools, cloud orchestration, and embedded voice and multiplayer functionality. UGS is an example of how we address acute needs, reduce complexity for our customers. We price these services on a consumption basis.\n\nSo, studios only pay for what they use, and we scale as they succeed. UGS also unlocks added synergy on our model. Create, Operate and UGS working together solve more of our customers' key challenges. A great example is how developers at SecondDinner use our editor to build Marvel:Snap.\n\nOur editor seamlessly connects to our UGS services, which made it a simple decision for SecondDinner to self-provision our cloud content delivery and cloud-built modules that are part of UGS. The result was a blockbuster game, has brilliant design combined with exceptional user experience delivered by UGS. This is our mission for every creator. In September, we introduced Multiplay and Matchmaker self-serve.\n\nThe mobile game market is evolving and will evolve to player-versus-player, much in the way that the market for console games and PC games have evolved. Multiplayer games have proven to realize much greater player engagement. Players enjoy them more. And with more engagement comes more opportunity for revenue.\n\nBut until now, building multiplayer functionality for mobile games was just too complex. With the launch of these two self-serve products, we solve this difficult networking challenge and made the technology easy to provision and manage at scale for developers and studios of all sizes. With that, I'll step back and look at the games ad market overall. The current softness in the ad market weighs on my mind.\n\nI want to address this with you to put future performance and plans into context. One key question: What has happened in the games ads market overall in recent years in light of Apple's changes in privacy programs, which began in Q2 2021? While we did see some change in spend between iOS and Android, the overall ad market had an incredible year in 2021, partly fueled by higher player engagement due to players being at home during COVID. Looking at 2022, Q1 2022 was strong for in-game ad sector, with year-on-year growth in the teens. We estimate overall in-game ads growth was up approximately 10% year on year in Q2 and slowed to low single digits in Q3.\n\nWe currently expect the sector will be flat year on year in Q4. In terms of player engagement, as the first half of 2022 unfolded, we began to see some softness in overall player engagement versus the elevated COVID levels of 2020 and 2021. But it's important to note that engagement was up cumulatively a full three years' worth versus pre COVID. And when we look at daily active users, or DAUs, we're actually seeing an increase in Q3 this year versus Q3 of last year.\n\nDespite market conditions, users continue downloading and playing games, proving the sticking power of this entertainment segment. This speaks to the long-term resilience of the game business. What is new starting in like Q3 is that CPMs have to clog on both mobile operating systems. The timing here is clear.\n\nThe declines take place as the world's banks increased interest rates and the spectrum of recession was everywhere in the press, not earlier when privacy changes took place. When we talk with our advertisers, the sense we get is clearly one of caution and reticence to commit to the aggressive campaign spends that would crowd out competition at the bid and elevate CPMs. In this context, we remain confident. The market for ad is experiencing recession sentiment.\n\nAnd while we don't know when it will end, strong consumer engagement will ultimately bring back growth in this dynamic ads market. With ironSource, we become the leading end-to-end platform in the market, supporting the developer throughout the entire development cycle from opening project in Unity Editor, all the way through making a successful business and supported by our data science. As such, we are positioned to lead the market and be the main beneficiaries of a market recovery. While market conditions are challenging, we have a unique opportunity to gain market share and invest in positioning ourselves to grow rapidly once macro conditions improve.\n\nOur end-to-end platform will be a critical enabler in helping creators thrive even in a challenging market. By enabling more game creators to build successful businesses ultimately will be growing the market overall. LevelPlay becomes Unity's mediation offering, delivering unparalleled reach to creators, help tap into a combined global network of players of more than 3 billion monthly active users. Unity LevelPlay will have plug-in integration to the Unity Editor and deliver superior performance for the Unity Ads and ironSource ads networks, while supersonic critical publishing capabilities to our offering, helping even more developers successfully launch and scale their games.\n\nWe believe the new Unity Grow platform can and will materially outperform the industry, gaining share through our ability to drive success for our customers. Before turning the call over to Luis, I want to reinforce a few points that we've made before. First, Unity is well-positioned to capture what we believe is a very large opportunity as the world moves from linear 2D to real-time 3D. We have a strong position in games and are making strong progress across industries.\n\nSecond, we believe that Unity with ironSource provides a unique end-to-end platform that sells more of our customers' toughest challenges, enabling us to accelerate our revenue growth, making Unity cash flow positive, and add new capabilities and amazing leaders. We believe the new Unity growth platform can and will materially outperform the industry, gaining share due to our ability to drive success for our customers. Third, advertising is an integral part of the games business model. Gamers are highly engaged, and only a small minority pay directly for the games they apply.\n\nAdvertising and in-app purchases by the way creators monetize their games. And most players welcome ads as a way to discover new games to play. And while we are in an advertiser sentiment recession, we believe that the ads market will remain resilient, even with last year's changes to privacy. We expect Unity to sustainably grow at a 30% growth rate.\n\nAs we have said in the past, this will not be the case every single year but is the compounded growth rate that we expect to deliver. We will guide 2023 in our year-end earnings call when we have a better view on the economy, and in particular, the in-games ad spend trends. At that point, we have a much better handle on advertiser sentiment. We have clear plans for Create to continue to deliver strong growth and for growth to outpace any ad market we experienced.\n\nFinally, what about profitability and cash flow? Luis will dive into this in more detail. But in the fourth quarter, we will be positive. This has always been important to us. It's even more important in challenging times.\n\nThis strong financial position is further testament to our ability to capitalize on the opportunity ahead of us. With that, let me turn the call over to Luis.\n\nLuis Visoso -- Senior Vice President and Chief Financial Officer\n\nThank you, John. The third quarter came in line with guidance for revenue and non-GAAP operating income. Create continues to perform strongly, and our operating challenges from the beginning of the year are behind us. In the third quarter of 2022, we delivered revenue of $323 million, up 13% year over year and in the middle of our guidance range.\n\nCreate continue to execute well with revenue of $129 million or 54% from a year ago. Despite the challenging economic environment, Operate delivered $172 million in revenue, up 8% quarter on quarter and 7% below a year ago. Strategic partnerships and other delivered $23 million in revenue, up 28% from a year earlier. At the end of the third quarter, we had 1,075 customers with trailing 12 months revenue above $100,000.\n\nThis compares to 973 customers at the end of the third quarter of 2021. The lower rate of growth in our customer count above $100,000 is driven by Operate. Our 12-month trailing net dollar expansion rate came in at 111%, down from 142% last year. The drop in our net dollar expansion rate is driven by our operating business.\n\nOur third quarter net non-GAAP gross margin was 74%, down from 81% a year ago. The year-on-year gross margin decline is mainly due to the lower mix from monetization, which has a higher gross margin than the average, as well as the impact of Weta as engineers supporting that business are charged to cost of goods sold. Non-GAAP operating expenses increased 16% versus last year's third quarter and 4% sequential as our cost containment efforts continue to take hold. We expect to significantly overdeliver against our $100 million cost savings plan discussed at the end of the second quarter.\n\nWe closed the quarter with 6,244 employees as compared to 6,246 employees at the end of the second quarter. Non-GAAP operating income for the third quarter was negative $37 million or negative 12% of revenue. This compares to guide of negative $35 million to $50 million. Cash flow from operations was negative $70 million, which includes an $18 million payment to a publisher that had not collected their payout for several years and a $10 million M&A cash payment that is excluded from non-GAAP operating income.\n\nUnity had 301 million basic shares outstanding and 403 million fully diluted shares at the end of the third quarter. The difference in fully diluted shares compared to our Q2 guidance of $375 million is entirely driven to the lower share price, which impacts the conversion of the convertible notes. Moving on to the fourth quarter. Our guide includes ironSource financial results as of Monday this week and our best estimate of the impact of economic environment.\n\nFor the fourth quarter, we expect revenue between $425 million to $445 million, an increase of 35% to 41% year on year. We expect full-year revenue between $1,365 million and $1,385 million, an increase of 23% to 25% year on year. Let me break down the details. First, this is down approximately $60 million from the time-adjusted prior guide for the combined companies.\n\nSecond, within this, we expect CRE to continue to perform strongly. With regards to ads, we have taken a conservative view this quarter, and given that we have not yet seen the seasonal rise in CPMs that typically happens during the holidays. We have reasons to be optimistic given our recent gains in mediation and the expectation that this can result in share gains. For the fourth quarter, we're guiding non-GAAP operating income between $5 million and $15 million.\n\nImplied full-year non-GAAP operating income is between negative $88 million and $98 million. For perspective, we expect Unity to break even and be cash flow positive at the end of this year. We will build from that base in 2023. With the ironSource merger, we issued approximately 113 million shares.\n\nIn addition, we issued $1 billion of convertible notes with a 2% interest rate and a $48.89 conversion price. We expect to have 416 million basic shares outstanding and 562 million fully diluted shares at the end of Q4, which includes 46 million shares to convert a convertible notes and 29 million shares to convert the pipe investment. We will provide full-year guidance for 2023 with Q4 earnings. Our guidance will factor in the very large opportunity in front of us.\n\nthe synergies from the ironSource merger and the near-term impact of the potential economic recession. We remain committed to our $1 billion EBITDA run rate goal by the end of 2024 and to deliver significant EBITDA and free cash flow progress in 2023. Near term, we're cautious given the potential for recession. While we expect to expand market share in 2023, as long as the ad market sentiment remains one-off recession, we expect to guide revenue growth lower than our sustainable growth target.\n\nTo close, we believe that the real-time 3D opportunity is very large, and we are very well positioned to capture it, given our strong capabilities in Create and Operate. In Create, we enjoy a leading and growing market share position in games. We have best-in-class artist tools with Weta, Ziva, and SpeedTree, and strong customer pool with over 750 leads generated at SIGGRAPH. We're making strong progress to scale our Digital Twin business with the launch of platforms that automate services such as presence and notations, 3D data, identity, data workflows, and live stream data.\n\nAnd we're evolving our business models to be cloud-based and ratable, and we're very optimistic on the CRE business. Within Grow, ads remains a critical part of the game industry. The ironSource merger strengthens our position within with the best mediation platform out there, Unity LevelPlay. The leading game publisher, SuperSonic, three ad networks with Unity Ads, ironSource, and Tapjoy, and the leading device management would partner with Aura.\n\nWe're optimistic about this business and our ability to build market share yet tempered by the market expectations. With that, let me turn the call over to Richard, who will coordinate the Q&A.\n\nRichard Davis\n\nGreat. Well, thanks very much, everyone. You all kind of know the plan. And raise your virtual hands, and we'll answer questions for the next 20, 25 minutes.\n\nI guess our questions are -- our answers are so good.\n\nLuis Visoso -- Senior Vice President and Chief Financial Officer\n\nI think there is a hand raised by Tim Nollen.\n\nRichard Davis\n\nYou see Tim? OK.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nYes.\n\nRichard Davis\n\nThere you go, Tim. Thanks, John.\n\nTim Nollen -- Macquarie Group -- Analyst\n\nThanks, I guess. Well, a lot of information to digest. Could you maybe -- I may have completely missed this, but could you give us some indication of ironSource results quarter at least what the revenue growth was. And then could you speak a bit more about the mediation platform and the market share gains and kind of a multipart question here.\n\nGiven the issues that you had earlier in the year, and you see that problems are behind you, were you indicating that you are already regaining market share from that? Or are you saying you can gain market share now with the mediation platform that ironSource brings in? Thanks.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nLook, I'll take a little bit of that and ask Luis to add to it. So, first off, we didn't provide independent and separate ironSource results. Luis may want to speak to the why and explanation on that. Secondly, what we would say is, from this point, we're combined.\n\nAnd on the network side, really, really strong growth on the Create side. I think we just reported 54% growth in the third quarter, and things have been going well all year for us with strong gains across the portfolio in gaming and Digital Twins. And the recent launch of the Digital Twin platform adds ratable revenue. In terms of the ad network side, we're -- our expectation -- because now we do mix these things and work them together, but our expectation in Q4 is to be slightly up in combined network year over year in a flat market, so it implies a little bit of market share gains.\n\nWhat we're seeing in the market goes -- a very large number of customers are excited by the combination of Unity and ironSource and coming our way.\n\nTim Nollen -- Macquarie Group -- Analyst\n\nYeah. Sorry. Luis, go ahead.\n\nLuis Visoso -- Senior Vice President and Chief Financial Officer\n\nYeah. Tim, just -- we closed the transaction last -- this Monday. So, we are not reporting Q3 together as companies. We will we guided together for Q4, and we will report Q4 as a combined company.\n\nTim Nollen -- Macquarie Group -- Analyst\n\nOK. So, no ironSource stand-alone Q3 revenue number to share?\n\nLuis Visoso -- Senior Vice President and Chief Financial Officer\n\nThat is correct, Tim.\n\nTim Nollen -- Macquarie Group -- Analyst\n\nOK. And I know you've only owned it for two days or three days or whatever it is now. Anything you can tell us that you actually got the cover off the new merger now?\n\nLuis Visoso -- Senior Vice President and Chief Financial Officer\n\nYeah. I'll tell you I'm super excited. Super, super excited. I think that getting the two companies together is going to be super helpful for us, and I'm very optimistic on the value we can create for our customers and our shareholders.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nYeah. Just to build on that, I'm super excited as well. The management teams have come together super well, positive energy, synergy really at the executive level and all the way through the organization. The second thing is just a reminder how complementary the offering is.\n\nSo, our biggest gap was mediation. We now have a leading and I think, best-in-class mediation solution with LevelPlay. Secondly, their skill set and offering in products like Super Sonic on the publishing side, which leads to ad revenue growth, but also, it's an independent business unto itself but is profitable. And then on top of that, businesses that we don't spend a lot of time talking about like Aura, which is a kind of strong position, good growth.\n\nAnd then Luna, some folks have a little bit of anxiety around Apple entering the ad space. Well, Luna is one of the very few partners there, and it's an opportunity for that transacted a less of a threat or more of an opportunity to grow for us.\n\nRichard Davis\n\nThanks, John. Great. Jason?\n\nUnknown speaker\n\nI just had a question for Luis. You know, before everything slowed down in the mobile ad market, and if I just looked at the consensus numbers for where the Street was on ironSource and for Unity and add in the synergies, the Street wasn't at $1 billion of EBITDA by 2024. And yet, if I heard you correctly, you're sort of standing by that sort of outlook for the year after next, 2024. Is that accurate?\n\nLuis Visoso -- Senior Vice President and Chief Financial Officer\n\nYeah. And just to be super clear, Jason, the $1 billion is our run rate at the end of 2024 is not a forecast for the full year. So, what we're saying at the end of the year, we'll be at that rate. And we continue to believe that that's the right place to be for us.\n\nWe believe there is a significant revenue opportunity between the two companies, as we've talked back in July, and there is a significant cost opportunity and we'll be driving them and will create a lot of value, we believe. So, yes, we're standing by the $1 billion by the end 2024.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nAnd really important just to keep them in mind, really rapid growth on Create, very confident in our business there. What we're seeing across Pro Art and Digital Twins and the gaming sector makes us feel really good. And I mentioned in the prepared comments, our everywhere strategy, what we're getting with customers in a remote hybrid model is very strong as well. And then drivers on the network or the ad side are also really strong.\n\nWe've got -- we think we can gain share in virtually any market, and we feel good about that combination. The gap in our network to locking mediation is a big part of it. The data combination is a new combination that yields upside for us and our customers. So, we feel quite good about the combination, and I don't see any reason to sort of walk away now.\n\nOf course, we will be giving guidance in the early part of the year, we'll have a much better fix on the economy at that point, and we'll be ready to talk then.\n\nUnknown speaker\n\nOK. Super helpful. Thank you.\n\nRichard Davis\n\nHey, Clark Lampen.\n\nClark Lampen -- BTIG -- Analyst\n\nHey, guys, can you hear me?\n\nRichard Davis\n\nYep.\n\nClark Lampen -- BTIG -- Analyst\n\nAll right. Wonderful. So, I --\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nWe lost him.\n\nLuis Visoso -- Senior Vice President and Chief Financial Officer\n\nWe lost Clark.\n\nRichard Davis\n\nThere we go. He'll probably pop back in, hopefully. We didn't quite get enough of the question, I think, to answer that one. There we are.\n\nClark's back.\n\nClark Lampen -- BTIG -- Analyst\n\nAm I back now?\n\nRichard Davis\n\nYou're back.\n\nClark Lampen -- BTIG -- Analyst\n\nCan you hear me?\n\nRichard Davis\n\nYes.\n\nClark Lampen -- BTIG -- Analyst\n\nOK. Sorry about that. So, John, earlier in the call, you were talking about the value for developers in a tougher operating environment with an end-to-end platform. And I'm curious if you could give us a sense for although it's only been three days now, the undertaking with integrating all of these sort of pieces together and bringing a solution for building pre-launch optimization and monetization together, is that something that is really sort of Hercules and then sort of bringing everything together? Or is this more think about the opposite end of the spectrum, basically just a reskinning where you're bringing together everything in the dashboard and that can come to market pretty soon? Second question I have is on the pricing adjustment that was made this quarter.\n\nI know that sort of just started to take effect, but is it possible that you could give us a sense for how much that's contributing to Create in the quarter? And bigger picture, you guys talked about the way that there are new features being bundled in to help, I guess, sort of provide some value alongside that uptick in price. Should we expect that going forward, price hikes could become maybe a more ordinary course of business? Thanks a lot.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nLuis -- and I will take that 17-part question. Do our best to remember it as we go along. So, first off, the combined synergies, if you will, from Grow to Create. So, there's multiple layers to this, but think sooner than later.\n\nThe vision isn't long out there. It's in front of us. We've been talking about a long time with the key part of what we investigated when we looked into the merger with ironSource. It is an area where the coincidence of opinion between our Create team and Grow team is exceptionally high, and there's effort on that front.\n\nThe second thing is I gave you an example today of what we're doing just that with the new Marvel top-of-the-chart game, but is, in fact, doing just that across the Unity portfolio but not yet the ironSource portfolio, but they will. I'd also mention something as simple as a plug-in. So, we can do things like a plug-in for our LevelPlay mediation into the editor. When a customer is up and coming and they're trying to figure out what tools and what SDK, it may not be obvious to everybody in the investment community, but a creator makes a game, and then suddenly, they're faced with what feels like a grocery aisle is full of potential SDKs.\n\nWhat do they want to integrate? One of the massive advantages in why we're doing well with UGS and Multiplay and why we know this will help us do better, for example, with living with mediation, is a lot of the time these choices are made prelaunch. There isn't a commercial application. They're testing things. And they test on Unity more often than not when they're building on Unity.\n\nAnd of course, most of this takes place in mobile. And as we've indicated multiple times, we have north of a 70% share. So, we'll be talking a lot about synergy. I think it's easy to imagine that we did this to make up -- the merger to make up for a gap in mediation.\n\nThere is so much more to this. When we talk to our board, literally all we talk about is the synergy across the ecosystem and exactly how we're going to realize it. We have a board meeting in December. We'll be hitting on that point again.\n\nWe'll be sharing a lot more with you in the next call. Now, on that side of the business, Luis will pick up some piece, and I'll come back.\n\nLuis Visoso -- Senior Vice President and Chief Financial Officer\n\nYes. On the pricing question, we think that this is the right move. And we will -- we have not seen any financial impact in Q3. As you may remember, we announced the pricing at the end of Q2, and it will take a little bit of time until we ramp, and we get new contracts into the new pricing.\n\nSo, you should expect really an impact in 2023, not in 2022.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nNow on this, we had explained how for game developers, Digital Twin customers, and others, enterprise customers. how we've refined our offering to better meet their needs. Essentially, what that really means is more enterprise-scale solutions for them and more cloud solutions for them, including the Digital Twin platform. Now, our customers like our SaaS model.\n\nThere was literally no resistance to the price increases, they felt the value was there. But the mold from here, the pattern from here is to save our customers money by connecting to them solutions that take out more costly approaches they have on their own, either through other third parties or developed on their own. The Digital Twin platform, for example, supports a number of things from hosting to sort of data manipulation and calculation work, build processes, etc. These are all really expensive things unbundled, and we can bring them together and generate ratable revenue for Unity in the process while saving our customers both big headaches and big money.\n\nLuis Visoso -- Senior Vice President and Chief Financial Officer\n\nYes. And, Clark, and as you alluded to, we're going to be innovating for each of our customer groups differently so that they get more value, and therefore, we can charge a fair price, so that they gain and we gain as well. So, that's kind of what we are trying to do, as John mentioned in his prepared remarks.\n\nClark Lampen -- BTIG -- Analyst\n\nThanks a lot.\n\nRichard Davis\n\nAnyone else? Next question up, Brent.\n\nUnknown speaker\n\nI apologize for a little background noise. I'm in the airport here. But I wanted to talk a little bit about the great business. I get the games ad markets got a lot of controversy, a lot of moving parts, will continue to be probably controversial well into next year.\n\nBut the Create business crossed over $0.5 billion for the first time this quarter on a run rate basis, triple-digit growth in the Anywhere Create segment. And then obviously, it looks like over 30% organic growth. What's the durability of this Create business kind of heading into a recession? What's the pipeline opportunity look like? Talk a little bit about the Create potential, particularly going into recession, where it looks like things are really strong. But how durable is that strength? Thanks.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nI'll take the start of that, and Luis may want to add. But look, Brent, we have strong conviction that this is a multibillion-dollar opportunity, and it's probably not just a single-digit billion-dollar opportunity. Second point is, while gaming is the majority of the business now, there are multiple sectors out there that look like they have the opportunity equal or possibly greater than gaming. So, while we are gaming heart and soul, we'd love the application outside of gaming.\n\nOne of the reasons we invested in Pro Art tools, one reason we invested in Anywhere, but to capitalize on that. The third thing is, as much as I love a SaaS model, I love even more the ratable model. And we're solving some really important problems for our customers, both in gaming and Digital Twins and across the spectrum of customer types. And my belief, frankly, is in the fullness of time, two, three years out, that ratable revenues will probably exceed our SaaS revenues.\n\nNow, this requires execution. We've got a great team on it. Mark Whitten, who you've met on prior calls, and you will see him again on future calls and can work lyrically about all the things we're doing and doing well and how we're gaining. But there's a lot of execution.\n\nBut here's the point. I don't think anyone can deny today -- well, you can laugh a little bit about the definition of the metaverse. I do often in some of the things people say, I don't know if I could roll my eyes fully Marty Feldman type. But I mean, they're on the back of my skull sometimes when I listen to what said.\n\nLet's take it really simple. The next era of the Internet is real-time, it's 3D. It's very likely going to be persistent, interactive, and social. To do that, you need to build it on a game engine or something like a game engine.\n\nWe have the leading position there. We're gaining across the board. We are thrilled by the opportunity, and we love the synergy back to gaming. What we gain when we work on technologies that support the auto industry with multi-billion poly models, that's really helpful for the game industry in future years when they get to models that are that big.\n\nAnd I can go on and on about how these things work for, whether it's rate racing or large-scale cloud compute. This will help across the board. One solution adapted modestly will work in both gaming and nongaming situations. So, I think it's really durable.\n\nI think it is really big. I love the momentum in the business. And I'm conscious of the fact that it's just a lot of execution. We've been executing well.\n\nAnd the hope is and the plan is to continue to do that.\n\nUnknown speaker\n\nYes, more color --\n\nLuis Visoso -- Senior Vice President and Chief Financial Officer\n\nYes. And maybe it was not clear in my prepared remarks, but I also think that the investment in our platform in digital twin is a massive investment. And basically, what it allows us to do is to build scale now because it requires less and less people to be able to build the Digital Twin business, which I think is going to enable us to grow a lot more faster in the future.\n\nUnknown speaker\n\nHelpful. One quick follow-up, Luis, for you. Any sense around the combined cash and investment level you have now post the pipe, post the notes? And maybe your appetite to do the buyback here? How aggressive is the governor? Is there limitations? Just trying to understand the scope of the cash and investment position and then the appetite to buy back.\n\nLuis Visoso -- Senior Vice President and Chief Financial Officer\n\nYes. I mean, as we talked before, the Board has approved a $2.5 billion share buyback program, and we'll be executing when we think it's appropriate, right? But we have all the authorizations to do that, Brent.\n\nUnknown speaker\n\nGreat. Thanks very much.\n\nRichard Davis\n\nThank you very much. Dylan Becker, are you on? There we go.\n\nDylan Becker -- William Blair and Company -- Analyst\n\nYes. There we go. You can hear guys, right?\n\nRichard Davis\n\nYes.\n\nDylan Becker -- William Blair and Company -- Analyst\n\nCool. Hi. Maybe starting with John, you made a comment around the elevated still engagements and download trends you're seeing in hearing, I guess, maybe how you think about this speaking to the importance of the monetization piece within the mobile ecosystem and maybe your as is long-term confidence in that return on ad spend once that broader sentiment shifts.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nSure. So, first off, I think it's probably worthwhile to dispel a couple of myths that are out there. One of them is that mobile gaming is down. Engagement is up, and I've been paying attention, and I believe all five of the top five largest mobile game publishers reported on average 4% growth in the third quarter, revenue growth against our in-app purchase business.\n\nAnd of course, the ad business, most believe is outperforming that. So, I don't know, there's something about the dog ate my lunch in a world where the recession is on the front page of the newspaper every day, and you hear a lot about that. But I think the underlying fact support this thesis, and it's a pretty clear one. Yes, we are indexing over a period of elevated consumption with COVID that lasted a couple of years.\n\nThere is no question that we're holding up better than I would have thought against an incredibly challenging comp. And if you look at any sort of three-year time frame, I think it's really, really evident that we've gotten more than three years of growth in that time frame. So, gaming is a very healthy business. You asked about ROAS.\n\nThere is -- on a relative basis, it appears that are suffering a little bit more than ads on a relative basis. And that purchase is a major part of the ROAS model in terms of what actually makes the numbers work the way you want them to on user acquisition. And advertisers are generally more cautious than they have been focused more on near-term returns and long-term returns. A year ago, it was very easy for a publisher or a creator to say to themselves, yes, I've got a nine-month or a 12-month payback, and it's the second half of the year, but I'm going to invest in spend for the long term because the market is rewarding that.\n\nThe market doesn't seem to be rewarding that quite the same way they did when the next year is the return and this year IXION to spend. And so, the aggregate commitments have come down on OS commitments versus where they were. And that's reflected itself, as we mentioned in their comments on eCPMs. I, mean, basically, eCPMs are driven by competition for an opportunity to see.\n\nIt's a pretty straight bit of pressure-driven math. So, we've got this near-term challenge, and I don't know how long it's going to last, where sentiment is spooked and spends are coming under pressure. We expect the fourth quarter to be flat. We haven't assumed in our own forecast eCPM recovery.\n\neCPM is rising in Thanksgiving time frame to Christmas. It's almost as consistent as the sun comes up in the morning. But there's a number of reasons why we're cautious right now given the sentiment of what we're hearing from customers. So, on balance, if you look at the Unity portfolio against this, we've got more data.\n\nWe have strength of mediation. We think we're picking up a bit of share. We think that there's a temporary lull I don't know how long that lasts. Is it Q4 and bounces in Q1? I wouldn't bet on that.\n\nBut sometime in 2023, we expect some level of recovery. But right now, one of the things I think that Luis and I are trying to do that I think is very smart is model or expenses on no recovery. So, when we do see a recovery, we should see even better revenue and exceptional bottom-line performance.\n\nDylan Becker -- William Blair and Company -- Analyst\n\nGot it. That's super helpful. And then maybe one more if I could. As you talked about kind of some of the ongoing complexity across the end customer base here, obviously, dealing with macro data, live services.\n\nHow are these companies thinking about positioning Unity as that business enabler to address those challenges and headwinds? How should we think about the puts and takes there from a macro perspective from their view, as well as the increased reliance and maybe what some of that self-service capability and functionality you guys have called out can mean for incremental cross-sell and adoption there? Thanks.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nSo, Dylan, are you thinking more about nongame customers or game customers with your question?\n\nDylan Becker -- William Blair and Company -- Analyst\n\nWithin both, right? The ease of platform adoption, maybe more so from the self-service channel.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nOK. So, I mean, the big shift on the gaming side is getting to self-serve on matchmaking and setting up multiplayer gaming. That is a really hard thing to do for a developer. I can remember when games went on the PC and console side to multiplayer, and single-player campaigns were deemphasized.\n\nA lot of companies in the games industry back then, this was the sort of the late '90s, they were not a business. It was just too complex. And if they couldn't pull it off, they have their lunch eaten by their competition because what was happening is we were seeing 200%, 300%, 400% increase in engagement against games that had ongoing content and multiplayer PvP experiences. That is not lost on mobile players today.\n\nSo, the people competing in the mobile marketplace largely new single-player games or synchronous single-player games. We kind of play against the score produced from another player. That gets better engagement than a straight-up single-player game, but it's not as much engagement as a multiplayer game. And consider engagement is essentially a proxy for revenue.\n\nAnd so, more engagement, more revenue. So, we really hit something big, I think, with UGS by making these service -- these products self-serve. As recently as, I don't know, six months ago, even with a lot of our support, it was a multi-month process. It just wasn't something most people could get to.\n\nNow it's not quite push-a-button, but it is a simple process. And I think anybody that is trying to serve their customer well, give their customer the experience they want and the benefits of delivering what that customer wants in terms of their own business is going to move onto this platform. I expect multiplayer gaming to be a bigger story in years to come. I remember it takes six, nine, 12 months to get to shift our emphasis from a single player to multiplayer, but it's now starting to happen.\n\nOutside of gaming, I interact with a lot of customers face to face, and auto companies and fashion companies and people and architecture, engineering, construction, etc. And what was really sort of the truth maybe three, four, and five years ago is it was experimental. They were setting something up because they were curious. They felt like it might be the future.\n\nBut a fair amount of the time, what you would see is they start on one project would pivot two or three different ways as experimental projects do in large organizations. Increasingly, we are seeing a focus on the same things that are getting repeated over and over again or areas where customers are aggregating with really strong desire, almost a FOMO sense. If they don't get there, they're going to get beat by their customers. So, within the fashion industry, and the high-end fasten industry, for example, that's digital trials, with the cities and airports, it's a straight-up Digital Twin and manufacturing large buildings with architecture with visualization.\n\nAnd so, these are big compute projects, which is one of the reasons we like our Digital Twin platform. We built the platform because it follows a real need. It does for these users, what multiplayer self-serve does for the game developers. It gives them what they need and what they want without an alphabet soup and a lot of confusion.\n\nIt is plug it and it works. Now, we're in the process of close testing that with a handful of customers. But I believe that will actually be the lion's share of our revenue in years to come because, frankly, there's a lot more business in compute and transportive data uniquely married to the Unity tools for rendering and animation, and lighting than there is in the tool to just pay by the seat to make it. So, we're excited about that part of our business.\n\nSo, obviously, gaming is at a different stage than the Digital Twin marketplace, but the Digital Twin marketplace is moving pretty quick. And there's literally a name brand company and our board boardroom right where I sit on. And literally, every day, I come into the office, I end up tripping across the kinds of people that you would think is owning some of the world's most important brands and companies.\n\nRichard Davis\n\nStephen Ju, are you around? There we go.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nSorry. All right. So, for the almost the entirety of this call, I think we've been talking about the ad spend from the game sector, but there is a wider group of advertisers, Unity can be talking to. So, is there a way to characterize what percentage of your ad dollars is coming from, say, the nongaming companies? And what you may need to do to onboard, say, the large CPG or other performance-oriented advertisers to become large customers on your platform? Thanks.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nStephen, that's a really great question. And it's still a small minority of our business as nonperformance-based advertising. You're speaking to brand advertising. And one of the major priorities for us as we look forward to the combined resources of the two companies is to get behind in a more fulsome way, pure brand advertising in the context of gaming.\n\nWe typically track just within Unity well north of 3 billion MAUs a month. There is no larger audience that can be realized through paid media. And we know these are very engaged consumers. So, we talked about brand advertising.\n\nThey're definitely in there. They're coming in through various DSPs. But I think for this sector, we need to do more work on the types of ad units that I think will attract that audience. And because it's been so strong and performance ads for game companies, it's -- they win the eCPM contest.\n\nThey win the bid because the install is so valuable. And it's not that people haven't tried, but I think that's true across the board in gaming is it's been game-centric, but I see a lot of opportunity outside of that. We're working on innovation on that front. But think of it as single digits.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nThank you.\n\nRichard Davis\n\nGreat. Matt Cost, are you on? Here we go. Matt is off. OK.\n\nAny other follow-up questions? Gal? There you go. There you go.\n\nUnknown speaker\n\nCan you hear me?\n\nRichard Davis\n\nYes.\n\nUnknown speaker\n\nGotcha. Thanks. Just wanted to follow up on the digital twin. What is the timeline coming out of the alpha-to-beta test potentially or like figuring out what the different industry looks like, which industries could be the first when you for real due to GA? And then maybe just from a monetization perspective, how are you thinking about Digital Twin and the ability to monetize that in light of all the business models you have today?\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nSo, on the last call, we -- and we don't update the statistics every quarter. We have like 40 reporting segments, but if we did -- but now we will continue to update. We pointed out that the digital twin side of our business across professional services and license revenue was 40%. So, it's obviously been growing really rapidly to get to that number.\n\nAt the time of the IPO, and not that long a little over a year, almost two years ago, we said 50% within five years. We're moving ahead of that schedule. And so, the second point is there's a process of a Digital Twins platform. First, bringing it sort of private beta and then broader availability before there's general availability.\n\nAnd so, that will take place -- all of that will take place in 2023, probably, I guess, roughly the first half of next year before that's fully complete. I'll update that on the next call, so everyone has it. And then lastly, I'd tell you that it's a general-purpose platform. And it's basically for doing compute and moving data.\n\nThe hard things that -- and allowing people to interact with one another. So, it's not necessarily a captive to a specific industry, but I would give you back the same industry sector, as I said, we're seeing current traction and are likely to be the first user. So, visualization, simulation around cities and such, fashion is something that I think is going to need to do this because they're going to have to do some really complex, really compositing to make those images work and architecture and construction, manufacturing lines, that's where the supply is, and those are the same verticals that we're seeing show up in our pipeline now.\n\nUnknown speaker\n\nThank you.\n\nRichard Davis\n\nThat's great. Go ahead. You had another question, Gal?\n\nUnknown speaker\n\nYeah, I had another one if that's OK. Just on the core Operate, John, you mentioned you backed yourself to kind of go out there and win share again. How much of that is because of the tie-up now with ironSource? I'm just thinking this machine is very, very powerful versus how much is it just thinking about the core, let's call it, pure heritage Operate business on its own, even if you didn't have ironSource going out there today, and grabbing some of that share back?\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nLook, I'm not sure I got all that question. It's a little garbled on my end. But ironSource is a definite strengthening of our portfolio, and it adds a great deal to us with a wonderful team led by Tomer, planning that and with a great team from Ingrid, it puts us in a much better spot. So, ironSource is additive to us at literally every level, not just on what you thought of as operator, just what you thought of as which we now call grow, it also has tools that can integrate deeply into the other.\n\nIt can help us realize that vision we've talked about from the first time we announced the deal with ironSource, which is helping people build more performance games and applications. So, it will be -- it will help them make a better product. And if it helps them make a better product, then the rest of our services will get much substantially increased uptake. People don't advertise products that people don't have high engagement as an example.\n\nBut they also don't rent multiplayer servers for products that don't have high engagement because there's not enough of a user base there. So, there's -- obviously, self-interest in helping our customers be successful because when they are, they use our services more.\n\nLuis Visoso -- Senior Vice President and Chief Financial Officer\n\nAnd, Gal, that question will be even more difficult to answer going forward, because we plan on integrating the two businesses, right? And that's where we see a lot of value. So, it's a --\n\nUnknown speaker\n\nI think that was my question, right? How much does the tie-up, kind of the ability to go and check --\n\nLuis Visoso -- Senior Vice President and Chief Financial Officer\n\nTotally, totally. We see a lot of value in getting together, as we've said.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nSo, Gal, I mean, a good point. Let me give one example. The data from LevelPlay supports both networks now. The data from both network supports LevelPlay now.\n\nAnd we're consolidating those teams. It would be -- I know it sounds like -- I know people would love to see independent reporting, but it all full circle to do that given the degree of integration and the benefit we see from the data integration is just one singular example. What drove the number? We want to win, Gal. We want to win in this market, and that's what we intend to do.\n\nUnknown speaker\n\nThank you.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nThank you, Gal.\n\nRichard Davis\n\nWell, thank you all very much. We really appreciate it, and we look forward to seeing you at either various conferences or over the coming months and years. But we appreciate your interest and support. Thanks a lot.\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nThank you.\n\nLuis Visoso -- Senior Vice President and Chief Financial Officer\n\nThanks, all.\n\nDuration: 0 minutes\n\nRichard Davis\n\nJohn Riccitiello -- President, Chief Executive Officer, and Executive Chairman\n\nLuis Visoso -- Senior Vice President and Chief Financial Officer\n\nTim Nollen -- Macquarie Group -- Analyst\n\nUnknown speaker\n\nClark Lampen -- BTIG -- Analyst\n\nDylan Becker -- William Blair and Company -- Analyst\n\nStephen Ju -- Credit Suisse -- Analyst\n\nMore U analysis\n\nAll earnings call transcripts"
}