{
  "companyName": "Synchrony Financial",
  "companyTicker": "SYF",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/synchrony-financial-syf-q3-2022-earnings-call-tran/",
  "content": "Synchrony Financial (SYF 0.06%)\nQ3 2022 Earnings Call\nOct 25, 2022, 8:00 a.m. ET\n\nOperator\n\nWelcome to the Synchrony Financial third quarter 2022 earnings conference call. My name is Vanessa and I will be your operator for today's call. [Operator instructions] Please note that this conference is being recorded. I will now turn the call over to your host.\n\nKathryn Miller, senior vice president of investor relations. You may begin.\n\nKathryn Miller -- Senior Vice President, Investor Relations\n\nThank you, and good morning, everyone. Welcome to our quarterly earnings conference call. In addition to today's press release, we have provided a presentation that covers the topics we plan to address during our call. The press release, detailed financial schedules, and presentation are available on our website, synchronyfinancial.com.\n\nThis information can be accessed by going to the investor relations section of the website. Before we get started, I wanted to remind you that our comments today will include forward-looking statements. These statements are subject to risks and uncertainty, and actual results could differ materially. We list the factors that might cause actual results to differ materially in our SEC filings, which are available on our website.\n\nDuring the call, we will refer to non-GAAP financial measures in discussing the company's performance. You can find a reconciliation of these measures to GAAP financial measures in our materials for today's call. Finally, Synchrony Financial is not responsible for and does not edit or guarantee the accuracy of our earnings teleconference transcripts provided by third parties. The only authorized webcasts are located on our website.\n\nOn the call this morning are Brian Doubles, Synchrony's president and chief executive officer, and Brian Wenzel, executive vice president and chief financial officer. I will now turn the call over to Brian Doubles.\n\nBrian Doubles -- President and Chief Executive Officer\n\nThanks, Kathryn, and good morning, everyone. Synchrony delivered another strong quarter of financial results, highlighted by net earnings of $703 million or $1.47 per diluted share, a return on average assets of 2.8% and a return on tangible common equity of 26.6%. Synchrony's ability to deliver consistent growth and resilient returns is a testament to our well-diversified portfolio, our balanced approach to product, consumer and credit strategies and the strength of our differentiated business model. As we continue to leverage our advanced digital capabilities, expand our reach through new partners and distribution channels and further diversify our product suite, Synchrony further solidifies itself as the partner of choice for retailers, merchants, and providers alike.\n\nTo that end, we added or renewed 15 partners in the third quarter and are excited to be partnering again with Bassett and Floor & Decor. Bassett has chosen to partner with Synchrony again because they value three of Synchrony's core strengths. Our superior customer experience, our advanced data analytics and ability to leverage these data insights to drive growth and the unique marketing opportunities that exist through Synchrony's home network and marketplace, which will enable them to reach more customers and drive growth. Meanwhile, Floor & Decor has selected to partner with Synchrony again because of our ability to power a multiproduct offering for both consumers and commercial customers.\n\nFloor & Decor is a high-growth retailer and believes that Synchrony is best positioned to help them achieve their objectives. So whether they're looking for advanced data analytics and the powerful network effect of our marketplaces and networks, our seamless omnichannel experiences or our diverse suite of financial products and services, Synchrony is well positioned to deliver strong targeted outcomes for each of our partners. We are increasingly anywhere our customers seeks tailored payment and financing solutions, big or small purchases occurring in person or digitally. We leverage our industry expertise, broad distribution channels and dynamic financial ecosystem to connect our partners with customers whenever and however they want to be met with a broad range of products and services, attractive value propositions and seamless experiences that meet their needs at any given moment.\n\nAs a result, Synchrony continued to reach and serve more customers in the third quarter. On a core basis, excluding the impact of recent portfolio sales and in prior year periods, we added 5.8 million new accounts and increased core average active accounts by 8% year over year. Purchase volume grew 6% to $44.6 billion or 16% on a core basis, reflecting both the increase in accounts as well as higher engagement across those accounts with 8% higher spend per account versus last year. This continued strength in purchase volume was broad-based across our portfolio and a testament to the breadth and depth of our five sales platforms, the compelling value propositions we offer and a healthy consumer.\n\nAt the platform level, Synchrony achieved double-digit growth in our Diversified & Value, Health & Wellness, Digital and Home & Auto platforms and single-digit growth in our Lifestyle platform. More specifically, Home & Auto purchase volume was 11% higher, driven by strength in home, furniture and auto-related spend, as well as the impact of inflationary conditions on inventory, gasoline, and automotive parts. In Diversified & Value, purchase volume increased 20%, driven by higher out-of-partner spend, partner penetration growth and strong retailer performance. Lifestyle purchase volume grew 6%, reflecting an industry-specific rebound within Luxury and higher out-of-partner spend more broadly.\n\nThe 18% year-over-year increase in digital purchase volume generally reflected growth across the platform. We experienced greater customer engagement including higher active accounts and spend per account among our more established programs and continued momentum in our new program launches. The 16% increase in Health & Wellness purchase volume was driven by broad-based growth in active accounts and higher spend per active account in our Dental and Pet categories. We are particularly excited about the opportunities we see in our health and wellness platform to reach more patients and provide them with greater access to flexible financing.\n\nAs healthcare costs continue to rise and the burden of out-of-pocket expenses intensifies with the growth in high deductible healthcare plans, there is a clear and growing need for consumers to have access to the financial solutions that empower them with choice, choice in how and when they manage the cost of planned and unplanned medical procedures as well as elective care procedures. Today, Synchrony's Health & Wellness platform encompasses more than 260,000 provider locations, 17 health systems and approximately 75% of the country's dental and veterinarian practices through which we are expanding access to patient financing. We are a leader in patient care financing for the last 35 years, yet we know there is still more we can do to expand accessibility to Synchrony's patient financing product suite. We continue to expand our health and wellness partnerships and drive product and experience innovations.\n\nWe're also broadening our distribution channels to reach and serve more customers through integrations with practice management providers like Epic and health systems like St. Luke's. More recently, we announced our integration with Sycle, the audiology industry's No. 1 practice management solution.\n\nThrough this partnership, Synchrony will leverage Allegro Credit's leadership in the audiology industry and deliver a comprehensive set of financing options, including both CareCredit Healthcare credit card and Allegro Credit's Buy Now Pay Later financing solutions to more than 5,000 U.S.-based hearing clinics. Synchrony is deeply passionate about empowering Americans to have greater access to responsible and flexible financing options whenever and however they need it. As we continue to add and renew existing leaders in the health and wellness space, including our partnerships with Aspen, Heartland Dental, Sono Bello and American Society of Plastic Surgeons and expand our distribution channels with practice management software like Epic and Sycle. Synchrony is increasingly the financial ecosystem at the center of patients' daily lives, empowering them with choice and best-in-class value propositions that truly make a difference.\n\nWe believe there is no other consumer lender with the industry expertise, customer and provider reach, our innovative solutions to help close the gap between Americans patient needs and a suite of financial resources to address them. Turning now to Synchrony's Dual and Co-branded cards, where we also continue to demonstrate momentum. Purchase volume on these products grew 28% versus last year and represented about 39% of our total purchase volume for the quarter. When tracking average transaction value and frequency trends across the major out-of-partner spend categories of these products, we continue to see robust consumer demand across both discretionary and nondiscretionary categories.\n\nAs we would expect, there have been some modest seasonal shifts among a few of the major categories in favor of more education-related spend and less travel and entertainment spend. Otherwise, transaction values in gas and auto-related spend have continued to show growth in line with gas price trends and inflation, while grocery spend value is running relatively steady with the last few months. The more recent pullback in gas prices appears to have contributed to a slight acceleration in broader discretionary and nondiscretionary spend with categories like clothing, home furnishing and repair, bill pay and auto-related spending experiencing higher transaction value at similar frequency. Putting this all together, the daily and monthly touch points that Synchrony has with our customers across a broad range of purchases tells us that consumer health remained strong and supportive of demand.\n\nwhether they're taking care of everyday essentials like gas, groceries and medical expenses or making more episodic investments like buying a new mattress or replacing a refrigerator. Our customers are responsibly accessing financing for their needs, maximizing the value they seek and managing well overall as they navigate the pressures of inflation and the uncertainty of the markets. Importantly, Synchrony's customer insights also inform many of the strategies across our business. We utilize this data to deliver optimized financing solutions and experiences for our customers, greater outcomes for our partners and more predictive insights for Synchrony as we manage our portfolio to deliver appropriate risk-adjusted returns through cycles.\n\nOur sophisticated underwriting and diverse product suite allow us to respond quickly to changing consumer behaviors and market conditions. Synchrony combines our scale more than 100 million open accounts and billions of transactions with external data, including utility and telecom information, device identification and usage, cash flow and income data and also with partner data, like frequency and value of historical purchase, all to dimensionalize our customer and their transactions. This enables us to more effectively engage and service our customers, make better credit and fraud decisions, and drive prudent profitable growth. Once our customers begin utilizing our credit products, Synchrony leverages real-time indicators to monitor any shifts in our borrowers' financial well-being, from transaction and payment behavior characteristics to credit bureau alerts.\n\nWe are closely in tune with our customers and can make both account and portfolio level adjustments quickly. And of course, Synchrony's responsive digital capabilities are complemented by our fully scaled, highly experienced servicing teams to ensure that our customers have appropriate support when they need it. In short, Synchrony's dynamic technology platform is what powers our ability to have a finger on the pulse of each customer and harness the data into actionable insights so that we can optimize the outcomes for all stakeholders. We are able to say yes to more customers, more consistently and for the same level of risk even as market conditions change.\n\nThis is what ultimately provides invaluable continuity to our partners and customers and resilient risk-adjusted returns to our shareholders. And with that, I'll turn the call over to Brian to discuss the third quarter financial performance in greater detail.\n\nBrian Wenzel -- Executive Vice President and Chief Financial Officer\n\nThanks, Brian, and good morning, everyone. Synchrony's strong third quarter results reflected continued strength of consumer and broad-based demand for the wide range of products and services that our ecosystem seamlessly delivers. Purchase volume of $44.6 billion reflected a 6% increase compared to last year or 16% on a core basis. Continued strength in consumer spend, coupled with some moderation in the payment rate, contributed to 8% higher average balances per account versus last year and 13% growth in receivables or 14% on a Core basis.\n\nOur Dual and Co-branded cards accounted for 23% of core Receivables and increased 29% from the prior year. Net interest income increased 7% to $3.9 billion, primarily reflecting a 10% increase in interest and fees due to higher average loan receivables, partially offset by the impacts of the portfolios sold during the second quarter of 2022. On a Core basis, interest and fees increased 18%. [Inaudible] for the third quarter when normalizing for the prior year impact of portfolios recently sold was 17.6%, approximately 10 basis points lower than last year, while still approximately 200 basis points higher our historical average.\n\nNet interest margin was 15.52% in the third quarter, a year-over-year increase of 7 basis points. The primary driver of this increase was a 51-basis-point improvement in loan yields, which contributed 42 basis points to net interest margin. Stronger liquidity portfolio yield also contributed 29 basis points. These improvements in our loan and liquidity portfolio yields were partially offset by the anticipated increase in interest-bearing liability costs, which increased 74 basis points to 2.05% in the quarter and reduced net interest margin by 62 basis points.\n\nThe mix of interest-earning assets also reduced net interest margin by roughly two basis points. RSAs were $1.1 billion in the third quarter and 5% of average receivables. The $209 million year-over-year decrease was primarily driven by the impact of the portfolio sold in the second quarter of 2022 and program performance. Provision for credit losses was $929 million for the quarter.\n\nThe year-over-year increase reflected the impact of a growth-driven $294 million reserve build this year compared to a $407 million reserve release in the prior year. Other income decreased $50 million, primarily reflecting the impact of higher loyalty costs. Other expenses increased 11% to $1.1 billion, reflecting higher employee cost and other expenses. Total other expense included $27 million of additional marketing growth reinvestment of Q2's $120 million gain on sale proceeds.\n\nAs detailed in the appendix of our presentation, we expect that the gain on sale and the reinvestment made in the second, third and fourth quarters of this year, will be EPS neutral for the full year 2022. Our efficiency ratio for the third quarter was 36.5% compared to 38.7% last year. Excluding the effects of the gain on sale reinvestment, the efficiency ratio would have been 35.6% and approximately 310-basis-point improvement versus last year. Putting it all together, Synchrony generated net earnings of $703 million or $1.47 per diluted share for the third quarter.\n\nWe also generated a return on average assets of 2.8% and a return on tangible common equity of 26.6%. These strong net earnings and returns demonstrate the power and efficiency of our digitally enabled model, combined with the compelling value of our financial products and services we offer through our financial ecosystem. Synchrony is consistently able to meet a broad range of our customers' needs while maintaining cost and credit discipline, which allows us to sustainably grow while delivering consistent risk-adjusted returns. Next, I'll cover our key credit trends on Slide 8.\n\nWe continue to see signs of gradual normalization across the credit spectrum of our portfolio. The vast majority of our borrowers continue to perform consistently with or better than 2019 performance. We continue to monitor borrower behavior closely and note that consumers are still slowly working through excess savings levels from peak levels. The external data we track indicates due to the combination of summer spending and inflationary conditions, the proportion of customers who receive stimulus payments and have since spent the entire amount has increased approximately two percentage points since July, now around 40% compared to 38% a few months earlier.\n\nThe remaining 60% of customers sold out a portion or all of the stimulus still saved. When tracking consumer savings balance trends by tiers, zero to 2,500, 2,500 to 5,000 and balances greater than 5,000, the external data suggests that during the course of the third quarter, the top two tiers of seamless customers experienced balance reductions of approximately $300, but have begun to rebound, while the bottom here are seen at roughly $100 in runoff. Meanwhile, labor markets continue to be robust and portfolio payment rates remain elevated compared to our historical five-year average. This suggests to us that borrowers generally remain well positioned to support robust demand for goods and services while responsibly meeting their financial obligations.\n\nTurning to Synchrony's portfolio. Our 30-plus delinquency rate was 3.28% compared to 2.42% last year, and our 90-plus delinquency rate was 1.43% compared to 1.05% last year. Our third quarter net charge-off rate was 3% versus 2.18% last year. This 82 basis point year-over-year increase generally reflected the gradual progression of our credit losses toward our portfolio underwriting target of 5.5% to 6%.\n\nOur allowance for credit losses as a percent of loan receivables was 10.58%, down seven basis points from the 10.65% in the second quarter. Moving on to another source of Synchrony strength, our capital liquidity and funding. Deposits at the end of the third quarter reached $68.4 billion, an increase of $8.1 billion compared to last year. Our securitized and unsecured funding sources increased by $1.6 billion.\n\nAltogether, deposits represented 82% of our funding while securitized and unsecured debt represented 8% and 10%, respectively, at quarter end. Total liquidity, including undrawn credit facilities, was $20.3 billion, or 20.1% of our total assets, consistent with last year. We maintain a diversified approach to both our deposit base in secured and unsecured debt issuances and prioritize a strong and efficient funding foundation of at least 80% deposits. We expect to continue to grow our deposits to fund our growth, and we'll maintain an opportunistic approach to secured and unsecured issuances when market conditions are supportive of efficient funding.\n\nGenerally speaking, we manage our balance sheet to be interest rate neutral. That said, as we continue to grow our deposit base, and actively encourage a rotation from savings to CDs, we're actively extending our deposit duration. As a result, we expect to be slightly liability-sensitive over the near term, while we continue to manage interest rate through term maturities. It's also important to note that through the mutual alignment of economic interest and delivery of a minimum return on assets at the partner program level, Synchrony's RSA will provide some offsetting support to the impact of rising interest rates on our business.\n\nMoving on to discuss Synchrony's strong capital position. Note that we previously elected to take the benefit of the CECL transition rules issued by the joint federal banking agencies. As a result, starting this past January of 2022 and ending in January 2025, Synchrony makes an annual transitional adjustment of approximately 60 basis points to our regulatory capital metrics. The impact of CECL has already been recognized in our income statement and balance sheet.\n\nWith that in mind, we ended the quarter at 14.3% CET1 under the CECL transition rules, 280 basis points lower than last year's level of 17.1%. The Tier 1 capital ratio was 15.2% under the CECL transition rules compared to 18% last year. The total capital ratio decreased 280 basis points to 16.5%. And the Tier 1 capital plus reserve ratio on a fully phased-in basis decreased to 24.1% compared to 26.6% last year.\n\nWe continued our track record of robust capital returns in the third quarter. In total, we returned $1.1 billion to shareholders through $950 million of share repurchases and $109 million of common stock dividends. As of quarter end, our total remaining share repurchase authorization for the period ending June 2023 was $1.4 billion. Synchrony remains well positioned to continue to return considerable capital to our shareholders as guided by our business performance, marketing conditions and subject to our capital plan and regulatory restrictions.\n\nFinally, please note that our full-year 2022 outlook is outlined on Slide 11, which has been updated in the following ways. Ending loan receivable growth versus last year is now expected to be approximately 12% or more, up from 10% plus previously. The net charge-offs will be approximately 3.05% for the full year, down from our prior expectation of 3.15% and RSA as a percentage of average loan receivables will be approximately 5.10% for the full year, down from 5.25% previously. Turning to net interest margin and operating expenses.\n\nNet interest margin will be approximately 15.55%, up from approximately 15.50% and incorporates our latest view on the interest rate environment and funding needs. Operating expenses should continue their quarterly run rate of approximately $1.05 billion, excluding the impact of the gain on sale reinvestment plans which are detailed in the appendix of our earnings presentation. To conclude, Synchrony remains very well positioned to achieve our long-term financial operating targets as the environment normalizes. I'll now turn the call back over to Brian for his closing thoughts.\n\nBrian Doubles -- President and Chief Executive Officer\n\nThanks, Brian. Synchrony's third quarter financial performance highlighted the benefits of our highly diversified business. Across spend categories, product offerings and distribution channels and through our ever-growing network of partners, merchants and providers, Americans' financial needs are increasingly powered by the Synchrony ecosystem. Our ability to efficiently and dynamically leverage real-time data and deliver optimized financing solutions and experiences for our customers and partners, even as needs evolve and market conditions shift, is what enables Synchrony to consistently deliver the outcomes that matter most for our many stakeholders.\n\nUtility and value for our customers, sales and loyalty for our partners and providers and sustainable growth and consistent risk-adjusted returns to our shareholders. With that, I'll turn the call back to Kathryn to open the Q&A.\n\nKathryn Miller -- Senior Vice President, Investor Relations\n\nThat concludes our prepared remarks. We will now begin the Q&A session. [Operator instructions] Operator, please start the Q&A session. Thank you.\n\nOperator\n\n[Operator instructions] We have our first question from Ryan Nash with Goldman Sachs.\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nHey. Good morning, guys. So Brian, the fourth quarter net charge-off guide implies a little bit of a ramp. Can you maybe just talk about what is driving that? And then second, you had said in the past that you'd expect to approach more normal levels by the end of '23, call it, 5.5.\n\nAnd obviously, that implies a decent ramp from here. Can you maybe just talk about how you see credit progressing in the intermediate term? And what does this mean for the allowance? Thanks.\n\nBrian Wenzel -- Executive Vice President and Chief Financial Officer\n\nYes. Thanks, Ryan. So again, the guide for the quarter, better than our expectation, to be honest with you, as we exited out of the third quarter, delinquency and the loss is a little bit better than our expectation. And when we look at the attributes inside of the portfolio by credit grade, they're performing still better than 2019.\n\nSo the credit normalization ramp that we see is really on target from what we had projected. And I really view that -- we'll get back to that mean loss rate, as we exit out of 2023, absent a significant change in the macroeconomic event. When you think about the fourth quarter, I mean when you look at our 90-day plus past due delinquencies at $1.2 billion, that's going to lead to a rise in charge-off dollars, but not unexpected and not anything that we look at and say that we're concerned about relative to an accelerating credit normalization trend. So we feel good about credit.\n\nWe feel good about the portfolio distribution that we have. And we see back to 2019 levels, including in the nonprime population. So again, we're on target, absent a significant change in the macroeconomic event. When you then parlay that into reserves, when you think about the reserves that we have in the books now, clearly, when we look at the unemployment rate, when you have credit normalization, that unemployment rate is projected to be higher, right, in the core model.\n\nAnd then we have overlays for, I would say, a more conservative macro environment. So we believe that the reserve postings going forward, again, should be more growth-driven than anything else, which I think is what you're seeing here in the third quarter.\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nGot it. Thanks for the color. And then the margin is holding up better than expected, given the pace of rate hikes, but Brian, you did reiterate the balance sheet is somewhat liability sensitive. So can you maybe just talk about what is assumed in terms of loan and deposit betas? And then if you look out over the remainder of the rising rate cycle, where do you see the margin in betas going in a 5% Fed scenario just given your balance sheet positioning?\n\nBrian Wenzel -- Executive Vice President and Chief Financial Officer\n\nYes. So if you think about the betas that we've experienced to date. So if I look at high-yield savings, roughly around 70% when you think about your 12-month CD rate. When you look at that relative to a swap, it's between 75% and 80%.\n\nI would expect, Ryan, to see that tick up a little bit, say, high-yield savings around 80%, and you may see 12-month CDs go to around one. Again, I think a lot of this is going to depend upon the competition in the market and what funding needs people have. We need to remain competitive with both our digital partners as well as money market funds with regard to that. So we continue to be encouraged by the strong franchise.\n\nWe've been able to grow deposits after a couple of years of actually shrinking deposits to manage the margin. So we're encouraged with the franchise and what we're building there. And I think we've been opportunistic with regard to when we access the wholesale market and how we really operate inside both the CD and high-yield savings. We swung to a liability sensitive.\n\nWe're a little bit more this quarter, not materially more, but a little bit more. But I think locking in certificate of deposits for 12 to 16 months is going to set us up nicely for 2023. Again, we'll be back in January when we see where we exit out of 2022 from a Fed funds perspective and what the Fed anticipates a terminal growth rate will be and we'll back to provide some color on how to think about that in next year.\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nThanks for the call.\n\nOperator\n\nWe have our next question from Moshe Orenbuch with Credit Suisse.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nGreat. Thanks, Brian. Hoping you could kind of talk about as you think about that credit normalization. Obviously, one of the features of your P&L that's somewhat unique is the RSA and how that reflects and we've had some kind of puts and takes over the last several years and a good performance this quarter.\n\nBut could you talk a little bit about how, as that normalizes, how you would expect that RSA to behave over the course of 2023?\n\nBrian Wenzel -- Executive Vice President and Chief Financial Officer\n\nThanks, Moshe. Again, I think as we've said, and I know people have been frustrated with it, the RSA is acting as a design. So when charge-offs kind of troughed out, the RSA peak. Now we start to see charge-off dollars rising, partially offset by higher interest and fees.\n\nBut really seeing that flow through the RSA, which gave us a sub-5% RSA for this quarter, most certainly, we've incorporated that into the guide into the fourth quarter. Again, I think we'll be back in January to kind of give you the trajectory. There's nothing that we look at, Moshe, that says, as you move back toward that normalized mean loss rate of 5.5% that we're going to be outside of the traditional RSA range of 4% to 4.5%. So from a charge-off perspective, it's acting as designed and should go back.\n\nClearly, I think we're going to have to look at how net interest margin and program performance works. But again, we think generally, you're going to see the RSA rate trend down as charge-offs trend up.\n\nBrian Doubles -- President and Chief Executive Officer\n\nMoshe, the only thing I would add there is, you also have to remember that that also means that payment rate is going to moderate, and you'll have some top line benefit as well in interest and fees.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nPerfect. And just as a follow-up, I mean you did highlight both the percentage of the business and the growth rates kind of in your Co-brand and Dual Card portfolios. Maybe could you talk a little bit about whether -- how the plan over the next several years? Is the plan to grow that? Does that grow faster? And how do you think about that contributor to Synchrony's overall growth rate?\n\nBrian Doubles -- President and Chief Executive Officer\n\nYes. Look, I'll start and ask Brian to comment. I think, look, we try and grow all of our products as disciplined as we can, achieving risk-adjusted returns. So I think we've seen really good growth on Dual and Co-branded cards.\n\nSome of that's new program launches. Some of that is new value props that we've launched and refreshed in the last year or two. We really like that product. It's a great product to graduate customers into over time.\n\nSo if we start them in a private label card with a relatively modest line once we get comfortable with their creditworthiness and payment behavior, etc., and we get to know them and we get a sense for whether or not they're willing to spend outside of the brand, then we obviously look at them and upgrade them into a Dual card. So that's the strategy we've had for years. It works really well, both from a risk standpoint as well as a return standpoint. I don't know, Brian, if you want to?\n\nBrian Wenzel -- Executive Vice President and Chief Financial Officer\n\nYes. The only thing I'd highlight, Brian, you talked quite a bit about the multiproduct approach here and having the right product for our customers. And when you look at our partner bases, whether it's PayPal, Venmo, Verizon, Walgreens, and some of the other core retailers, TJX, Sam's, that product just fits nicely into the portfolio. And we do it in a line structure very different than our competitors.\n\nSo it allows us to control the risk in the portfolio and really optimize the balance.\n\nBrian Doubles -- President and Chief Executive Officer\n\nAnd frankly, some of our best, most engaged customers are customers who earn rewards outside of the brand, bring those points back into the brand and our partners really, they really value that. Those are long-term, very valued customers.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nThanks very much.\n\nOperator\n\nWe have our next question from Sanjay Sakhrani with KBW.\n\nKathryn Miller -- Senior Vice President, Investor Relations\n\nActually, Vanessa, I think Mihir Bhatia from BAML who has teed up.\n\nOperator\n\nPlease proceed, Mihir.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Hey. Good morning and thank you for taking my question. I wanted to ask just about the underwriting standards enroll. Have you tightened -- I mean I'm just looking at driving the lower new account this quarter, I'm just trying to understand what could be driving that?\n\nBrian Wenzel -- Executive Vice President and Chief Financial Officer\n\nYes. So when we go to the latter part. The lower new account is really the portfolio sold during the second quarter. If you look at it on a core basis, which strips out those portfolios, we're up 2%, and generated, again, 5.8 million new accounts.\n\nFrom an underwriting standpoint, we have not seen in the portfolio attributes which would require us to take kind of measures across the entire portfolio. That said, Mihir, we always are making refinements and changes to our underwriting standards. We look at partners and performance. So again, we don't see attributes where we need to take a broad-based action.\n\nBut we are most really taking some small refinements. I also want to go back to what's really unique about our underwriting and what we've done over the last several years is we have not relied upon credit to be the primary driver of growth. So we haven't changed our underwriting standards. We haven't gone out like a lot of other issuers to use that and credit lines in order to get new accounts.\n\nWe have people coming to us because they're the most loyal customers of our partners and really want to engage with the value propositions and the brand. And because we get so much data from our partners because we're using unique attributes, which we highlighted in PRISM at our investor day. And then you combine those attributes and rolling together, we think we're making actually hopefully smarter decisions on risk at the end of the day and not having to take more risk. And again, we see nothing that today says we need to tighten across the board.\n\nBut again, we have the abilities and the tools to manage that risk appropriately if we see a change in the portfolio.\n\nBrian Doubles -- President and Chief Executive Officer\n\nWe try to minimize the ups and downs for our partners as well. So to Brian's point, when times are really good, we don't dig a lot deeper and take advantage of that and then put ourselves in a position where we have to pull way back coming out. I think that consistency and that discipline is important, not just for our own risk and returns, but obviously for our partners, too. So they're not feeling the ups and downs.\n\nSo we try to stay as consistent as possible.\n\nBrian Wenzel -- Executive Vice President and Chief Financial Officer\n\nAnd just one final point on that, Mihir, just adding on to Brian's point. If you go back, we provided a chart before. If you look at the volatility in credit through cycles, we're just generally less volatile because of the way in which our line structures are in this underwriting standards and most certainly, you can go back, we've shown the chart a number of different times, and it's because the severity and the consistency kind of gives us a competitive advantage.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And then maybe just kind of following along with what you said, Brian, about being there for your partners, has that conversation started changing now? And particularly, I guess what I'm asking is around competitive intensity for new partner sign-ups? And are there particular opportunities maybe even with existing partners to grow products just in the pullback in some of the valuations and particularly on the fintech side, are you seeing some partners coming back to you saying, \"Hey, maybe you can add this product.\" Just like just trying to understand how those conversations are going and if there's any opportunities in just the competitive environment right now for partners?\n\nBrian Doubles -- President and Chief Executive Officer\n\nYes. Sure. So look, I would start by saying it's still a pretty competitive environment out there. I think given what has happened in some of the fintech space, you've seen a little bit of a pullback there and maybe a little bit less aggressive in terms of offers and rates, etc.\n\nBut what I'll tell you is that as we're out talking to our partners and prospects. What's really resonating right now is the multiproduct strategy, being able to offer Buy Now Pay Later, Pay in 4, migrating to other products in our portfolio. Because I think one of the things that our partners have seen is that depending on the consumer, depending on the product that's being purchased, and frankly, depending on the macroeconomic environment, Pay in 4 gets a lot more expensive in an environment where rates are rising at the pace that they're rising. And so I think partners have taken a step back and now they're trying to rationalize their point of sale and saying, \"Hey, look, how do I optimize this for the economy that I'm operating in for my consumer for what they're buying.\" And what's great is we can go in and say, look, for this product, we think it's a 12-month, six-month promotional financing product with an opportunity to upgrade them into a revolving product down the road.\n\nThat's pretty powerful. That's pretty powerful because it gives optionality and it helps them manage the expense side of the equation, too, in terms of what those financing offers cost them and what it takes out of their margins. So we're seeing really good traction in terms of the discussions that we're having out there both with our existing partners as well as new prospects.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\n Thank you. \n\nOperator\n\nOur next question is from Sanjay Sakhrani with KBW.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nThanks. Good morning. I guess first question for Brian Wenzel. On your comments related to being liability-sensitive.\n\nUnderstandably, you might have some headwinds on the NIM. But I'm just trying to think about NII. So your yield is obviously benefiting from rates, but also higher revolve. Could you just help us parse through that and think about NII going forward?\n\nBrian Wenzel -- Executive Vice President and Chief Financial Officer\n\nSure. Good morning, Sanjay. So when you think about NIM, if I think about it sequentially for the quarter, we picked up about 30 basis points of prime benefit in the yields. We locked up about four benefits relating to merchant discounts.\n\nSo when you look at the prime impact of 30 merchant discount for some of the investment portfolios on the cash position, picking up 16, we largely offset the interest expense increase. So certainly neutral. The important part, though, Sanjay, when I look at the price benefit, the effect of prime for the quarter was 4.75%. We tend to be a little bit slower the way our cards bill out and change APRs.\n\nSo we have some more room to increase that as we move into the fourth quarter. When you think about the merchant discount pricing, we're about 60% to 70% of that price through to our partners, and that's something that we try to be measured on and deal with competition. So we think that from a margin perspective, most certainly, I think in the guide in the fourth quarter, we should get those tailwinds kind of coming through again. Some of the portfolio will be resetting as you got a full quarter price for some of the CDs and things like that, that we put on in the third quarter as well as the increase in the high-yield savings, but we feel good about it.\n\nAgain, I think locking up at these rates, if you believe that the interest rate cycle is going to continue to move up here in the latter part of the fourth quarter into next year, having those particular positives and being a little bit liability sensitive right now, should benefit us next year as we move forward. Again, we'll be back in January with probably some more comprehensive thoughts on it, Sanjay. But that's kind of how to think about it. So we got a small lift when I go back to the revolve rate and late fees going up with delinquencies, partially offset by reversals.\n\nBut again, the prime rate is flowing through.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nGot it. And then maybe a question for Brian Doubles, just following up on what Mihir was asking earlier. I mean I kind of asked this question last quarter, but you have another quarter of a dislocation among fintech valuations. You've had the CFPB obviously come in with some comments on regulatory actions potentially for Buy Now Pay Later.\n\nI'm just curious if that's presenting an opportunity for you guys? Do you feel like there might be some more sensitive moves you can -- I mean, just broadly speaking, maybe you could just address that a little bit more?\n\nBrian Doubles -- President and Chief Executive Officer\n\nYes, sure, Sanjay. Look, I think we're absolutely playing off. I do think there's been a little bit of a checkup in the market now. Our partners are thinking about these products and how they want to design their point of sale for the future.\n\nAnd this is where, again, we think the multiproduct strategy wins over the long term. And I'll comment quickly on just the regulatory environment, we think also favors us. I mean we are heavily regulated today, as you know. And we would certainly advocate for a level playing field.\n\nThat doesn't exist today. So I think to the extent that some of these products around the periphery become more regulated and more scrutinized. Then, I think that's a net positive for us. And so I think there a few things that kind of play to our advantage.\n\nFor the first time in a few years, with valuations where they are, maybe that presents some attractive M&A opportunities, if there is something on the technology side that would be faster to buy than to build. So that's something that we're always looking at. We've got a very active M&A screen. I think we're also very disciplined, very focused on valuations.\n\nAnd that was one of the things that we didn't see over the last couple of years was attractive entry points. But again, that's something that we run a very active process on, and we'll continue to look at, but very disciplined around valuation and impact to EPS.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is from John Hecht with Jefferies.\n\nJohn Hecht -- Jefferies -- Analyst\n\nMorning, guys, and thanks for taking my questions. And Brian, you did get into this, you guys gave us good information about the different platforms, and you talked a little bit about the customers, different use of the products. But I'm wondering, I mean, just where we are in the cycle, given that we're kind of moving through an inflationary environment that I think is kind of new to all of us. Is there any kind of behavioral aspects of the customers that are changing that you think changes the value proposition, thinking about the different uses like Dual-purpose versus Co-brand versus the NPL.\n\nAre you seeing shifts in that? And does that give you any indications for what to kind of look for on the intermediate term?\n\nBrian Wenzel -- Executive Vice President and Chief Financial Officer\n\nYes. Let me start, and then Brian may add some commentary. John, when we look at the consumer spending behavior patterns. We're not seeing very much changed, right? They're being very consistent.\n\nThey are making choices, right, where people are saying, OK, maybe I'm sending a little bit more for grocery or gasoline and spending a little bit less on T&E. But we're seeing very much consistency as we think about average transaction value and frequency consistently throughout the year. And we look at it by credit grade by platform. We look at the world composition components.\n\nSo everything seems to be consistent. So the customer itself is not migrating or changing their spending behavior patterns. We continue to see just tremendous positive growth relative to our Millennial and Gen Z. They make about 25% of our sales.\n\nThey're our fastest-growing cohort at, call it, 400 to 500 basis points higher than the company average. So they continue to view that. Again, the value propositions have to resonate with the customers, and we continue to think that in the multiproduct and distribution model that we have, we just think it's attractive. So we have not seen the consumer from a spending behavior pattern change significantly.\n\nAgain, making smarter decisions, but overall level of spend, not really changing.\n\nBrian Doubles -- President and Chief Executive Officer\n\nI think what we're starting to see on the merchant side, and I think Brian covered the consumer really well. On the merchant side, I think we have started to see and we'll continue to see some adjustment in terms of what financing offers are presented to the customer because they are trying to manage in a higher interest rate environment, their costs. I mentioned that particularly you get to some of the really short-dated stuff is that gets pretty expensive if you're 0% to the consumer and the merchants paying for all of that. So we have seen some partners working to rationalize the product offerings inside of their businesses.\n\nJohn Hecht -- Jefferies -- Analyst\n\nOK. That's very helpful. And then second unrelated question. Just thinking about the RSA next year, as Brian, maybe you can remind us, as credit normalizes, is the correlation for the RSA delinquencies, provisions, charge-offs? And is there any seasonality or timing differences for us to think about there?\n\nBrian Wenzel -- Executive Vice President and Chief Financial Officer\n\nYes. John, we'll be back in January and 2023 as a whole. But I think if you think about the RSA, charge-offs move immediately through the RSA line, right? So you're going to see that impact as that normalizes into 2023, that will provide a benefit to the RSA. The other two components, I think, to think about is reserve postings, growth or otherwise, flow through the RSA a little bit of a lag.\n\nSo that will impact it. But again, Brian consistently points out rightfully so that as credit normalizes, we would expect to see your revenue increase and the yield increase on the portfolio. So again, if we don't see the payment rate change, you're not going to have that normalization. They have to work in concert.\n\nSo again, I think those are the general gives and takes. I think the other thing will be how cost of funds really moves and that flows through as a benefit to the RSA in a rising rate environment.\n\nJohn Hecht -- Jefferies -- Analyst\n\nOK. Thank you guys very much.\n\nOperator\n\nOur next question comes from Kevin Barker with Piper Sandler.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nThank you. Growth has been extremely strong, not only for you guys, but also across the industry as payment rates have slowed and savings rates have come down. Given you see out there from a macro perspective and these declining savings rate, would you expect this growth to slow considerably as we move through the next few quarters and probably get more down to a more normal rate, maybe in the mid-single digits as we get through near the end of 2023? It just seems like these growth rates obviously aren't able to be sustained for an extended period of time.\n\nBrian Wenzel -- Executive Vice President and Chief Financial Officer\n\nYes. The way I think about it, Kevin, is you have this period of time where the consumer is working through, number one, excess liquidity that they have. So that saves rate. Now we'll carry you through, particularly on some of the higher spenders well into 2023.\n\nIn some of the lower credit quality cohorts and you're seeing wage gains that are offsetting inflation. So you have some tailwinds with regard to spend, and you see that strong spending behavior pattern. What we probably anticipate is as some of that savings drives up and some of maybe the lack of -- or the utilization of lower discretionary spending because people aren't going to the office every day. As that tightens a little bit, what you're going to see is probably spending come down and payment rate come down.\n\nBut I think what you're going to see first is payment rate begin to slow. Spending stay there, you're going to see balances go up. And then you're going to see purchase volumes slow. So I think there could be elongation of asset growth here in the short term.\n\nAgain, we'll have to see how the economy and the macroeconomics plays out for a medium term. But clearly, there are probably more tailwinds than headwinds in the short term.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nOK. And then you addressed it earlier on some addressed underwriting standards and no changes there, trying to maintain consistency. You continue to target $2.4 billion, I believe, buyback program. What type of macro conditions or underlying spending trends, would you have to see play out before you would start to reconsider whether it's underwriting standards or continuing to buy back stock at the level that you're buying it back?\n\nBrian Doubles -- President and Chief Executive Officer\n\nWell, I'll start and ask Brian to comment. Look, we are running the business very nimbly right now. We're ingesting thousands of data points every day on what the consumer is doing, payment trends and behaviors. We look at it by program, by product, by geography.\n\nWe're looking for any indicators that say we need to make some tweaks as we go. And I call them tweaks because this for us, this is not an event. It's not one day your risk gone and the other day your off. It's you kind of take what you're seeing every day and you kind of make changes and slight modifications as you go.\n\nAnd we feel really good about our ability to do that. We've invested a lot in our technology platform, our data sources, our tools. And so there isn't one thing that we look at. But as we're looking at percent of customers that make the min payment, how much above the min payment are they making, who's gone late for the first time.\n\nThose are all little tells and little signs that say, OK, maybe we go in and we turn the dial a little bit. And so again, we feel really good about our ability to do that. We're not seeing anything right now that is concerning. It's been a very gradual, I'd call it, normalization.\n\nAs we move through the year, in fact, I think every quarter, we updated our credit guidance and it was always modestly better than we thought 90 days prior. So I think we are still in a pretty good operating environment. We don't see anything that says we got to go in and really ratchet down creating and certainly nothing that says we got to do anything different than what we're doing on the share repurchase side.\n\nBrian Wenzel -- Executive Vice President and Chief Financial Officer\n\nYes. Brian covered it incredibly. Let me just talk a little bit about capital. I think when we look at our business model, we have tremendous -- I think the resilience in the margin and our capital generation capacity.\n\nSo I think as we look out, we look at what's our ability to generate capital, we look at the growth in the RWAs, we look at preserving the dividend. And then we run our stress test. And again, as we continue to run those quarterly, we don't see anything even in some of the most severe scenarios that would have us alter or slow down the repurchase activities and capital plans we have in place, but we do that every quarter. We'll continue to do it.\n\nAnd as long as we can continue to generate strong returns, we feel good about our capital position moving toward our target. But ultimately, we're going to have to fully develop the capital stack to achieve the target, and that's a little bit reliant upon the capital markets, but we feel good there. And again, I think when you put the story together, we really do feel good about the margin of the business when you think about the yield and the losses and then capital generation capacity.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nThe next question is from Rick Shane with J. P. Morgan.\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nGood morning, guys. Thanks for taking my question. I just wanted to talk a little bit about the allowance coverage. Given where we are, both in terms of growth, you guys are indicating that credit will continue to normalize.\n\nWe saw an uptick in delinquencies, economic outlook is changing. Why do we see the allowance coverage drift down a little bit? And should we expect that to start heading higher as we move into 2023?\n\nBrian Wenzel -- Executive Vice President and Chief Financial Officer\n\nYes. Thanks, Rick. So when you look at how we have built our reserve models, right? So you look at our baseline macroeconomic forecast, which, again, we take from Moody's as a starting point, and which shows, call it, an unemployment rate next year of 4%. When we think about credit normalization, right, and getting back to that 5.5% as we look at the underwriting cohorts we put on over the last couple of years, that migration back to 5.5%.\n\nThe implied unemployment rate in the model is higher than that. So think about something that's probably closer to the mid-4s effectively. We don't necessarily put that in. But effectively, it shows a higher unemployment rate.\n\nWe then, on an overlay basis, say, OK, if there is some concern, what does that scenario look like? So effectively, it gives us a higher coverage as we sit here today than what you would normally expect given the delinquency profile if you just looked at it by its own. So unless there's a significant deterioration beyond that, and we don't see that, then you're really going to be in growth driven reserves. If we just looked at delinquencies today and ran our quantitative models, it would be below day 1 CECL, right? So we think we're adequately reserved today to encompass what we think is going to happen in 2023 and moving out. So we feel good about it.\n\nI think when you look at the delinquencies that we have in here for 3Q, it gives you a pretty good line of sight into what to expect both fourth quarter and most likely first quarter. So you can plan that out. And again, absent something significantly change in the macro environment, we feel pretty good about where the coverage is and that we're adequately reserved for under various scenarios.\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nYes. It's interesting. I think we're all struggling with the same thing, which is that we have a concern going forward. But empirically, when we look at the data today, it's hard to sort of connect the dots in terms of that deterioration.\n\nSo we're running the same issues.\n\nBrian Wenzel -- Executive Vice President and Chief Financial Officer\n\nYes. But I think you have to look at it. If I just ran the pure quantitative model, I'd just go back to this point again, you'll be below day 1 CECL. And it's really the qualitative models and those overlays that is pushing you higher than day 1 and in theory allowing it.\n\nSo if you looked inside our quarter, our quantitative models moved up and our qualitatives moved down as it kind of got embedded into the core delinquency formation. So again, I know we don't provide a lot of visibility and people don't provide visibility into all those different models, but they are working in concert with each other. And that's where we get comfort that we're appropriately provisioned at the end of the quarter.\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nGreat. Brian, thank you very much.\n\nOperator\n\nWe have time for one more question. Our final question comes from Betsy Graseck with Morgan Stanley.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nHi. Good morning. OK. So two questions.\n\nOne, I know we talked quite a bit about the net interest margin already. It's down a bit from the peaks that you had earlier this year. And the exit run rate looks like it's around 15.27%, 15.28%, somewhere in that range for fourth quarter. And I'm hearing you talk about the migration of the funding mix looking to go from savings to CDs.\n\nAnd I noticed your CD offer is pretty robust here, 15 months that you've got at 3.91. So are you suggesting that with the forward curve where the Fed gets to 4.6% or 4.7%, 4.8%, depending on which day you look at it, that you lock that in on the yield side and as that comes through and your funding cost migrates higher, but is capped relative to what the OSA would do. Do you feel like the trajectory here should be NIM to continuing this path of decline as we move through the year next year? Or do you think that your shift to CDs can halt that slide?\n\nBrian Wenzel -- Executive Vice President and Chief Financial Officer\n\nYes. Again, Betsy, we'll be back in January to give you a lot better guidance and visibility into NIM. The way I would think about it, the pieces that you have moving inside of NIM, again, from the yield side, you're going to have the slowing payment rate give you better revolve in the short term, higher late fees, partially offset by some reversals. You're going to see this continued effect of prime moving.\n\nWe bill almost on a 45-day lag to when prime changes. So you're going to see that effect of prime move through the portfolio, we have the ability to adjust merchant pricing. So those are the, I call it, tailwinds to NIM. Again, I do think locking in certificates of deposits at this rate, if you do believe that the Fed is going to continue to rise into 2023, while it may give you a little bit of pressure in the current quarter or two, it's going to be better as you move throughout the following year.\n\nSo it's that shift. Again, a lot of this is going to depend upon what money market funds do and what other institutions do. We clearly see some customers migrating for yield, but we were going to remain competitive. The positive news for us, we also see money flowing out of big money center banks that aren't paying a lot for deposits, which gives us an attractive source.\n\nAnd again, so we're optimistic that we can manage the funding profile, and we'll be back in January to detail a little bit more.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nAnd then just a follow-up question on your partner activity and how they're looking for you to help them with their sales growth as you go into next year, which is expected to be a little bit of a slower paced environment. Can you give us any sense as to any credit box changes that would come as a result of that or other ways that you can help drive your partners' revenue growth? Thanks.\n\nBrian Doubles -- President and Chief Executive Officer\n\nYes, sure, Betsy. Look, I think Brian said it earlier, we really don't try to rely on opening the credit box to drive sales, that typically doesn't end well. So we try and stay very consistent discipline there. What we do work with our partners on is more around the value proposition and the experience for the customer as well as being able to offer multiple products.\n\nAnd I think that's really where we're focused. We're having really good discussions with our partners around how we're going to support them for hopefully a strong holiday and that offers its experience, it's offering new products that are tailored for their customer. I think it's really that entire kind of ecosystem that we work on with our partners to drive sales for them. It's a proven model.\n\nI think we've only enhanced it with the investments we've made over the last couple of years, and we're pretty optimistic that we're going to support them, and hopefully a strong holiday and into a hopefully strong 2023.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nWe have no further questions.\n\nKathryn Miller -- Senior Vice President, Investor Relations\n\nThat now concludes today's call. Thank you all for joining.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKathryn Miller -- Senior Vice President, Investor Relations\n\nBrian Doubles -- President and Chief Executive Officer\n\nBrian Wenzel -- Executive Vice President and Chief Financial Officer\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nJohn Hecht -- Jefferies -- Analyst\n\nKevin Barker -- Piper Sandler -- Analyst\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nMore SYF analysis\n\nAll earnings call transcripts"
}