{
  "companyName": "I3 Verticals, Inc.",
  "companyTicker": "IIIV",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/i3-verticals-inc-iiiv-q3-2022-earnings-call-transc/",
  "content": "I3 Verticals, Inc. (IIIV 4.28%)\nQ3 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, everyone. And welcome to the i3 Verticals' third quarter 2022 earnings conference call. Today's call is being recorded, and a replay will be available starting today through August 16th. The number for the replay is (877) 344-7529 and the code is 363 7280.\n\nThe replay may also be accessed for 30 days at the company's website. [Operator instructions] At this time, for opening remarks, I would like to turn the call over to Geoff Smith, VP of finance. Please go ahead, sir.\n\nGeoff Smith -- Vice President of Finance\n\nGood morning. Welcome to the third quarter 2022 conference call for i3 Verticals. Joining me on this call are Greg Daily, our chairman and CEO; Clay Whitson, our CFO; and Rick Stanford, our president. To the extent of any non-GAAP financial measures discussed in today's call, you'll also find a reconciliation to the most directly comparable GAAP financial measure or view in yesterday's earnings release.\n\nIt is the company's intent to provide non-GAAP financial information to enhance understanding of its consolidated GAAP financial information. Non-GAAP financial information should be considered by each individual, in addition to, not instead the GAAP financial statements. This conference call may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements among others, regarding the company's expected financial and operating performance. For this purpose, any statements made during this call that are not statements of historical fact may be deemed to be forward-looking statements.\n\nYou are hereby cautioned that these forward-looking statements may be affected by important factors, among others set forth in the company's earnings release and reports that are filed or furnished to the SEC. Consequently, actual operations and results may differ materially from those discussed in the forward-looking statements. Finally, the information shared on this call is valid as of today's date, and the company undertakes no obligation to update it except as may be required under applicable law. I'll now turn the call over to the company's chairman and CEO, Greg Daily.\n\nGreg Daily -- Chairman and Chief Executive Officer\n\nThanks, Jeff, and good morning to all of you. We were very pleased with our third quarter 2022 results. And as we round the corner toward the end of our fiscal year '22, we expect the finishing touches on what has been a phenomenal year. Year-to-date we set new records and revenue and EBITDA, which grew at 48% and 51%, respectively for the nine months ending June 30th.\n\nWe continue to focus on revenue -- recurring revenue sources, particularly in software and related services streams. While license sales will happen from time to time as certain markets necessitate them, we are focused on SaaS and recurring transaction-based revenue to align the price and the lifetime benefit of the solutions we provide. Our solutions have excellent customer service retention and we go to market with a long-term lens. Additionally, acquiring great businesses.\n\nThey have under-emphasized recurring revenue streams remain a significant opportunity. More than 80% of our revenue in the third quarter came from recurring revenue sources. We're extremely excited about several investments to add modern cloud-based products to offerings in the public sector. As I said, we are thinking long-term and will not hesitate to invest capital within the company in addition to M&A.\n\nIn the third quarter of fiscal year '22, two months of results from our May 1, healthcare acquisition were highlighted last quarter, what a great fit the business is and we have not been disappointed. The cross-sell opportunities have been immediately materialized in their pipeline. All of our fiscal year '22 acquisitions have integrated seamlessly, and we're excited about what comes next. Now I'll turn the call over to Clay.\n\nHe'll provide you with more details of our third quarter financial performance. Following Clay's comments, Rick will give us some M&A updates, and then we'll open up the call for questions.\n\nClay Whitson -- Chief Financial Officer\n\nGood morning. The following pertains to the third quarter of our fiscal year 2022, which is the quarter that ended June 30, 2022. Please refer to the slide presentation titled supplemental information on our website for reference to this discussion. We had another great quarter with record revenues and adjusted EBITDA.\n\nRevenues for the third quarter increased 28% to $80.6 million from $63.1 million for Q3 '21 reflecting strong organic growth and acquisitions. The key metrics we track are headed in the right direction. Our integrated payments percentage improved to 62% for Q3 2022 from 60% for Q3 2021, which helped our revenue yield improve to 136 basis points for the quarter from 123 basis points for Q3 '21. Organic growth for this quarter was approximately 10%.\n\nThere was no benefit from a favorable COVID comparison in the same period in the prior year, which has essentially recovered from the pandemic and our lines of business. Annual recurring revenues totaled $266.7 million for Q3 2022, compared to $204.9 million for Q3 2021, a growth rate of 30%. Over 80% of our revenues in the quarter came from recurring sources. Software and related services remain the largest portion of our revenues, growing 45%, the $39 million for Q3 2022 from $26.8 million for Q3 2021.\n\nAdjusted EBITDA increased 29% to $20.1 million for Q3 2022 from $15.5 million for Q3 2021, reflecting continued momentum in our proprietary software segment. Adjusted EBITDA as a percentage of revenues increased to 24.9% for Q3 2022, from 24.6% for Q3 2021, reflecting margin improvement in our proprietary software segment and lower corporate overhead as a percentage of revenues. For the nine months, the adjusted EBITDA margin expanded 50 basis points. Pro forma adjusted diluted earnings per share increased 28% to $0.37 for Q3 2022, from $0.29 for Q3 2021.\n\nAgain, please refer to the press release for a full description and reconciliation. Segment performance. Revenues and our proprietary software and payment segment increased 42% to $47.8 million for Q3 2022, from $33.7 million for Q3 2021, principally reflecting growth in our two largest verticals public sector and healthcare. This quarter included two months of results from our most recent acquisition in the healthcare vertical, which is off to a good start.\n\nRevenues and our education vertical continued a strong rebound, increasing 27% from Q3 to Q3, thanks to the reopening of existing customers and organic sales to new school districts. The segment's adjusted EBITDA improved 51% to $15.6 million for Q3 2022, from $10.3 million for Q3 2021 outpacing revenues. The growth was principally driven by our two largest verticals public sector and healthcare. On a run rate basis, the public sector represents roughly half of our consolidated business, while healthcare is an estimated 20%.\n\nRevenues for our Merchant Services segment increased 9% to $32.7 million for Q3 2022 from $30 million for Q3 2021, principally reflecting growth in our ISO channel and hospitality vertical, both of which carry in our payment margins. Adjusted EBITDA for our Merchant Services segment increased slightly to $8.8 million for Q3 2022, from $8.7 million for Q3 2021 with higher revenues partially offset by higher residual expenses. In keeping with our strategy since the IPO, we have steadily redirected acquisition and internal resources from traditional merchant services into higher growth and a higher margin, proprietary software, and services coupled with integrated payments. Balance sheet.\n\nOur balance sheet has allowed us to continue to execute our acquisition strategy. On June 30th, we had 198 million borrowed under our revolver, net of cash, under a 275 million facility. The face value of our convertible notes is 117 million. As of June 30th, our total leverage ratio is approximately four times, while the current constraint is five times.\n\nThe interest rate for the convertible notes is 1%, while the interest rate for the revolver is currently around 6%, but will increase as the Fed continues to raise rates. Over time, we expect to convert roughly two-thirds of adjusted EBITDA into free cash flow, which can be used for debt repayment, acquisitions, and earnouts. We define free cash flow as adjusted EBITDA minus capital expenditures, internally capitalized software, cash interest, and cash taxes. Outlook.\n\nLooking forward, our performance here today gives us confidence in raising the midpoints and narrowing our guidance ranges for the fiscal year 2022. It excludes acquisitions that have not yet closed and transaction-related costs, as we become more software-centric, quarters might vary based upon perpetual license sales, even though our trend is generally toward more recurring revenue streams. Our revenue guidance for the year was $307 million to $317 million, adjusted EBITDA, $76.5 million to $80.5 million, pro forma adjusted diluted EPS, $1.41 to $1.47. I will now turn the call over to Rick for company updates on M&A activity.\n\nRick Stanford -- President\n\nThank you, Clay. Good morning, everyone. Before I discuss M&A, I'll give an update on a few items. Our public sector unified product offering software solutions continue to have strong results with success in local, municipal, county, and state markets.\n\nThe public sector now reaches across the United States and Canada, serving public sector clients in 48 states and three Canadian provinces. Over the last quarter, we've expanded our product reach by adding new software solution sales in 17 states. The expansion includes additional instances of our public safety, courts, payment processing, digital signature and certification, land records, data access, safe and counter, and licensing software solutions. We continue to implement our recently announced LCRAA, the Louisiana Clarks Remote Access Authority case management software contract which is supported by statewide e-filing and payments, which continues to be deployed.\n\nThe i3 education brand unifies all of our educational product lines, along with marketing, sales, development, and support services that go along with it. With considerable additions and new districts and associated schools, the growth in education over the past trailing 12 months has been one of our best years for sales. Most districts are observing greater levels of A La Carte purchases, and higher pricing for the lunches as the K-12 sector starts to shift to normalcy. In addition, federal, or state money for student loan subsidies has largely decreased or been eliminated, as have COVID protocols.\n\nIn our healthcare vertical, returned to normal and elective surgical volumes is restoring pre-COVID levels for our healthcare revenue cycle clients. As the healthcare system adjusts to the shifting need for care delivery, mobile healthcare, and telehealth, there's also offered a new source of revenue. As COVID issues fade, we are noticing more outreach for our SaaS subscriptions because of the industry's willingness to shift. Our healthcare, companies are still working together to develop and promote new products that coincide with customer demands.\n\nFrom a technology perspective, our efforts to transition to a private cloud infrastructure are going well, and several applications are now operating [Inaudible] environment. These solutions now benefit from improved uptime, as well as geographic redundancies and improved scalability. Our next milestone involves a FedRAMP-compliant environment for government solutions. We continue to invest in training, as well as DevOps resources to leverage low-code development platforms, which can be hosted and managed on our AWS infrastructure.\n\nSeveral products, projects are underway, leveraging this technology to expand our offerings in the public sector and education verticals. I'll now speak to M&A. We continue to pursue growth both organically and through acquisitions of growing companies that fit within our strategy and culture with an emphasis on companies and the public sector and healthcare. Although we haven't closed any additional acquisitions this quarter other than the healthcare tuck-in, we announced in May.\n\nOur pipeline remains robust with opportunities for acquisitions that are similar in size to many of our acquisitions today, as well as some that are larger. Based on what we are seeing we would expect acquisition multiples for these transactions to be consistent with other transactions. We have closed with the caveat that larger transactions will tend to run at the higher end of our stated range relative to multiples. Additionally, we are looking for acquisitions that provide complementary technologies to our existing products, particularly in our public sector vertical.\n\nDiffering state, local, and municipal regulations have created a relatively fragmented market across the US in the sector, and we believe inorganic development will continue to account for a sizable portion of customer base expansion in this market. This concludes my comments. MJ, at this time we'll open the call for Q&A, please.\n\nOperator\n\nThank you. [Operator instructions] Our first question today comes from John Davis of Raymond James. Please go ahead.\n\nJohn Davis -- Raymond James -- Analyst\n\nGood morning, guys. Clay, I wanted to start off, on the margin. We hear a lot about wage inflation. Obviously, you guys have different acquisitions mixing in.\n\nSo, it looks like the midpoint on the margin guide ticked down 20 or 30 basis points. Just curious, is that a function of revenue mix? Or are you seeing some wage inflation? And, I think Greg called out some organic investments that you guys potentially are willing to make, or are making in the business. Just any high-level commentary on the margin would be helpful.\n\nClay Whitson -- Chief Financial Officer\n\nI think that's mainly a function of revenue over performing. Our goal on margins is to increase our overall corporate margin by 50 to 100 basis points a year. Year-to-date, we're at 50 basis points at the low end of that range. And I would say that wage inflation probably is what's holding us back a little bit this year.\n\nBut we remain on plan and expect to continue that performance.\n\nJohn Davis -- Raymond James -- Analyst\n\nOK. Great. And then just wanted to organic growth for a minute. Clay, I think you said it was 10% in the quarter.\n\nCan you help us with what's embedded for the fourth quarter? Looks like, by my math, it's something similar to 3Q, but just curious if you maybe put a finer point on it.\n\nClay Whitson -- Chief Financial Officer\n\nWe don't guide quarterly. We did say coming into the year, we would grow double digits, and we still expect to grow in double digits for the year.\n\nJohn Davis -- Raymond James -- Analyst\n\nOK. So then maybe just ARR, I think was strong 30% growth. Is that all organic? Or, do you guys have an organic breakdown of ARR?\n\nClay Whitson -- Chief Financial Officer\n\nWe don't have the organic breakdown of ARR, it's not all organic. But our main verticals are hospitality -- I mean, healthcare and the public sector are driving most of the organic growth.\n\nJohn Davis -- Raymond James -- Analyst\n\nOK. Then last one for me. Just on the M&A pipeline. Rick, you called out some potentially some larger deals.\n\nCurious if you and Greg, have comments -- is that just a function of the fact you guys are getting bigger and can do larger deals? Or what's available in the market? Still seems like very reasonable multiples kind of in that eight and ten times range. But just curious if what's driving kind of the comments for larger deals in the pipeline.\n\nRick Stanford -- President\n\nYeah. So JD, we've always looked for larger deals. The fact that our sweet spot has been two to five because above five, we said before the valuations get crazy. We're running into more companies now of a larger size that is more realistic about what they can expect to get from their company.\n\nWe broaden our resources as well in self-sourcing. So we're talking to a lot more individuals than we used to. I would expect we'll continue to stay within our range. The important note is if we do something that's larger than our sweet spot, we're probably going to end up having to pay on the higher end of our range.\n\nBut again, we're going to stay very disciplined and you shouldn't expect us to pay more than 10 times for those deals as well.\n\nJohn Davis -- Raymond James -- Analyst\n\nOK. Great. Appreciate it very well. Thanks.\n\nRick Stanford -- President\n\nThank you.\n\nOperator\n\nThe next question comes from Peter Heckmann of D.A. Davidson. Please go ahead.\n\nPeter Heckmann -- D.A. Davidson -- Analyst\n\nGood morning, gentlemen. Thanks for taking the question. In the public sector, are you continuing to see some procurements that are designed to be funded by stimulus from the American rescue plan? And then in that in that same vein, when we think about public sector deals, I guess the configuration of deals that would be transaction oriented and have a transaction fee attached, versus I saw a fixture recurring. Can you talk about how that mix is changing?\n\nRick Stanford -- President\n\nWell, I'll talk to you the first part. We haven't been able to tie that back, Peter. there is more demand now. It's hard to tell if that's enough for additional resources.\n\nWe continue to educate our customers on the monies that are available to them. But we haven't really been able to black and white tie that backs to the rescue plan dollars. But we're excited to see our customers are changing their mindset with regard to the types of products that they will need going forward. And we're pleased with the interest and the number of deals that we're looking out for.\n\nClay Whitson -- Chief Financial Officer\n\nAnd on your question about our -- the mix of how many deals have payments attached? I would say most of the deals still do. LCRAA was a big one down in Louisiana that has payments attached. Our Tennessee renewals, a large contract that has payments attached. From an acquisition standpoint, it's not a black and white criteria.\n\nWe will [Inaudible] my software solutions that are not adjacent to payments if it browns out our product line. But we certainly like it when it's adjacent for payments because it's a clearly identifiable synergy -- revenue synergy that we can -- we know we have going into the deal.\n\nPeter Heckmann -- D.A. Davidson -- Analyst\n\nGot it. And then, if I had been doing my research correctly on some of the acquisitions in the public sector, it looks like the company might have statewide or state-level deals in four, five, or six states now. And you mentioned trying to get FedRAMP certified. With that -- is that necessary for some state-level deals? Or would you be looking at that contract with some federal agencies?\n\nRick Stanford -- President\n\nYeah, it's both. We have a FedRAMP environment today, but it's not in our private cloud. So that's what we're working on. We won't obviously move those products into the AWS until it's FedRAMP certified.\n\nThat's what I was trying to get at, Peter.\n\nPeter Heckmann -- D.A. Davidson -- Analyst\n\nGot it. OK, that makes sense. Thank you.\n\nOperator\n\n[Operator instructions] Our next question comes from James Faucette with Morgan Stanley. Please go ahead.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nHey. Good morning, guys. Thanks for taking my questions here. First, like a high-level question, I guess, obviously, doing a great job so far on the software transition.\n\nWhere do you see the ceiling for software as a percentage of total revenue growth? And, is that something that you're targeting or working toward? And I guess, as part of that software takes share internally as a percentage of total revenue. How much of that right now is coming from faster growth of software capabilities, versus acquisitions?\n\nClay Whitson -- Chief Financial Officer\n\nWell, in your last part, I would say that in our public sector -- our proprietary software segment, the organic growth is low double-digit. And then, if we grow revenues in the mid-20s, that has the majority coming from acquisition still. I think we were a little bit speculating here, but internally we talk about plateauing at software and services, as a percentage of total revenues. Capping out at around two-thirds, but that is speculation.\n\nfrom time to time, like this quarter as an example, and then a surge in payments will -- that won't be a linear progression over time.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nGot it. That makes sense. And then, I guess lots of questions right now around the impact from a potential recessionary type environment or at least a slower economy. How does that impact the different parts of your business? And I guess.\n\nMore importantly, when you think about the relationships you're building with municipalities, etc., on the software side. Does that tend to have much of an impact on those businesses, particularly new wins and opportunities?\n\nClay Whitson -- Chief Financial Officer\n\nWell, a general comment on the recessionary environment. We haven't seen much of it yet. I would say that July was a little softer than June, but it would be a low single-digit type of -- it's too early to say that that's a trend, I would say. Your question about municipalities? I think there was a recognition during COVID that state and local governments had put off modernizing for too long, and it became painfully apparent.\n\nAnd so, I don't see, or we don't see currently a pullback in those budgets. They're committed to them. They have the added benefit that they allow the governments to operate with fewer people and that's become a pain point for a lot of them, a key employee quits, and all of a sudden the office doesn't run correctly anymore. And so, we believe that will continue for several years, even if at the federal level, things are cut back or not.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nGot it. Appreciate the color.\n\nOperator\n\nThe next question comes from Jason Kupferberg of Bank of America. Please go ahead.\n\nTyler DuPont -- Bank of America Merrill Lynch -- Analyst\n\nThank you. Good morning. This is Tyler DuPont on for Jason. Thanks for taking the call.\n\nJust one question for me. I was just wondering if you could speak at all to cash flow. It looks like this quarter's conversion rate was a bit lighter than some may have anticipated. But still does two-thirds conversion guidance for the full year, is there anything specific to the call out there with maybe whether it's cadence or just the puts and takes as to how we should think about cash flow conversion moving forward?\n\nClay Whitson -- Chief Financial Officer\n\nWell, as far as puts and takes go, we've run higher than two-thirds of EBITDA every year since going public, and the reason for that is low cash taxes. We continue to give the two-thirds guidance because we anticipate at some stage it will be a 25% taxpayer, although it still seems a few years out. Rising interest rates will impact the cash flow conversion as cash interest is a part of that equation. This time of year, I'll probably need to study it a little more closely, but our receivables build a little this time of year.\n\nDo you have any things to add on, cash flow for the nine months, so?\n\nGreg Daily -- Chairman and Chief Executive Officer\n\nNo, I mean, I think looking ahead, we spoke about the capital investments. That would certainly be a consideration. But at this time, we don't expect that any software capex is going to throw us off that two-thirds. We think that's still a better metric to use.\n\nTyler DuPont -- Bank of America Merrill Lynch -- Analyst\n\nAll right. Perfect. Well, thank you very much. Appreciate the time.\n\nOperator\n\n[Operator instructions] The next question comes from Charles Nabhan of Stephens. Please go ahead.\n\nCharles Nabhan -- Stephens Inc. -- Analyst\n\nGood morning and thank you for taking my question. You had alluded to the conversion of merchant services customers as a driver of software revenue. I was hoping to get a little more color in that area in terms of the magnitude of that impact, as well as any particular verticals, you're seeing greater success convert, in terms of conversion?\n\nClay Whitson -- Chief Financial Officer\n\nWell, I think if it was one of my comments I was just referring to -- we're not putting as much effort into the traditional merchant processing. We're allocating our sales and other resources toward integrated payments, which tend to be in our public sector and healthcare verticals. We just get a higher margin and higher growth. It's more satisfying for the customer and their customers to be in an integrated environment.\n\nCharles Nabhan -- Stephens Inc. -- Analyst\n\nGot it. And as a follow-up, I wanted to get your comments on valuations, on prospective M&A deals, specifically at the magnitude of compression, valuation compression you're seeing is greater at the higher end of the range as opposed to the lower end of the range you've historically looked at? And secondly, if there's any -- you're seeing any differences across your verticals in terms of changes in valuation?\n\nGreg Daily -- Chairman and Chief Executive Officer\n\nYeah. Nothing's really changed. There's a trickle-down effect on sellers, and we haven't seen that yet. We're still talking in our same range to potential sellers and engaging in good conversations with them.\n\nThere's been little to no pushback on higher multiples or lower multiples. I'd like to think that we'd be able to go to the lower end of our range going forward. But right now, we're still in our stated range between seven and ten times.\n\nCharles Nabhan -- Stephens Inc. -- Analyst\n\nGot it. Thank you. Appreciate the color.\n\nOperator\n\nThis concludes the question-and-answer session. I would like to turn the conference back over to Greg Daily for closing remarks.\n\nGreg Daily -- Chairman and Chief Executive Officer\n\nThanks, everyone, for your interest, and your support. I do feel like, the company is perfectly positioned in the right place at the right time. We have a great team in the pipeline, so excited about finishing out the last quarter of our fiscal year '22. So anyway, thank you again.\n\nHave a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGeoff Smith -- Vice President of Finance\n\nGreg Daily -- Chairman and Chief Executive Officer\n\nClay Whitson -- Chief Financial Officer\n\nRick Stanford -- President\n\nJohn Davis -- Raymond James -- Analyst\n\nPeter Heckmann -- D.A. Davidson -- Analyst\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nTyler DuPont -- Bank of America Merrill Lynch -- Analyst\n\nCharles Nabhan -- Stephens Inc. -- Analyst\n\nMore IIIV analysis\n\nAll earnings call transcripts"
}