{
  "companyName": "Eargo, Inc.",
  "companyTicker": "EAR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/eargo-inc-ear-q2-2022-earnings-call-transcript/",
  "content": "Eargo, Inc. (EAR -3.89%)\nQ2 2022 Earnings Call\nAug 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Eargo second quarter 2022 earnings conference call. [Operator instructions] Please note, this event is being recorded. I would now like to turn the conference over to Nicholas Laudico, senior vice president, strategy and investor relations. Please go ahead.\n\nNicholas Laudico -- Senior Vice President, Strategy and Investor Relations\n\nGood afternoon, everyone, and welcome to the Eargo's second quarter 2022 earnings conference call. As a reminder, this call is being broadcast live and a digital replay will be available on our IR website. Joining me on today's call are Christian Gormsen, president and chief executive officer, and Adam Laponis, chief financial officer. Before we begin, I'd like to remind you that some of the matters discussed in this conference call will contain forward-looking statements regarding future events as outlined in our press release today.\n\nWe wish to caution you that such statements are based on management's current expectations and beliefs, are forward-looking in nature, are subject to risks and uncertainties, and actual events or results may differ materially. The factors that could cause actual results or events to differ include, but are not limited to, factors referenced in our press release today as well as our filings with the SEC. Before turning the call over to Christian, I want to make note that we have posted a historical GAAP to non-GAAP reconciliation table on our IR website in the events and presentation section. With that said, I will turn the call over to Christian.\n\nChristian Gormsen -- President and Chief Executive Officer\n\nThank you, Nick, and thank you, everyone, for joining us today. The second quarter for Eargo can be characterized as transitionary. Approximately seven months after we learned of the investigation by the DOJ, we reached a civil settlement agreement with the U.S. government to resolve the DOJ investigation with no admission of liability.\n\nWe have since cured our SEC filing delinquency, retaining the listing of Eargo stock on NASDAQ and secured capital to fund our activities and pursue our omnichannel growth strategy. We also took several efforts to reduce our cash burn, including significant reduction in monthly media spend and an additional 17% reduction in our workforce, following the previous 27% reduction at the end of 2021. Clearly, our second quarter financial results and year-over-year comparisons reflect our decision to stop accepting insurance as a form of direct payment on December 8, 2021, as well as the cash burn reduction initiatives I just mentioned. With volumes sequentially down as expected, we took the time to continue refining the efficiency of our cash pay business, reducing media spend to $4.1 million in the quarter, down $500,000 sequentially, but improving conversion rate to nearly 16%.\n\nSince our last call, we have made progress in enhancing our internal compliance and risk management processes as well as building our infrastructure across revenue life cycle management and claims processing to support any future reentry into the insurance market. We also continue to improve the customer experience, both online and over the phone. From a financing perspective, we achieved a significant milestone in that we secured a strategic commitment of up to $125 million from Patient Square Capital, closing the first tranche investment of $100 million in senior secured convertible notes on June 28th. We're now focused on completing a rights offering of 375 million common shares to existing stockholders by November 25, 2022, or within 150 days of the closing of the first tranche investment.\n\nAdam will discuss a more detailed timeline in a few moments. As part of our financing process and in light of the events of the last 10 months as well as the macro environment, management and the Board took the time to evaluate our short- and long-term business strategies. While we made several changes to improve focus and efficiency, we reconfirmed that our omnichannel strategy should continue to be the primary approach to returning Eargo toward a growth trajectory. The capital from Patient Square allows us to begin executing on that strategy, and we're excited to enter the second half of the year with a clear focus on our business priorities.\n\nNo. 1, potentially regain insurance coverage of Eargo for government employees under the FEHB program. We need to work with individual FEHB carriers to align on go-forward processes and require documentation to support insurance coverage. Although we are working to establish dialogues with third-party payers, we expect any negotiations with payers to last for an extended period of time.\n\nAnd we do not plan to provide an update until if and when we have reached an understanding with payers. No. 2, refine and expand our physical retail strategy. We continue to conduct retail pilots to better understand the optimal consumer journey in a physical retail environment and in fact, with our retail partners to refine our strategy for an expanded retail price.\n\nNo. 3, optimize our cash pay business. Most recently, we improved conversion to nearly 16% in the second quarter on significantly reduced media spend. And No.\n\n4, continue to invest in innovation to maintain an annual product launch cadence, which has historically driven new consumer demand and increased repeat customer business. Before turning it over to Adam, we also announced today that Peter Bisgaard has stepped down from the company's board of directors effective August 3, 2022, with an expanding role at Pivotal and Nan Fung Life Sciences Fund, Peter has decided to dedicate more time to these increasing responsibilities. We're grateful for the insight and expertise Peter has brought to the Board over the years and wish him well in his expanded role. Let me now turn it over to Adam for a more detailed summary of the next steps in our financing process and our second quarter financial results.\n\nAdam Laponis -- Chief Financial Officer\n\nThanks, Christian. Let me start with an update on the timing of the rights offering, one of our major company initiatives in the second half of 2022. In the second quarter, we achieved a significant milestone in that we secured a strategic commitment of up to $125 million from Patient Square Capital. This significant capital raise will enable us to pursue our omnichannel growth strategy.\n\nOn June 28th, we closed the first tranche investment of $100 million in senior secured convertible notes. The short-term debt of the bridge to such time as we can issue equity to shareholders in our rights offering. Pursuant to the terms of the transaction agreement, we are focused on completing our rights offering at 375 million common shares to existing stockholders, which we intend to complete by November 25, 2022, or within 150 days of the closing of the first tranche investment and in any event, by December 24, 2022. Prior to commencing the rights offering, we intend to seek stockholder approval to increase the number of authorized shares and issue the full potential amount of conversion shares at our annual meeting of stockholders to be held on October 12, 2022.\n\nWe do not intend for the record date for the rights offering to proceed the date of the annual meeting. Now, moving to the summary of second quarter 2022 financial results. Our second quarter results and year-over-year comparisons reflect our decision to stop accepting insurance as a form of direct payment on December 8, 2021, as well as the company's efforts to reduce cash burn. Second quarter 2022 net revenue was $7.2 million, down 68% year over year.\n\nThe decrease was driven by a decrease in growth systems shipped as the company no longer accepted insurance is in that the direct payment as of December 8, 2021. Decreased average selling price and an increase in sales return rates as the company operated on a cash pay basis only during the three months ended June 30, 2022. Second quarter 2022 gross shipment systems shipped were 4,455, down 65% year over year. The year-over-year change was driven by the company's decision to no longer accept insurance as a method of direct payment as of December 2021.\n\nSecond quarter 2022 return accrual rate was 33.3%, up 9.2 percentage points year over year, driven by primarily the shift to cash pay only business in the second quarter. Our cash-pay business has traditionally carried a higher return rate than our insurance business. Moving on to non-GAAP gross margin and non-GAAP operating expenses. Our discussion of financial metrics of the gross margin line and below will be on a non-GAAP basis, which excludes stock-based compensation expenses.\n\nPlease refer to our GAAP to non-GAAP reconciliation included in today's earnings release. Second quarter non-GAAP gross margin was 35.2% compared to 72.3% in the second quarter of 2021. The year-over-year gross margin decline was primarily due to an increase in sales return rate, lower shipment volume causing fixed cost to be spread over a smaller number of units, an increase in cost of goods for products sold due to a change in product mix and an increase in amortization of capitalized software costs related to the commercial launch of Eargo 5 and Eargo 6. Second quarter non-GAAP sales and marketing expenses were $12 million or 166% of net revenues compared to $20 million or 87.4% of net revenues in the second quarter of 2021.\n\nThe decrease in expense was driven by decreases in direct marketing, advertising and promotional expenses following our decision to stop accessing insurance benefits as a method of direct payment on December 8, 2021 and decreases in personnel and personnel-related costs. The increase in sales and marketing as a percentage of revenues was due to a reduction in revenue. Non-GAAP research and development expenses were $4.5 million or 61.6% of net revenues compared to $4.0 million or 17.7% of net revenue in the second quarter of 2021. Non-GAAP general and administrative expenses were $16.0 million or 220.5% of net revenue compared to $6.3 million or 27.5% of net revenues in the second quarter of 2021.\n\nThe increase is primarily due to $5.7 million in transactional costs related to the note purchase agreement and a net increase in general corporate costs of $3.8 million, primarily related to legal and other professional fees driven by activities related to the DOJ investigation. Non-GAAP net operating losses for the second quarter of 2022 was negative $29.9 million compared to a non-GAAP net loss of negative $13.8 million in the second quarter of 2021. Moving to the balance sheet. We had cash and cash equivalents of $106.6 million at June 30, 2022, which includes proceeds from the first tranche closing of the senior convertible notes transaction on June 28 and using approximately $16.2 million to pay off our previous SVB debt obligation as well as quoting costs.\n\nThis compares to $110.5 million as of December 31, 2021. Moving to cash burn guidance. We continue to expect a quarterly cash burn between 20 and $25 million in the near term, with slight variability from quarter to quarter. I will now turn it back to Christian for closing commentary.\n\nChristian Gormsen -- President and Chief Executive Officer\n\nThanks, Adam. We're glad to have the second quarter behind us and to have begun executing on the initiatives that we believe have the potential to return Eargo to a growth mode. Despite what we've been through, the organization is motivated, incentivized and energized to achieve our objective. If there is one characteristic of the people at Eargo, it is that we don't give up.\n\nClearly, a lot of hard work is ahead of us, but there remains a very large underpenetrated market opportunity, we believe we're well positioned to capitalize on with our innovative product, established remote support structure, pending changes to the commercial regulations and the recent capital raise, we feel good about the future of Eargo. I will now turn the call over to the operator for Q&A. Thank you.\n\nOperator\n\n[Operator instructions] The first question comes from Robbie Marcus of J.P. Morgan. Please go ahead.\n\nLily Lozada -- J.P. Morgan -- Analyst\n\nHi. This this is actually Lily on for Robbie. Thanks so much for taking the questions. First, just to start out, how have your conversations with the OPM regarding reentering the insurance market and progressing? And is there any sort of time frame we should be keeping in mind for some sort of decision here?\n\nChristian Gormsen -- President and Chief Executive Officer\n\nThank you for the question. As we spoke about in our prior update, we have had good discussions with OPM. The clear next step is the discussions that are ongoing with FEHB carriers. And as we also stated in the script and the announcement, we will update when we have any material updates to that.\n\nLily Lozada -- J.P. Morgan -- Analyst\n\nGot it. OK. And then, maybe just a follow-up. Can you dig a little bit deeper into how you've been able to drive increased conversion rates and how you're approaching marketing and advertising differently? And how do you see yourself being able to support this higher level of conversion and drive growth on lower media spend? Thanks so much.\n\nChristian Gormsen -- President and Chief Executive Officer\n\nNo. This has been -- in the middle of everything that the company has been through, we've kept the sales and marketing team very focused on how do we take this time and really make sure that we are well set up for the future and driving up conversion rate was the No. 1 metric that we achieved or that we were aiming for. We did this while at the same time reducing media spend and actually also making reductions on the people side.\n\nSo not an easy task, but I think it has really been based on what we've learned over the years of selling direct to consumers within the hearing health category, how do we apply that in a focused way and a lot of complements to both our marketing and our sales team for really working on driving up that level of efficiency. And to your question, I think we believe that as we can open additional channels and also start expanding our media presence again, we believe that we can do this in a more efficient manner than what we've done historically on a channel level.\n\nLily Lozada -- J.P. Morgan -- Analyst\n\nGreat. Thanks so much.\n\nOperator\n\nAnd the next question comes from Margaret Kaczor of William Blair. Please go ahead.\n\nMaggie Boeye -- William Blair -- Analyst\n\nHey, guys. This is Maggie on for Margaret today. Thanks for taking my questions. I first wanted to ask on the -- during the second quarter, the split of your business between your cash-pay and your repeat customers and how you see that trend going forward the year based on the marketing initiatives you're putting in place? Thanks so much\n\nAdam Laponis -- Chief Financial Officer\n\nHi, Maggie, its Adam. I can take that one. In both Q1 and Q2, the mix of repeat business was about 20% of total volume. And from an absolute numbers perspective, I'd expect the number to be relatively stable in the back half.Maggie BoydGreat.\n\nThank you. The next, I wanted to ask, how close rates -- so just trying to understand if you're within that $20 million to $25 million cash burn guidance you provided, how much of that can be converted?\n\nChristian Gormsen -- President and Chief Executive Officer\n\nSorry. Maybe can you repeat the question?\n\nMaggie Boeye -- William Blair -- Analyst\n\nYes, sure. So close rates lease that you are generating, so trying to understand you are burning the $25 million per quarter. How much of that spend within the B2C and then how much of that can be into sale?\n\nChristian Gormsen -- President and Chief Executive Officer\n\nAdam, are you following this?\n\nAdam Laponis -- Chief Financial Officer\n\nI apologize. I'll repeat back what I heard. It was a question of the $20 million to $25 million, or into the insurance side of things. And I think what we've said is we don't have any update in terms of when we'll be turning on or scaling either retail or insurance and the quarterly cash burn that we're forecasting doesn't account for any positive movement to either one of those two could create in the business.\n\nIs that -- I'm not sure if I answered your question. I did get every other word, but please of note, that covered it.\n\nMaggie Boeye -- William Blair -- Analyst\n\nThat's great. Thank you.\n\nOperator\n\n[Operator instructions] The next question comes from Larry Biegelsen from Wells Fargo. Please go ahead.\n\nUnknown speaker -- Wells Fargo Securities -- Analyst\n\nHi. This is Charles on for Larry. I wanted to dig a bit more into the cash pay business. I mean, could you say like, was Q2 at a point where you say you feel like you optimize that and just you got the spend at kind of a stable rate if you're maybe hoping for like a stable cash burn there? And what I'm trying to get there is, I mean, it seems like obviously, the year-over-year decline within in the insurance business, but it seems like cash pay has still declined as well.\n\nSo I might be shocking that up to just you reduced spend even though it's a bit more efficient. But I mean, I'm trying to get at, like if -- once you hit a stable baseline in that spend, do you find that -- find where you need to maintain that investment? Is that I mean, are you able to hit a baseline in that cash payer eventually return that to growth? Or I know you didn't give guidance, but just trying to get a sense on if you think that business is at or near a low point or where -- what it might start to --\n\nChristian Gormsen -- President and Chief Executive Officer\n\nI think given the distraction of management and all the activity that was going on outside of the commercial side of the business with settling with the DOJ as well as fundraising and the associated activities, I think we have found a stability point in the cash pay business to which we can kind of take the reset. I think Q2 was a transitional period now we can -- with the new funding as well as the progression of conversations on some of the omnichannel strategy, we can focus back on the business. And although we are providing guidance, I think it's fair to say that we feel that the -- we have found a steady state in the cash pay business.\n\nUnknown speaker -- Wells Fargo Securities -- Analyst\n\nI think that's well -- you answered that.\n\nChristian Gormsen -- President and Chief Executive Officer\n\nExactly, where the priorities lay for the operating team is like how do we sort of establish what -- where do we find the right balance of efficiency versus spend and positioning us to really move forward. And I think we clearly learned a lot through Q2.\n\nUnknown speaker -- Wells Fargo Securities -- Analyst\n\nPerfect. Good to hear. Thanks, guys.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNicholas Laudico -- Senior Vice President, Strategy and Investor Relations\n\nChristian Gormsen -- President and Chief Executive Officer\n\nAdam Laponis -- Chief Financial Officer\n\nLily Lozada -- J.P. Morgan -- Analyst\n\nMaggie Boeye -- William Blair -- Analyst\n\nUnknown speaker -- Wells Fargo Securities -- Analyst\n\nMore EAR analysis\n\nAll earnings call transcripts"
}