{
  "companyName": "Vera Bradley",
  "companyTicker": "VRA",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/31/vera-bradley-vra-q2-2023-earnings-call-transcript/",
  "content": "Vera Bradley (VRA 3.42%)\nQ2 2023 Earnings Call\nAug 31, 2022, 9:30 a.m. ET\n\nOperator\n\nGood day, and welcome to the Vera Bradley second quarter fiscal 2023 earnings conference call. Today's conference is being recorded. At this time, I would like to turn the conference over to Mr. Mark Dely, chief administrative officer.\n\nPlease go ahead, sir.\n\nMark Dely -- Chief Administrative Officer\n\nGood morning, and welcome, everyone. We'd like to thank you for joining us for today's call. Some of the statements made during our prepared remarks and in response to your questions may constitute forward-looking statements made pursuant to and within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 as amended. Such forward-looking statements are subject to both known and unknown risks and uncertainties that could cause actual results to differ materially from those that we expect.\n\nPlease refer to today's press release in the company's most recent Form 10-K filed with the SEC for a discussion of known risks and uncertainties. Investors should not assume that the statements made during the call will remain operative at a later time. We undertake no obligation to provide any information discussed on today's call. I will now turn the call over to Vera Bradley's CEO, Rob Wallstrom.\n\nRob?\n\nRob Wallstrom -- Chief Executive Officer\n\nThank you, Mark. Good morning, and thank you for joining us on today's call. John Enwright, our CFO, also joins me today. While total company second quarter revenues of $130.4 million were modestly below our expectations, and we continue to experience gross margin pressures due to logistics costs, we drove product innovation at both Vera Bradley and Pura Vida, initiated meaningful cost reduction actions and completed $6 million of share repurchases, while maintaining a solid debt-free balance sheet.  We are continuing to see bifurcation in the spending of our customer base.\n\nAt Vera Bradley, direct full price channel comparable revenues were nearly flat to last year and up double digits to fiscal 2020. Additionally, our Vera Bradley indirect channel continued to experience a healthy year-over-year rebound. However, inflationary pressures, especially higher gas prices continue to negatively impact the traffic and spending in our Vera Bradley factory stores. However, as gas prices are easing, we have seen a recent improvement in our factory traffic and revenues.\n\nWe are taking decisive actions to strengthen our core brands and the overall enterprise. We have begun implementation of targeted cost reductions of $25 million, which are expected to be fully realized in fiscal 2024. These cost reductions will help offset inflationary expense pressures and the recessionary spending behavior from lower income households. Expense savings are being derived across various areas of the company including retail store efficiencies, marketing expenses, information technology contracts, professional services, logistics and operational costs and corporate payroll.\n\nIn addition, we are continuing to evaluate and execute strategic price increases for both brands to offset rising raw material and freight costs. At our Vera Bradley brand, we remain confident in our core strategy by continuing to innovate and build on our lifestyle merchandising focus. We are continuing to optimize the travel category, which is nearly back to pre-pandemic levels, maximizing back-to-campus opportunities with strategic assortment enhancements and continuing with powerful product collaborations like Disney and Harry Potter. And we are excited about expanding our home assortments this fall and adding cloud slip bonds and miles to our Vera Bradley footwear franchise next month.\n\nPure Vida's e-commerce revenues continue to be affected by the shift in social and digital media effectiveness and escalating digital media cost. At Pura Vida, we are evolving our business model from one that is largely dependent on e-commerce and digital marketing to one that is a true omnichannel business with a more diversified marketing base. This will take time, but we are taking the actions to make this transformation happen and return the brand to long-term growth. Our No.\n\n1 priority is to build a more diverse, innovative, effective and performance-based marketing program to drive e-commerce sales, and we are bolstering our internal marketing and data analytics talent. Most importantly, we are in the process of implementing a comprehensive customer data platform for Pura Vida to build a single coherent, complete view of each customer so that we can better target and personalize marketing and become less reliant on third-party marketing. In the meantime, we are continuing to work with our micro influencers, expanding our TikTok presence, launching impactful ads on Connected TV, optimizing SMS and aggressively exploring other methods to effectively reach our customers day in and day out. Pura Vida's future growth will be a balance of online growth and growth in physical distribution channels.\n\nstores will play a key role in driving new customer acquisition as we continue to diversify our marketing platforms. During the quarter, we opened a new Pura Vida store in the Irvine Spectrum Center in Irvine, South California. And in August, we opened a third location at Broadway at the beach in Myrtle Beach, South Carolina. Like our original location opened last year in San Diego's Westfield UTC Mall, both new locations are exceeding our expectations.\n\nWe will open a four store at the SanTan Village in Metro, Phoenix in September. Stores can play a key role in driving new customer acquisition as we continue to diversify our marketing platforms, and they demonstrate the power a retail presence has in driving digital sales, omnichannel loyalty and spending. For example, we continue to experience a double-digit differential in our San Diego e-commerce business relative to the rest of the country since that store opened. We look forward to the impact of more stores in the future.\n\nOn the product front, we continue to build customer excitement and engagement through collaborations like Disney, Harry Potter, Hello Kitty and the World Surf Lake partnering with key influencers, offering theme collections centered around key events like Shark Week and the launch of our demi-fine collection featuring 18-carat gold plated, sterling silver and natural stones. Looking to the balance of the year and even into next year, we are planning for the macro environment to remain challenging. And despite the strength in Pura Vida store business and opportunity for new store openings, we expect it to take time to return Pure Vida's e-commerce business to growth as rebuilding and transforming the marketing program is underway. We are taking critical actions that will further strengthen both core brands and our company as a whole, not only to successfully manage through this period but to position us for the future.\n\nOur teams are focused and our cash position and balance sheet remains strong. We have successfully managed through challenging business cycles before, and I am confident that we will manage through this period as well. We look forward to returning both brands to steady growth. Now let me turn the call over to John to review the financial results.\n\nJohn?\n\nJohn Enwright -- Chief Financial Officer\n\nThanks, Rob, and good morning. Let me go over a few highlights for the second quarter. The numbers I will discuss today are all non-GAAP and exclude the charges outlined in today's release, totaling $32.2 million on an after-tax basis. The major components of this total are a write-down of Pura Vida goodwill and intangible asset impairment charges of $18.2 million, $7 million of severance charges and consulting fees primarily associated with cost-saving initiatives, and $5.6 million of inventory-related charges for the write-down of masks and other inventory as well as fees related to the cancellation of certain orders for the spring 2023 goods.\n\nFor complete detail of items excluded from the non-GAAP numbers as well as a reconciliation of GAAP to non-GAAP numbers, please reference today's press release. Consolidated net revenues totaled $130.4 million compared to $147 million in the prior-year second quarter. Consolidated net income totaled $2.4 million or $0.08 per diluted share compared to $9.5 million or $0.28 per diluted share last year. Vera Bradley Direct segment revenues totaled $87 million, a 10.4% decrease from $97.1 million last year.\n\nComparable sales declined 13.8% in the second quarter. Vera Bradley Indirect segment revenues totaled $17.3 million, a 2.9% increase over $16.8 million in the prior-year second quarter. Pura Vida segment revenues totaled $26 million, a 21.3% decrease from $33.1 million last year. Second quarter gross margin totaled $67.8 million or 52% compared to $80.4 million or 54.6% last year.\n\nThe current year rate was negatively impacted by higher inbound and outbound freight expense, deleverage of overhead costs and channel mix changes, partially offset by price increases. Consolidated SG&A expense totaled $64 million or 49.1% for the current quarter compared to $68 million or 46.2% last year. As expected, Vera Bradley's SG&A current year expenses were lower than prior year, primarily due to a reduction in variable related expenses due to lower sales volume and other cost reduction initiatives. The company's second quarter consolidated operating income totaled $3.9 million or 3% of net revenues compared to $13.4 million or 9.1% of net revenues in the prior year.\n\nNow let's turn to the balance sheet. Total quarter end inventory was $179.6 million compared to $148 million at the end of the second quarter last year. We have $24 million of additional inventory in transit this year as we continue to navigate delays in the supply chain and ensure we have adequate inventory coverage going into the fall and holiday selling periods. Cash, cash equivalents and investments at quarter end totaled $38.3 million compared to $76.5 million at the end of last year's second quarter.\n\nA key reason for the lower cash position is due to the inventory build of $31.6 million over last year. We remain in a solid cash position with a debt-free balance sheet. We will continue to take a conservative approach to cash particularly in this volatile and challenging environment. During the quarter, we repurchased approximately $6 million of our common stock, representing one million shares at an average price of $6.11.\n\nWe have $29.3 million remaining under our $50 million repurchase authorization. Now let's shift to our fiscal 2023 outlook. We expect the challenging macroeconomic environment to continue for the balance of the year and anticipate it will take additional time to return Pure Vida e-commerce business to growth. High gas prices and other inflationary pressures will continue to impact the Vera Bradley factory channel, and there will be a continued pressure on gross margin.\n\nAs a result, we have adjusted our outlook for the balance of the fiscal year. All forward-looking guidance numbers that I will discuss are non-GAAP. For fiscal '23, we expect consolidated net revenues of $480 million to $490 million compared to $540.5 million in fiscal 2022. We expect our consolidated gross margin will range from 53.7% to 54.1% compared to 53.3% last year.\n\nWe expect year-over-year increase is primarily related to incremental inbound and outbound freight expense and expected deleverage on overhead costs, more than offset by price increases. Consolidated SG&A expense should range from $246 million to $250 million compared to $258.8 million in fiscal 2022. The reduction in SG&A expense is being driven by cost reduction initiatives and a reduction in compensation expense marketing and other variable related expenses due to the expected sales decline from last year. We expect consolidated diluted EPS of $0.20 to $0.28 compared to $0.57 last year.\n\nNet capital spending should total approximately $8 million to $10 million compared to $5.5 million in the prior year. Operator, we will now open the call for questions.\n\nOperator\n\nThank you. [Operator instructions] And we'll take our first question from Oliver Chen with Cowen and Company. Please go ahead.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nHi, Rob and John. Good morning. Could you speak to the inventory in terms of the status of it with having coverage yet taking the write-downs. Why was this the right time for the write-down? And what does that mean going forward? You also have some cancellations.\n\nSo I would love to understand the composition of inventory because it sounds like some things are working but clearly, some are not. Thank you.\n\nJohn Enwright -- Chief Financial Officer\n\nYeah. Oliver, good question. For the write-downs, it was more specific to certain categories. So as we looked at our mask inventory, we had built the mask inventory based on the pandemic.\n\nAnd we had expected to continue to work through that inventory. With some of the changes from the CDC as well as just consumer behavior. We're not seeing -- really seeing that sell-through. So that was the vast majority of the write-down in both brands, it was associated with mask inventory.\n\nIf you look at the remainder, it really was associated with tech accessories and think about it as kind of older iPhone accessories that ultimately, we're also not seeing the sell-through as people have moved on to newer models. So really, that was the basis of the write-down and why we took the write-down at this time. In inventory, the growth year over year is really being driven by two things. It's really been driven by the in-transit inventory is about a 100% higher than it was at this point last year in the second quarter, just to ensure we have the appropriate product in place for the holiday season as well as incremental freight expenses that has burdened the inventory.\n\nYear over year, we've seen that increase from where we were in the first half of the year. Obviously, the back half of the year, the freight expense was exacerbated last year, and we're seeing some benefit or we should see a little bit of benefit to that given how freight is being less challenged this year versus last year.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nOK. And the comps being down $13.8 million, what happened in terms of the volatility, it's the biggest negative portion of traffic? And what's implied in your guidance for what you're seeing? And did you close more stores than you expected to or was that already in your plans?\n\nJohn Enwright -- Chief Financial Officer\n\nSo this year, ultimately, we're close about -- we're going to close about the number of stores that we anticipated as we continue to look for next year, we're still working through what that means next year. In regards to the comps, the comps are being driven really from the business, the outlet business. We're seeing better performance in our full price business, whether that is in full line stores or that's on verabradley.com. And we're taking the expected trend that we saw in the first half of the business in those channels and assuming that they're similar in the back half of the year.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nOK. And on the Pura Vida side, the issues around digital marketing have been apparent within the industry at large for a while. What's happening now with the state of digital marketing and the path ahead for that business. What are the key hurdles and things that you need to do to improve it more structurally and have it be more sustainably growing over time?\n\nRob Wallstrom -- Chief Executive Officer\n\nYeah, I think from the Pura Vida marketing, Oliver, I think a few things. One, you're right that they're definitely in this direct-to-consumer market. Everybody is feeling the impact. For us at Pura Vida, we've been bringing in both outside teams as well as supplementing talent to move our reliance on what I'll call the meta platform for lack of a better term, in terms of Instagram, Facebook and in those platforms and starting to push more into first-party marketing, building up our CDP platform and also looking at other alternatives.\n\nSo in other words, they're launching Connected TV program. here in this quarter coming up. So we're looking at new ways of doing that. But long term, we believe that part of the fix to the marketing challenge is also going to be this diversification into omnichannel as you've seen with other direct-to-consumer companies that what we've seen in San Diego, it has been encouraging to see such a significant relative improvement in the San Diego market.\n\nIf we continue to see that, which the early signs, and it's only been weeks and months in the other stores, we're seeing similar behavior in the other locations that we think that stores in and themselves will play a very important part in stabilizing the Pura Vida business as we go forward.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nOK. And on the merchandise margins and price increases, could you update us on your thoughts there? It feels like the environment has gotten worse, yet you've been able to get some price increases. What are you thinking about what's embedded for merchandise margins and also inflation of the COGS relative to price increases going forward?\n\nJohn Enwright -- Chief Financial Officer\n\nSo from a merchandise margin perspective, we're actually seeing -- the price increases are being accepted and we're seeing improvement year over year. Really, the challenge that we're seeing is associated with logistics costs. We're actually seeing from logistics costs some benefit potentially in the back half of the year, and we're thinking we'll see that benefit into next year just given some of the inflationary pressures on the macro economy. So we would expect to see some benefit from those inflationary costs, i.e., freight into the back half and into next year.\n\nIn regards to product cost, we're still working through some of the challenges associated with that. But we don't anticipate a significant increase in some of our raw material costs into next year given some of the macro events that are happening and how the economy generally speaking, from a worldwide perspective is not as strong as it was this time last year. We are still assessing whether or not -- whether it makes sense to continue to push prices, and we'll continue to do that through the remainder of this year and as we look into next year.\n\nRob Wallstrom -- Chief Executive Officer\n\nI think though from a price increase, Oliver, what we're doing is we took pretty broad price increases across both brands in the beginning of the year and kind of been working through that in the first half of the year. I think as we look at going forward, it's going to be more micro adjustments on those price increases. So not as much across the board. We think in a lot of cases, we've kind of -- the consumer has accepted, but we can already begin to see that there are some resistance in a few items.\n\nSo it's going to be a much more detailed adjustment in prices as we go through the next 12 months.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nOK. Very helpful. On the balance sheet and cash balance. What should we know about working capital and the source or use of cash flow in terms of 3Q, 4Q.\n\nYour cash balance went down $38.3 million in the year. Should we be worried about that?\n\nJohn Enwright -- Chief Financial Officer\n\nYeah. I would then -- obviously, everything is continuing on kind of performance in the back half of the year. I would say, as we think about how we're looking at cash and cash utilization in the first half of the year, we spent some money increasing from an inventory's perspective as well as a usage of cash associated with share repurchases. We would like to be more conservative on the back half of the year in both of those uses of cash.\n\nAnd as we currently forecast, we expect our cash balance to grow by the end of the year but that's all contingent on our performance.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nOK. Rob, on the consumer, the bifurcation trend has continued, and you called it out early and then plenty of retail companies just even taken guidance out. What are you seeing now with the consumer? Does the volatility concern you? We certainly have a lot of negatives and positives as the consumers still have spending power.\n\nRob Wallstrom -- Chief Executive Officer\n\nYeah, I think a couple of things. I think, one, what we're seeing from a spending behavior, the biggest story for us is the impact of gas prices on the factory channel, we'll be perfectly honest, even not so much just total discretionary spending, but just the ability to go out to factory stores generate the traffic there that we're seeing the impact. So that's our biggest concern. So gas prices in and of themselves is the No.\n\n1 impact we're seeing. So it's been good as gas prices started to moderate a little bit. We saw traffic beginning to rebound in factory stores relative to trend. And we began to see that come through on the revenue line.\n\nSo we're hoping that the gas price situation continues to moderate, and that could be helpful. Overall, it's been interesting watching the consumer. I know all of us are thinking about the back half and what's going to be happening with the consumer. But as we think about what's been happening in July and August, we haven't seen an overall further deterioration.\n\nAnd I think a lot of it is that gas price piece that's been rebounding and moderating. So we're hopeful that where we see the consumer today as we move through the year will be similar to what we see in the back half. It's not robust by any means, but we're not seeing further deterioration, which is good.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nOK. And then I wonder if you could just talk briefly about the key product initiatives both Vera and Pura Vida that we should be focused on just a few priorities, we know you've done a lot of innovative partnerships and the Pura Vida brand is definitely mission focused.\n\nRob Wallstrom -- Chief Executive Officer\n\nWell, I think a couple of things. I think, one, if you think about the product assortment, there's a couple of different ways we look at the product innovation. So from a licensing standpoint, that's been very successful across both brands, that's been very impactful, not only in driving some revenue and excitement, but really in customer acquisitions. So those programs are really important to bringing new customers in.\n\nIt makes the marketing efficiency stronger. So we continue to see that we'll continue to look for those partnerships and keep them exciting as we move forward and just stay tuned for more new exciting announcements there. If you get into specifics in terms of product categories across the two brands at Vera Bradley, they continue to do a lot of innovation. We have things not only our core innovation that we've seen coming through, but also in newness.\n\nSo like the Vera Bradley footwear launch in fall is going to be an important launch for us, we're going to watch that. At Pura Vida, there's two things we're looking at. One, the consumer still is very, very engaged in the core bracelet business, particularly as travels rebounded that we're seeing that, that business kind of take a pop back up, which is encouraging to see. And then at the same time, they've launched into this demi-fine collection, which is just a higher price point, a higher quality and the initial response has been very positive there and really has helped us to kind of reengage deeper that 25 to 35-year-old customer, which has historically been part of the magic of Pura Vida both this kind of young teenage customer as well as this 25 to 35-year-old customer.\n\nSo those are the areas that I would say are the most important to be watching.\n\nJohn Enwright -- Chief Financial Officer\n\nThe only thing I would add to that, Rob, if you think about Pura Vida in the stores, the apparel business, when the consumer gets the opportunity to touch and feel and the quality of the apparel business, we're seeing them engage with that product much more broadly than they do when they're online. So as we open up more stores, there will be an opportunity for that category.\n\nRob Wallstrom -- Chief Executive Officer\n\nYes.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nOK. And on the charges, the biggest one was an $18.2 million Pura Vida asset impairment charge. What was underlying that valuation from accounting or market valuation perspective? And then the $0.8 million of store impairment, could you just provide a little more details about what that's related to the $0.6 million of store impairment? Thanks.\n\nJohn Enwright -- Chief Financial Officer\n\nSure. So if you think about the Pura Vida impairment, the majority of that is associated with a goodwill impairment or trade name impairment. And really, on an annual basis, we do a test after we made that purchase, and we look at future cash flows. Given the current performance of the brand and the near-term expected performance of the brand, based on just the expected cash flows we had to write down that goodwill and that trade name.\n\nIn regards to the store impairment, we looked at really it's the same thing. We look at future cash flows of those individual stores compared to the current asset value for those stores and based on the expected cash flow as we needed to write-off some of those assets.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nShould we be concerned about incremental write-offs? I mean I guess this is a review process that has to be done regularly from an accounting regulation perspective, is that a true statement? And Rob, as you step back and what do you think are the key risk factors that you're monitoring?\n\nJohn Enwright -- Chief Financial Officer\n\nSo I'll just answer the first question, right? So yes, we have to regularly review the goodwill balance. So we'll do that on a quarterly basis as a review, we do an actual test on an annual basis, which is done in the second quarter. So we'll continue to review it. Based on what we've put forward and our expectations for the business, we would say if we perform to that expectation, and we shouldn't see another write-down.\n\nRob Wallstrom -- Chief Executive Officer\n\nAnd then I think your second part of the question, Oliver, what I'll do is talk about the risks and opportunities because I think both are really important. So from a risk standpoint, taken it by brand, at Vera Bradley, I would say the No. 1 risk factor at this point is gas. If gas rebounds almost then we're back $5, $6, $7, $8 a gallon as we go in the back half of the year but that will suppress the factory channel.\n\nSo I would say gas is by far the largest risk. At Pura Vida, I think it's just a matter of the recovery, this digital marketing and how -- what was big asset for the business was its ability to manage digital marketing and not having the same impact. We've got to get the marketing platform reset. So getting that reset is the biggest risk in the Pura Vida business.\n\nBut I think it's important to talk about opportunity because if you back up and you think about what's going to company, I think that there's three big macro impacts that have impacted us. So one is the logistics cost. The logistics costs that are flowing through our P&L right now are what we would probably consider peak from what we're seeing. We're beginning to see logistics costs, particularly the international inbound shipping begin to moderate.\n\nAnd so that hopefully will be a tailwind as we move forward and can help us. So that's encouraging. I actually think that that's a positive on the logistics as we move through the end of the year, particularly as we are able next year to redo contracts since we're able to get the capitalized costs, working through the balance sheet, but that will be a profit improvement that you'll definitely see as we move into next year, which is encouraging to see. So one of the macros is logistics and duty that will get better.\n\nSo that's good news. The second real big one has been this gas price impact in factory. So as gas prices moderate, which we think we're hoping to see that, that will be a lift. And then the third one has just really been this performance marketing with Pura Vida.\n\nAnd as we have more stores that will help us, as we get all of the work that we're investing now in terms of the data platform and rebuilding the performance marketing organization, I think that that's another big lift. But I think that the three things that have affected our business in terms of gas, logistics and this digital media shift are just big macro ones that we were more exposed overall withing the industry. So we're working through them, but I think we're working through them and it will get better as we move into next year.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nOK. And last question. So one, on the digital marketing and performance. Was that an issue of Vera Bradley brand and/or are there any highlights there? And second, regarding the inventory cancellations sounds proactive, which parts of the inventory did you do that with in terms of the compensation? Thanks a lot.\n\nRob Wallstrom -- Chief Executive Officer\n\nJohn, do you want to take to the inventories and I can talk about...\n\nJohn Enwright -- Chief Financial Officer\n\nYeah. If you can just repeat your question on inventory, I didn't actually hear the specific question, Oliver.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nJohn, in terms of the inventory cancellations, which ones did you -- mean which parts of the inventory needed to be canceled?\n\nJohn Enwright -- Chief Financial Officer\n\nSo we looked at future orders that made in all categories, quite honestly. So we looked at where we expected the sales to come in on a forward basis into next year and where we were -- we expected to sit in inventory. And we looked at opportunities where we felt that there was -- we could offset some of the liability based on new sales expectations and obviously, with the inventory growing year over year. So it wasn't specific to a particular category or specific to opportunistic ability to cancel some orders, really.\n\nRob Wallstrom -- Chief Executive Officer\n\nYeah, I think the only thing I would add to that, Oliver, if you just think about what's been happening in our factory channel, right, this gas price has gone up, business has slowed. So getting that inventory back in line is probably one of the primary drivers of that cancellation. So don't think about it as, oh well, a category is not working or an items not working, that's not really it. It's just an overall demand, and it gave us the opportunity to just kind of moderate that inventory risk as we went into next year.\n\nSo.\n\nJohn Enwright -- Chief Financial Officer\n\nYeah, I think it's more channel-specific versus category-specific. That's a good way to think about it.\n\nRob Wallstrom -- Chief Executive Officer\n\nYeah. Yeah. I think your second question, Oliver, was what about Vera Bradley in digital marketing. So I think there's two different aspects.\n\nFirst of all, one of the great assets at Vera Bradley is we have a very strong first-party marketing. we control our customers, we communicate with them directly. We're not as dependent upon third-party marketing for our known customer base. We use the third-party marketing more for acquisition.\n\nAnd then what the team has been able to do here over the last couple of years of building out our highly detailed analytical performance marketing base. They are -- they've been able to mitigate some of the cost by rebalancing, refocusing. They have a few more tools in the toolbox, shall we say.  And so what we're doing is taking a lot of those learnings that we've already implemented at Vera Bradley and beginning to leverage back against Pura Vida to learn from. But the biggest difference in Vera Bradley is not that they haven't experienced some of the same challenges, they've been a little bit more effective in finding workarounds, but to -- it's not as impactful to the total business as it is at Pura Vida.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nOK, thanks for answering all my questions. Best regards.\n\nRob Wallstrom -- Chief Executive Officer\n\nThank you, Oliver.\n\nJohn Enwright -- Chief Financial Officer\n\nThank you, Oliver.\n\nOperator\n\nAll right. Next, we'll take questions from Joe Gomes with Noble Capital. Please go ahead.\n\nJoe Gomes -- Noble Capital Markets -- Analyst\n\nGood morning.\n\nRob Wallstrom -- Chief Executive Officer\n\nGood morning, Joe.\n\nJoe Gomes -- Noble Capital Markets -- Analyst\n\nYou talk about the positive impact of opening Pura Vida stores. You got the one additional one in Phoenix to open. I think in September, you mentioned. Can you kind of give us a game plan of what you see on a go-forward basis of new store openings in Pura Vida?\n\nRob Wallstrom -- Chief Executive Officer\n\nYeah, Joe, I can jump into that one. So first of all, we do have the new store in SanTan that's opening. We are now anniversarying our UTC store in San Diego. So we're obviously going to start watching that from a comp performance standpoint.\n\nAnd once we kind of evaluate, I would say, this fall, how all the new stores are performing. It'll really form our go-forward real estate strategy. But I do believe there's significant opportunity for stores in the Pura Vida brand going forward.\n\nJoe Gomes -- Noble Capital Markets -- Analyst\n\nOK. And then you talked about the $25 million cost reduction initiatives which is kind of at the high end of what you talked about previously. Wondering how did you get to the high end? And two, how much of that did impact the second quarter? Because I think in the first quarter call, you mentioned you did expect to see some of that flow through in the second quarter.\n\nJohn Enwright -- Chief Financial Officer\n\nYeah, so we saw a little bit in the second quarter flow through because we weren't finalized with all the plans really in the middle part of the second quarter. But we obviously on a quarterly basis, given performance, we look at opportunities to make savings regardless if it was associated with the $25 million. And we will see some of that benefit, which is built into our guidance in the back half of the year. How we ended up at the high end, we really just looked at kind of opportunity and really the teams, all worked together based on where we see current performance and where we expect the business to be next year on areas that we felt we could slim down.\n\nAnd so it really was a collective effort among both brands and the corporate team to come up with that value.\n\nJoe Gomes -- Noble Capital Markets -- Analyst\n\nOK. And just one of the things that you had talked about in the past has been M&A being part of the growth strategy given the transition going forward here, do we still see M&A as part of the growth plan and the growth strategy, I guess? Or is that going to kind of take a backseat to getting and working on the two existing brands?\n\nRob Wallstrom -- Chief Executive Officer\n\nThat's a great question, Joe. I think that what the board and the team's focus is, number one is getting the two core brands strong. Vera Bradley, overall, we think is in a pretty good place, but we need to see the macro environment improve there. The Pura Vida, we need to get the performance marketing really working and get that brand really turned around.\n\nAnd the board is very focused on getting those two things accomplished first before highly focusing shall we say, on M&A activity. I think we're always open to any version of shareholder return, but I don't think that the M&A activity is going to be a primary focus over the next 12 months. And as we get through the transition, I think that the board and the new CEO will kind of align on what role does M&A play as we move forward.\n\nJoe Gomes -- Noble Capital Markets -- Analyst\n\nOK, great. Thanks for taking the questions. I'll get back in queue and let someone else ask a question.\n\nRob Wallstrom -- Chief Executive Officer\n\nThanks, Joe.\n\nOperator\n\nAll right. And our next question will come from Eric Beder with SCC Research. Please go ahead.\n\nEric Beder -- Small Cap Consumer Research -- Analyst\n\nGood morning. \n\nRob Wallstrom -- Chief Executive Officer\n\nGood morning. \n\nJohn Enwright -- Chief Financial Officer\n\nGood morning.\n\nEric Beder -- Small Cap Consumer Research -- Analyst\n\nI want to do a follow-up on the $25 million in savings. How much of that is going to be incremental next year? What should we be thinking about in terms of the flow up? And I know you mentioned there's going to be some in the back half. How much of that is going to be -- thinking about that?\n\nJohn Enwright -- Chief Financial Officer\n\nYeah, so if you think about kind of how -- your question is how much are we going to achieve this year versus the full run rate next year. And I think there's an opportunity this year probably to achieve, call it, 40% of the total. There might be more opportunity, but we're looking at kind of the timing associated with that.\n\nEric Beder -- Small Cap Consumer Research -- Analyst\n\nOK. So if I look at some of the prior things you've gone through almost two years of the Harry Potter piece, that's how it's time come up. What have you taken away from that? Are there collaborations in terms of how long they should be and how do you keep them fresh going forward?\n\nRob Wallstrom -- Chief Executive Officer\n\nI think are couple of things that we've learned from our collaborations is first of all, they are a great way to bring customers into the brand. We've had success in bringing new customers in and converting them into the brand, which has been very encouraging across both Vera Bradley and Pura Vida. So we think that it definitely plays an important role. We have seen that it is important to keep that licensing pipeline fresh and continue to look for the right opportunities and find new ways of doing things.\n\nSo whenever we introduce a new licensing, the first one quite often is the largest launch. And then the other ones are more follow-ups. I think the follow-up plays a role, but I think we have to continue to be fresh, continue to look for new opportunities. And you've seen us do that in both brands, right, like last Christmas, when we did the peanuts colab at Vera Bradley, that was fresh and new and highly impactful and you're seeing the same type of thing at Pura Vida.\n\nSo I think we have to keep that pipeline fresh as we move forward.\n\nJohn Enwright -- Chief Financial Officer\n\nAnd I think -- just to add on to it, I think it's the execution of product. So at Pura Vida, if we're in the second release of Disney Harry Potter, and we're seeing good success in the second release and probably a little bit better success than we saw in the first release. And I just think that speaks to kind of how the product evolves over time too. And product and marketing execution.\n\nRob Wallstrom -- Chief Executive Officer\n\nBecause what was encouraging is that for Harry Potter, they did put some video out. And so I think it's a combination of both the product and marketing.\n\nEric Beder -- Small Cap Consumer Research -- Analyst\n\nOK. Store base for Vera Bradley, you got about 65 or so full price, 77 or so outlets. What should we be thinking longer term? Are those about where you want to be for these pieces of the chain and then the assets have gone up and the spot prices continue to decline. What should we be thinking about that?\n\nJohn Enwright -- Chief Financial Officer\n\nYeah, I would continue to think that we'll close some full price stores ultimately still working through that for next year and what the number will be, but I think we'll see that number come down. And we still think there's still some opportunity in the factory channel for Vera Bradley for next year and into the years after that. But I don't know if we'll be opening six a year because that's typically what we've opened up in the past few years, but we still think there's opportunity to increase that. But the organization and team is looking at other opportunities from a full price perspective for Vera Bradley, we're not going to continue to close all the doors that we're just looking at opportunities and how we can -- how and where we can speak to our consumer a little bit better.\n\nEric Beder -- Small Cap Consumer Research -- Analyst\n\nOK. And last quarter, you guys did some online, I guess, flash sales for the outlets. What was the response to that? And is that something that's going to continue to expand going forward? Because I know you tried to keep the outlet sales outside of the online in the website.\n\nJohn Enwright -- Chief Financial Officer\n\nSo we have -- on a monthly basis, we have on -- we have, call it, flash sale, what we call online outlet. And that's up every month, and it's been up for two years, three years that we've been doing it. It has more -- I think your question maybe you -- had more factory product, outlet product than we have had previously. And as we work through inventory, I would expect it to continue to have a higher percentage of factory product than it's had historically as we work through our inventory values this year.\n\nRob Wallstrom -- Chief Executive Officer\n\nYeah. No, I think everything John said is definitely what the focus. I think the other thing to keep in mind is that as John said, we've had the online outlet now for a few years. And what it really does is help us liquidate.\n\nSo what you're seeing is that because factory inventory is building, we're putting more factory in there. If we were in a different situation, we have more full line, we would adjust it. So it's a very efficient liquidation channel for us, and we'll continue to do that. But we don't -- at this point, we have not executed that as a primary growth channel.\n\nWe've just used it as a primary liquidation channel.\n\nEric Beder -- Small Cap Consumer Research -- Analyst\n\nOK. All right. Guys, good luck on the back half of the year.\n\nRob Wallstrom -- Chief Executive Officer\n\nThanks, Eric.\n\nJohn Enwright -- Chief Financial Officer\n\nThanks, Eric.\n\nOperator\n\nAll right. And we have no additional questions at this time. I'll turn the call back to Rob Wallstrom for closing remarks.\n\nRob Wallstrom -- Chief Executive Officer\n\nBefore I close, I wanted to give you a brief update on the CEO search. As you know, I recently announced my planned retirement but my plans are to remain in the CEO role until my successor is named, which is expected by the beginning of 2023. The board has formed a search committee and a national search is underway. As the board searches for the next CEO, they are in the desirable position of having two iconic brands with a loyal and dedicated customer bases, a solid balance sheet and a talented leadership team.\n\nThe board takes very seriously its responsibility to find the right CEO, and we'll continue our focus on building consistent, sustainable growth over the long term. We are preparing for the macro environment to remain challenging through the remainder of this year and into next year. We know it will take time, but we are taking decisive actions that will further strengthen both core brands and our enterprise as a whole. Our challenges have been largely driven by the macro environment, but we have a solid foundation with our two unique brands, strong customer loyalty and amazing cultures.\n\nI am confident that the company will return to growth as the economic headwinds and cost pressures begin to rescind. Thank you for joining us today, and we look forward to speaking with you on December 7 on our third quarter earnings call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMark Dely -- Chief Administrative Officer\n\nRob Wallstrom -- Chief Executive Officer\n\nJohn Enwright -- Chief Financial Officer\n\nOliver Chen -- Cowen and Company -- Analyst\n\nJoe Gomes -- Noble Capital Markets -- Analyst\n\nEric Beder -- Small Cap Consumer Research -- Analyst\n\nMore VRA analysis\n\nAll earnings call transcripts"
}