{
  "companyName": "TENCENT HLDGS UNSP/ADR",
  "companyTicker": "TCEHY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/16/tencent-hldgs-unspadr-tcehy-q3-2022-earnings-call/",
  "content": "TENCENT HLDGS UNSP/ADR (TCEHY -2.15%)\nQ3 2022 Earnings Call\nNov 16, 2022, 7:00 a.m. ET\n\nOperator\n\nGood day and good evening. Thank you for standing by. Welcome to Tencent Holdings Ltd. 2022 third-quarter results announcement webcast.\n\nWendy Huang from Tencent IR [Inaudible] At this time all participants are in a listen-only mode. After management's presentation, there will be a question-and-answer session. [Operator instructions] And please be advised that today's webinar is being recorded. Before we start the presentation, we would like to remind you that it includes forward-looking statements which are underlined by a number of risks and uncertainties and may not be realized in the future for various reasons.\n\nInformation about general market conditions is coming from a variety of sources outside of Tencent. This presentation also contains some unaudited and non-IFRS financial measures that should be considered in addition to, but not as a substitute for, measures of the group's financial performance prepared in accordance with IFRS. For a more detailed discussion of risk factors in non-IFRS measures, please refer to our disclosure documents on the IR section of our website. Let me now introduce the management team on the webinar tonight.\n\nOur chairman and CEO, Pony Ma, will kick off with a short overview. President Martin Lau will discuss strategy review. Chief Strategy Officer James Mitchell will provide a business review. Chief Financial Officer John Lo will conclude with financial discussion before we open the floor for questions.\n\nI will now pass it to Pony.\n\nPony Ma -- Chairman and Chief Executive Officer\n\nThank you, Wendy. Good evening. Thanks, everyone, for joining us. During the third quarter, we streamline our costs and activate new revenue-generating services, returning to year-on-year earnings growth.\n\nWe also delivered a quarter-on-quarter earnings growth with a strong tailwind from positive seasonality. Total revenue was RMB 140 billion, down 2% year on year but up 5% quarter on quarter. Gross profit was RMB 62 billion, down 1% year on year but up 7% quarter on quarter. Non-IFRS operating profit was RMB 41 billion, flat year on year and up 12% quarter on quarter.\n\nNon-IFRS net profit attributable to equity holders was RMB 32 billion, up 2% year on year and 15% quarter on quarter. For our key services, we [Inaudible] first-place positions in activities, including social, games, long-form video, news, music, literature, payment, and mobile browser. Combined MAU of Weixin and WeChat was 1.3 billion. Mobile devices MAU of QQ was 574 million.\n\nI will now hand it over to Martin for strategy review.\n\nMartin Lau -- President\n\nThank you, Pony, and good evening and good morning to everybody. In last quarter's strategy review, I discussed how we have positioned ourselves to improve efficiencies, develop new revenue streams, and soon revive our profit growth. Today, I will update you on our progress and some early stage results. In addition, I would touch on our latest steps in returning capital to shareholders.\n\nLet's start off with the progress of our efficiency initiatives. First, we further tightened our control of marketing costs, pulled back from projects with low-cost efficiency and focused on resources and core products. As a result, selling and marketing expenses decreased by 32% year on year and by 10% quarter on quarter. Second, we achieved a significant margin improvement in business services.\n\nGross profits grew both year on year and quarter on quarter, benefiting from our proactive adjustments to generate high-quality revenue. Third, we optimized bandwidth and server utilization associated video accounts, bringing down our operating costs per video view significantly. Fourth with our rationalization in noncore and underperforming businesses, we optimized our workforce and controlled staff cost. At the end of the third quarter, our total headcount was down as compared to the end of the first quarter.\n\nExcluding severance pay, total staff costs increased at a low single-digit growth rate year on year. While the macro environment is still challenging, our efficiency initiatives enabled us to achieve slightly positive year-on-year growth in profits, representing a significant improvement over the last few quarters. Looking forward, we are making encouraging progress in developing new high-quality revenue streams in the following three key growth areas. Video accounts' in-feed ads revenue has been ramping up fast since we made additional inventory available in bases in mid-August.\n\nWe are on track to exceed RMB 1 billion in quarterly revenue in the fourth quarter. For international games, we launched new hits, Tower of Fantasy and Goddess of Victory: Nikke, demonstrating our strong publishing capabilities. Our new strategic partnership with Ubisoft went on to enable us to bring more AAA franchises to mobile globally and PC titles to China. Together with the growing pipeline of a group of studios across genres and platforms globally, our international games business is well positioned for significant expansion over time.\n\nWith SaaS, we're currently prioritizing scale expansion as there are precedents in the rest of the world, which demonstrate how these services can be monetized by industry leaders. We have recently launched a subscription bundle combining WeCom, Tencent Meeting, and Tencent Docs together, which is seeing good adoption among larger enterprises. In addition, we are encouraged to see positive signals across the path of macro and regulatory normalization. For fintech services, commercial payment volume growth recovered in the third quarter.\n\nOn the regulatory front, we received approval for investment in Samsung property and casualty insurance in China, For domestic games, we received approval for a new game publishing license and an amendment to an existing license in September. We believe more licenses will be forthcoming in the future. For advertising, revenue grew quarter on quarter even excluding new contribution from video accounts in-feed ads. We are on track to resume year-on-year growth in late 2022.\n\nNext, I would like to update you on our capital allocation which we start from a position of both cash flow and asset strength. We operate a diversified portfolio of businesses spanning across social networks, games, advertising, and fintech services, each of which generates robust cash flow even under the current environment. Consequently, we generated operating cash flow of USD 25 billion over the past 12 months. After taking into account payments for capital expenditure, media content, and lease liabilities, our free cash flow amounted to USD 15 billion.\n\nOn the asset side, as of the end of September 2022, we have total gross cash of USD 44 billion, stakes in listed companies with a fair value of USD 75 billion, and stakes in unlisted companies with a carrying value of USD 48 billion. This combination of cash flow generation and liquid asset holdings enable us to simultaneously invest in our business while returning capital to shareholders. Believe we have fully supporting organic and strategic investments which benefit our business. For organic investments, we are deploying capital into growth areas we have highlighted, namely video accounts, international games, and SaaS products, as well as ecosystem enhancements such as nurturing a vibrant e-commerce ecosystem for Weixin and upgrading our back-end infrastructure.\n\nFor strategic investments, we continue to invest in companies that are complementary to our core business growth, such as our recent investments in partnership with Ubisoft and FromSoftware, to name a couple. At the same time, we are also returning more capital to shareholders. For the past 10 years, we paid out cash dividends, which represented the payout ratio of approximately 10% of our non-IFRS earnings. Since the beginning of the year, we have bought back USD 3 billion worth of shares.\n\nIn March 2022, we paid a dividend in kind through distribution of JD.com shares, which amounted to USD 13 billion of value to shareholders. So, to date, we have returned a total of over USF 18 billion to our shareholders. Today, we are declaring a special interim dividend of Meituan shares worth approximately USD 20 billion, which will be distributed to shareholders in March 2023. Qualifying shareholders will receive one Meituan share for every Tencent shares they hold.\n\nThis distribution in kind is equivalent to about HKD 16.6 per Tencent share based on yesterday's closing price. So, with that, I'll pass it to James to talk about our business review.\n\nJames Mitchell -- Chief Strategy Officer\n\nThank you, Martin. For the third quarter of 2022, our total revenue was down 2% year on year. VAS represents 52% of our total revenue within which the social network subsegment was 21%; domestic games, 22%; and international games, 9%. Online advertising was 15%.\n\nAnd fintech and business services was 32% of total revenue. The value-added services segment revenue was 72.7 billion renminbi, down 3% year on year. Social network revenue was down 2% year on year to 29.8 billion renminbi. Revenue from music and game-related livestreaming services decreased, while revenue from video accounts livestreaming service increased, reflecting more users, additional content, and enhanced recommendation efficiency to better match users to content.\n\nTencent video subscription revenue decreased slightly year on year as content scheduling today has resulted in subscriptions dipping. However, we increased our previously adjusted membership pricing. Our self-commissioned drama series, Love Like the Galaxy, which we released in July, ranks No. 1 by video views across all online platforms in China for the quarter. Our music subscription revenue increased year on year driven by more paying users.\n\nOur domestic game revenue was down 7% year on year to 31.2 billion renminbi as transitional challenges resulted in lower-paying user accounts. Honor of Kings and Peacekeeper Elite contributed decreased revenue due to the minor protection measures which took effect from September 2021 onwards. New games, Wild Rift, Returned to Empire, and League of Legends Esports Manager, contributed incremental revenues. Our international games revenue increased 3% year on year, or 1% in constant currency terms, to 11.7 billion renminbi.\n\nA robust performance from Valorant, the successful launch of Tower of Fantasy, and Miniclip's acquisition of Subway Surfers, and release of new games drove the growth. Turning to social networks, we leverage the extensive reach of Weixian and the ease of use of mini programs to better assist the real economy. Mini programs surpass 600 million daily active users, representing a year-on-year increase of more than 30%. Daily mini program activations were even faster by over 50% year on year.\n\nAdditional commerce and municipal service use cases contributed to growing the number of users and the daily activations per user. We deepen the adoption of many programs among food and beverage, apparel and footwear brands, and shopping malls and department stores. These offline merchants and brands are increasingly integrating membership programs and loyalty points into their mini programs as they build out multichannel retail. The Health Code mini programs help users verify their health and travel status with over 320 billion visits year to date, facilitating continuity of business activity.\n\nOn QQ, we provided more scenarios in Super QQ Show for social interaction. We collaborated with brands such as Gucci and KFC to launch virtual spaces where users could conduct immersive interactions. For example, users can participate in online to offline campaigns, collect branded virtual items, and socialize with other fans. Moving to domestic aims.\n\nWith the implementation of our industry-leading minor protection program, we have become fully compliant with China government regulation, fostering a healthier industry environment. Time spent from users aged under 18 years old has decreased by 92% year on year and constituted 0.7% of total time spent in July 2022. On the other hand, our adult user base and user engagement increased year on year. For the month of September, our combined PC and mobile game adult DAU rose by a double-digit percentage year on year, and our total adult player time spent grew by a single-digit percentage year on year.\n\nTime spent growth was driven by existing titles such as Honor of Kings, Peacekeeper Elite, and CrossFire mobile and PC, as well as new titles such as Wild Rift and Arena Breakout. We're extending the longevity of our IP franchises. Taking one example, CrossFire, which is a game we first published on PC 14 years ago, as a result of innovation in areas such as player versus environment mode and ranked mode, CrossFire PC remains the leading game in the FPS genre on PC in China and grew its grossing receipts by a high single-digit percentage year on year in the first nine months of this year. In 2015, we published CrossFire mobile developed by TiMi Studio Group, significantly increasing the overall number of people playing CrossFire games in China.\n\nBenefiting from localized content insights, CrossFire mobile remains one of the top 10 mobile games by time spent and grossing receipts in China today. And we continue enriching the CrossFire franchise, professional esports events, and cross-media collaboration, such as a live-action drama series on Tencent video. International games are extending the success of our key internally developed franchises. Benefiting from Riot's esports experience, the Valorant Champions Tournament became the most popular esports event industrywide for tactical shooter games, expanding Valorant's fan base and driving record-high grossing receipts for the game itself in the third quarter.\n\nIn October, Supercell released the biggest-ever content update, Town Hall 15, for Clash of Clans, which boosted user engagement and in-game consumption. Clash of Clans represents a lasting franchise, generally ranking as the top strategy game by annual grossing receipts worldwide since its launch, including year to date this year. We've also achieved breakthroughs in publishing investee studio and licensed games with the release of two major new titles, leveraging our content, marketing, and use of community management capabilities. Tower of Fantasy, an open-world MMORPG developed by Perfect World, which we released in August, became the second most popular MMORPG by daily active users internationally in the quarter.\n\nIt achieved notable commercial success in the most competitive markets, ranking first by grossing receipts in Japan and second in the United States. Nikke, a sci-fi RPG shooter with anime graphics developed by our investee studio. Shift Up, was the highest grossing mobile game internationally in the first 10 days following its November launch. Nikke's success demonstrates how we can empower small investee studios to commercial success with our operational know-how and infrastructure scale.\n\nFor online advertising, revenue was 21.5 billion renminbi in the third quarter. The rate of year-on-year decline has narrowed from 18% in the second quarter to 5% in the third quarter, benefiting from initial monetization in video accounts in-feed ads, improvements in the game's e-commerce and FMCG categories, and lapping of certain industry-specific headwinds from 2021. Sequentially, our advertising revenue grew 15%, benefiting from positive seasonality, the initial monetization of the video accounts in-feed ads, and our ongoing efforts to improve ad targeting technology. In video accounts, we saw a particularly robust demand from the FMCG and high-end brands.\n\nAdvertising in video accounts is complementary and incremental to our existing advertising revenue. Excluding video accounts, ad revenue elsewhere in Weixin improved year on year, particularly from mini programs. Within the media subcategory, our long-form video ad revenue decreased year on year, primarily due to fewer releases of drama series and tough comparisons versus airing the Tokyo Olympic Games in the year-ago period. Looking at fintech and business services, segment revenue was 45 billion renminbi, up 4% year on year and 6% quarter on quarter.\n\nFor fintech services, year-on-year revenue growth was higher compared to the previous quarter, mainly benefiting from a recovery in commercial payment activities, both offline and online. Our commercial payment volume achieved double-digit year-on-year growth, with notable expansion in categories such as groceries, dining services, and transportation. In business services, our revenue declined slightly year on year. However, gross profit increased significantly both year on year and quarter on quarter.\n\nGross profit growth benefited from us exiting or scaling back certain loss-making activities such as deeply discounted contracts for content delivery network and also from us shifting the revenue mix toward internally developed products and away from projects for the high proportion of subcontracting activity. We're striving to help non-internet industries embrace digital transformation, which is boosting our revenue from offline sectors such as financial services, industrials, and automotive. Highlighting a few examples of our industry solutions, Tencent Cloud Enterprise enables those customers, such as banks and municipalities who prefer to store data on their private clouds, to integrate and deploy our public cloud products within their private clouds. Tencent Cloud AI, digital humans, provides AI chat bots to customers in sectors such as financial services and tourism, enabling automated customer support.\n\nTencent real-time communication is increasingly deployed in industrial use cases, such as enabling remote control for mining and container trucks so that our customers can scale their operating costs and provide their drivers with a safer working environment. And public sector organizations such as hospitals and schools are increasingly using our key software-as-a service tools, facilitating their efficient collaboration and online education provision. And now, I'll pass to John.\n\nJohn Lo -- Chief Financial Officer\n\nThank you, James. Hello, everybody. For the third quarter of 2022, total revenue was 140.1 billion renminbi, down 2% year on year or up 5% quarter on quarter. Gross profit was 62 billion renminbi, down 1% year on year or 7% quarter on quarter.\n\nNet other gains was 20.9 billion renminbi, down 9% year on year or up 373% quarter on quarter, which were mainly non-IFRS adjustment items such as net gains on deemed disposal and disposal of certain investments, including a 41.3 billion renminbi gain from deemed disposal of Sea, net fair value losses from revaluation of certain investments, and the impairment provisions against certain investment in online and [Inaudible] and fintech verticals. Operating profit was 51.6 billion renminbi, down 3% year on year, up 72% Q on Q. Net finance costs were 2 billion renminbi, largely flat year on year, or up 8% quarter on quarter. The Q on Q change was mainly due to increased interest expense, partly offset by increased foreign exchange gains.\n\nShare of losses of associates and JVs was 3.7 billion renminbi compared to 5.7 billion renminbi last year. On a non-IFRS basis, profits was 2.4 billion renminbi compared to share of losses of 0.3 billion renminbi last year, reflecting improved profitability in certain domestic associates due to the cost-control measures. Interest tax -- income tax expense increased by 30% year on year to 7.1 billion renminbi mainly due to the provision of food and tax during the quarter. The effective tax rate was 15.5%.\n\nIFRS net profit attributed to equity holders was 39.9 billion renminbi, up 1% year on year and 115% quarter on quarter. Diluted EPS was 4.104 renminbi, up 0.7 year on year -- 0.7% year on year or 114% quarter on quarter. On non-IFRS basis, operating profit was 40.9 billion renminbi, largely stable year on year or up 12% quarter on quarter. Net profit attributable to equity holders was 32.3 billion renminbi, up 2% year on year or 15% quarter on quarter.\n\nDiluted EPS was 3.306 renminbi, up 1% year on year or 14% Q on Q. Moving on to gross margins. The overall gross margin was 44%, stable year on year or up one percentage point quarter on quarter. Gross margin for VAS was 51.7%, down 1.3 percentage points year on year or up 1.1 percentage point quarter on quarter.\n\nThe y-o-y margin decrease is mainly due to a revenue mix shift on higher-margin game services to lower-margin video account livestreaming service. The q-on-q margin improvement reflect our cost optimization efforts within the segment. Gross margin for -- on advertising was 46.3%, broadly stable year on year or up 5.7 percentage points quarter on quarter. The q-on-q margin improvement benefited from the initial monetization of video account in-feed ads, as well as efficiency measures that we implemented within the segment.\n\nGross margin for fintech and business was 33.3%, up 4.8 percentage points year on year or stable quarter on quarter. The year-on-year margin improvement was proven by our proactive efforts to reduce loss-making cloud services activities, leading to a healthier revenue mix and reduced cost base. On operating expenses, selling and marketing expenses decreased to 7.1 billion renminbi or 5.1% of revenues due to cost-efficiency initiatives Martin mentioned earlier. R&D expenses were 15.1 billion renminbi, up 10% y-on-y, broadly stable q-on-q.\n\nThe year-on-year increase was driven by higher staff costs. R&D expenses were 10.8% of revenues. G&A expenses, excluding R&D, were 11.4 billion renminbi, up 12% year on year or 2% q-on-q. The year-on-year increase was due to higher operating lease and office expenses, as well as staff costs.\n\nAt quarter end, we had approximately 109,000 employees, up 1% year on year or down 2% quarter on quarter. Let's take a look at our operating and net margin ratios. Non-IFRS operating margin was 29.2%, up 0.5 percentage point year on year or 1.8 percentage points quarter on quarter. Non-IFRS net margin was 23.8%, up one percentage point year on year or 2.2 percentage points quarter on quarter.\n\nFinally, I would summarize some key cash flow and balance sheet metrics. Total capex was 2.4 billion renminbi, down 66% year on year or 21% quarter on quarter. Within total capex, operating capex was 1.1 billion renminbi, down 81% year on year or 49% quarter on quarter. As we proactively reassess and tighten our spending plan for the year, nonoperating capex decreased by 9% year on year to 1.3 billion renminbi.\n\nOperating cash flow for the quarter was 41 billion renminbi, stable year on year or up 15% quarter on quarter. Free cash flow for the quarter was 27.6 billion renminbi, up 15% year on year or 23% Q on Q, reflecting our disciplined capex spending. Net debt position was 27.3 billion renminbi, compared to 20.4 billion renminbi last quarter. The sequential change was due to the effect of foreign currency translation differences on U.S.\n\ndollar-denominated assets, partly offset by stronger free cash flow generation. Thank you.\n\nWendy Huang -- Macquarie Research\n\nThank you, John. Now, we open the floor for the questions. [Operator instructions] Our first question will come from William Packer from Exane BNP.\n\nWilliam Packer -- Investor Relations Officer\n\nHi, management. Many thanks for taking my question. Firstly, cost progress in recent quarters has been an important support for a return to profit growth, even though G&A costs continue to grow. Am I correct to think that this growth includes one-off restructuring costs associated with headcount reduction and other savings? Could you quantify those one off-costs to help us think about underlying cost growth? And then, secondly, my follow-up, in terms of domestic gaming, top-line momentum has weakened again.\n\nHow should we think about a return to top-line growth for that segment? Do you need new IP for -- from future game approvals? Or can the easing of the minor gaming revenue headwind comps and potentially improving macro be sufficient? Thank you.\n\nJohn Lo -- Chief Financial Officer\n\nYeah, you're right that we have included all the one-off restructuring costs in G&A, ex R&D, on the staff costs. Total IFRS G&A, ex R&D, ex severance payment, well, on year-on-year basis, we have increased by very low single digits. So, we can't quantify it just using this basis.\n\nJames Mitchell -- Chief Strategy Officer\n\nSo, Will, on the domestic game question, you know, you called out the right three factors which, you know, have been entering the industry growth and our growth, namely minor protection measures, the lack of new game licenses, which is very important in a supply driven industry, and also the challenging macroeconomic environment. Now, in terms of what it would take for us to successfully reboot domestic game revenue growth, then, you know, the industry and we are lapping the minor protection measures as of September. From a grossing receipts perspective, of course, that's a few months in which the grossing receipts from the prior quarters get amortized into our P&L. But -- but that effectively is behind us on a cash flow basis.\n\nWe believe that in order for the revenue growth to sort of notably and sustainably reaccelerate, we would likely benefit from one of the other two changes coming through. And in terms of the other two factors, then we expect more new game licenses, more commercial games to come through relatively quickly. On the other hand, we don't have any great insight into when the macroeconomic improvement will turn up. Of course, if both of those factors turn positive, then we would see a faster rate of game revenue growth.\n\nBut one of those factors turning positive alongside the lapping in minor protection measures, we think, would be sufficient to answer your question positively.\n\nWendy Huang -- Macquarie Research\n\nThank you, Will. Next question comes from Eddie Leung from the Bank of America. Eddie, your line is open. \n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\nGood evening. Two questions on your pieces. Maybe the first to follow up on the question about games. So with a few licenses [Inaudible] are we going to change our development strategy for the upgrade of the existing games in order to maximize [Inaudible] like the lifetime style, the lifetime value? So that's the first question.\n\nAnd then, secondly, regarding to the video account advertising, could you clarify some feedback that you have heard from advertisers, maybe your return on investment, etc., and any area for further improvement? Thank you.\n\nJames Mitchell -- Chief Strategy Officer\n\nYeah. Thank you, Eddie. So, in terms of the fewer domestic game licenses and change to our game development strategy, then, you know, we have indeed changed our game development strategy, although the full effects of the change will take a few quarters to show through. So, first of all, we're focusing our resources on, you know, fewer, bigger, higher-impact, higher production value, new games.\n\nAnd many of those new games also have global aspirations as opposed to purely single-country aspirations. Secondly, we are indeed spending more time and resources upgrading and energizing our existing games. And we talked at length about the example of CrossFire in the opening remarks. And then, thirdly, we actually do believe that there will be further issuance of new game licenses in the nearer future.\n\nAnd so, to some extent, this headwind to the game industry will mitigate as more new games are released. Secondly, on your question around advertiser response to the in-feed ads on the video accounts, you know, I would say that the first noteworthy point is that video accounts actually deliver quite a differentiated audience who, by and large, are not consuming either short-form video services. And so, in comparison to the rest of the industry, where there is a very high overlap between use of service A and service B and service C and service D, in video accounts is a differentiated audience and, you know, advertisers like that because they can reach people whom they otherwise weren't able to reach on incumbent platforms. And that, in turn, has meant that the video accounts, particularly popular with advertisers who value that additional reach, such as fast-moving consumer goods companies and such as high-end brands, which in turn has meant that the eCPM that we're achieving on the video accounts is very robust.\n\nIt's at a premium to any of the incumbents, and it's also a premium to Weixian moments. Now, in terms of areas for improvement, from an advertiser feedback, the key area for improvement in their eyes is simply that we -- that they would like to purchase more inventory. And therefore, they would like us to release more inventory, which we are periodically doing. But right now, we're in an excess demand situation.\n\nThank you.\n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nWendy Huang -- Macquarie Research\n\nThank you, Eddie. Our next question comes from Alicia Yap from Citigroup. [Inaudible]\n\nAlicia Yap -- Citi -- Analyst\n\nHi. Good evening, management. Can you hear me?\n\nWendy Huang -- Macquarie Research\n\nYes, we can.\n\nAlicia Yap -- Citi -- Analyst\n\nOK. Yeah. Thank you for taking my questions. Congrats on the solid profit beats and also the Meituan dividend.\n\nI have two questions. First one on the online advertising. We observed that the ad budget as related to the event sponsorship and also the brand awareness campaign seems to be experience a little bit more stable. But your allocation lately as compared to the [Inaudible] dollars in the past few years.\n\nSo, given Tencent's diversified media properties across, you know, for example, Tencent music, video accounts, the moments, will these actually position Tencent to have a stronger value proposition to gain more advertising share when the economy gradually rebound? My follow-up question is on the gaming. So, we also noticed -- I'm not sure if we are correct -- it seems like the PC game, this shows a little bit more resilient in retaining the existing gamers and also attracting some of the return gamers. So, will we actually also reallocate more development resource to introduce more content update on some of the older PC games to revive the gamers' interest? Thank you.\n\nJames Mitchell -- Chief Strategy Officer\n\nThank you, Alicia. So, on the advertising question, then, you know, in general, the China online advertising market is primarily -- predominantly performance ads and then, a minority of branded ads. And then, within the performance ads, there's contractual performance advertising where, you know, the advertiser desires performance measured by sort of traditional awareness and reach metrics, as well as transactional metrics. And then, there's more purely transactional performance advertising where the advertiser is very purely focused on transactional metrics.\n\nAnd that would be true for, you know, perhaps mobile game companies, e-commerce companies, and so forth. And I think, you know, that Tencent plays across all of those. Obviously, our historic strength is more within the branded advertising. But in recent years, as we have nurtured a very substantial gross merchandise volume flow through our many programs, then we have created more sort of native, endemic demand for performance advertising, both contractual performance and transactional performance.\n\nAnd then, more recently, with the release of advertising inventory in video accounts and in the future advertising inventory within our search engine, then we think we have the right inventory that is especially suitable for the transactional performance advertisers. So, historically, we were sort of most suited to the branded advertisers and the contractual performance advertisers. But increasingly, we have both the use case and the ad inventory that is suitable for transactional performance advertisers. And then, on your game question around PC games then, yes, we are, as I mentioned in response to Eddie's question, you know, investing more in our big, existing games.\n\nIt's also the case that we have a number of, you know, PC games in development globally. And, you know, some of them are pretty substantial. So, you know, Riot's Valorant is a PC-first game and, you know, that's become one of the most successful PC games across the industry, both in terms of critical reception but also in terms of becoming a, you know, $1 billion annual revenue franchise. And then, you know, many of the game studios we have acquired in the past five years outside China, PC game first.\n\nIf you look at Steam today, I think that the No. 2 title behind Call of Duty is Warhammer 40,000: Dark Tide, which is created by a studio called Fatshark in Europe and in Sweden. That is one of our subsidiaries. And that game actually hasn't launched yet.\n\nBut it's, you know, the No. 2 or No. 3 game in Steam rankings. So, anyway, we -- China's studios have become somewhat mobile first.\n\nAnd, you know, for them, when they release PC games, it's often a situation where the game is released across both mobile and PC and interoperable. But the game is sort of crafted with mobile front of mind versus many of our overseas studios, like Riot and Fatshark, you know, PC first and then move the PC game to other platforms later. Thank you.\n\nWendy Huang -- Macquarie Research\n\nThank you, Alicia. Our next question comes from Gary Yu from Morgan Stanley. Gary, your line's open.\n\nGary Yu -- Morgan Stanley -- Analyst\n\nHi. Thank you for the opportunity and congratulation on the strong results. I have two questions. First one is a follow-up on video accounts.\n\nI think you mentioned video accounts seems to be complementary to our Weixin ad platform and also kind of differentiated by modest short video peers. So, when this platform becomes a bigger kind of ad revenue pour, how should we think about where the ad budgets are going to come -- you know, coming from? Is it more from other short-video peers, you know, other formats ads? And then, you know, by that time, should we expect inevitably some -- some kind of cannibalization on our existing kind of ads revenue from other platform? And then a follow-up question is related to our investment portfolio. Given our criteria is to consider divestment when subsidiary -- when the associates become more kind of financially capable in strength with, you know, industry leadership, when I look at the rest of the portfolio, it seems like there are some other sizable associates which have reached that kind of status or definition. So, how should we think about, you know, those associates that we are, you know -- which are, you know, approaching data Meituan, kind of mature stage? Thank you.\n\nMartin Lau -- President\n\nSo, in terms of video accounts, right now, I think, clearly, as we have seen from the evidence, that the monetization is actually incremental for us. There are a number of aspects of it. Number one is that the time that people spend on video accounts is actually purely incremental and it's actually a very sizable amount. That's one.\n\nAnd two is, in terms of the revenue, we saw the budget as being incremental because, you know, when we start scaling the video accounts revenue, it actually reached a significant scale. And in fact, we talked about it's on track to reach RMB 1 billion per quarter. And so, that ramp-up is actually achieved without impacting any other of our advertising revenue or advertising budget as put in by the advertisers. And we also view video accounts as very complementary to our ecosystem as it actually works very well with our mini programs, as well as other parts of our ecosystem, including official accounts, including WeCom.\n\nThe ecosystem as a whole actually help the merchants to build a private domain for them. And in the past, the merchants can only bring traffic to the mini programs through offline touchpoints and some advertising on our Weixin ecosystem. But now, the video accounts actually allowed a considerable amount of inventories to be added. And the traffic can be through video accounts that can be through video accounts like streaming.\n\nAnd that actually allows the merchants to really bring much more traffic into their mini programs. And that, as a whole, really complements the overall ecosystem of Weixin. And in terms of where the revenue would be coming in, you know, I think part of it is actually from existing revenue that's spent on other short video platforms. Some of the revenue will be actually coming from e-commerce, right, because as the merchants want to build their private domain, they may actually look at the spending that they put in -- on other channels and try to build something which is of highest value to them, which we believe private domain is.\n\nAnd -- and it also involves some of our existing advertisers who are spending more money on our platform.\n\nJames Mitchell -- Chief Strategy Officer\n\nAnd, Gary, in terms of your question around this strategic thinking around distribution and, you know, comparing the Meituan distribution with the prior JD distribution, then, if you look at the Meituan announcement on Page 7, there's a section called Reasons for and Benefits of distribution in kind. It's actually distribution in specie. I'm not sure how to pronounce specie, so I will say distribution in kind. And there, we give, you know, three criteria, which are among the criteria we consider when we're deciding whether it's appropriate to distribute an investment.\n\nAnd one of those criteria is the financial strength of the investee. A second one is the industry positioning of the investee. And the third one is our investment return. And so, if you look at, you know, Meituan, for example, through -- through that lens, then, you know, in terms of industry positioning, it's obviously, you know, extremely strong being, you know, the clear leader and food delivery and in-store and so forth.\n\nIf you look at the investment returns, then we've had very good returns on the investment of around 30% IRR. And if you look in terms of financial profile, then, you know, it is profitable. It's not as profitable on a headline basis as JD was when we distribute it. But that's because Meituan, as you well know, is investing in a community group buying and other new services to expand its addressable market longer term.\n\nSo anyway, those are three of the criteria that help explain our thinking around distributions and, you know, specifically why we chose to distribute JD and why we now choose to distribute Meituan. Thank you.\n\nMartin Lau -- President\n\nAnd I would add to the fact that we -- we obviously want to distribute the shares from a point of strength, right, you know, as we look at what -- what James talked about in terms of a strength in financial profile and industry position. And at the same time, when we look at the shareholder base, we actually see, from an institutional investor's perspective, there's actually a very big overlap of the biggest shareholders between us and Meituan, which means that there will be a lot of institutional investors who want to get the Meituan shares. And at the same time, as -- as we look at an investment like Meituan, we actually made a very big financial gain from it already. And that's why we would like to allow our shareholders to start making their own decisions about what to do with the shares.\n\nBut I would say, as I, you know, talk about, you know, a lot of that, there's a lot of overlap in terms of the biggest institutional investors. And I also believe that some investors may actually want to sell the shares. But a lot of the investors would be probably like me, right, who will be holding on to the majority of Meituan shares for a very long period of time because I'm actually very excited about the prospect of the company.\n\nWendy Huang -- Macquarie Research\n\nThank you, Gary. Our next question comes from Robin Zhu of Bernstein.\n\nRobin Zhu -- AllianceBernstein -- Analyst\n\nThank you. Thanks, management, for taking my question. I guess a couple of things. Just, one, if we take a step back on -- on, you know, returning cash to shareholders, beyond this kind of periodic big distributions, how should we think about the sort of run rates of cash returns? You raised the run rates of buybacks a couple of weeks before the blackout for these results.\n\nIs that -- should we think of that as kind of the new sustainable level? And would management ever consider announcing a formal cash payout policy, you know, incentive free cash flow or -- or anything like that? So, that's -- that's one. And then, two, obviously, there's been a lot of progress made on cutting costs and scaling back different bits of the business. Be curious to hear how you think about when to go on the front foot again to start spending more money on driving more growth and how we switch from where we are now to -- to that. Thank you.\n\nMartin Lau -- President\n\nIn terms of capital allocation, I would say we're not a utility, right? We are a growth-driven company. So, I would say we're not going to have a return or dividend yield-driven thinking in our capital allocation. So, if you look at the three sources of capital return that we talked about, one is dividend, the other one is share buyback. And -- and then, we talked about the distribution in kind.\n\nEach one of them is actually of a different nature. I think, you know, in terms of the dividend, it is a program, and we have been distributing about 10% of our non-IFRS earning. And over time, we may actually increase that, depends on what -- you know, how we look at the reinvestment opportunities. But then, share buyback is actually a way for us to return the excess cash flow, and that would be calibrated against investment opportunities, investing in other people, other companies' shares.\n\nAnd it is true that given the industry now, environment right now, we are being more selective in terms of buying investments. So, that's why we actually have more cash to conduct share buyback and especially when our shares is actually very attractively valued given our -- our strong operations, cash flow generation as well, as we actually have a basket of investment portfolio which is also assured by actually getting us more exposure to that. So, that's why, this year, we have actually stepped up our share buyback in a pretty significant way, but we actually manage it in a dynamic way. In terms of the distribution in kind, that's actually more a case-by-case basis and that the reasons and considerations, I think, James had already talked very clearly about.\n\nSo, those are all of different natures. Overall, we do not want to have a target yield. But at the same time, I think we're very thoughtful and we are very proactive in terms of returning capital to the shareholders as we see fit in order to maximize the shareholder return. Now, in terms of the investments, I would say -- I would refer you to Page 4 of our strategy section.\n\nI think, you know, we actually talked about the fact that we have a very strong cash flow generation capability, as well as a very large holding of liquid assets in order for them to be more than enough to fund our organic growth, strategic growth, as well as our capital return to the shareholders. So, we have more resources than we need to do all these things at the same time, and they don't actually conflict with each other. Thank you.\n\nWendy Huang -- Macquarie Research\n\nThank you. Our next question comes from Natalie Wu of Haitong International.\n\nNatalie Wu -- Haitong International Securities -- Analyst\n\nHi, good evening. Thanks for taking my question. I have two as well. The first one is regarding the regulation.\n\nI think that there are some easing signs on the regulatory environment in China these days. So, just wondering, any updates on recent regulation developments that can be assessed from company side and how should that affect your fundamentals next year? And second question regarding the -- your enterprise services. Just wondering how should we think of the monetization potential for your enterprise app family, including Tencent Meeting enterprise, WeChat, etc. Will it be material contribution in one to three years? Thank you.\n\nMartin Lau -- President\n\nSo, on the regulation side, in the last earnings call, we actually updated you that the recent regulatory direction is actually trending toward supporting healthy development of the industry to complete the ratification and also to carry out normalized deregulation. So, based on the recent government communications, I think it basically confirms this direction continues. More noticeably, we noticed, for example, in the party congress report, it mentioned that China will accelerate the development of the digital economy and further integrate it with the real economy as a measure to drive high-quality growth. Also, after that, in a late October NDRC report, recognizes the achievement of the digital economy in the past decade.\n\nAnd the report also advocates a digital economy of greatest strength, of quality and scale, by developing digital technology and integrating that into real economy. So, all in all, the direction, I think, we feel is still very consistent with what we said last time. And I think what's changed is that, in particular, there are some steps and some regulatory approvals that signals a more normalized regulatory environment that confirms this regulatory direction. So, this include in the fintech area, we have received approval for our investment in Samsung Property and Casualty Insurance Company in China.\n\nIn the online gaming area, we have received approval for a new Banhao and also a Banhao amendment in September. And we do expect to receive more Banhaos in the coming future. And in the area of investments and also antitrust, we received SAMR approval for a JV with China Unicom. So, all these specific actions and approvals actually signifies that, I think, the overall regulatory environment is actually trending toward a more supportive environment.\n\nJames Mitchell -- Chief Strategy Officer\n\nAnd, Natalie, on your question about whether our enterprise services would bring material revenue contribution in one to three years, then, you know, the future is uncertain, but I think it's unlikely we would see a material revenue contribution to our total revenue within one year. Over the longer term, then, we believe these services, you know, will lend themselves to good monetization. And if you look at the experience of Zoom and Slack and Teams and so forth, I think that speaks to that longer-term opportunity. You know, how quickly we get from that near-term situation where we're focused primarily on distribution to the longer-term opportunity around monetization is partly a function of the competitive landscape.\n\nAnd so, that's the situation that we're in today. As Martin mentioned, we do have a paid subscription product bundling, Tencent Meeting, WeCom, Tencent Docs together, and that's seeing some good early adoption by larger enterprises. But we view this as, you know, something with a longer gestation cycle versus our video accounts and international game initiatives that are turning into material revenue more immediately. Thank you.\n\nWendy Huang -- Macquarie Research\n\nThank you. Our next question comes from John Choi of Daiwa.\n\nJohn Choi -- Daiwa Capital Markets -- Analyst\n\nOK. Thank you very much for taking my question. I have -- on the question about -- I think, last quarter, you guys said that your business is a lot more cyclical than before given that the nature of our core businesses are now more on the -- highly correlated with the economy. So, as we are seeing some improvements, you know, signals in the macro and also the COVID situation, along with, you know, external factors improving, are we seeing better visibility in some areas like advertising, you know, and fintech and business services as we go into later this year, early this year or early next year? Does that mean we should see, you know, a better tailwind as we, you know, see for these cyclical businesses? And quick follow-up about your business services.\n\nYou know, I appreciate that you guys are doing a lot more on the -- you see, this quarter, we've seen gross profit increase both sequentially and also on an annual basis. But how should we think about the margins more in the mid to long term, you know, if you compare to ourself versus our global peers? Thank you.\n\nMartin Lau -- President\n\nI think, in terms of the macro, third quarter was actually quite good because there is a recovery from the second quarter in which there were a lot of lockdowns. But then, I think the beginning of the fourth quarter was a little bit clouded again due to more sporadic lockdowns around the country. So, I think the short term would probably be still quite volatile. But I think, overall, you know, we do believe, in the, you know, medium term, the economy would definitely start to improve.\n\nAnd as a result, we're confident about the medium term. But for now, I think, you know, it's going to be a little bit volatile in this period of time.\n\nJames Mitchell -- Chief Strategy Officer\n\nI think, on the business services question, that the situation in China from a margin perspective is so dissimilar to the situation in the rest of the world that it's hard to draw analogies. You know, generally speaking, the rest of the world, the companies that provide infrastructure as a service, such as Amazon and Google, are not -- don't have very substantial software-as-a-service businesses. And then, there's companies like Oracle that, you know, provide software as a service with -- with less infrastructure. And, you know, of course, Microsoft does bridge the gap.\n\nBut, you know, for comparison, in China, there's several big companies that do infrastructure platform and software as a service together, including ourselves. So, that's one difference. And other difference is the competitive behavior is dissimilar. You know, think, in the Western world, when web services were growing very quickly, margins were expanding.\n\nAnd now, as the web services revenue growth slows, there's some pressure on margins as the companies fight more intensely for market share. In China, it's the other way around. When the industry was growing very quickly, then margins were very weak and, in some cases, declining because everyone was jumping into -- to try and grab that slice of the pie and maximize that slice of the pie versus now, with a more difficult environment that the industry has been in for the last year, you actually see in some cases, including our own, that a weaker revenue is accompanied by stronger margins as we've refocused on the most sustainable and highest-quality businesses within -- within the business services mix. Thank you.\n\nWendy Huang -- Macquarie Research\n\nThank you. Our next question comes from the line of Ronald Keung from Goldman Sachs.\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nThank you. Thank you, Pony, Martin, James, and John. First, want to ask about fintech because we read about this. You noted that double-digit growth in commercial payments.\n\nSo, as our business continues to have profits driven from kind of games as to fintech, now, how is that progress in the financial holdco restructuring? And is that on track? And what our latest strategies in kind of across these commercial payment, wealth management, and lending businesses in this macro environment, and particularly given the change in COVID measures this year and next year. Thank you.\n\nMartin Lau -- President\n\nSo, in terms of the financial holding company, we do believe that we would want to embrace having a financial holding company license. And we are in the process of understanding the requirements, interacting very closely with the regulators, and also make the requisite preparation for it, because we do see that the regulatory oversight and potential opportunities of having a financial holding company license is beneficial, and the internal organization changes that need to happen were not really causing material impact to the business. So, we -- we are working proactively on that. But at this point in time, we don't really have an update for you yet.\n\nWhen we have an update, we'll let you know. In terms of the payment business, as well as the financial services business, I would say it's actually very important for us to focus on a few things, right? You know, No. 1 is really compliance. And we have spent a lot of time in making sure that all the services are actually complying with the new regulatory requirement and review.\n\nAnd, you know, all on the way, we have actually spent a lot of time in working on compliance. But the requirements have been going up as required by regulators, and we have been spending a lot of resources and effort to -- to upgrade our compliance, and especially, this is a big challenge given the scale of the service that we have. But I think we have really been able to achieve that. And second is really about risk management because, given a challenging regulatory macro environment, it's actually very important for us to manage risks in a very proactive way.\n\nAnd thirdly is actually leveraging our payments services, which connects with a lot of offline merchants, and especially small and medium merchants, so that we can actually help them to cope with the challenges on the macro side and then help them to generate more business. And we also have a rebate program so that would actually help them with these difficult periods. We actually felt that once we go through with the -- this period of sporadic lockdowns, and, from time to time, there's actually challenges on the offline side, we should actually return to a pretty good backdrop of organic growth. And the payment would actually help to generate business for our lending business, as well as for our wealth management business.\n\nSo, I think, over the longer -- mid to long term, it's actually with good potential. But right now, I think it's actually very important for us to work through this -- this relatively challenging period.\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nGot it. Thank you, Martin. And maybe a follow-up question on our returning capital to shareholders. So, after JD and Meituan, I think most of our positions investments are now either not Hong Kong-listed stocks or maybe relatively smaller in size.\n\nSo, I think -- how should we think about the future strategies for the investment portfolio? Particularly, how do we balance the recycle of capital for ourselves in reinvesting into areas of growth? You mentioned about software companies or international games versus kind of distributing to shareholders. How do we balance these -- these two?\n\nJames Mitchell -- Chief Strategy Officer\n\nI think it's Martin spoke to in his introductory comments, you know, we don't -- we don't necessarily need to do it because we do generate $15 billion of free cash flow a year. And so, if the $15 billion of free cash flow has been fully sufficient, you know, not only to fund our investments in our own infrastructure and, you know, our own new products, as well as investments in other companies that are complementary to us, such as Ubisoft and FromSoftware, but also to fund a very heavy volume of buybacks on top. And then, you know, the distributions in kind, you know, a separate incremental return of capital to shareholders that will be more periodic in nature rather than continual. Thank you.\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nThank you, James.\n\nWendy Huang -- Macquarie Research\n\nThank you. Our next question comes from Charlene Liu of HSBC.\n\nCharlene Liu -- HSBC -- Analyst\n\nSo, I have two question. The first one is regarding our cloud business. Tencent Cloud business recently set up a JV with China Unicom. Can management discuss the rationale for this collaboration, how it can benefit the company's cloud business? And also, should we expect increasing collaboration with SOEs sort of going forward? That's the first question.\n\nFor the second question, I would like to sort of point out that, you know, in the past couple of months, Tencent has stepped up share buyback to offset the slowdown to pressure from Prosus. And we also, you know, observe that the share prices responded quite favorably to reports that Tencent is potentially taking over the Prosus even though it was subsequently being denied. Can we seek your thoughts on what you would consider a favorable outcome for Tencent in this sort of slowdown Prosus? Could you shed light on sort of do you have a preferred type of strategic, you know, shareholder, etc.? Thank you very much.\n\nMartin Lau -- President\n\nWell, so, for the JV with China Unicom, it's actually focused on distributing CDN and multi-edge computing products that's co-developed by Tencent and Unicom. So, it's a joint force in order to leverage our development capability resources, as well as customer base, in order to promote these products. And we believe the business would have good prospects going forward. But right now, that -- the business plan is still being drawn up, and the short-term financial benefits will be limited.\n\nIn terms of the significance, I would say that the approval from SAMR is actually more of a significant event for us on this particular JV. And in terms of finding collaboration partners, you know, we actually work on it on a case-by-case basis, looking at the business case, as well as what are the resources that each party can actually bring to the table. And I think there is no specific trend toward whether it's a private company or SOEs or any sector that we -- we look at these opportunities on a case-on-case basis.\n\nJames Mitchell -- Chief Strategy Officer\n\nOn your question around, you know, whether we have stepped up share buybacks to offset the slowdown from Prosus and, you know, what a favorable outcome to all of this would be, then, it is factually correct that during the last trading window, our buyback volume was similar to slightly greater than the Prosus slowdown volume during the same trading days. But I want to emphasize that, you know, we have been a listed company for a long time, and we've very frequently bought back shares when the share prices declined sharply in our history as a listed company, irrespective of whether, you know, Naspers or anyone else was, you know, selling shares or not selling shares at the time. So, the buyback decision is, you know, primarily around, you know, where we see value and much more so than around flow issues. To put it another way, in the very short term, if a shareholder sells X amount of shares and we buy back Y amount of shares, then, you know, of course, that's superficially net neutral from a flow perspective.\n\nBut from a value perspective, which is what we care about, it's value accretive because the shareholder who's selling shares is not actually increasing the share count. Versus when we buy back shares, we do cancel the shares, we buy back, therefore, decrease the share counts. And so, that's, you know, value accretion for our remaining shareholders over time. You know, I think that in terms of favorable outcomes, there's a decision for Prosus.\n\nBut, you know, Prosus has stated that it views this as a -- an exercise that's necessitated by the abnormally large discount to NAV which Prosus was trading when it announced this exercise. And, you know, that discount to NAV narrowed somewhat, and Prosus has said that should the discount to NAV narrowed at certain levels, then, there could be changes to this policy. So anyway, it's something that, you know, we're obviously very aware of, but it's not a primary consideration for us in when we're looking at our capital return policy, including our buyback activity. Thank you.\n\nCharlene Liu -- HSBC -- Analyst\n\nUnderstood. Thank you.\n\nWendy Huang -- Macquarie Research\n\nThank you, Charlene. We should take the last question from Alex Yao of J.P. Morgan.\n\nAlex Yao -- JPMorgan Chase and Company -- Analyst\n\nGood evening and thank you, management, for taking my question. Two questions from my side. First one is on the domestic gaming monetization this quarter. The domestic gaming revenue declined by 2% on a quarter-on-quarter basis against a positive seasonality and a new -- new game launch.\n\nWhat caused this such a normal seasonality in this quarter? And then, secondwise, on the interplay between monetization of video accounts and the content ecosystem of the video accounts, has -- you guys observed the monetization of video accounts helped the content ecosystem [Inaudible] video accounts at all. I understand this is still an early stage of the monetization, but intuitively, I think improving monetization capability of the ecosystem should introduce more financial incentive to the content creators. So, therefore, it should be positive to the content ecosystem. Thank you.\n\nJames Mitchell -- Chief Strategy Officer\n\nAlex, so, on your first question, I may not have understood it exactly, but the short answer is there's a different seasonality for our game cash flows versus game reported revenue. However, in previous years, when the overall industry and we within it were growing quickly, and that seasonality was not apparent as it is this year when the industry has been in stagnation. So, to get more granular and specific, you know, the gaming industry in China typically sees a peak in terms of cash flow generation grossing receipts during the Chinese New Year period. And we then amortize those cash flow receipts into our P&L over a period of several months.\n\nAnd so, the cash flow, the receipts strength in the Chinese year translates into reported revenue strength in Q1 to an extent, but more in Q2, and then also in Q3 before decaying toward the end of the year. And again, in previous years, that seasonality hasn't been as obvious as it is this year. So -- so, you know, that's basically the short answer to your question that when you look at the sequential trend for game revenue from Q2 to Q3, it is somewhat influenced by the fact that in Q2 we capture more of the Chinese New Year peak spend in our reported revenue. And then, as we go through the back half of the year, that -- that fades away due to the approval cycle.\n\nMartin Lau -- President\n\nSo in terms of the content ecosystem and monetization, I would say, at this stage, the monetization does not really have a lot of impact on the content ecosystem. But having said that, the content ecosystem has been -- become richer and richer and has been consistently built up for video content, primarily because of the fact that the traffic has been increasing and our targeting technology has been improving so that we can actually allocate the traffic more specifically to the different content providers. And the content providers, once they start to accumulate users and once they start tapping traffic, you know, they can actually monetize one way or the other on their own. And our in-feeds ads is actually independent from that.\n\nBut over the long term, I think there's going to be more interaction between the two because once we start having livestreaming e-commerce, then basically, a lot of the content providers would actually also have livestreaming. And when they start doing e-commerce and when there are a lot of merchants looking for content developers who also want to do livestreaming, they want to look for streamers, then they would start advertising within our video accounts and that will bring traffic to the livestreamers. And as a result of that, they can actually generate more revenue. So, I think, you know, over the longer term, monetization and the content ecosystem would actually have a stronger interaction and more conducive relationship.\n\nWendy Huang -- Macquarie Research\n\nThank you, everyone. We are now ending the webinar. Thank you all for joining our results webinar today. If you wish to check out our press release and other financial information, please visit the IR section of our company website at www.tencent.com.\n\nThe replay of this webinar will also be available soon. Thank you and see you next quarter.\n\nDuration: 0 minutes\n\nPony Ma -- Chairman and Chief Executive Officer\n\nMartin Lau -- President\n\nJames Mitchell -- Chief Strategy Officer\n\nJohn Lo -- Chief Financial Officer\n\nWendy Huang -- Macquarie Research\n\nWilliam Packer -- Investor Relations Officer\n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\nAlicia Yap -- Citi -- Analyst\n\nGary Yu -- Morgan Stanley -- Analyst\n\nRobin Zhu -- AllianceBernstein -- Analyst\n\nNatalie Wu -- Haitong International Securities -- Analyst\n\nJohn Choi -- Daiwa Capital Markets -- Analyst\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nCharlene Liu -- HSBC -- Analyst\n\nAlex Yao -- JPMorgan Chase and Company -- Analyst\n\nAll earnings call transcripts"
}