{
  "companyName": "Ocugen, Inc.",
  "companyTicker": "OCGN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/ocugen-inc-ocgn-q3-2022-earnings-call-transcript/",
  "content": "Ocugen, Inc. (OCGN 3.17%)\nQ3 2022 Earnings Call\nNov 08, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Ocugen third quarter 2022 business update and financial results call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the presentation. [Operator instructions] Please note that this call is being recorded.\n\nI will now turn the call over to Tiffany Hamilton, Ocugen's head of corporate communications.\n\nTiffany Hamilton -- Head of Corporate Communications\n\nThank you, Angela. Joining me today are Ocugen's chairman, CEO, and co-founder, Dr. Shankar Musunuri, who will provide a business update; and our chief accounting officer and senior vice president of finance, Jessica Crespo, who will provide more update on our financial results. Earlier this morning, we issued a press release detailing business activity for Q3 2022.\n\nWe encourage listeners to review this press release, which is available on our website at ocugen.com. This call is being recorded, and a replay, along with the accompanying slide presentation, will be available on the Investors section of the Ocugen website for approximately 45 days. This presentation contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, which are based on the beliefs and assumptions of the Ocugen Inc. and on information currently available to management.\n\nAll statements contained in this presentation other than statements of historical facts are forward-looking statements. We may, in some cases, use terms such as predict, believe, potential, proposed, continue, estimate, anticipate, expect, plans, intend, may, could, might, will, should, or other words that convey uncertainty of future events or outcomes to identify these forward-looking statements. Such statements are subject to numerous important factors, risks, and uncertainties and may cause actual events or results to differ materially from our current expectations. These and other risks and uncertainties are most fully described in our periodic filings with the Securities and Exchange Commission, SEC, including the risk factors described in the section entitled Risk Factors and the quarterly and annual reports that we file with the SEC.\n\nForward-looking statements that we make in this presentation speak only as of this date of this presentation. Except as required by law, we assume no obligation to update forward-looking statements contained in this presentation, whether as a result of new information, future events, or otherwise after the date of this presentation. Finally, Ocugen's third quarter 10-Q will be filed soon after today's call. I will now turn the call to Dr.\n\nMusunuri.\n\nShankar Musunuri -- Chairman and Chief Executive Officer\n\nThank you, Tiffany. Good morning, and thank you for joining our call. I'm very proud of the important accomplishments we achieved in the third quarter. With courageous innovation as a driving force behind everything we do, we're diligently progressing with our cell and gene therapies and pursuing broader development and expansion of our vaccine program, which now includes a unique mucosal vaccine for OCU500 for COVID-19.\n\nWe're also very enthusiastic about the potential of our modified gene therapy platform that we shared in more detail at the American Academy of Ophthalmology Conference in Chicago and our, of course, R&D Day last week. The Ocugen team continues to charge ahead to establish ourselves as a fully integrated patient-centric biotech company. As we meet our clinical and regulatory milestones, I'm especially confident that the team is well poised to drive signs in new directions and break new ground for patients who have no effective therapeutic options and people who want choice in the fight against COVID-19. Today, we are going to provide updates on our vaccines, gene, and cell therapy programs.\n\nI would like to start with Ocugen's vaccines program. COVID-19 remains persistent, and the world critically needs more effective and safe vaccine option. We are realizing some of the limitations of vaccines currently available in the United States in terms of their durability and capability to reduce transmission. Up until now, much of the attention has been on reducing hospitalization rate, but we need to think much more broadly and consider what threats new variants will pose and what is required to face the unique challenges that this next phase of COVID-19 will bring.\n\nAs I alluded to earlier, in September, we announced our licensing agreement with Washington University to develop, manufacture, and commercialize its proprietary mucosal vaccine in the United States, Japan, and Europe. OCU500 has the potential to generate rapid local immunity in the nose, mouth, upper airways, and lungs, where SARS-CoV-2 enters and infect the body. We believe that the mucosal vaccine can help reduce the transmission rate by generating neutralizing IgG, mucosal IgA, and T cell responses. This approach represents a potential universal booster, regardless of previous COVID-19 vaccination.\n\nWe intend to work closely with the U.S. government agencies tasked with pandemic preparedness on the regulatory pathway and with initiation of clinical trials. Additionally, we are addressing the public's need for a more durable immune response to COVID-19 with continued development of our candidate vaccine, Covaxin. Enrollment was completed, and dosing continues in the phase 2/3 immuno-bridging and broadening clinical trial, with top-line data expected in early 2023.\n\nWe are encouraged that no safety concerns have been identified in the trial to date. As part of the technology transfer, we successfully completed a demonstration patch at Jubilant HollisterStier. We will have the ability to move forward once World Health Organization concerns with our partner have been resolved. Now, moving on to our gene therapy program.\n\nOcugen is deeply committed to our core technology focused on inherited retinal diseases, along with other blindness diseases affecting larger patient populations. We are making progress in our vital work in Retinitis Pigmentosa, a disease for which there is no cure, no medicines to block disease progression, and limited treatments to help manage the patient's tragic journey that ultimately leads to blindness. The independent Data and Safety Monitoring Board completed a review of safety data for subjects enrolled in Cohort 2 for the OCU400 phase 1/2 clinical trial for Retinitis Pigmentosa and recommended proceeding to enroll subjects in Cohort 3. We have dosed the first patient, and the company expects to complete Cohort 3 enrollment by the end of the year.\n\nBy the end of the phase 1/2 study, data will be collected and analyzed from dosed RP and LCA patients before initiating the phase 3 efficacy trial. Currently, RP is associated with mutations in more than 100 genes, affecting approximately 2 million people globally. The current study will start enrolling patients with Leber Congenital Amaurosis, or LCA, [Inaudible] mutations. LCA is a rare eye disease associated with mutations in more than 25 genes.\n\nOCU410, also leveraging our modifier gene therapy platform, is being developed to utilize the nuclear hormone receptor gene RORA for the treatment of dry age-related macular degeneration, or dry AMD, which affects approximately 9 million to 10 million Americans alone. And this quarter, we are announcing the addition of OCU410ST to potentially treat Stargardt disease, an orphan disease that will be investigated along with dry AMD. We have successfully completed CGMP manufacturing in support of clinical trials and are currently conducting IND-enabling study. Ocugen is planning to file IND applications to initiate phase 1/2 clinical trials for both these programs in Q2 2023.\n\nAnother product modality in the retinal disease space is based on a novel fusion protein. OCU200 is designed to treat sight-threatening diseases such as diabetic macular edema, diabetic retinopathy, and wet AMD. Ocugen is currently executing IND-enabling studies and is planning to submit an IND application in the first quarter of 2023 to initiate a phase 1 trial targeting DME. Regarding our regenerative cell therapies, in May, we expanded our pipeline in cell therapy in orthopedics with NeoCart.\n\nNeoCart shows potential to accelerate healing and reduce pain, rebuilding damaged knee cartilage, and limiting the progression of osteoarthritis. Ocugen is working with the FDA to complete the phase 3 protocol to advance its development and is building its own manufacturing suite to prepare for the study. Earlier this year, the FDA granted a regenerative medicine advanced therapy, or RMAT, designation to NeoCart for the repair of full-thickness lesions of the knee cartilage in adults. Our ambitious clinical agenda and the rigor in clinical development to advance our pipeline is reflective of our culture of courageous innovation.\n\nWe're relentless in our pursuit toward our long-term goals and reaching the patients who can potentially benefit from our diverse pipeline. I will now turn the call to Jess to provide our third quarter 2022 financial results.\n\nJess Crespo\n\nThank you, Shankar, and good morning, everyone. I'll now provide an overview of the key financial results for the third quarter of 2022. Our research and development expenses for the three months ended September 30, 2022, were $15.6 million compared to $6.3 million for the three months ended September 30, 2021. The increase in research and development is primarily driven by cost incurred to executing our clinical trial.\n\nGeneral and administrative expenses for the three months ended September 30, 2022, were $7.5 million compared to $4.5 million for the third quarter of 2021. Our net loss was approximately $21.9 million or $0.10 net loss per share for the third quarter of 2022 compared to a net loss of approximately $10.8 million or $0.05 net loss per share for the third quarter of 2021. Our cash, cash equivalents, and restricted cash totaled $101.6 million as of September 30, 2022, compared to $95.1 million as of year-end December 31, 2021. We are focused on efficiently managing and prioritizing the use of our capital.\n\nOur plans to work with the U.S. government agencies for support and the funding of our COVID-19 vaccine program has allowed us to extend our cash runway into the fourth quarter of 2023. That concludes my update for the quarter. Now, Tiffany, back to you.\n\nTiffany Hamilton -- Head of Corporate Communications\n\nThanks, Jess. And with that, we'll open the call for questions. Angela?\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Jennifer Kim with Cantor Fitzgerald. Your line is open.\n\nJennifer Kim -- Cantor Fitzgerald -- Analyst\n\nHey, everyone. Congrats on the quarter, and thanks for taking our questions. I have a few here. The first is I think you mentioned that the R&D cost reflects the cost incurred for clinical trials.\n\nSo, I'm just wondering, how should we think about those opex numbers going forward in terms of where G&A and R&D are at for the quarter? And I know that you said that you're building manufacturing sites to prepare for NeoCart and overall expansion. My second question is just the top-line results for the phase 2/3 for Covaxin. Can you walk us through what the next steps and the timeline for those steps would look like in terms of your discussions with agencies and the potential for conducting an adult safety trial, etc.?\n\nShankar Musunuri -- Chairman and Chief Executive Officer\n\nYes, Jennifer, good morning. Thank you. I'll let Jess answer the first question.\n\nJess Crespo\n\nSure. Hi, Jennifer.\n\nShankar Musunuri -- Chairman and Chief Executive Officer\n\nI'll do the second one.\n\nJess Crespo\n\nYeah. So, with regards to the cost on a go-forward basis, I think this quarter is probably a decent proxy for our go-forward expenses looking at R&D and G&A.\n\nShankar Musunuri -- Chairman and Chief Executive Officer\n\nAnd your second question is related to NeoCart internal -- could you repeat your second question again?\n\nJennifer Kim -- Cantor Fitzgerald -- Analyst\n\nYeah, yeah, sure. It's for the phase 3, 2/3 data for Covaxin. Can you walk us through sort of what the next steps would look like after the top-line data and the timeline for that in terms of your discussions and where you should go next?\n\nShankar Musunuri -- Chairman and Chief Executive Officer\n\nYes, yeah. So, the top-line data, as we stated, we have completed enrollment, and we are currently going to do the data analysis after we're done with collecting all the samples from the patients after the second dose. And we're anticipating to release the top-line results early next year. And then the study will get completed.\n\nObviously, as we mentioned before, the data will also give some direction on dosing patients who have taken mRNA before. That means in addition to naive patients, we also had mRNA patients because it's really difficult to enroll 100% naive patients at this stage and [Inaudible] the pandemic case. And therefore, we are going to get data, bolster data in patients who took mRNA with our vaccine. And so, based on that, once again, we're already working with FDA on the next safety protocol, which we believe may be needed for U.S.\n\nstudy in the U.S. demographic for BLA. But however, based on the booster data, that will shed a lot of light into how we move forward because we believe Covaxin can make a good booster with a broad immune response for people who took mRNA shot, which is only based on spike.\n\nJennifer Kim -- Cantor Fitzgerald -- Analyst\n\nOK. That's very helpful. And if I could squeeze one more question. As you expand to include LCA patients in your OCU400 trial, are you expanding at the Cohort 3 dose? And then how many LCA patients would then be needed to then support moving into phase 3?\n\nShankar Musunuri -- Chairman and Chief Executive Officer\n\nYeah. No, that's a good question. So, yes, that's the plan, just like you stated. Our goal is to go with the most tolerable dose with FDA, and they will be recruiting three patients.\n\nJennifer Kim -- Cantor Fitzgerald -- Analyst\n\nAll right. Thanks, guys.\n\nJess Crespo\n\nThank you.\n\nShankar Musunuri -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Robert LeBoyer with Noble Capital. Your line is open.\n\nRobert LeBoyer -- Noble Capital Markets -- Analyst\n\nGood morning. I had a question on NeoCart and if there are any time frames that you can give us as to finalizing the phase 3 protocol or starting the clinical trial.\n\nShankar Musunuri -- Chairman and Chief Executive Officer\n\nYeah. Currently, Robert, we're still -- there are two steps to it. One is getting our protocol finalized with FDA. We've been working with them.\n\nIt takes some time. The second step, most important step, I think that -- I think we know we'll get that squared off in the next few months. The actually most rate-limiting is our manufacturing because cell therapy is almost like a personalized medicine. You don't need large manufacturing facilities, but you do need highly scientific small facilities.\n\nIt's very complex science, where we can manage with good control. So, that's why Ocugen has committed to build our own facilities in our R&D expansion. We're actually preparing those facilities. So, that's the rate-limiting.\n\nOne is getting FDA protocol agreement. The second most important step is getting our facilities ready for this. And we are anticipating those facilities will be ready by the end of next year.\n\nRobert LeBoyer -- Noble Capital Markets -- Analyst\n\nOK, great. That's very helpful. Thank you.\n\nOperator\n\nYour next question comes from the line of Daniil Gataulin with Chardan. Your line is open.\n\nShankar Musunuri -- Chairman and Chief Executive Officer\n\nGood morning.\n\nDaniil Gataulin -- Chardan -- Analyst\n\nGood morning. Thank you for taking the question. Just a couple here. So, with two vaccines in the pipeline, the Covaxin and the OCU500, what is your strategy for them working together? Are you looking at them as being complementary? I just wanted to see what a big picture is for both of them.\n\nShankar Musunuri -- Chairman and Chief Executive Officer\n\nYeah, absolutely. So, OCU500, obviously, mucosal vaccine is really needed in respect of what you vaccinate [Inaudible]. So, that will -- I mean, we have to control the transmission, right? I mean, that's really important. Otherwise, virus will continue to mutate.\n\nAll the experts in the field believe you really need something mucosal vaccine, where you can stop the entry of virus. So, I think that's going to be good for the long term here. And our Covaxin offers a broad immune response. I mean, ideally, if everyone gets Covaxin and establishing a broad immune response, so you have adaptive immunity.\n\nSo, you know, you'll have ability to fight off emerging variants potentially. And then you take mucosal vaccine as a booster, which is inhaled or intranasal, which will be very convenient even for kids in the long term. And it's also easier to make this vaccine. It's based on adenoviral vector platform.\n\nSo, as the new variants come in on an annual basis, it's easy to produce this vaccine compared to our inoculated viral vaccine. So, that's the whole virus vaccine. So, that's the distinct feature. So, obviously, it's really needed -- I mean, this mucosal vaccine is a great need right now where the pandemic is going.\n\nDaniil Gataulin -- Chardan -- Analyst\n\nOK. Got it. That was helpful. And another one on OCU400, are you still guiding to report the initial data by mid-2023? And if so, what are some of the key metrics that we should be paying particular attention to?\n\nShankar Musunuri -- Chairman and Chief Executive Officer\n\nYes. I mean, we'll continue to monitor the data, and our goal is to give some data rich by mid-next year. And as we mentioned before, the phase 1/2 clinical trial, the primary endpoint is safety. However, we are monitoring efficacy based on observational endpoints.\n\nAnd each mutation may have a different endpoint going into phase 3. So, that's the reason there are multiple observation endpoints looking at -- and broadly functional, as well as structural, endpoints. Structural means under OCU, you'll be looking at the structure of the retina. Is there any stabilization of degeneration? Stabilizing a signal is really important in these patients, right? You're protecting from degeneration.\n\nAnd so, you're looking at structural aspects and functional aspects. Looking at like a perimetry or looking at mobility. And some of those data will be -- we're hoping to release by mid-next year.\n\nDaniil Gataulin -- Chardan -- Analyst\n\nGot it. Thank you very much.\n\nOperator\n\nYour next question comes from the line of Jonathan Aschoff with ROTH Capital Partners. Your line is open.\n\nJonathan Aschoff -- ROTH Capital Partners -- Analyst\n\nThanks guys, and good morning. My one question is on Covaxin. To what extent -- or actually, I'm sorry, it's on OCU500. To what extent do you think that someone's vaccination status prior to getting 500 might allow them to neutralize what's on that adenovirus and make it not really that effective?\n\nShankar Musunuri -- Chairman and Chief Executive Officer\n\nGood morning, Jonathan. I think when you give mucosal vaccines, typically, if your system is primed, it's really important. With -- most of Americans are primed with mRNA. So, if they have two shots primed, mucosal vaccine does help.\n\nSo, our goal is to really target as a universal booster vaccine. That's our potential target. And people who are vaccinated before, I mean, it's really important they're primed before they get the mucosal vaccine. At least the data is pointing out that's where we get the full benefit.\n\nJonathan Aschoff -- ROTH Capital Partners -- Analyst\n\nOK. Thank you.\n\nOperator\n\nYour next question comes from the line of Uy Ear with Mizuho Securities. Your line is open.\n\nUy Ear -- Mizuho Securities -- Analyst\n\nHi, guys. Thanks for taking my question. Just curious with the -- you know, with vaccination essentially, I guess, moving from government pay to commercial pay. Just wondering how you guys are thinking about the role for both Covaxin and, I guess, ultimately, OCU500.\n\nThanks.\n\nShankar Musunuri -- Chairman and Chief Executive Officer\n\nYeah. So, I think you have seen some of our competitors -- vaccine players have announced the pricing. Some of them want to price it for $100 a dose. They're anticipating it will move into private market.\n\nHowever -- so the Covaxin, you know, follows the traditional path. Somebody wants to take it as a primary series, which would be a very good primary series vaccine, as well as a booster. However, with the mucosal vaccine, there is a lot of emphasis from -- all the way from governmental agencies to the experts in the field. They're supporting it.\n\nYou know, they're really worried about, you know, significant mutations coming up if you don't control the transmission. Therefore, there is a great need for it, and we're working with government agencies. We believe something novel like that or something to control the transmission because the largest democracies, I mean, the countries out there, including India and China, they launched mucosal vaccine, and we are way behind it. I think it's time.\n\nWe're hoping our government will step up after the elections and support development of mucosal vaccine, which is OCU500. And we believe for that -- something like that to control the transmission, where everyone agrees, they should have government support. That's what we believe. And eventually, that may become private, too, you know, in future years.\n\nBut at least in the short term, we believe government should really support mucosal vaccine.\n\nUy Ear -- Mizuho Securities -- Analyst\n\nAnd just following up on your comment about the OCU500 being authorized in China and India. Could you give us a sense of how effective that is in those country and whether it's broadly used? Thanks.\n\nShankar Musunuri -- Chairman and Chief Executive Officer\n\nYeah. In India, I mean, the data is public. Both the companies have published some of the data coming out of our clinical trials. I mean, obviously, in India, they just launched it, and the phase 3 data looks good compared to Covaxin head-to-head, and they showed a good not only IgGs, also mucosal myogenic response.\n\nThey also stated it neutralizes emerging variants or variants of concern today, which are existing. And from the other vaccine in China, which is inhalation vaccine, it's widely rolled out. In fact, there's some public information out there as of last week, they rolled it out for many, many large cities in China. So, we don't know how the data is, but there -- at least publicly available data looks good.\n\nSo, both of them are pointing out mucosal vaccines may be very beneficial. They control this pandemic and transmission.\n\nOperator\n\nThere are no further questions at this time. This concludes the Q&A portion. I will now turn the call back over to chairman, CEO, and co-founder, Dr. Shankar Musunuri.\n\nShankar Musunuri -- Chairman and Chief Executive Officer\n\nThank you, Angela. I'd like to conclude the call with some additional parting thoughts. We have shown remarkable progress to achieve our vision of creating a fully integrated patient-centric biotechnology company that targets unmet medical need and impacts public health. We pointed this out last week during our R&D Day that between 2023 and 2027, we're targeting BLA filing and product launches in each of the next five years, reflecting what we mean by courageous innovation.\n\nWe believe our gene therapies have potential to bring significant value to our patients and shareholders, as discussed at the R&D Day. We have to prioritize our resources on gene therapies while seeking partnership with the government agencies for vaccines to support public health in the short term. Once we start getting data rates next year on gene therapies, it will allow Ocugen to potentially form partnerships outside of the U.S. to support our growth.\n\nIn the long term, we will continue to strengthen our pipeline to become leaders in disease areas we represent and continue to offer hope for patients across the globe. Thank you for joining us today.\n\nJess Crespo\n\nAnd everyone, have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTiffany Hamilton -- Head of Corporate Communications\n\nShankar Musunuri -- Chairman and Chief Executive Officer\n\nJess Crespo\n\nJennifer Kim -- Cantor Fitzgerald -- Analyst\n\nRobert LeBoyer -- Noble Capital Markets -- Analyst\n\nDaniil Gataulin -- Chardan -- Analyst\n\nJonathan Aschoff -- ROTH Capital Partners -- Analyst\n\nUy Ear -- Mizuho Securities -- Analyst\n\nMore OCGN analysis\n\nAll earnings call transcripts"
}