{
  "companyName": "Ally Financial",
  "companyTicker": "ALLY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/19/ally-financial-ally-q3-2022-earnings-call-transcri/",
  "content": "Ally Financial (ALLY 0.37%)\nQ3 2022 Earnings Call\nOct 19, 2022, 9:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Ally Financial third quarter 2022 earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Sean Leary, head of investor relations.\n\nPlease go ahead.\n\nSean Leary -- Head of Investor Relations\n\nThank you, Carmen. Good morning and welcome to Ally Financial's third quarter 2022 earnings call. This morning, our CEO, Jeff Brown; and our interim CFO, Brad Brown will review Ally's results before taking questions. Jenn LaClair has also joined for the beginning of today's call.\n\nThe presentation will reference can be found on the Investor Relations section of our website, ally.com. Forward-looking statements and risk factor language governing today's call are on Slide 2. GAAP and non-GAAP measures pertaining to our operating performance and capital results are on Slide 3. As a reminder, non-GAAP or core metrics are supplemental to and not a substitute for US GAAP measures.\n\nDefinitions and reconciliations can be found in the appendix. And with that, I will turn the call over to J.B.\n\nJeff Brown -- Chief Executive Officer\n\nThank you, Sean. Good morning, everyone. Before diving into the results, I'd like to express my sincere thanks and appreciation to Jenn LaClair, who we announced yesterday, will be leaving the company over the coming months. Jenn has been instrumental in our company's evolution over the past five years.\n\nShe's been a great partner to me, but more importantly, a great leader to Ally and a great person. She's been a champion of Ally's do-it-right culture from day one. And while we're sad to see her go, we're grateful for her contributions to the company and wish her the best in this next chapter. Obviously, CFO transitions are never easy, but we have a strong bench in place that will work closely with me while we launch a search.\n\nI am thankful for both Brad and Sean stepping up in the days to come. I know Jenn is excited to pursue her next chapter of opportunities and candidly that's hard to do while serving as a CFO. So we mutually determined now is the best time for a change and in advance of an even more fluid macro environment. Jenn, thank you for everything, and I'd like to turn it over to you for a few remarks.\n\nJenn LaClair -- Chief Financial Officer\n\nGreat. Thank you so much for the kind words J.B. I very much appreciated my time here at Ally, including all your support, friendship, and partnership. These last five years have been some of the most rewarding in my career.\n\nI'm proud of all we have accomplished as a team and having reached both the personal and professional milestones I set out for myself. I'm proud to be leaving Ally in a stronger, better position than when I arrived. We've accomplished a number of milestones financially and operationally while continuing to expand our businesses, strengthen our balance sheet and improve our risk management, all while fostering a deep talent bench and a robust culture. After these past five years and through a global pandemic no less, I can confidently and unequivocally say we have terrific teammates, including those sitting around the table this morning, J.B., Sean, and Brad.\n\nOur purpose to be a relentless Ally that does it right for our customers, employees, communities, and shareholders is woven into all we do, and I'm glad I've had a part in making that come to life. Quite simply, I'm proud of what we have built together, and I'm as convicted as ever about the strength of our company and the trajectory ahead. I'm also confident leaving, knowing Ally's finance leadership bench is both seasoned and extensive. We will facilitate a seamless transition, continuing to deliver for all our stakeholders as we always do, and J.B.\n\nand the team will continue to have me close by as an advisor to Ally. In closing, there are no words to express the pride I have in both this company, in my teammates and the time I've spent here and the relationships I have built. My interactions with the analyst and investor community have always been favorable, and I've deeply appreciated your support as well. And now I will hand it back over to you, J.B.\n\nto discuss the results for the quarter.\n\nJeff Brown -- Chief Executive Officer\n\nWell, thank you, Jenn. Appreciate you and everything. You've been a big part in our company's evolution. So thank you.\n\nAnd with that, let's go ahead and jump into the quarter. I'll start on Page number 4. Third quarter adjusted EPS of $1.12, core ROTCE of 17.2% and revenues of $2.1 billion reflected another quarter of solid financial results. ROTCE was approximately 12%, excluding the impact of OCI.\n\nWe had several notable items impacting results this quarter and wanted to be very transparent around all the moving pieces. Similar to last quarter, and consistent with what we have been guiding, we saw strong loan growth across the company and in particular, within auto finance. We certainly recognize the tightening environment but consumer credit underwriting is a core capability of our company, and we believe we are generating some of the most attractive, risk-adjusted loans in the history of Ally. Specifically, total loans grew $4 billion in the period, driving $133 million of provision build, which I don't think was fully contemplated in Street estimates.\n\nWe also recorded a $136 million impairment on our investment in Better Mortgage Company reflecting the conditions affecting the broader mortgage industry. Following the impairment, our investment has a remaining carrying value of $19 million, so this has been effectively derisked. Within operating expenses, we recorded a $20 million charge associated with the termination of our legacy pension plan. We expect an additional impact of around $55 million within operating expenses and additional tax expense as we complete the termination in the fourth quarter.\n\nThe annuity was purchased earlier in October, so this expense is certain at this point. Going forward, Ally has no remaining exposure to qualified pension plans. Given the unique nature of the pension item, the impacts are reflected in GAAP results but removed from adjusted metrics. And we recorded a valuation allowance related to foreign tax credits, which resulted in a $21 million increase in tax expense for the quarter.\n\nWe expect these items will be non-recurring in nature with the exception of the loan growth provision build. It was a bit of a noisy quarter, so we thought it would be helpful to hit these notable items at once before getting into the details on the quarter. Let's turn to Page number 5 and discuss operational performance. Within auto, consumer originations of $12.3 billion were flat to the third quarter in the prior year and about $1 billion lower than the second quarter.\n\nOriginated yields expanded 93 basis points quarter over quarter to 8.7%. Industry vehicle sales remain pressured but our ability to generate strong consumer originations shows the scale of our auto finance business and depth of application flow. One other observation I would make. You've heard other CEOs make comments about pulling back from segments of the auto finance market.\n\nI think you need to look closely as to what has really happened. Prime lending continues to be a very solid space. Super prime lending has seen very aggressive pricing from the credit unions. It makes sense that some banks don't want to chase that.\n\nThe subprime market has shrunk from about 25% of the origination universe to 18%. This is a function of a lack of availability for lower-priced units, and that has indirectly impacted some banks' ability to originate there. Again, prime continues to perform quite well, but obviously, this is where deep experience, people, and relationships matter. And further, contrary to what you also may have read about happening in the prime space, we actually observed some of our competitors lowering price in the quarter to try to capture volume.\n\nOn commercial loans, we saw modest increases in new inventory levels across the marketplace, but balances remain low, and we continue to expect to prolonged normalization. We recently surpassed seven million total vehicles sold on our SmartAuction platform. We have not typically highlighted SmartAuction very often externally but it's a great example of how we've continued to evolve our product offerings to create value for Ally and our dealer customers. Within insurance, written premiums of $291 million were impacted by lower inventory levels and industry sales.\n\nInvestment portfolio performance remained solid, but constrained by overall market performance. Turning to Ally Bank. Retail deposit customers exceeded 2.6 million, expanding 6% year over year and representing our 54th consecutive quarter of customer growth. As we conveyed on last quarter's call, retail balance growth resumed with balances increasing $2.7 billion in the quarter.\n\nDeposits currently represent 86% of funding, and we are seeing a very competitive market and larger flows to brokerage to start the fourth quarter. Our consumer engagement and product adoption trends remain compelling. Ally Home originations of $521 million in the quarter reflects broader market conditions. Equity market trends resulted in a decline in Ally Invest assets while accounts increased 4% versus prior year.\n\nAlly Lending generated origination volume of nearly $600 million with expansion from our healthcare and home improvement verticals. Ally Credit Card reached $1.4 billion of loan balances, and we surpassed one million active cardholders. And corporate finance continues to generate solid loan growth with a held-for-investment portfolio reaching $9.4 billion. Let's turn to Slide number 6 to discuss the consumer.\n\nLike all lenders and especially given the uncertainty in the market, we are extremely focused on consumer health and continue to look for any early indicators of potential consumer stress. While persistent inflation remains a clear headwind, we continue to see strong balance sheets across our consumers. On the bottom left, savings account balances at Ally Bank remain elevated relative to pre-pandemic levels. We've included a view based on income level, but we look at this data across multiple dimensions and the trends look consistent across occupation, vintage, and balanced cohorts.\n\nThe right side of the page shows average consumer data spend. We've seen slight moderation from earlier this year and spend remains up versus pre-pandemic levels. Broader financial obligations for consumers remain near or record lows, enabling these spend levels while still maintaining elevated savings balances. At this stage, indicators remain solid and will remain nimble and react accordingly as the market evolves.\n\nI'd also add that within all of our lending portfolios, we've been making tactical adjustments and tweaks to our underwriting trends. This is often overshadowed by the headline numbers, but there is a tremendous amount of granular focus when we deploy credit and capital. Finally, employment remains very tight and should buoy stronger-than-expected credit performance relative to historical norms. So net-net, we still see a strong and well-positioned consumer and the portfolio seasoning largely in line with expectations at this point.\n\nAnd with that, Brad, over to you for more of the details.\n\nBrad Brown -- Interim Chief Financial Officer\n\nThank you, J.B. Good morning, everyone. I'll begin with detailed results for the quarter on Slide 7. Net financing revenue, excluding OID, of $1.7 billion grew nearly $126 million or 8% year over year.\n\nPerformance was driven by continued strength in origination volumes and auto pricing, higher funding costs given the rapid increase in short-term rates, partially offset through our hedging position, growth in unsecured consumer products, and gradual normalization of excess liquidity over the past year. Adjusted other revenue of $359 million reflected solid performance across our insurance, SmartAuction, and consumer banking businesses. Revenues declined versus the prior year and prior quarter, driven by impairment of our investment in Better Mortgage that J.B. covered.\n\nExcluding the impact of that impairment, other revenue was consistent with our mid-400s expectations. Provision expense of $438 million reflected origination volume and the continued normalization of credit performance. Loan growth across retail auto, unsecured consumer lending, and corporate finance drove a $133 million reserve build. While CECL provisioning is a headwind for the current period, strong originations will drive attractive long-term returns.\n\nNet charge-offs in the period of $276 million remain below pre-pandemic levels, while up versus the prior year, the increase remains in line with expectations. Non-interest expense of $1.1 billion reflects continued investment in technology and higher personnel expense. As a reminder, the prior period did not include any expenses related to Ally Credit Card. As J.B.\n\nmentioned, the quarter also included $20 million of costs associated with the termination of our legacy pension plan. Within tax expense, results reflect the non-occurring valuation adjustment J.B. covered. These adjustments increased the tax rate in the quarter by approximately five percentage points.\n\nGAAP and adjusted EPS for the quarter were $0.88 and $1.12, respectively. Moving to Slide 8. Net interest margin, excluding OID, of 3.83% increased 15 basis points year over year and declined 23 basis points quarter over quarter. Given duration dynamics on both sides of the balance sheet, we expect to see some near-term pressure, but we remain confident in an upper 3s NIM over time.\n\nWe've built a structurally enhanced balance sheet over several years that faced some temporary pressure from the unprecedented pace and magnitude of the increases in short-term interest rates. Total loans and leases are up nearly $18 billion versus prior year, while the normalization of excess liquidity results in total operating earning asset growth of $7 billion. Earning asset yield of 5.59% grew 48 basis points quarter over quarter and 91 basis points year over year, reflecting the benefits of strong originated yields within retail auto, growth in higher-yielding assets, and more than $40 billion of floating rate exposure across the loan and hedging portfolios. Retail auto portfolio yield expanded 19 basis points from the prior quarter to the 7% figure we've alluded to previously.\n\nWe expect continued yield expansion due to the gradual decline in prepayment headwinds, which we started to see in recent months, continued expansion in originated yield above 9%, and our hedging position, which added 25 basis points to the retail portfolio yield this quarter. As mentioned previously, yields expanded across our commercial and credit card portfolios as their floating nature benefits from higher rates. Looking forward, we expect continued earning asset yield expansion, fueled by strong pricing in auto finance, continued disciplined growth across our newer consumer portfolios, and the benefit of higher interest rates. Turning to liabilities.\n\nCost of funds increased 77 basis points quarter over quarter and 78 basis points year over year. The increase in deposit costs reflect higher benchmark rates and a competitive direct bank market for deposits. Broadly speaking, funding costs will continue to move higher as the Fed continues with the tightening cycle, but we remain confident in our ability to manage interest expense due to our customer value proposition that goes beyond rate, core funded status, and flexibility across diverse funding sources. For the next couple of quarters, the rapid increase in benchmark rates will pressure margins as deposits initially reprice faster than earning assets.\n\nI'll cover these dynamics in detail on the next slide. Slide 9 provides detail on the drivers of near-term pressure on net interest margin and our expectations over the coming quarters. With fixed-rate retail auto as the largest asset on our balance sheet, and liquid savings making up 70% of the deposit portfolio, we manage a naturally liability-sensitive balance sheet. In retail auto, we put 225 basis points of price into the market through September and 245 basis points total through last weekend.\n\nOn the deposit side, our OSA pricing moved 160 basis points as of September, and 175 basis points as of today. So pricing on the retail auto is 65 to 70 basis points in excess of what we've done on OSA so far. While beta on both sides has been in line with or favorable to our original expectations because of the timing dynamics we discussed previously, increases in the retail auto portfolio yield lag increases in deposits. That will continue to be the case for the next couple of quarters as the Fed is expected to move rates higher.\n\nBut over time, the retail auto portfolio will continue to migrate toward the originated yield, which we expect to move well into 9%. On the deposit side, the OSA rate will move higher but should level off once we get to a peak level of Fed funds. We provided a lot of detail on retail auto and deposits given their size, but keep in mind, most of our commercial book is floating rate. And we've talked about $3 billion to $4 billion of growth in unsecured lending in the medium term.\n\nGiven their high margins, that growth should add 20 basis points to consolidated NIM over time. So putting all that together, we expect NIM to bottom around 350 basis points, before we level off and eventually move higher. While we recognize there is focus on the trajectory, having NIM in the mid-3s, when rates are expected to go up almost 500 basis points in nine months is a reflection of the leading franchises and strong balance sheet we've built over the past several years. Lastly on NIM, we've added additional detail on the retail auto pay fixed hedge position in the appendix.\n\nTurning to Slide 10. Our CET1 ratio declined to 9.3% as earnings supported $3 billion in RWA growth and $415 million in share repurchases. Last week, we announced a dividend of $0.30 per share and have completed approximately $1.6 billion in repurchases on a year-to-date basis through September. While we maintain very robust capital levels with $3.6 billion of excess above SCB requirements, given heightened macroeconomic uncertainty, we do not expect material share repurchases in the fourth quarter.\n\nOur priorities remain focused on maintaining prudent capital levels amid continued uncertainty, while simultaneously investing in the growth of our businesses. Let's turn to Slide 11 to review asset quality trends. Consolidated net charge-offs of 85 basis points continued to normalize in line with expectations. Comparisons to the prior year and pre-pandemic periods are influenced by the addition of unsecured lending and a corporate finance charge-off that added 10 basis points to consolidated rate and was reserved for in 2020.\n\nUnsecured lending adds an incremental seven basis points. Retail auto performance continues to reflect a gradual normalization. Strong used values continue to benefit loss given default rates and the normalization of peak values is consistent with our expectations. In the bottom right, 30-day delinquencies increased due to typical seasonality and a gradual normalization of consumer trends but remained below 2019.\n\n60-day delinquencies are equal to 2019, but we continue to see favorable flow-to-loss rates helping to keep charge-offs below 2019 levels. We expect continued increases in delinquencies as consumer trends normalize post-pandemic, and we are closely monitoring additional inflationary pressures. On Slide 12, we wanted to provide some additional perspective on the risk profile of the retail auto portfolio that should be helpful as you think about normalization of losses and delinquencies. Relative to 2019, our portfolio today has slightly more risk content based on our strategic shift to the intersection of prime and used.\n\nSeveral years ago, we began focusing more heavily on the used market and reducing our concentration in super prime, which generally has lower returns. Since making that strategic shift, we've maintained a disciplined underwriting approach. Our portfolio has gradually seasoned over that time and now reflects lost content consistent with our normalized loss expectations. As pandemic tailwinds normalize, we expect delinquencies and net charge-offs to migrate above 2019 levels.\n\nWe expect normalized delinquencies of 3.4% to 3.8% versus 3.1% in 2019, and we expect losses to migrate toward 1.6%, which is 30 basis points higher than 2019. To compensate for that incremental loss content, we've added 125 basis points of price since 2019. Normalizing for benchmark rate moves, we've added 100 basis points of price to compensate for the 30 basis points of higher expected losses. And as you've heard from us in the past, the investments we've made in talent and digital tools have enhanced our servicing and collections capabilities and give us confidence in our ability to effectively manage credit in a variety of environments.\n\nOn Slide 13, consolidated coverage increased three basis points to 2.71%, reflecting growth in our retail auto, unsecured consumer lending, and corporate finance portfolios. The total reserve increased to $3.6 billion or $1 billion higher than CECL day one levels. Retail auto coverage of 3.56% increased five basis points and is 22 basis points higher than CECL day one. This includes an overlay of $19 million or roughly two basis points for potential losses tied to Hurricane Ian.\n\nWe've demonstrated an ability to navigate these weather events focused on supporting our customers and minimizing financial impacts. Under our CECL methodology, our 12-month reasonable and supportable period assumes unemployment increasing to slightly above 4% over the next 12 months before it gradually reversion to a historical mean of about 6.5%. Moving to Ally Bank on Slide 14. Retail deposits of $134 billion increased $2.7 billion quarter over quarter as growth resumed following elevated tax outflows in the prior period.\n\nInflows from traditional banks represent the majority of growth and supports our core assumption that direct banks will become increasingly attractive as the gap between traditional and direct banks widens. Across the industry, online savings rates -- 2% in September, and we saw our highest monthly growth since March of 2021. Total deposit balances increased $6 billion quarter over quarter driven by incremental growth from broker deposits. We continue to expect modest retail deposit growth for the full year.\n\nWe delivered strong customer growth, adding 51,000 new customers in Q3, our 54th consecutive quarter of growth. Since we founded Ally Bank, balanced growth and retention have been foundational aspects of our retail deposit strategy, along with customer acquisition. The bottom right demonstrates a consistent trend of growth from both new and existing customers, and we continue to lead the industry with a 96% retention rate. And we operate the deposits business with less than 30 basis points of non-interest expense, a significant advantage as we think about total cost of deposits and overall efficiency.\n\nTurning to Slide 15. We continue to drive scale and diversification across our digital bank platforms. Deposits continue to serve as the primary gateway to our other banking products, which enhance brand loyalty, drive engagement and deepen customer relationships. Leveraging the strength of our brand allows us to build on current momentum across newer consumer lending products.\n\nAlly Invest continues to increase depth and strength of customer relationships at Ally Bank. Customers who have deposits and invest relationships have nearly two times higher balances and are less likely to attrite than stand-alone deposit customers. Card balances of $1.4 billion are derived from 1 million active customers, reflecting our disciplined strategy of low and grow credit lines. Ally lending balances of $1.8 billion are more than two times prior-year levels, given momentum across healthcare and home improvement verticals.\n\nWe'll continue to be deliberate to see meaningful opportunities for accretive growth across these newer businesses and are excited for the capabilities we're building for the future. Let's turn to Slide 16 to review auto segment's highlights. Pre-tax income of $488 million was driven by growth in retail auto balances as well as yield and solid credit performance. The increase in provision expense versus prior periods resulted from normalizing credit performance and CECL reserve build to support $12.3 billion in consumer originations with attractive risk-adjusted returns.\n\nLooking at the bottom left, originated yield of 8.75% was up 92 basis points from the prior quarter, reflecting significant pricing actions. We put more than 245 basis points of price into the market through last week. And despite seasonality headwinds, we expect to originate above 9% in the fourth quarter. As elevated retail trade-in activity normalizes and reduces pressure on portfolio yields, we continue to expect the portfolio will migrate well into the 7s, given current originated yields.\n\nPricing beta should be viewed through the tightening cycle, but we've been pleased with the momentum to date and remain confident in our ability to generate higher yields from here. Turning to Slide 17. Our leading agile platform is built to adapt to dealer and customer needs in a comprehensive manner, reflected in our performance and the multiyear growth of our dealers. We are now approaching 23,000 active dealer relationships, up 25% over the past three years.\n\nOur strategy remains centered on deepening these relationships and increasing application flow. In the upper right, lending consumer assets expanded to $95 billion or nearly 7% on a year-over-year basis. Retail auto assets increased $2 billion in the quarter. Based on current market conditions, we expect more than $48 billion of consumer originations in 2022.\n\nCommercial balances ended at $16.2 billion as new vehicle supply remains pressured. Turning to origination trends in the bottom half of the page, auto volume of $12.3 billion displays our ability to generate strong flow while adding significant price in the market. Use accounted for 64% of originations, continuing to display our flexibility to adapt to market conditions, while non-prime comprised 10% of volume, consistent with our trend over the past few years. We've remained disciplined and leveraging a deliberate approach to underwriting and entrenched dealer relationships to drive strong flows.\n\nWe are cognizant of the uncertainty on the horizon and remain focused on optimizing the buy-box and pricing to ensure appropriate risk-adjusted returns. Turning to insurance results on Slide 19. Core pre-tax income of $32 million decreased year over year from the impact of lower investment gains given the market backdrop. Total written premiums of $291 million reflect a continued focus on increasing dealer engagement while still facing a headwind from lower unit sales and inventory levels across the industry.\n\nOn the bottom left, we wanted to provide a real-time example of how we navigate potential loss events in ways that benefit our dealer customers and mitigate risk for Ally. Hurricane Ian was a significant storm with industry -- insurance industry estimates calling for losses in excess of $60 billion. From an Ally perspective, we had over $1 billion of floor plan exposure in the storm's path and were able to limit expected losses to less than $4 million through proactive outreach. We continue to look for ways to differentiate our product offerings and remain a partner for our dealers as these weather events occur and disrupt our operations.\n\nGoing forward, we remain focused on leveraging our significant dealer network and holistic offerings to drive further integration of insurance across auto finance. Turning to corporate finance on Slide 20, core income of $91 million reflected disciplined growth in the loan portfolio, a year-over-year increase in other revenue from a gain related to a previously restructured loan exposure and stable credit trends. Net financing revenue was impacted by higher asset balances as well as higher benchmarks as the entire portfolio is floating rate. The loan portfolio remains diversified across industries with asset-based loans comprising 56% of the portfolio.\n\nOur $9.4 billion HFI portfolio is up 42% year over year, reflecting our expertise and disciplined growth within a highly competitive market. Mortgage details are on Slide 21. Mortgage generated pre-tax income of $19 million and $500 million of DTC originations, reflecting tighter margins and conforming production and effectively zero demand for refinancing activity. Mortgage remains a key product for our customers who value a modern and seamless digital platform.\n\nRather than focusing on volume, we remain committed to delivering a great experience for our bank customers and compelling risk-adjusted returns, which may lead to fluctuations in origination levels over the coming quarters. Lastly on mortgage, we provided some detail on our investment and better referenced by J.B. The investment has a remaining carry value of $19 million and generated gains in excess of the original investment. So despite the impairment this quarter, the investment has been accretive to capital.\n\nI'll close by emphasizing my confidence in Ally and our ability to successfully navigate a variety of economic environments. I'm excited to lead this transition and would like to thank Jenn for her leadership over the past five years and wish her the very best. And with that, I'll turn it back to J.B.\n\nJeff Brown -- Chief Executive Officer\n\nThank you, Brad. Slide number 21 provides a view of the macro environment we are navigating, how we are delivering operationally and how we are positioning for further uncertainties. As we covered throughout today's call, operational performance remains solid, and I'm proud of our teams for focusing on controlling what we can control. Obviously, the macro backdrop is constantly evolving.\n\nAs a natural liability-sensitive balance sheet, the short-term faces more pressures, but fundamentals remain very sound. Based on current forwards, the Fed funds rate is expected to increase 475 basis points this year, the most since 1980. Vehicle sales remain pressured with supply chain and production challenges yet to be fully resolved. Despite these factors, we have continued to generate attractive loan growth and deposit growth is down across the industry, given the onset of quantitative tapering and elevated tax payments in the first half of the year.\n\nOur teams have shown their ability to remain nimble, pivot as needed, and continue to deliver operationally. Full year auto originations are expected to be around $48 billion. On the deposit side, our digital, direct bank model continues to resonate in the market. We've seen steady growth in customers throughout the year.\n\nAnd despite new competitive forces, we still expect to generate modest full-year growth. Credit is performing in line with our expectations. Consolidated charge-offs remain under 100 basis points, given the strength of our largely secured balance sheet. In addition to solid execution, we've positioned the company for a variety of economic environments.\n\nReserve levels remain approximately $1 billion higher than CECL day one and have nearly tripled since 2019. Capital levels are $3.6 billion above our SCB requirement. And again, yields on our more newly originated auto book are now well north of 8% and continuing to increase, which provides significant loss absorption capacity even in periods of elevated losses. We're disciplined on underwriting and are constantly refining the buy-box to ensure we appropriately size and price for risk.\n\nAnd we've made meaningful investments in people and digital capabilities across our customer servicing and collections teams. So while the macro path from here remains uncertain, we have great businesses with seasoned operators and an incredible culture. Over the last decade, we have transformed all aspects of our company, and we're better positioned than ever to navigate a challenging environment. We'll stay focused on executing our strategic priorities for long-term value creation.\n\nGiven the environment, we did want to share a snapshot of the fourth quarter. The outlook, particularly in the near term, remains fluid. But as we sit here today, we see NIM around 3.5%. That reflects the near-term pressure we've highlighted today.\n\nRetail yields and hedge income will be up meaningfully quarter over quarter but is not expected to fully offset elevated funding costs in the short term. And depending on the shape of the curve and the path of Fed funds rate, we could be here for several quarters. We see $2 billion to $3 billion of loan growth expected in the fourth quarter across our consumer and corporate finance portfolios, so reserves will increase as we grow the balance sheet. Continued normalization of credit, including seasonal patterns, will result in consolidated credit losses around 100 basis points.\n\nAnd putting it all together, adjusted EPS is expected to be around $1 per share in the fourth quarter. I'll provide an update at the Goldman Sachs conference later this quarter and consistent with prior years, we'll give you our insights into 2023. The ROE guide we've had out there is again a through-the-cycle view and we believe largely remains intact. But obviously, the dramatic acceleration in interest rates put some pressure on the near-term outlook.\n\nFinally, I'll close with a few comments on Slide number 22. I remain incredibly proud to lead our company. Ally's purpose-driven culture is genuine and fuels our financial and operational performance. As you've heard us say, we're focused on delivering performance for all of our stakeholders, whether it's teammates, customers, communities, or stockholders.\n\nAs we enter a period of uncertainty, I continue to challenge our teammates to see around corners, focus on essentialism, and adopt an onerous mindset. Ally's results and market-leading businesses demonstrate we are equipped to successfully navigate in challenging environments. We remain focused, nimble operators and discipline on capital deployment, which I'm confident will drive long-term value. I know this quarter didn't hit expectations but fundamentals remain really solid, and I hope the added transparency today gives you more of a detailed view on the various dynamics we are navigating.\n\nAnd with that, Sean, let's head into Q&A.\n\nSean Leary -- Head of Investor Relations\n\nThank you, J.B. [Operator instructions] Carmen, please begin the Q&A.\n\nOperator\n\nThank you. [Operator instructions] First question comes from the line of Ryan Nash with Goldman Sachs. Please go ahead.\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nHey. Good morning, guys.\n\nJeff Brown -- Chief Executive Officer\n\nHey. Good morning, Ryan.\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nTo start off, I don't know if Jenn is on the call, but I just want to say, Jenn, it's been a pleasure working with you and obviously, best of luck in your new role. J.B., maybe to start on credit, 4Q implies a little bit of a ramp in charge-offs. And you've given us some color both on the delinquencies and where you see charge-offs going. I guess, could you maybe just talk about when you think these will begin to level off.\n\nAnd I asked a similar question last quarter. The guide implies about $11 billion originations for the fourth quarter. And just given market concerns, why not slow the originations a bit more given -- and sit and see what happens with credit and the economy and take a more conservative approach given particularly maybe some of the newer businesses in addition to what you're seeing in auto?\n\nJeff Brown -- Chief Executive Officer\n\nYeah. Got it, Ryan. Thanks for the question. So first, leveling off on charge-offs.\n\nObviously, as we talked about throughout today's call, it's a pretty fluid environment. So hard necessarily to predict exactly, I mean we think mid-2023, maybe the backside of 2022 you should start to see some stabilization there. But some of this is, obviously, dependent on how far the Fed goes, whether we can get inflation, broadly speaking from a macroeconomy under control. And I think -- so there's a lot of unknowns at this point.\n\nWhat I would say, we had out there this expected loss range of 1.4 to 1.6. I still think that's largely intact. You heard us today sort of drop the 1.4 side of that. And that's a bit by design.\n\nI mean, we see losses are going to migrate up closer to that 1.6 range through time. But I think tied into your second point, why not pull back? I mean, part of this is we see still these markets being very attractive. Flows right now, Ryan, I mean if we shocked funding costs to somewhere in the neighborhood of 4%, put lifetime losses on the auto book in excess of 2%, you're still getting an ROE of around 21% new business and ROA just shy of 2%. So in terms of capital deployment, in terms of continuing to serve your customers, we still feel really good about new loans that we're originating today.\n\nAnd it sometimes gets lost in the big numbers when you -- last quarter, it was $13 billion. This quarter it was $12 billion. We're talking about an annual number of $48-ish billion. We constantly trim the margins where we see incremental pockets of risk.\n\nI mean, the analytics behind this are very robust. We have weekly credit conversations and buybacks adjustments. So it's a very fluid environment. And sometimes that's trimming $300 million, $400 million, $500 million in a quarter, but that is ongoing.\n\nSo where we see pockets of risk that we say we don't like that space, we dial back. But broadly speaking, where we're playing in prime, it's still very attractive. Returns are very robust. And I think it's important that we continue to serve our dealer customers.\n\nBut I think long term, we really like the loans we're putting on the books today and think they're going to prove to be very profitable over time.\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nGot it. Thanks for the color. And maybe as a follow-up, if I think about the 4Q guide, it implies a return that's less than 10% ex-OCI. Obviously, there's a lot of uncertainty, but we're not in a recession yet.\n\nAnd I think you mentioned that the medium-term target largely remains intact, but there's going to be pressure in the near term. So I guess, do you expect to operate around this level of profitability for the next few quarters? And I guess, given the stock's trading less than 60% of tangible ex-OCI, where do you see the returns of this company going in 2023? And what do you think it will take for us to get back to those medium-term return levels? Thank you.\n\nJeff Brown -- Chief Executive Officer\n\nYeah. I mean, I think, obviously, with respect to the stock, yes, it's disappointing how it's continued to trade. We're bottomed by. But I think most of this is all priced in at this point.\n\nAnd in fact, pretty draconian scenarios are implied relative to future credit performance. But I think, we see ourselves you're in the neighborhood of kind of your 10% ROE in the fourth quarter. We see that largely being the low point, and we would gradually start to increase. So the 16% to 18%, again, we've always talked about that being a through-the-cycle view.\n\nWe still see that is being fully intact. We're a structurally more profitable company. But I think in the near term, when you're a liability-sensitive balance sheet and you have 450, 475 basis points of set increases embedded over a period of nine months, it's hard to outrun that. But, I mean, I think the important point is, at some point, you'll see, obviously, cost of deposits, which are big drivers start to normalize.\n\nWe put some sensitivities around a 75% beta from here and that gets you to an OSA rate in the neighborhood of $350-ish whether or not we get there or not, remains to be seen. Some of that's driven by competitive pressures. So at some point, that starts to normalize and your auto book starts to -- all these new loans, they start to work their way through and net-net, your portfolio yield is suddenly going to be much, much higher. And so we would see the exit rate in 2023 being higher and gradually growing back to the 16% to 18% is kind of the normalized view.\n\nBut I think, next year is probably in that 12 to 13 plus percent range. And then, a couple of other drivers that Brad talked about, I think, the newer products, both on the consumer side, both in credit card, Ally Lending as well as what we're doing in the corporate finance book, that's a pretty profitable business and you take all those things together, and that should start contributing to margin expansion as well. So a lot of what you're seeing in the fourth quarter, when your NIM goes down to 350, your charge-offs are probably approaching 100 basis points, we'll hope we'll beat that number. But this leads to fourth quarter kind of being a floor.\n\nAnd it's just a bit uncertain as to how quickly you rebound from there. But hopefully, you appreciate Ryan, all the different variables and dynamics that are at play.\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nAppreciate all the color, J.B.\n\nJeff Brown -- Chief Executive Officer\n\nYou got it. Thank you. See you in December.\n\nOperator\n\nThank you. One moment for our next question, please. Our next question comes from the line of Moshe Orenbuch of Credit Suisse. Please go ahead.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nGreat. Thanks. Given that the margin, I think the margin trends were somewhat kind of expected, maybe a touch worse just given the fact that the Fed tightening is kind of increased faster. Can we talk a little bit about the credit normalization? And what would make it -- what would require you to build the reserve to a higher level than you're currently holding at, given that you said that your one-year forecast has the unemployment rate in the 4s and then moving back to a higher level, I guess.\n\nSo if we think about it, what would it take for that number to go -- to be worse than what you're currently expecting?\n\nJeff Brown -- Chief Executive Officer\n\nYeah. Moshe, thanks for the question. So I think the -- first, overall, we feel really good about the level of coverage we have in place today. Obviously, we're up to, I think, 3.56%, a couple of basis points of that just being driven by Hurricane Ian, but you're carrying considerable more reserves even relative to CECL day one and certainly if you went all the way back to 2019.\n\nSo what could cause that to change? Some -- with CECL, you have some interesting factors on how CECL math works. So if you got a Moody's scenario that suddenly implied unemployment rates, we're going to meaningfully shock higher from here, which, again, we don't necessarily think that's going to be the case. You could be forced to build a bigger reserve. But again, I think this embedded normalization to a 6.5% unemployment rates relative to where we're at today, we feel pretty good.\n\nSo we don't think that's going to transpire. But as we just talked about with Ryan, as I'm sure you're talking about, Moshe, with all your customers, there's just a lot of uncertainty about how consumers are going to withstand sustained inflation. Again, what we try to convey is all the things that we see on the consumer today feel really solid. But we'll go through our normal reserving process like we do every quarter.\n\nI mean, could we see coverage tick up a point here or there just from normal BAU, Absolutely. But I think for the most part, we feel really good about the level of reserves that are out there, and we feel we're adequately protected.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nThanks. And just as a follow-up. Kind of following up kind of on Ryan's question about kind of moderating originations. I guess how do you think about it in terms of the size of the balance sheet, both in terms of capital and also just funding? I mean to some degree, I guess, I would have thought that the more rates go up, given the fact that traditional retail banks haven't really raised their rates very much yet, that betas could be smaller, not higher, and yet obviously the loan growth obviously kind of drives individual companies to kind of keep them a little bit higher to make sure they have enough funding.\n\nAnd I guess -- so if you think about the combination of that is that, I mean, I guess the question is, could we start to see those betas improve before rates level off, or how are you thinking about that currently?\n\nJeff Brown -- Chief Executive Officer\n\nYeah. Another great question. I mean, we would certainly hope so, is what I would say. But obviously, again, Moshe, as you know, there's just been a rapid actual increase in short-term rates and even further more projected from here.\n\nYou've got another 175 basis points priced in. So we think that 75% beta would be on the high side of where we would be at from here. But you're seeing a lot of competitors and a lot of competitive pressures being out there. It's been interesting to see some of the behaviors we've observed in the fourth quarter in the direct banks and a couple of folks now paying in excess of 3%.\n\nFrankly, that surprised us a little bit just in terms of how aggressive some ratepayers are being right there. We're trying to combat that. Obviously, we have a cash balance promo lift out there to continue attracting high-quality deposits right now. But it has been a very dynamic environment.\n\nAnd then the other interesting factor, I'd say, our teams, Sean and I got out -- Sean, Brad, and I got an update this morning, even it's just interesting a recent outflows to brokerage, which may imply your mass consumer thinking equities are close to bottoming where they're at here, and you're starting to see bigger flows into brokerage than we've seen. So all that ends up to some degree pressuring how much your growth and all this starts to be a balance of how aggressive do you want to be in terms of paying on rate. But we would hope through time, the beta would moderate from here. And I think that 75%, again, that we showed you, we would believe is more a worst-case scenario than anything.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nGreat. Thanks very much.\n\nJeff Brown -- Chief Executive Officer\n\nThank you, Moshe.\n\nOperator\n\nThank you. One moment for our next question, please. Our next question comes from the line of Betsy Graseck with Morgan Stanley. Please go ahead.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nHi. Good morning.\n\nJeff Brown -- Chief Executive Officer\n\nHey. Good morning, Betsy.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nA couple of questions. Just first on the outlook for NIM. I know you mentioned the 3.5% for 4Q. And I guess I just wanted to get a sense of the push/pulls in there that would drive it either higher or lower as we go through the next couple of quarters.\n\nJust in terms of if the forward curve is moving up faster, like a cash carry kind of rates might go higher for longer scenario. And then also just wanted to understand how you're thinking about the remarketing gains that are embedded in NIM. How does that traject throughout the rest of this year and into next? Thanks.\n\nJeff Brown -- Chief Executive Officer\n\nYeah. You got it. So I mean, I think with respect to NIM, it's largely going to be back to what your assumption is around deposit costs, so similar to Moshe's question there. The competitive environment remains pretty intense.\n\nWe would hope beta at some point starts to slow there. But I think that's the big driver. Obviously, on the auto side, the team has been great in terms of continuing to push pricing into the market. Flows have been really strong, really solid.\n\nAgain, some of the most profitable loans we think we've ever originated. And you heard me talk about the 21% stat. So on the auto side, we're continuing to push price as hard as we can there. And again, that just takes time for that -- for the entire portfolio to season to see that portfolio yield migrate up.\n\nBut what's going to be the near-term story ultimately comes back to deposits. And then gains, about $40 million this quarter, I think -- we think we're going to be relatively in that ZIP code for the next couple of quarters, we don't see that being a big driver either direction here. Used car prices, as you're seeing, are starting to come off a touch. Obviously, we saw Manheim come out earlier this year.\n\nAll that's embedded in our guide and in our assumptions. And so that could slow some of the where lessees are kind of going and capturing that gains themselves. So it could be slightly additive to us, but I don't think it's going to be a really meaningful driver from here. But I think we were down kind of and used 5% to 10% in the third quarter, and we still -- in terms of pricing, and we obviously still had decent gains in the lease book there.\n\nSo it's not going to be a huge driver, I guess, is my ultimate point, Betsy.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nOK. And then just on the outlook for the losses on the auto book to the 1.6-ish level, I'm trying -- I'm thinking through how declines in used car prices are going to be impacting that over the course of the next year or so? And maybe you can give us an update on some of the partners that you have exposure to like Carvana? Thanks.\n\nJeff Brown -- Chief Executive Officer\n\nYeah. Sure. So I mean, I think declines in used car pricing is largely embedded in -- or are embedded in that kind of 1.6% guide. I mean I think still, look, when we underwrite loans today, we still have that loss assumption of 1.4% to 1.6%.\n\nThat is consistent. I think what we're trying to do in our guide today is say, look, we recognize in light of all [Audio gap] these macro factors. We're probably going to be on the upper end of the 1.6% range. And then part two of your question, can you, Betsy, one more time --\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nYeah. Sure. Just wanted to understand how your exposure is trending toward some of the partners you have like Carvana?\n\nJeff Brown -- Chief Executive Officer\n\nYeah. Thank you. So what I would say there, obviously, we are watching Carvana closely. We engage at my level and certainly our Head of the auto business, Doug Timmerman, with Ernie quite regularly about their journey here.\n\nWhat I would say, our exposure while we do have retail commitments out there, there are price determinations -- allows us if we don't want the paper, you can indirectly influence that by a pricing decision. But for us, we're not lending on their real estate. It's really retail exposure. And I think as you know, Carvana's business model is effectively to sell a car, and there's not really a lot of put back.\n\nSo in terms of retail exposure to us, it's -- the paper is performing quite well. In fact, I would say on a like-to-like basis, their credit performance performs every bit is good, if not, a tick better than our own auto -- core auto dealer originated paper. So we feel we're obviously watching them but they've been a really good partner. And obviously, they're faced with industry dynamics, inflation pressures, trying to align inventory to where demand is.\n\nBut I think Ernie has done a really responsible job of kind of cleaning up operations, lowering costs, slowing in the growth. But in terms of a retail flow partner, we have no complaints whatsoever about them. And consumers still like the model.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nThanks.\n\nJeff Brown -- Chief Executive Officer\n\nThanks, Betsy.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nYep. Thanks.\n\nOperator\n\nThank you. And our final question -- one moment, please. Our final question comes from the line of Sanjay Sakhrani with KBW. Please proceed.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nThanks. Good morning.\n\nJeff Brown -- Chief Executive Officer\n\nGood morning, Sanjay.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nGood morning. I have a question on new origination pricing. J.B. at the outset, you talked about all the puts and takes, sort of the competitive dynamics.\n\nAnd I think Brad mentioned that the yield is going to move to well in excess of 9%. I'm just curious -- do you guys see any change in sort of demand elasticity related to that? You mentioned also banks are pricing lower. Do you feel there's any risk to that yield as we move forward?\n\nJeff Brown -- Chief Executive Officer\n\nYou know, Sanjay, at this point, and I said on one of the questions, we've been pleasantly surprised by our team's ability to put price in the market. I think one other dynamic is card prices are starting to come off. That's -- honestly, that's a bigger driver in terms of a monthly payment factor relative to the absolute rate that a consumer pays. And so these things are kind of working in tandem where we haven't seen much pressure.\n\nBut I would say, as we're having these conversations with our auto business leader and the team, I think we're probably closer to not necessarily a peak, but you're closer to a saturation point where you may see demand start to slow a bit where consumers just don't want to see rates in excess of, call it, 10%. We're not bothered by that. Obviously, we're not out with our auto business. Setting a defined origination target, again, this year, we think it will be $48 billion.\n\nNext year, I think we're planning for something several billions south of that. And so we're OK with volume coming down if the ROE isn't where it needs to be. And that's kind of the dynamic management that we go through.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nOK. And sorry if I missed this. But as far as the share repurchase, how should we think about next year and then what you guys intend to do in terms of capital return or capital management?\n\nJeff Brown -- Chief Executive Officer\n\nYep. So obviously, this year, we had -- our board approved a $2 billion buyback plan. We got through third quarter, have executed $1.6 billion. We have our or kind of our ongoing corporate 10b5-1 in place.\n\nSo we'll buy in the neighborhood, probably a $50 million-ish or so in the fourth quarter. And so they will get around $1.7 billion by the end of this year. I think as I'm sure you know and modeled, we had no intentions of being out there next year with the $2 billion plan. It wasn't even a $1 billion plan.\n\nAnd so our natural expectations were for buybacks to be coming down. I think we'll still be active. Obviously, SCB is going to influence that to some degree. We're still carrying plenty of excess capital relative to our targets.\n\nAnd so we will still be very prudent and efficient in buyback. But it's not going to be, Sanjay, the neighborhood of $1.6 billion, $1.7 billion like we did this year. I'm not even sure it will be half of that But one page, I love probably more or one chart that I love probably more than any in this deck is we have been aggressive buyers of our share from the time we IPO-ed at 484 million shares outstanding to now we're down to 300 million. That's been a very disciplined, efficient uses of capital.\n\nMaybe the flip side of that is, it's a lot easier to move a basis point or $0.01 in terms of EPS. You're down to like $4 million or $5 million, which is not a lot of room in terms of the income statement to move your EPS projections. So that's one of the factors we face. But we'll keep being disciplined deployers of capital, but don't expect a magnitude like you saw this year or the past couple of years, really.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nYes. Appreciate it.\n\nJeff Brown -- Chief Executive Officer\n\nYou got it. Thanks, Sanjay.\n\nSean Leary -- Head of Investor Relations\n\nThank you, Sanjay. Thank you, J.B. Showing a little past the hour here. That's all the time we have for today.\n\nIf you have any additional questions, as always, please feel free to reach out to Investor Relations. Thank you for joining us.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSean Leary -- Head of Investor Relations\n\nJeff Brown -- Chief Executive Officer\n\nJenn LaClair -- Chief Financial Officer\n\nBrad Brown -- Interim Chief Financial Officer\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nMore ALLY analysis\n\nAll earnings call transcripts"
}