{
  "companyName": "Zoom Video Communications",
  "companyTicker": "ZM",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/zoom-video-communications-zm-q2-2023-earnings-call/",
  "content": "Zoom Video Communications (ZM -0.38%)\nQ2 2023 Earnings Call\nAug 22, 2022, 5:00 p.m. ET\n\nOperator\n\nWell, hello, everyone, and welcome to Zoom's Q2 FY '23 earnings release webinar. As a reminder, today's webinar is being recorded. And now, I will hand things over to Tom McCallum, head of investor relations. Tom, over to you.\n\nTom McCallum -- Head of Investor Relations\n\nThank you, Kelcey, and hello, everyone. Welcome to Zoom's earnings webinar for the second quarter of fiscal '23. I'm joined today by Zoom's founder and CEO, Eric Yuan; Zoom's CFO, Kelly Steckelberg; and we are also pleased to have our new president, Greg Tomb, join us for today's call. Our earnings press release was issued today after the market closed and may be downloaded from the Investor Relations page at investors.zoom.com.\n\nAlso on this page, you'll be able to find a copy of today's prepared remarks and a slide deck with financial highlights, that along with our earnings release, include a reconciliation of GAAP to non-GAAP financial results. During this call, we will make forward-looking statements, including statements regarding our financial outlook for the third quarter and full fiscal year 2023. Our expectations regarding financial and business trends, impacts from macroeconomic developments, the Russia-Ukraine war, our market position, opportunities, growth strategy and business aspirations and product initiatives and the expected benefits of such initiatives. These statements are only predictions that are based on what we believe today, and actual results may differ materially.\n\nThese forward-looking statements are subject to the risks and other factors that could affect our performance and financial results, which we discuss in detail in our filings with the SEC, including our annual report on Form 10-K and our quarterly reports on Form 10-Q. Zoom assumes no obligation to update any of these forward-looking statements we may make on today's webinar. And with that, let me turn things over to Eric.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nHey. Thank you, Tom, and thank you, everyone, for joining us today. I'm on the road now, and my Internet access is limited. I will hand my remarks to Kelly and Greg and then join you all for the Q&A portion.\n\nThank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nThank you, Eric, and thank you, everyone, for joining us today. Let me start with what's on everyone's mind, the macro environment. Zoom is not immune to the global downturn, but the situation is more complex than meets the eye. Our Enterprise business continued to post strong growth, which we believe is because cloud migration and digital transformation continue to be a priority even when and perhaps especially when the economy slows.\n\nThe headwinds we saw mainly relate to the strengthening dollar, new Online subscriptions and to a lesser extent, bookings linearity. We have implemented initiatives focused on driving new Online subscriptions, which have shown early promise, but were not enough to overcome the macro dynamics in the quarter. We believe Zoom remains well-positioned in this environment as customers look to increase productivity and collaboration while moving away from expensive legacy vendors. Our products are designed to drive efficiency and cost savings within organizations and are loved by both their employees and their customers.\n\nIn addition, we have strong margins and cash flows, as well as a large cash balance. Even still, we are taking a prudent and cautious approach in this environment, with focused investments and hiring to drive innovation and customer happiness. Our platform strategy is playing out very well, and Zoom Rooms and Zoom Phone are critical components of that strategy. In fact, Zoom Phone was a real star in Q2, hitting several milestones.\n\nThe number of customers, with 10,000 or more paid seats, increased 112% year over year. In addition, we broke our record for the largest Zoom Phone deal twice in the quarter, first with a global retailer and then with a global bank, both with more than 125,000 seats. Deals like these led Zoom Phone to post a record quarter and surpass 4 million seats in August. We are also seeing early traction for Zoom Contact Center and Zoom IQ for Sales.\n\nZoom Contact Center is only six months old, but has already had deal sizes reach seats that we did not expect until its second year. And customers value the user-friendly interface, efficiency gains and savings they see in shifting to our modern, cloud-based, AI-driven contact center solution. We are proud of the team that drove these results, and I'm thrilled to have Greg with us today. Greg joined last quarter as our new President, leading our go-to-market teams and the office of the global CIO.\n\nHe brings a wealth of leadership experience, scaling bellwether Internet and enterprise companies. Greg, welcome to our call today.\n\nGreg Tomb -- President\n\nWell, thank you, Kelly, and I'm very happy to join today.\n\nKelly Steckelberg -- Chief Financial Officer\n\nWe would love to have you introduce some customer wins for the quarter.\n\nGreg Tomb -- President\n\nAbsolutely, Kelly. Well, hello, everyone. Very nice to meet all of you. I wish it was in person.\n\nWe actually did have an exceptional sales quarter in the Enterprise market, and I'll let Kelly give you more details in a minute. We had a number of great new wins, including one of the largest U.S. healthcare providers out there. I can't give you their name yet, we will in the future, but they did choose Zoom Meetings and Zoom Phone to provide telehealth services to their broad number of caregivers and patients.\n\nI mean they were just really impressed with Zoom's strong integration between video and voice, to support 40,000-plus employees and their external community, for a wide variety of telehealth needs. I also want to thank UCLA. And you may know this or may not, but they were recognized by U.S. News & World Report as the No.\n\n1 public university in the U.S. And I want to thank them because they expanded their relationship with Zoom by adding 15,000 Zoom Phone licenses. And this large investment will accelerate their journey to the cloud and will offer them the benefits of truly having a unified communications platform. The next company I want to thank is Warner Bros.\n\nDiscovery, a premier global media entertainment company. I want to thank them for partnering with Zoom on its global communications needs. Our partnership actually began before the merger with Discovery and really kicked into gear once these two iconic brands merged. And they have chosen to expand their meetings and phone deployment, and we're really excited to deliver for them a full integrated suite of communication services.\n\nNext, I would like to thank Ancestry. And you probably know Ancestry as the global leader when it comes to family history. I want to thank them for also expanding their relationship with Zoom, the strong customer relationship that we built during the original Zoom Meetings deployment. And they also had a successful partnership with Solvvy.\n\nIt allowed us to expand this to a complete platform. We included Zoom Phone. We have a scalable, now conversational AI-based chat system in place and self-service capabilities from Solvvy. And last, let me also thank Optiv, the cyber advisory and solutions leader.\n\nToday, they deliver strategic and technical expertise to nearly 6,000 companies across every major industry. Optiv started as a Zoom Meetings customer back in 2016, then they expanded to Zoom Phone last year, and they really appreciated how reliable and simple our integrated solutions work. And then this last quarter, in Q2, they decided to replace their legacy contact center with Zoom Contact Center. And it's more than 275 agents supporting roughly 90 workflows.\n\nAnd they were so impressed with our rapid product iteration, our road map for integrations with other SaaS tools, as well as the ability to greatly reduce costs. So again, I mean, thank you, UCLA; thank you, Warner Bros.; thank you, Ancestry; thank you, Optiv. And to all those customers that did business with us in Q2, we greatly appreciate it. And with that, Kelly, I'll pass it back to you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nThank you, Greg. Now let me turn to the quarter's results and guidance. In Q2, total revenue grew 8% year over year to $1.099 billion, approximately $16 million below the low end of our quarterly guidance. A stronger U.S.\n\ndollar, which had an impact of approximately $8 million, weaker new Online sales and to a lesser extent, back-end linearity in the quarter, were the biggest factors contributing to the miss. We recognize that the revenue results are disappointing and below our expectations as we navigate the current environment. It should be noted that while our Online business saw lower new subscriptions, Renewals in Online continued to improve. And as we just discussed, we have launched a number of initiatives to drive new Online subscriptions around local pricing, packaging and free-to-paid conversion.\n\nThe growth in revenue was primarily driven by strength in our enterprise business. Revenue from Enterprise customers grew 27% year over year and represented 54% of total revenue, up from 46% a year ago. We expect revenue from Enterprise customers to become an increasingly higher percentage of total revenue over time. From a product perspective, we had strong growth in Zoom Meetings and Zoom Phone, coupled with contributions from Zoom Rooms and other products.\n\nThe number of Enterprise customers grew 18% year over year to approximately 204,100. Our trailing 12-month net dollar expansion rate for Enterprise customers in Q2 came in at a healthy 120%. We saw a 37% year-over-year growth in the upmarket as we ended the quarter with 3,116 customers contributing more than $100,000 in trailing 12 months revenue. These customers represented 26% of revenue, up from 20% in Q2 of FY '22.\n\nAs the majority of our revenue has shifted back to the enterprise and we have moved beyond the pandemic buying patterns, we are returning to more normalized Enterprise sales cycles, with linearity weighted toward the back end of the quarter. This contributed to higher-than-expected deferred revenue in Q2. And as we believe this customer behavior will persist, we have factored it into our outlook. Our Americas and APAC revenue grew 12% and 10% year over year, respectively.\n\nEMEA continues to be impacted by the Russia-Ukraine war, the strengthening dollar and Online performance, which led to an 8% year-over-year revenue decline. Now turning to profitability. I will focus on our non-GAAP results, which exclude stock-based compensation expense and associated payroll taxes, acquisition-related expenses, net litigation settlements, net gains or losses on strategic investments, undistributed earnings attributable to participating securities and all tax effects resulting from non-GAAP adjustments. Non-GAAP gross margin in Q2 was 78.9%, an improvement from 76.2% in Q2 of last year and 78.6% last quarter.\n\nThe sequential improvement was mainly due to optimizing usage across the public cloud and our increasing number of co-located data centers. Given the improvements we are seeing so far this year, we expect gross margins to be approximately 78% for the remainder of the year, which is higher than our previous view. Research and development expense grew by 81% year over year to approximately $98 million driven by our focus on innovation. As a percentage of total revenue, R&D expense increased to 8.9% from 5.3% in Q2 of last year.\n\nOur expanding product portfolio reflects our ongoing investments in building out Zoom's platform and delivering on our customers' evolving needs. We plan to further invest in R&D to reach our long-term target of 10% to 12% of total revenue. Sales and marketing expense grew by 35% year over year to $286 million. This represented approximately 26% of total revenue, up from 20.7% in Q2 of last year.\n\nWe are committed to investing in growth areas, including sales capacity, channel partner enablement and product marketing. G&A expense grew by 2% to $90 million or approximately 8.2% of total revenue. Non-GAAP operating income expanded to $394 million, exceeding the high end of our guidance of $365 million as we continue to thoughtfully prioritize investments. This translates to a 35.8% non-GAAP operating margin for Q2 compared with 41.6% a year ago and 37.2% last quarter.\n\nNon-GAAP diluted earnings per share in Q2 was $1.05 on approximately 307 million weighted average shares outstanding. This result was $0.13 above the high end of our guidance. Turning to the balance sheet. Deferred revenue at the end of the period was $1.4 billion, up 19% year over year from $1.2 billion.\n\nThis result was meaningfully higher than what we previously forecasted due to the strong Enterprise bookings, which were back end-weighted in the quarter. Looking at both our billed and unbilled contracts, our RPO totaled approximately $3.2 billion, up 37% year over year from $2.3 billion. We expect to recognize approximately 61% of the total RPO as revenue over the next 12 months as compared to 69% in Q2 of last year, reflecting a shift toward longer-term plans. As a reminder, our seasonality of renewals is front end-loaded and moderates over the rest of the year, reflecting the sequentially smaller renewal base.\n\nAs such, we expect Q3 deferred revenue to grow at approximately 13% to 14% year over year. We ended the quarter with approximately $5.5 billion in cash, cash equivalents and marketable securities, excluding restricted cash. We have purchased $426 million of stock, representing 4.1 million shares over the last two quarters as part of our $1 billion repurchase program. We had operating cash flow in the quarter of $257 million, as compared to $468 million in Q2 of last year.\n\nAdjusted free cash flow was $222 million, as compared to $455 million in Q2 of last year. Our margins for operating cash flow and adjusted free cash flow were 23.4% and 20.2%, respectively. As previously discussed, these metrics include a large cash outflow from an increase in cash taxes starting in Q2. As we update our full year outlook for the P&L and take into account the lower tax deductions for stock-based compensation caused by the lower stock price, we would expect adjusted free cash flow to be between $1 billion to $1.15 billion.\n\nNow turning to guidance. This outlook is consistent with what we are observing in the market today. Specifically, it assumes that our Enterprise business will grow in the low to mid-20s, while our Online business will decline 7% to 8% for the year as compared to the previously provided flat outlook. For the third quarter of FY '23, we expect revenue to be in the range of $1.095 billion to $1.1 billion.\n\nWe expect non-GAAP operating income to be in the range of $325 million to $330 million. Our outlook for non-GAAP earnings per share is $0.82 to $0.83 based on approximately 306 million shares outstanding. For the full year of FY '23, we now expect revenue to be in the range of $4.385 billion to $4.395 billion, which would represent approximately 7% year-over-year growth. At the midpoint, this represents a decrease of approximately $150 million as compared to our previous full year guidance.\n\nOf this decrease, approximately $35 million is due to the stronger dollar and $115 million is attributable to the broader macroeconomic environment. We now expect our non-GAAP operating income to be in the range of approximately $1.44 billion to $1.45 billion. We are still targeting a non-GAAP operating margin of approximately 33% as we have adjusted spending in the second half to focus on high ROI areas and have seen a modest benefit to expenses from FX. Our tax rate is expected to approximate the blended U.S.\n\nfederal and state rate. Our outlook for non-GAAP earnings per share is $3.66 to $3.69 based on approximately 307 million shares outstanding. Before opening up for Q&A, we are excited to share our Zoomtopia event with you. It is our premier user conference and will be run on Zoom Events.\n\nWe look forward to sharing our platform strategy, new innovations and customer testimonials. Please join us at Zoomtopia and our Investor Day on November 8. Zoom remains focused on building out our platform, leading in the hybrid work world, enhancing the customer experience and expanding into more and more business workflows. We will continue to make strategic moves to drive future growth as we navigate the current environment.\n\nThank you to the Zoom team, which has grown to 8,000 strong, our customers, our community and our investors. Kelcey, please queue up our first question.\n\nOperator\n\nI'll do. Thank you so much, Kelly. [Operator instructions] And our first question is going to come from Kash Rangan with Goldman Sachs. Kash, would you mind turning on your camera, please? Kash, would you like to ask a question today? You can go ahead and unmute yourself as well.\n\nAll right. Well, hearing nothing from Kash, we'll go ahead and we will move on. William, I'm sorry, I'm putting you on the spot here. I didn't let you know that you're next.\n\nBut William Power with Baird, if you'll go ahead and unmute and turn your camera on for us.\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nGreat. OK. Thanks for taking the question. Let me maybe start, Kelly.\n\nYou noted, I think, $115 million of macro impacts now in full year guidance. Maybe just help us unpack that a bit. How much of that relates to the Online pressure versus any changes you're seeing on the Enterprise side, whether it pertained to longer sales cycles? Any changes in seat counts, seat count pushback? And any other commentary you can provide there?\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. The majority of that is really coming from Online, William. So when you look at the difference in the guidance, and previously, we had expected Online to be approximately flat for the year, and now we're saying it's going to be in the range of 7% to 8% down, that's really where the majority of that is coming from. On a base of about $2 billion, that's where we're seeing it.\n\nWe continue to see strength in the Enterprise, which you can see as the increase in deferred. We are moving more toward back-end linearity, which had some impact on the revenue. But we continue to see great work done by our Enterprise team in getting those deals in just a little bit later in the quarter.\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nOK. No, that's helpful. Maybe if I can sneak one more in, I mean, just really strong Phone results, 125 -- 225,000 customers. Maybe just any color on kind of sales cycles for a deal of that size.\n\nWhen do we expect the revenue to start to flow through? And just any commentary maybe just on the pipeline of larger deals, whether that size or bigger deals generally?\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. Greg, do you want to talk about this?\n\nGreg Tomb -- President\n\nYeah, I can comment. I mean yes, I mean, Q2 was a pretty amazing quarter around Zoom Phone, extremely high win rates. And I think we exceeded the -- I think you mentioned this, Kelly, the 4 million user mark, right? So to do that in three years is just incredible. There is a -- we see a large number of our Enterprise customers today looking for ways to consolidate and have a more modern communication experience, and the fact that it's fully integrated with Video makes it a natural place to go.\n\nSo I think you're going to continue to see this really big uptick in our Enterprise as taking advantage of both Video and Phone together. So -- and our pipeline is showing that now.\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nThank you.\n\nGreg Tomb -- President\n\nYup.\n\nOperator\n\nMoving on to Meta Marshall with Morgan Stanley.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thanks. Maybe, Kelly, just starting with some of the initiatives that you mentioned, kind of taking on the SMB business and the actions that they're taking and just how that informs the 7% to 8% down during the year, what would they be without some of those initiatives? Just what's kind of informing that? And then maybe just if you could kind of speak to as you were making some of these opex decisions, on what is kind of high priority or high ROI, just kind of what is going into that decision-making process? Thanks.\n\nKelly Steckelberg -- Chief Financial Officer\n\nSo I think we touched on this. I'm going to start with your second question first. We touched on this in the Q1 call as well. We will continue as a company to focus on the areas that drive innovation.\n\nSo that really means R&D, as well as driving growth. So that's sales ops. And we have taken the tact for a while now of trying to be as efficient as we can around cost of goods sold and of course, G&A, to the extent that, of course, we always want to ensure the product and the platform is reliable and we're supporting our customers' needs, but trying to do that as efficiently as we can. And in fact, we indicated in the prepared remarks, we expect gross margins to come in a little bit higher than where we had previously at 78% for the rest of the year.\n\nAnd then in terms of Online, Wendy and her team have just done an amazing job of really thinking about how do we continue to improve the conversion rate of free-to-paid. They have done that through different initiatives, especially including pricing and packaging on a global basis. And we've seen retention rates continue to improve, as well as conversion rates. We just -- the sort of the challenge that we're seeing overall in the Online business is new customer additions.\n\nBut as they continue to focus on the initiatives, I'm sure that will improve our time as well.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nAnd Bernstein's Peter Weed has the next question.\n\nPeter Weed -- AllianceBernstein -- Analyst\n\nThank you. I think, in the past, you've given us some guidance to help us understand, on the net retention number in Enterprise, where some of that's coming from. Certainly, I think just a quick estimate suggests that you're seeing a continued tailing there. And in the past, I think you've been seeing better support on the larger customers relative to some of the smaller customers.\n\nHow should we be looking at that right now? Is that continuing to be the trend, where your larger, established customers are expanding their use across the platform? Are you seeing additional strength in the smaller customers that are coming up? And by the way, as a second part to this question, I think the implication that I see out of the numbers that you've posted is actually a bit of a reacceleration on new customers on the Enterprise side. And I would love to hear a little bit about how you're seeing that. And I know that you saw -- you said, hey, there's some linearity creating some challenges at the back end of the quarter, but to also kind of outperform on new customers there with some of those challenges is pretty nice. And I'm just trying to understand how much momentum you see in that going forward, in the face of some of these linearity issues.\n\nThank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nSure. So let me talk about the net dollar expansion, and then I'll let Greg or Eric talk about new customers. But we have said for a while, when you remember that the strategy for selling Zoom Phone and Zoom Rooms, Contact Center, etc., is to sell into our existing installed base, it's exactly as you said. We continue to see some of our largest customers continue to expand.\n\nSome of those Zoom Phone wins moved our customers. We -- when you go back and look at the customer counts of how many -- the growth rates that we saw and greater than 100,000 trailing 12 months, like it's really significant growth, which supports exactly what you're saying. And as a reminder, the net dollar expansion number now is focused on just the Enterprise portion of our business. It doesn't include the Online segment of the business.\n\nBut Greg or Eric, would either of you like to just touch on new customers for the quarter?\n\nEric Yuan -- Founder and Chief Executive Officer\n\nYeah, yeah. Sure, sure. Just [inaudible]. So Peter, you look at it at Q2, right, look at it -- our enterprise brand is doing very well.\n\nJust a very, very big healthcare organization, they deploy Zoom not only for Phone, but also for telemedicine as well. And we do see a lot of the new opportunities like that, just so, and so yes, doing extremely well in the -- on the enterprise front.\n\nGreg Tomb -- President\n\nYeah, I would add to what Eric and Kelly said, is that I think we'll continue to see that solid customer base in the enterprise expanding with us. I do think when you take a look at Online, it is a little mixed because we've got a lot of individual consumers that are down there that we're looking for ways to get them to move from free to paid. And what we're doing right now seems to be working, but we've got to keep at it and continue to run additional actions. But I think we've got a really great story that's coming together on the Enterprise.\n\nAnd from a sales perspective, we're trying to focus more and more in the Enterprise, on how we're going to market, how we're marketing these companies and the value proposition, again, around the whole platform. We really have a great platform story today that allows companies to have more of an integrated end-to-end communication, a modern communication platform, and they can get rid of a lot of point solutions that are -- they bought 20 years ago that are causing them a lot of pain and costing a lot of money. So I think we'll see this trend continue.\n\nPeter Weed -- AllianceBernstein -- Analyst\n\nThank you. And by the way, on the net retention piece, you talk about FX. How much of the drag on net retention because you're not providing a constant currency basis of it was due to the FX effect versus just being truly slower growth?\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. We're not going to break out FX down to that level of detail. But what I will say, if you step all the way back -- and we talked about this in the Q1 call as well. If you look at the impact that FX and the war in Europe is having on the year-over-year growth, it's 200 basis points.\n\nSo you can think about there's 2 full percentage points of impact coming from things that are kind of out of our control from both FX and the war on the total year-over-year growth rate.\n\nPeter Weed -- AllianceBernstein -- Analyst\n\nThank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah.\n\nOperator\n\n[Operator instructions] And we'll move on to Matt Stotler with William Blair.\n\nMatt Stotler -- William Blair and Company -- Analyst\n\nYeah. Hey, everybody. Thank you for taking the question. Maybe I'll just ask one, kind of doubling down on the macro question and conversation.\n\nI mean Kelly, you noted that you look at updated guidance and back out the impact from the Online business, back out the incremental FX impact versus prior guidance. It actually implies that you're expecting improvement in the Enterprise segment of the business on a like-for-like basis. And so I would just be interested to kind of get some deeper color on what you're seeing in terms of buying behavior in that segment of the market, right? I mean like you said, no one is immune from a slowdown in the macro. So are you seeing any sort of change in -- on the Enterprise side in customer behavior, spending patterns, anything like that that you can point to?\n\nKelly Steckelberg -- Chief Financial Officer\n\nWe definitely had a strong Q2 in terms of Enterprise sales, that's, you can see, reflected in the deferred. It just came later in the quarter, which is why it didn't really have impact on revenue within the quarter. But we continue to -- as all the things we've talked about, right, Zoom Phone having incredible strength and performance in the quarter; really already seeing momentum in Contact Center this early, six months in, we have some remarkable names that have signed up for Contact Center that we'll be excited to share with you at some point in the future. But already, the seat sizes that we're seeing for Contact Center, I think we would not have expected them to come for another 18 to 24 months yet.\n\nSo I think all of that shows that the platform transition is really working very, very well and that customers continue to love and see the efficiency they get from Zoom. And especially as they're thinking about -- maybe, Greg, you can talk about this, sort of what I heard from the sales team is these transition of deals, moving from the CIO to the CFO, and customers really being thoughtful about the cost there. And Zoom competes very well when it's competitively priced.\n\nGreg Tomb -- President\n\nYeah. I mean I would say it's -- I don't think it would be surprising to anybody to think that any of these large transactions that are going through approval aren't getting that extra set of eyes from a finance perspective. But what's interesting is that we're in a world where hybrid work is not going away, right? It actually complicates things, but having a platform that supports that is really important even at the CEO level, right, because it helps them with attrition issues. It helps them hire the best people.\n\nIt helps them have faster decisions, inclusive decisions. So having the right communication platform, no different than having the right decision around security or supply chain, these are just the top three or four that are sitting at the board and the CEO level. And so they do get approved, right, I mean, other than having a couple of sets of eyes and maybe come in after us for a little bigger discount here or there, which delayed it a week or two. I don't think we had anything major that slipped from quarter to quarter because people weren't going to spend the money.\n\nSo I mean, I was -- I mean, I've been here now for two months, and I was really -- I mean, I was personally really amazed by how strong the execution was by our sales team and how the deals that were committed flowed through the process.\n\nKelly Steckelberg -- Chief Financial Officer\n\nThe other thing that I would just highlight is we also continue to see strength in movement from monthly to annual contracts, in both our Online, as well as our Enterprise business. And as you know, that really helps from a retention perspective and also continues to build the deferred.\n\nMatt Stotler -- William Blair and Company -- Analyst\n\nGot it. Thanks again.\n\nGreg Tomb -- President\n\nThat's a good one.\n\nOperator\n\nThe next question will come from Matt VanVliet with BTIG.\n\nMatt VanVliet -- BTIG -- Analyst\n\nYeah, hi. Good afternoon. Thanks for taking the question. Maybe, Kelly, I wonder if you could expound on the last part, or maybe for Greg.\n\nIn terms of the sales and marketing investments, just maybe some of the areas that you're adding the most headcount, if you can talk to maybe the two or three areas that you're seeing the most headcount growth. And then from a sales efficiency standpoint, maybe for Greg, just what kind of processes are you bringing to the table, bringing in, maybe just some different mindsets around driving that sales efficiency as we look forward and become more Enterprise-focused? Thanks.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. Please, Greg, go ahead.\n\nGreg Tomb -- President\n\nOK. So on the first part of your question, repeat it again. I heard the sales efficiency. What was the first part?\n\nMatt VanVliet -- BTIG -- Analyst\n\nJust headcount, what areas are seeing the most growth in total sales headcount.\n\nGreg Tomb -- President\n\nYeah. No, no. That's a really good question, right? So one is we are increasing our focus up to the larger Enterprise side of the house, what we call majors and Enterprise, right? Because there's a lot of money there that we're just missing. We just don't have the coverage.\n\nSo you'll see a lot of our investment in marketing going there, right? You'll get a flavor for that at Zoomtopia as well when you take a look at the value propositions and how we're bringing our products to market. We've got a handful of new products that are just -- they're moving faster than we thought. You saw Zoom Phone. Kelly talked about Contact Center.\n\nWe've got another one, IQ for Sales, right? So they're all going to get extra attention. And then the other area is international, right? So international, I mean, we are -- we've got a lot of opportunity there. And it's untapped, and so that's getting a bigger attention from us as well. And then the last one I would mention is around our ecosystem, right? I mean I know we don't publish much around our ecosystem, but we've got a potential to grow our ecosystem, add partners and get that force multiplier effect out of our ecosystem.\n\nSo well, and the other one was on efficiency, right? Is that what you said, yeah?\n\nMatt VanVliet -- BTIG -- Analyst\n\nYes.\n\nGreg Tomb -- President\n\nSo when you take a look at efficiency, I think the -- I think we're a little too nice in how we sell our product from a discounting perspective, right? So I think we've got the ability to be a little smarter about how we price and discount our products. And then, again, it's making sure we're deploying our sales resources in the right place, right? So we don't need to be stuck in certain boundaries because that's how we set up, coming into the year, our structure and how we manage the sales organization. We can be much smarter now on how we deploy those resources to get the biggest return on those resources, which we are looking at right now. Oh, Eric, do you want to add to that at all? OK.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nNo, that's good. That's good. Thank you.\n\nOperator\n\nAll right. And moving on to Rishi Jaluria with RBC.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nAll right. Thank you, everyone, for taking my question. I just wanted to dial a little bit more into some of the wins that you've seen on the Contact Center side. Can you give us a little bit more color in terms of what types of customers these are? Was it a competitive process? I imagine you are unseating one of the legacy players.\n\nBut were there other CCaaS vendors in that discussion as well? Just any color you could give would be helpful. Thank you.\n\nGreg Tomb -- President\n\nDo you want to take that, Eric?\n\nEric Yuan -- Founder and Chief Executive Officer\n\nYeah, sure. Yeah, yeah. So yeah, thank you, Rishi. So -- and Kelly mentioned earlier, right, so -- and we are still probably in the early stage of the product development phase, but actually, it's more than what we expected because as Kelly mentioned earlier, some of the customers we thought probably they are going to deploy later on, but they didn't deploy and were very, very successful.\n\nAnd also, we also found some new use cases, like the internal IT support, right, and IT desk, right? And plus, some other, the customers who deployed Zoom Meetings and Zoom Phone, they look at our platform solutions, hey, you already have what [inaudible]. After they did a test, interestingly enough, they said, wow, it works so well. And it's also why also deploy Zoom Contact Center as well, with the seamless experience and [inaudible] in architecture. And also, we are going to be very aggressive and double down on that, from Zoom's perspective, because the product is ready.\n\nAnd it will take Zoom for our own support team, for example. We successfully managed to replace other Contact Center solutions with our own solution. The feedback is extremely positive. That's why it gives us more confidence, right, and further boosted the team confidence, right, to sell more in the second half and then also next fiscal year.\n\nGreg Tomb -- President\n\nYeah. I would add. I would say, in almost every one of them, we are replacing an older legacy solution, right, one that is costly and complex. And most of them, they can't change them and they can't -- they don't have the flexibility to enhance them, right? So we bring a more flexible, innovative solution that could be implemented very fast, right? It is integrated with our other solutions.\n\nIt is lower cost in many cases. And people have been very positively impressed with the solution. And like Kelly said, that the deals are bigger than we thought they were going to be. So yes, it's been a great two quarters now of bringing this new product to market, so we've got some pretty high hopes.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nWonderful. Thank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nThanks, Rishi.\n\nOperator\n\nOur next question will come from James Fish with Piper Sandler.\n\nJames Fish -- Piper Sandler -- Analyst\n\nHey, guys. Thanks for the question. It's fairly new, but you guys talked about the consolidation impact. What are you guys seeing with traction, specifically with Zoom One and pricing overall, especially relative to the early days of Zoom United? And Kelly, secondly, on guide.\n\nGiven you talked about the issue being more on the new subscription side for Online, are you still assuming monthly churn for Online actually gets better in the second half of the year like you were before?\n\nKelly Steckelberg -- Chief Financial Officer\n\nSo let's talk about that one first. So in terms of Online, we continue to see stability in the retention rates at that 16-month plus, and we'll show you that chart again when we get to Analyst Day in November. And we're at about 70% of our Online business now, has crossed over that 16-month mark. So it's bringing a lot of stability.\n\nWhat we had talked about previously was we expected to see an inflection point for Online in Q4. And given the reduction in the guide, it's more likely that's going to come in the first half of next year. And then in terms of the traction of Zoom One, so it's just one quarter in, but we have seen some great progress there. And I think it's serving the purpose that is needed.\n\nI mean, Greg, you can certainly comment on that. But it's really meant to ease the buying process for our largest Enterprise customers and package up the platform in a way for them that really makes sense to meet their needs.\n\nGreg Tomb -- President\n\nYeah. And I think it also, just from an awareness perspective, helps this extremely large customer base that we have understand that, look, we're way more than meetings. And it gives them a way to step in if they want to try Phone, for example, or to take advantage of our incredible chat functionality. I mean it's -- we have an incredible chat functionality, that probably, Eric, you can correct me if I'm wrong, like 70% of our customers don't even know we have.\n\nAnd then when they start using it, it gets very, very pervasive. So -- but it just gives us a way to show our customers that there's a lot more to this platform they can get value out of, and that's what we're seeing. So -- and it gives us, from a salesperson in a contractual standpoint, the ability to walk in and say, what does a better contractual relationship look like with Zoom, that can be stickier and longer-term. I don't know if you want to add to that, Eric.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nNo, it's great. Thank you, Greg. Yeah.\n\nOperator\n\nThank you. And we'll now hear from Matthew Niknam with Deutsche Bank. Matthew, go ahead.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nHi. Thanks for taking the question. So I have one about the industry. One of the bigger incumbents in the UC and CC space seems to be hitting some elevated financial difficulty.\n\nI'm just wondering what sort of opportunity that presents for you, whether it's organic or inorganic. And then just one follow-up on linearity. I think you had referenced maybe some back end-loaded sales in the quarter. Any more color you can give in terms of what drove this maybe relative to some of your initial expectations a couple of months ago? Thanks.\n\nKelly Steckelberg -- Chief Financial Officer\n\nSo I'll talk about the linearity first. So I think that it's just -- as we said in the prepared remarks, there's two things happening, right? More and more of our deals are now coming from the Enterprise, and then the majority of our revenue is coming there. And we have definitely now moved beyond the pandemic buying patterns. So our linearity had been much more moderated, I would say, over the last two and a half years as the Online business itself is more balanced within the quarter just by its nature.\n\nAnd then the Enterprise business, even itself, during the pandemic buying periods, it didn't follow the sort of normal deal cycles that we had seen. There were less proof of concepts. There were less review, honestly. And now, that has really all shifted back.\n\nAnd so it's just taken us, I think, a little bit of time to understand exactly where we were in that cycle. And we really saw it, that we're back to pre-pandemic linearity, which is very normal, right, for a SaaS business. It just hasn't been normal for us for the last few years.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nYeah. I can address that organic growth or maybe the M&A opportunity. I think, Matthew, look at the UC and CC, the customer experience is extremely important, right? And you look at how we build our Phone business, right, in less than three years, 4 million paid seats, right? And that's the reason why we know actually our team, we can build a better product. Why not? Can we double-down on that, right? It takes some time, but it's organic growth.\n\nIt can help us build a better product, ultimately can make our customers happier. I think we should continue that. Occasionally, for sure, some technology or some other areas, we also like to explore. Like recently, we acquired the Solvvy team.\n\nThis is a great asset to us. It will further help us in the Contact Center business. And also, we'll keep an eye on that as well, right? But ultimately, direction-wise, I think we have high confidence about our product team's execution. We think we can build a much better service.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nGreat. Thank you, both.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nThank you, Matthew.\n\nKelly Steckelberg -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nAnd we'll now hear from Alex Zukin with Wolfe Research.\n\nStrecker Backe -- Wolfe Research -- Analyst\n\nHi, this is Strecker on for Alex. Thanks for taking the question. Kelly, I would like to unpack the Enterprise segment a little bit more. So just to be clear, is the growth coming more from ramping reps or selling back into the base with IQ and filling a Contact Center? And then given you maintain the 20%-plus growth target, is it fair to -- for us to assume that you have not contemplated any lengthening of sales cycles or a worsening macro into this line? And then lastly, can you just frame how we should think about the sustainability of this growth beyond this year? Because the guidance does imply some deceleration while on easier comps in the back half.\n\nThank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. So as I said in the prepared remarks, we have assumed that the linearity that we saw occurring in Q2 is consistent for the rest of the year. So any of the back end-loaded, right, it will contribute less revenue to this year in each of the individual quarters, so we've assumed that's a similar trend for the rest of the year. In terms of future growth, we're not prepared to comment on that.\n\nWe'll do that when we give full year guidance later this year. And then the growth is, honestly, it's coming from both, as you heard earlier, continuing to expand into our customers, so expansion with Zoom Phone, Zoom IQ, Zoom Contact Center. Especially, also Zoom Rooms, had a fairly strong quarter as people are still thinking about the future of hybrid work and what does that mean for them. And we are continuing to see, at least I think in Q2, the percentage of ramped reps was higher than ramping reps, and that always is a positive contribution.\n\nStrecker Backe -- Wolfe Research -- Analyst\n\nThanks. And then just a quick follow-up. What have you seen in 3Q so far in terms of SMB and Enterprise bookings linearity?\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. It's so early in the quarter that we wouldn't comment on that yet.\n\nStrecker Backe -- Wolfe Research -- Analyst\n\nThank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYup.\n\nOperator\n\nCatharine Trebnick with MKM has the next question.\n\nCatharine Trebnick -- MKM Partners -- Analyst\n\nThank you for taking my question. You've talked quite a bit on Zoom Phone, Contact Center. Could you give us a little bit more detail around the Zoom Rooms? It seems like, in this hybrid environment, that would probably be getting more traction. And can you provide more color around the sales motion, if you ran any specials, and who you typically displace? Thank you.\n\nGreg Tomb -- President\n\nI'll let you have that one, Eric.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nYeah. So I think, Catharine, you're so right. I think, especially when it comes to hybrid office and hybrid work, Zoom Rooms is becoming more and more important, right? If you look at it, our Zoom functionality, the feature set innovation, I think are actually better than any other solutions out there. But however, in early this year, right, I mean, a lot of businesses, when they started exploring going back, they tried to look at their conf room setup and really wanted to make sure they have a new solution.\n\nThat's the reason why they picked it up, the Zoom Rooms. But also, over the past several months, and also, we do see -- and some companies also want to be conservative in what's happening in the -- on the economic front, right? And as they have a big office, campus, most employees probably still work remotely, and I would say it's kind of, sometimes, wow, it's a lot of the new Zoom Rooms, and sometimes, we see a slowdown. But overall, like direction-wise, and a lot of the companies, they would likely deploy the very innovative solution like Zoom Rooms and to truly improve their hybrid work experience.\n\nCatharine Trebnick -- MKM Partners -- Analyst\n\nAll right. Thank you.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nThank you.\n\nOperator\n\nMoving on to Siti Panigrahi with Mizuho.\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nHey, guys. Thanks for taking the question. Hey, Kelly, I just wanted to unpack a little bit on the Online segment. So what sort of trend are you seeing in the churn in the Online segment? And on the new customer acquisition, you made some changes on that one-on-one meetings now limiting to 40 minutes.\n\nIt's been now more than a month. So what sort of trends are you seeing that paid -- free-to-paid conversion as it -- did it fall below your expectation or what sort of trends are you seeing?\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. So in terms of churn, we have certainly seen that continue to improve and stabilize. As we said -- touched on this a little bit in the prepared remarks, it was a little bit better than expected, where we saw -- the impact you're seeing in the forward-looking guidance is the acquisition of new customers. And again, Wendy and her team are doing an amazing job on initiatives to improve that.\n\nThey just haven't had enough impact yet to offset what we're seeing in the quarter. The -- for example, what you're talking about, the 40-minute limit, really did help in the free-to-paid conversion, and that is considered as you look forward in the rest of our full year guidance, and as well as many of the other initiatives they're working on. But when you look at the -- especially in Europe, the impact we saw there, as well as combined with FX, and that is more concentrated -- having a more concentrated impact on Online than Enterprise, that's what is driving the reduction in the year-over-year guidance.\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nGreat. Thank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYup.\n\nOperator\n\nTyler Radke with Citi. Please go ahead with your question.\n\nTyler Radke -- Citi -- Analyst\n\nHey, thanks for taking the question. Maybe a couple for Greg. First of all, welcome aboard. I wanted to just kind of get your perspective on the sales organization and particularly, in the Enterprise, just kind of how you see the pricing dynamic.\n\nObviously, it's a competitive market. But on one hand, you are driving a lot of value for Enterprise customers. So do you think there's an opportunity for maybe higher-priced SKUs or an upsell motion? And then secondly, if you could just comment on the Enterprise customer net additions, which I think were down quite a bit sequentially and year over year, if there was a size mix shift driver there. Just any color would be helpful.\n\nThank you.\n\nGreg Tomb -- President\n\nOK. I mean I'll take the first one. And Kelly, I'll give you the second one on the details. I mean our number of customers did go up in the high end, so -- but I'll let you cover that.\n\nSo from a value perspective, I don't see us bringing out higher-level SKUs. What I do see us doing though is doing a much better job of describing and articulating the value proposition we bring to the customer and building business cases for the large enterprises so they can make a bigger purchase with us, so we don't have to discount as much. OK. I think we've got -- we're doing really great in the Enterprise, but I don't think we're doing really great at really selling high at that board level, CEO level, and being really smart about how we construct our business cases and value.\n\nAnd that's something that we're going to work to improve on, which I think will have a really big impact. So we've got some work to do with our sales force and from a training perspective. But I -- we just did a really big training exercise about two weeks ago and already started some of this. And it was received extremely well with our sales force.\n\nSo I mean, what we don't want to do is be like our competition and just try to win on giving big discounts and giving away free stuff. That's not what we're about.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. And then in terms of the growth of the Enterprise customer base, so as a reminder, the selling strategy for Zoom Phone, for Contact Center or Zoom IQ for Sales is to sell into the existing installed base. And so going forward, especially as you continue to see great progress in those products, you're going to see growth continuing to come from our existing installed base, with layering on of new customers on top of that. So you should not be surprised to see that customer count declining even while our revenue is growing.\n\nTyler Radke -- Citi -- Analyst\n\nThank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah.\n\nOperator\n\nKarl Keirstead with UBS has the next question.\n\nKarl Keirstead -- UBS -- Analyst\n\nOK. Great. Kelly, this one for you. So we, and I think a lot of investors on this call, anchor our valuation models for Zoom shares in your free cash flow numbers.\n\nSo free cash flow for 2Q, obviously, it came in a little bit light, and your guidance for the full year is several hundred million below, I think, the Street consensus. So it would be good to understand that a little bit more. So I guess, I wanted to ask you, if you could just pinpoint the factors, maybe weighing on cash flow. And then as everybody models out into next year, are there any key things to keep in mind? Are there any sort of one-time weights that might be alleviated next year? Thank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. Thank you for asking. So just as a quick reminder, we have actually never sort of officially guided toward free cash flow, but we understand this is very difficult to model, so we're trying to give more insights to it. I think the biggest change that we're trying to help everyone understand is that we have now fully utilized all of our NOLs, and we are a full cash taxpayer.\n\nAnd so that is having a large impact. And in fact, in Q2, the way it normally falls, right, is we actually paid two quarters' worth of taxes in one quarter because you pay like the Q1 estimated provision. You pay that in April, and so we had double the impact. So it's $200 million to $250 million worth of cash taxes that are now reflected in that.\n\nAnd the other thing to consider is there's one other impact that is driving up our cash tax rate, which is as our stock price has declined, we typically get a deep -- tax deduction for things called disqualifying disposition, which is when employees sell their stock. As the stock price has declined, you can imagine employees are holding on until they see potentially greater value in their stock. And so our disqualifying dispositions have dropped. At the same time, we've used up our NOLs, which means our tax rate has gone up and our cash taxes have gone up a little bit.\n\nSo we expect that to moderate as we regain value in the stock price over time.\n\nKarl Keirstead -- UBS -- Analyst\n\nOK. And then, Kelly, just in terms of next year, anything one-time about everything you just said? Or should we assume somewhat similar free cash flow margins next year? I don't want to corner you in the guidance, maybe just talk through variables.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. Well, I think the biggest -- I mean, we are going to be a cash taxpayer from now on, right? That is done. I think that the question is what happens with the disqualifying dispositions, which is a variable deduction, which will largely correlate likely with a potential increase in our stock price over time and how much employees are selling their stock.\n\nKarl Keirstead -- UBS -- Analyst\n\nGot it. Thank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nAll right. Thank you, Karl.\n\nOperator\n\nAnd rejoining us again is Kash Rangan with Goldman Sachs. Kash, please go ahead.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nHello, Kelly, Eric and Greg. Thank you for taking the question. If you look at the business, if you look at the core work minus the Phone, Call Center and the IQ for Sales, how is that part of the business trending? I mean are you at a point where, inclusive of the Online channel, things seem to be stabilizing? And how do we look at the mix of business, incoming business, over the intermediate term or maybe in the near term as the year unfolds between the core versus the Phone product and non-Video products? Thank you so much.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. I mean the Zoom Phone was certainly the star, if you will, of Q2, but we continue to see strength in our core Meetings platform. It had really strong growth in the period as well. And the majority of our business in Online is still core Meetings as well.\n\nSo the majority of that business is coming from core Meetings. And the work, all the work that that team is doing to continue to improve the free to convert paid -- the free-to-paid conversion will continue to drive more strength in the Meetings business as well.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nBut is there a way to delineate what the core is doing minus the Phone business? The Phone is a separate -- you have separate revenue pricing --\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. Kash, we don't break it out that way. What we've always said is, from a revenue perspective, we'll start to bring out -- break out these products when they hit their 10% of revenue. You can imagine, we're getting very close on Zoom Phone.\n\nSo I think in the next couple of quarters, you'll likely start to see that, which will give you some insight.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nGreat. Thank you so much.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. Thank you, Kash.\n\nOperator\n\nI'm moving on to Matthew Harrigan with Benchmark.\n\nMatthew Harrigan -- The Benchmark Company -- Analyst\n\nThank you. Could you be a little more expansive on the regions? [inaudible] very strong [inaudible] in APAC, up 10%, even for free-fall in the yen and some other Asian currencies being weak, do you have a reasonable buffer if Putin decides to turn off, toggle off Nord Stream 1 when we get to winter? And then lastly, I think you alluded a little -- touched on this a little bit earlier, but can you talk about any variation in the Online versus Enterprise activity by geography? Is it fairly different in Asia and Europe from the Americas? Thank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nOK. Let me take the last one first. So in terms of Online, Online certainly has been the most impacted in EMEA. So that's where -- when we talk about the guidance and some of the impacts it's having there, between FX in general and the Russia-Ukraine war, it's having much more of an impact on Online than it is in our Enterprise business.\n\nAnd then -- I'm sorry, I didn't quite catch the first part of your question.\n\nMatthew Harrigan -- The Benchmark Company -- Analyst\n\nOn APAC, you were up 10% in U.S. dollars in that region, even though currency is similar to the euro, I mean, with Japanese yen, where you are looking to have a very strong organic APAC result in certain markets.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. I mean, Greg, feel free to join in. But yes, we did see strength, especially in Japan. We had a very strong Q2 there.\n\nMatthew Harrigan -- The Benchmark Company -- Analyst\n\nGreat. Thank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah.\n\nOperator\n\nMoving on to Ryan Koontz with Needham.\n\nRyan Koontz -- Needham and Company -- Analyst\n\nHi. Thanks for the question. Just a follow-up on that last one about Europe and the kind of Online headwinds you're seeing there. Any geographic variance within Europe you can comment on? Is it continentwide? Is it more Eastern Europe-weighed? Any kind of color you can give us there would be helpful.\n\nThank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah, it's pretty pervasive, unfortunately, across the continent that we've seen it as you can tell based on the magnitude of the impact.\n\nRyan Koontz -- Needham and Company -- Analyst\n\nYup. All right. Thanks, Kelly.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. Yeah.\n\nOperator\n\nAnd our next question will come from Peter Levine with Evercore.\n\nPeter Levine -- Evercore ISI -- Analyst\n\nGreat. Thank you for squeezing me in here. Maybe Eric or Kelly, just to tack on another question with Contact Center, can you kind of explain to us where you are with the product today in terms of standing up against the Five9s, the Genesys, just the NICE of the world? And then second, if you look out over the next 12, 24 months, like what's going to differentiate Zoom Contact Center to kind of get customers to take a second look? And I know squeezing a third here. But Kelly, in your prior -- one of your prior questions, you mentioned the seat count was higher for Contact Center.\n\nJust curious, can you give us an average seat count for Contact Center today if you're willing to do that? Thank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nEric, do you want to take the first couple?\n\nEric Yuan -- Founder and Chief Executive Officer\n\nSure, sure. Absolutely. Peter, if you look at our Contact Center, right, as I mentioned earlier, right, so customer experience is extremely important, right? We built this new solution, not like any other solutions, no matter on-prem or the cloud is the solution, that -- those solutions were built many years ago, right? So this is more the interface, and we already solicited the customer feedback. We know what they really wanted to have.\n\nAnd also, a much better integration with our core UC product as well, like Zoom Phone. And quite often, when we talk about the Zoom Phone customer, they prefer, hey, you already have a Contact Center right now, right? And that's more like one aspect of the innovation. And also, look at some functionality feature set, right? You can talk on the Video. And also, more and more AI features as well and also the AI and Video and more in interface.\n\nAnd I think, plus, I think ultimately, we already won the customer trust. We know, and we listen to the customer feedback very carefully. Whenever they have some new feature requests or anything, we can innovate much faster. That's the reason why I think, customers, they are willing to try Zoom Contact Center, also I think deploy Zoom Contact Center.\n\nGreg Tomb -- President\n\nAnd then, Kelly, anything on the seat count?\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. What I would say is I think I'm just looking at a list of deals right here on the screen, and I think that we probably moved into at least the average seat size being in the triple digits. So we have our largest deal approaching four digits, I would say, and then probably on average is in that triple-digit size right now.\n\nPeter Levine -- Evercore ISI -- Analyst\n\nGreat. Thank you very much.\n\nGreg Tomb -- President\n\nI mean the one thing I would add, and it's probably in a lot of commentary now, but we'll be showcasing a lot of these customers at Zoomtopia, right? So we'll get -- you'll have a lot -- if you attend any of that or have anybody attend that or you hear what's coming out of it, you'll get a lot of Contact Center details.\n\nOperator\n\nThanks, Peter. And we'll move on to our next question, which will come from Michael Turrin with Wells Fargo Securities.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nHey. Thanks. Nice to see everyone. Appreciate you taking me on here and rolling into the next hour of the earnings call.\n\nKelly, you had some helpful quantifications on the major segments of the business and the drivers. On the Enterprise side, there's comments around more back end-weighted linearity. It sounds pretty clear you're assuming a similar shape hold. But in terms of quarterly versus rest of year, I know 4Q purchasing decision cycles in Enterprise are often significant.\n\nMaybe you can just add more around the visibility you have into the Enterprise segment, the renewal base there. I think investors would just greatly appreciate any commentary around the degrees of precision you have with Enterprise versus Online. Thank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nSure. So as a reminder, our upmarket teams, both majors and Enterprise that Greg talked about earlier, are on six-month quotas. So again, now that we're sort of beyond pandemic buying periods and we've returned to a more normalized seasonality, which sees peaks in bookings in Q2 and in Q4, so everybody should expect -- for example, we had this discussion in Q1 as well. Like we -- if you remember, our last record quarter for Zoom Phone was in Q4.\n\nAnd then we talked about it, that seat count was actually acquired during Q1 was down. And now, we're having another record in Q2. So everybody should expect that that's kind of the seasonality we're going to see as we have these reps all running to achieve their accelerators in Q2 and in Q4. And again, that's sort of just a typical Enterprise seasonality that we're going to see based on the way our comp lines are structured.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nOperator\n\nAll right. We have time for one additional question. Ryan MacWilliams with Barclays, please go ahead.\n\nRyan MacWilliams -- Barclays -- Analyst\n\nAnd Eric, I just want to say I saw the acquisition of your new Contact Center. Looks really interesting. So look and see more there. Kelly, two for you, just on Enterprise additions for the rest of this year.\n\nShould we think that the bulk of that is coming from Zoom Phone net seat adds? And then just as we think about maturing base of your existing Meetings customers, right, is that additive to growth at this point? Like do you have a sense of where the ZIP Code for that net expansion rate is?\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. So I think Enterprise additions, for the second half, will not be just Zoom Phone. I mean Zoom Phone is certainly very strong momentum that we are seeing, but we expect continued contribution from Zoom Rooms will certainly be strong. Contact Center, we expect to continue growing, as well as Zoom IQ.\n\nSo that all of those will continue to add to the overall growth in the Enterprise, along with we continue to see additions in Meetings as well. And then, yeah, so in a maturing basis, the Enterprise, Meetings, especially internationally, continues to grow. Like don't underestimate or don't assume that sort of the maturity level of Video adoption that we see here in the U.S. is at the same level on an international basis.\n\nAnd there are still significant opportunity outside of the U.S. to continue to grow our core Meetings platform.\n\nRyan MacWilliams -- Barclays -- Analyst\n\nAppreciate the color. Thanks.\n\nOperator\n\nWell, thank you to everyone who stayed on with us a little late today. And again, that does conclude our Q&A session for today. Kelly, I'll go ahead and turn it back to you for closing or additional remarks.\n\nKelly Steckelberg -- Chief Financial Officer\n\nThank you. Thank you so much, everyone, for joining us today and appreciating -- and we really appreciate all the support that you give us every day.\n\nOperator\n\nThank you so much, Kelly. And again, everyone, that does conclude today's earnings release. We always thank you all so much for your participation. Enjoy the rest of your day.\n\nWe'll see you next quarter.\n\nKelly Steckelberg -- Chief Financial Officer\n\nThank you, Kelcey.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTom McCallum -- Head of Investor Relations\n\nEric Yuan -- Founder and Chief Executive Officer\n\nKelly Steckelberg -- Chief Financial Officer\n\nGreg Tomb -- President\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nPeter Weed -- AllianceBernstein -- Analyst\n\nMatt Stotler -- William Blair and Company -- Analyst\n\nMatt VanVliet -- BTIG -- Analyst\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nJames Fish -- Piper Sandler -- Analyst\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nStrecker Backe -- Wolfe Research -- Analyst\n\nCatharine Trebnick -- MKM Partners -- Analyst\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nTyler Radke -- Citi -- Analyst\n\nKarl Keirstead -- UBS -- Analyst\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nMatthew Harrigan -- The Benchmark Company -- Analyst\n\nRyan Koontz -- Needham and Company -- Analyst\n\nPeter Levine -- Evercore ISI -- Analyst\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nRyan MacWilliams -- Barclays -- Analyst\n\nMore ZM analysis\n\nAll earnings call transcripts"
}