{
  "companyName": "Tilray, Inc.",
  "companyTicker": "TLRY",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/12/tilray-inc-tlry-q1-2023-earnings-call-transcript/",
  "content": "Tilray, Inc. (TLRY 0.37%)\nQ1 2023 Earnings Call\nOct 07, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, everyone. Thank you for joining us to discuss Tilray Brands, Inc. financial results for the fiscal year 2023 first quarter ended August 31st, 2022. [Operator instructions] Ms.\n\nNoorata, you may now begin the conference.\n\nBerrin Noorata -- Chief Corporate Affairs Officer\n\nThank you and good morning. By now, everyone should have access to the earnings release which is available on the Investors section of the Tilray Brands website at tilray.com and has been filed with the SEC and SEDAR. On today's call, please note that we will be referring to various non-GAAP financial measures which can provide useful information for investors. However, the presentation of this information is not intended to be considered in isolation or as a substitute for the financial information presented in accordance with GAAP.\n\nToday's earnings press release contains a reconciliation of each non-GAAP financial measure to the most comparable measure prepared in accordance with GAAP. In addition, we will be making numerous forward-looking statements during our remarks and in response to your questions. These statements are based on our current expectations and beliefs and involve known and unknown risks and uncertainties which may prove to be incorrect. Actual results could differ materially from those described in these forward-looking statements.\n\nThe text in our earnings press release issued today includes many of the risks and uncertainties associated with such forward-looking statements. Today, you'll hear from key members of our senior leadership team. Irwin Simon, chairman and chief executive officer Tilray Brands Inc.; Denise Faltischek, chief strategy officer and head of our international business, who will update us on global market development including the increasingly sanguine outlook of legalization across Europe; Blair MacNeil, president of our Canadian business, who will update us on the focused, impactful investments we are making to grow our leadership position in the Canadian market; and Carl Merton, chief financial officer, who will provide a financial review, including details on our strong balance sheet. And now, I'd like to turn the call over to Tilray Brands chairman and CEO, Irwin Simon.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nThank you, Berrin, and hello, everyone, and good morning. Thank you all for joining this morning for our fiscal year 2023 first quarter results. Our first quarter results reflect early tangible returns on what we discussed at length during our fiscal 2022 report, namely realigning the business around three priorities: pursuing our most profitable core business across Canada, Europe, and the U.S.; optimizing our global operations, while taking out over $100 million in cash cost savings; and strengthening our industry-leading balance sheet that affords us the stake opportunities for growth and expansion amid market challenges. These are differentiation foundation steps for profitable and sustainable growth of our worldwide cannabis CPG platform across medical, adult-use, wellness, and beverage alcohol.\n\nAnd while we certainly made great strides for the 2022 fiscal year, including growing distribution across our core businesses in Canada, the U.S., and internationally, our Q1 2023 results validate the approach and our overall execution. Our success is most evident in our significant work in reducing operational costs and strengthening our balance sheet, which has been our focus given the challenging macro environment. We know that an efficient and agile foundation will pay incredible as the cannabis industry matures. It's instructive to think about our efforts in these categories always complement and build upon the other.\n\nThe first and most impactful are the cost synergies from the Aphria-Tilray business combination. As announced during our fiscal year 2022, we've revised target of $100 million in annualized cash cost synergies. And through Q1, we've realized $95 million in cash cost of that $100 million goal. The remaining $5 million will be delivered by the end of fiscal 2023.\n\nIt's important to contextualize this achievement. $95 million in achieved cash cost synergies represents approximately 14% of the combined pro forma revenue of $682 million at the time of Aphria and Tilray transaction. With these specific synergies, I want to spotlight the G&A costs, which fell by nearly $9 million in Q1 compared to last year. Highlights here include large savings on office and general expenses.\n\nOur work is far from done in this respect, and we continue to target specific line items in our G&A that can improve margin and maximize efficient operations. Alongside the Aphria and Tilray synergies, we launched an additional $30 million of cost optimization plan for existing cannabis business in Q4 of last year, and to further solidify our status as the industry-leading low-cost producer. This involves identifying opportunities to leverage technology, supply chain procurement, and packaging efficiencies while driving operational efficiencies and significant savings. As of the end of the first quarter, we've achieved $13 million in savings on an annualized run rate basis related to this next-level cost reduction plan.\n\nWhen complete, these aggressive yet purposeful measures will have removed approximately $130 million in costs without compromising our ability to deliver growth and capture opportunities. Second, Tilray-HEXO strategic alliance that closed in July is expected to deliver $40 million to Tilray, including $31 million in revenue and $9 million in interest over the fiscal year. And finally, with the strength of our balance sheet with approximately $500 million in cash, $638 million in working capital, and over 70% of our debt set with fixed interest rates, Tilray Brands is now in the best position to capture leading market share across the global cannabis industry where opportunity abounds. The totality of this work is that we anticipate delivering significant growth in our adjusted EBITDA to between $70 million and $80 million in fiscal 2023, which at the high end of the range would amount to 67% growth compared to fiscal 2022.\n\nAnd as previously stated, we also forecast generating positive free cash flow across all our operating segments this year. Our cost structure initiatives and the strength of our balance sheet provides our key differentiators, to be sure, but the promise and potential of Tilray Brands is also predicated on top-line opportunities and the specific purpose of our strategic plan, which we set in place in fiscal 2022. This involves seizing opportunities across both geographies and business lines specifically. In Europe, where I recently just spent some time with the team in Portugal and Germany, our opportunity is based upon an unrivaled platform, smart, disciplined and strategic planning and execution, and pan-European momentum toward adult-use legalization.\n\nThe European market, which is estimated to be worth as much as $37 billion by 2027, has already embraced a medical cannabis business and is nearing broad scale adult-use legalization. Germany in particular, is taking concrete steps toward adult-use legalization, with German lawmakers from the country recently toured Canada and California cannabis businesses to hear from provincial leaders, state officials, experts, and advocates about lessons learned from cannabis legalization. With two EU GMP certified operations positioned ideally in Portugal and Germany, Tilray is positioned for significant advantages as legalization spreads. In Canada with difficult trading conditions in a high-tax environment and putting pressures on many licensed producers, Tilray is uniquely positioned to thrive as the industry consolidates.\n\nAnd in the US, we've set the stage in the footprint for a broad set of cannabis focused CPG and craft beverage brands, and additional revenue in adult-use cannabis, pending federal legalization. While it seems elusive, we continue to see signs of progress. Just this week, of course, President Biden said he would pardon federal offenders for simple cannabis possession and asked for a review on marijuana's current status as a Schedule 1 controlled substance under U.S. law.\n\nIt is important to recognize these initiatives for what they are, relatively modest, but any sign of progress is important at this time. In the current environment if legalization was to occur, we believe we are best positioned given our strong balance sheet, our cultivation know-how, our CPG experience, our global footprint, and our existing investment in MedMen. On that note, the biggest component of our craft beverage business, SweetWater is available in 42 states across the U.S., including most recently in California, which is the number one beer market in the U.S. The brand also operates a 32,000 square foot production facility and taproom in Fort Collins, Colorado, and a taproom at the Denver International Airport.\n\nStop by on your way through Denver. SweetWater's West Coast presence and brand awareness remains in nascent stages but we are confident that our work with the nation's largest beer distributor, Reyes, will yield tangible results. Their network marketing acumen and deep relationships throughout the region will ensure broad availability at restaurants, bars, supermarket chains, liquor stores, and other retail outlets. On a go-forward plan for Sweetwater, it includes launching innovative products, new spirit bases ready-to-drink beverages, expanding our presence in Canada and other international markets, improving product utilization, and evaluating strategic acquisitions.\n\nIn the meantime, we're also pleased with what we're seeing with our iconic West Coast brands, Green Flash, and Alpine, which have also added and brought new distribution across the U.S. Ahead of football season, Breckenridge Distillery, which is one of the most highly awarded craft bourbons in the U.S., launched two new limited editions, Mile High Bourbon Blends as the official bourbon of the Denver Broncos. These blends pay homage to the Broncos Mile High era and include the team's classic 1962 logo on their label. This collaboration is now in its second year and is one that bourbon consumers love.\n\nLast month, we renewed and expanded distribution agreement with Republic National Distributing Company that provides Breckenridge with direct access to our expansive distribution network on and off-premise retailers and customers across the U.S. in 38 states and the District of Columbia. This opens new doors for Breckenridge and gives us full access to their premier distribution network, setting a new stage for accelerated brand growth. Finally, turning to our wellness business, Manitoba Harvest is the world's leader in hemp-based foods with production distribution across 17,000 North American supermarkets, 50% share in hemp seeds, and a presence in 15 established international markets.\n\nOur go-forward strategy on this evitable scale and consumers' interest in hemp production align with plant-based low-carbon keto diets. In the near term, we are launching culinary oils plant-based protein blends with hemp and pea protein, along with a snack bar and other product extensions with super seeds. We further plan to enter new international markets later this year with Manitoba Harvest. We also recently signed a distribution agreement with Southern Glazer, the leading distributor of beverage alcohol and CBD beverages in the U.S.\n\nto serve as the exclusive distribution partner for Tilray Wellness CBD beverage portfolio across 13 states in the U.S. with additional opportunity to scale nationwide. This strategic agreement allows Tilray brands to launch a wanted U.S. CBD beverage portfolio within familiar retail channels such as independent national grocery chains, convenience stores, local bars, restaurants, and gas stations.\n\nBeyond CBD beverages, we intend to grow our U.S. Tilray Wellness business into CBD personal care products in related adjacencies. And upon federal legalization in the U.S., we will have a clear advantage to lead the U.S. market with strategic infrastructure and operations in place to parlay into the THC-based product as well.\n\nWith that, we'll now hear from Denise what's happening in Europe. Denise?\n\nDenise Faltischek -- President, International Business and Chief Strategy Officer\n\nThank you, Irwin, and good morning, everyone. Internationally and particularly in Europe, we are seeing more progressive cannabis legislation being introduced across the continent and around the world, reflecting a positive shift in attitude and acceptance of medical cannabis as treatment for numerous conditions as well as the legalization of cannabis for adult use. We are well-positioned and well-resourced to capture this wave of change that will yield considerable economic growth for our industry and for Tilray brands. Despite the current economic environment in Europe today, the war in Ukraine, and its impact on inflation and rising energy prices, our medical cannabis business performed well in the quarter.\n\nOur international medical cannabis business was up 2% versus the prior-year period and was up 16% after removing the impact of foreign exchange. Consistent with our approach across our other businesses, we are relentlessly focused on our cost structure. At the same time, we have been focused on continuously improving the quality and consistency of our medical cannabis products in order to fulfill our commitment to supply our patients with high quality, safe, and consistent products. As Irwin noted, Germany remains the largest medical cannabis market in Europe and emerges as one of the largest adult-use markets upon legalization.\n\nWe are already the market leader in medical cannabis, leading both the whole flower and extract product categories in Germany. Based on Insight Health sales data, we have approximately a 20% market share across our flower, extracts, and dronabinol products. In Germany, our revenue was up 22% versus the prior-year period. Today, we have the leading and broadest portfolio of medical cannabis whole flower with one of the most recognized brands in the German market.\n\nFurther, we have maintained our premium pricing position. As of today, we sell approximately 85% of our whole flower medical cannabis products directly to pharmacies. This, combined with our end-to-end EU GMP supply chain, uniquely primes Tilray brands for the recreational market, where we believe we can seize a sizable portion by exponentially ramping up capacity with two state-of-the-art EU GMP facilities in Portugal and Germany. Our ability to leverage these existing assets to meet the demand for medical and adult-use cannabis is a distinct competitive advantage.\n\nA draft bill on German adult-use cannabis is slated to be published in late fall and the first commercial sales are likely to commence in the beginning of calendar 2024. In Portugal, we continue to have the only registered medical cannabis product with our T18 whole flower. In the quarter, our revenue in Portugal was up 89% versus the prior-year period. In the U.K., the market remains relatively small private payer market, but patient numbers continue to grow.\n\nAnd we remain focused on reaching as many patient segments as possible with a broad portfolio of high-quality whole flower products. In Italy, we were approved by the Italian Ministry of Health to import and distribute certain medical cannabis extracts aimed at compounding use in the country. In Ireland, we have recently reinstated a commercial presence in Ireland and are pleased to have made our medical cannabis products available to patients there. We have one of only a handful of products that have been approved by the Irish government as part of the medical cannabis access program and are pleased to have received reimbursement approval, which ensures our products are made even more accessible to Irish patients.\n\nIn Poland, we were approved for a pharmaceutical distribution of both Tilray branded and unbranded medical cannabis products, and we have concluded our first shipment to Poland after the quarter-end. In Switzerland, the government lifted a ban on cannabis for medical use in August, facilitating access for use by patients who no longer have to seek exceptional permission from the health ministry and the first sales pursuant to an experiment for adult-use are imminent. In Israel, we continue to remain less than bullish because of the large oversupply caused by Canadian LPs. We are seeing patient numbers stagnating, sales declining and a lot of price discounting with special deals.\n\nWe are, therefore, continuing our pause in determining what is the right strategy for that market. Finally, in Australia, our medical cannabis business continues to perform well. Net revenues in Q1 increased 28% over the previous quarter. In addition, our business is well-positioned in Australia as we are already compliant with the EU GMP regulations that take effect next June and are viewed as a trusted cannabis partner with a complete range of medical cannabis whole flower and extracts to meet consumer needs.\n\nWe also recently received approval and verification from the Natural Health Science Foundation of our flagship product, Tilray Purified Oral Solution CBD100 to be used in clinical trials in Australia and New Zealand. The sum total here is that across Europe and around the world, we have tremendous opportunity and the strategy, assets, and resources to seize it. It's an exciting time. With that, I'll now turn the call over to Blair MacNeil, president of our Canadian business.\n\nBlair?\n\nBlair MacNeil -- President, Canadian Business\n\nThank you, Denise, and hello, everyone. The first quarter of FY23 represented a significant momentum change for Tilray Brands Canada. We grew our No. 1 market share position nationally by eight basis points to 8.5% for the quarter.\n\nThis leads No. 2 HEXO by 54 basis points and No. 3 Organigram by 196 basis points. A reminder, this is using Hifyre for all markets except for Quebec, where we utilize Weedcrawler for a more accurate reflection of the market.\n\nWe also grew our revenue 23% versus Q4 FY22 and 4% if you exclude HEXO revenue. Although positive, our revenue was muted by approximately $2.5 million in USD due to the cyber attack in Ontario and strikes in BC and Quebec. Canadian cannabis revenue would have been 6% higher when accounting for these events. Finally, we achieved 53% of our full year cost savings, targeting Q1, lowering our labor cost per gram by an incredible 43%.\n\nYou will recall, we established our beta program midway through FY22 with a pipeline of 46 new genetics. In Q1, strains from this program allowed us to grow our flower category 2.7% faster than the market. Good supply in Monkey Butter and Sweet Berry Kush hit limited markets with great success. Delivering 5% of our net sales and delivering almost two times the sales of Jean Guy, our most popular strain.\n\nAdditionally, our genetics delivered 3.5 times the average market dried flower innovation sales volume. We have four additional genetics entering the medical market in Q2 and recreational market in Q3. This helped good supply become the number one brand nationally in September for the first time since July of 2021. Over the past year, we have allocated significant resources into being a consumer first commercial organization.\n\nThis includes our structure, data intelligence, and market research investments. Although early, our investments are starting to pay off. In Q1, 7.5% of our sales came from innovation. This is considerably better than Q4 FY22, and we expect it will continue to grow in future quarters.\n\nLong term, we expect this to lead to stickier innovation, which resonates with consumers. Market-leading coverage has been a hallmark of Tilray in Canada. As store count continues to grow beyond 3,200 stores, we believe this competitive advantage also grows. Through Q1, we conducted 8,247 sales calls and 2,027 product knowledge sessions with budtenders.\n\nThis resulted in a market-leading 14,132 new points of distribution. It also means innovation gets the consumer trial needed for repeat sales. Recently, we had our entire Great North team together with our sales and marketing leaders from Tilray for two days. This allowed us to show the Consumer First innovation plan and ensure they are ready to execute.\n\nWe have also invested in data for our medical channel, both in consumer insights and in consumer feedback mechanism to improve our product portfolio. For our patient community, we launched CannaPoints, a new program designed to support patients through their medical cannabis journey. As a complement to physician advice, Tilray and medical patients use CannaPoints to explore new offerings, learn more about strains, and record the effectiveness of their products. This app makes it easier for them to curate optimal, personal consumption schedules and tailor their own experiences.\n\nAs a result, we have broadened our offerings under the Tilray and Aphria brands to include a comprehensive range of THC and CBD products, which, in aggregate, have demonstrated effectiveness against a variety of medical conditions. Tilray checks all the boxes to be a leading, sustainable and agile license producer. Our low-cost cultivation in Leamington, premium cultivation of Broken Coast, state-of-the-art manufacturing facilities, partnership with HEXO, and our Avanti facility allowed Tilray to thrive and shape the future of the cannabis industry. Recently, the Health Canada Advisory Board recommended CBD products be permitted outside of cannabis dispensaries, an estimated $300 million opportunity.\n\nAvanti, owned by Tilray located in Brampton, has the facilities, licenses, people, and equipment in place now to fulfill GMP CBD products when they become available outside of dispensaries. It also allows us to produce cannabis health products 3.0 as the markets transition. Additionally, Avanti fulfills 80% of our testing needs within our current portfolio, contributing to our low-cost mindset. Finally, we have seen revenue growth, improvement in market share, and cost reduction continue through the month of September.\n\nI will now turn the call over to Carl Merton, our chief financial officer, to discuss financials in greater detail. Carl?\n\nCarl Merton -- Chief Financial Officer\n\nThank you, Blair. We place great emphasis on Tilray's Brands and are relentlessly focused on managing operational expenses, proving we have the right strategy in place This is especially important as we contend with changing market dynamics and more recently, inflationary challenges. Before I begin my review, let me remind everyone that we follow U.S. GAAP.\n\nOur financials are presented in U.S. dollars. And throughout our call today, we will reference results in accordance with GAAP as well as non-GAAP adjusted results. Our earnings press release contains a reconciliation of our reported results under GAAP to the non-GAAP measures identified during our remarks.\n\nLet's begin with our top line. Net revenue in Q1 was $153.2 million, which is roughly equivalent if compared to the prior quarter in Q4 fiscal 2022. But a 9% decline compared to the prior-year quarter of $168 million, which was largely due to brand and SKU rationalization as well as foreign currency rates. Our revenue, income, and adjusted EBITDA continued to be impacted by the ongoing strength of the U.S.\n\ndollar, particularly given our largest revenue sources currencies are the euro and the Canadian dollar. On a constant currency basis, our net revenue remained relatively flat at $166.5 million, with all of our distribution, international cannabis, and beverage alcohol businesses being up in their base currencies compared to the prior-year quarter. Reported gross profit was $48.6 million in Q1, a 5% decrease from $51 million in the prior-year quarter. Adjusted gross margin, however, increased 200 basis points to 32% from 30%.\n\nThe higher margin was made possible by our success in implementing our numerous cost-saving programs and the revenue associated with our HEXO transaction. While our net loss was $65.8 million in Q1, compared to a net loss of $34.6 million in the prior-year quarter, we are reporting both our second highest ever adjusted EBITDA and at $13.5 million and our 14th consecutive quarter of positive adjusted EBITDA, an unprecedented achievement in our industry. This is up 7% from the prior-year quarter of $12.7 million. It is worth calling out the meaningful headway we made in reducing operating expenses which decreased 42% or over $50 million from the same quarter in fiscal 2022.\n\nWhile the reduction in transaction costs year-over-year accounted for $37.2 million of the variance, general and administrative expenses decreased 18% to $40.5 million. This was made possible by the synergies previously discussed. In addition to the $100 million target in cost savings from the Aphria and Tilray transaction, we achieved $13 million of annualized run rate basis of our $30 million cost optimization plan. Of this, $2 million was recorded in cannabis cost of goods sold as well as our operating expenses during the period.\n\nAnd we reported $7.8 million of revenue and $1.2 million of interest income from our strategic alliance with HEXO. Noteworthy to our quarter, we recorded an $18.3 million gain in transaction costs on the purchase of the HEXO notes from HTI. As part of our issuance of 33.3 million shares to satisfy the purchase price of the notes, both upside and downside protection existed. And based on our stock price during the contract period, we received a cash payment from HDI subsequent to quarter-end of this amount.\n\nTurning now to our business segments, which I will review in greater detail. Revenue in our cannabis segment was $58.6 million, but on a constant currency basis, would have been $61.6 million. Gross cannabis revenue consisted of $6.5 million in Canadian medical cannabis revenue, $58.4 million in Canadian adult-use revenue, $10.4 million in international cannabis revenue, which is a 2% growth from the prior-year quarter of $10.2 million, and $17.1 million of excise tax, all for net cannabis revenue of $58.6 million. However, in comparison to the preceding quarter, net revenue increased 10% from $53.3 million.\n\nCanadian adult-use cannabis revenue was impacted by a number of factors, including price compression, challenges with provincial boards, including strikes in BC and Quebec as well as cyber attacks in Ontario. Both the BC and Ontario incidents caused provincial boards to close deliveries for approximately 10 business days. During that period, we were denied multiple delivery spot, impacting our revenue by approximately $2.5 million in the quarter. While the provincial boards did not open up additional delivery windows to make up for the shortfall, they did increase order sizes shortly thereafter to make up for demand.\n\nAs a result of our quarter-end being so close to these incidences, we were not able to make up for the lost revenue this quarter but anticipate making it up next quarter. Over the last year, shifting consumer demand impacted our flower products, particularly as it related to potencies and our strain rationalization that negatively impacted us in Q1 compared to the year-ago period. Despite the change in our demand over the longer period of the last year, our recent launch of numerous beta flower strains during the current period yielded an 11% increase in flower sales compared to our fiscal Q4 2022 period according to adjusted Hifyre data. International cannabis revenue increased 2% to $10.4 million from $10.2 million for the prior-year same period, but would have increased 16% and to $11.9 million on a constant currency basis, despite ongoing global conflicts as well as the overall economy in Europe.\n\nInternational cannabis continues gaining traction, and we are uniquely suited to capitalize on these opportunities given our infrastructure, which includes two EU GMP cultivation facilities within Europe, our distribution network, and commitment to product consistency, quality, and safety. In terms of profitability and margins, cannabis gross profit decreased 2% and to $29.7 million in Q1 from $30.3 million in the prior-year quarter, while the gross margin percentage increased 8% to 51% for the quarter. When normalized to remove the $7.8 million of HEXO revenue, gross margin was flat at 43%, despite the significant price compression experienced over the last year, a reflection of our status as a low-cost producer, along with our synergistic initiatives and focus on higher-margin sales. Q1 revenue for our distribution business, which is overwhelmingly CC Pharma, was $60.6 million, a 10% decline from the $67.2 million in the prior-year quarter, impacted by the strengthening of the U.S.\n\ndollar relative to the euro compared to the same period last year. In fact, revenue would have actually increased 5% to $70.6 million on a constant currency basis for an additional $10 million of revenue. Adjusted distribution gross profit decreased to $5.6 million in Q1 from $7.9 million in the prior-year quarter, while distribution gross margin declined to 9% from 12%. The decline was driven by product mix, where a change in consumer demand trended to lower-margin products over the last year.\n\nTurning to our beverage alcohol segment. We generated $20.7 million in net revenue in Q1, which was 34% higher than the prior-year quarter of $15.5 million. This was primarily due to our acquisition of Breckenridge last December. We remain bullish on expanding this segment over time as we leverage our increased distribution, particularly in California, regaining brand acceptance with Green Flash and Alpine while building brand acceptance for SweetWater and building out an extensive innovation pipeline and potentially pursue other acquisitions.\n\nAdjusted beverage alcohol gross profit increased 24% to $10.9 million in Q1 from $8.8 million in the prior-year quarter. As a result of the SweetWater Colorado expansion in the quarter, which is still in the early stages of operation and yet to be fully utilized, beverage alcohol gross margin decreased to 53% from 57% during this period. Finally, our wellness segment. Revenue contribution decreased 10% to $13.4 million from $14.9 million in Q1 last year.\n\nOn a constant currency basis, wellness revenue decreased only 8%. This decrease is a result of a one-off private label sale in the prior year that did not recur in the current quarter as well as a higher volume of distressed retailer sales which resulted in a higher volume of lower margin sales in the prior-year quarter compared to the current period. Adjusted wellness gross profit decreased 13% to $3.5 million in Q1 from $4 million in the prior-year quarter, while gross margin decreased only slightly to 26% from 27%, but decreased from 31% in the previous quarter. Impacting gross margin for the quarter was seed costs, which is the primary driver of the decreased gross margin from the previous quarter.\n\nWhile seed costs rose almost 30% for organic hemp seed and 50% for conventional hemp seed in Q1 2023, our negotiated price increases did not take effect until Q2. As a result, we will see the benefit of those pricing actions in the next quarter. Together, this demonstrates that we are effectively managing our costs. Turning to free cash flow and liquidity.\n\nFree cash flow improved to negative $47.8 million in Q1, an improvement from negative $101.8 million in Q1 last year. Traditionally, Q1 is a period where we experience a greater than normal amount of annual payments than the rest of our year, negatively impacting our free cash flow in this period. Despite the negative free cash flow in the current period, we are reiterating our previous guidance of being free cash flow positive across all our business segments for fiscal 2023. Our cash and cash equivalent balance as of August 31st was a healthy $490.6 million, a nearly $75 million increase from our fiscal year-end.\n\nOur working capital balance, which allows us to meet our operational and capital requirements, more than doubled to $637.6 million over that same time horizon. During the quarter, we completed our outstanding ATM program, issuing 32.5 million shares and raising net proceeds of $129.6 million. After quarter-end, we utilized some of our cash on hand to purchase $50 million of our Tilray 23 convertible notes for cancellation at a discount of $1 million and will save over $2.5 million in interest costs between now and their maturity date. The outstanding principal balance on these notes has now been paid down by $138 million since the transaction with Aphria and is down to under $140 million.\n\nFor fiscal 2023, we are reiterating our expectations of generating $70 million to $80 million of adjusted EBITDA, and as I just mentioned, to be free cash flow positive across all business segments for the year. This adjusted EBITDA range will be generated through the following means. First, we are strengthening our position from current levels as the Canadian market continues consolidating and less agile competitors contract. This will be accomplished by maintaining our leadership as a low-cost producer while offering high-quality strains and formats across our medical and adult-use portfolios, which are continuously being optimized for their respective markets.\n\nThe investments we make at the retail level, such as our budtenders outreach and physician relationships, leveraging our scaled low-cost production facilities, and our strategic alliance with HEXO. Second, internationally, we have a vast medical opportunity beginning with Germany in addition to other surrounding and emerging legal markets. We are already utilizing our expertise from Canada to support responsible regulations that will enable us to enter and build a presence in these medical markets when feasible. These regulations should also pave the way for eventual adult-use as well.\n\nThird, in the U.S., our foothold beverage alcohol and wellness brands are already strong, high-margin businesses contributing meaningfully to our overall revenue and adjusted EBITDA while diversifying our CPG portfolio. We look forward to U.S. federal legalization. And when that happens, these brands can be properly leveraged for cannabis.\n\nAs we build our multibillion-dollar portfolio of best-in-class medical, adult-use, wellness, and craft beverage brands, we will only pursue opportunities that provide us with the highest possible return and enable us to gain efficiencies through scale, integration, and partnerships. This is our road map to building sustainable shareholder value. And with that, I will conclude our prepared remarks and open the lines for questions from our covering analysts. Afterwards, we will take a few questions from our retail shareholders through the Say platform.\n\nOperator, what's the first question?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Vivien Azer with Cowen and Company. Please proceed with your question.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nHi. Good morning.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nVivien.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nSo, Irwin, I'd love to just start off by addressing the U.S. regulatory landscape. I really appreciated your prepared remarks, which were awfully clear that legalization remains elusive. I think we're very much aligned on that.\n\nAnd the Biden administration's announcement yesterday was symbolic, no treaty relief, no capital markets access. And while that might be disappointing to anyone who's involved in the U.S. cannabis industry, certainly, retail investors and some other industry watchers read this announcement, it actually could be good news for you. So it's realistically a narrow version of SAFE is the only viable catalyst, how do you guys continue to take advantage of kind of this period of uncertainty where there's no interstate commerce, you guys have placed your bet just continue to work on building that route-to-market infrastructure and just wait patiently, or are there other opportunities to continue to establish the business for readiness when that eventually happens?\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nSo excellent question. I think the big thing is what we saw, this was the first step that Biden administration has taken toward cannabis. And I think in regards to pardoning all those that have been convicted and the social effect of it is a great sign, and that it's on the agenda here and that he's asked from a health standpoint to look at it, from -- a standpoint there. Since the Biden administration has been in place, nothing has happened.\n\nSo that's the good news, Vivien. And I think the big thing, which I said in my remarks is this here. Our plan -- we have close to $0.5 billion of cash. So we have abilities to do acquisitions.\n\nWe have a strong business with lots of growth opportunities in Canada. We have a great infrastructure internationally in both, Portugal and Germany. And with the U.S. today, we've acquired businesses within the beer industry, the spirits industry and have a wellness business.\n\nSo from a U.S. standpoint, what we're going to continuously do is look at acquisitions in the consumer area with adjacency to cannabis. In regards to the SAFE Bank Act, depends what we can do. So we're one of the largest grower of cannabis in the world today.\n\nWe own multiple brands in Canada and Europe, and we own brands in the U.S. with adjacencies. And when we're able to do something and have a clearer picture on it, I think whether it's buying, merging, it gives us the opportunity to do that. So we have a good balance sheet.\n\nWe have good brands. We have lots of knowledge within this industry. And being one of the biggest out there gives us opportunistic ways to go about it. Just taking a guess and buying options and not knowing, and there's a lot of unknown out there.\n\nBut what I want to make sure is for our shareholders that we have a good vision to create the Tilray branded consumer packaged goods business with a focus on brands and focus on adjacencies, a focus on profitability from the standpoint that when cannabis does legalize in the U.S., we're ready to capitalize on them in so many different ways. And I think we're not one of the -- we're not an MSO that's locked into a multistate. We're not locked in. We can go and do something.\n\nWe don't have that flag in the ground that we ultimately got to figure out what's the right thing to do with the flag.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nYep. Absolutely. Lots of optionality for you guys. That's very helpful.\n\nThank you, Irwin. And then just to pivot to beverages, since you mentioned it, as my follow-up question, please. I think that asset is incredibly important. Obviously, we cover alcoholic beverages, and we know how good the growth is in that segment and bourbon in particular.\n\nWe haven't seen any signs of down trading yet, though, it is a question that I get consistently from institutional investors, in particular, given that we're starting to see more regular pricing emerge in the distilled spirits segment against a very inflationary backdrop. So two-part follow-up, please. Number one, have you guys seen any signs of down-trading in any of your alcohol assets? And then number two, how do you feel about the pricing backdrop? Because it does seem like most of your peers are really leaning into it. Thank you.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nSo we have not yet. And with that, we've just started with a new distribution RNDC, got some great plans as we come into the holiday season. If anything, what we are seeing, vodka, which is a cheaper product, we are seeing some good pickup in that volume. But listen, we're looking at it.\n\nWe're making sure in regards to the consumers trading down and buying other types of products, whether it's vodka, which is cheaper, we'll be ready for that. But so far, we have not seen anything. We've seen some good consumption within the beer business. We like that.\n\nWe see lots of opportunities in the beer business in regards to infused beers and you see a lot happening today with tequilas and rums and that -- with beer and that. So the big thing is within that industry, Vivien, we have the distribution network set up and with that, we think there's going to be also additional opportunities from acquisitions in that area for us. The other good thing that's happening, too, is the FDA has stepped away and will allow CBD products. And we're introducing a product called Happy Flower, which we'll start introducing.\n\nSo there's a lot of expansion within the category that we see.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nAbsolutely. Very helpful. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Andrew Carter with Stifel. Please proceed with your question.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nHey. Thanks. Good morning. And I think I want to take just a little bit of a different angle to kind of yesterday's news.\n\nI think, number one, you've built this platform to be low cost, serve all, but there's been the issue of fragmentation in Canada in rational activity. So what we did get -- we don't know what we're going to get from the U.S. ultimately, but what we did get yesterday was a surge in the sector. Does that change your view at all of Canada and maybe the necessary rationalization and how that may be prolonged? And I guess I want to add to that is what you -- is there is a lot of unknowns, but what you do know is you're trading higher.\n\nDoes it by any chance change your view that you would want to go -- that you will want to maybe double down on the investment in CPG versus cannabis, especially as cannabis MSO assets are rerating? Thanks.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nSo, Andrew, good morning. How are you? Listen, Canada, it's the only legal market of recreational cannabis really in the world today. We have incredible facility, incredible brands. It's about a $5 billion market today at retail, going to a $10 billion market.\n\nSo if anything, hey, we're going to do more in Canada. We're going to grow share. We're going to innovate products. Cannabis 2.0, whether it's edibles and drinks, and stay tuned for what we're looking at, and Blair talked about the Cannabis 3.0.\n\nSo we have a big focus on Canada. And with that, there's a lot we'll continue to learn in the Canadian market. The other thing, who knows, one day we have over 3 million square feet of grow, which I think you visited and some of the -- we grow some of the best and cheapest cannabis up there with some of the higher potency. Who knows that we can't export in the U.S.\n\none day and that opportunity there. So Canada for us from a recreational, from a medical, from a Cannabis 2.0 and Cannabis 3.0, we think we said there's an $800 million business with also $200 million in the consumer area to grow there. In regards to your other question, do we want to become a CPG company? In my prior life, myself and some of my team were part of Hain that we built the $3.5 billion consumer packaged goods business. And our medical wellness business has a lot of adjacency to cannabis.\n\nAnd we like the drinks business. We like the consumer packaged goods business. But what we're not going to do is just go out there and sit back and wait until the government makes decisions on which way they're going with cannabis. We want growth.\n\nWe've come out and said, hey, in regards to EBITDA, we'll be EBITDA positive, cash flow positive. We have a strong balance sheet. We're going to utilize that. So cannabis is a big part of our portfolio.\n\nBut also, Andrew, we're going to look at the consumer packaged goods area that has good growth categories that has good margins, but adjacencies at one time to the cannabis industry upon legalization.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nThanks. I'll pass it on.\n\nOperator\n\nThank you. Our next question comes from the line of Andrew Bond with Jefferies. Please proceed with your question.\n\nAndrew Bond -- Jefferies -- Analyst\n\nGood morning. This Andrew Bond on the line for Owen Bennett. Thanks for taking our question. Maybe shifting gears to recreational legalization in Germany.\n\nThere seems to be a view that the United Nations INCB regulations and prior rulings in EU courts might need to be addressed and could preclude Germany from legalizing. What's your most recent sense in Germany on the prospects for legalization? What are you hearing? Is this a material legal hurdle to overcome in your view? And then more broadly maybe until we ultimately see legalization recognizing you already have a favorable position in the Germany medical market, are there additional actions you can take or are strategically taking to be better positioned for when rec sales do ultimately launch? Thank you.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nSo number one, I'm going to let Denise answer that. But I think the big thing is this here. Medical cannabis is legal to Germany right now. In regards to the German government, they're spending a lot of time.\n\nThey visit California; they visit Canada in regards to how to do this. So yes, there's going to be hurdles with anything, lawsuits happen within between. But we are still very comfortable as German tenders have been put out there, which we won that cannabis will be legal within the German market. Denise, do you want to add anything to that?\n\nDenise Faltischek -- President, International Business and Chief Strategy Officer\n\nYes, sure. Thanks, Irwin. So in terms of legalization in Germany, we also basically are seeing a movement across all of Europe. And you might have saw that in September, there was a health regulators meeting for the EU 27 countries where there were discussions based around cannabis regulation.\n\nSo essentially, looking at it from an entire EU perspective, looking at the 27 countries working together in order to establish a collaborative effort on cannabis regulation. So this is even more than just a German issue where I think all of the EU is thinking about this and how to address it. The German regulators are very focused on how to overcome the UN convention. There's been a lot of different legal analysis, including how to address cannabis, whether it's classified as a food stuff or some other way in terms of the regulations dealing with that.\n\nSo there absolutely is work being done, and German regulators seem very focused. And as Irwin mentioned, they're taking great steps in terms of coming to the United States coming to Canada, trying to understand really how to build a framework that addresses both, health and safety as well as a commercialized market, which would be the first one in Europe. And then, in terms of your second question around how -- what are we doing? I think one of the things to recognize is the fact that Tilray is a company who has invested very much so into the European market in terms of both, our facility in Portugal as well as our facility in Germany. And we are one of only three facilities that exist today in Germany producing medical cannabis.\n\nThat facility can in fact be converted and or retooled to address the adult-use cannabis market and provide for that market very quickly. So we believe we're very well-positioned.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nAnd I think the most important thing, whether it's the U.S., whether it's Germany, whether it's Europe, voters want this. In Germany today, I think it's about 70% of voters there want cannabis legalized. In the U.S., over 60% want it legalized and 90% want medical. So again, it's what the voters want is what constituents want.\n\nThat's what the most important thing is. And I think what everybody is realizing, the tax dollars and the benefits from it that really will come. So that's what we see out there, both for Germany and the U.S.\n\nAndrew Bond -- Jefferies -- Analyst\n\nThanks, Irwin. Thanks, Denise. Appreciate your insights. I'll pass it on.\n\nOperator\n\nThank you. Our next question comes from the line of Aaron Grey with Alliance Global Partners. Please proceed with your question.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nHi. Good morning and thank you for the question. So I just want to go back toward your prepared remarks on Canada, specifically around strengthening your position. I believe you said some of the smaller -- potentially some stake out there.\n\nJust want to get some color on where you believe that stands today per some of the Hifyre data, September was the first month over past 12 or more where the top five cumulatively actually gained share and having lost share over the previous months. So do you feel like that was a clear kind of step change and that will continue? Do you feel like there's still some more share losses, competitive nature to go or that now we're at a point where some of the bigger players might start to gain share on more of a regular basis there? Thank you.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nSo number one, I think for the first time, we're getting a good clear look at Canada with COVID, with store closures, with only being able to walk up and order having vaccines to go in stores. So now we're really getting a good look at it. So that's number one. Number two, with all the price compression and consumers going to the illicit market, etc.\n\nSo I come back and look at Canada was in a major disarray. With that, and I'm going to let Blair jump in here for a second. I very much see that we have made tremendous headway in Canada in regards to the importance of potency, importance of strains. We at Tilray eliminated some brands.\n\nWe eliminated strains. So that affected in regards to our share out there. With that, I step back and I say this here, the Canadian market will consolidate the Canadian market will condense. And there will be about 800 LPs, a lot of LPs will go away.\n\nThe thing is -- also is the consumer today within Canada, cannabis has been legal now for approximately four years. They're educated today and what they want to buy. They're starting to understand brands. They're starting to understand pricing.\n\nThe same with the retail market. There's been a fall out of many retailers closing. So it's starting to mature from a market standpoint. It's the same thing with the government.\n\nI mean, an excise tax and what we're working on there. So you got to remember, Canada is only four years old. Now, we're starting to get some wind at our back instead of wind at our face. Blair, do you want to add anything to that?\n\nBlair MacNeil -- President, Canadian Business\n\nNo. I just think the one thing that Irwin said that's important for people to recognize is how early we are in this journey. And the industry just went through a lot of chaos, as Irwin mentioned. I think the big thing I would reiterate is our investment into data and into the consumer insights and we're using that to make all our decisions moving forward.\n\nSo we're very bullish on where we're going as an LP. We're very focused on being just an LP and not other things. And we're going to utilize that to win in the marketplace. So we're very comfortable with that.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nAnd the thing is we're investing in research. We're investing from a medical standpoint. We're investing in the next evolution of cannabis there. And I think that's what's important today.\n\nAnd we're seeing multiple change in flower versus pre-rolled versus edibles versus drinks. And listen, the Canadian market projected to be at $10 billion at retail. That's not anything that's small to look at. And it is the only country today where cannabis from adult-use is legalized out there.\n\nSo we're going to learn in Canada. We're going to grow in Canada, and we want to have the biggest share in Canada.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nAll right. Great. Thanks very much for the color and I'll go and jump back into the queue.\n\nOperator\n\nThank you. Our next question comes from the line of Tamy Chen with BMO Capital Markets. Please proceed with your question.\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nHi. Good morning. I just had one quick question. Just a follow-up on a previous one, just talking about the U.S.\n\nand SAFE Banking Act specifically. So, Irwin, it sounds like from your answer to that previous question that at this point you also are not sure exactly what a Safe passage might mean for your ability to go in the U.S. Could you remind me -- I think for you probably the biggest hurdle to clear would be where the stock exchanges like NYSE and NASDAQ stand with respect to plant touching U.S. cannabis businesses.\n\nSo could you just clarify if you think Safe passage that especially might trigger or allow you to go in the U.S., or really, you don't know if it will let you because you're more waiting for the stance of the stock exchanges? Thank you.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nSo number one, I think as I've said before, in regards to us selling only cannabis companies SAFE Bank is not going to do anything for us. But I'll tell you what I do believe is going to do, and it's interesting, all of a sudden, investors start to and institutional investors start to look at this industry now and start to look at how they invest in this year. And listen, you may get other cannabis companies with NASDAQ and New York Stock Exchange now that could list there, which there's more dollars out there for them to raise, but I think from a standpoint for Tilray today is this here. I mean, having institutional investors as a part of our ownership was something very important to us.\n\nBut -- and the opportunity for us to grow within other countries to be ready for the U.S. is something that we're going to continuously focus on. But it doesn't change anything for us that we can own U.S. assets.\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Pablo Zuanic with Cantor Fitzgerald. Please proceed with your question.\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nIrwin, I want to ask regarding a potential CPG partner. Obviously, Constellation Brands and Canopy Growth, Cronos, Altria, as the industry begins to scale and more markets legalize, do you think that that could give a strategic disadvantage for you not having a large CPG partner? How do you think about that?\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nSo I think, Pablo, it's here. Altria, yes, that's part of Cronos, and Constellation is with Canopy, and you can make your own decision what they've done for them and what they've not done for them. OK? Listen, I've been in the consumer packaged goods business for over 30 years. It gives us the opportunity to build correctly and do the right things and not be whether it's at the tobacco company or another alcohol company.\n\nSo we have optionality, and I think that's what's important out there. We're not forced into making decisions. We're not forced into something in a consumer area. What's good for our business, what's good for growth, what's good for consumers, and how can we make a difference and last but not least, how do we make money for our shareholders is the right thing for us to do.\n\nAnd that's what gives us optionality. And I think that's what's so important today because of changing trends, changing times, and changing geographies.\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nAnd just a quick follow-up. So I know you've said that there's a lot of unknowns in the U.S. and you don't want to do contingent eruption deals, understood. But you did MedMen.\n\nSo, why was that different? And could there be other similar MedMen type of deals that would make sense?\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nSo as I said before, and I'll say it again, I thought MedMen had a great brand, has great presence in different states within the U.S. And there's a lot we're learning in regards to consumer trends that we're taking back. We did one and what I've said is this here, I don't want to do another one until I know what we can do. So there was a lot of learning, a lot of intelligence, and we think MedMen has a lot of opportunities upon legalization.\n\nThat's why at the time we did that.\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nThank you.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Michael Lavery with Piper Sandler. Please proceed with your question.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nThank you. Good morning. I just wanted to come back to the market share. You've got some stabilization there, it looks like.\n\nAnd I just would love to understand what your expectations are for that going forward. And just specifically, what assumptions you've made for market share progressing in Canadian rec against that $70 million to $80 million EBITDA guidance?\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nSo from a standpoint, market share in Canada, I've said this here with our current business today, we want to be back in that double-digit area today. And that is focusing on the consumer, focusing on our brands, focusing on innovation. Listen, the consumer has come back and told us they want high potency in different strains, different products. They've come back and said what they want in regards to pre-rolls versus flower, what's infused, what's -- etc.\n\nSo you've got to listen to the consumer. It's very important in two provinces, be in Ontario, which are the biggest provinces within Canada of what the consumer is looking for in those markets, but working with all the other provinces. So innovation is key. New products are key, keep coming up with new products quickly.\n\nPricing is key from that standpoint. And I think the end of the day is which is really important for us. What's our name? Tilray brands, how we build brands in Canada. We're not out there just selling a pre-roll.\n\nWe're not out there just selling flower. We're not out there selling oil. What our brands stand for. And when a consumer goes in, they're going to buy our brands.\n\nBlair, anything you want to add to that?\n\nBlair MacNeil -- President, Canadian Business\n\nI think you covered it, Irwin.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nAnd just what share assumptions are reflected in your guidance?\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nOur share assumption is basically high single digits, low double digits in our guidance out there.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nOK. That's helpful. And just a follow-up on the cash flow guidance. I know you say it will be across all the businesses, which I assume is meant to be clear that it's not one carrying another and that it's broad.\n\nBut just to make sure I also understand is there a corporate piece or something that would not make that free cash flow positive at the total company level as well?\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nWell, corporate -- there's a corporate piece, too, and there's corporate investment, public company costs, there's insurance costs, there's capex costs in there. That's all a piece. It's a combined company. It's not just all the operating units of the company.\n\nIt's a combined company that's when we see our cash flow positive.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nAnd so yes, that's just what I'm trying to make sure I understand is it's across each business and at the total company level, you'll be --\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nYes, exactly. Exactly, exactly. Yes.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nAll right. Thanks a lot.\n\nOperator\n\nThank you. Our next question comes from the line Shaan Mir with Canaccord Genuity. Please proceed with your question.\n\nShaan Mir -- Canaccord Genuity -- Analyst\n\nGood morning and thank you for taking my questions and congrats on the quarter. Just one for me here. Sticking on the guidance here. So just looking at your adjusted EBITDA guidance at the low end, that'd be calling for a bit over a 30% increase from the Q1 run rate adjusted EBITDA.\n\nI just wanted to get a sense for the cadence of that adjusted EBITDA growth through the year. Is it more back-half weighted, or is this something that we should expect to see more step function growth through the quarters? And maybe any commentary in what segments you think will be driving that improvement?\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nSo I'm going to let Carl jump in for one second. But with any business, there's seasonality here. As we look at our spirits business, we look at our bourbon business, and we look at our growth within our Canadian cannabis business, it definitely is more back half. Carl?\n\nCarl Merton -- Chief Financial Officer\n\nParticularly Q4 inside of the beverage alcohol business, Q4 is -- those three months of our Q4 are the biggest shipping months for beer during the year as it relates to the load in for summer. So yes, there's -- you're going to see smaller step-ups in the next couple of quarters and then a bigger step up in Q4.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nAnd the next two -- second and third quarter are big Canadian cannabis quarters. So that's when we see and that's when our plans at around holidays and then around our January quarter there, that's when the big product lines and product launches and that come out. And that's -- we have a lot of -- what's the total number of new products that we are launching. Over 100 SKUs.\n\nOver 100 SKUs and there will start to roll out now over the next six months. And one of the things Blair mentioned also was with Alberta being on strike or BC being on strike and our issue in Ontario, delayed shipments, which you'll see those pick up in this quarter and next quarter.\n\nShaan Mir -- Canaccord Genuity -- Analyst\n\nThank you. Again, congrats on the quarter, and I'll pass it on.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nThank you very much, and happy Thanksgiving.\n\nOperator\n\nThank you. Our next question comes from the line of Glenn Mattson with Ladenburg Thalmann. Please proceed with your question.\n\nGlenn Mattson -- Ladenburg Thalmann -- Analyst\n\nHi. Thanks for taking the question. Also, in light of the news in the U.S. yesterday as perhaps it's only symbolic for now.\n\nBut I also kind of want to hit on the MedMen question. Just because we haven't heard too much about it from you guys. I mean, I'm just curious like how central that is to the U.S. strategy and just kind of like how involved you are in the decision-making process going on there and your general sense of like, I guess, how you feel about that business, how it's doing and what -- is it kind of like the tip of the spear in other words, in terms of your cannabis-touching assets and your strategy for it, should things change in the U.S.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nSo number one, we're not involved with running MedMen, which we can't be. Myself and Denise are observers on the board. So we are not -- we don't have a voting position on the board. There's a lot of data that we get from MedMen.\n\nThere's a lot of information that we see coming out of the U.S. So even though we're not selling into the U.S., there's a lot of information that we're able to see. Listen, MedMen has gone through its challenges. As a matter of fact, I'm in L.A.\n\nthis weekend visiting some MedMen stores and seeing what's going on, some of the products. And I think they're making some tremendous headway. I think it was an important move and getting ready, selling Florida off, and bringing some money into the company. There's some things we need to work out in New York, which we think will be a big market, once now legalization happens, once recreational can be sold here.\n\nAnd I come back and say the MedMen name, no different than the cookies name, has tremendous potential out there that red bag, that red product. So which gives us the opportunity to let all these things get fixed and if legalization or when legalization happens, it gives us an opportunity to position ourselves where we want to, whether it's own 100% of the business, own a percentage of the business, own certain states, etc. So we have a foot in the game today, and there's a lot of data and a lot of information that we're learning about. But we're not involved in day-to-day operations and decision-making within MedMen today.\n\nGlenn Mattson -- Ladenburg Thalmann -- Analyst\n\nGreat. That's it for me. Thanks for the color.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Frederico Gomes with ATB Capital Markets. Please proceed with your question.\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nHi. Morning. Thanks for taking my question. I just have one quick question on the CMOS consolidation in Canada.\n\nWe obviously have your alliance with HEXO, a pretty complete spec of assets here. But you mentioned that you expect some of the smaller LPs start falling out of the market. So are there any specific capabilities or assets that you think would interest you in acquiring, anything that will make sense from a strategic standpoint? Thank you.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nThank you very much for your question. Listen, I think we're well-positioned in Canada today. We're well-positioned with our growth facilities in Leamington, our Broken Coast facility. There are some assets we still have from the Tilray acquisition.\n\nIn regards to our processing, we're in good place. In regards to our partnership and relationship with HEXO and Redecan and some of the pre-rolls and that we can do with those and the readies, which we're rolling out. We have a production facility in London, Ontario, where we can do drinks. We're working with Redecan in regards to edibles.\n\nWe have a facility in Ontario that allows us to do some other things with Cannabis 3.0, so which is called Avanti. So we're well-positioned in Canada today. We have 12 brands in Canada today and 12 great brands. So it's lined up the pieces within the box.\n\nIt's just how we roll it out, how we work with the different provinces and how we work with consumers to educate them about products, how we educate them about brands. How we work with them to move them over to the illicit market, and that's an important part. And I got to tell you, Blair and his team have done a great job in doing that. And there's just a tremendous amount of data that we're accumulating and having in front of us to help us drive our share in the marketplace, and that's why you're seeing share growth.\n\nAnd again, I think, ultimately, over the last year, price compression is down. 14%, OK? And think about it, that's a big move down 14%. And from our standpoint by taking strains out of the market by eliminating the Marley brand, it's worth for us about $30 million, $40 million -- what's the total number?\n\nCarl Merton -- Chief Financial Officer\n\nOn an annual basis.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nYeah. About $30 million that we've taken out of the marketplace in regards to strains and brands and cleaning that up with the Tilray acquisition. So there's still a lot of falling out to do. And I think just stepping back, the industry is four years old.\n\nThe government is going through its review right now. One of the biggest problems is in Canada for every dollar we sell, $0.33 goes to the taxes. So we have to be efficient. And that's why to survive in that market, you got to be that low-cost producer, you got to have the volume on top of that.\n\nAnd that's ultimately what's going to survive in that marketplace.\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nThank you. That's really helpful color. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Scott Fortune with Roth Capital. Please proceed with your question.\n\nUnknown speaker\n\nHey. Good morning. This is Nick on for Scott. Just looking for some color on Germany, maybe for Denise.\n\nI appreciate the road map you've provided. Can you just touch on the competitive environment and kind of what you've seen in terms of supply and demand economics there? It appears more suppliers are entering the market in Germany. So just looking for your thoughts around the current state -- kind of just the pricing environment there. Thank you.\n\nDenise Faltischek -- President, International Business and Chief Strategy Officer\n\nYeah. Sure. No problem. So in terms of the market in Germany, as you can imagine, because of the fact, if you look outside of Canada, Germany is really the largest market from a medical cannabis perspective.\n\nSo you do see a lot of new entrants coming into that market. We believe, as we mentioned in our press release, we are the number one market share in Germany with approximately 20% of market share. And we believe that we have a very, very strong brand in terms of Tilray, which is well recognized among physicians, healthcare practitioners, and patients alike. When we look at our pricing, like, yes, there is some pricing compression.\n\nWe're pleased to say that we have maintained high prices in the area of medical cannabis. And we think a lot of that is really attributable to the fact that about 85% of our sales go directly to the pharmacy. So we are working directly with the pharmacists in terms of selling our products. So we're not losing margin to wholesalers and the like.\n\nUnknown speaker\n\nGreat. That's it for me. I appreciate the color.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of John Zamparo with CIBC World Markets. Please proceed with your question.\n\nJohn Zamparo -- CIBC World Markets -- Analyst\n\nThanks. Good morning. I wanted to follow up on free cash flow and the guide for positive is -- or guide for this year is for positive, but you're at nearly minus 50 now. It's a meaningful step back from last quarter.\n\nSo I wonder if you can elaborate on how you get there. And were there certain elements of cost or payments that fell into Q1? And what kind of sales growth do you ultimately need to achieve to get to free cash flow positive for the year?\n\nCarl Merton -- Chief Financial Officer\n\nSo, John, we've always said that our cash flow was back-end loaded this year. We also talked a little bit in our scripts and in the documents that will get released publicly later today, that Q1 historically for us, is a quarter where we have a greater share of our annual payments. Different things that you have to do things like insurance and then things like those things that represent a big payment and then get -- the benefit gets spread out throughout the year. I also think if you look at that cash flow number, $26 million of that is working capital changes where we think a big chunk of that reverses.\n\nWe talked about the HTI receivable on the upside protection from the share issuance. That comes in next quarter and moves against that. So I think it's -- we were always expecting Q1 to be a negative toward that target and that we would make it up later in the year.\n\nJohn Zamparo -- CIBC World Markets -- Analyst\n\nThat's helpful. Thank you.\n\nOperator\n\nThank you. Ladies and gentlemen, there are no other phone questions at this time. I'll turn the floor back to Ms. Noorata.\n\nPlease go ahead.\n\nBerrin Noorata -- Chief Corporate Affairs Officer\n\nThank you, operator. And now, I'll read questions from the Say Technologies platform. The first question from our retail shareholders is, \"During the last earnings call, you stated that Tilray was exploring ways to get into the U.S. market.\n\nWhat is the plan?\"\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nThank you, Berrin. I think the plan is very much been laid out. As I said today, we have a strong spirits business. We have a strong beer business, and we have a good foothold in the wellness business with Manitoba Harvest, continuous focus on growing those businesses.\n\nAnd with that, look at other acquisitions out there within the spirits in the wellness business or in the beer business with adjacency to cannabis. We are going to be opportunistic as we watch what unfolds in regards to legalization within the U.S. And if it does happen, we would very much be able to jump in there and acquire or merge with some of these MSOs. I think what's really important today as I've gone through and talked about our balance sheet in regards to our debt levels that are fixed out there and that we will generate free cash and not be out there burning cash.\n\nSo there is going to be plenty of opportunities for us in the consumer area. And upon legalization or some type of legalization, there will be opportunities for us within the cannabis area.\n\nBerrin Noorata -- Chief Corporate Affairs Officer\n\nThank you. And the second and last question is, what are you doing to reassure stockholders that Tilray is worth investing in?\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nWell, number one, I will commit to this here. We do have a team around the world that is working real hard for its shareholders out there and as our consumers. Number two is we have a very fine strategic plan, which we talked about to get to the $4 billion. A lot depends upon legalization.\n\nWe're laser focused on our brands. We're laser focused on cost savings in regards to -- we took out $100 million of cash cost savings. We're laser focused on our balance sheet, with our cash that we have on hand today with our fixed debt out there. I know none of us have been happy with our stock performance, but the market, it's the cannabis industry, but nobody out there is happy with our stock performance.\n\nBut, I will tell you, we are focused on our brands. We're focused on the category. We're focused on diversification. We're focused on free cash.\n\nAnd with that, at the end of the day, I think we will end up being a winner out there.\n\nBerrin Noorata -- Chief Corporate Affairs Officer\n\nThank you, Irwin, and that concludes our questions.\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nSo I want to thank everybody for joining us today. Yesterday's news in regards to seeing President Biden talked about the cannabis industry and pardoning those that have been charged with cannabis defense on a federal and encouraging governor out there to do it on a state-wise is the first bit of action. And we've talked about it. And there's times you just want to give up upon legalization and how you go another route.\n\nI think, again, as I just said before in the previous questions, we are diversifying as a company, and we have a strong presence in Europe, which I just recently visited and spent time with the team over there. I'm very proud of what we have in Portugal, what we have in Germany and in 20 different countries where we sell medical cannabis today and the demand for medical cannabis in regards to so many different diseases and the ability to help patients out there. In regards to our Canadian market, what Blair and his team are doing there in regards to the changing market and as we talked about the compression on price points down 14%, which we've gone in and cleaned up some of our strains, taking out some of our brands that don't make sense. So we're doing the right thing sitting today with the cash balance that we have and being focused on our debt where interest rates are rising the way they are and has caught tremendous amount of companies off guard and with higher interest rates today.\n\nComing out and being one of the cannabis companies out there that are not focused on having to go raise money, focusing on in regards to where our debt levels are and can manage through that and also our focus on the diversification. We're also sitting back and waiting what happens in the U.S. It's not that we're locked in today to be in the multi-states and it's different states legalize and what the opportunities will come from a SAFE Bank Act. There's a lot of investors that want to be in this industry.\n\nThere's a lot of investors that have been ultimately burnt in this industry. But it's going to be a $100 billion industry in the U.S. It's a $10 billion industry within Canada. It's a $30 billion, $40 billion industry within Europe.\n\nSo there's big opportunities. And the good thing is we're well rounded out there with opportunities. And hopefully, they all come together. So thank you for your patience.\n\nI know sometimes as I read out there, hey, you give up on us. Don't give up on us because I commit this here. The team, the board, and everybody out there is working very hard. So thank you for your support and sticking there with us.\n\nI want to wish our Canadian friends a very happy Thanksgiving, and look forward to speaking to you soon. Have a nice weekend and a nice Thanksgiving and a nice Columbus Day. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBerrin Noorata -- Chief Corporate Affairs Officer\n\nIrwin Simon -- Chairman and Chief Executive Officer\n\nDenise Faltischek -- President, International Business and Chief Strategy Officer\n\nBlair MacNeil -- President, Canadian Business\n\nCarl Merton -- Chief Financial Officer\n\nVivien Azer -- Cowen and Company -- Analyst\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nAndrew Bond -- Jefferies -- Analyst\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nShaan Mir -- Canaccord Genuity -- Analyst\n\nGlenn Mattson -- Ladenburg Thalmann -- Analyst\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nUnknown speaker\n\nJohn Zamparo -- CIBC World Markets -- Analyst\n\nMore TLRY analysis\n\nAll earnings call transcripts"
}