{
  "companyName": "General Motors",
  "companyTicker": "GM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/general-motors-gm-q3-2022-earnings-call-transcript/",
  "content": "General Motors (GM -0.09%)\nQ3 2022 Earnings Call\nOct 25, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the General Motors Company third quarter 2022 earnings conference call. [Operator instructions] As a reminder, this conference is being recorded, Tuesday, October 25, 2022. I would now like to turn the conference over to Ashish Kohli, GM's vice president of investor relations.\n\nAshish Kohli -- Vice President, Investor Relations\n\nThank you, Madison, and good morning, everyone. We appreciate you joining us to review GM's financial results for the third quarter of 2022. Our conference call materials were issued this morning and are available on GM's Investor Relations website. We are also broadcasting this call via webcast.\n\nJoining us today is Mary Barra, GM's chair and CEO; Paul Jacobson, GM's executive vice president and CFO; as well as Kyle Vogt, CEO of Cruise. Dan Berce, president and CEO of GM Financial, will also be joining us for the Q&A portion of the call. Before we begin, I would like to direct your attention to the forward-looking statements on the first page of our presentation. The content of our call will be governed by this language.\n\nAnd with that, I'm delighted to turn the call over to Mary.\n\nMary Barra -- Chairman and Chief Executive Officer\n\nThanks, Ashish, and good morning, everyone. Thanks for joining the call. During the third quarter, the GM team once again demonstrated our ability to deliver strong results while executing our growth strategy and managing multiple headwinds. The third quarter brings our EBIT-adjusted earnings for the first nine months of the year to $10.7 billion, which keeps us on track to deliver our full-year guidance.\n\nWe translated improved supply chain performance into another quarter of full-size pickup and full-size SUV sales leadership with very strong mix and pricing. The Cadillac Escalade also continues to lead its segment by a wide margin. Chevrolet and GMC unveiled new midsize and heavy-duty pickups to help maintain our strong position when they launch. And the Chevrolet Bolt EV and EUV are selling at record levels, thanks to their range, technology, and value.\n\nAnd in September, they outsold the Ford Mustang Mach-E more than two to one. BrightDrop is generating revenue in the last-mile delivery segment. And later this year, CAMI Assembly is set to launch BrightDrop production, making its candidate's first large-scale EV plant. Production will ramp up in 2023 to begin fulfilling major orders from our customers, including Walmart, FedEx, and Merchants Fleet.\n\nIn addition, BrightDrop launched Trace Grocery eCart last month to help speed up online grocery order fulfillment, with Kroger slated to be the first customer. And as Kyle shared last month, Cruise has begun its expansion into Austin and Phoenix, and he'll share an update in a few minutes. So it has been a great team effort by everyone, and I really want to thank and recognize the GM team, our suppliers, and our dealers. While the operating environment remains challenging our team continues to adjust quickly when and where it needs to.\n\nThis is especially true of our supply chain and manufacturing teams. During the quarter, we completed and shipped nearly 75% of the unfinished vehicles we held in the company inventory in June. That's well ahead of the plan we shared at our last earnings call. As we've moved through the year, we have seen gradual improvement in the supply chain, including semiconductors.\n\nShort-term disruptions will continue to happen, but we're taking concrete steps to minimize them and build long-term resiliency. This includes several strategic supply agreements for mature nodes where supply is most constrained. We are also working directly with semiconductor suppliers, ensuring long-term forecasts to increase transparency and ensure their planning cycles include our volume. I'd also like to recognize the GM China team.\n\nDespite disruptions caused by COVID lockdowns, morale is strong, and the business has returned to profitability, and they are building momentum in China's fast-growing EV market. This includes strong sales of the Wuling Hong Guang Mini EV, which remains China's best-selling electric vehicle; the September launch of the Cadillac LYRIQ; and the debut later this year of the first Buick EUV on the Ultium platform. As we grow EV volumes, we continue to benefit from investments we have made in new ICE products and manufacturing capacity, especially in our truck portfolio, where we are the industry leader. In fact, we took full-size pickup leadership from the Ford F-Series in 2020 and have held it ever since.\n\nWe'll press our advantage with the new 2024 Chevrolet Silverado HD and GMC Sierra HD, which will be available in the first half of 2023. The far-ranging improvements to these trucks, including redesigned interiors, enhanced trailering technology, and new high-feature models, like the ZR2 for Chevrolet and the Denali Ultimate for GMC, are designed to support continued strong pricing. We are also launching all-new Chevrolet Colorados and GMC Canyons in the first half of 2023, which will include new premium off-road offerings. Importantly, the launches will be accompanied by significant reductions in complexity.\n\nFor example, we reduced the number of cab and bed configurations from three to one to focus on the fastest-turning model, and we've also reduced our engine options from three to one. Going forward, all Colorados and Canyons will be powered by the Silverado and Sierra's high-output, 2.7-liter turbo engine, which is a great solution for customers and our business. The new engine offers more horsepower and torque than the outgoing gas powertrains, and we expect a 1- to 2-mile per gallon fuel economy improvement on most models. Let's turn next to our EV supply chain and manufacturing base, where we are vertically integrating and scaling.\n\nTo meet strong demand, we will soon be transitioning production of the Cadillac LYRIQ and GMC HUMMER EV from using imported cells to cells produced at our Ultium Cells joint venture plant in Ohio. At the same time, work is underway for higher production at Factory ZERO as well as volume production at CAMI Assembly in Ramos Arizpe starting in 2023 and Orion assembly in 2024. Construction is also underway on two more Ultium cell plants that will open in 2023 and 2024, respectively. This will help us meet strong and growing demand for the GMC HUMMER EV, the Chevrolet Silverado EV and Chevrolet Equinox EV and Blazer EV, along with the GMC Sierra EV and BrightDrop vans.\n\nAll of our 2023 launches are progressing well. However, due to a slightly slower launch of cell and pack production than we expected, our plan is now to produce 400,000 EVs in North America over the course of 2022, '23 and the first half of 2024. We are always gated by quality, and everything we've learned will help us scale more than -- to more than 1 million units of annual capacity in 2025 with even greater confidence. For growth beyond 2025, we continue to secure our future with strategic supply agreements and direct investments in natural resource recovery, processing, and recycling.\n\nThe most recent example is the strategic investment we made in Queensland Pacific Metals of Australia to secure cost-competitive nickel and cobalt. The new clean energy tax credits of the U.S. certainly validate our strategy, and they will be a strong tailwind to expand domestic supply chain capacity and drive EV adoption. As we scale the Ultium platform, we have been very intentional to position the company for volume growth, but with flexibility, efficiency, and increased EV profitability over time.\n\nThis includes fully leveraging the Chevrolet Bolt EV and EUV. We're planning to increase Bolt production from about 44,000 vehicles in 2022 to 70,000 vehicles next year because demand is at record levels. We will use our industry-leading loyalty to move Bolt customers into one of our new EVs, like the Chevrolet Equinox EV, for their next purchase. Our Bolt EV and EUV owner base should surpass 200,000 at the end of next year.\n\nIf we retain them at our average customer loyalty rate of 64%, that's more than 100,000 future customers for Ultium platform vehicles. I believe we can do even better because our new EVs are that good. As I've said, customer demand is strong and growing for the LYRIQ, the HUMMER EV, the Silverado EV the Blazer EV. And the early customer and media response to the Equinox EV and the GMC Sierra EV we just unveiled have been overwhelmingly positive.\n\nElectric.com wrote that affordability makes the Equinox EV a win for the company and EV buyers everywhere. And MotorTrend said, it could be one of the first vehicles to trigger a tidal wave of EV demand. And with the Sierra EV, GMC will be the only brand with three all-electric trucks in the market. And they are all incredibly distinctive, thanks to the flexibility of the Ultium platform.\n\nThe Sierra EV Denali's Edition 1,400 miles of range, 350-kilowatt DC fast charging; 9,500 pounds of towing, bold styling and luxurious refinements make it unlike anything else in the market. In addition, the agreement we struck with Hertz to deliver as many as 175,000 EVs over the next five years will build on this momentum. Huge segments of the U.S. population have never driven an EV, and renting one for personal or business travel will be far more immersive than a test drive at a dealer.\n\nThese customers, as well as experienced EV drivers, will see just how exciting and well-executed our products are, and this can help increase purchase consideration and sales for GM EVs. There have been many other exciting developments this summer and fall, and I'd like to briefly mention two that speak directly to the power of our brands and the new business opportunities ahead of us. The first is the Cadillac CELESTIQ that we revealed just days ago. It is a completely bespoke work of automotive art, built around the most advanced and innovative technology we have ever engineered.\n\nMedia described the CELESTIQ as the most advanced, most luxurious, and one of the most important vehicles Cadillac has ever made. But one headline really captured its essence: Cadillac outrolls Rolls Royce. The second is the growth of Super Cruise. Our customers have now traveled 40 million miles with Super Cruise engaged, and the numbers are growing very quickly.\n\nWe recently doubled its road network to more than 400,000 miles of interstates and non-divided highways, making it even more valuable to customers who already have highly -- are as highly satisfied with the technology. By the end of next year, it will be available on 22 models globally. While we are expanding the competitive advantage we have in advanced driver assistance systems with Super Cruise, the Cruise team in San Francisco continues to make rapid progress in autonomous vehicles. Kyle is with us, so I'd like to invite him to share an update with you.\n\nKyle Vogt -- Chief Executive Officer, Cruise\n\nThanks, Mary. Overall, we remain largely on track for our goals this year, including expansion in San Francisco and the goal we announced in September to begin commercial driverless operation in two new markets. We've now driven well over 400,000 fully driverless miles in San Francisco and given thousands of rides to members of the public, and we expect to expand our service area and hours of operation soon. We believe this is now the largest, fastest-growing, and most successful commercial robotaxi service in existence and by a large margin.\n\nWe've done this while building up a solid track record around safety, especially our safety culture, which drives our decision-making and approach to responsible EV deployment. Our product experience is getting better all the time, and we see this reflected in increased adoption and in many rave reviews we receive across both our ride-hail and delivery operations. As you may recall, we plan to do early commercialization in '21 and '22, and we have. Next year marks the beginning of our rapid scaling phase, where we plan to churn through the backlog of users waiting to use our service, ramp up our operations and start to generate meaningful revenue.\n\nAs for our new markets, Austin and Phoenix, we remain on track to complete our first commercial driverless public rides and deliveries by the end of the year. This will begin at limited scale initially and ramp up as we produce more vehicles. Our current status is that our mapping systems worked as expected, and we've started supervised testing in Austin with more than a dozen vehicles. As we had hoped, we're finding that most of our AV systems generalize well to new markets.\n\nAnd for the handful of things that are unique to Austin, I've seen donkeys, pedicabs, police on horses, our continuous learning machine is able to automatically mine for these unusual things and then retrain our neural networks to better handle these situations. The same technology is already in use in San Francisco and will be used in all other markets so that our AV system will continuously adapt to changes that occur within that market, such as new kinds of scooters or predominance of HUMMER EVs or however else cities might change. As for the industry, we're seeing increased separation between the company's operating commercial driverless services and those that are still stuck in the trough of disillusionment. What's happening here is that the companies with the best product have pulled ahead and are accelerating.\n\nThe best talent follows the best products, and those people are what makes a company great. They have a highly vested interest in identifying and moving to the clear winners, and they're good at it. This virtuous cycle fuels the growth of the leaders and stunts the progress of the laggards. And it happens not just with talent, but also with suppliers, partnerships, and investors.\n\nAnd you've seen this play out at Cruise with us pulling in timing and expanding scale, which is an anomaly in an industry that is dominated by delayed milestones and missed targets. Thank you. Back to you, Mary.\n\nMary Barra -- Chairman and Chief Executive Officer\n\nThanks, Kyle. I appreciate the update and all the work the team is doing at Cruise. So before I turn the call over to Paul, I want to encourage all of you to join our Investor Day on November 17. We plan to use this time to go deeper into the second phase of our EV growth strategy.\n\nPhase 1 was focused on technology innovation, specifically the development of our proprietary Ultium and Altify platforms. Phase 2 is the rapid scaling of our product portfolio based on Ultium and Altify while leveraging ICE vehicles to maintain strong margins. And in Phase 3, we'll drive rapid revenue and margin growth across the entire ecosystem through software-defined vehicles, crews, and other initiatives to create a flywheel effect. Phase 2 has already begun.\n\nAnd Mark Reuss, Doug Parks, Travis Katz, Paul and I will show you how it accelerates through 2025. We will include KPIs to help you track our EV progress, including margin improvement. Then in the first half of 2023, we are playing a deep dive into our software-defined vehicle strategy to show you how we will leverage Altify to help expand revenue and margin. We also plan to share new details about the expansion of Super Cruise, the launch of Ultra Cruise and other high-return technology initiatives.\n\nBoth events are going to be exciting and compelling. With that said, I'll turn the call over to Paul. Thank you.\n\nPaul Jacobson -- Executive Vice President, Chief Financial Officer\n\nThank you, Mary, and good morning, everyone. Thank you for taking the time to join us. We've stressed that this year is about executing. In the beginning of the year, we highlighted $5 billion of inflation throughout the business, but set out to perform at or near the record levels that we achieved in 2021.\n\nNow that we are more than three-quarters of the way through the year, I'm extremely proud of the progress that our global team has made. We remain well on our way to achieving the commitments we outlined in February. Volumes were up 80% year over year as we successfully completed and shipped nearly 75% of the vehicles built without certain components held in company inventory at the end of Q2. This tailwind was partially offset by logistical challenges we have seen, particularly from Mexico, which has impacted our ability to recognize revenue on certain in-transit vehicles, along with some spot plant downtime.\n\nOverall, parts availability and supply chain issues continue to slowly trend in the right direction, with the team working tirelessly to navigate the dynamic environment. As a result, we remain on track to increase full-year 2022 wholesales by 25% to 30% year over year and deliver North American EBIT margins of 10%. Q3 revenue of $41.9 billion was a record for the company. We achieved $4.3 billion in EBIT-adjusted, 10.2% EBIT-adjusted margins and $2.25 in EPS-diluted-adjusted.\n\nWe generated $4.6 billion adjusted auto free cash flow during the quarter and continue to expect $7 billion to $9 billion of cash flow for the full year. Our strong cash generation allows us to continue investing in our future while, at the same time, returning cash to shareholders. The confidence in our longer-term outlook informed the board's decision in August to reinstate our corporate dividend and increase our share repurchase authorization to $5 billion. During the quarter, we bought back $1.5 billion of stock, retiring 38 million shares.\n\nNorth America delivered Q3 EBIT-adjusted of $3.9 billion, up $1.8 billion year over year, and EBIT-adjusted margins of 11.2%, primarily driven by higher volume and pricing, partially offset by higher commodity costs as well as investments in growth. Q3 EBIT was positively impacted by the completion of a substantial amount of the vehicles that we built without certain components, which we said last quarter were primarily full-size trucks and SUVs. As production improves, we're closely monitoring dealer stock and inventory turns to appropriately match supply with demand. The number of vehicles physically on dealer lots is well below historical levels and continues to be tight at around 20 days.\n\nImportantly, demand remained strong for our highest-margin projects with very fast turn rates. These include HD pickups, like the Sierra, which is turning in about 10 days, and our full-size SUVs are turning even faster. Total dealer stock, including in-transit vehicles, increased due to a combination of higher production, clearing out the portion of company inventory and logistical challenges that have lengthened the time for vehicles to arrive at dealers. Pricing in Q3 was favorable versus Q2 and well above Q3 last year.\n\nCosts were up year over year, primarily due to increased commodity and logistics expenses, engineering, software development costs and the absence of a favorable Bolt recovery in the third quarter last year. GM International delivered third quarter EBIT-adjusted of $300 million, up $100 million year over year, as the team continued to navigate a volatile and dynamic environment. This included $300 million of equity income in China, up slightly year over year, as production levels have continued to improve from COVID-related impacts earlier in the year. EBIT-adjusted in GMI, excluding China equity income, was breakeven, also up slightly year over year, with results driven by favorable pricing and volume, partially offset by the same mix and commodity costs.\n\nYear-to-date EBIT-adjusted is $400 million, reflecting the tremendous work the team has done over the last several years to strengthen this business. GM Financial once again delivered strong results, with Q3 EBIT-adjusted of $900 million, down $200 million year over year, primarily due to lower net leased vehicle income. Overall, GM Financial's balance sheet and credit metrics remain healthy, reflecting the strong underlying credit quality of the portfolio. Although moderating off historically strong levels, net charge-offs remain below pre-pandemic levels as credit mix has shifted toward prime customers.\n\nCorporate expenses were $350 million in the quarter, up $100 million year over year, primarily driven by growth initiatives. Corporate also included $100 million gain relating to the disposition of our Stellantis warrants, which we exercised in Q3 when the lockup period expired and resulted in approximately $1.1 billion of cash proceeds. Cruise expenses were $500 million in the quarter, up $200 million year over year, driven mainly by modifications to share-based awards, resulting in an accounting change in compensation expense. Now let me provide a few forward-looking comments.\n\nWe continue to track to the midpoint of the $13 billion to $15 billion EBIT-adjusted range we laid out at the beginning of the year. Year-to-date, we're at $10.7 billion EBIT-adjusted, which implies Q4 EBIT-adjusted in the low $3 billion range. Slightly higher wholesale volumes from completing the remaining vehicles held at company inventory are expected to be more than offset by a normalizing mix, launch-related costs and typical seasonality we see in Q4. We estimate commodity and logistics costs to be around $5 billion headwind year over year, consistent with prior expectations.\n\nEarlier in the year, raw materials were driving around two-thirds of this $5 billion increase. They have come down and are now closer to half, but this benefit has been offset by other costs such as logistics and supplier claims. We're working collaboratively with our suppliers to jointly identify efficiencies to help mitigate these headwinds. As we move into 2023, we continue to see the dynamics between commodities and pricing as a natural hedge that should trend in similar directions, helping to maintain the earnings power of the company.\n\nWe also continue to see strong demand for our products, and we'll remain thoughtful in our approach to pricing. We've been agile through this volatile environment over the last couple of years. And as we said last quarter, we're already taking proactive steps to manage costs and cash flows, including reducing some discretionary spending and limiting hiring to critical needs and positions that support growth. In summary, we continue to execute on our near-term financial goals.\n\nBut more importantly, we're making great progress on the milestones we shared last year. And in just a few weeks, we'll have the opportunity to update you at our Investor Day in New York on November 17. This concludes our opening comments. We'll now move to the Q&A portion of the call.\n\nOperator\n\n[Operator instructions] Our first question comes from John Murphy from Bank of America.\n\nJohn Murphy -- Bank of America Merrill Lynch -- Analyst\n\nJust a first question around inventory, and I'll promise to state a one follow-up to this. I mean, if we think about 359,000 of units on dealer lots right now, you're saying that's about 20 days' supply. I mean just curious how you think about governing that going forward. So you maintain this very strong price environment, which is driving record profitability.\n\nI'm just trying to make sure we stay at tight levels. And how do you think about staying tight to support pricing?\n\nPaul Jacobson -- Executive Vice President, Chief Financial Officer\n\nAnd so, Mary, I'll take this question.\n\nMary Barra -- Chairman and Chief Executive Officer\n\nGo ahead, Paul.\n\nPaul Jacobson -- Executive Vice President, Chief Financial Officer\n\nApologies. Well, thanks for that question, John. So we're watching this very, very closely, as we've said, looking at dealer turn times, looking at grounded stock. As we've talked about, logistics remain a bit of a challenge for us, whether it's vehicles that are completed, waiting transit to dealers or even some vehicles that we've had some challenges getting across the next quarter from our facilities down there.\n\nSo a lot of this inventory still is in transit. The grounded inventory, we continue to speak to our dealers. They say demand is really strong. And many dealers are saying that the only time vehicles sit there when a buyer opts out of a transaction they already had, and it's not very long before they go through their list and find somebody to purchase them.\n\nSo this is something that we're watching very closely. I think there's a little bit of a surge right now as we complete the vehicles that were partially built at the end of June. But we watch this. We're seeing no signs of concern in the short run.\n\nJohn Murphy -- Bank of America Merrill Lynch -- Analyst\n\nOK. And then just a follow-up then on tightness. I mean, cap U during the quarter, I think you said, in North America, is 103.3%, two shifts, straight time. That kind of implied capacity of about 3.1 million units.\n\nIf we look back to some period that was somewhat normal in the third quarter of 2020, it's hard to call anything the last couple of years normal, but kind of normal that cap U was 112%, and your GM&A EBIT margins were 15%, right? So this quarter, we were over 11%. I'm just curious, as you think about ramping up that cap view curve, Mary, you've been doing this for a while and understand the stuff well. Is there room for margins, all else equal, as volumes recover and that cap U goes up that you could see significant upside to margins over time? And where does that bend backwards? Is it 110%, 115%, 120% cap U? And would you add more capacity to help alleviate that sort of backward bend?\n\nMary Barra -- Chairman and Chief Executive Officer\n\nWell, John, I think, overall, we're going to remain disciplined. I do think there's an opportunity to drive strong margins. We're seeing it right now with the mix, for instance, on full-size trucks. Consumers continue to want a very high mix.\n\nWe think that that will translate also into EV. And as we move forward in the EV launch and have our battery plants operating and get to scale and continuing to make the battery improvements, we see, again, that's another level to have strong margins. And then sitting on top of that is from a software perspective. And then overall, beyond, I'll say, the traditional new vehicle sales, the work that we'll have with CarBravo as well as the growth businesses around GM Defense, BrightDrop, and Cruise, I think there's quite a lot of upside from a margin perspective in the company.\n\nBut to drill into the specific, we will be as disciplined as possible. And the reason I say as disciplined as possible, we also do have to be responsive to what the competitive environment is. But I think we have -- I think there's -- as an industry, we've learned a lot over this last couple of years of how we can be more efficient between ourselves and the dealers and how we can make sure we're serving the customer in an efficient way.\n\nOperator\n\n[Operator instructions] Our next question comes from Joseph Spak from RBC Capital Markets.\n\nJoseph Spak -- RBC Capital Markets -- Analyst\n\nMary or Paul, maybe you could just give a little bit more color on what's going on at the -- it sounds like the battery factories are sort of causing a slight delay there. Is that sort of a timing of some equipment coming in or some extra steps in terms of making sure the quality is there? Maybe just a little bit more color on that.\n\nMary Barra -- Chairman and Chief Executive Officer\n\nSure, Joe. Well, one, I think we had a very aggressive launch plan when we started to build the plant. Let's step back and recognize that the Ohio plant is the size of 30 football fields, and it will employ over 1,000 people. Making sure we had all our people there and trained has taken a little longer than expected.\n\nAlso, this is the first facility that we're working with LG ES, and we're working together effectively to really leverage not only the expertise that LG ES has but what GM brings. And so there's no one thing, but it has just taken a little longer to make sure that we're able to produce with quality. I'm very confident in the team and how they're working together. And I think we're in that ramp -- but because it's taken a little bit longer also from the battery pack assembly as well.\n\nBoth of those, as we've ramped up, are taking a little bit longer. And that's why, instead of hitting the 400,000 mark at the end of '23, it's going to seep into 2024. But with everything that we're learning, it gives me great confidence that we're going to be able to start plant two, three, and beyond on time. And I have even greater confidence in our ability to scale to the 1 million units of annual EV capacity in 2025 in the U.S.\n\nand similarly in China. So it really is just getting that first plant up and going, recognize the size and complexity of it. But I'm really proud of the team and where they're at right now.\n\nJoseph Spak -- RBC Capital Markets -- Analyst\n\nOK. And maybe somewhat related. But Paul, I know, capex, you sort of reiterated $9 billion to $10 billion for the year. You're trending well below that through nine months.\n\nSo is that still correct? I mean, is there any incentive to push some of that to next year because of maybe some of the policy changes? And also, I guess, with the policy changes, any thoughts on if that $9 billion to $10 billion is still the right rate for the next couple of years? Or are you actually incentivized to maybe try to accelerate some of that now?\n\nPaul Jacobson -- Executive Vice President, Chief Financial Officer\n\nWell, Joe, I think when you look at our historical spend rates, we tend to have capex that -- it's a little bit back-loaded from that standpoint. And I think we're still on track for the $9 billion to $10 billion going forward this year. As we look at the future years, obviously, we've had some pretty steep acceleration in EV volumes, etc. And we'll provide some more updates at Investor Day.\n\nBut I think we're well within our ability to fund our expansion, our transformation through internally generated funds when you look at the health of the business. And I think when you look at cash balance, when you look at cash flows, when you look at our ability to repurchase some shares during the quarter, that signals our confidence about being able to balance the spending, be aggressive where we can, as you've seen us over the last couple of years, but also keep that balanced within our means. And you're going to continue to see that from us.\n\nOperator\n\nOur next question comes from Rod Lache from Wolfe Research.\n\nRod Lache -- Wolfe Research -- Analyst\n\nI wanted to ask, first, Mary, I overheard you say in an interview this morning that GM is well positioned for the IRA. I was hoping you can give us maybe some color on the magnitude of the North America content and critical mineral sourcing or the manufacturing credits as you look out to next year? And related to this, your original margin targets sort of midterm and long term, the 10% and 12% were pre-IRA. And I'm curious if you have any thoughts on whether this could be accretive to that.\n\nMary Barra -- Chairman and Chief Executive Officer\n\nSure. Well, just to maybe touch on that last point. We believe we are very well positioned. And we think we're waiting for the treasury rules to be finalized, but we think it will accomplish.\n\nSo it positions us with our strong EV portfolio, covering the important segments to really drive affordability to spur consumer adoption. So overall, we feel very well positioned. But if you look at it right now, over the 10-year life cycle of the credit, we will offer a number of models in the segments and price ranges that will be eligible for the full $7,500 credit. And for us, many of these are going to be high-volume entries.\n\nWe do think some of the vehicles will be eligible for the $3,750 credits starting in January, and then we'll ramp toward full qualification across the broad portfolio in two to three years as some of the different supply comes online in North America or in the United States. We also think there's a significant opportunity to potentially leverage the tax credit of up to $45 per kilowatt hour with respect to battery cells and battery modules produced in the U.S. So that's another opportunity where, again, I think we're better positioned than most because of our aggressive plan to get the battery plants and the pack assembly in this country. And then we do think we see an opportunity for our suppliers to leverage a tax credit for up to 10% of the cost of the U.S.-sourced battery electrode active materials starting in January of next year.\n\nSo that's just a little bit more color. Again, we'll have vehicles that are in the right MSRP range to qualify. So when you look at it overall, there's the commercial incentives also that will support BrightDrop in the fleet and rental car. There's the used EV purchase incentive that we think will support EV resell values.\n\nAnd again, we have CarBravo and then the elements from a manufacturing granted loans. So that's just a little bit of the detail. Again, we're waiting for the final rules from treasury, but I think you can see this will really go a long way to helping us drive affordable EVs and drive our profitability while even hitting some of the lower MSRPs.\n\nRod Lache -- Wolfe Research -- Analyst\n\nThat's helpful. And, Paul, on your last call, you mentioned that the next recession would be characterized by a risk to pricing as opposed to volume. I mean, since then, rates have obviously gone up and trade-in values have moderated. And even though you have a lot of in-transit inventory, it looks like the aggregate inventory is probably climbing in the 50- to 60-day range.\n\nI was hoping maybe that you can give us a little bit of additional color on how you see that playing out, whether you think we shift from supply constraints to demand constraints. Or any color on this commodity hedge that you mentioned during your prepared remarks.\n\nPaul Jacobson -- Executive Vice President, Chief Financial Officer\n\nYes. Thanks, Rod. So I think it's obviously -- we've seen some increases in inventory, but that's not a surprise. I think we wholesaled off rounding to 1 million vehicles during the quarter as evidence of both producing and clearing out the vehicles that hadn't been finished in June.\n\nSo I think we're working through that right now. I think it's too soon to conclude anything about trends. We do know that there's a lot of pent-up demand from the last couple of years, as evidenced by both MSRPs as well as what turn rates have been doing. So we're watching all of that closely, but I haven't come to any conclusions about any softening or any demand that's occurred today.\n\nI think as you look at the dealer statistics as well as GMF, the people that are clamoring to get in our vehicles and still see high demand, particularly for the full-size trucks and SUVs.\n\nRod Lache -- Wolfe Research -- Analyst\n\nAnything on that commodity hedge, Paul, that you mentioned? What -- you just concluded your steel negotiations. Is that -- do you have any measure of the magnitude of that offset?\n\nPaul Jacobson -- Executive Vice President, Chief Financial Officer\n\nYes, nothing specific today, Rod. I mean, keep in mind that, obviously, when you look across all of the commodities, they've come off their highs, which will benefit some tailwind next year. As it relates to steel, remember, we've got a portfolio approach where some is on spot rate, some are on term contracts. We benefited from that as steel was spiking over the last couple of years, but you'll see some lag, particularly in steel from some of those multiyear contracts, which is fine over the long term, but it won't provide as big of a tailwind next year as it otherwise would.\n\nSo we'll get more detail on that as we give full year 2023 guidance later, but nothing specific now.\n\nOperator\n\nOur next question comes from Itay Michaeli from Citi.\n\nItay Michaeli -- Citi -- Analyst\n\nCongrats on the results. Maybe just to follow up on that last question, Paul. Just it sounds like you do think that pricing, net of commodities, can still be, I guess, intact or neutral into next year. So maybe just -- maybe hoping you can elaborate on that last comment from your prepared remarks.\n\nAnd maybe also talk about the opportunities you see with the HD trucks and the midsized trucks you're launching next year. It sounds like there might be some price opportunities for the company there as well.\n\nPaul Jacobson -- Executive Vice President, Chief Financial Officer\n\nYes, Itay. So I didn't necessarily say that it was going to be flat. I said there was going to be some offset going forward. We already do know about some pressure that's likely to hit next year from pension accounting.\n\nKeep in mind that while the funded status hasn't changed, just the differentiation of a very different rate environment is going to cause some headwinds on the pension side. We'll know more as rates settle out at the end of the year, but that could be north of $1 billion. No change to cash, no change to any funding, just the way they work. So we're watching all that, that's why we're trying to necessarily piecemeal all of this stuff going forward, but we'll provide more with our full-year guidance.\n\nAnd obviously, when you look at the launches of the new HD, there's a lot of content-rich vehicles coming out. We've continued to see those in strong demand as we rolled them out, both across the SUVs and the light-duty pickups as well. So we expect to see some demand coming there as customers can't get them fast enough. So we think that there is some good news out there.\n\nAll of that has to be balanced by everything that others are seeing out there, even if we're not seeing it, which is why we continue to be cautious in our approach. But what we're focused on is executing every day, and I think this quarter demonstrates the power of the team's ability to do that.\n\nItay Michaeli -- Citi -- Analyst\n\nThat's very helpful. And maybe a follow-up for Mary and Kyle. Any update on when we should see the deployment of the Cruise Origin next year? Is that more first half or second half? And then, Kyle, when those origins are deployed, what's your targeted ODD in San Francisco at that time?\n\nMary Barra -- Chairman and Chief Executive Officer\n\nKyle, do you want to take that?\n\nKyle Vogt -- Chief Executive Officer, Cruise\n\nSure, no problem. So to begin with, one of the things we did just recently is we started operating the Cruise Origin on the streets of San Francisco, but being driven manually for data collection. And so that's another milestone as we ramp toward production for that vehicle -- volume production next year. When we deploy initially, the ODD will probably look similar to what we're doing with our Bolts, but we're going to announce that a little later as we get closer to the deployment date for that vehicle.\n\nOperator\n\nOur next question comes from Ryan Brinkman from J.P. Morgan.\n\nRyan Brinkman -- JPMorgan Chase and Company -- Analyst\n\nI wanted to ask on commodity costs. I realize it's a complicated equation with buy-ins deal in advance, compensating suppliers in the lag, some hedging. But just straight-lining the latest spot prices through the end of '23 would suggest to me a sizable tailwind next year. So have you done any work to try to dimension this tailwind and maybe how it might compare in magnitude to any headwind you expect to face from higher non-commodity supply chain costs, such as energy, logistics, labor or other costs?\n\nPaul Jacobson -- Executive Vice President, Chief Financial Officer\n\nRyan, again, I want to avoid getting into any specific commentary about 2023 guidance from that standpoint. Obviously, we are watching not just commodities, but logistics, container rates, just overall. There's a lot of things that are moving around and changing and evolving. So if we see slowdowns in the economy, not only would we expect commodity rates to come down further, we'd expect freight rates to come down as well.\n\nWe probably spend less on expedited premium freights that we've been spending because the supply chain should normalize a little bit. But those are the things that we're working through in the budget. So what I'd ask is give us time to go through that, take our board through that, and we'll let you know as soon as we pull it all together for a plan in '23.\n\nRyan Brinkman -- JPMorgan Chase and Company -- Analyst\n\nOK. And then just lastly, is there any color you can provide on potential settlements with suppliers to compensate them for premium non-commodity supply chain costs? Ford called this out as a $1 billion headwind during this quarter versus I didn't see anything in your release along those lines. I'm curious if you're taking a similar approach to settle more quickly or maybe expect to spread these payments over several quarters? Or just any thoughts you might be able to provide on how these negotiations with the suppliers are progressing amid the higher inflation environment and impact on GM going forward?\n\nPaul Jacobson -- Executive Vice President, Chief Financial Officer\n\nYes, sure. So obviously, I won't comment on any specific discussions that we're having with our suppliers. But as we alluded to in the prepared remarks, we had focused in on this as well as commodity prices, etc., as part of the $5 billion of pressure that we were going to see year over year. We've been talking about that all year.\n\nSo the supplier world isn't new to us. It's not a surprise to us. It is, as we said in the prepared remarks, taking up a little bit more of that bucket than it was before on a percentage basis. But I think, overall, we're in control of that situation, working proactively with our suppliers and making sure we're doing it a way that meets their needs as well as meeting ours and the commitments we've made to the Street.\n\nSo we won't talk about anything specific with it. It's in there. We've budgeted and planned for that, and there was no surprise from our side on what we've seen. And I think it speaks to the quality of the guidance that we've been able to highlight all year.\n\nOperator\n\nOur next question comes from Mark Delaney from Goldman Sachs.\n\nMark Delaney -- Goldman Sachs -- Analyst\n\nThe first one is on mix, and the company spoke to some mix normalization in the prepared comments, what do you think is driving that mix normalization? Is it more about what GM has the supply to be able to produce and that broadening out beyond the higher end? Or are you seeing any pressure on mix related to what consumers are able to afford given the macroeconomic backdrop?\n\nPaul Jacobson -- Executive Vice President, Chief Financial Officer\n\nNothing from the consumer side. I'd say that comment was really aimed toward the fact that we cleared out the vehicles that had been built without the components at the end of June. We talked about 75% of those being full-size trucks and SUVs. So it stands to reason that with only about 25% of that pool left, you'd see some balance.\n\nSo it's really more due to production enforcement than it is anything on the consumer side.\n\nMark Delaney -- Goldman Sachs -- Analyst\n\nThat's helpful. And my follow-up is on Cruise. And as Cruise is entering the scaling-out phase, and Kyle, thanks for all updates you shared on the progress Cruise is making, are you guys able to share any more color on how investors should expect investment levels at Cruise to trend going forward in order to support that ramp-up relative to the current level of investment?\n\nMary Barra -- Chairman and Chief Executive Officer\n\nKyle, I don't know if you want to comment. I mean, I'll just say we roughly see it slightly higher than 2022 levels, and that's what we're building into the plan. OK? Anything else, Mark?\n\nMark Delaney -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Adam Jonas from Morgan Stanley.\n\nAdam Jonas -- Morgan Stanley\n\nI just had a follow-up on Cruise. Again, thinking quarterly, cash consumption was $0.5 billion this quarter, rolling out, though, into two new cities by the end of the year, further expansion. I just want to confirm, Mary, that if we kind of continue that quarterly run rate of $0.5 billion, maybe increase it slightly, but not dramatically, is that a fair assumption from here?\n\nMary Barra -- Chairman and Chief Executive Officer\n\nI think that -- yes, that's a fair assumption. And then remember, as we start to scale, we do have a line of credit for the vehicles from GM Financial.\n\nAdam Jonas -- Morgan Stanley\n\nMary, just a follow-up on GM Financial. While up slightly, the delinquencies, as you pointed out, still really low at 2.5%, and net charge-offs below pre-pandemic levels. Just curious how you would describe the credit outlook for GM Financial. What changes are you making in your portfolio to prepare for further rises in rates and impact on portfolio performance? I figured it's an unusual environment given how much of the business has been order-booked.\n\nBut I -- correct me if I'm wrong, you're moving more into a kind of that -- at the margin to that just-in-time market that we're familiar with -- there's still some order books. So I'd appreciate what you're hearing in real time from the dealers on the credit side.\n\nDan Berce -- President and Chief Executive Officer, General Motors Financial\n\nYes, Adam, this is Dan Berce. Yes, first of all, as you point out, our credit metrics are really still quite strong. Pre-pandemic, our net losses ran in the 1.5% range. So they're less than half of that now at 70 basis points.\n\nFor several years running now, our portfolio is skewed more and more to prime consumers, and that's defined as 680-plus FICOs. In fact, recent vintages have been 80% prime, and our whole portfolio now is 72% prime. It's also heavily new car finance-related, which typically has been a stronger credit profile. Prime consumers' period typically have a stronger balance sheet buffer, better income levels and historically have been more resilient in weaker economic times.\n\nAs I said last quarter, to your question, our new car portfolio continues to perform substantially better than pre-pandemic levels. Our used car nonprime book is showing more normalization. And as always, we always look for targeted ways to improve our underwriting, and now is no exception. So that would be the area of most focus, the used car nonprime book.\n\nThat all being said, we overall expect some normalization in credit, especially with weaker economic conditions. But our reserve levels already contemplate that. And from a dealer standpoint, the through-the-door application flow really doesn't look different now with the on-the-run buyers as opposed to order book buyers. We haven't really seen any difference at the dealer level at all.\n\nOperator\n\nOur next question comes from Emmanuel Rosner from Deutsche Bank.\n\nEmmanuel Rosner -- Deutsche Bank -- Analyst\n\nFirst, a quick follow-up on the delay in the battery ramp-up. Can you please remind us which of the EV models were going to basically use cells from these plants you're ramping up, and therefore, we'll see some sort of delay in their volume ramp-up? And I guess, more broadly, how are you going to prioritize cell allocation over the next, call it, 18 months or so when you're a bit more constrained than maybe expected?\n\nMary Barra -- Chairman and Chief Executive Officer\n\nYes, Emmanuel. So because of the Ultium platform, we really have a lot of flexibility. So the cells coming from Ultium, which are now in production, will be flowing first to support HUMMER production, and we have over 90,000 orders there. And then LYRIQ, which we have really strong interest in both the two model years, we're already sold out for the availables, and we have strong interest.\n\nBut then as we get into next year, they'll be spread across also Silverado, Blazer, and Equinox EVs for Chevrolet and some of our other models. So we will allocate them across all of those somewhat based on demand and as each of those plants ramp. And we'll make that somewhat dynamically as we go next year, but we'll spread them across all of those vehicles. And again, this is just a slight shift in the acceleration as we get into '24.\n\nBecause we'll have a plant coming online next year and the following year, you're going to see a steeper ramp. And that's what gives me great confidence in getting to the 1 million units by 2025.\n\nEmmanuel Rosner -- Deutsche Bank -- Analyst\n\nOK. And then the follow-up was if you could put a finer point on some of the demand trends you're seeing sort of real time, both in the U.S. and China, if possible.\n\nMary Barra -- Chairman and Chief Executive Officer\n\nI think we've covered most of this. I'll start, Paul, and then if you want to add anything. I mean, again, we're still seeing very strong demand. I think what's specific to GM is we have a very strong truck portfolio.\n\nIf you look at what we have right now, we've refreshed the light-duty trucks. We have now not only the heavy duties coming out early next year, but we also have all-new midsize trucks. So I think that puts us in a very strong position with trucks. Regardless of what the environment is, I think we're going to have a very strong offering from a customer perspective and choice across the full range of those vehicles.\n\nWe are still seeing strong ATPs, but we're watching carefully to see if and when they moderate, also balancing against incentives. We're going to continue, we think, to see some semiconductor challenges and, I'll say, overall challenges from the supply base. It's still very tight when you look at how long we've been running that, that even a small hiccup usually has an impact. And so we're going to continue to work those issues, but we see that improving as well.\n\nSo I think the big thing that we're looking at is what will demand be. There's still a lot of different predictions on what the economic situation will be. But I think, overall, from where we are, from a low inventory perspective, strong product offering, and I think we're well positioned to manage through it. I don't know, Paul, if you want to add anything.\n\nPaul Jacobson -- Executive Vice President, Chief Financial Officer\n\nYes. Mary, I'll just add that we're still very much in a production-constrained world as an industry against where demand is. And as we look to 2023, we've said publicly that we're kind of planning for a 15 million SAR year, which is kind of below where most people peg demand, but it's actually above where actuals have been for most of the year given some of those supply constraints. So I think everything Mary said is absolutely true.\n\nWe're watching it very closely. We are planning for some tightness next year, but that's because we want to be on the proper side. We don't want to get surprised if we see that trending lower. So hopefully, demand remains strong going into 2023, and we can outperform the expectations that we're putting on paper right now.\n\nBut that's what --\n\nEmmanuel Rosner -- Deutsche Bank -- Analyst\n\nAnd then in China and the new ones there?\n\nMary Barra -- Chairman and Chief Executive Officer\n\nIn China, I think we're -- as we now have the LYRIQ, we started offering the LYRIQ in September, and we'll have the Buick Ultium-based product. Those are 2 very important brands that we do well in China. I think we'll continue to see strength in the Hong Guang Mini EV. So I think the real opportunity for us in China is to now, with the products we have, grow our EV portfolio while maintaining our cost.\n\nAnd we'll look to see how the company -- or the country does from an economic perspective. But we have a strong portfolio coming from an EV perspective, and I'm really proud of what the team is doing in light of volatile and different headwinds that they face, especially with some of the COVID situation.\n\nOperator\n\nOur next question comes from Colin Langan from Wells Fargo.\n\nColin Langan -- Wells Fargo Securities -- Analyst\n\nAny color on pricing? I mean any color? Has it improved sequentially? I know that year over year, it's still quite a big tailwind. And should we expect it to stay strong? It just feels like there's an awful lot of headwinds out there. Rates are rising. Used car prices are falling.\n\nAnd I know you highlighted demand is strong, but a lot of the market data is a little cautionary. I think some of the dealers are saying presold vehicles are sort of back to normal levels with the very -- being very few left. And inventory has ticked up and sales really haven't moved yet, which you would think that demand was there. So should we think pricing is going to have to move for you in the industry to kind of keep the demand flowing?\n\nPaul Jacobson -- Executive Vice President, Chief Financial Officer\n\nSo, Colin, I'll take a shot. Mary, you can add anything. Certainly, I think this comes down to the question of how much pent-up demand is there, which I don't think is necessarily specifically knowable over time. But what we're really focused on is trends going forward and managing to those trends as best we can throughout this year.\n\nThe customer has obviously been very resilient. And I think that speaks to the quality of our products and what it's not. So I don't think that piece is going to change. I think the industry could normalize.\n\nWe could see that, although I don't think we see big increases in production going forward. So depending on how that pent-up demand shakes out, I think that will affect inventory. But what you're hearing from everyone in the industry learned in inventory management over the last couple of years. And we, ourselves, have cited some of that.\n\nSo even if we assume some slight softness in '23, as I talked about on the SAR side, we're not seeing it as sort of a major shakeup.\n\nColin Langan -- Wells Fargo Securities -- Analyst\n\nGot it. And then just following up on the questions around the IRA. Just for clarification, I think you said you see, I think, over 10 years, the potential to get the full $7,500. I mean -- and then out the gate, you think you can get the $3,750 for sort of the battery component part of it.\n\nI mean I wasn't sure if the $7,500, there's also the commercial credits? Is the $7,500 just for retail buyers that you think is possible, because that sourcing part seems to be the most challenging to get at.\n\nMary Barra -- Chairman and Chief Executive Officer\n\nYes. We think, out of the gate, we're going to be eligible for the $3,750, and we'll ramp to have full qualification in the next two to three years, getting up to the $7,500. So which positions us well to be eligible for the complete credit from the consumer perspective. The $7,500 one, through the 10 years, it just takes a couple of years to ramp up based on our expectations with the supply moves that we've already made.\n\nAnd then as I mentioned, there's also the -- to leverage the tax credit of up to $45 per kilowatt hour with battery cells and battery modules produced in the U.S., again, we're well positioned there. And then the commercial incentives, I think, are going to be very important, especially with BrightDrop, our fleet and rental car. So those opportunities as well as used EV purchase incentives as well. So again, we're waiting to see what treasury does from a rule perspective, but those are just a few of the opportunities we think we're well positioned for and, frankly, better than most.\n\nOperator\n\nOur last question comes from James Picariello from BNP Paribas.\n\nJames Picariello -- Exane BNP Paribas -- Analyst\n\nJust at a high level, the sequential walk to the full year adjusted EBIT midpoint of $14 billion, just curious if you could provide the major puts and takes to get to the midpoint. Obviously, it would be a sequential decline in the fourth quarter relative to a very strong third quarter. Yes, just any color there would be great.\n\nMary Barra -- Chairman and Chief Executive Officer\n\nPaul, do you want to take that?\n\nPaul Jacobson -- Executive Vice President, Chief Financial Officer\n\nYes, sure. So I would say, it starts with the wholesale. Obviously, we had a really strong quarter as not only were we able to produce, but we also cleared out 75% of that. So it was a little bit front-weighted.\n\nIf you recall back in the June quarter call, we talked about being 50-50 of clearing those out. So there's nothing sequentially different about the business that we're talking about. But I would expect that we cut wholesale a little bit, just off of the fact that we cleared out the majority of those vehicles from June.\n\nJames Picariello -- Exane BNP Paribas -- Analyst\n\nOK. And just on that, in terms of the 25% to 30% wholesales growth, is there a bias toward the lower half of that range based on how supply chains are shaping up and how the third quarter came in? Or how should we think about that?\n\nPaul Jacobson -- Executive Vice President, Chief Financial Officer\n\nYes. No specific commentary on that range. As Mary highlighted, while the chip and the logistics environment is generally improving, there are still some short-term impacts that we digest on a regular basis. And the team does a good job of working through, though, but I wouldn't want to get more specific than the 25% to 30%.\n\nOperator\n\nThank you. I'd now like to turn the call over to Mary Barra for her closing comments.\n\nMary Barra -- Chairman and Chief Executive Officer\n\nWell, thank you, Madison. And I just have a couple of comments to close the call. First and foremost, I hope everyone is hearing that the entire team is focused on meeting our commitments, and it's driving results that support the rapid scaling of our EV business and driving continued strong margins. I think over the last two years, especially, we've demonstrated resiliency and the ability to manage headwinds.\n\nMany times, that have even been stronger than we've seen in the past. And going forward, we'll continue to show that agility and resiliency and adjust whenever we need to do what we need to do to stay on track. And so I'm very confident of our transformation that's underway, and I think next year is a big year for us. You'll hear at our Investor Day in November much more about the EV strategy, including the KPIs.\n\nSo I hope you will attend. And Paul, Kyle, Dan and I thank you for the questions today, and we look forward to seeing many of you there. And again, couldn't be more committed to where we are, clearly in execution mode from a GM perspective with our EV/AV strategy. So thank you, everyone.\n\nHave a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAshish Kohli -- Vice President, Investor Relations\n\nMary Barra -- Chairman and Chief Executive Officer\n\nKyle Vogt -- Chief Executive Officer, Cruise\n\nPaul Jacobson -- Executive Vice President, Chief Financial Officer\n\nJohn Murphy -- Bank of America Merrill Lynch -- Analyst\n\nJoseph Spak -- RBC Capital Markets -- Analyst\n\nRod Lache -- Wolfe Research -- Analyst\n\nItay Michaeli -- Citi -- Analyst\n\nRyan Brinkman -- JPMorgan Chase and Company -- Analyst\n\nMark Delaney -- Goldman Sachs -- Analyst\n\nAdam Jonas -- Morgan Stanley\n\nDan Berce -- President and Chief Executive Officer, General Motors Financial\n\nEmmanuel Rosner -- Deutsche Bank -- Analyst\n\nColin Langan -- Wells Fargo Securities -- Analyst\n\nJames Picariello -- Exane BNP Paribas -- Analyst\n\nMore GM analysis\n\nAll earnings call transcripts"
}