{
  "companyName": "Vitru Limited",
  "companyTicker": "VTRU",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/26/vitru-limited-vtru-q2-2022-earnings-call-transcrip/",
  "content": "Vitru Limited (VTRU 0.45%)\nQ2 2022 Earnings Call\nAug 25, 2022, 4:30 p.m. ET\n\nOperator\n\nGood evening, ladies and gentlemen, and welcome to Vitru's second quarter 2022 earnings conference call. Good evening, ladies and gentlemen, and welcome to Vitru's second quarter 2022 earnings conference call. All participants are in a listen-only mode now. Later on, we will conduct a question-and-answer session and instructions will follow at that time.\n\nAs a reminder, this call is being recorded and will be available on Vitru's IR website. Now I'd like to introduce your host for today's conference call, Mr. Carlos Freitas, Vitru's CFO. Please, you may begin.\n\nCarlos Freitas -- Chief Financial Officer and Investor Relations Officer\n\nThank you, operator, and good afternoon, everyone. Thanks for joining us again. It's a real pleasure to be here with you all for the release of our second quarter 2022 numbers. Here with me, I have Pedro Graca and William Matos, our co-CEO, Maria Carolina Goncalves, the head of our IR department; and Raquel Suzaki, [Inaudible] Nicolas Silva and [Inaudible] from our investor relations team.\n\nA slide presentation will be part of today's webcast, which is available at Vitru in our IR website at investors.vitru.com.br. So I trust you all have this presentation in front of you. And before we begin, I'd like to make note that as detailed on Slide 2 of the presentation, safe harbor is, in fact, for this call. So now I invite you all to go to Page 4 of this presentation, in which we have the main highlights for this quarter.\n\nAnd clearly, this quarter, the most important highlights were linked to the closing of the bills combination with UniCesumar, which we closed on the 20th of May, we created with this the leading player -- the largest player in the Brazilian digital education space. So both institutions were already growing a lot organically. And now with the two combined, we are now the No. 1 player in Brazil in digital education for higher education space.\n\nWe also updated our governors with the appointment of new members of our board of directors, including two people from the Matos family, the one that created and managed into the market for 30 years. So the professor Wilson Matos is now our vice chairman for the board, and the definition of the new offers structured with the new C-level team that I'm going to show you a bit later. We also had the issuance of debentures for BRL 1.95 billion in May of this year to finance a part of the transaction. And of course, we kicked off the integration process that we have been preparing for in the last nine, 10 months since the signing of the deal in August of last year, aiming at ensuring as smooth as possible process and to capture substantial synergies as we have already presented to you all in the past.\n\nSo in terms of financial indicators, the summary for the quarter on Page 5. Here, we have the indicators both on organic and consolidated basis. So here throughout the presentation and in the release material as a whole, we're going to provide you information with only Vitru stand-alone before the combination and a consolidated basis as well consolidated units of the market between May 20 and June 30. So with 42 days of UniCesumar so that you can have as much information as transparent as possible so that you can make your appropriate analysis.\n\nSo here, net revenue this quarter increased around 75% compared to the second quarter of last year. And the consolidated overall net revenue was up 85% this quarter. And this is with 42 days of UniCesumar. The organic growth was 33% for net revenue in digital location on the rev rate for Uniasselvi and 26% for Uniasselvi as a whole on an organic basis.\n\nSo strong growth in topline. The adjusted EBITDA increased more than 100%, 108% this quarter with the margin reaching 38%, margin on an organic basis was 34% this quarter and a growth in EBITDA of 28% when take the account of Vitru before UniCesumar. In terms of adjusted cash flow from operations, a strong increase as well, almost 97% -- 97.2%, sorry, this quarter, with a nice cash conversion of 83% as well. And in terms of adjusted net income, it was high, it was up 168% with UniCesumar reaching 63%, BRL 50 million.\n\nSo here, in cash flow and net income, we don't have the organic numbers because things start to be mixed between UniCesumar and Uniasselvi. But whenever we can, we're going to show you the organic and the overall numbers with and without UniCesumar. On Page 6, you have our C-level team, which includes executives who came from both UniCesumar and the former Vitru, before the business combination. So since the signing of the deal, it was quite clear to us that we were going to combine two winning companies with similar and winning cultures and that we all would benefit from this smooth integration process, bring together the two leading teams.\n\nThat's why for that we decided to, as I mentioned before, to have two co-CEOs, co-leading the company, Pedro Graca, former CEO of Digital; and William Matos, which was the former head of Digital Education at UniCesumar. The idea here is to have -- not have a takeover of one culture over the other, there is to brand and put together the two winning entities. So with that, we have a stronger and faster integration aiming at creating value for the students and for our stakeholders. So here, the team -- at the C-level team, we are basically with people from more or less half coming from a UniCesumar, half coming from former Vitru, still to position us to be filled including the head of people and management.\n\nSo we wanted to have a person from outside to lead the HR exactly to have this message that we are not using our force in one culture over the other. The idea is here to have somebody from outside to lead the HR department of the company. And for integration, I mean, before the closing, we had an in-depth analysis of opportunities in terms of cost and expense synergies between signing and closing. Part of it was already captured and part will be captured throughout this year.\n\nWe have as well several commercial initiatives that are net respecting the specifics as each brand and several products, each of them with a given action plan with the owner, with a list of deliverables, effect of prioritization and regular follow-up. So we are really on an integration mode with our mindset focused on integration. That's the No. 1 priority for everybody here at Vitru.\n\nOn Page 7, this is just as a reminder, the main levers of synergies that we are pursuing. This was showed to you in May when we closed the transaction. So for example, in terms of opex, we have optimization of payroll costs, gain of scale as a whole in contracts, for example, we have improved collection practices for Uniasselvi and retention practices as well for -- within UniCesumar that is going to be useful for Uniasselvi. And for us, I mean, it was very clear that we have identified two, let's say, crystal clear opportunities regarding the exchange of best structures.\n\nWhen we talk about retention and customer experience and even, I'd say, collection process, UniCesumar has done a better job. So as I was saying, when you talk about the collection process and view the experience as a whole for Uniasselvi, either benchmark for Uniasselvi. And when you talk about pricing throughout the last years, I guess that Uniasselvi have done a quite nice job regarding average ticket and pricing, which is going to be very useful for UniCesumar going forward. So we also have this type of cross knowledge going on throughout the company.\n\nAnd of course, a faster opening of new hubs, the cross-selling and new course has been opened within UniCesumar and within Uniasselvi. So this is a major opportunity for us all. Now on Page 8, just a quick reminder of what we delivered in the last two years. So now we are going to complete two years after our IPO in September next month.\n\nSo within these two years, I guess, we have delivered on our plan in terms of ramp-up of current hubs, opening up new hubs, the new courses that were offered and of course, the inorganic growth. I'm going to go into details of each of these levers in the next pages. On Page 9, you see the maturation curve both for Uniasselvi and now for UniCesumar. I mean this is the most important driver for organic growth.\n\nThe maturation of the current hubs only -- we have a maturation index on average of 43% of the potential of the hubs of both Uniasselvi and UniCesumar. So you see here the curve is very, I would say, stable for Uniasselvi and UniCesumar. In terms of UniCesumar, the dark blue area here, which are the older hubs, they have a different profile than the case of Uniasselvi. In terms of Uniasselvi, they are more or less stable over time because they are I'd say, in full capacity, but in the case of UniCesumar, we have 36 hubs that are still maturing.\n\nThey were opened at the end of '16. So they are not yet fully mature, that's why they are growing over time. But the message here is that we have an important driver for the potential of expected hubs, which is growth with limited execution risk. On Page 10, the expansion of the digital education, undergraduate students and the number of hubs per region, major, major growth with the deal with UniCesumar.\n\nSo if you hear throughout the country, we are growing 100% in some regions, 360% in the Southeast, for example, and when you see the number of hubs, we went from 800 hubs one year ago to now more than 2,000 hubs throughout Brazil, including more or less a third of them in the Southeast. So as we have been always saying, the Southeast is the next frontier for growth. And we are going to open a lot of Uniasselvi hubs there with partners of UniCesumar that are there in cities in which you don't have both brands. On Page 10, the new courses.\n\nThis is not new to you. We have nursing already in operation for one year now in Uniasselvi. Nursing starting out this year at UniCesumar. And in the future, we will have law and psychology, which is also going to be very important to sustain tickets and to expand the overall market for digital education in the country.\n\nOn Page 12, the usual slide that we bring showing the public information and public indicators to show that our technology and our customer experience is, I'd say, different. And on the last part, we have our apps ranked as the two best apps both by -- on average, both Apple Store and Play Store. These ranks provided and the grades given by our customers. And on the right part of the slide, the latest numbers for Reclame Aqui, in which both brands are the best grades, the best numbers within all listed players in Brazil.\n\nOn Page 13, the geographic footprint, as I always said, is very complementary on a geographic perspective. We have now more than 700 cities with only one brand presence. So now we are already opening some hubs in some of the cities with the other brands. We are planning a lot of the expansion for next year, we are going to have more hubs open than usual, accelerating the growth throughout Brazil.\n\nSo now on Page 14. The growth was once again led by this allocation undergraduate segment in which we reached 741,000 students in June of this year, being the No. 1 player in the country, a growth of 140% being around 19% organically with Uniasselvi and in total, 811,000 students in both brands. When you see the intake in average ticket, you see different profiles here. Uniasselvi -- we haven't disclosed number, it grew 29% in intake this fourth quarter -- fourth semester, sorry, of this year compared to the same period of last year.\n\nWhile UniCesumar had very strong growth, much I'd say, stronger than that of Uniasselvi. On the other hand, in terms of ticket, Uniasselvi increased average ticket of 13%. And it's important to highlight that most of this increase in case of Uniasselvi is not linked to the mix effect. I mean, there is a mix effect that accounts for around two points of this 13 points.\n\nBut most of the increase is real apple-to-apple increase in every ticket in case of Uniasselvi. In UniCesumar, there was a very, very strong growth in intake, so as you know, average ticket of seniors is usually higher than the average ticket of newcomers. That's why at the end, there was a decline of 2% in the average ticket of UniCesumar. So for this year, we shall still see a growth in the case of average ticket of Uniasselvi, we shall still see a likely slight decrease in the ticket of UniCesumar because of its growth, a very strong growth that UniCesumar has in the intake.\n\nAnd going forward, I mean, over the medium term, we are going to use the expertise of Uniasselvi in pricing and tickets to improve over time the average ticket of UniCesumar. On Page 15, net revenue, gross profit and adjusted EBITDA for the company. So 85% growth in net revenue, 78% growth in gross profit and 108% growth in adjusted EBITDA. So now we're going to go in detail in each of these ratios.\n\nSo on Page 16 and 17, the sources of growth in net revenue, it was boosted both by digital education undergrad segment as a whole. As you see here on Page 16, for example, that in case of Vitru, there was BRL 46 million increase in revenue in Digital Education Undergraduate, a 33% increase quarter-on-quarter, but also, of course, the contribution of UniCesumar. UniCesumar, as a whole, accounted for almost BRL 100 million in new revenues only for Vitru in this 42 days of consolidation, mostly coming from Digital Education Undergraduate. So now when you see the breakdown on Page 18.\n\nSo on a quarterly and on a semiannual basis, no big news here. Most of the revenue of Vitru was already coming from Digital Education. And here, we provide a breakdown of the revenue of UniCesumar within the 40 days, which is more or less the breakdown that UniCesumar has on a yearly basis. So it's more or less 60% coming from Digital Education Undergraduate, around 22%, 23% coming from medical education and 15%, 16% coming from other on-campus courses.\n\nMost of it coming from health courses. So in total, around three-fourths -- so 75% of the revenue of the own campus business of UniCesumar comes from health, being medical or other health courses. On Page 19. Here is more detail on the breakdown of the intake base as a whole.\n\nSo here, first to pie charts, the intake over time of Uniasselvi, for example, and the two pies in the bottom part of the slide, the breakdown of the base as a whole as of June. So here, a couple of messages. And the first one is that we are increasing slowly but steadily the weight of digital education health courses. At Uniasselvi, for example, it was 24% of intake last year, now it's 25%.\n\nIt is 22% of the base. So over time, the base is going to increase. And for UniCesumar, it's only 19%. So we already launched some new courses now in the second half of this year, now in July.\n\nWe launched at UniCesumar some health courses that were already available within Uniasselvi and that we didn't have in the portfolio of UniCesumar. So over time, we shall have a slightly bigger weight of health quarters, not only at Uniasselvi, but also at UniCesumar. And also important to show here on the left, the overall growth in net revenue as a whole. So 33% organically for Uniasselvi, and overall, 75% with UniCesumar based with 42 days of UniCesumar.\n\nThat reinforces the resilience and the differentiation and the scale that we have been able to achieve with both brands. And scale in this business is important. Scale is important to generate cash flow, to invest in technology, to provide better services for our students and at the aim to keep creating value for students, for the shareholders and all the stakeholders. On Page 20, a snapshot on medical education, the medical business, which now is a bit more than 1,800 students, 348 seats in medical education, one of the best medical courses of Brazil is the high demand course, which accounted in 42 days with BRL 22 million with average ticket of slightly more than BRL 10,000, a very resilient revenue stream and still maturing over time.\n\nAnd on Page 21, the other two segments, the on-campus as a whole segment, which includes medical education, but here we have the highlights of the ex-medical on-campus numbers. So a decline in the organic numbers for Uniasselvi, which is, let's say, normal and aligned to our vision that this is a segment that we expected to decline over time. But of course, with the condition of UniCesumar, this increased by 100%, given the strong health courses of UniCesumar. And on the continuing education side, this is a business that on an organic base basis was more or less stable over time, a slight increase on a quarter number of UniCesumar.\n\nThis was, as I said before, in the previous quarter, this was impacted by the reduction throughout last year in the average length of graduate courses. So most of the shift is over, but -- so we expect revenue to grow going forward. But in the first, I'd say, six months of this year, we had a shift in the size -- in the length of the quarter. So this is a business that did not grow much in the first six months of this year.\n\nSo now -- so the -- when you say about EBITDA on Page 22 and 23. So on 22, just as a quick snapshot, we had an increase of 28% on an organic basis and 108% on a full basis with a gain in margin, organic gain of 0.6 points for Vitru without UniCesumar and a 4.2 points gain in margin, when including UniCesumar during quarter two. So we already told you in the past that for a number of reasons, UniCesumar has a higher margin -- EBITDA margin than the former Vitru. So last year, for example, Vitru had an EBITDA margin of around 29%, while last year, UniCesumar had a margin of around 39%.\n\nSo 10 points of difference for a number of reasons. So with the combination of both entities, our weighted average margin is a bit higher now to closing to 34 points -- 38 points this quarter and 34 points in the semester. On Page 24, cost of service, of course, on organic basis, we had more or less stable costs as a percentage of net revenue for Vitru before UniCesumar, even despite the resumption of classes meetings, both at hubs and campi. And with UniCesumar, we had a slightly lower gross margin basically because of the higher relevance of the on-campus segment for UniCesumar.\n\nSo the on-campus segment has a lower gross margin. So the overall consolidated number is slightly lower. So cost of service increased a little bit as a parentage of net revenue with UniCesumar. For G&A, we are more stable over time, around 7% of net revenue.\n\nSo with this deal with UniCesumar, we are more or less maintaining our lean structure at around 7% of net revenue which is quite low and one of the lowest numbers in the industry. On Page 25. Selling expenses PDA, we have lower CAC, lower PDA expenses as well. So on the left part of the slide, we had a slight organic increase for Uniasselvi and Vitru to around 20%.\n\nBut a lower CAC basically because we had a higher intake than this number. So the customer acquisition cost for Uniasselvi, it was around 5.5% lower, the first intake of this year compared to the first intake of last year. And in the case of UniCesumar, the marketing and selling expenses as a whole for UniCesumar are much lower as a presentation of revenue than in the case of Uniasselvi. And that's because the hubs of UniCesumar are much more active in the sale process because they have a higher -- a higher percentage of the revenue share that we have.\n\nSo -- in the case of Uniasselvi, this number on average today is around 23%, 24% of the net revenue of the Digital Education Undergrad segment. In the case of UniCesumar, it is around 34%. So UniCesumar had a higher capacity, a higher revenue share. And on the other hand, the hub owner, the partner, is more responsible than in the case of Uniasselvi for the intake process.\n\nAnd on the PDA part here on the right part of the slide, we have a slightly lower organic PDA is in the case of Uniasselvi quite a small reduction, which I guess, a nice achievement because of the current market conditions. And in the case of UniCesumar, as I mentioned before, they have superior collection and retention procedures and process and methodology as a whole. So they have quite low PDA expenses and a presentation of net revenue. And at the end, on a full consolidated basis, our -- this quarter, our PDA went down from 16.8% last year to around 16.2% on organic basis this quarter only Uniasselvi and 12.5% of net revenue when it take into account, UniCesumar.\n\nAnd last but not least, on Page 26. We had solid growth in adjusted net income and adjusted cash flow from operations following this business combination, a growth of 169% in adjusted net income this quarter, given the contribution of UniCesumar and a very nice cash flow generation from operations of 73% -- BRL 73 million, sorry, this quarter including the 42 days of UniCesumar. So there was a increase -- strong increase this quarter and in the semester with less than half of the quarter. So UniCesumar is a big cash flow generator.\n\nAnd this cash flow generation is an important pillar as well in our overall financing strategy, in our deleverage process over time. So now that's it. And now I'd like to open for questions.\n\nOperator\n\n[Operator instructions]. And our first question comes from the line of Vitor Tomita from Goldman Sachs. Please proceed with your questions.\n\nVitor Tomita -- Goldman Sachs -- Analyst\n\nGood afternoon, everyone. And thank you for taking our questions. We have two questions from our side. The first one, if you could give us some initial color on how you're seeing competition and pricing trends in the current intake cycle so far? And the second question from our side, if we may, would be, if you see any room for further reduction in the length of continuing education programs over the long term given that that seems to be a start of a trend in global education? Thank you.\n\nCarlos Freitas -- Chief Financial Officer and Investor Relations Officer\n\nFor the continued education part, I mean, continued education in our case, most of the business today is formed by graduate courses. So in graduate courses, we don't expect further reduction in the land of graduate courses as a whole. At the end, it is, I'd say, on a pedagogical perspective, it's not I'd say, likely that there will be further reduction in the overall length of courses for graduate courses, I mean, for regulated graduate courses as we offer. What will happen and that we are already working a lot on that.\n\nI'd say there is some growth, not yet, nothing outstanding to be shown, but we are slightly steadily growing in technical courses in other courses as a preparation for the first job and the free courses as we call it. So this is also part of continued education, and that once we have more I'd say, scale in this business, we're going to show some numbers of our debt. So going forward, continued education will be a kind of a blend of graduate courses with other courses as a whole for the market. So far, it is realized much more concentrated in graduate courses.\n\nAnd as I told you, we don't expect further reduction in the average length of these courses now. So the first question about competition, what we are seeing in the first month of this intake cycle, is nothing very different from what we saw in the first half of this year. So it is a competitive market. We are seeing that -- in the case of the intake of Uniasselvi, we are growing the same levels as we've been growing the last year, a bit more than 20% intake.\n\nAnd a bit more than that in case of UniCesumar. UniCesumar has been growing more than Uniasselvi. On the other hand, as we saw in the first semester of this year, the ticket of UniCesumar because of this strong growth, they are more or less 2%, 3%, 5% lower than what we saw last year as we saw in the first semester of this year. So on the other hand, in the case of Uniasselvi, we are still seeing the growth as we have been seeing in the last, say, semesters.\n\nSo nothing different from what we saw in the first half of this year. Over time, as I said, we are going to work more on the pricing and positioning of UniCesumar aiming at improving tickets over time. We don't expect this to be, say, to have major changes in the second semester of this year and realize most of the intake is -- a big chunk of intake is over or is -- most of it is being accomplished now in the case of UniCesumar. So we shall see the same trends that we saw in the first semester of the year.\n\nBut it is a competitive market. It has always been. And in this market, we have been able to differentiate ourselves either in terms of faster growth and/or in terms of tickets.\n\nVitor Tomita -- Goldman Sachs -- Analyst\n\nVery clear. Thank you very much.\n\nOperator\n\nThank you. Our next question comes from the line of Fred Mendes from Bank of America. Your question, please.\n\nFred Mendes -- Bank of America Merrill Lynch -- Analyst\n\nHello. Good evening, everyone. Thanks for the call. I have two questions here.\n\nThe first one is about the average ticket increase, a very strong amount of inflation 12.5% year-over-year. If you can just give us an idea if it's possible, about the -- what is the impact from our premium costs versus what is the impact of actual price increase here? This will be the first one. And then the second one has been securing a news of a potential sale of the medicine business. Just wondering if that makes sense.\n\nIt doesn't anyway, any color you can give here if it makes sense or not, this would be great. Thank you.\n\nCarlos Freitas -- Chief Financial Officer and Investor Relations Officer\n\nThank you, Fred, for your questions. I mean the second question regarding the potential sale of the on-campus and medicine business. I mean, we issued a venture for the deal with UniCesumar. We now have a, I'd say, I have debt we know that we can generate cash flow to service the debt, but we are actively working in alternatives to accelerate the deleverage.\n\nAnd we have three options. The first one is to go to the market to have a follow-on, not an option today. It may be an option in a few months, but not today. So we must have the market open.\n\nSecond one is to have a private capital increase and we have been approached by a number of players that wanted to find and inject money and to participate in the growth of Vitru. And a third one can be the sale of part of the business, namely medicine or with part of the on-campus as a whole segment. Nothing substantial here, nothing firm here. But again, we have been approached by a number of players over time interested in our medical business -- sorry.\n\nSo we have been approached and this is a possibility that we can execute in the future. Nothing firm right now, it's looking more than a rumor right now. Your first question was about the increase in tickets. So we increased almost 13%, 12.8% increase in the ticket of Uniasselvi this semester.\n\nAs I said, most of this effect is not due to mix effects of the premium core business. So as we have in the presentation, the breakdown of intake at Uniasselvi in the first half of last year, first half of this year, there was a slight increase in the overall health cost, for example, which have every ticket of a bit more than BRL 400. So we have an average ticket of about BRL 208, more than BRL 400 in health and a bit around BRL 250 for the non-premium courses. So when you see -- when we isolate the mix effect, the change in health course, for example, this number of 13% goes down to around 11%, 11.5%.\n\nSo it is not the most important driver. The driver here was a real pricing strategy on a SKU by SKU basis, on an apple-to-apple comparison. So we increased ticket for seniors in the beginning of this year. We increased a ticket for newcomers.\n\nI mean the intake, our average price for intake in the first semester of this year was also close to 10% higher than what we had in the first semester of last year. So I mean, so these numbers are a function of our strategy to maximize profitability and to lever on our competitive advantage and our hybrid model of Uniasselvi in which we provide a nice term for our customers.\n\nFred Mendes -- Bank of America Merrill Lynch -- Analyst\n\nPerfect, Carlos. Super clear, and thank you very much.\n\nCarlos Freitas -- Chief Financial Officer and Investor Relations Officer\n\nThank you, Fred.\n\nOperator\n\nThank you. Our next question comes from the line of [Inaudible] from BTG. Your question, please.\n\nUnknown speaker\n\nGood evening, William, Carlos. Good evening, everyone. There are two questions on our side. The first one regarding UniCesumar, looking at UniCesumar's stand-alone numbers, we do see like a strong growth in intakes but slightly more aggressive prices.\n\nAnd should we see this pricing strategy going forward in UniCesumar's operation? Or should we see something more close to what we see Uniasselvi with better pricing dynamics. And the second one is if you could give us more color on the 28 million nonrecurring costs related to restructuring and M&A expenses. Are you improving UniCesumar's infrastructure, hiring new features? Or is this mostly related to M&A fees. That's it.\n\nThank you.\n\nCarlos Freitas -- Chief Financial Officer and Investor Relations Officer\n\nSo the restructuring and M&A costs for this quarter, and it was a different quarter around BRL 28 million, BRL 29 million of this cost. Most of it is related to the M&A. So mainly the fee that we pay to our advisor in the acquisition. So this represents, I'd say, two-thirds of this number.\n\nAnd the integration itself, integration itself is the difference is with integration is around BRL 6 million more or less in the quarter, so around BRL 2 million per month that we spent in the second quarter of this year. For the intake of UniCesumar going forward, I mean, in the short term, in the short term, meaning this current quarter and this current semester, we shall expect the same trend for UniCesumar. So a stronger growth than Uniasselvi, had lower tickets. And so this is the trend that was already put in place before the combination.\n\nSo as a reminder, before the closing of transaction, we discussed opportunities for cost and expenses synergies, but we could not discuss strategies for pricing, et cetera. We were very strict in our cleaning transaction. We discussed opportunities for cost and expense synergies, but we cannot discuss strategies for pricing, et cetera. We were very strict in our cleaning approach, that we shall not discuss strategic issues before the closing.\n\nSo the strategy for the intake in the second semester was already given basically. So what we should expect for the second semester is more or less what we saw in the first semester, strong growth in the case of UniCesumar at a slightly lower ticket. And going forward, I mean, starting next year, we are going to work basis. So what we should expect for the second semester is more or less what you saw in the first matter strong growth in the case of UniCesumar at a slightly lower ticket.\n\nAnd going forward, I mean, starting next year, we are going to work to improve tickets as a whole within UniCesumar, trying to have something closer but not equal to what we have in the case of Uniasselvi. In Uniasselvi we have been growing constantly over time, intake between 20% and 30% each period is intake with a growth in every ticket, closer inflation, sometimes higher, sometimes lower usually slightly lower than inflation this is approach of Uniasselvi in the last two years more than. Over time, we are going to work closely and to try to push up a little bit the tickets of UniCesumar is not going to be easy because it's a very competitive market. But UniCesumar had quite, say, a quite good put, the quality of the differing product of UniCesumar is quite unique.\n\nSo we're going to lever on that.\n\nUnknown speaker\n\nAll right. Pretty clear. Thank you.\n\nOperator\n\nThank you. [Operator instructions]. Our next question comes from the line of Mauricio Cepeda from Credit Suisse. Your question, please.\n\nMauricio Cepeda -- Credit Suisse -- Analyst\n\nHi, everyone. Thank you for the space here in the call. So I have some questions. The first one is more operating about the retention versus the ticket I saw that Uniasselvi had a good performance on tickets as you were saying.\n\nBut I thought also that the retention rate was a little bit worse than what it saw previously in the country for UniCesumar, right, the ticket was -- did not perform well. I understand there was an impact from the newcomers, but retention rate was pretty good. So I would ask exactly what may be happening to create such differences in performance? The second question about the -- let's say, the adjustments to the EBITDA. You mentioned a little bit about the M&A, but there is also some adjustments about stock options.\n\nI see that they saw that particularly stock options were a little bit higher than the usual levels. So my question would be from all these adjustments, I understand that M&A would be BRL 2 million per quarter, as you say. But from these other adjustments, if there would be any kind of recurring expenses or may reflect negatively in the following quarters. And about the operating performance, I understood that the operating margin was better if we exclude these effects, but is it exclusively because UniCesumar has a better margin? Or it has any relation to actions on synergies that may have been taken before or by the time of the consolidation?\n\nCarlos Freitas -- Chief Financial Officer and Investor Relations Officer\n\nLet's start with the third question, [Inaudible] for question. Regarding the gross margin and margins as a whole, the business of UniCesumar has a higher overall EBITDA margin than the case of Uniasselvi. We do have some synergies in this 42 days. But most of the synergies that we are going to see in the second semester of this year.\n\nWe do have some synergies here. But I'll guess that there will be more, say, positive surprises going forward. But it was already, I guess, part obtained in the first -- in the second quarter of this year. For the adjustments, I mean, we defined for the IPO, I mean, two years ago, how we're going to report adjusted EBITDA.\n\nAnd for example, sale of stock option, in our stock option plan, it is a noncash settlement plan. So that's why we defined in the past that this was going to be excluded from the adjusted EBITDA release. The increase -- the special increase for this quarter was basically because of the consolidation of UniCesumar. The way we calculate the expenses, we have a bigger company now.\n\nAnd so when we do the calculation with the black and shows, etc., we have a higher, say, value for these options and the value of these options, the difference, the increase in value over time is recognized in the P&L and adjusted when we release the adjusted EBITDA numbers. So -- but those are the type of adjustments that we defined two years ago, that we are maintaining this definition. Regarding retention, there is an important difference here in the case of Uniasselvi compared to UniCesumar. But you're right that the retention of UniCesumar increased this quarter, for example, compared to what we had last year.\n\nAnd we included in our website a spreadsheet with some numbers -- from historical numbers for UniCesumar so that you can all have as much information as possible so that you can compare and understand the sources of the numbers. So it is true that the UniCesumar has a overall retention increase, which is not the case in the case of Uniasselvi. And one important driver here was worth health courses. The health courses in which Uniasselvi is increasing.\n\nHealth is very nice. You have a large addressable market. You have much higher tickets. The down part of health course in distant learning is that the dropout ratio is higher, especially in the first semester or first year.\n\nSo in our healthcare quarter to have two meetings per week, for example. And we know that some newcomers in the first semester, they have difficulties to adapt to this model. So that's why most of the dropout takes place in the first semester. That's true for all distant learning and especially true in the case of health quarters.\n\nSo UniCesumar is increasing the weight of health quarter in our overall base over time. So dropout is bigger in the first semester in this case. And when you see about tickets, I guess that you are fully right that we shall always analyze this with a three -- with triangle perspective. We have overall tickets, overall retention and overall base -- student base.\n\nSo our student base is growing over time. So we have a strong intake, a slightly higher drop out. But at the end, a very solid ticket. And at the end, net revenue increasing more than 20% on an organic basis.\n\nSo it is -- we don't give discounts to the renewal process of seniors. We don't. So this is a -- we know that some peers do it. So it is always a trade-off between maintaining the students or maintaining every ticket and that's a, I'd say, unstable equilibrium, not easy, but we usually prefer to maintain a health ticket even at the expense of higher dropouts.\n\nAnd of course, in the first half of the year -- first semester of the course, this is very dramatic. And Uniasselvi is going to benefit from the overall user experience and retention process and overall handholding that is provided by UniCesumar to its students. So this customer experience, this customer centricity, I guess, is a quite nice benchmark for Uniasselvi and Uniasselvi going forward is going to benefit from this knowledge of UniCesumar.\n\nMauricio Cepeda -- Credit Suisse -- Analyst\n\nVery clear. Thank you, Carlos.\n\nCarlos Freitas -- Chief Financial Officer and Investor Relations Officer\n\nThanks, Cepeda.\n\nOperator\n\nThank you. This does conclude the question-and-answer session of today's program. I would like to hand the program back to Carlos Freitas with us for any further remarks.\n\nCarlos Freitas -- Chief Financial Officer and Investor Relations Officer\n\nSo thank you all for [Technical Difficulty]. We are very honored and very proud that this is the first release of UniCesumar together with Vitru, a new company. And anyway, we are available for further questions. Thank you, and good evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCarlos Freitas -- Chief Financial Officer and Investor Relations Officer\n\nVitor Tomita -- Goldman Sachs -- Analyst\n\nFred Mendes -- Bank of America Merrill Lynch -- Analyst\n\nUnknown speaker\n\nMauricio Cepeda -- Credit Suisse -- Analyst\n\nMore VTRU analysis\n\nAll earnings call transcripts"
}