{
  "companyName": "908 Devices Inc.",
  "companyTicker": "MASS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/908-devices-inc-mass-q2-2022-earnings-call-transcr/",
  "content": "908 Devices Inc. (MASS 2.15%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nHello. Thank you for standing by, and welcome to the 908 Devices' second quarter 2022 financial results conference call. [Operator instructions] Please be advised that today's conference may be recorded. I would now like to hand the conference over to your speaker today, Kelly Gura, investor relations.\n\nPlease go ahead.\n\nKelly Gura -- Investor Relations\n\nThank you. This morning, 908 Devices released financial results for the second quarter ended June 30, 2022. If you've not received this news release or if you'd like to be added to the company's distribution list, please send an email to ir@908devices.com. Joining me today from 908 is Kevin Knopp, chief executive officer and co-founder, and Joe Griffith, chief financial officer.\n\nBefore we begin, I'd like to remind you that management will make statements during this call that are forward looking statements within the meaning of Federal Securities Laws. These statements involve material risks and uncertainties that could cause actual results, or events to materially differ from those anticipated. Additional information regarding these risks and uncertainties appear in the section entitled Forward-Looking Statements, in the press release 908 Devices issued today. For a more complete list and description, please see the Risk Factor section of the company's annual report on Form 10-k for the year ended December 31, 2021, and its other filings with the Securities and Exchange Commission.\n\nExcept as required by law, 908 Devices disclaims any intention or obligation to update or revise any financial projections or forward-looking statements, whether because of new information, future events or otherwise. This conference call contains time-sensitive information and is accurate only as of the live broadcast, August 9, 2022. With that, I would like to turn the call over to Kevin.\n\nKevin Knopp -- Co-Founder and Chief Executive Officer\n\nThanks, Kelly. Good morning and thank you for joining our second quarter 2022 earnings call. Since we last updated you in early May, the 908 Devices team has continued to make great progress across our business. To start, our second quarter revenue increased 34% over the prior year period to $11.1 million.\n\nWe placed 124 devices, bringing our installed base to more than 2,100 handheld and desktop devices. I'm really pleased with our team's effort to deliver on our commitments to customers in the face of ongoing macroeconomic and supply chain challenges. In June, our team had a strong showing at the American Society for Mass Spectrometry Conference or ASMS. We presented 11 posters and one oral presentation, many alongside our collaborators, including Boehringer-Ingelheim, University of Connecticut, Fudan University, and Dana Farber Cancer Institute.\n\nThere were multiple additional posters by customers and academic institutions that noted the speed and sensitivity of our microfluidic separations technology. It is exciting to see us enabling their work and investigation. A week later, we held our inaugural discovery day for the investor community at our Boston headquarters. It was great to see many of you in person, show off our team's expertise and provide an opportunity for investors to get their hands on our products and truly see the ease of use and value they bring to our customers.\n\nAnd earlier today, we were excited to announce the acquisition of TRACE Analytics GmbH based in Braunschweig, Germany. We look forward to bringing this online bioprocessing capability to our customers. And we'll talk more about how this technology enables and broadens our bioanalytics road map. Discovery, technology and innovation make up the ecos of 908 Devices.\n\nSince our founding 10 years ago, we've been focused on transforming how and where mass spec technology is being used. I'm delighted that we are recognized this month as one of the 100 Best Workplaces for Innovators by Fast Company Magazine, truly honored to work with such a dedicated and inspiring team of people, and I share this recognition with all of them. Now, I'll give you an update on our progress across the five focus areas that are driving growth for 2022 and over the longer term. Starting with our first objective of driving customer adoption.\n\nFor our handhelds, we continue to build a pipeline of testing, trials and pilot programs to drive enterprise adoption. I've previously noted our efforts in Ohio, which is often referenced as ground zero because of the nation's opioid crisis. Multiple drug task forces in the Attorney General's office began deploying the MX908 device for field testing of narcotics in early 2021. And later that year, the AG's office implemented the MX908 pilot program for police departments in three cities.\n\nIn May of this year, we held a half-day summit for 45 state prosecutors, to educate them on how the MX908 works, how it is used for enforcement and the potential for case backlog reduction. This group has significant influence in driving statewide adoption of the MX908, including legislative action and funding allocation. Recently, the Ohio State Prosecutor's Office and the Bureau of Criminal investigation stated their objectives, which includes ensuring that the current backlog of cases will not increase by more than 20%. Data from the MX908 pilot program for the first five months of this year shows a 72% reduction in laboratory submissions from the period prior to the pilot program.\n\nAlso in May, and in Ohio, US representative Kevin McCarthy, the House minority leader, attended a roundtable on border security, where attendees received a demo of the MX908 for drug detection and identification. At the roundtable, Ohio attorney general, Dave Yost, noted that our device can change the pace in prosecuting people that bring poison into our communities. We are working to replicate the success of Ohio across other states and within various local health, safety and enforcement organizations. In fact, we have received more orders from such organizations to date this year than all of 2021.\n\nWe see organizations acquiring the MX908 for a broad range of use cases, including for trace detection of chemicals and incoming mail. As an example, in Bowling Green, Kentucky, our handheld device was recently procured by the Warren County Regional Jail, which has seen a huge increase in drugs coming in personal mail and legal correspondents. And after extensive testing and evaluation, the US Postal Inspection service has placed their first order for several MX908 devices to be used within their dangerous mail investigations program. Overall, we are pleased with the continued adoption of the MX908 in these organizations and the breadth of use cases our handheld customers have for trace chemical detection at the point of need.\n\nFor our desktops, we are employing a penetrate and radiate strategy in which we work to penetrate new accounts, creating foothold and then radiate across these enterprise accounts driving broader adoption and acceptance. To that end, we have seen over the past several quarters, a fairly even split between new and existing customers. And during the second quarter, approximately two-thirds of orders for our desktops came from new customers. I'm really pleased with our commercial team's ability to penetrate new accounts.\n\nIn terms of radiating across accounts, we saw great traction for REBEL during the second quarter in several of the top 20 pharma companies with some of these companies ordering their fifth and sixth REBEL devices. Fate Therapeutics, a biopharma company developing cell therapies for cancer patients, received its second and third REBEL devices. In addition to driving multiple device sales, we are also seeing traction for consumable usage. In fact, more than one-third of our global installed base for REBEL has open-blanket purchase orders for consumables, with a nominal one kit per month consumption plan as devices are adopted into their workflow and process.\n\nTurning to our second objective, accelerating commercialization. At the end of the second quarter, we reached a milestone surpassing 200 employees as we thoughtfully expand our commercial team and add employees across key regions. With the acquisition of TRACE Analytics, we have bolstered our European presence with a legal entity and a base of operations in Germany to better serve our European customers and to support our growing sales and applications team in the region. Turning to our third objective, developing and advancing our product portfolio.\n\nI'm so excited by the acquisition of TRACE Analytics, which strengthens our core technology and unlocks more of our total addressable market. TRACE Analytics provides us with online aseptic bioreactor sampling and biosensor technology, which is a central addition to our microfluidic technology pillar. Their team consists of nine people who bring more than 20 years of technical experience in bioprocess sampling and analysis. Their technology and single-use and reusable configurations has been proven in mammalian cell culture and microbial fermentations at all levels of the bioprocess chain from research and development, to large-scale production.\n\nTRACE Analytics technology includes devices for cell-free, sterile and safe sampling online with no prep required or even sample consumed in many cases. They also manufacture novel biosensors for glucose and lactate, adding additional priority analytes we can measure to our portfolio. Combined, these technologies allow online aseptic sampling, online analysis and automated bio-processor feedback control. Importantly, these technologies are validated by third-party customers.\n\nTRACE Analytics is an OEM partner to Sartorius, providing its online sample and sensors for bioreactor monitoring and control and has a legacy program with Sanofi for online sampling and monitoring their insulin production. We will look to foster these relationships, as well as establish additional OEM relationships for future generations as a base TRACE Analytics technology. We have previously shared elements of our future product roadmap that include development of an online level, and we are confident that the addition of TRACE Analytics technology will help us realize our online development efforts. It also allows us to take a measurable step forward in our goal to build out a connected and comprehensive bioanalytics platform, thereby unlocking our existing addressable market.\n\nTurning to our fourth objective, broadening our bioanalytics platform. I've just shared how TRACE Analytics will expand our bioanalytics capability. And now I would like to provide some recent examples on how our REBEL and ZipChip devices are enabling our customers to measure and monitor both process and product attributes. Researchers at Emory University are striving to prolong antitumor activity in CAR-T cell therapies for cancer patients with the development of novel microbeads libraries for CAR -T cell manufacturing.\n\nOur REBEL device is being used at-line to measure amino acids as process attributes for CAR-T cell activated using these microbeads. Researchers now have a tool to quickly monitor and inform feeding strategies to control and optimize T cell activation. Likewise, researcher at MIT are optimizing recombinant AAV processes used in gene therapy to enable higher yield and efficiency through the monitoring and control of key process attributes. These have designed a continuous perfusion process and have employed REBEL to rapidly monitor and profile nutrient consumption of recombinant AAV producing cells.\n\nAs mentioned earlier, we have had nearly a dozen posters at the Major Mass Spec conference, ASMS in June. Many were collaborators from academic and research institutions, as well as biopharma company. Several posters highlighted the use of our ZipChip for analysis of oligonucleotide and their quality attributes. Traditional workflows for oligo analysis required the use of lengthy liquid chromatography methods along with harsh ion pairing reagents.\n\nOur Boehringer-Ingelheim scientists noted that our ZipChip device provided rapid, high-resolution analysis of oligos with an extremely low amount of sample and without the use of corrosive reagent. And finally, our fifth objective, laying an Omics Foundation. As proteomics and metabolomics research steadily increases, there's a rising demand for accelerating mass-spec-based workflows, which is critical when working with large sample sets. As we have shared, we are advancing our microfluidic chips to address the limitations of liquid chromatography for these unmet needs.\n\nWe are defining our directions of research with world leaders on our scientific advisory board, who convened in Q2 for a collaborative exchange. We are further partnering with leading research institutions and mass spec instrument companies to evaluate the speed and sensitivity of our prototype chips. During the second quarter, there were several collaborative presentations and publications that highlighted our progress in this area. Dr.\n\nJarrod Marto and his team at the Dana Farber Cancer Institute are one of our collaborators. Through posters at the past two ASMS conferences, a presentation at the HPLC 2022 Conference and a recent peer-reviewed paper published an analytical chemistry, Dr. Marto's team have demonstrated what they term work speed profiling of small molecule protein inhibitors using our prototype ZipChip coupled with the Bruker mass spec, which is five to 10 times faster than traditional chromatography methods. In collaboration with the University of Washington and Thermo Fisher Scientific, we are evaluating the coupling of our prototype chips with very fast ion trap mass spec for proteomics applications.\n\nIn the oral presentation at ASMS in June, titled, Pushing the Boundaries of Speed and Sensitivity in Proteomics, Dr. Will Thompson, principal scientist at 908 Devices, demonstrated the ability to target hundreds of proteins from diluted plasma samples in just six minutes. We are excited about the direction and research progress reported this quarter to the scientific community with these advanced microfluidic chips. While these are prototypes, these results serve to demonstrate the ultimate reach of our technology platform.\n\nOverall, I'm encouraged by the enthusiasm we're seeing across our end-market for real-time analytics at the point of need, and I'm very excited to welcome the TRACE Analytics team and technology, both of which will no doubt accelerate our online bioanalytics road map. With that, I will turn the call over to Joe for more detail on our financials.\n\nJoe Griffith -- Chief Financial Officer\n\nThanks, Kevin. Revenue for the second quarter of 2022 was $11.1 million compared to $8.3 million in the prior year period, representing growth of 34%. This increase was primarily driven by product revenue from an increase in both handheld and desktop devices. Handheld revenue from our MX908 product was $6.9 million, an increase of $1.6 million compared to the prior year period, representing growth of 31%.\n\nDesktop revenue from our REBEL and ZipChip products for the second quarter 2022 was $3.7 million compared to $2.6 million in the prior year period, representing growth of 39%. Recurring revenues, consisting of consumables, accessories and service revenue for the second quarter 2022 was $2.9 million compared to $1.7 million in the prior year period, representing growth of 65%. Our installed base grew to 2,142 units with 124 devices shipped during the second quarter. This included 102 MX908 handheld devices, 14 REBEL desktop devices and eight ZipChip interface desktop devices.\n\nGross profit was $6.6 million for the second quarter of 2022 compared to $4.4 million for the prior year period. The increased gross profit was driven by an increase in product and service revenue. Gross margin was 60% for the second quarter 2022 as compared to 53% for the prior year period. The increase in gross margin was due to higher revenue volume, but also a result of favorable channel mix with our MX908 and higher selling prices for our REBEL devices.\n\nGross margin was 55% for the first half, and we continue to expect gross margins to be in the mid-50s for the full year 2022. Total operating expenses for the second quarter of 2022 were $15 million compared to $11.8 million in the prior year period. The increase was driven primarily by headcount expansion across our business and a $1.3 million increase in noncash stock-based compensation, as well as expenses related to marketing activities, material spend and travel. Net loss for the second quarter of 2022 was $8.1 million compared to $7.4 million in the prior year period.\n\nWe ended the second quarter of 2022 with approximately $213 million in cash and cash equivalents. In addition, we had approximately $15 million of debt outstanding. Overall, we are pleased with our first half 2022 performance and the progress we've made toward our stated goals. Looking ahead for the remainder of 2022, we continue to expect full year revenue to be in the range of $52 million to $55 million, representing growth of 23% to 30% over the prior year.\n\nEmbedded within this range, we expect desktop devices relating to biopharma and bioprocessing applications to grow at approximately 50%, nearly two times the growth rate of the overall business. With regards to TRACE Analytics, we do not expect material revenue or earnings impact for 2022. As we progress through the balance of the year, we are keeping a close eye on potential macroeconomic factors that could impact our execution. Specifically, our team is laser-focused on driving strong adoption of our handhelds through the end of the US government fiscal year, capturing year-end biopharma spending and mitigating continued disruptions in APAC.\n\nAt this point, I would like to turn the call back to Kevin for closing comments.\n\nKevin Knopp -- Co-Founder and Chief Executive Officer\n\nThanks, Joe. We've made significant progress in the first half of 2022 as we continue to execute on our growth strategy. I'm really encouraged by the momentum we are seeing from customers in adopting our technology across their organizations. I'm also pleased with our team's efforts to foster collaborations with leading research and academic institutions as we develop the next generation of our product.\n\nAnd I'm delighted to advance our product portfolio and broaden our bioanalytics capabilities through the acquisition of TRACE Analytics. We look forward to building on this momentum into the second half of the year as we expand the reach of our technology platform. With that, we'll now open it up to questions.\n\nOperator\n\n[Operator instructions] Our first questions comes from Puneet Souda, SVB Leerink. You may proceed.\n\nPuneet Souda -- SVB Leerink Partners -- Analyst\n\nHopefully you can hear me. Thanks for taking my question. So first one is really around the guide. I mean, you're maintaining the guide despite a solid quarter.\n\nCan you just remind us on the Army contract? What's your expectation for that in the third quarter contribution? And when we look at the fourth quarter, there's still a bit of uptick from your prior quarters and slightly steeper. So just wanted to get a sense of how should we think about the contributions from REBEL and versus MX908? And then I have a few follow-ups.\n\nJoe Griffith -- Chief Financial Officer\n\nSure. Absolutely. Yes, we feel good about the first half performance and the progress we've made toward our setting goals. As you saw, overall growth in the first half was 40%, 52% from our desktops, which we like to see.\n\nAnd there are a number of factors going into contemplating the guidance. And right now, we think it's most likely to end up closer to the middle of the range. We need to execute, as I mentioned in the call, earlier on Q3, as we work to secure year-end US government funding and into Q4 to capture year-end of total capital spend. And maybe drilling down a bit more on that US government funding and budget factor, given these are often larger orders that present some potential risk, but also some potential upside, depending on when these orders come through and our potential customers' ability to secure funding.\n\nOn the desktop side, we're offering new tech, not something that has been designed in for years. We will be susceptible with potential slowness or conservatism from biopharma spending in the second half of the year, particularly in the fourth quarter. And another factor that we're working to mitigate here over the back half is a possible impact to APAC from further COVID shutdowns, which would limit our growth opportunities for both the handhelds and the desktops. Now, specifically, you mentioned the US Army.\n\nThat is baked into the guide. We did have some shipments in Q2, and we expect to fulfill all the remaining devices in the course of Q3. And of course, there's warranty and service revenue that extends further in time through 2025. We continue to work with the US Army on additional and incremental opportunities in our pipeline, and we're excited about those.\n\nAs the MX is rolling out across their users, it's really exciting and are proving to be a great reference across our customer base. Hopefully, that gives you a little bit of flavor on in Q3, Q4 and really the full year guidance at the midpoint.\n\nPuneet Souda -- SVB Leerink Partners -- Analyst\n\nThat's helpful, Joe. Kevin, just following up on the rest half of the year. In terms of commercial organization, it appears to me that that commercial organization should be reaching their one-year anniversary soon. So how should we think about the pickup in the core REBEL franchise? And sort of just maybe elaborate for us on a high-level sort of what are some of the key efforts that you have ongoing? You had 14 instruments in the quarter, which was largely in line with us.\n\nBut I wanted to get a sense of how should we think about both the REBEL installs, and then the one kit a month that you have talked about, could that potentially sort of accelerate now that salesforce is more experienced with the product?\n\nKevin Knopp -- Co-Founder and Chief Executive Officer\n\nYeah, sure. I have to give more details on that. Yes. So the commercial or, as you know, we added a fair bit of hires in the back half of last year.\n\nAnd we really doubled the sales team, sales and marketing team since the IPO in 2020. We put out there that we're going to have a goal for 2022 to get to about 80% of sales and marketing reps. We've added about nine individuals thus far. So we've got about 67 here at the end of the first half.\n\nI think if those folks are coming up to speed well, and obviously, anybody you're hiring now really affects 2023 and not the second half. We are trying to be really thoughtful on who we add, obviously, in these times, and particularly outside the commercial organization. But yes, so we still expect though that we'll be rounding in toward 85 by the end of the year. In terms of the REBEL side of things, we've absolutely been focused first on the desktop placements, and we have in '21 and continuing in 2022, we were able to exercise this morning some good adds on by top pharma companies, some ordering their fifth and sixth REBEL in the quarter and others got -- Fate, CAR T-Cell therapy company, getting their second and third deliveries in the quarter.\n\nFrom a kit usage and kit consumption, we're pleased that about one-third of our customers are now on a blanket purchase order. And as we can get there into routine workflows and that's the nominal usage planned, right? So we've got work to do with them to experience the value and ensure that we are on that use path. So we're still driving hard toward the goal of one kit per month and to achieve that across our active user base. And yes, happy to go into all the work we're doing there on the payout to enable that.\n\nPuneet Souda -- SVB Leerink Partners -- Analyst\n\nJust a last one for me. TRACE Analytics, congrats on the acquisition. Can you give us a view into how does this improve your timeline for online REBEL launch? And then also on glucose and lactate, which correct me if I'm wrong, they're not in the current menu for REBEL. How do you expect that to be integrated data-wise? Is it something that's going to fold into REBEL? Just thinking about sort of how the products would be integrated and how the data and analytics is going to be integrated for the bioreactors for the online systems.\n\nKevin Knopp -- Co-Founder and Chief Executive Officer\n\nYeah. I mean, we're super excited about having TRACE Analytics now with us on our journey here. We've been talking since the IPO about the smart plumbing, and that's what we need to enable a mass spec unwind. And we think there's different ways to go through partnership for internal development.\n\nBut after months of evaluation, we think bringing TRACE Analytics under our umbrella here, gives us great opportunities for REBEL online and solidifies a timeline there but not much long. You mentioned that there's other sensors. Yes, you're right, glucose and lactate, we dump it out of the box today, on our REBEL box. So we do look forward and think about bioprocessing 4.0 and bringing together a robust road map that has the sampling technologies, the analytics, sensors, all together to drive predictive models and ultimately bring back control for the bioreactor.\n\nSo we think this plays really well into a shorter term and a longer-term road map that we've got.\n\nPuneet Souda -- SVB Leerink Partners -- Analyst\n\nThanks, guys.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Dan Arias of Stifel. You may proceed.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nGood morning, guys. Thanks for the questions.  Kevin, congrats on the TRACE deal. Maybe another business development question. As you push further down the road on just opening up the market for REBEL, what kind of additional partnership activity either on the R&D side or on the commercial side, should we expect? I think that was something that was part of the road map for you.\n\nSo just curious how important that is now. And if there are things you would point us to in terms of what we might expect?\n\nKevin Knopp -- Co-Founder and Chief Executive Officer\n\nYeah, sure. And thank you. Again, we're really excited for the road map we've got here in front of us and REBEL's kind of the center of that ecosystem. We agree that key partnerships are required to get the product to market and fulfill its full potential.\n\nObviously, TRACE Analytics is one extreme line we're bringing under the umbrella, and we think the technology has multiple endpoint uses to cross our road map over time. But we also think there's great relationships just through collaborations and working with some industry leaders in these spaces we've talked before about work we're doing with groups on in-silico predictive modeling. We're doing work there with groups like Johns Hopkins or Sartorius that are at the forefront of that. We're also working heavily with groups like CPI in the U.K.\n\nand also got great collaboration with MIT and Emory and other groups like that, just to name a few, that are really working to help on the use modeling of this, and the need and what you can do with frequent sampling and what can you do as you're streaming this data off of REBEL and then future sensors and future analytics that we're working on our road map. So we do think they're an important part of it. I don't think we're gated by a particular partnership, but I do think they're a good add as we go forward.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nOK. And then, maybe on the MX side, can you talk -- just expand a little bit on the sales funnel there and the opportunities that you have? And the reason I asked is because you obviously have the Army contract coming off. Those big deals do create some lumpiness, but it sounds like there are some good things in the hopper that you have. So I'm just curious if you feel like, in aggregate, together, the activity has placements tracking to some level of consistency? Or do you foresee some meaningful ups and downs in the next 12 months?\n\nJoe Griffith -- Chief Financial Officer\n\nGreat question. And as you recall, we do work through our pilots in enterprisewide adoption, and it's a journey and can be a long sales cycle for some of the opportunities with our handhelds. And I think as we sit here in Q3, we're seeing that pipeline build, but have some work to do to deliver on the results, especially on new handheld orders. As we roll off from Army, as you mentioned, it's really a heavy reliance on being able to secure year-end government funding, which is September 30.\n\nAnd we're working on a handful of larger handheld opportunities, 20-plus units each, and we need to see our sales team bring those home to achieve our full year guidance here in 2022. We think we've made some great progress, but certainly some work left to do. And it will continue to be something that we focus on here in 2022 and beyond. So hopefully, that helps you a little bit more color, but it is that time of the year to execute.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nYeah. Fair enough. OK. Thank you, guys.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Max Masucci with Cowen. You may proceed.\n\nMax Masucci -- Cowen and Company -- Analyst\n\nHey, thanks for taking the questions. First one on TRACE. Congrats on the acquisitions. It would be great to hear whether you see TRACE's operations in Germany as being more of a gateway or an opening of the spigot for new customer wins in that region or whether the German facility would be used more for, call it, R&D or manufacturing and whatnot?\n\nKevin Knopp -- Co-Founder and Chief Executive Officer\n\nMax, great question. We think it's pretty minimal impact out of the gates as far as Europe, but there's definitely that opportunity to build out our Europe organization and have a central operation for logistics and customer interactions. It's useful to now have a legal entity in Europe to enable direct selling as we go forward. Today, we operate through a distribution channel.\n\nYou've heard us talk about it over the last year as far as adding applications, service, field sales, but to be able to bring them together with the central base, we see advantages to that and opportunity on a go-forward basis.\n\nMax Masucci -- Cowen and Company -- Analyst\n\nFinal one for me. It sounds like demand from cell and gene therapy customers is remaining quite strong. That's in light of rumblings around prudent biopharma spending and whatnot. So I would just be curious here if the demand that you're seeing here in August from cell and gene therapy customers, how it stacks up to the demand from other customers that are exploring applications and other non-cell and gene therapy biologic drug categories?\n\nKevin Knopp -- Co-Founder and Chief Executive Officer\n\n Yeah. Yeah. We're certainly watching the macros closely across the broader biopharma environment and watching any impact there. For REBEL devices, you're right, we do have a good foothold on the cell and gene therapy efforts and a great foothold just in general across top biopharma and ample opportunity obviously to expand to new accounts there.\n\nIn terms of cell and gene particularly, yes, we see a pickup through the quarter of cell and gene, but also with traditional maps and other modalities of it. So I don't think we have any particular trends to call out from the numbers we have here in front of us for Q2. But we did point out that about two-thirds of our placement this quarter with some new customers. So that's exciting for us and set the opportunity that we call it what we say radiate across that.\n\nAnd the requirements for our devices are fairly minimal and can fit into existing workflow and have adoption much more seriously, whether you're working on a cell and gene or on a map. So we're continuing to watch that closely here. And certainly, we've got new technology. So we want to make sure we're remaining top of line to these customers as they go through their own evolution of churn of employees and the like.\n\nBut yes, nothing specific I can call out on cell and gene versus maps, but encouraging signs across the board on REBEL for the quarter.\n\nMax Masucci -- Cowen and Company -- Analyst\n\nGreat. Thanks for taking the questions.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Brian Weinstein with William Blair. You may proceed.\n\nKurt Wiese -- William Blair and Company -- Analyst\n\nThank you. Good morning. This is Kurt on for Brian. Maybe just on utilization.\n\nYou've talked about one kit per month on average, you reiterated that today. I saw in the Q this morning that that maximum potential capacity with the continuous operation, it goes from one kit per day to something -- they call potential for 30 or one kit per day versus one kit per month. So when we're thinking about this, when you ultimately get to continue with moderate capabilities, I mean should we be thinking about a potential for a 30 times increase in the REBEL pull-through?\n\nKevin Knopp -- Co-Founder and Chief Executive Officer\n\nYeah. I think it is -- thanks for the question. I think it is definitely early days to be able to give you something accurate there. And I think we are pleased that we do have a consumable model that have one kit a month that represents about a 40% pull-through for our users.\n\nAnd you're right, with online, it does enable more frequent sampling, less labor. We can program it to do at particular intervals. Today, remember, we are new technology and new use cases. And so, we've got to get customers very comfortable with device.\n\nWe've got to get them working to have a part of their workflows and proven in and meeting their expectations. And I think we'll see where it goes. I think the other important part is to drive a foundation there with showing that value and we're doing a lot of work, as I've mentioned in the past, with those key opinion leaders, like EM vector, CPI, and MIT, Emory, few that I named earlier. And we're starting to see some great results from that, I think, which will ultimately impact utilization.\n\nAnd those now we have data sets that are becoming publicly available to the community shall increase titer, reduce amino acid depletions and the ability to inform feeding strategies and importantly inform these in-silico predictive model. So some cool stuff coming and also I think it will be positive for our utilization.\n\nKurt Wiese -- William Blair and Company -- Analyst\n\nOK. And then, on the gross margin, over 10% sequentially, the mix of service revenue is pretty similar to Q1. You called out the favorable mix of MX in the distributor channel and the higher ASPs for REBEL. Can you just talk a bit more about that and maybe give us a sense of how much higher the REBEL ASP came in versus what you were expecting?\n\nJoe Griffith -- Chief Financial Officer\n\nYeah, a little bit more color on the gross margin. We were pleased. As you recall last year, cyclically, it was 52% to 58%. We finished the year at 55%, and we do have some quarters based upon volume or mix that might be higher.\n\nSo we benefited at 60%, very pleased with where it came out. A big piece of that was on the MX908. We saw strength within our state and local here in the US sales, a lot of nice adoption. But with those, they're close to full list price opportunity, right, with the US list price being north of $65,000 for the MX908.\n\nSo with that heavy state and local versus through our international distribution channels or federal or military type opportunities that really help the MX side from a mix perspective. Specifically on REBEL, as the technologies become more entrenched and to help mitigate some of the supply chain and cost overall, we did increase the list price for this year, and we start to see some of that kick in that helps the ASP overall. Probably won't put a specific percent around it, but it was a meaningful pickup that we hope to be able to replicate going forward. But a big element is mix there too.\n\nI mentioned one of the factors of APAC as far as going forward, with the COVID shutdowns. And with those, there are more heavily discounted devices, and we didn't have any here in Q2, but we'll have some on a go-forward basis. So hopefully, that helps to give you a little bit more flavor on gross margin, but definitely pleased to see that 60%. Wish it was repeatable, but really looking to mid-50s from a overall blend for the year.\n\nKurt Wiese -- William Blair and Company -- Analyst\n\nOK. If I could just get one more in on maybe a bigger picture question. Can you just talk a little bit about the clinical applications of mass spec and your interest there, when we saw Roche, who's going to launch a cobas mass spec IVD platform at the end of 2024. How you view launching your technology into maybe more diagnostic applications?\n\nKevin Knopp -- Co-Founder and Chief Executive Officer\n\nYeah. Thank you for that. So for today, we're absolutely focused on tools. We're really focused on getting these things out to fill the needs of biologist, but also a forensic scientific which requires, right, somebody that has a sample that wants an answer, and we call it point of need.\n\nWe do think our products are attractive in their form factors. It does get me thinking about point-of-care applications. It's not something we currently have on our road map. We do have a wonderful board member who is the CSO of LabCorp, Marcia Eisenberg.\n\nSo we're obviously on the lookout. But again, we're working in areas today that we think are exciting. We talked a little bit about some areas in metabolomics and proteomics. I would say that that area of analysis is as close as you get into that diagnostics area you may, but very much R&D and prototyping.\n\nBut we can stand watching that sub segment.\n\nKurt Wiese -- William Blair and Company -- Analyst\n\nOK. Thank you for the question.\n\nOperator\n\nI'm not showing any further questions at this time. I would now like to turn the call back over to Kevin Knopp for any closing remarks.\n\nKevin Knopp -- Co-Founder and Chief Executive Officer\n\nThank you. Thank you all for your time. We appreciate it. I appreciate the call for questions, and have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKelly Gura -- Investor Relations\n\nKevin Knopp -- Co-Founder and Chief Executive Officer\n\nJoe Griffith -- Chief Financial Officer\n\nPuneet Souda -- SVB Leerink Partners -- Analyst\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nMax Masucci -- Cowen and Company -- Analyst\n\nKurt Wiese -- William Blair and Company -- Analyst\n\nMore MASS analysis\n\nAll earnings call transcripts"
}