{
  "companyName": "IDT",
  "companyTicker": "IDT",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/07/idt-idt-q4-2022-earnings-call-transcript/",
  "content": "IDT (IDT -0.21%)\nQ4 2022 Earnings Call\nOct 06, 2022, 5:30 p.m. ET\n\nOperator\n\nGood evening, and welcome to IDT Corporation's fourth quarter and full fiscal year 2022 earnings call. In today's presentation, IDT's management will discuss IDT's financial and operational results for the three- and 12-month periods ended July 31, 2022. During remarks by IDT's chief executive officer, Shmuel Jonas, all participants will be in listen-only mode. [Operator instructions] After Mr.\n\nJonas' remarks, Marcelo Fischer, IDT's chief financial officer, will join Mr. Jonas for Q&A. Any forward-looking statements made during this conference call, either in the prepared remarks or in the Q&A session, whether general or specific in nature, are subject to risks and uncertainties that may cause actual results to differ materially from those which the company anticipates. These risks and uncertainties include, but are not limited to, specific risks and uncertainties discussed in the reports that IDT files periodically with the SEC.\n\nIDT assumes no obligation either to update any forward-looking statements that they have made or may make or to update the factors that may cause actual results to differ materially from those that they forecast. In their presentation or in the Q&A session, IDT's management may make reference to non-GAAP measures, including adjusted EBITDA, non-GAAP net income, and non-GAAP earnings or loss per share. A schedule provided in the IDT earnings release reconciles adjusted EBITDA, non-GAAP net income, and non-GAAP earnings or loss per share to the nearest corresponding GAAP measures. Please note that the IDT earnings release is available on the investor relations page of the IDT Corporation website.\n\nThe earnings release has also been filed on Form 8-K with the SEC. I will now turn the conference over to Mr. Jonas.\n\nShmuel Jonas -- Chief Executive Officer\n\nThank you, operator. Welcome to IDT's earnings conference call. After my remarks, Marcelo Fischer, IDT's chief financial officer, will join me, and we will be available to answer questions. My discussion today focuses on the fourth quarter of our fiscal year 2022, the three months ended July 31.\n\nFor a more detailed discussion on our financial and operational results, including our full fiscal year 2022 results, please read our earnings release filed earlier today in our Form 10-K that we expect to file with the Securities and Exchange Commission by Friday, October 14. In the fourth quarter and for the full 2022 fiscal year, our high-margin, rapidly growing fintech and cloud communications businesses delivered impressive gains. For several years, we have invested in these businesses to develop the next generation of IDT's value creation. This dynamic and ongoing transformation helped drive IDT's consolidated quarterly and annual adjusted EBITDA to their highest levels in our history.\n\nWithin our fintech segment, NRS had another outstanding quarter, increasing recurring revenue by 157% year over year to $17.7 million. Monthly average recurring revenue per terminal, which excludes POS terminal hardware sales, nearly doubled to $316. Each of NRS' key offerings contribute to the quarter's growth. Looking ahead, we are entering what is typically a seasonally strong period for advertising generally.\n\nHowever, macroeconomic-driven headwinds are buffeting the advertising market. As a result, we will likely encounter some volatility from quarter to quarter even as we expect to continue to generate strong year-over-year revenue increases. NRS Merchant Services and SaaS fee revenue also grew nicely. We are continuing to convert our existing POS customers, and we are signing up the new POS customers to NRS Pay at a very good clip.\n\nOn the SaaS side, we are upselling store owners to premium features and bundles, and we have many exciting features coming soon. NRS also again achieved strong growth in its POS terminal network footprint, adding over 1,400 net new terminals in the fourth quarter. All in all, we are more excited than ever by the potential of this business. Also, in our fintech segment, BOSS Money performed exceptionally well.\n\nRevenue increased 56% to $17 million. Transaction volumes grew by 31% year over year, and revenue per transaction increased 19%. We continue to attract new customers, grow revenue, and improve margins by focusing on several strategic priorities: cross-selling within the larger BOSS Revolution ecosystem, expanding our payout network, and enhancing our retail and digital transaction platforms to improve the user experience and enable more sophisticated pricing strategy tools. During fiscal 2023, we are planning on taking the first step to expand our origination and service internationally, introducing our BOSS Money remittance service in Canada and then expanding from there.\n\nOverall, our fintech segment generated income from operations of $5.4 million in the fourth quarter compared to a loss from operations of $2.9 million in the year-ago quarter. NRS is now contributing bottom-line profitability, and BOSS Money delivered impressive growth while moving significantly closer to profitability. Net2phone likewise delivered another very good quarter. Fourth quarter subscription revenue increased 37% year over year to $15.1 million, expanding at a faster clip than many industry players.\n\nWe added approximately 12,000 net seats and boosted revenue per seat for the third consecutive quarter. Following the acquisition of Integra this spring we brought as Contact Center as a Service offerings to market under the net2phone umbrella in the fourth quarter, we expect that CCaaS will drive additional increases in per seat revenue. As I noted last quarter, we are laser-focused on accelerating net2phone's path to profitability by streamlining operations and optimizing our investment in growth capital. We are making very good progress.\n\nNet funds loss from operations decreased to $1.8 million in the fourth quarter, half the level of the year-ago quarter, and we expect that net2phone segment will achieve EBITDA profitability by the fourth quarter of fiscal 2023 while continuing to grow robustly. Turning now to our traditional communications segment. Fourth quarter decreased 23% to $276 million. BOSS Revolution Calling decreased by $22 million or 20%, while IDT Global's wholesale carrier revenue declined by $34 million or 35%.\n\nWe have long compared the paid minute international voice communications market, which is the basis for both our BOSS Revolution Calling and IDT Global Carrier businesses to a slowly melting ice cube. The fourth quarter results reflect the acceleration of the melt rate as a result of fading COVID-boosted demand and by weaker consumer purchasing in this economy. Also, within the traditional communications segment, our mobile top-up business was again impacted by the deterioration of foreign exchange conditions in our largest revenue corridor. Total mobile top-up sales decreased $24 million or 18% from the year-ago quarter to $113 million.\n\nHowever, thinking about the future of mobile top-up, which is now the largest revenue generator within the traditional communications segment, it's instructive to look at our fourth quarter results exclusive of that volatile quarter. Mobile top-up revenue would have increased if not for that. We continue to be bullish about the long-run growth prospects for mobile top-up. We have now substantially worked through the quarter's year-over-year comparative negative foreign exchange impacts.\n\nGlobal demand for broadband bundles continues to increase, and we are making progress developing new digital offerings. Traditional communications' fourth quarter income from operations decreased by $8 million or 33% to $17 million. We have been very successful in recent years minimizing the bottom-line impact of the volume declines from BOSS Calling and IDT Global by optimizing our pricing strategies and distribution channels, as well as by rightsizing operating expenses. We remain sharply focused on streamlining these businesses going forward so as to maintain as much cash flow as possible.\n\nNevertheless, we do believe that our payments business will continue to be pressured. And as a result, both segment revenue and EBITDA will continue to decline in fiscal 2023, though moderated by a return to stability in our mobile top-up businesses. For IDT as a whole, the outlook remains very positive. We anticipate that the continued growth of high-margin fintech and cloud communications businesses and our mobile top-up offerings will further significantly improve IDT's consolidated adjusted EBITDA, more than offsetting the decreasing contributions that we expect from our BOSS Revolution Calling and IDT Global businesses within the lower-margin traditional communications segment.\n\nReflecting on our progress this quarter and positive outlook, IDT repurchased 554,000 shares of its Class B common stock in the open market for approximately $13.4 million during the fourth quarter. In fiscal 2023, as always, we will continue to look for opportunities to return value to our stockholders. The quarter and the fiscal year's strong results would not have been possible without the hard work of IDT's employees worldwide, who continue to rise to the challenges and beat expectations. I want to wrap up by acknowledging their success and thanking them.\n\nNow, Marcelo and I will be happy to take your questions. \n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions] At this time, we will pause momentarily to assemble our roster. The first question comes from Connor Haley with Alta Fox Capital. Your line is live.\n\nConnor Haley -- Alta Fox Capital Management -- Analyst\n\nHi, guys. First, congratulations to the entire team. I mean it really -- incredibly impressive quarter to see NRS growth accelerating to 134% this quarter. I mean the non-hardware piece up 157% year on year, really excited to see the buyback as well.\n\nWe agree shares are a great opportunity. I guess maybe just to start. On interest, am I thinking about this right? I mean growth of 134% year on year, two-year stack, and observed 290%, if we just roll this forward for the next three quarters, interest will be doing $80 million plus in annual revenue? It's already significantly profitable. Am I thinking about this right in terms of rolling it forward in sort of that $80 million-ish number over the next three quarters? \n\nShmuel Jonas -- Chief Executive Officer\n\nI mean, I think that we could possibly be better. But yes, I think you are thinking about it correctly.\n\nConnor Haley -- Alta Fox Capital Management -- Analyst\n\nThat's incredible. And then I guess if I look at the EBITDA contribution from the fintech segment, which obviously includes both NRS and BOSS Money Transfer, the segment did $6.2 million in EBITDA this quarter alone. You mentioned in your prepared comments, Shmuel, that BOSS Money transfer is close to breakeven. So, I can assume all of the $6.2 million EBITDA is from NRS, which would imply it already doing over 32% EBITDA margins in this latest quarter.\n\nI just want to make sure my logic on that is correct.\n\nShmuel Jonas -- Chief Executive Officer\n\nYeah. I mean, I think your logic is correct. I mean it's doing more than that. I mean it is subsidizing some of, we'll call it, BOSS Money small losses, and we expect those to go away in the next coming quarters.\n\nBut Marcelo can add to that as well.\n\nMarcelo Fischer -- Senior Vice President and Chief Financial Officer\n\nHey, Connor. It's Marcelo. Thanks for joining the call. So, a couple of thoughts.\n\nSo, yeah, we believe that we might do even better than $80 million of recurring revenue. in fiscal '23. That's a possibility. I would like to point out that even though we had a real strong advertising quarter now in Q4, because of the headwind we've seen as you're looking into September in Q1, most likely, at the time of day, that will still be double what we saw a year ago, most likely.\n\nBut we're probably not going to have the same absolute dollar amount in advertising and data in Q1 that we saw in Q2 to see a significant growth, and then the revenue per terminal probably will not be above $200. So probably maybe slightly lower than that. And again, that's all because about the time it's being paid and how choppy it is and we see companies cutting down on the recurring budgets, etc. But other sources of cash for NRS, the SaaS fees, the much of services, all that continue to grow at the same plan that you saw, start turning to Q4.\n\nYou continue to see that type of growth going into Q1 and beyond. So, we do see that a very robust in NRS top line and bottom line for this coming year. In terms of bottom-line EBITDA profitability, NRS is more than $7 million of EBITDA in Q4. So, we are on target of having NRS deliver perhaps more than $30 million EBITDA in fiscal '23.\n\nConnor Haley -- Alta Fox Capital Management -- Analyst\n\nWow, that's incredible. Congratulations on that. I mean I don't know of any other asset in the market that's growing 134% year on year with 30% EBITDA margins and such a strong competitive. I mean, on a Rule of 40 basis, this is really off the charts.\n\nIt seems to me like NRS alone is worth far more than the current market cap of IDT today, so it's great to see the buyback as well. And then we haven't even talked about the other businesses doing $80 million of annualized EBITDA in excess of that. So, look, I guess the last one for me is just given the scale and momentum in NRS today, any sense for the potential timing of an NRS spend? Could this be a 2024 event, for example?\n\nShmuel Jonas -- Chief Executive Officer\n\nI mean, I think it's largely market-determined rather than NRS-determined. The markets, as you all know, have not been particularly kind to even fast-growing profitable fintech. So, I just don't believe that we think that the timing is right, right now. That being said, if the markets improve, by then, we would be more than happy to do something.\n\nConnor Haley -- Alta Fox Capital Management -- Analyst\n\nAwesome. Incredible execution. I wish all of my portfolio companies had the capital allocation and discipline of IDT. Best wishes for the rest of the year.\n\nThanks, guys.\n\nShmuel Jonas -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThanks. Next question is coming from Adam Wilk with Greystone Capital. Adam, your line is live.\n\nAdam Wilk -- Greystone Capital Management -- Analyst\n\nHey, how are you guys? Thanks for taking my questions. Can you hear me?\n\nMarcelo Fischer -- Senior Vice President and Chief Financial Officer\n\nYeah. Hi, Adam. How are you?\n\nAdam Wilk -- Greystone Capital Management -- Analyst\n\nGreat. Good. Thanks. How are you? I missed the net2phone EBITDA number, Marcelo, that you cited.\n\nI think you cut out on my end. Do you mind just repeating that?\n\nShmuel Jonas -- Chief Executive Officer\n\nSure. The net2phone EBITDA was negative $1.8 million for the quarter, about half of what it was last year.\n\nAdam Wilk -- Greystone Capital Management -- Analyst\n\nOK. Was there something about finishing -- what you anticipate finishing just '23 with? Or did I miss that?\n\nShmuel Jonas -- Chief Executive Officer\n\nNo. We intend to be at least breakeven by the end of 2023.\n\nAdam Wilk -- Greystone Capital Management -- Analyst\n\nOK, perfect. Thank you. Yeah. So, Connor actually asked --\n\nMarcelo Fischer -- Senior Vice President and Chief Financial Officer\n\nJust to correct. The income from operations, the loss of operations for net2phone was minus $1.8 million. The EBITDA itself was about minus $100,000, OK? So, we are getting closer to reaching EBITDA profitability. And based on our 2023 projections, we do hope to exit '23 with net2phone being an EBITDA-positive company even as it continues to grow at rates which are probably higher than the average UCaaS play on basically.\n\nAdam Wilk -- Greystone Capital Management -- Analyst\n\nYeah, that's great. I think in line with the NRS results, that's pretty incredible as well. And I was saying before Connor asked the bulk of my questions, which is great, and I definitely share his sentiments about NRS, just phenomenal work there. I'm wondering, you talked a little bit about this on the advertising and data side.\n\nThe large jump is probably not sort of a normal kind of cadence maybe year over year moving forward. Or is there anything you can talk about that drove that in terms of a larger deal? And I apologize if I missed something, but I'm curious maybe if you can just break down that segment for me.\n\nShmuel Jonas -- Chief Executive Officer\n\nI think, listen, it was really broad-based. We had more sales from every vertical that we sell to. And again, this quarter is looking very strong. As Marcelo said, there are some headwinds, I would say, generally in the advertising and data world with some companies sort of being a little cautious about their spending.\n\nThat being said, we're seeing very strong numbers of late.\n\nAdam Wilk -- Greystone Capital Management -- Analyst\n\nOK. Great. That's helpful. And then the delivery -- home delivery partnership that you entered into in August, is there any opportunity there for any sort of additional customer acceleration or uptake? Or is it purely just kind of supplement the existing customer base?\n\nShmuel Jonas -- Chief Executive Officer\n\nI don't know the answer to that question. What I would say is that a happy customer brings more happy customers, and we believe that this is a service that is very much needed by our retailers. And we think that's -- that it will be -- it will do well for our current retailers. And if they're -- they do well, they tell their friends about it, and that's how we bring on more accounts.\n\nAdam Wilk -- Greystone Capital Management -- Analyst\n\nSure. That makes sense. And then switching gears to mobile top-up. Is there any color to be added on the sudden deterioration in one of the corridors that you mentioned?\n\nShmuel Jonas -- Chief Executive Officer\n\nI mean I can comment a little bit about it. I mean the corridor that we did very well in with Cuba, and there's -- I don't know how else to explain it, but there's a black-market currency and a regular currency. And people are basically choosing to do business in cash in Cuba because they can buy way more on the black market versus paying for things here, where we have to obviously not do that, and that's really the situation. And it's -- and again, it's not just for us, it's for all of our competitors as well.\n\nThey're all seeing the same deterioration.\n\nMarcelo Fischer -- Senior Vice President and Chief Financial Officer\n\nYeah. I mean you remember like the Q3 and Q4 of one year ago, that's when we had a very large lift in revenues for IMTU. As we had explained back then, most of that lift was because of these opportunities we had in Cuba, which was basically wholesale B2B type of traffic. Low margin, high revenue.\n\nAnd in the close of the fiscal year, those revenues started to come down for the reasons that Shmuel just mentioned, right? The spread between the Cuban official rate and the black-market rate has almost doubled, that spread. As such, it's more economical for Cubans to ask family and friends in the U.S. to release to them cash remittance, and they then would top up the mobile services domestically than for them to ask family and friends to buy for them a IDT IMTU card and top up services in the U.S. So that's the corridor advantage which we took advantage of about a year ago.\n\nThat disappeared. And as we start having comparisons, right, as the year progresses, right, most of those comparisons will be muted. Now the important point, I think, is the fact that if you exclude that corridor and you look at all of our other IMTU operations worldwide and corridors, our revenues actually have increased now in the low single digits.\n\nAdam Wilk -- Greystone Capital Management -- Analyst\n\nOK. I understand. That's helpful. Thank you.\n\nLast one for me. Obviously, great to see the buyback. I know we've -- Marcelo and I, we talked about it. And I think the value today given what your business units are doing is just incredible.\n\nI mean just an unbelievable quarterly and fiscal year report. Wishful -- the quarterly cadence that we can kind of think about for buybacks or how are you guys kind of approaching that as we move forward?\n\nMarcelo Fischer -- Senior Vice President and Chief Financial Officer\n\nYeah. I mean, obviously, I think it will continue to be opportunistic in our buyback opportunity, our strategies. Now to the extent that we may or may not have purchased any further if you go into Q1, we will let you know when we announced earnings in early December.\n\nAdam Wilk -- Greystone Capital Management -- Analyst\n\nGotcha. Alright. Well, you did a great job. Keep up the great work and thanks again.\n\nShmuel Jonas -- Chief Executive Officer\n\nSure. Thank you.\n\nOperator\n\nNext question is coming from Sean Berger with Adirondack Retirement. Sean, you are live.\n\nSean Berger -- Adirondack Retirement Specialists -- Analyst\n\nHi, thank you, and congratulations on a great quarter, and I want to also just comment that it's a great recession to have a management team that understands the meaning of fiduciary. So, I appreciate that, and I appreciate the buyback of the return of capital to shareholders. Just wondering if there's any update whatsoever at least you could say is our poker hands stronger with regards to the Straight Path litigation after the SEC included the inquiry of the -- that they didn't plan any further action? Or is there any update that you can provide on that at all? Because I believe that may be part of the overhang. But I appreciate you guys knocked it out of the park, and I appreciate you.\n\nShmuel Jonas -- Chief Executive Officer\n\nWell, thank you. Unfortunately, we really try not to comment on litigation that's ongoing. I have a lot of strong words to say, but I've been advised to keep my mouth shut, so I'm going to listen and keep my mouth shut for once. I apologize for not answering your question.\n\nI was in Delaware for an entire week. And from my perspective, we did an excellent job.\n\nOperator\n\n[Operator Instructions] As there are no more questions, this concludes our question-and-answer session and conference call. [Operator signoff]\n\nDuration: 0 minutes\n\nShmuel Jonas -- Chief Executive Officer\n\nConnor Haley -- Alta Fox Capital Management -- Analyst\n\nMarcelo Fischer -- Senior Vice President and Chief Financial Officer\n\nAdam Wilk -- Greystone Capital Management -- Analyst\n\nSean Berger -- Adirondack Retirement Specialists -- Analyst\n\nMore IDT analysis\n\nAll earnings call transcripts"
}