{
  "companyName": "Costco Wholesale",
  "companyTicker": "COST",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/23/costco-wholesale-cost-q4-2022-earnings-call-transc/",
  "content": "Costco Wholesale (COST -0.01%)\nQ4 2022 Earnings Call\nSep 22, 2022, 5:00 p.m. ET\n\nOperator\n\nThank you for standing by, and welcome to Costco's fourth quarter fiscal 2022 earnings conference call. [Operator instructions] I would now like to hand the call over to CFO, Richard Galanti. Please go ahead.\n\nRichard Galanti -- Chief Financial Officer\n\nThank you, Latif, and good afternoon to everyone. I'll start by stating that these discussions will include forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, and these statements involve risks and uncertainties that may cause actual events, results and/or performance to differ materially from those indicated by such statements. The risks and uncertainties include, but are not limited to, those outlined in today's call, as well as other risks identified from time to time in the company's public statements and reports filed with the SEC. Forward-looking statements speak only as of the date they are made, and the company does not undertake to update these statements except as required by law.\n\nIn today's press release, we reported operating results for the fourth quarter of fiscal 2022, the 16 weeks ended this past August 28. The net income for the quarter was $1.868 billion or $4.20 per diluted share compared to $1.67 billion or $3.76 per diluted share a year ago. Last year's fourth quarter was negatively impacted by an asset write-off of $84 million pre-tax or $0.14 per diluted share. Net income for the fiscal year totaled $5.84 billion or $13.14 a share compared to $5.01 billion or $11.27 per diluted share in the prior fiscal year.\n\nNet sales for the fourth quarter increased 15.2% to $70.76 billion as compared to $61.44 billion reported last year in the fourth quarter. On a comparable sales basis from the fourth quarter, U.S. for the 16-week period on a reported basis had comp sales of 15.8%. When you exclude gas inflation and FX -- we'll won't be any FX, gas inflation, it'd be 9.6%, Canada, 13.4% reported, 13.7% ex gas and FX, other international, 2.9% reported and 11.3% ex gas and FX.\n\nSo all told, total company was reported as 13.7%, and excluding gas and FX, plus 10.4%. Separately, e-commerce, 7.1% reported and again, excluding FX, 8.4%. In terms of the Q4 comp sales metrics, traffic or shopping frequency increased 7.2% worldwide and up 5.2% in the U.S. Our average transaction or ticket was up 6% worldwide and up 10% in the U.S.\n\nduring the fourth quarter. Foreign currencies relative to the U.S. dollar negatively impacted sales by a little over 2%, and gasoline price inflation positively impacted sales by approximately 5.5%. The best-performing core categories in the quarter were candy, frozen, kiosks, tire, lawn and garden, jewelry, toys, bakery and deli.\n\nIn terms of ancillary businesses, the best performers were gas and food courts. And in other businesses, travel and business centers performed best relative to the prior fiscal fourth quarter results. Going down the income statement to membership fee income on a reported basis. Membership fee income came in at $1.327 billion or 1.88%.\n\nThat was up $93 million or 7.5% on a reported basis, again, with weaker foreign currencies relative to the U.S. dollar. That number, excluding the impact of FX, would have been $29.8 million higher, and the 7.5% reported increase would have been a 10% increase. In terms of renewal rates, we again hit all-time highs.\n\nAt Q4 end, our U.S. and Canada renewal rate came in at 92.6%, which is 0.3 percentage point higher from 16 weeks earlier at Q3 end when we were at 92.3%. And our worldwide renewal rate came in at the end of the fiscal year at 90.4%, up 0.4 percentage point from Q3 end when it was 90%. In terms of the number of member households and cardholders, at Q4 end, we ended the fourth quarter with 65.8 million paid household members and 118.9 million cardholders, both up 6.5% from a year earlier.\n\nAnd that 6.5% increase in number of members and cardholders is on about -- just under a 3% increase in the number of locations. During the year, we opened 23 locations on a base that began the year with 815 warehouses. At Q4 end, our paid executive memberships totaled 29.1 million, an increase of 1.2 million or 74,000 per week during the 16 weeks since third quarter end. Executive members now represent over 44% of our members and just under 72% of our worldwide sales.\n\nIn terms of membership fees and a possible increase, there are no specific plans regarding a fee increase at this time. We're pleased with our growth in both top line sales and membership households over the last several quarters and in member loyalty as reflected in increasing member renewal rates. We'll let you know when something is about to happen. Moving on to fourth quarter gross margins.\n\nFor the quarter, gross margin on a reported basis came in at 10.18% compared -- down 74 basis points from last year's reported gross margin of 10.92%. Now, the 74 basis point year-over-year reduction is on a reported basis. Excluding gas inflation, it was minus 22 basis points. And as we normally do, we actually jot down a few numbers, and then we'll elaborate a little bit more on margin.\n\nSo the two columns would be reported year-over-year change, and the second one would be ex gas inflation, net year-over-year change. So the core merchandise margin on a reported basis, minus 67 basis points year-over-year, ex gas inflation, minus 23 basis points. Ancillary and other businesses, the second line item, plus 20 and plus 34, our 2% reward, zero and minus five, LIFO, minus 27 and minus 28, and all told, total minus 74 reported, as I mentioned, and minus 22, excluding gas inflation basis. Starting with the core.\n\nCore merchandise's contribution to gross margin was lower by 67 basis points year over year and by 23 ex gas inflation. The sales mix negatively impacted the core, primarily from the lower sales penetration of total core sales relative to our increasing and outsized gasoline sales. In terms of the core margin on their own sales, in Q4, our core and core margins were lower by 26 basis points. That's pretty much in line with each of the last three quarters when it ranged from minus 39 basis points year over year in Q3, minus 28 in Q2 and minus 18 in Q1 on a year-over-year basis.\n\nSo again, for the quarter, it was minus 26 core-on-core. Ancillary and other businesses gross margin was higher by 20 basis points and higher by 34 basis points ex gas inflation in the quarter. Gas, of course, as well as business centers and travel were better year over year, offset somewhat by e-com, pharmacy, food court and optical, but overall, a positive year-over-year change. Our 2% reward, as I mentioned, on an ex gas inflation basis was higher or down five -- lower or down five basis points, implying higher sales penetration coming from our executive members.\n\nIn terms of LIFO. LIFO, as you know, with inflation has been increasing. It was 27 basis points, down year over year -- or higher year over year. The LIFO charge this year on an ex gas inflation basis, 28 basis points higher, and that represented $223 million charge in the quarter.\n\nRecall that our LIFO charges were relatively small in the first part of the year at $14 million, last quarter, in the third quarter, $130 million, and then as I mentioned here, $223 million for the quarter. Moving to SG&A. We showed good results. Reported SG&A came in at 8.53% compared to last year's 9.22% or an improvement of 69 basis points.\n\nBut again, ex gas inflation, the improvement was still good at 26 basis points lower year over year. Again, charting down a few numbers here, charting down the numbers on a core operations basis, on a reported basis, that was plus 50 basis points or positive reduction of 50 improvement, ex gas inflation, plus 12 basis points. Central, plus two and minus three. Stock compensation, plus two and plus one.\n\nPreopening expense, plus one and plus two. Other, plus 14 and plus 14. That gets you down to again on a reported basis, year-over-year SG&A was improved by 59 basis points, and ex gas inflation by 26 basis points. In terms of the quarter year over year, the core operations was, again, better by 12, excluding the impact of gas inflation.\n\nKeep in mind, these results include the starting wage increases we instituted in October of 2021, so in the first quarter of this fiscal year, this past fiscal year, as well as new wage and benefits increases implemented during the third quarter in March of this year, as well as the impact of eight weeks in this quarter as we increase the top-of-scale increase that went into effect July 4. So a few increases that we've done this year. And still, we feel pretty good SG&A improvement given our sales strength. Central was lower by two basis points and higher by three ex gas inflation.\n\nNothing big to talk about there. Again, stock compensation I mentioned. Preopening, I've just -- we've noted that since we now include preopening on the income statement as part of SG&A instead of a separate line item. And other, again, the 14 basis points, recall that that included that last year's write-off in the quarter totaling $84 million.\n\nAll told, reported operating income in the fourth quarter increased 10%, coming in at $2.497 billion. A little of that benefit was that asset write-off last year. Below the operating income line, interest expense was $48 million this year versus $52 million last year, relatively similar. Interest income and other for the quarter was lower by $1 million year over year, coming in at $67 million this year versus $68 million last year.\n\nInterest income was actually higher, but that was offset by unfavorable FX impact, which pretty much offset each other to be roughly flat year over year. Overall, reported pre-tax income was up 10%, coming in at $2.516 billion this year, up from $2.291 billion a year earlier. In terms of income taxes, our tax rate for the fourth quarter was 25.4% compared to 26.1% in Q4 last year. The fiscal '23 effective tax rate, we estimate, is currently projected to be approximately 26%.\n\nNet -- one thing I mentioned why we haven't mentioned in the past, net income attributable to Costco, that line item was up 12%. Recall that on June 30 this past year, we acquired the 45% minority interest from our JV partner in Taiwan. So we now own all of Costco Taiwan. As a result, net income attributable to noncontrolling interest was better by $14 million in the quarter.\n\nThe noncontrolling interest line will become zero going forward, essentially, a small amount, but pretty much zero. A few other items of note in terms of warehouse expansion. In the fourth quarter, we opened nine net new warehouses. So for the full year, we opened 26 warehouses, but that included three relocations, so a net increase during the year of 23 locations.\n\nIn the fourth quarter -- of the nine we opened, five were in the U.S., two were in Canada and one each in Korea and Japan. In fiscal '23, we expect to open 29 new warehouses, including four relos, so for a net of 25 new warehouses. These 25 planned net new openings are made up of 15 in the U.S. and 10 in Other International, including our first locations in each of New Zealand and Sweden, and our third and fourth locations in China.\n\nRegarding capital expenditures, our fourth quarter Q4 spending capex was approximately $1.26 billion. And for the full year, capex expenditures was $3.9 billion. Our estimate for the coming year fiscal '23 capex to be approximately the same, in the $3.8 billion to $4 billion range. In terms of e-commerce business, e-com sales in the fourth quarter, ex FX, increased 8.4%.\n\nStronger departments in terms of year-over-year percentage increases were tires, lawn, patio and garden, prescription pharmacy and health and beauty aids. The largest e-com merchandise department in dollars, what we call majors, which includes everything from computers to appliances to TVs to audio, etc., was up in the high single digits. And CostcoGrocery, including our third-party delivery, two-day, dry, fresh and frozen, continue to grow. They were up 20% in the quarter.\n\nAn update on Costco Logistics. With Costco Logistics, we continue to transition from vendor drop ship to direct ship from our own inventory, particularly in big and bulky items. Overall, this lowers the cost of the merchandise and improve delivery times on service levels to our members, and I'll share with you some statistics to that in a minute. Prior to this acquisition, in the U.S., we were completing a few years ago about 2 million big and bulky deliveries and installations per year.\n\nIn fiscal '22, we completed 4.3 million big and bulky deliveries and installation. Previously, all of those 2 million deliveries and installations were made by third parties. In fiscal '22, about 70% or a little over 3 million of the 4.3 million were done by us. In the fourth quarter, in fact, that percentage of deliveries and installations done by -- performed by us was 81%.\n\nPre-acquisition, the estimated average days to deliver was above 15 days, and we were working with over 100 delivery partners. Today, our average delivery time for big and bulky is just under five days, and we're continuing to work to improve that. And we were down to eight delivery -- primary delivery partners. A few comments regarding inflation.\n\nWe've seen minor improvement in a few areas. But all in, pressures from higher commodity prices, higher wages and higher transportation costs and supply chain disruptions. They're still present, but we are seeing just a little light at the end of the tunnel. And if you recall in the third quarter, we indicated that price inflation overall was about 7% plus for us.\n\nFor the fourth quarter and talking with our merchants, the estimated price inflation overall was about 8%, a little higher on the food and sundries side, a little lower on fresh foods, and both higher and lower on the nonfood side. We're seeing commodities -- some commodities prices coming down, such as gas, steel, beef, relative to a year ago, even some small cost changes in plastics. We're seeing some relief on container pricing. Wages are still the higher thing when we talk to our suppliers.\n\nAnd as we all know, wages still seem to be the one thing that's still relatively higher. But overall, some beginnings of some light at the end of that tunnel. And of course, that could change each week. In all, despite current inflation levels, we believe we continue to remain competitive versus others and able to raise prices as cost increases.\n\nHopefully, of course, a little less than others with who we compete. Many of you have asked about private label with the recent inflationary environment and what's happening, are people trading down. And of course, our first response, of course, is they're not trading down. They're trading up or certainly trading the same.\n\nIn terms of Kirkland Signature merchandise penetration and excluding gas and other businesses that carry the Kirkland name. Kirkland Signature merchandise is up just under 1% in terms of penetration compared to a year ago. Our KS merchandise penetration is about 28% for the year. This is similar to historical trends where it's increasing slowly and steadily over time.\n\nSo no big dramatic change from the past there. In terms of supply chain. Generally, supply chain has improved a little, including on-time deliveries. We started seeing container prices coming down.\n\nThe first place you see it, of course, is in the spot market. And then, you'll start to see it hopefully in some other contracts as they continue. No longer any big capacity issues or container shortages. Domestically, port delays have improved.\n\nAnd while the rail strike that was in the news a few weeks ago was thankfully averted, in anticipation of strike, there were some rail ramp closures and delays in restarting that. But the view from our buyers is that this should be eliminated for the most part toward the end of this week. Switching over to inventory levels. Our total inventory at Q4 end was up year over year, was up just under 26% year over year.\n\nAt the end of the third quarter, it was up just over 26%. Of the 26% increase, an estimated 10 to 11 percentage points of it is inflation. That's that 8% number. And new warehouse growth, that's that 3% number in terms of unit growth over the last year, but still up year over year.\n\nAdditionally, we're lapping some low stocks in certain departments as a result of last year's high demand, specifically in nonfood areas where last year, we were about 90% of our target at inventory levels. Food and sundries and fresh are in good shape, we feel. Our weak supply is comparable year over year. In terms of nonfood inventories.\n\nIt's up in certain categories. Again, this is in part a result of being light in certain departments last year, as mentioned earlier. The good news so far, initial seasonal sales seem to be going well, as evidenced in our monthly sales reports. And all told, we would expect the 26% year-over-year increase to start to head down as it has in just the past few weeks a little bit.\n\nLastly, as a reminder, in terms of upcoming releases, we will announce our September sales results for the five weeks ending Sunday, October 2, this next week on Wednesday -- in two weeks, on Wednesday, October 5, after the market close -- closes. With that, I will open it up to questions and answers with Latif. Thanks.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Simeon Gutman, Morgan Stanley. Your line is open. Please go ahead, Simeon Gutman.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nGood afternoon, everyone. Richard, I want to ask a couple of questions about membership fees. So first of all, you said you were comfortable with sales. So I'm questioning if your tentative -- you're worried about the sales rate if you raise it.\n\nAnd then, is it fair if you don't raise it, it means you're also comfortable with the rate of EBIT growth in the business? Because that's been a tool for the business over time, and I know you don't guide, but I'm obviously trying to get you to answer that.\n\nRichard Galanti -- Chief Financial Officer\n\nSure. Well, nice try. No, look, at the end of the day, we've always been told and I've told you guys that we're a top line company. We're looking to always drive sales.\n\nCertainly, as we've increased members' fees historically about every five, five and a half years, we've turned around and used it to drive more value. And whenever we do it, we'll do that. I think at the end of the day, it's -- and I also want to point out, of course, if you look at the last three increases, on average, they were five years and seven months apart. If you look at June of '17, plus five years and seven months, you're talking roughly January '23.\n\nNow I'm not suggesting it's January '23. I'm just saying it's not there yet anyway. And our view is, is we are confident in our ability to do so. And at some point, we will, but it's a question of when, not if.\n\nAnd given the headline of inflation and concerns about recession, we feel quite comfortable driving sales and earnings the way we are right now, and we still have that arrow in our quiver as we go forward.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nAnd then maybe the follow-up, same topic, still. The way -- your new fiscal year, you've obviously planned the year. Do you cut back or you curtail spending or investments in any way that runs through the P&L if you're not planning to do it or if you are planning to do it?\n\nRichard Galanti -- Chief Financial Officer\n\nNot at all. I mean as steady as she goes in terms of capex and what we want to do and what we want to do with pricing, competitive pricing. And we're not the only company out there, but as we've seen some slight declines in reported gross margin not only this quarter, but in the last several quarters, part of that was just the upside improvement in margin during the first year of COVID. But we are not -- as you know, we're not shy about doing what we have to do to drive the top line, and we'll continue to do that.\n\nOperator\n\nThank you. Our next question comes from the line of Rupesh Parikh of Oppenheimer. Your line is open. Go ahead, please.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nThanks for taking my question. So Richard, I guess just going back to your expense commentary. There was a sequential pickup in your expense growth versus Q3. Besides the wage increases, was there anything else that was unique to the quarter that you'd call out?\n\nRichard Galanti -- Chief Financial Officer\n\nWell, then it was 16 weeks versus 12 weeks, but are you talking about on a year-over-year basis?\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nYeah. Year over year. Yes. I think it's --\n\nRichard Galanti -- Chief Financial Officer\n\nI think the outsized thing is just that. I mean are utilities costs up? Sure. But the outsized thing would be the wage increases. But I'm sure IT is up -- IT is always up a little more as everybody is doing more technology-wise.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nOK. Great. And then, just on the health of the consumer, just given many concerns out there, anything to know -- like any change in consumer behavior or even in your majors category? Are you guys seeing any changes versus maybe your expectations there?\n\nRichard Galanti -- Chief Financial Officer\n\nWell, I think I mentioned -- or we've mentioned when we talked to some of you over the various months was there -- when beef prices skyrocketed -- now they're coming down versus a year ago, but when they skyrocket, you see a change. And irrespective of the state of the economy, you see some changes from beef to poultry and those examples. Somebody made -- the buyers had made a comment a few months ago that they saw some increased penetration of canned chicken and tuna for that reason. But at the end of the day, we haven't seen any big changes in that.\n\nPart of it is hard to see because we -- during these two years of COVID, we enjoyed such strength in big-ticket items. Like consumer electronics, if it's up a little versus up a lot the last two years, incrementally, we know in each of those cases, our numbers relative to industries comparisons are still -- we're still beating the rest of the industry in terms of sales growth. Is the sales growth slower than it was last year? Yes. It still has a positive plus in front of it, and it's still better than the industry as a whole.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Our next question comes from Chuck Grom of Gordon Haskett. Your line is open. Please go ahead, Chuck Grom.\n\nChuck Grom, your line is open.\n\nChuck Grom -- Gordon Haskett -- Analyst\n\nGreat. Hey, thanks. Sorry about that. Richard, on core three-year -- on a three-year basis, looks like you guys showed a nice improvement from the last quarter.\n\nCan you unpack that for us a little bit across the four major categories?\n\nRichard Galanti -- Chief Financial Officer\n\nWell, I don't have all that detail in front of me. But generally speaking, the thing that was outsized in the biggest way in the first year or so of COVID was fresh. As you recall, with fresh, you had virtually no spoilage, and you had much higher labor productivity. So you had huge -- you had three-digit improvements in margins there.\n\nSo that's the comparison. And we've talked about that in the last several quarters on a year-over-year basis compared to those two years, it's come down as a percent, still up from where it was pre-COVID. Other than that, there's all kinds of things that impact other departments. At the extreme, you have a small business, but in terms of our income statement, travel.\n\nTravel is almost a brokerage business where it's all margin, a lot of it is margin. And that went way down, and now it's improving from where -- gone way down. So that helps you a little bit. But there's a lot of moving parts to that.\n\nI think fresh was the biggest outlier. During supply chain, things and everything else, there were impacts in certain departments or allocations, things like that. There was less -- I'm just shooting from the hip here. There was less promotional activity in consumer electronics because of shortages of chips or electronics.\n\nAnd so, there's a lot of puts and takes. But overall, I would say fresh was the one that was most meaningful in that regard.\n\nChuck Grom -- Gordon Haskett -- Analyst\n\nOK. Great. And then, on the LIFO charge, 28 basis points, I think you said. Last quarter, it was 25.\n\nI guess I was surprised that it wasn't higher given how much prices have moved up over the past three to four months. Can you just maybe just give us a refresh on the accounting for that? And what happens in the coming quarters as we start to lap the big charges from this year?\n\nRichard Galanti -- Chief Financial Officer\n\nSure. Well, two things. Again, if you look sequentially in Q1, it was sub-$20 million. In Q2, it's sub-$40 million.\n\nDavid Sherwood -- Director, Financial Planning and Investor Relations\n\n$30 million.\n\nRichard Galanti -- Chief Financial Officer\n\n$30 million something, then $100 million something, then $200 million something. Part of that is, is the way we account for it is, at the end of the Q1, when we saw what the trend was, you then estimate what you believe it's going to be for the year, and pro rate a quarter of that, or 12 weeks of that to that quarter, and that as it continues to increase, you adjust it on a year-to-date basis. So that skews that a little bit. That's the way we've done it historically in prior inflationary times.\n\nThe other comment you asked about is it seemed like it'd be even higher in Q4. The fact is, is we, too, thought halfway through the quarter, it would be higher than this. Part of that was if I bifurcated Q4 into the first eight weeks and the second eight weeks, the first eight weeks showed a level of increase that would have required a larger LIFO charge. It seemed to, in some cases, flatten out a little bit during the last several weeks of the quarter, which meant that it came down from what our expectation was.\n\nSo again, I think that is consistent with what I mentioned about we're seeing a little light at the end of the tunnel. I'm not just -- and there's little comment with some of the buyers about a couple of items going down in price. And you can rest assured that our partners are calling the suppliers. As you said, the price went up because of steel prices.\n\nWell, steel prices are down. What gives? And so, we'll continue to do that. But it's a slow road. But we are, again, seeing a little bit of improvement at least in the second half of the fourth quarter.\n\nAnd we'll see where it goes from here.\n\nChuck Grom -- Gordon Haskett -- Analyst\n\nOK. Thanks very much.\n\nOperator\n\nThank you. Our next question comes from Paul Lejuez of Citi. Your line is open. Please go ahead.\n\nUnknown speaker -- Citi -- Analyst\n\nApologies. [Inaudible] on for Paul. I want to dig in on the inventory piece a little bit, up about 26%. How much of that is you categorize as general merch? You had some pretty big competitors that have been trying to clear some of their general merch, as I'm sure everyone knows.\n\nSo as you kind of reach holiday, can you give us a sense of where you are for general merch inventory? Any plans to kind of further discount there to try and get leaner?\n\nRichard Galanti -- Chief Financial Officer\n\nSure. Well, first of all, without being too specific, there's a decent chunk in there that I would call deep freeze from last year. My example I've used when talking to people is the Christmas trees that retail for $150 to $400. And they came in after Christmas or essentially after Christmas.\n\nAnd the good news is, is that they don't really change in style. And they're now -- and if you go to Costco, you're going to see it on the floor. And if you add in the cost of holding them and a little cost of interest, I think they're still a little cheaper than the ones we added to the inventory this year. So in a perverse way, that one didn't hurt us that example other than we don't like to have extra inventory.\n\nAnd so, there are some seasonal things that came in late. Probably a bigger piece of the delta is us building up inventory, particularly on big and bulky and fulfillment, both e-com fulfillment and big and bulky. The last part is early holiday. We did consciously bring in some stuff.\n\nPart of it was not knowing what was happening with supply chain and how many weeks of delay at each item was. We bought stuff in consciously a little early. And then, as I mentioned, supply chain has improved a little. That's helped you.\n\nSo again, there's things that have helped it and heard it -- increased it or reduced it. The other thing that's increased a little bit, even some things like seasonal things like air conditioning and fans, which was -- we had a very strong season, but there were some delays in getting that stuff in. That will be a small impact from a seasonal standpoint going forward. But net-net, I think that while the 26% number was relatively same at year-over-year Q3 end -- Q3 year over year and at Q4 end, again, in talking with Ron and Claudine and the merchants and, again, seeing what we've seen just in the last two or three weeks, it's going in the right direction.\n\nAnd nobody likes -- I think that one other difference is that -- compared to some of the other bigger retailers, our inventory is more specific. Like if we get a lot of -- if we have a bunch of air conditioners or a bunch of furniture, we may have to hold on to it, but it's not a whole variety of different things. And so, we -- while we have had some additional markdowns, nothing huge, no big, outsized numbers relative to what we would normally expect. So a little bit increase, but nothing material.\n\nUnknown speaker -- Citi -- Analyst\n\nGot you. And so, you're bringing holiday up a little earlier than you otherwise would. And some of that more seasonal air conditioners and fans you mentioned, you might hold those over to springtime? Is that right?\n\nRichard Galanti -- Chief Financial Officer\n\nWe will. Yes. That's easy. And the good news, again, call it, lucky, two and a half years ago when we acquired Innovel, which is we call Costco Logistics, we added 10 -- or 20 million square feet between the MDOs and the DCs.\n\nBut added 10 million of big space, the 1 million square foot space, to the roughly 10 million or 12 million of depot space we have. So we were -- that was fortuitous in that regard.\n\nUnknown speaker -- Citi -- Analyst\n\nUnderstood. Thank you.\n\nOperator\n\nThank you. Our next question comes from Kelly Bania of BMO Capital Markets. Your question, please, Kelly Bania.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nHi, thanks. Kelly Bania from BMO. Richard, just wanted to touch on executive penetration. That line item continues to impress.\n\nI think it's the biggest quarterly jump in the model that I can see. But I guess my question is as you look at that kind of cohort of gold star customers today, is there anything different about that customer profile, demographics or otherwise that makes you can't -- makes you think you can't have the same success in converting those customers up to executive over time?\n\nRichard Galanti -- Chief Financial Officer\n\nWell, I think -- we think we will. I mean what used to be asked -- the question that used to be asked about millennials or Gen X and then millennials and the Gen Z, we tend to see the same type of trends that are age and, arguably, income-dependent. Also, during these last several years, we've continued to get better at talking you into signing up, selling you on the value of that executive member upfront. So we've seen increased penetration there, too.\n\nThe other thing, of course, that helps is when we add it to a new country. I think in the past two years, we added it to Japan and Korea. And so, we have it, of course, in the U.S., Mexico, Canada and the U.K. And so, we've already gotten the big countries, if you will, in terms of number of locations.\n\nAnd I'm sure there'll be another country, too, we added to over time as those countries grow. So no, I think we've done a better job of doing it, starting with -- years ago, you came in and we asked you what you wanted. And if you said gold star, that's what you got. Now we actually try to share with you what's the value of it, and we've done a better job with that.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nOK. And just to maybe follow up on the container pricing. I think you mentioned maybe some relief starting there. I guess the question is just, have you learned anything about your business over the past few years, really kind of focusing on discretionary imports and the strategy, the charter ships that you might keep longer term? Or do you expect to kind of go back to kind of everything you were doing pre-pandemic from that perspective?\n\nRichard Galanti -- Chief Financial Officer\n\nI think the biggest thing we've learned is that, really, from the source of origin of these items. If you go back to even when tariffs were placed in, whatever, '16 or '17 or whenever that was on China, and there were certain items that were moved from manufacturers in China, those same manufacturers who may have had facilities in other neighboring countries, where we could and where they could, that was moved to get around some of those tariffs. And so, you learn through that process. We certainly learned through the last couple of years the challenges with containers, not to say that we can change some of it.\n\nBut I think we try to -- to the extent you can, you try to spread it out a little more. You try to not depend on one port. And certainly, we've learned all those things. And we learned that we can continue to make mistakes along the way, too.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Oliver Chen of Cowen. Please go ahead, Oliver Chen.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThe industry is seeing so much inventory and the wrong kind of inventory. What are your thoughts on the promotions that you're seeing, and how you're thinking about pricing? And any thoughts on the nature of your portfolio? You always offer such sharp prices. On inflation at the end of the tunnel, second, Richard, maybe you could elaborate on that. That sounds very nice.\n\nAnd lastly, on that --\n\nRichard Galanti -- Chief Financial Officer\n\nLet's do one question at a time so I don't forget. Yes. Yes. supply becomes more plentiful.\n\nThere's more promotions. I remember last year or the last couple of years, again, given shortages in electronics, we saw -- we and the industry saw a lot less promotional activity being afforded retailers from the manufacturers on TVs. There was no need to do that. And we're starting to see some of those promotional activities come back.\n\nOther than that, also, one of the things that we like is our multi-vendor mailer, both the existing one, as well as other promotional things, we do like that online and direct. And those had to be changed in some ways because of shortages or allocations of inventory. A lot of times in those types of MVMs, you've got a lot of high items like promotional things like TVs, as well as huge high sales volume items like paper goods and things like that. And you're looking at the paper goods as well.\n\nThere were shortage of those along the way. So we've learned how to change those and maximize them in the way -- in the best ways we can and figure out how to use those monies -- work with the vendors as well, the suppliers to figure out how to use that money in the best way. And we -- that's again an iterative evolving process. Second question?\n\nOliver Chen -- Cowen and Company -- Analyst\n\nYeah. On inflation, just light at the end of the tunnel and some green shoots there that you're seeing.\n\nRichard Galanti -- Chief Financial Officer\n\nYeah. Well, again, anecdotally, when we talked to the buyers, they're starting to see a few examples, whether it's something like outdoor patio furniture or barbecue grill where steel prices are coming down, and we're reminded by Craig and Ron, the buyers reminded at the budget meeting when prices were going up, make sure you understand why they're going up. What piece of it is raw material costs? What piece of it is freight costs? And when these things come down, you better be on the phone with them calling them saying, when are we going to get a reduction? And so I think in part because of our limited selection -- our limited number of SKUs and a huge volume, I think our buyers know pretty darn well a lot of the cost components of these things. And that, I think, bodes well for us.\n\nBut again, at the end of the day, we are seeing -- I think it is a little light at the end of the tunnel. Certainly, container rates have come down. Container shortages have improved. The port delays have improved, all that things go into it.\n\nAnd as raw material prices come down -- and FX generally helps you and hurt you. When we report a foreign company's earnings in U.S. dollars, and the currency has gone down 10%, it's 10% less earnings that we report. But at the same token, since we're using U.S.\n\ndollars in a lot of things, not just in the U.S. to buy different supplies and raw materials from other places, that helps you a little bit. And again, I think it's -- could something happen tomorrow to change this? Sure. But at least we're seeing the things going -- starting to go in the right direction.\n\nHopefully, that bodes better for not just us, but everyone.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nOK. And lastly, now it's time to talk about generation a, analysts What about the data science team, Richard? I know you hired that team. And what kind of progress or things we should look for there, as well as any highlights you want to give us for your digital strategies on the horizon?\n\nRichard Galanti -- Chief Financial Officer\n\nYou know what, in my old age, I forgot to get any detail on that, but I'll do that on the next quarter. But generally speaking, it's been a couple of years since we brought in a VP of data analytics, and he has built a sizable team. And a lot of things they're working on is to have better visibility. As simple as we are, we still need visibility into things that we have done historically, just not on the sales side, but on the operating our business side, greatly reducing -- the intent is to greatly reduce the buyer's time and doing their own spreadsheets, if you will.\n\nI'm simplifying that. And so, we're doing a lot of activities like that. And in terms of the data analytics to drive more business, that's still to come. We think we're doing OK right now with -- but the first effort of this area is on improving the data that -- both our data, our pperators, our buyers, our traffic people get.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nOK. Thanks very much. Best regards.\n\nOperator\n\nOur next question comes from Greg Melich of Evercore ISI. Your line is open, Greg Melich.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nTwo questions. First on gas and then the credit card. On the gas, I guess I'm curious, it looked like it's -- well, we know it's a negative mix shift, really helped ancillary. That was the one thing where gas profit or penny profit was up.\n\nCan you just remind us of that dynamic that as gasoline prices fall, how high penny profit can go during that period? And also remind us the traffic-driving relationship to gasoline.\n\nRichard Galanti -- Chief Financial Officer\n\nWell, the old story is when prices -- given that we turn our inventory about every day on average and the average in the U.S. gas stations is like every eight or nine days, so on average, we're buying -- the other guys buying it four days earlier. So when prices are going up each day, when spot prices are going up each day, it's costing us a little more because we bought it today at the highest price versus four days ago. I'm being very simple here.\n\nAnd when it's going down, just the other -- happens that we make more money when it goes down. I think part of that story has been thrown away because it seems that not only us, but the supermarket retailers and other discount retailers that operate large numbers of gas stations, they've been able to use it to -- as prices went up or went -- even went down a little bit, they didn't go down as fast as perhaps they could have been, which gives us, in our view, an ability to make a little more and still be the most competitive, in fact, in our view, gotten a little wider. So I think overall gasoline as a retail business has gotten more profitable in the last couple three years. And it's -- that profitability has been even exacerbated a little bit by what's going on with inflation and the headline news that prices are skyrocketing.\n\nAnd even when you see gas -- while the gas prices have come down at the pump, it seemed like that lagged -- crude oil coming down, why aren't is it coming down faster? And so we still are very much, in our view, the most competitive out there. And arguably, we've been able to use that to be -- continue to be more competitive elsewhere as well.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nAnd is it still 50% roughly that you think go to the club when they get gas?\n\nRichard Galanti -- Chief Financial Officer\n\nWell, historically, a little over 50 of every 100 people that filled up with gas came in to shop. That, actually, right when gas peaked right after the Ukraine-Russia thing. For a couple of weeks there, it went down to like 20%, 25% because people are topping off their tanks for fear that there was going to be a gasoline shortage. If you're as old as me, you'll remember the mid-70s.\n\nBut member utilization also went up. What we're seeing now is that a little slightly over 50 or slightly under 50.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nGot it. So that's a normal --\n\nRichard Galanti -- Chief Financial Officer\n\nBut more members are using it. Yes.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nGot it. And then, my last is on the credit card. Just update us on anything you can on the credit card penetration, the behaving of the portfolio, the sort of lift percentage of tender on the card, sort of the lift you get outside of the club with it. Just given it seems to be a key part of the renewal rate, I would imagine, continuing to enhance itself.\n\nRichard Galanti -- Chief Financial Officer\n\nSure. Auto renewal, it's not just on the Citi Visa co-brand card, it's on any Visa card here and on a Mastercard that we worked out a deal with a bank and Mastercard in Canada. So on co-brand, not only the fact that we do it exclusive, which, arguably, gives us purchasing power to lower the merchant fee and to drive the reward to the member. There's typically co-brand cards, there's revenue share.\n\nSo every time that card is used outside, we share in that revenue. While we pay for some of the rewards, that's more than offset -- that's offset by the revenue sharing. So it continues to be -- fiscal '22 is a great year for the card in terms of increasing penetration and increasing rewards to our members and very -- in our view, a very favorable effective merchant fee to us, which we don't disclose.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nAnd the auto renewal is up to what percentage?\n\nRichard Galanti -- Chief Financial Officer\n\nAuto renewal, I don't --\n\nDavid Sherwood -- Director, Financial Planning and Investor Relations\n\nMid to high-50s in the U.S.\n\nRichard Galanti -- Chief Financial Officer\n\nIn the U.S. number, mid to high 50s that have signed up for auto renewal.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nAll right. Thanks and good luck. Thank you.\n\nOperator\n\nThank you. Our next question comes from Peter Benedict of Baird. Your line is open. Please go ahead, Peter Benedict.\n\nPeter Benedict -- Baird -- Analyst\n\nYou kind of ended your prepared remarks, you said kind of seasonal going well. Maybe you can elaborate on that. Are you talking about fall seasonally, you're talking Halloween? Just what were you trying to express with that?\n\nRichard Galanti -- Chief Financial Officer\n\nWell, part of what I'm trying to express is, is that while inventories were up 26% year over year, we're starting to feel good that they're going in the right direction with the efforts that we put forth. And part of the strength is, once we also indicated -- I mentioned in the call or somebody did that seasonal -- we brought in, in some cases, seasonal early just because to make sure of the delivery date, so we want to make sure we add it in. What we've seen so far is, is Halloween is doing well, and Christmas is doing well. And so, we're encouraged by what we've seen in the last few weeks.\n\nPeter Benedict -- Baird -- Analyst\n\nOK. Perfect. And then, just kind of maybe a bigger picture, maybe historical question. Just talk to us about how your business has kind of performed in past recessions.\n\nAnd maybe what do you see from your members as you think back? What are the early indications when we're going into a tougher environment? Is it the business member that starts to slow? Is it traffic? Is it certain categories? I don't know. Just curious kind of your perspective as we're in this unique time in the economy.\n\nRichard Galanti -- Chief Financial Officer\n\nLook, I don't remember all of them, but I remember the '08, '09 one was that at the end of that year, which went from a recession to the Great Recession. It lasted for four or five years. And that -- as we entered it -- and it was pretty quick when it happened, we saw some, like, a slowdown in seasonal things, which were, like, barbecue grills and patio furniture and things like that. Big ticket -- those kind of big-ticket items slowed.\n\nAnd if I go back to my notes, I'm sure we've talked about we had an extra x million dollars of markdowns just to get through that stuff so we didn't have it lingering after the first of the calendar year. Other than that, generally speaking, one of the nice things about our model is, is we've done well in good times and bad times. And in good times, of course, people have money to spend. And in bad times, people want to save.\n\nAnd in a perverse way, while none of us ever wish COVID on anybody, from a bottom line standpoint, while it impacted some businesses negatively, it's impacted many more of our businesses positively. And we seem to keep some of that market share. Restaurants are reopening. People -- is what I read that people are still eating more at home than they did pre-COVID.\n\nAnd -- but even within that, we felt that we built some additional market share during that. So I think overall, we did find -- and I think the good news is, even in bad times, we don't view ourselves as having to be as conservative as perhaps others might be. We don't take big reductions in buying -- and open to buys or anything in that regard. In fact, I remember back in '09, '10 or early '09 with the barbecue grills and patio furniture, midway through the new year, and it was clear it was going to continue to be a recession, whether it was Craig or Jim, prior to Craig or both, the reminder to the buyers was don't bring down price points.\n\nWe've driven value at greater value and greater price points. If we want to be a little conservative, fine, but don't think it's not going to do -- go forward based on the assumption that we're providing the best value out there.\n\nPeter Benedict -- Baird -- Analyst\n\nRight. No, no. That's helpful. I think as I recall, maybe your renewal rates actually went up during that Great Recession as well.\n\nSo definitely resilient.\n\nRichard Galanti -- Chief Financial Officer\n\nYeah, they certainly have now, although auto renewal is certainly a piece of that.\n\nPeter Benedict -- Baird -- Analyst\n\nYeah, exactly. Last question just on traffic, Richard. I think 5% or so on the quarter. I think August maybe was maybe a shade below 3% in the U.S.\n\nJust how do you guys think about that? I mean is there a traffic level that you guys don't like to see it go below, obviously, more traffic better than less. But just kind of curious how you think about that.\n\nRichard Galanti -- Chief Financial Officer\n\nYeah. Part of the challenge of -- in the last couple of years is every time something happens, some of it hits the fan. and it was like the omicron surge or the delta surge, and you'll see things change dramatically in a short period of time. look, at the end of the day, whenever we see any possibility of something weak, we figure out how to drive sales.\n\nand you usually drive sales by greater values, hot items. and that goes back to the comment i made earlier about the multi-vendor mailers. that's the one thing i think we're good at, is figuring out how to drive people into the door with hot items. and that's helped us as well.\n\nDavid here just shared with me. one of the other interesting things, we see more Monday through Thursday shopping than on the weekends and vice versa. we see less Monday through Thursday and more on the weekends because people are going back to work. So during the week, we go, what's going on, and then by the end of the week, we go, phew.\n\nPeter Benedict -- Baird -- Analyst\n\nThat's good enough. Thanks very much. Good luck.\n\nOperator\n\nThank you. Our next question comes from John Heinbockel of Guggenheim Partners. Please go ahead, John Heinbockel.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nDo you guys have any sense of demographics by gold star versus executive? And the thought being, when you think about the structure going forward, could you leave gold star where it is, take executive up and maybe at an executive plus, right, that either has more than 2% or some other features, right? So you're catering to people through the income spectrum.\n\nRichard Galanti -- Chief Financial Officer\n\nYeah. I think we try to -- as you know, John, I think we try to keep things simple. We talk about all kinds of things, but we always come back home and say, let's do this and keep it simple. One of the issue -- one of the other issues about doing a higher level of membership than executive is the sales taxability in some states that is currently non-sales taxable, but at a certain level, states say it's sales taxable, not just the increment, but the whole membership fee.\n\nSo that's something we take into account also. At this juncture, I think we still went toward simple.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nOK. And then, secondly, when you think about -- I think somebody asked right about inflation going forward. A lot of what we hear is that it'll be sticky, right? Higher for longer. As it comes down, how do you think vendors are likely to respond? We're not going to see list price decreases, right? We're probably going to see more trade money step up.\n\nSo when you think about your participation in that and your ability to take advantage of that, how do you guys think about that?\n\nRichard Galanti -- Chief Financial Officer\n\nWell, again, I think, again, in terms of the stickiness, wages are still the culprit. I think again, we're in as good a position, if not better, than anybody, given that our buying power per item is off-the-charts high compared to anybody else and our buyers' focus on the detailed components of it. So there will be stickiness. You read articles every day or on television or in the periodicals, the journal about some CBG companies that just raised their prices, and they're sticky.\n\nWell, we'll try to unstick them, but I'm sure some of it will stick and some of them won't. But I think, again, we're in the best position when you think about we've got lots of $50 million and $100 million and $200 million and even higher items and even a handful of billion-dollar SKUs. So we think we are pretty good at figuring that out with our suppliers, not only just to say, hey, the price went down on this commodity or this supply cost component, but also on figuring out how to make things more efficient. I think we all -- one of the things somebody asked earlier about what have we learned on the freight and trade, container side, port side, I think we've learned through manufacturing as good as we think we are.\n\nThere are things that I hear at the budget meetings all the time about how on $100 million, $200 million, $500 million SKUs, how they're taking costs. So which right now meant that the price increase was lower than it would have been. But now they took cost out by changing the production line or eliminating some of the inside packaging. And that's part of ESG, as well as figuring out how to lower the cost.\n\nAnd again, I don't know if anybody does it, as well as we do, given that we're focused on such bigger volumes of an item.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nOK, thank you.\n\nOperator\n\nOur next question comes from Robby Ohmes of Bank of America Securities. Please go ahead, Robby Ohmes.\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nMaybe a follow-up on John's question. So the kind of signs of relief in inflation you're seeing, can you give example as in the kind of food and sundry side of the business? Are you seeing some relief on the food inflation side?\n\nRichard Galanti -- Chief Financial Officer\n\nYeah. I'm getting some help here. Certain commodities like corn are coming down. I mentioned the -- resin is coming down a little bit.\n\nSo all these things are impacting a little bit. But in some cases, the supplier are committed at the higher priced -- we work with our suppliers. And the more transparent they are with us, which we feel they are very transparent, we work together on that. In some cases, even when commodity price has gone down fast, if they committed to the next three months at a higher price because they -- we all were fearful it was going even higher, we work with them on that.\n\nSo I think, again, it's, at this juncture, anecdotal. And I can't give you any specific examples.\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nGot you. And then, just a quick follow-up. I think you mentioned optical was down. I apologize.\n\nHas optical been weaker for a while? Or did something change there?\n\nRichard Galanti -- Chief Financial Officer\n\nI think the big thing there was a promotion we did a year ago in the quarter. OK. So we did a big promotion a year ago. And this year, we did -- we do a big promotion on lots of things all the time.\n\nBut we did a big promotion this year on -- at a slightly later date. And so, we're now seeing it. Yes. So it's more timing than anything on that example.\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks so much.\n\nOperator\n\nThank you. Our next question comes from Scot Ciccarelli of Truist Securities. Your line is open. Please go ahead, Scot Ciccarelli.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nThanks, and hi, guys. So Costco tends to put a line in the sand on pricing with some items. Obviously, the hot dog and soda versus your chicken offerings, for example, despite today's inflationary pressures. But your margins are actually holding in pretty well.\n\nSo I guess the question is, are there other areas where you're being even more aggressive than normal on the pricing side? And then the flip side of that is what categories are you guys using to maybe harvest some extra margin to offset the presumed margin squeeze from holding the line of sand on pricing?\n\nRichard Galanti -- Chief Financial Officer\n\nLightning just struck me. No. We don't -- we really don't look at it that way. I think the thing I mentioned earlier about there are some businesses that are doing well with margin like gas business on a smaller way -- in the travel business, those things help us be more aggressive in other areas, or as you mentioned, hold the price on the hot dog and the soda a little longer, forever.\n\nBut at the end of the day, no, I don't think we necessarily look to find places where we can harvest margin. But we are -- there are different areas. Again, the fresh foods business, the strength in sales for a two-year period where over two years, you had 30% and 40% -- 20-plus percent increase each year. The enormity of the improvement in the bottom line, even now as we're getting some of that back now, still net-net, were better than we were two years ago.\n\nSo all those things help that process.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nBut on a go-forward basis, if you're really not looking to take any extra margins on some other categories, should we presume that margins may actually start to drop on a year-over-year basis?\n\nRichard Galanti -- Chief Financial Officer\n\nWell, we don't provide guidance, but we look at the bottom -- the top line first and how does that impact the bottom line. And historically, years ago was we want to raise margins by lowering prices but keeping a little of it. That was the old saying, you're in an inflationary environment, and that changes a little bit. But at the end of the day, it's all about driving volume.\n\nIf we can incrementally get another percentage point of comp sales, that does more than any kind of harvesting we would ever want to do, which we don't do.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nOK. Thanks, guys. \n\nRichard Galanti -- Chief Financial Officer\n\nOK. OK. I think that's it on our end. Thank you very much, everyone.\n\nWe're all here to answer some additional questions and talk to you soon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRichard Galanti -- Chief Financial Officer\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nChuck Grom -- Gordon Haskett -- Analyst\n\nDavid Sherwood -- Director, Financial Planning and Investor Relations\n\nUnknown speaker -- Citi -- Analyst\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nOliver Chen -- Cowen and Company -- Analyst\n\nGreg Melich -- Evercore ISI -- Analyst\n\nPeter Benedict -- Baird -- Analyst\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nMore COST analysis\n\nAll earnings call transcripts"
}