{
  "companyName": "Commercial Metals Company",
  "companyTicker": "CMC",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/13/commercial-metals-company-cmc-q4-2022-earnings-cal/",
  "content": "Commercial Metals Company (CMC -0.94%)\nQ4 2022 Earnings Call\nOct 13, 2022, 11:00 a.m. ET\n\nOperator\n\nHello, and welcome everyone to the fourth quarter fiscal 2022 earnings call for Commercial Metals Company. Today's materials, including the press release and supplemental slides that accompany this call can be found on CMC's investor relations website. Today's call is being recorded. After the company's remarks, we will have a question-and-answer session and we'll have a few instructions at that time.\n\nI would like to remind all participants that during the course of this conference call, the company will make statements that provide information other than historical information and will include expectations regarding economic conditions, effects of legislation, U.S. steel import levels, U.S. construction activity, demand for finished steel products, the expected capabilities and benefits of new facilities, the company's future operations, the timeline for execution of the company's growth plan, the company's future results of operations, financial measures and capital spending. This and other similar statements are considered forward-looking and may involve certain assumptions and speculation and are subject to risks and uncertainties that could cause actual results to differ materially from these expectations.\n\nThese statements reflect the company's beliefs based on current conditions, but are subject to certain risks and uncertainties, including those that are described in the risk factors and forward-looking statements sections of the company's latest filings with the Securities and Exchange Commission, including the company's latest annual report on Form 10-K and subsequent quarterly reports on Form 10-Q. Although these statements are based on management's current expectations and beliefs, CMC offers no assurance that these expectations or beliefs will prove to be correct, and actual results may vary materially. All statements are made only as of this date. Except as required by law, CMC does not assume any obligation to update, amend or clarify these statements in connection with future events, change in assumptions, the occurrence of anticipated or unanticipated events, new information or circumstances or otherwise.\n\nSome numbers presented will be non-GAAP financial measures, and reconciliations for such numbers can be found in the company's earnings release, supplemental slide presentation or on the company's website. Unless stated otherwise, all references made to year or quarter end are references to the company's fiscal year or fiscal quarter. And now for opening remarks and introductions, I will turn the call over to the chairman of the board, president and chief executive officer of Commercial Metals Company, Ms. Barbara Smith.\n\nPlease go ahead.\n\nBarbara Smith -- Chairman of the Board, President, and Chief Executive Officer\n\nGood morning, everyone, and thank you for joining CMC's fourth quarter earnings conference call. As reported in the press release, it was an outstanding quarter, and I'd like to thank CMC's roughly 12,000 employees for their continued hard work and focused efforts on behalf of our customers and stakeholders. You make these results possible. I would also like to thank our customers for their continued trust and partnership with CMC.\n\nI will start today's call with a few highlights on CMC's historic performance in fiscal 2022, then discuss our fourth quarter results before providing an update on the current market environment. Paul Lawrence will cover the quarter's financial information in more detail, and I will then conclude with our outlook for the fiscal first quarter, after which we will open the call to questions. Before starting my prepared remarks, I would like to direct listeners to the supplemental slides that accompany this call. The presentation can be found on CMC's investor relations website.\n\nOn behalf of CMC's entire team, I'm pleased to report that fiscal 2022 marked the best financial performance in our company's 107-year history. CMC generated its highest ever full year net earnings as well as EBITDA. At the segment level, both North America and Europe reported record results. This strong performance translated into an annual return on invested capital of 25.5%, up over 10 percentage points from the very healthy level achieved the prior year.\n\nDuring each of the last 14 quarters, a period that includes the global pandemic, widespread supply chain dislocations, labor force challenges and a war in Ukraine, CMC has generated annualized ROIC well above 10%. This indicator alone is a confirmation of the strength of our strategy, the consistency of our execution, which is delivering superior value to our shareholders. Overall, our fiscal 2022 results clearly demonstrate the impact of the thoughtful and decisive strategic actions we've taken over the last several years as well as our team's ability to execute within the strong market conditions present throughout 2022, not to mention the flexibility in our operating model to respond to unforeseen changes and macro events. Our achievements extend beyond CMC's financial record.\n\nDuring fiscal 2022, we continued to deliver on our strategic growth plan, evolve our capital allocation framework and advance our sustainability efforts. All of the actions taken by CMC in fiscal 2022, I am extremely proud of the way of our Polish team responded to the needs of Ukrainian refugees fleeing the war in their home country. We have discussed this before, but it's worth repeating. CMC employees opened their homes to refugees.\n\nThey volunteered at the border on their own time, and they helped transport Ukrainians across the border to safety. CMC's local management opened up company facilities to refugees and provided them with basic necessities. These selfless acts of kindness provided hundreds of people in need of food, shelter, comfort and security, speaking to the character of our people and the culture of our company. I will add that our team in Poland did all this while navigating a volatile business environment and avoiding disruptions related to the war, the ongoing European energy crisis and supply chain challenges.\n\nOn the strategic front, CMC took several actions that we expect will provide significant benefits in the years ahead and form the path of meaningful growth for our company. The acquisition of Tensar Corporation, which we completed in April, provides us with a significant new growth platform and enhances our ability to provide valuable solutions to construction customers across a wide variety of end-use applications. Tensar was already on a strong growth trajectory as a leader in innovative geosynthetic and geotechnical construction solutions. In combination with CMC we expect to accelerate Tensar's growth by leveraging CMC's strong commercial relationships and opening new doors for Tensar to demonstrate the value of their unique construction solutions expertise.\n\nAnother major strategic growth initiative is CMC's Arizona 2 project, which remains on track for a spring 2023 start-up. This new manufacturing site will once again be the first micro mill in the world capable of producing both rebar and merchant bar, while also pioneering the Q1 power systems capability of directly connecting to renewable energy sources while also providing additional production efficiencies. Arizona 2's commissioning looks to be well timed to support the Infrastructure Investment and Jobs Act, which should begin to increase public infrastructure construction activity next year. We intend to focus initially on ramping up rebar production with the commissioning of merchant products to follow soon after.\n\nCurrently, we expect to produce a mix of approximately two-thirds rebar and one-third merchant bar on a run rate annual basis. But the beauty of Arizona 2 is the flexibility to seamlessly change that mix based on market demand. An important part of building for the future is CMC's intent to construct a fourth micro mill to be located in the Eastern U.S. We view this as a major strategic step toward strengthening our position in this key market, enhancing our ability to optimize production and logistics across our network of mills, and improving customer service capabilities.\n\nWe will work through the final site selection process. While we work through the final site selection process, we remain committed to the project and confident in its financial and strategic merits. We look forward to sharing more details once a site selection is finalized. To give you a sense of the scale of these three strategic initiatives I just outlined, we expect the combined effect will be to increase CMC through-the-cycle EBITDA by more than $200 million, not including future commercial synergies related to the Tensar acquisition.\n\nDuring last year's fourth quarter earnings call, we indicated that CMC was evolving its capital allocation framework to enhance distributions to shareholders. The intent was to continue emphasizing value accretive growth while increasing cash returns to shareholders in the form of dividends and share repurchases. In light of the strategic actions just outlined and a 300% increase to cash distributions, we are certainly making good progress on both goals. During the fourth quarter alone, CMC repurchased approximately $106 million of common stock equal to approximately 3 million shares.\n\nOur financial strength provides us with the ability to continue executing against our current program, and we intend to do so. In addition to share buybacks, we are also utilizing CMC's dividend policy to return more cash to shareholders. This week, our board of directors approved a $0.02 increase to CMC's quarterly dividend. This represents a 14% increase to July's level and a 33% increase to the amount paid in July of last year.\n\nBefore I turn to our fourth quarter results, I would also like to take a moment to emphasize the advancement of CMC's sustainability efforts. Since our inception as a single recycling location over 100 years ago, environmental stewardship has been central to our purpose and culture. We continued that legacy in fiscal 2022 with the launch of our RebarZero line of carbon-neutral long steel products. By combining CMC Steel, which already has among the lowest Scope 1 and 2 greenhouse gas emissions in the industry, with renewable energy credits and high-quality carbon offsets, we are now able to provide customers with solutions that are net zero from the mill gate to the job site.\n\nRebarZero neutralizes Scope 1, 2 and 3 emissions at both our mills and fabrication shops and ensures our environmentally focused customers can remain at the leading edge of sustainable construction. Reporting on CMC's sustainability programs and providing meaningful disclosures on a timely basis remains a high priority for our company. To that end, we will be issuing our enhanced annual sustainability report in December. Turning now to our fourth quarter '22 performance.\n\nCMC generated net earnings of $288.6 million or $2.40 per diluted share on net sales of $2.4 billion. Excluding the impact of nonoperational items that Paul will discuss, adjusted earnings were $294.9 million or $2.45 per diluted share, the second best quarterly result in our company's history. CMC generated core EBITDA of $419 million, an increase of 64% from a year ago. With this quarter's strong performance CMC achieved an annualized return on invested capital of 24%.\n\nOur past and current strategic actions have clearly created consistent and substantial value for shareholders, and we are poised to continue doing so. I would now like to turn to CMC's market environment, starting with North America. We are well aware of the recessionary concerns that are growing in the investment community and being reported in the financial press, and we are monitoring these conditions closely. However, looking at our business, we see no meaningful signs of a slowdown.\n\nDemand in the fourth quarter was strong across our product lines in major geographies, with the exception of some inventory destocking that resulted from customers carrying higher inventory than historical norms, in order to manage ongoing supply chain constraints. The key indicators that lead rebar consumption by 9 to 12 months remains strong. These indicators include both external and internal metrics that have been historically reliable in our indices we often reference in our market commentary. Let me review several of the key external indicators we monitor.\n\nThe Architectural Billings Index has been in expansionary territory for over a year, signaling future growth in private non-residential spending. Additionally, readings have been consistently positive for each of the project types tracked, commercial and industrial, institutional and residential. Strength in residential is being driven by increased activity in multifamily developments. In August, multifamily housing starts reached the highest monthly level in 37 years.\n\nThe Dodge Momentum Index, another measure of non-residential projects entering the planning phase hit a 14-year high in September. The reading was published just last week and highlighted strong growth in both the commercial and institutional components of the index. Data centers, education, healthcare and recreation were reported as areas of particular strength. CMC's own internal view mirrors the picture provided by these external sources.\n\nOur downstream bidding activity remained at historically high levels during the fourth quarter driven by a broad basket of project types in both the public and private sectors. So to sum up our near-term view, while we certainly don't discount the economic concerns making headlines, the best indicators of future construction activity continue to point toward strong go-forward demand. Beyond the near-term, we believe there are structural trends underway that will bolster domestic construction activity. The first is a federal infrastructure package signed into law last November.\n\nAt full run rate, this plan is expected to increase federal funding for core rebar consuming projects such as highways, bridges and related structures by 65% compared to the FAST Act that it replaced. We estimate the impact will be roughly 1.5 million tons of incremental annual rebar demand within a domestic market of roughly 9 million tons, representing an approximately 17% increase in consumption. Spending is expected to ramp up over five years and assuming typical timeframes for project approval, bidding and awarding, we should begin to see the impact on construction activity in calendar 2023. Supporting this view, third-party data that tracks projects in predesign and design phases indicates a large volume of work is now moving through the pipeline.\n\nThese projects should translate into healthy future flow of CMC bidding bookings to backlog activity in the coming quarters. Another meaningful structural trend is the reshoring of critical industries. We have previously mentioned the massive scale and pace of construction of new semiconductor facilities. Since our last earnings call in June, there have been at least three new major announcements, including $100 billion multiphase development in Upstate New York, a $15 billion  memory chip plant in Idaho and a $5 billion silicon wafer plant in Texas.\n\nCMC is well situated geographically to participate in each of these projects. These recent announcements are in addition to five large projects that are already underway in the U.S. CMC will participate in all of these projects with two each in Arizona and Texas and one in Ohio. These plants are massive consumers of rebar given the precision needed on the work floor, which necessitates rigidity and foundations and building structure.\n\nEach plant announced or under construction, is planned in multiple phases, meaning that its consumption of rebar will carry well into the future. Semiconductor chip and wafer plants are the highest profile examples of reshoring, but other industries are also experiencing increased activity or project planning. These would include LNG facilities for the export of natural gas as well as the automotive supply chain with a particular focus on electric vehicles and battery production. The last three years have exposed the vulnerabilities of concentrated global supply chains, structured to operate under stable conditions and cooperative political regimes.\n\nPandemic, geopolitical events have reminded us of the need for a more distributed set of sourcing options, ensuring reliability and flexibility in securing critical materials and equipment. Eventually, we expect reshoring to extend well beyond the areas we just discussed. Turning to merchant bar. Underlying demand conditions in end-use OEM markets are generally stable.\n\nThe industry did experience a short-term destocking during July and August, which can be seen in our reported volume figures. The destocking was triggered by the expectation for the first downward price adjustment for merchant bar in over two years. That looks to have run its course as service centers appear to be purchasing in line with real demand levels. Based on conversations with OEMs and September's service center order rates, we anticipate merchant bar volumes to be strong in the first quarter.\n\nAs you might expect, market conditions in Europe are more challenging. Overall construction activity continued to grow on a year-over-year basis during the fourth quarter. However, residential activity, which has been strong for more than a year, began to show signs of slowing during the quarter due to the impact of rising mortgage interest rates. In addition, as a result of the ongoing energy crisis, industrial activity in Central Europe is now contracting.\n\nThis has impacted demand for merchant bar and some wire rod products. Turnaround in this activity likely depends on the success of the European Union's efforts to lower energy prices from their current historically high levels. General destocking among end users and intermediaries negatively impacted volumes for most products during the fourth quarter. This reflected the unwinding of the panic buying that took place in March and April and a portion in May following the outbreak of the war in Ukraine as well as the uncertainty surrounding newly announced trade sanctions.\n\nResults of the destocking was reflected in CMC shipments in the early part of the fourth quarter. Encouragingly, volumes rebounded nicely, and we anticipate that this improved pace will carry into our first quarter. As illustrated on Slide 9 in the supplemental presentation, the energy crisis, combined with trade sanctions, has impacted historical trade flows in the region, which has benefited Poland on a relative basis. Poland's net rebar import position has declined significantly compared to a year ago, looking at trade flows with countries both inside and outside the European Union.\n\nPoland's trade with EU countries has benefited from a relatively advantageous energy cost position, whereas the average spot price for electricity was up over 280% on a year-over-year basis across Germany, France and Italy -- it was up a more modest 98% in Poland. With regards to rebar trade within countries outside the EU, little foreign material has entered the Polish market to offset the loss of Russian and Belarusian rebar. Imports have increased significantly into the broader EU, but this material has gone to countries that are more logistically accessible and are experiencing higher energy costs. One last note on Europe.\n\nThe tendency might be to view our fourth quarter performance as a large reduction from the historical heights of the third quarter. The third quarter was extraordinarily unusual and unlikely to be repeated. From a humanitarian perspective, I certainly hope it is never repeated. Looking at the fourth quarter in a broader historical context, however, reveals it was an excellent result, with adjusted EBITDA at three times the average rate of the past 10 fiscal years.\n\nThis becomes even more impressive when you consider the difficulties being faced across the EU steel industry. Such a strong financial performance in an uncertain environment is one of the many reasons we are confident in CMC Europe's competitive position. Finally, as stated in our press release, our board of directors declared a quarterly cash dividend of $0.16 per share of CMC common stock for stockholders of record on October 27, 2022. The dividend will be paid on November 10, 2022.\n\nThis represents CMC's 232nd consecutive quarterly dividend with an annual -- with an amount paid per share increasing 14% from quarter 3 of fiscal 2022 and represents, as I said earlier, a meaningful increase in our return of capital to shareholders. With that overview, I will now turn the discussion over to Paul Lawrence, senior vice president and chief financial officer, to provide some more comments on the results for the quarter.\n\nPaul Lawrence -- Vice President and Chief Financial Officer\n\nThank you, Barbara, and good morning to everyone on the call today. As Barbara noted, we reported fiscal fourth quarter 2022 net earnings of $288.6 million or $2.40 per diluted share compared to prior-year levels of $152.3 million and $1.24, respectively. Results this quarter include a net after-tax charge of $6.3 million, the majority of which relates to CMC's acquisition of Tensar. These costs were in the form of acquisition expenses and purchase accounting adjustments related to inventory write-ups.\n\nThe quarter also includes a small asset impairment charge taken in North America. Excluding the impact of these items, adjusted earnings were $294.9 million or $2.45 per diluted share. Core EBITDA was $419 million for the fourth quarter of 2022, representing a sharp increase from the $255.9 million generated during the prior-year period. Slide 11 of the supplemental presentation illustrates the strength of CMC's quarterly results.\n\nOur North America segment drove the significant year-over-year earnings growth, while Europe held steady at a strong level. Core EBITDA per ton of finished steel reached its second highest rate ever coming in at $269 per ton compared to $155 per ton a year ago. Reviewing our results by segment for the fourth quarter of fiscal 2022, CMC's North American segment generated adjusted EBITDA of $370.5 million for the quarter, equal to $327 per ton of finished steel shipped. Segment adjusted EBITDA improved 75% on a year-over-year basis, driven by significantly increased margins on steel and downstream products over their underlying scrap costs.\n\nPartially offsetting this benefit were higher controllable costs on a per ton of finished steel basis due primarily to increases in unit pricing for alloys, energy and freight. Selling prices for steel products from our mills increased by $204 per ton on a year-over-year basis and were essentially flat from the prior quarter. Margin over scrap on steel products increased $251 per ton from a year ago. In comparison to our third quarter, metal margin increased $79 per ton in the fourth quarter due to reduced scrap costs.\n\nHowever, not all of this benefit was realized in the quarter as we were selling material produced with higher scrap costs from the prior quarter. The average selling price of downstream products increased by $334 per ton from the prior year, reaching a new record of $1,348. The spread of our downstream average selling price above our cost of scrap at the mill also reached a new record of $876 per ton. This is a good measure of the total margin available to CMC through our integrated production network.\n\nThis trend should continue into fiscal 2023 as our backlog continues to reprice higher. Shipments of finished product in the fourth quarter were down modestly from a year ago and followed a typical seasonal pattern compared to the third quarter. End market demand for our mill products remained robust. However, as Barbara mentioned, shipments were impacted during the quarter by destocking in the merchant bar supply chain, which now appears to have abated.\n\nAdditionally, progress on construction sites in certain geographies continue to be slower than normal due to constrained supply of labor and materials. We expect this situation to dissipate heading into the winter months. CMC's downstream shipments increased by roughly 4% from the prior-year period, driven by the growth in our construction backlog, which more than offset the impact of the slower job site performance just mentioned. Turning to Slide 13 of the supplemental deck.\n\nOur Europe segment generated adjusted EBITDA of $64.1 million for the fourth quarter of 2022, compared to adjusted EBITDA of $67.7 million in the prior-year quarter. Margins over scrap increased $138 per ton on a year-over-year basis, reaching $453 per ton. This was the result of $125 per ton increase in average selling price and a $12 per ton reduction in the cost of scrap utilized. This margin benefit was offset by higher costs for energy and alloys, and the negative P&L impact of selling higher cost inventory into a falling price environment, as well as the weakening Polish zloty relative to the U.S.\n\ndollar. CMC's energy hedge position once again paid significant dividends as actual costs were well below the levels that would have been paid had we purchased solely on a spot basis. Europe volumes decreased 7% compared to the prior year as a result of supply chain destocking that Barbara outlined previously. Demand conditions within Central Europe were mixed.\n\nThe Polish construction market continued to grow, while industrial production has entered a contractionary phase as a result of the ongoing energy crisis. We believe CMC is well-positioned for this current period of volatility in Europe. We are a low-cost leader with operational flexibility to adjust and serve a changing market condition. Tensar generated EBITDA of $10.2 million during the fourth quarter.\n\nExcluding the $6.5 million adjustment related to purchase accounting effect on inventory, amounted to $16.7 million on net sales of $74.1 million, yielding an EBITDA margin of 22.5%. As a reminder, Tensar performance will be included within CMC's existing segments, but we intend to provide visibility into business results and developments. Of the $16.7 million in EBITDA, excluding purchase accounting adjustments, $13.8 million was included within CMC's North American segment, while the remaining $2.9 million was reported within the Europe segment. It should be noted that at this time, we do not expect any further purchase accounting adjustments related to this acquisition.\n\nMoving to the balance sheet. As of August 31, 2022, cash and cash equivalents totaled $672.6 million. In addition to cash and equivalents, we had approximately $647 million of availability under our credit and accounts receivable facilities, bringing total liquidity to slightly over $1.3 billion. CMC's $330 million of 2023 notes have moved into current maturities on our balance sheet.\n\nThese notes do not have any early call provision and we are currently evaluating refinancing alternatives that are consistent with our commitment to maintaining a healthy balance sheet, financial flexibility, and a strong liquidity position as well as utilizing cash to lower CMC's overall gross leverage. During the quarter, we generated $458.6 million of cash from operating activities, which included approximately a $90 million release of working capital, principally driven from the lower scrap costs. For the year, CMC generated $700 million of cash from operations despite investing $573.2 million in working capital. Our free cash flow in fiscal 2022 amounted to $250 million, defined as our $700 million in cash from operations less $450 million of capital expenditures.\n\nThat does not -- that figure does not include the $315 million harvested from asset sales to support our overall strategic vision. Our leverage metrics remain attractive and have improved significantly over the last several fiscal years. As can be seen on Slide 17, our net debt-to-EBITDA ratio now sits at just 0.5 times, even after the purchase of Tensar. We believe our robust balance sheet and overall financial strength provide us the flexibility to finance our strategic organic growth projects and pursue opportunistic M&A while continuing to return cash to shareholders.\n\nCMC's effective tax rate in the quarter was 14.8%, driven by the timing of recognition of research and development and foreign tax credits. Looking ahead to fiscal 2023, we currently expect our full year effective tax rate to be between 22% and 25%, with our cash tax rate to be slightly lower at approximately 20%. Turning to CMC's fiscal 2023 capital spending outlook. We expect to invest $450 million to $500 million in total, roughly a third of which can be attributable to Arizona 2.\n\nAs Barbara noted, our announced fourth micro mill project remains in the site selection phase. As a reminder, we assess projects like this viewing the through-the-cycle cash flow generation of projects. So while the site selection has taken longer than anticipated, we remain very encouraged by the strategic merits of this project. Lastly, CMC purchased roughly 3 million shares during the fiscal fourth quarter at an average price of $35.48 per share.\n\nTransactions since the initiation of the buyback program have amounted to roughly $161.9 million, leaving $188.1 million remaining under the program. And this concludes my remarks, so I'll turn it back to Barbara for comments on our outlook.\n\nBarbara Smith -- Chairman of the Board, President, and Chief Executive Officer\n\nThank you, Paul. We are entering fiscal 2023 in a strong position with the downstream backlog and bidding activity at historically high levels, giving us confidence in the near-term outlook for volumes. Additionally, we look forward to the start-up of our newest micro mill, Arizona 2, in the spring of next calendar year, which will greatly enhance CMC's ability to capitalize on the strength we see in construction markets. We anticipate another strong financial performance in the first fiscal quarter.\n\nWe expect good demand for our products to continue in North America, while conditions in Europe are more uncertain. However, as I discussed earlier, CMC's operations in Poland are very well-positioned to compete given their cost leadership position and operational flexibility. Margins over scrap in both North America and Europe are likely to compress slightly from the fourth quarter levels in order to remain competitive with raw material price changes and increased long steel supply. Once again, I'd like to thank all of the CMC employees for delivering yet another outstanding quarter and year of performance.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Emily Chieng from Goldman Sachs. Please go ahead, Emily.\n\nEmily Chieng -- Goldman Sachs -- Analyst\n\nGood morning, Barbara and Paul, and thank you for the update this morning. My first question is just around the North American construction markets and what you're seeing here. Could you perhaps provide some color as to how many months your order book length is now sitting at and how we should be triangulating the comment around customer destocking activity starting to ease and the expansion of backlog levels? Is that implication that we should be seeing shipments in the next couple of quarters trend higher? \n\nBarbara Smith -- Chairman of the Board, President, and Chief Executive Officer\n\nYeah, Emily. Our backlog extends well into 2023. And so we're sitting in an excellent condition and with a lot of confidence in terms of the comment I made around a really solid first quarter in fiscal 2023. Whenever there is a raw material price change, particularly a downward trend in raw materials, you will tend to see customers go through a bit of destocking.\n\nThey don't want to be saddled with high-priced inventory. So they'll adjust their order rate temporarily and work through the inventory that they have on hand. And clearly, we know there have been any number of supply chain disruptions over the last three years, starting with the pandemic and global macro issues and the war in Ukraine, I think the supply chain issues, while they'll continue to persist to some degree, certainly, the initial shock is behind us, and I think that's another reason why customers were adjusting inventory levels. But based on what we're seeing here early in the quarter, that gives us confidence to say that, that destocking effort is behind us.\n\nAnd so the market fundamentals are going to kick in. And so we would expect a really solid first quarter. You always have seasonality that approaches around the holidays and weather, but otherwise, we see a strong rebound in our shipments.\n\nEmily Chieng -- Goldman Sachs -- Analyst\n\nGreat. I appreciate the color there Barbara. A follow-up question, if I may, just around the controllable costs. And I think you flagged some pressures along the freight alloying and energy cost side of the equation there.\n\nBut perhaps if you could talk to a direction of travel for each of those three components, both in the U.S. and Europe, that would be helpful. Thank you.\n\nPaul Lawrence -- Vice President and Chief Financial Officer\n\nSure. If we look, Emily at the U.S., I think the -- we had a combination in the energy market of an extremely hot summer as well as the global challenges with natural gas and other energy costs. And so if we look at our cost profile in the U.S. market, certainly, energy was the leading area of inflation.\n\nBut also as we cited increases in consumables and alloys and freight, I think where we're at today is really we can see our go-forward controllable costs being somewhat in line with what we experienced in the fourth quarter with relatively minor puts and takes in the components of the overall cost structure, but see that as being the environment in which we'll operate in 2023. In Europe, it is strictly a story of energy costs. And as we outlined and specifically, I think Barbara mentioned Slide 9 of the supplemental slides, we're fortunate to operate in Poland despite the overall inflationary environment in energy, in Europe, Poland is much more advantageous in relation to other countries given its domestic source for much of its energy needs. And so combining the low cost, lower cost of energy in Poland with the hedges that we have in place, which are at least a good portion of our hedges are of a long-term nature, position us well to really be competitively in a strong position in relation to competitors for a long time to come.\n\nBut in Europe, it is principally energy, the same alloy inflation that we're seeing, but it's relatively small in comparison to the energy.\n\nEmily Chieng -- Goldman Sachs -- Analyst\n\nGreat. Thanks, Paul.\n\nOperator\n\nAnd our next question is coming from Timna Tanners from Wolfe Research. Please go ahead, Timna.\n\nTimna Tanners -- Wolfe Research -- Analyst\n\nGood morning. Thanks very much for all the detail. Two things I wanted to explore a bit more with you. If you could characterize more of the import pressure you talked about in both markets.\n\nI know in the U.S., definitely a 25% tariff still has a pretty big impact on many countries with section 232. And it seems that Turkey is pretty hobbled with Europe also hobbled from energy prices. So I'm just wondering if you could talk a little bit more about how much pressure you're seeing and if that's pervasive in both markets. Second question is you talked about housing in Europe, but I was wondering if you could talk a little bit about what you're seeing on the housing side in the U.S.\n\nBarbara Smith -- Chairman of the Board, President, and Chief Executive Officer\n\nYeah. Thank you, Timna. Yeah, I don't think we want to overemphasize import pressure and all that data is very public, as you know. But they're year on year, if you look at '21 versus '22.\n\nThere has been more foreign product available here in the U.S. market. And a good bit of that coming on the wire rod side. And there were a number of production issues that various competitors over this past year that made it necessary for some customers to avail themselves of those imports.\n\nAnd so as you know, we've been around this industry for a long time. We just -- we deal with that on an ongoing basis. And as you point out, we're still in a really strong trade environment that deters the illegal and dumped sources of material coming from foreign and you rightly point out the struggles that are going on in Turkey, which is the primary offender as it relates to our products. So we monitor it all the time, and we respond accordingly.\n\nBut again, we think we're still going to enjoy a good trade environment. In terms of housing in the U.S., it's an interesting one because housing has been incredibly strong for a long period of time here. But now you have a rising interest rate environment and interest rates that folks haven't seen in quite a period of time. Unlike myself, where my first mortgage rate was close to 12%.\n\nAnyway, I think we're seeing a shift potentially from single-family to multifamily and that is evident in some of the external data that we track. There is still the need for housing formation. And so if interest rates are a deterrent to single family, then you tend to see an increase in multifamily, which is actually a higher intensity of rebar and structural in the multifamily. So we certainly think that overall, that is not going to have a meaningful impact to our business, because as I pointed out, we still have the infrastructure that is not even really kicking in at this point.\n\nTimna Tanners -- Wolfe Research -- Analyst\n\nOK, great. And if I could sneak in one more, just to ask about the European first quarter, if you're expecting to see that $15 million carbon credit that you've seen those last several years again?\n\nPaul Lawrence -- Vice President and Chief Financial Officer\n\nWe are, Timna. It's going to be -- the amount is yet to be determined and fully approved by the EU. That's expected to occur next week. But all indications are that the amount will be similar in zloty that we've received over the last couple of years.\n\nObviously, the translation back to dollars is reduced, but we do expect that the final approval of that program to take place next week.\n\nTimna Tanners -- Wolfe Research -- Analyst\n\nOK. Super. Thanks, again.\n\nBarbara Smith -- Chairman of the Board, President, and Chief Executive Officer\n\nThanks, Timna.\n\nOperator\n\nOur next question is coming from Seth Rosenfeld from BNP Paribas. Please go ahead, Seth.\n\nSeth Rosenfeld -- Exane BNP Paribas -- Analyst\n\nGood morning. Thanks for taking our questions today. Another question, please, on the European market. In your prepared remarks, you commented on destocking early in Q4, but perhaps a reversal of the amortization of the destocking pressure late in the quarter.\n\nCan you provide a bit more color on the scale of that downward pressure. And I guess to the degree of confidence that might have come to an end, your optimism would perhaps stand out with some other channel checks in Europe that are still seeing additional destocking pressure looking into the fourth calendar quarter. I'll start there, please.\n\nBarbara Smith -- Chairman of the Board, President, and Chief Executive Officer\n\nYou're popping a lot, Alex. So I'm not sure I captured everything. But I'll start and Paul -- excuse me. He can continue if he -- or reask your question.\n\nWe think the destocking is behind us. Clearly, a lot depends upon just where does the economy in Europe go and everybody has their own view of that. I think we just try to emphasize that we have a strong position relative to other alternatives and we're very reliable. Our cost and operational flexibility is really a strategic advantage for us, but we think the destocking is largely behind us.\n\nPaul Lawrence -- Vice President and Chief Financial Officer\n\nYeah. And Seth, I would just note that I think there's a big dichotomy between the long product area and the flat-rolled space. I think in flat rolled, it's continuing to destock, but on the long steel side in which, as you know, that's where we play. It's a different market.\n\nThe underlying -- there is more strength and we certainly did see the volumes bounce back significantly as Barbara said.\n\nSeth Rosenfeld -- Exane BNP Paribas -- Analyst\n\nThank you very much. And a second question, please, in Europe. Earlier in the year, your team spoke publicly about some interest in perhaps expanding your capacity within Europe, either organically or inorganically. Obviously, the macro condition has changed a great deal since.\n\nAnd I'd love to hear your thoughts on the attractiveness of investing in Europe in the current environment. Thank you.\n\nBarbara Smith -- Chairman of the Board, President, and Chief Executive Officer\n\nYeah. Alex, thank you. We're always evaluating organic, inorganic, every opportunity to look at growth. And I would just say that we take a very long-term view on growth, and we also have a very disciplined process for evaluating any of those types of things.\n\nAnd we never use peak of cycle kinds of market conditions in which to evaluate projects like that. And so there's nothing specific that we have to talk about that in this current moment, but we're always evaluating things with a very, very long-term view.\n\nSeth Rosenfeld -- Exane BNP Paribas -- Analyst\n\nOK, thank you.\n\nBarbara Smith -- Chairman of the Board, President, and Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] And our next question is coming from Phil Gibbs from KeyBanc Capital Markets. Phil, please go ahead.\n\nPhil Gibbs -- KeyBanc Capital Markets -- Analyst\n\nHey. Good morning.\n\nBarbara Smith -- Chairman of the Board, President, and Chief Executive Officer\n\nHey, Phil.\n\nPaul Lawrence -- Vice President and Chief Financial Officer\n\nGood morning, Phil.\n\nPhil Gibbs -- KeyBanc Capital Markets -- Analyst\n\nThe first question is just on fabrication pricing. Nice step-up this quarter. I know the backlog pricing continued to move up over the last several months as rebar prices escalated and a lot of that tends to lag as we know. So how many quarters do we have looking ahead where pricing could actually continue to move up or have we leveled out here?\n\nPaul Lawrence -- Vice President and Chief Financial Officer\n\nYeah. Phil, I'll start. Barbara can add. If we look at our current activity that Barbara alluded to, it is strong in the fourth quarter.\n\nAnd really, we continue to see good levels on the downstream work. And as a result, really, the backlog is made up of what's in there and new stuff. So assuming the -- no significant degradation in the pricing of new work going in, we would expect over the next two quarters or so for the backlog pricing to continue to catch up with the current price levels.\n\nPhil Gibbs -- KeyBanc Capital Markets -- Analyst\n\nOK, that's helpful. And I know you gave some color on capex for this year, $475 million or so at the midpoint. Is there anything baked in there for the new potential mill in the Northeast and whether it  obe permitting or due diligence or is that going to be something that phases into the out years?\n\nBarbara Smith -- Chairman of the Board, President, and Chief Executive Officer\n\nYeah, Phil. There'll be a little -- there's a little bit in there. I don't know the hard number off the top of my head. But as you can appreciate, the first step is to go through the permitting process, which can have some long duration to it.\n\nAnd -- but we will do -- we will begin the engineering phase and other things. And so the bulk of it would probably come in the following fiscal year.\n\nPhil Gibbs -- KeyBanc Capital Markets -- Analyst\n\nOK. And then my last question is just on net working capital. Assuming that you have scrap stay around current levels plus or minus, and you've got let's just say, broader pricing downstream and rebar stay around current levels, what do you expect net working capital to be a use or a source in fiscal '23? Thank you.\n\nPaul Lawrence -- Vice President and Chief Financial Officer\n\nYeah, Phil, if we hold all those things relatively constant to where they are today, we would really see working capital being relatively flat from where we are for the year. We'll have our seasonality throughout the year. But for the full year view, give -- if we assume things are going to be pretty consistent, the level of working capital will also be consistent.\n\nPhil Gibbs -- KeyBanc Capital Markets -- Analyst\n\nThank you.\n\nBarbara Smith -- Chairman of the Board, President, and Chief Executive Officer\n\nThanks, Phil.\n\nOperator\n\nAt this time, there appears to be no further questions. Ms. Smith, I'll now turn the call back over to you.\n\nBarbara Smith -- Chairman of the Board, President, and Chief Executive Officer\n\nThank you. Thank you, everyone, for joining us on today's conference call. We look forward to speaking with many of you during our investor calls in the coming days and weeks. Have a great rest of your day.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBarbara Smith -- Chairman of the Board, President, and Chief Executive Officer\n\nPaul Lawrence -- Vice President and Chief Financial Officer\n\nEmily Chieng -- Goldman Sachs -- Analyst\n\nTimna Tanners -- Wolfe Research -- Analyst\n\nSeth Rosenfeld -- Exane BNP Paribas -- Analyst\n\nPhil Gibbs -- KeyBanc Capital Markets -- Analyst\n\nMore CMC analysis\n\nAll earnings call transcripts"
}