{
  "companyName": "Zebra Technologies",
  "companyTicker": "ZBRA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/zebra-technologies-zbra-q3-2022-earnings-call-tran/",
  "content": "Zebra Technologies (ZBRA -0.43%)\nQ3 2022 Earnings Call\nNov 01, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day and welcome to the third quarter 2022 Zebra Technologies earnings conference call. All participants will be in listen-only mode. [Operator instructions] Please note, this event is being recorded. I now like to turn the call over to Mike Steele, vice president of investor relations.\n\nPlease go ahead.\n\nMike Steele -- Vice President, Investor Relations\n\nGood morning and welcome to Zebra's third quarter conference call. This presentation is being simulcast on our website at investors.zebra.com and will be archived there for at least one year. Our forward-looking statements are based on current expectations and assumptions and are subject to risks and uncertainties. Actual results could differ materially due to factors discussed in our SEC filings.\n\nDuring this call, we will reference non-GAAP financial measures as we describe our business performance. You can find reconciliations at the end of the slide presentation and in today's earnings press release. Throughout this presentation, unless otherwise indicated, our references to sales growth are year over year on a constant currency basis and exclude results from recently acquired businesses for the 12 months following each acquisition. This presentation will include prepared remarks from Anders Gustafsson, our chief executive officer; and Nathan Winters, our chief financial officer.\n\nAnders will begin with our third quarter results. Then Nathan will provide additional detail on the financials and discuss our fourth quarter outlook. Anders will conclude with progress made on advancing our Enterprise Asset Intelligence vision. Following the prepared remarks, Joe Heel, our chief revenue officer, will join us as we take your questions.\n\nNow let's turn to Slide 4, as I hand it over to Anders.\n\nAnders Gustafsson -- Chief Executive Officer\n\nThank you, Mike. Good morning, everyone, and thank you for joining us. For the quarter, we realized a sales decline of 3%, an adjusted EBITDA margin of 21.1%, a 60-basis-point decrease, and non-GAAP diluted earnings per share of $4.12, a 9% decrease from the prior year. We were unable to fulfill all orders due to supply chain challenges related to persistent component shortages for certain products, as well as disruption in the transition to our new North American distribution center in the Chicago area.\n\nThese challenges led to lower throughput than planned late in the quarter. This, along with orders from some large customers being deferred, contributed to the lower than expected results. In North America and EMEA, cycling two prior year large mobile computing app deployments and suspension of sales in Russia resulted in the sales declines. Our Asia Pacific and Latin America regions were bright spots in the quarter with double-digit sales growth.\n\nGlobally, we realized sales growth with our small and medium-sized customers, which was more than offset by decline from our large customers. From a solutions offering perspective, we drove growth across data capture, printing supplies, services, and software. These helped to partially offset the sales decline in mobile computing. We expanded gross margin over the prior year despite significant FX pressure, yet EBITDA margin contracted and EPS declined due to the deleveraging of operating expenses from the sales decline.\n\nWe have initiated meaningful actions to address the supply chain challenges, which was the primary driver for our results. These include organizational changes and the reallocation of resources to drive improved focus and execution in our supply chain. Initiating specific actions with our supply chain partners to improve operations and extending the planned transition of our North America distribution center to mitigate the execution risk. Customer demand and our order pipeline generally remains healthy, yet has slowed since late Q3.\n\nGiven the macroeconomic uncertainty, we see elongated sales cycles and certain projects being deferred. As a result, we are taking a cautious approach to our Q4 sales outlook and expense management while working to right size our working capital levels in the coming quarters to improve free cash flow conversion. At the same time, we continue to prudently invest in initiatives that advance our solutions offerings. With that, I will now turn the call over to Nathan to review our Q3 financial results in more detail and discuss our fourth quarter outlook.\n\nNathan Winters -- Chief Financial Officer\n\nThank you, Anders. Let's start with the P&L on Slide 6. In Q3, adjusted net sales declined 4%, including the impact of currency and acquisitions, and down 3.2% on an organic basis, primarily due to supply chain challenges and lower sales to large customers. Our Asset Intelligence and Tracking segment increased 12.4%, driven by double-digit growth in both printing and supplies, as product availability has continued to generally improve.\n\nEnterprise Visibility & Mobility segment sales declined 8.8% due to supply chain bottlenecks, including component shortages. We realized particularly strong growth in data capture solutions, including RFID, as well as rugged tablets. We also drove growth across services and software with strong service attach rates and attractive software offerings. Performance was mixed across all regions.\n\nAsia-Pacific sales grew 20% with broad-based strength across the region, including China. Latin America, sales increased 10% with exceptional growth in Mexico. And in North America and EMEA, sales decreased 9% and 2%, respectively, due to supply chain challenges, lower sales to large customers, and the suspension of sales in Russia. Adjusted gross margin increased 80 basis points to 45.8% due to favorable business mix and lower premium supply chain costs, partially offset by unfavorable FX.\n\nAdjusted operating expenses increased due to acquisitions and delevered by 60 basis points due to the sales decline. Third quarter adjusted EBITDA margin was 21.1%, a 60-basis-point decrease from the prior year period due to expense deleveraging and lower sales. Non-GAAP earnings per diluted share was $4.12, a 9.5% year-over-year decrease. Turning now to the balance sheet and cash flow highlights on Slide 7.\n\nFor the first nine months of 2022, we generated $170 million of free cash flow, which was significantly lower than last year, primarily due to a higher use of working capital due to elevated inventory and sales volume shifting to later in the quarter. Higher incentive compensation payments, given our exceptional 2021 performance, and $90 million of previously announced settlement payments. We made $50 million of share repurchases and invested $6 million in venture investments in the third quarter. We ended the quarter at a comfortable 1.7 times net debt to adjusted EBITDA leverage ratio and with more than $1.2 billion of capacity on our revolving credit facility.\n\nOn Slide 8, we highlight the premiums supply chain costs have improved from peak levels. The actions we have taken to redesign products, targeted price increases as well as the improving freight capacity, have enabled us to reduce purchases on the spot market and reduce the freight cost impact. We are on plan to move printer shipments to ocean from air late this year and into early 2023. For the full year 2022, we now expect approximately $190 million of premium supply chain costs over pre-pandemic 2019 levels, a $10 million reduction from our prior outlook.\n\nIn Q3, we incurred premium supply chain costs of $30 million as compared to the pre-pandemic baseline, which is favorable to what we had anticipated in our prior outlook. In total, Q3 transitory items had a combined favorable gross margin impact of $14 million year over year, and in Q4, are expected to be approximately $35 million, which is a nearly $30 million reduction year on year. Let's now turn to our outlook. Q4 sales are expected to be approximately flat from the prior year period with a range of negative 2% to one -- to positive 1% growth.\n\nAs compared to our prior outlook. The lower sales growth is driven by softening demand, continued supply chain challenges and currency headwinds. We are confident in this guide, given our relatively strong order backlog, improved quarter-to-date shipment activity, and actions taken to stabilize North American distribution. We estimate a two point additive impact from recently acquired businesses and a four point negative impact from foreign currency changes.\n\nAs a reminder, approximately 25% of our global sales are denominated in euros. We anticipate Q4 adjusted EBITDA margin to be between 22% and 23%, which is an increase from both the prior year and the prior quarter. Given our tempered view of the demand environment, we are taking a conservative approach to managing operating expenses while preserving strategic growth investments. Non-GAAP diluted EPS is expected to be in the range of $4.50 to $4.80.\n\nWe now expect our free cash flow to be at least $400 million for the year, which we have significantly reduced from our prior outlook due to lower profits and elevated inventory levels that we will be working down into 2023 as we rationalize safety stock and execute on our North American distribution transition. Sales seasonality has improved to more normalized levels in Q4, which should drive the peak cash flow quarter for 2022. Please reference additional modeling assumptions shown on Slide 9. With that, I will turn the call back to Anders to discuss how we are advancing our Enterprise Asset Intelligence vision with our customers.\n\nAnders Gustafsson -- Chief Executive Officer\n\nThank you, Nathan. The long-term fundamental drivers of our business remain strong. Slide 11 illustrates how we digitize and automate the front line of business by leveraging our industry leading portfolio products, software, and services. By transforming workflows with our proven solutions, Zebra's customers can effectively address their complex operational challenges, which have been magnified through the pandemic.\n\nThis value proposition resonates with customers in any macroeconomic environment as it improves productivity and inventory accuracy among an extensive list of other operational benefits. As we have expanded our portfolio with compelling solutions, we have elevated our strategic position with our customers. Our trusted relationships with our partners across the globe augment our capabilities, enabling us to serve more customers worldwide. Our new fixed industrial scanning and machine vision solutions resonated well with customers and partners at recent trade shows in Stuttgart, Germany, and Boston, Massachusetts.\n\nOur booths featured advanced optical character recognition, supported by deep learning capabilities gained through our 2021 Adaptive Vision acquisition. Our comprehensive offering has put us in a strong competitive position. Now turning to Slide 12. Businesses partner with Zebra to optimize their end-to-end workflows as they strive to meet the increasing demands of consumers.\n\nZebra Solutions continue to represent a necessary investment, and I would like to highlight several recent key wins across our end markets. A large North American retailer recently selected Zebra's TC52 mobile computers for their stable network connection, durability, and camera performance. This customer maximizes value from Zebra Solutions by combining our mobile computers with our Reflexis workforce and task management, Zebra prescriptive analytics, and Antuit software. This combination enables the retailer to improve inventory accuracy and the omnichannel shopping experience for their customers.\n\nA North American based fast food chain has chosen Zebra's handheld RFID solution to enhance inventory management. This solution will enable each restaurant to reap the benefits of a more digitized supply chain by streamlining their process to track and trace inventory from its suppliers to the restaurant. Adoption of this technology will assist the customer to comply with the Food Safety Modernization Act. A transportation company in Europe, has begun rolling out approximately 20,000 mobile tablets to streamline their vehicle rental process.\n\nZebra's exceptional service and integrated product offerings displace the competitor and will enable associates to complete vehicle walkarounds inspections and the reservation process more efficiently. A convenience store chain in Latin America is expanding their use of Zebra Solutions from the distribution center to the front of store with more than 50,000 Zebra mobile computers, printers, and tablets. Deployment of these Zebra solutions is expected to significantly increase productivity, inventory accuracy, and improve shopper satisfaction. Zebra's Mobility DNA software, which enables intuitive device management and our compelling customer value proposition were key differentiators in this competitive win.\n\nApparel manufacturer, BMC, recently selected Zebra's autonomous mobile robots and fixed industrial scanners for their new 50,000 square foot North American facility. Zebra collaborated with a major partner to develop a solution that will enable a flexible workflow and enhance visibility along each step of the production line. By combining our autonomous mobile robots and fixed industrial scanners, BMC will realize powerful synergies with scanners tracking each step of production and directing the robots along the workflow. The robots streamline associate's movements, enabling faster fulfillment.\n\nThis flexible and scalable solution was preferred to a traditional fixed conveyance system because it saves vital warehouse space and adjusts to demand. Additionally, we recently secured a large win with a major European retailer, who selected Zebra's fixed industrial scanners to significantly reduce scan time, increasing throughput at several thousand packing stations, resulting in a faster than one year payback on investment. Zebra's collaboration with the customer and a valued partner was integral to this competitive win. As we turn to Slide 13, I want to reiterate the actions we have taken to address our challenges with North American distribution, elevated inventory levels, and increased macroeconomic headwinds.\n\nWe have executed key organizational changes and have initiated specific actions with our supply chain partners to stabilize operations and reallocate resources to address immediate challenges. We are also taking decisive steps to rationalize inventory while maintaining optimal levels of strategic components. Additionally, we are taking prudent cost actions as we realize softening demand and implementing additional pricing actions to address FX and inflation. In closing, we continue to be very optimistic about the prospects and opportunities for our business.\n\nWe have the broadest portfolio of tailored solutions to enable our customers to improve their operations in any environment. The global labor deficit and on-demand economy have escalated the need for enterprises to digitize and automate their operations with our solutions. Now I will hand the call back over to Mike.\n\nMike Steele -- Vice President, Investor Relations\n\nThanks, Anders. Well, now open the call to Q&A. [Operator instructions]\n\nOperator\n\n[Operator instructions] Our first question will come from Tommy Moll with Stephens. You may now go ahead.\n\nTommy Moll -- Stephens, Inc. -- Analyst\n\nGood morning and thanks for taking my questions.\n\nAnders Gustafsson -- Chief Executive Officer\n\nMorning, Tommy.\n\nTommy Moll -- Stephens, Inc. -- Analyst\n\nAnders, I wanted to start on the comments you made regarding some deferred projects from large North American customers. Any context you can share there on end-market type of project visibility to picking back up on some of this work going forward would be much appreciated. And as a related point, would you say that these projects are all the majority of or a smaller part of the demand softening that you called out late Q3? I'm sure it's part of what you described there with the softening, but order of magnitude would be helpful. Thank you.\n\nAnders Gustafsson -- Chief Executive Officer\n\nYeah. First, I'd say the -- we're getting some mixed signals from the market on on-demand pictures and that's, to some degree, clouded by the supply chain challenges we're seeing. But most signals -- most demand signals we are seeing are constructive. Our backlog is healthy.\n\nOur pipeline is building nicely. The -- our run rate business is strong and we continue to see some nice areas of strength in each region. And our retail vertical grew even though we had a very large customer pulling back into this year and particularly the quarter. But we have also seen some elongated sales cycles and a bit of softening in demand where some customers have pushed out some orders from Q3 into 2023.\n\nSo the -- I think most -- I'll ask Joe for some extra color here also, as most of those push outs have come from the retail segment. That's also our largest segment, so it wouldn't be surprising and they tend to have more of the year end spend that they're working on. So the overall environment is still quite healthy, but we have seen some selective push-outs. Joe?\n\nJoe Heel -- Chief Revenue Officer\n\nYeah. To put it in perspective, perhaps in terms of the miss to the outlook, the deferral of project was a minor contributor to that. Among these, the deferral of projects, these late in the quarter deferments were a relatively small number of larger projects that, as Anders said, deferred primarily into 2023. That's probably as much as we can say.\n\nTommy Moll -- Stephens, Inc. -- Analyst\n\nThat's helpful. Thank you. As a follow up, I wanted to pivot to supply chain. And you gave us quite a bit there on the North American Distribution Center transition.\n\nCan you give us anymore? Just on the ground context in terms of the transition that's underway, some of the changes that you've made as a consequence of some of the challenges that you called out. And then I think, Anders, I heard you reference that there have been some personnel changes on this front. Anything you could highlight there would also be helpful. Thank you.\n\nNathan Winters -- Chief Financial Officer\n\nTommy, this is Nathan. I'll start with the first part. Just giving you a little bit of background, we selected a new D.C. location midway through last year.\n\nAnd as we said through the call, we had some issues with the transition impacting shipment volumes late in the quarter. And we've implemented corrective actions in particular on ramping back our Texas facility that give us some additional time to work through the transition both from a people and process perspective. So again, I'd say although we didn't deliver the shipment volumes necessary to meet the Q3 forecasts, we are now operating at levels required to deliver Q4, still not where we want to be. But again, the Texas facility is nearly staff to full capacity and we've had a really nice recovery here in deliveries in October.\n\nJust as context, we've shipped out nearly $200 million more in October than we did in the month of July, which is giving us both confidence in the performance of the D.C., as well as confidence in the Q4 guidance. Pass over to Anders.\n\nAnders Gustafsson -- Chief Executive Officer\n\nYeah, from an organization perspective, we have made some changes. We have promoted a new supply chain leader, who leads our global operations and supply chain team. So -- and we have also streamlined organization a bit and moved some functions or responsibilities out of our supply chain to other areas to make sure we can get greater focus and better accountability around those. We've also worked closely with our supply chain partners to make sure we take some actions with them to help improve the operations.\n\nOne that Nathan talked about was ramping up our Dallas Fort Worth facilities. So they're back at the close to full capacity. They're almost fully staffed and operating very well at the moment. And we're working with our Chicago area, D.C.\n\npartner also to see how we can best help them scale their operations there.\n\nOperator\n\nOur next question will come from Andrew Buscaglia with Berenberg. You may now go ahead.\n\nAndrew Buscaglia -- Berenberg Capital Markets -- Analyst\n\nHey, good morning, guys.\n\nAnders Gustafsson -- Chief Executive Officer\n\nMorning.\n\nAndrew Buscaglia -- Berenberg Capital Markets -- Analyst\n\nSo just trying to get a sense of how much of this sales change that that you've seen is related to, like, I guess, the nature of the deferrals and the confidence that you're going to get these orders in 2023. And I guess, I'm going to phrase it another way, how much of this is kind of the beginning of a more to come? Or based on the visibility you have with these customers, do you have confidence this is like a short-term issue?\n\nAnders Gustafsson -- Chief Executive Officer\n\nYeah, it's -- I don't think we want to get into too much of 2023 outlook yet. But I think these have been more select customers. There's not a broad-based, say, pushout or deferrals. It's much more select on certain customers.\n\nAnd some tougher -- predicting Q3, we also have some very difficult comp from two large customers that were particularly strong in the third quarter. But as I said, most of our demand signals are still the very strong and encouraging and we see -- and it's been -- this was really very narrowly focused in North America.\n\nJoe Heel -- Chief Revenue Officer\n\nI'll add two things, perhaps for perspective. One is an example of what we're seeing is a large customer who will take an order that they would have perhaps placed in Q3 or early in Q4 and now telling us we're going to split that order and we're going to take 80% of it now and 20% of it later in 2023. That's an example of the type of thing we're getting. So it feels like there's real demand behind the order.\n\nThe other thing that we're hearing from customers quite consistently is while some customers in particular retailers, are being cautious about their business, about their revenue expectations, and those are obviously visible to you in what they say on their earnings calls. They are telling us that their investments in I.T. and in the types of solutions that we provide them are important to them even in more uncertain times because they need to improve their productivity and we help them do that with our solutions. So that's certainly something I hear pretty consistently.\n\nAndrew Buscaglia -- Berenberg Capital Markets -- Analyst\n\nOK. That's helpful. And you talked about last quarter and I guess this quarter, again, being able to ship by -- mostly by ocean exiting Q4. I guess where do you stand with that? And then and then it's tailwind wise into '23, I know you don't want to give guidance for next year, but like what how do you expect the cost environment to shape up for next year? And hopefully, maybe do you think that offset some of this volatility around the sales you'll see over the next six months or so?\n\nNathan Winters -- Chief Financial Officer\n\nYes. So, Andrew, maybe just context for the broader premium supply chain costs, I think what we saw in Q3 was a positive momentum, a 50% reduction from what we experienced in Q2, decreasing from nearly 4% of revenue to just over 2%. That was primarily driven by the declining shipping cost per kilo, which we're experiencing, as well as benefiting from the pricing actions beginning to take effect with the price increase we did in July. Q3 shipping cost did come in below estimate.\n\nWe also benefited, if you look at the mix, in the $30 million for the quarter from lower North American revenue. And that's the reason for it ticking back up in the fourth quarter in terms of overall transitory. And our Q4 guide assumes no improvement in freight rates. So that's something we're continuing to monitor.\n\nBut if you look at the overall reduction from 200 million to 190 million in premium supply chain costs. Some of that is volume driven just over half, but also 4 million of that or so was due to the lower rates we're experiencing. And I think our expectation is that we will see steady reduction into 2023 around these costs as long as the freight rates hold where they're at today. And we're going to continue the transition from air to ocean really late here in the fourth quarter.\n\nWe did some ocean shipments into Europe in the third quarter, but we really don't expect ocean shipments to pick up until late here in the fourth quarter and into 2023. And we've also seen a nice reduction in what we've had to buy in critical components on the spot market. So we're starting to see that loosen up as well. So again, we feel confident that we'll see a steady decrease and EBITDA benefit as we go into next year.\n\nOperator\n\nOur next question will come from Jim Ricchiuti with Needham and Company. You may now go ahead.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nHi. Thank you. First question just again, on the on the deferral that you're seeing among a few of these North American customers. When you talk about it, some of this business slipping into 2023, is there a presumption that this would be slipping further into '23 into the second half, just given the seasonal investments that these types of customers may make?\n\nAnders Gustafsson -- Chief Executive Officer\n\nI think it's -- probably don't want to give too much color on that also at this stage, but the expectation is they won't -- they're slipping from this year into the beginning of next year, not the end of next year.\n\nNathan Winters -- Chief Financial Officer\n\nI would I would agree with that, yeah.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nOK. That's helpful. And, Anders, I wonder if you could talk to what you're seeing in the SMB market. It sounds like you're seeing relatively good demand there.\n\nI don't want to put words in your mouth, but if you could comment on that. And also in an economic cycle, which part of the business would you see impacted more immediately, the larger customer business or the SMB business?\n\nAnders Gustafsson -- Chief Executive Officer\n\nYep. Starting with SMB business, we did see strong growth globally for our small and medium-sized customers. I think that's a good indication of kind of the confidence the broader market has in the outlook and the value that our solutions offer. The secular trends that we talked about to digitize and automate workflows and to empower the frontline workers are, I would say, much more important today in a labor-constrained environment as that drives a greater increase for our type of solutions across all verticals and all sizes of customers.\n\nAnd I think the -- our run rate business performed particularly well globally this quarter, which I think is -- gives us confidence around the health of the business. If you talk about kind of which verticals would be more or less impacted, I'd say we probably get the -- gotten the most questions around a retail customer base historically in this. And here, I mentioned earlier, our retail and e-commerce business grew in Q3 despite very challenging comps from a very large, particularly large retailer that has been pulling back. And I think that highlights the value of having a very diversified retail e-commerce customer base where the timing of the refresh cycles is spread out and that helps to reduce volatility risks.\n\nBut I think the -- in retail specifically, the focus on -- or the importance of our type of solutions to enable our customers to execute on their omnichannel and e-commerce strategies is very important. I've talked about how we believe that our solutions are now more like, say, an ERP implementation. It's harder to dial them up and down. And I think the results from Q3 indicate -- give some credence to that expectation.\n\nI'd say our healthcare business, which performed very well in Q2 -- in Q3, sorry, was up double digits. That is probably the vertical we expect to be the least sensitive to kind of recessionary forces. And here, we're also very, very focused on helping to transform that industry to be able to improve the patient journey and drive greater productivity for healthcare providers. The P&L vertical is -- that was one the hardest hit.\n\nIt was the only vertical that was down for us in Q3. But e-commerce volumes are expected to continue to to increase and that drives a greater need for real time visibility into their overall supply chain. And it's a key driver for customer investments. And we enabled the last mile fulfillment for those customers, which is an important factor as consumers are expecting faster and faster deliveries.\n\nAnd lastly, around manufacturing. That also tends to be -- it's a market that is more, say, largest in Asia for us, but it is global and it's done very well for us over the last year or so and had good double-digit growth this quarter. Here we've we've made some in both the some of the new acquisitions around from Matrox and Fetch are expanding our offering and we're getting a lot of interest and early orders from manufacturing those areas and we have also made some quite significant and very deliberate investments in our go-to-market resources to help to grow our share in manufacturing. And Joe can provide some more color on that.\n\nJoe Heel -- Chief Revenue Officer\n\nYeah, maybe I'll just amplify some of Anders' points. Number one, the growth in the medium-sized customers and also the run rate has been particularly encouraging for us because that's where our supply constraints are particularly important. Right? If you have supply, you get run rate. When we had supply return, our run rate rebounded.\n\nAnd that was a really good sign of the resilience of our run rate. That's very encouraging for us. You asked about which size of customer goes into the cycle first. And what we saw is that as we entered into the pandemic, the largest customers were the first to accelerate their purchases and they were followed nine, 12 months later by medium-sized and smaller customers then also accelerating their purchases.\n\nNow, as we're seeing some caution in the market, it's again, the largest customers that are being cautious first. Some of the deferrals that we've referred to and that you asked about were larger customers with large orders, while the medium-sized and small customers continue to go very strong with even double-digit growth. So that's the dynamic that we're seeing in the cycle. Hopefully that's helpful.\n\nOperator\n\nOur next question will come from Erik Lapinski with Morgan Stanley. Please go ahead.\n\nErik Lapinski -- Morgan Stanley -- Analyst\n\nHey, team. Thanks. If I could go back to kind of the commentary on the run business you just made, I guess just trying to get a better sense on the strength there. Do you think that's an element of customers being further behind on investments versus larger customers then? And then maybe also on that point, like when we think about deferrals from the larger customers, is that related to a refresh or a new device deployment? Any kind of color you can give us that would be helpful.\n\nAnders Gustafsson -- Chief Executive Officer\n\nYeah, first on the strength of the run rate business here. I think that the -- I would say we don't see our customers large or small having, say, pulled forward demand and invested ahead of their capacity utilization curve with probably one exception, one large exception. So and specifically for our large -- for our small and mid-sized customers, they tend not to have the kind of financial capacity to invest for in an advance. So that tend to be much more as their project roll outs to address more urgent business needs for them.\n\nSo that will be one point of that. And I think -- Joe?\n\nJoe Heel -- Chief Revenue Officer\n\nYeah. When it comes to the run rate, it really matters what's on the shelf. Right? You have small customers that are calling in to distributor and what's on the shelf count. And once we had product on the shelf, again, as our supply chain ramped up again over the course of the quarter, we saw that run rate rebounding.\n\nSo I think that's the dynamic that there's no pull forward or that dynamic doesn't exist to that same extent in the run rate. When it comes to the larger customers, to the deferrals, we are talking about large customers that are typically doing deployments of mobile computers. You see it's pretty concentrated in the mobile computing segment. You have certain deployments that they have been planning and in some cases, but again, they were very few and they were a minor reason for the miss in the quarter.\n\nBut in those few cases, we're talking about deployments of mobile computers, which are stretched out over a slightly longer time period, we think, into the first quarter of next year.\n\nErik Lapinski -- Morgan Stanley -- Analyst\n\nGot it. OK. That's really helpful. Thank you.\n\nAnd then maybe just another one on kind of some of your opex flexibility. You did take down kind of expenses in the quarter and proved to be pretty nimble there. I guess just like where did you find those efficiencies in context of maybe some of the supply chain changes you're making? And how should we think about your ability to control opex in future quarters kind of sensitive to revenue?\n\nNathan Winters -- Chief Financial Officer\n\nYes, there's a couple of drivers behind the opex flexibility. I mean, the first is based on our variable cost structure. There's an element of variability in there relative to how we're performing for the year. The other one is we did a hard look at where we're hiring and what roles and what positions around the world to ensure that where we're adding heads and investing is in our growth areas that that we would kind of look at and say there's no regrets in that in terms of those hiring.\n\nSo it's a combination of those two along with again, continuing looking at discretionary spending where it makes sense. I think those are the three main drivers here in the short term. And as we go into next year we're continuing to look at where we can drive efficiencies, looking at our real estate portfolio. But all the things you would expect us to do, particularly as we go into a more challenging macro environment.\n\nOperator\n\nOur next question will come from Damian Karas with UBS. You may now go ahead.\n\nDamian Karas -- UBS -- Analyst\n\nGood morning, everyone.\n\nAnders Gustafsson -- Chief Executive Officer\n\nMorning.\n\nNathan Winters -- Chief Financial Officer\n\nGood morning.\n\nDamian Karas -- UBS -- Analyst\n\nMorning. Morning. Not to beat a dead horse here on the project deferrals, but could you just clarify, one, you haven't seen any order cancellations? And two, just thinking about these customers that have pushed out orders, it sounds like you do have visibility in terms of timing of delivery in 2023. And it's not that the conversations have been, hey, let's just put this on pause until later determined date.\n\nAnders Gustafsson -- Chief Executive Officer\n\nYeah. So first on the cancellation, we have not seen any large order cancellations. I think the cancellations have been very modest. And to the extent we've had any, and -- within what we would consider to be normal.\n\nEvery quarter we have some people who cancel an order or something like that, but it's been a factor in the results or in the outlook here. And the deferrals have -- they have -- they're not paused, they're just deferred. So they're we expecting them to come back in the first part of next year. And the -- it's not like -- they are deploying in the meantime, not just at the same pace as they had otherwise expected.\n\nJoe Heel -- Chief Revenue Officer\n\nYeah, but there are some indications, Damian, that give us confidence that the deployment will occur. One of them is that they're taking an order and splitting it into two, right, as I described to you. The other is that they're already working with us on deployment plans. We do see those stop signs, not in every case, but in the majority of cases.\n\nSo that's why we're describing it as we are.\n\nDamian Karas -- UBS -- Analyst\n\nOK. Got it. That's really helpful. And then, Nathan, I think you suggested earlier that the ocean freight transition is happening late this year.\n\nCorrect me if I'm wrong, I thought that was supposed to kind of play out in the third quarter. So is there any sort of delay there or am I missing something?\n\nNathan Winters -- Chief Financial Officer\n\nSo that's -- this was per our plan. We expected in Q3 to start the modest shipments into Europe, which we did from an ocean perspective. But the plan in the guide around our premium costs had always assumed we wouldn't really feel any financial benefit to the move until we get into next year, as the priority for this year was to ensure we've delivered enough printer volume to take care of our backlog as well as ensure we had the right products on the shelf to support our run rate business.\n\nOperator\n\nOur next question will come from Brian Drab with William Blair. You may now go ahead.\n\nBrian Drab -- William Blair and Company -- Analyst\n\nMorning. I think most of the details come out here already. But I'm just wondering if you could give us a more specific update maybe on how Matrox and Fetch have been performing relative to your expectations? And again, in this difficult environment, I know Matrox came in about a hundred million revenue run rate and Fetch about 10 million. I don't know if you could update those numbers, directionally even.\n\nThanks.\n\nAnders Gustafsson -- Chief Executive Officer\n\nWe closed Matrox in early June and certainly very pleased with how it -- how that's going. It creates a very comprehensive portfolio, both fixed industrial scanning and machine vision solutions for us as it kind of fills out our offering very nicely. I'd say we're very encouraged by progress. Matrox is performing very well and the integration is proceeding as per our plans.\n\nI think there's a very good culture fit between our organizations. We are also building out our partners. And that's going well. These are very specialized partners who provide these types of implementation and design services.\n\nAnd we've been seeing good traction and being able to recruit those partners to our program. So we're certainly very excited about what's going on with Matrox. And similarly on Fetch, I'd say there's a lot of interest from warehouse operators across all our other vertical markets as well as in manufacturing for our Fetch robotic solutions. And our ability to really combine the frontline worker -- or the automation or the frontline worker and the Fetch robots to automate -- orchestrate and automate the broader workflows has been resonating very well.\n\nAnd we're seeing -- yes, we're seeing a lot of a lot of interest. And it's obviously a smaller business, but it's ramping quite nicely.\n\nJoe Heel -- Chief Revenue Officer\n\nAnd maybe a little bit of additional color, with the business being in sort of the early stages of development, what you look for primarily are pilot deployments, right, and we're seeing a very good stream of these pilot deployments. We were also very pleased to have two larger deployments already that we mentioned, I think, in the earlier and the previous earnings call already that are anchor tenants, I guess now for our Fetch robotics business going forward.\n\nBrian Drab -- William Blair and Company -- Analyst\n\nGreat. And then I guess just as a follow up, when you think about Matrox and some of the incumbents in that space, what have you found has been successful for you in going up against some of these incumbents and bidding on projects? What differentiates Matrox from a company like Cognex and others in the industry?\n\nAnders Gustafsson -- Chief Executive Officer\n\nYeah. First, I'd say that we don't see this as a zero sum game. There's a lot of white space for us to go after without having to go up and seek out opportunities where we compete with any specific competitor. There's also a very fragmented market.\n\nI think that the market leader has probably about 20% or no more than 20% market share. So there's plenty, plenty of opportunities to pursue without having to do that. That being said, I think we feel good about the value propositions that we have with Matrox. It is known for having a very high quality, high performance solutions that can solve some very complicated problems for our customers.\n\nWe have worked hard on -- across our fixed industrial scanning machine vision portfolio to drive ease of use as a differentiator to make it as easy for our customers to deploy and get time to revenue for these solutions. And that's been, I think, resonating very well. Also, the software upgradeability of our products is a differentiator and we've had some very nice wins against a variety of different competitors with some large marquee customers. So we feel quite excited about it.\n\nJoe Heel -- Chief Revenue Officer\n\nOne other strength, Brian, to add perhaps is this is a business that's conducted predominantly through the channel and we have used our strength in the channel to recruit a strong number of channel partners, many of which are somewhat disillusioned with other incumbents in the market. And that's been a great attraction for people to come to us because they know us as a very good channel partner for them. So that's helped us also.\n\nOperator\n\nOur next question will come from Keith Housum with Northcoast Research. You may now go ahead.\n\nKeith Housum -- Northcoast Research -- Analyst\n\nThanks. Good morning, guys. How can I understand a little bit more the North American warehouse issue? It looks at the side that North America was down 9%. Would you say a vast majority of that decline was due to that North American warehouse issue or what would have the number been without that issue?\n\nAnders Gustafsson -- Chief Executive Officer\n\nThe -- miss to outlook was predominantly explained by the supply chain challenges related to the persistent component shortages for certain products and the disruption in the transition to our new North America warehouse. And there's probably about 45% -- 45 million on each of those. And the smallest part was the deferral of projects was about 10% of the miss to our outlook. So clearly, the supply, the D.C.-ish move was the largest part of this.\n\nKeith Housum -- Northcoast Research -- Analyst\n\nI appreciate that. It sounds like you're going to be forced to operate both the Texas facility and the Wisconsin facility, I guess, in parallel for the next several quarters. What's the -- what will the impact on profitability this quarter and what do you think it's going to be going forward?\n\nNathan Winters -- Chief Financial Officer\n\nKeith, I would say it's relatively modest in terms of the cost structure we have with both of those facilities in terms of the typical typically pay on a cost per unit with each of the facilities. So it's -- I think it's relatively modest in the -- from an overall profitability of managing both. We had a little bit of extra costs here in the third quarter. We had to ship some products between the facilities to get the inventory right size moving forward.\n\nBut now that that's corrected, it's a relatively modest impact on overall profitability to manage both sites.\n\nOperator\n\nOur next question will come from Rob Mason with Baird. You may not. Go ahead.\n\nRob Mason -- Robert W. Baird and Company -- Analyst\n\nYes, good morning. Maybe just to follow up on the last question. When will this North American distribution center transition be complete and I guess consolidated into one facility?\n\nNathan Winters -- Chief Financial Officer\n\nSo we don't -- we do not have a timeframe lined up of when we'll completely exit. We've signed an agreement to stay down in Texas for the foreseeable future to ensure that we properly ramp the new facility in the right way and make sure it's -- we fully mitigate any potential risk to the future operations. And so once that's once that's clear and we're in shape, that's when we'll start to work on whether that -- how to complete the transition, but there's no timeline set to date.\n\nRob Mason -- Robert W. Baird and Company -- Analyst\n\nSure. Sure. There was also a mention that you will be taking some pricing actions in Europe outside the U.S. to address currency.\n\nWhen will those price actions be realized, will start to show up? And then I'm just curious as well, what was the actual FX impact on your gross margin in the quarter?\n\nNathan Winters -- Chief Financial Officer\n\nYeah. So if you look at the two latest price increases we announced, they really have no impact until we get into two next year, just based on the timing of the agreements we have with our distributors. And I would say it's relatively modest compared to the previously announced price increases that's focused around Latin America business as well as in Europe, where we've already made several other pricing actions. So it's modest compared to the three we've done up to this point.\n\nIf you look at it from an FX perspective, in the third quarter, it was about a one point negative impact on EBITDA margin. And as we go into the fourth quarter, FX has about a two point negative impact year on year on EBITDA margin.\n\nOperator\n\nOur next question will come from Paul Cheng with J.P. Morgan. You may now go ahead.\n\nPaul Cheng -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks for taking my question. So you mentioned kind of a steady reduction in 2023 on supply chain costs here and nice execution here in the second half. But can that cost move down materially in '23 on a quarterly run rate from that 30 million to 35 million, especially as you move more products to see -- I assume there'll be some lingering costs moving forward.\n\nBut just any comments there would be helpful.\n\nNathan Winters -- Chief Financial Officer\n\nYes, I'd say as we look at it going into next year, obviously, we think there's -- just based on the second half run rate, there will be a meaningful improvement from a year-on-year perspective. And I would say at this point, steady is probably the right word in terms of how we're looking at it. And a lot of this has to do with how freight rates hold up. So I think based on what we've seen, they've held steady just slightly down since kind of middle of the second quarter, which is which is really positive.\n\nBut at any moment they could swing another way if there's any other type of supply chain shocks in the system. But yeah, we would expect, again, steady improvement from the second half run rate as we go into next year.\n\nPaul Cheng -- JPMorgan Chase and Company -- Analyst\n\nGreat. That's helpful. And then on inventories, I know there's a lot of moving pieces, but can you give us a sense for kind of timing of more accelerated harvesting? I mean, do you see any risk to kind of discounting or given the elevated levels here, or is this more about converting on some of the larger deferred products? And then as we look to '23, when can we expect to see kind of more normalized free cash flow conversion or is this more of a second half '23 kind of excluding that Honeywell payment? Thank you.\n\nNathan Winters -- Chief Financial Officer\n\nYeah, so -- maybe just -- I'll start with the second part of that. As we look at our inventory, we'd expect us to draw down through the first half and get to the normalized levels as we enter the second half of next year, which we think is somewhere between 600 million and 650 million of inventory. That's based on the size of the company today, plus the acquisitions as well as intentionally holding more strategic component inventory than we have in the past to improve resiliency. We have a team dedicated and working on this, a big driver of that is finishing, getting the D.C.\n\nmove stabilized, and we've also made several moves within our supplies business in terms of a manufacturing, where we've had to build some buffer stock and working through that. And for the product categories or components that that have recovered, we are planning to draw down our safety stock at our manufacturing partners over the next several quarters, and that's really the big driver of where we'll see the reduction in working capital. But as you as you mentioned, we expect all these actions to enable us to significantly reduce working capital and deliver free cash flow conversion above 100% if you exclude the settlement payments. And then to your first question we have no concerns at the inventory levels creating the type of risk from an excess obsolescence perspective.\n\nWe have strong demand for what we have in both finished goods as well as component parts. And then there's no intention of reducing pricing beyond what's normally required in the competitive environment. I'd say alternatively, we're pushing that we have stock available for customers who may have been waiting on certainty of supply before placing an order. So using it as an opportunity.\n\nOperator\n\nThis concludes our question-and-answer session. I'd like to turn the call back over to Mr. Gustafsson for any closing remarks.\n\nAnders Gustafsson -- Chief Executive Officer\n\nThank you. So to wrap up, I would like to thank our partners, customers, and employees for their continued support. Our top priority is to meet our customer's mission critical needs as we take bold actions to address our supply chain challenges, and we look forward to a strong finish to the year. Thank you, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMike Steele -- Vice President, Investor Relations\n\nAnders Gustafsson -- Chief Executive Officer\n\nNathan Winters -- Chief Financial Officer\n\nTommy Moll -- Stephens, Inc. -- Analyst\n\nJoe Heel -- Chief Revenue Officer\n\nAndrew Buscaglia -- Berenberg Capital Markets -- Analyst\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nErik Lapinski -- Morgan Stanley -- Analyst\n\nDamian Karas -- UBS -- Analyst\n\nBrian Drab -- William Blair and Company -- Analyst\n\nKeith Housum -- Northcoast Research -- Analyst\n\nRob Mason -- Robert W. Baird and Company -- Analyst\n\nPaul Cheng -- JPMorgan Chase and Company -- Analyst\n\nMore ZBRA analysis\n\nAll earnings call transcripts"
}