{
  "companyName": "ZimVie Inc.",
  "companyTicker": "ZIMV",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/zimvie-inc-zimv-q2-2022-earnings-call-transcript/",
  "content": "ZimVie Inc. (ZIMV 1.19%)\nQ2 2022 Earnings Call\nAug 10, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the ZimVie's second quarter 2022 earnings call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Marissa Bych, investor relations.\n\nPlease go ahead.\n\nMarissa Bych -- Investor Relations\n\nHi, and thank you, all, for joining today's call. Earlier today, ZimVie released financial results for the quarter ended June 30, 2022. A copy of the press release is available on the company's website, ZimVie.com, as well as sec.gov. Before we begin, I'd like to remind you that management will make comments during this call that include forward-looking statements.\n\nActual results may differ materially from those indicated by the forward-looking statements due to a variety of risks and uncertainties. Please refer to the company's 2021 Form 10-K and subsequent SEC filings for a detailed discussion of these risks and uncertainties. Additionally, the discussion on this call will include certain non-GAAP financial measures. Reconciliations of these measures to the most directly comparable GAAP financial measures are included within the earnings release and/or the investor deck issued today found on the investor relations section of the company's website, ZimVie.com.\n\nThis conference call contains time-sensitive information and is accurate only as of the live broadcast today, August 10, 2022. ZimVie disclaims any intention or obligation, except as required by law, to update or revise any financial projections or forward-looking statements, whether because of new information, future events or otherwise. And with that, I will turn the call over to Vafa Jamali, president and chief executive officer of ZimVie.\n\nVafa Jamali -- President and Chief Executive Officer\n\nGood afternoon, and thank you, all, for joining us. I'm on the call today with Rich Heppenstall, our chief financial officer. I'd like to kick off our call by reacquainting investors with who we are at ZimVie, including our dental and spine businesses, and then reviewing our financial performance for the quarter ended June 30, 2022, our first full quarter as a newly independent company. ZimVie is a global medical technology leader dedicated to restoring life for dental and spine patients, and we participate in a $20 billion global market opportunity across those markets.\n\nWe are the number five largest player in the worldwide dental market and number six in spine. We have over 20 brands trusted by clinicians and surgeons worldwide. We operate in 70-plus countries, and we have approximately 2,700 team members. Our vision is that everyone deserves to feel better, healthier and stronger.\n\nOur mission is to advance clinical technology foundation to restoring daily life. As I mentioned earlier, we have the fortune of being a leading player in two substantial and growing markets. Our product platforms address a broad set of critical patient needs across those markets and are substantially differentiated from competitive solutions in several cases. Our dental business is very well-positioned in the growing global dental implant and biomaterials market.\n\nWithin this segment, we continue to operate in three key categories: dental implant solutions, which is our largest contributor; biomaterials, which support the implant, including its durability and sustainability; and digital dentistry. Digital dentistry, as an emerging technology, provides significant workflow support to the clinician across their office and derivatively both improves the quality of the implant while reducing the time that a patient spends in the chair. As we scale our digital dentistry solutions, we are also driving strong adoption and pull-through of our implant business. In the second quarter, I'm especially pleased to highlight our launch of the T3 PRO Tapered Implant and the Encode Emergence Healing Abutment designed to optimize restorative care and aesthetics.\n\nBoth the T3 PRO and Encode Emergence reflect significant innovation to ZimVie's previous products and promised an optimized implant experience for both dentists and patients. Both products have recognized strong early traction with T3 PRO receiving positive feedback on primary stability and favorable reception to Encode Emergence centered on seating at the tissue level, enhanced ease of use and eliminating the need for bone profiling. Based on recent market data, we see T3 PRO capturing modest early share in the premium implant segment. Our spine business comprises the broad portfolio of spine implants, instruments and biologics, as well as bone-healing solutions.\n\nIn addition to our largest spine segment of core and complex solutions, we also have exposure to two exciting emerging categories: motion preservation devices and minimally invasive surgery. Motion preservation is an area we are actively leading and remain very excited about, including Mobi-C, the market-leading cervical disc replacement; and The Tether, a novel treatment for pediatric scoliosis.  Minimally invasive surgery, which typically benefits from the addition of enabling technology, is an area in which we intend to further expand. Regarding our motion preservation solutions, I'm excited to highlight our recent receipt of a positive policy decision from Anthem for The Tether device, which expands potential treatment eligibility to patients indicated for anterior vertebra body tethering, or ABBT, within the 30 million-plus members covered under Anthem Blue Cross Blue Shield. We have seen firsthand the positive impact that The Tether's had on the lives of children and their families, and we're optimistic that this decision will pave the way for additional favorable policy changes to continue expanding therapy access.\n\nTurning to our performance as we exit the first full quarter as an independent company, I would like to reiterate that it remains very early days at ZimVie. Nonetheless, I'm pleased to announce we recognized $233.4 million in total net sales for the second quarter, declining roughly 8% year over year on a constant-currency basis, but offering the baseline against we are confident we can grow over time. Our results in the quarter were impacted, to some extent, by shortage in the facility staffing and the elective nature of some of our procedures, damage which many of our peers have also stated. However, we are not allowing a challenging macro environment to detract from our focus on strengthening our foundation and positioning to drive future growth.\n\nFor example, by launching two new products in dental, which I referred to earlier, the T3 PRO and the Encode Emergence Healing Abutment, we intend to stay at the forefront of the premium implant digital energy markets by delivering a cadence of dental product enhancements over the coming year and beyond. As I touched on earlier, we saw the culmination of years of our team's work driving awareness of The Tether's value in pediatric scoliosis in the form of a positive policy decision from Anthem. Although The Tether contributes a smaller piece of our spine portfolio today, insurance coverage has proven the greatest headwind to adoption in the past, and we expect The Tether to grow meaningfully as access improves over time. I would also like to highlight that we improved our cash balance by approximately $25 million sequentially from first quarter end through second quarter end, closing June with $130 million in cash and equivalents.\n\nWe drove cash flow improvement through greater fiscal discipline, including spending scrutiny and monetization of certain aspects of our balance sheet, as Rich will detail shortly. As we said during our analyst/investor day earlier this year, we are committed to advancing our operational efficiency of our business, including improving cash flow and reducing leverage over time. We are pleased with our early progress to increase cash, providing greater forward flexibility and confidence in achieving those goals. I will now hand the line over to Rich Heppenstall, our chief financial officer, to review more details of our second quarter performance and financial outlook.\n\nRich Heppenstall -- Chief Financial Officer\n\nThanks, Vafa, and good afternoon, everyone. I'll begin by reviewing our second quarter 2022 results and will then close by providing commentary on our outlook for the full year 2022. Beginning with sales. Total third-party net sales for the second quarter of 2022 were $233.4 million, a decrease of 11.5% on a reported basis and 8.3% in constant currency when compared to the prior-year period.\n\nShifting to our two segments. Global dental's third-party net sales were $118.2 million, representing a 1.8% decrease on a reported basis and a 2.9% increase in constant currency when compared to the prior-year period, primarily driven by implants and digital dentistry net sales growth and an extra selling day in Q2 of 2022, offset by foreign currency exchange headwinds, mainly net sales denominated in euro. Geographically, U.S. third-party net sales of $70.2 million increased by 3.7%.\n\nOutside of the U.S. sales of $48.0 million decreased by 8.9% on a reported basis but increased 1.9% when excluding the impact of currency. Strong double-digit implant growth in the U.S. was fueled by pull-through from our digital dentistry and biomaterials offerings and leveraging our medical education programs, but was partially overshadowed by a more challenging macroeconomic environment outside of the U.S., particularly in Europe.\n\nGlobal spine third-party net sales were $115.2 million in the second quarter of 2022, a 19.6% decrease on a reported basis and a 17.8% decrease in constant currency when compared to the prior-year period. The decrease in spine sales is driven by the exit of certain unprofitable markets in late 2021, the discontinuation of products as part of our brand rationalization program, the impact of the net sales retained by Zimmer Biomet until we complete our separation activities in certain markets and continued competitive pressures in the spine market. When adjusting for these items and taking into consideration one additional selling day, spine sales decreased by 13.2% and 11.3% on a reported and constant-currency basis, respectively. Adjusted gross profit was $153.4 million, compared to $177.9 million in the prior-year period.\n\nAdjusted gross margin was 65.7%, a decrease of 180 basis points when compared to 67.5% in Q2 of 2021. The decline versus prior year was primarily due to lower net sales, which drives higher excess and obsolete inventory in spine, partially offset by higher gross margins in our dental segment due to a higher margin contribution from implant growth. Adjusted research and development expenses as a percentage of third-party sales of 5.5% is flat to the prior-year period. Adjusted selling, general and administrative expenses of $124.5 million, or 53.3% of third-party net sales, reflects a reduction of $13.0 million over the prior-year period.\n\nThe decline year over year is due to less variable selling expenses from lower net sales, timing delays of cost to continue to stand up ZimVie as an independent public company and operational initiatives intended to reduce our cost structure. G&A as a percentage of third-party sales increased 120 basis points year over year. Adjusted EBITDA of $31.3 million, or 13.4% of third-party sales, reflects a decrease of 110 basis points from 14.5% in the prior-year period. In constant currency, adjusted EBITDA was $32.6 million or 13.5% of sales.\n\nOur profit margins are generally naturally hedged against currency fluctuations, which meets to the volatility we are seeing in the global currency markets. In addition, we instituted a balance sheet hedging program immediately following the spend to hedge against currency transaction risk. This program is working as designed, reflected by a modest $0.5 million of currency gains making their way into our income statement in Q2 of 2022. Adjusted earnings per share was $0.67 on a fully diluted weighted average share count at 26.1 million shares.\n\nDuring the quarter, we realized a tax benefit of $6.3 million on an adjusted basis or approximately $0.24 per share due, in large part, to account for income tax previously recognized for intercompany inventory when we were part of Zimmer Biomet. This inventory is nontaxable to ZimVie as it is sold. Touching on working capital and liquidity. We are in the early stages of capitalizing on the strength of assets on our balance sheet with a focus on optimizing the allocation of capital and the monetization of certain assets to drive cash and, thus, increase financial flexibility.\n\nOur early efforts have resulted in a reduction in net inventory of $20.3 million since December 2021 and a reduction of $8.6 million in the planned amount of capital spent on spine instruments. We ended the second quarter with approximately $130 million of cash and equivalents, up $26 million from $104 million at March 2022. This includes approximately $22 million of cash earmarked to settle certain post-spin-related transactions and to fund ERP implementations to decouple from our prior parent company. I'll now turn to our revised full year 2022 outlook.\n\nInclusive of a greater-than-anticipated impact of foreign exchange headwinds, we are revising our full year 2022 net sales outlook to a range of $915 million to $930 million. This compares to our prior guidance of $1.0 billion in net sales. Over $30 million or slightly less than half of our total reduction is due to foreign exchange headwinds at prevailing rates. As it relates to the segments, we now expect full year 2022 net sales growth in the mid-single digits on a constant-currency basis for our dental business.\n\nThis is at the lower end of our prior expectations for mid- to high single-digit growth due to macroeconomic headwinds, particularly in Europe. For our spine segment, we now expect full year 2022 net sales to decline in the low double digits versus our prior expectation from mid- to high single digits. The decline is due to choppiness in procedural volumes, China volume-based procurement acceleration into 2022, and commercial execution challenges. We have made progress identifying inconsistencies in our team's commercial approach and continue to execute against our longer-term initiatives to return this business to growth.\n\nWe are pleased with the operational actions we have taken in our first few months since the spin to rightsize the business and optimize our cost structure. Thus, we are maintaining our adjusted EBITDA margin range of 13.1% to 13.6%. Turning to our bottom-line expectations. We are revising our full year 2022 adjusted earnings per share outlook to a range of $1.80 to $2 per share from $2.10 to $2.30 per share previously.\n\nThis is due, in large part, to the impact of lower revenue and higher interest expense, partially offset by the full year impact of the tax benefit we realized in Q2. Before I close and hand back over to Vafa, I want to underscore that we were to launch a number of operational initiatives in the four months since the spin to control operating expenses, rightsize our business, rationalize our real estate and geographic footprint and monetize the strength of assets on our balance sheet. Although the realization of many of these projects will manifest themselves in the income statement over the coming quarters, we are seeing an immediate benefit to liquidity and financial flexibility, as I just discussed. We are pleased with our progress in the short time since spin, and we'll continue to apply our disciplined financial framework as we continue to operationalize the business.\n\nWith that, I'll now turn the call back over to Vafa.\n\nVafa Jamali -- President and Chief Executive Officer\n\nThank you, Rich. I want to close our call by looping back to the positive policy decision from Anthem Blue Cross Blue Shield for The Tether, expanding potential treatment eligibility within their 30-plus million members covered under Anthem Blue Crafter Shield. Our Tether device is the first of its kind non-fusion scoliosis treatment and the first-and-only FDA-approved device for anterior vertebral body tethering. Its humanitarian device exemption, HDE, was granted based on over seven years of clinical data validating its safety and effectiveness in scoliosis correction.\n\nOver 1,200 children have received The Tether since HDE approval in August 2019 with approximately 50 U.S. surgeons performing the procedure. Today, I want to highlight the story of a 13-year old male patient with scoliosis for whom coverage was the prior barrier to therapy. Although the doctors at Children's Hospital Colorado recommended VBT, his original claim and appeal were denied.\n\nAs his scoliosis worsened, his family spent out on the phone to fight this. Just three weeks ago, the family got word that insurance would cover the procedure due to the updated policy deemed in the treatment medically necessary for indicated patients. They were thrilled to access the best option for their son. Expanded coverage removes a significant barrier to treatment for many patients like this one, and we are optimistic that Anthem's decision will pave the way for even greater therapy from additional insurers over time.\n\nIn summary, we are pleased to be doing what we set to do from the time of our spin a few months ago, which is operate the company with greater efficiency and leverage our differentiated therapies like The Tether to lay the foundation for future growth. This remains our priority as we continue our mission to transform patients' lives. With that, I want to thank you for your time and open it up for any questions.\n\nOperator\n\nThank you. One moment. Sorry about that. Our first question comes from Robbie Marcus.\n\nOne moment.\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nHi. Can you hear me OK?\n\nVafa Jamali -- President and Chief Executive Officer\n\nGo ahead, Robbie.\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. Thanks for taking the questions. Maybe to start, just so we have a framework of guidance here, what were you assuming for currency in the prior guidance range? What's the currency headwind now assumed in this, just so we could get a better sense of what's FX and what's underlying performance?\n\nRich Heppenstall -- Chief Financial Officer\n\nYeah, hi, good afternoon. It's good to talk to you again. So the original guidance when we provided the range or the point estimate $1 billion in February was at the prevailing rates at the end of the year. What we're seeing right now with the Euro basically close to parity, we're seeing over $30 million of FX headwind.\n\nAs you recall, our dental business is almost half outside of the U.S. And so, we're seeing over $30 million of FX headwind in the guidance revision.\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nGot it. So there was a shortfall in second quarter. It looks like there's more shortfall assumed in third and fourth quarter. How should we think about where the biggest pressure points are? What's assumed in the guidance here relative to market recovery? And I have a few follow-ups after that.\n\nThanks.\n\nRich Heppenstall -- Chief Financial Officer\n\nYeah. So let me provide a little bit of just color on how we're thinking about the balance of the year, and I'll break it up between dental and spine. So on the dental business, we guided mid-single digits to mid-, high single digits. We expect to be at the lower end of the range.\n\nThe way I think about it is if Q3 sequentially is our lower quarter for dental, and so, what we expect to see is a kind of a modest decline in Q3 due to seasonality, and then Q4 is typically our strongest quarter. And seasonality for dental will largely be roughly the same as it was, say, in 2019. On the spine side of things, we expect the balance of the year to be in the low single-digit decline. Again, Q4 is the stronger of the two remaining quarters because of seasonality, but we still expect Q3 to be impacted by seasonality in spine.\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nGot it. Last for me, the good news is you had good expense control --\n\nRich Heppenstall -- Chief Financial Officer\n\nRobbie, sorry to interrupt. I think I said low single digit, I meant low double-digit decline, my fault.\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nGot it. Okay. That helps. Good news is expense control was pretty good in the quarter, and you're holding your margin targets here.\n\nMaybe speak to where you're seeing the cost savings. Is it coming from variable comp? Are you cutting back on projects? Are you really holding spend tight just cost line? And are you more limiting spend? Or are you reallocating spend that would have been -- help to drive the top line? Thanks.\n\nVafa Jamali -- President and Chief Executive Officer\n\nHey, Robbie, Vafa here. Yeah, so when we look at the company, and we said we had a number of obstacles that we wanted to overcome. And one was just the operations, primarily within spine, where we were wasting a lot of money in the operations. We didn't have very good DC, distribution center, performance, and we fixed that.\n\nSo by early summer, we were back on to service levels we wanted, and that was basically a savings in a sense that we weren't duplicating spend there. But we've been really, really prudent on what we've been spending on, but we haven't done that to sacrifice any projects. So our pipeline looks really good. I'm looking forward to sharing that pipeline with you guys later on as we get a little more granular on what we have.\n\nBut I think that we're doing well there. And we expect -- we've really been certain on what we're going to spend on and where are the areas we can save on, but we haven't done it at the expense of any kind of commercial -- forward commercial activities and projects. Rich, any other thoughts you have on that one?\n\nRich Heppenstall -- Chief Financial Officer\n\nYeah. I mean, Robbie, we also took some initiatives in the second quarter to really do a number of things, including rationalizing our global footprint, looking at our real estate and determining how much we need, how much we actually don't. We also took some steps to rightsize the businesses and flatten the organization structure a little bit. And so that's also in there for part of Q2.\n\nAnd as we mentioned before, we're looking to operationalize the business and look to really take out a lot of waste. And so as we're continuing to turn over rocks, we're finding areas of inefficiency. And so we're just -- we're putting them through the same lens that we have all along and just really kind of scrutinizing what we're spending our money on to make sure that we're getting the best return out of the investments that we are making.\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nGreat. And just last for me. We've moved about a month, month and a half since the end of second quarter. Have you seen any of these difficult trends improve so far over the summer? Any signs of light that some of the pressure points are loosening up? Thanks a lot.\n\nVafa Jamali -- President and Chief Executive Officer\n\nSure. So internally speaking, we're continuing to make some progress against some of these operational gains we've made. So I think you'll continue to see that theme, so that's a good thing. Macroeconomic, which I think is the crux of your question, I think the summer has been slow, and I think that's why we're being very conservative into the back half of the year.\n\nBut I do believe the summer is slow, and we don't see -- especially outside of the U.S. The U.S. has largely been a pretty good market. But outside of the U.S., we are seeing extended vacations, for lack of a better way to explain it.\n\nBut not necessarily -- when we go to visit the customers, we're not seeing a loss of a customer, we're seeing an absentee customer on vacation for a good reason. So I see that, and I see FX being something that will carry on through the rest of the year. Rich, anything else you think?\n\nRich Heppenstall -- Chief Financial Officer\n\nNo, I think that's fair. I think you mentioned it. That's fine.\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks a lot.\n\nRich Heppenstall -- Chief Financial Officer\n\nThanks, Robbie.\n\nVafa Jamali -- President and Chief Executive Officer\n\nThanks, Robbie.\n\nOperator\n\nThank you. And there are no other questions in the queue. I'd like to turn the call back to management for any closing remarks.\n\nVafa Jamali -- President and Chief Executive Officer\n\nThank you very much for joining the call. Robbie, thanks for your questions. Appreciate the interest. We're feeling really optimistic about the business.\n\nIt's, again, turnarounds are bumpy, and we're in the early stages, but we feel like we see a path to great things and ultimately a rich and robust pipeline, as well as a well-operated company. So thank you very much for your time, and we look forward to talking to you in a quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMarissa Bych -- Investor Relations\n\nVafa Jamali -- President and Chief Executive Officer\n\nRich Heppenstall -- Chief Financial Officer\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nMore ZIMV analysis\n\nAll earnings call transcripts"
}