{
  "companyName": "Teladoc Health",
  "companyTicker": "TDOC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/teladoc-health-tdoc-q3-2022-earnings-call-transcri/",
  "content": "Teladoc Health (TDOC -0.84%)\nQ3 2022 Earnings Call\nOct 26, 2022, 4:30 p.m. ET\n\nOperator\n\nHello and welcome to the Teladoc Health third quarter 2022 earnings conference call. My name is Alex, and I'll be coordinating the call today. [Operator instructions]. I'll hand over to your host, Patrick Feeley, head of investor relations.\n\nPatrick, please go ahead.\n\nPatrick Feeley -- Vice President, Investor Relations\n\nThank you, and good afternoon. Today, after the market closed, we issued a press release announcing our third quarter 2022 financial results. This press release and the accompanying slide presentation are available on the investor relations section of the teladochealth.com website. On this call to discuss the results are Jason Gorevic, chief executive officer; and Mala Murthy, chief financial officer.\n\nDuring this call, we will also provide our fourth quarter and full-year 2022 outlook, and our prepared remarks will be followed by a question-and-answer session. Please note that we'll be discussing certain non-GAAP financial measures that we believe are important in evaluating Teladoc Health's performance. Details on the relationship between these non-GAAP measures to the most comparable GAAP measures and reconciliations thereof can be found in the press release that is posted on our website. Also, please note that certain statements made during this call will be forward-looking statements as defined by the Private Securities Litigation Reform Act of 1995.\n\nSuch forward-looking statements are subject to risks, uncertainties, and other factors that could cause the actual results for Teladoc Health to differ materially from those expressed or implied on this call. For additional information, please refer to our cautionary statement in our press release and our filings with the SEC, all of which are available on our website. I would now like to turn the call over to Jason.\n\nJason Gorevic -- Chief Executive Officer\n\nThank you, Patrick. Good afternoon, and thanks for joining us. After the close today, Teladoc Health reported strong third quarter results driven by solid execution across the business. Revenue grew 17% over the prior year to $611 million, above the midpoint of our guidance range, and adjusted EBITDA of $51 million exceeded the high end of our expectations.\n\nWhile the broader operating environment remains challenging across the economy, during the quarter, we made meaningful progress against our strategy, including four areas I want to briefly highlight: first, driving better outcomes and lower costs for our chronic care populations; second, continued momentum in our Primary360 product with clients and members; third, closing meaningful new deals; and fourth, delivering strong performance at BetterHelp. Starting with chronic care. We're encouraged to see a growing trend of clients looking for partners who can deliver proven cost savings and outcomes. Earlier this month, we held our client advisory panel with leaders from 30 health plans, large employers, and health systems in attendance.\n\nIt was universally clear that value-based care is high on the priority list for these organizations with a strong interest in programs that manage chronic conditions and drive engagement with populations via virtual primary care relationships. Value-based arrangements are becoming even more important in the current macroeconomic environment. And as I look at the chronic care pipeline, we're seeing a notable increase in deals with such features. We view this trend as very favorable for us since our proven outcomes present a tremendous value proposition for our clients, and we're well-positioned in the market to capitalize on that dynamic.\n\nAn example of our ability to drive outcomes and savings is evidenced by the results of one of our recent pilots. In early 2021, we launched a chronic care shared savings pilot with fully insured members at a large Blue Cross Blue Shield plan. Our team just concluded a study with this partner's actuarial team, who determined that we have exceeded our medical cost savings target by 60%. Not only do we drive better outcomes for our members and drive more savings for our clients, but we were able to realize a small, shared savings bonus.\n\nWe believe the outcome of this pilot and others like it validate our ability to move further toward value-based contracting over time. Ultimately, we believe the ability to leverage broad integrated virtual and digital care models to drive measurable savings uniquely positions us to capitalize on market demand for these arrangements. Turning to Primary360. At the start of the year, we told you we would provide additional insight later in the year.\n\nAnd so today, we'll provide you with a first look at some of the encouraging results we've seen thus far. Primary360 members are reporting high satisfaction with NPS scores currently in the 70s, a strong vote of confidence. Members who have engaged with Primary360 this year are connecting with care teams at a rate greater than once every three months, a result of the significant value we are delivering. We're also finding that members with chronic conditions are significantly more likely to engage with Primary360.\n\nThis year, we're seeing those members as four times as likely to meet with their Primary360 care team. Meanwhile, one in every three of our Primary360 members is using two or more of our services, demonstrating Primary360's role not just as virtual primary care, but also as a front door to multi-specialty care. So, while we're at the beginning stages of bringing integrated virtual primary care to the market, the strong member and client response to the service gives us a lot of confidence in the long-term opportunity. As I turn to commercial momentum, we have discussed throughout the first half of the year our pipeline has developed more slowly than we expected coming into the year.\n\nYear-to-date bookings, which represent the estimated incremental annual revenue contribution from deals signed during the year, is roughly equivalent to the same period in the prior year. We are, however, encouraged by a number of new significant deals that we expect to contribute to our growth for the next few years. First, you may have seen HCSC's press release last month announcing our partnership to make Primary360 along with our general medical, mental health, and nutrition services available to self-insured employer groups. This follows on the heels of our agreement last year to bring our full suite of chronic care products to HCSC employer clients.\n\nThe launch of this partnership is a validation of our integrated whole-person care strategy and another example of our ability to land and expand across products. And that deal represents just one example of the momentum we're seeing with large health plans looking to partner with us to offer our products and services to bear employer clients. In addition to Primary360, we're also seeing this momentum in chronic care with multiple large health plans looking to partner. We expect these agreements will contribute to our pipeline over a multiyear period.\n\nFinally, while we typically close many new employer deals in any given quarter, I wanted to highlight one in particular as I think it underscores the value proposition of our broad integrated service offering. We're replacing three different competitors all at once across chronic care, telemedicine, and our myStrength mental health solutions at one of the largest providers of care to correctional facilities and other government-run institutions. We believe the market is shifting away from disparate point solutions and toward integrated offerings, a trend that we believe strongly favors Teladoc Health. Turning to BetterHelp.\n\nThe team continued to drive impressive top-line growth, particularly in this time of increased macroeconomic uncertainty while addressing the tremendous unmet need for global medical services. While yield on advertising spend remains below where we expected it to be at the beginning of the year, we've seen it stabilize as anticipated. BetterHelp remains on track to deliver strong revenue and margin contribution. We expect to continue building upon BetterHelp's significant leadership position in the direct-to-consumer mental health market while driving both growth and margin.\n\nWith that, I'll turn the call over to Mala for a review of the third quarter and our forward guidance.\n\nMala Murthy -- Chief Financial Officer\n\nThank you, Jason, and good afternoon, everyone. During the third quarter, total revenue increased 17% year-over-year to $611 million. The biggest driver of that growth was BetterHelp, our direct-to-consumer mental health brand, which grew over 35% as compared to the prior year's quarter or approximately 7% sequentially over the second quarter and in line with our expectations. We continue to expect the typical seasonal slowdown in advertising spending during the holiday season in the direct-to-consumer market, and therefore, expect to see material acceleration in consolidated adjusted EBITDA margin in the fourth quarter.\n\nTurning to chronic care. The total number of our members enrolled in one or more of our chronic care programs was 791,000 at the end of the third quarter, an increase of 66,000 or 9% over the prior year's quarter and a sequential decline of 7,000 enrollees as compared to the second quarter. The decline in enrollment was driven by the loss of one government sector client, which due to changes in leadership, has chosen to cease offering primary care management programs to its populations. If not for the loss of this client, chronic care member enrollment would have increased by 15,000 lives over the second quarter.\n\nI would also add that while the client's decision resulted in a higher-than-expected attrition rate in the third quarter, even including this loss, our full-year member churn is still trending in line to slightly better than the past two years, a testament to our efforts to drive better member engagement. We ended the quarter with total U.S. paid membership of 57.8 million members, an increase of 1.2 million members over the second quarter, driven by a combination of new virtual care client onboardings and population expansions within existing clients. Individuals with visit fee-only access were 24.3 million at the end of the third quarter.\n\nAverage U.S. revenue per member per month was $2.61 in the third quarter, up 9% from $2.40 in the prior year's quarter. As compared to the second quarter, PMPM growth was driven by growth in BetterHelp revenue although largely offset by membership mix as we added 1.2 million net new telemedicine members in the quarter. Adjusted EBITDA was $51.2 million in the third quarter, compared to $67.4 million in the prior year's quarter and above the high end of our guidance range.\n\nThe third quarter adjusted EBITDA outperformance relative to our expectations was driven primarily by stronger cost control as we look to drive efficiency. Both technology and development expense and gross margin contributed to the upside. Net loss per share in the third quarter was $0.45, compared to a net loss per share of $0.53 in the third quarter of 2021. Net loss per share includes stock-based compensation expense of $0.34 per share, amortization of acquired intangibles of $0.30 per share, and $0.02 per share of lease abandonment costs associated with office space rationalization.\n\nDuring the third quarter, we generated a free cash flow of $20 million and ended the quarter with $900 million in cash and short-term investments on the balance sheet. Now turning to forward guidance. Last quarter, we noted that full-year results were likely to be near the low end of our prior guidance range. Our updated guidance today is consistent with that expectation.\n\nFor the full year 2022, we expect revenue to be in the range of $2.395 billion to $2.41 billion. We expect adjusted EBITDA for the full year to be in the range of $240 million to $250 million. We expect total U.S. paid membership of 57 million to 58 million members, an increase of 1.5 million members over our prior guidance.\n\nWe expect total visits for the year to be between 18.4 million and 18.6 million visits, representing growth of 19% to 21% over the prior year. For the fourth quarter of 2022, we expect revenue of $625 million to $640 million, representing growth of 13% to 15% year-over-year. We expect fourth quarter adjusted EBITDA to be in the range of $88 million to $98 million. Total fourth quarter visits are expected to be between 4.7 million and 4.9 million visits.\n\nWith that, I will turn the call back to Jason for closing remarks.\n\nJason Gorevic -- Chief Executive Officer\n\nThanks, Mala. This week, we are pleased to welcome Laizer Kornwasser to the team as our new president of Enterprise Growth and Global Markets. Some of you may know Laizer from his role as chief operating officer of CareCentrix, where he was responsible for driving operational excellence and business strategy, growing EBITDA through product and client diversification and leading the integration of the company's diabetes franchise to build a new suite of services. At Teladoc Health, Laizer will help optimize company performance across all client channels and product lines to further unlock the revenue and profit growth potential of our whole-person care strategy.\n\nI look forward to working closely with him and know he will make an immediate impact on our commitment to empowering all people everywhere to live their healthiest lives. With that, we'll open the call for questions. Operator?\n\nOperator\n\n[Operator instructions]. Our first question for today comes from Lisa Gill of J.P. Morgan. Lisa, your line is now open.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nThanks very much. Good afternoon, everyone. Jason, it's the third quarter, so you know I'm going to ask about the selling season. You talked a little bit about signing some incremental deals.\n\nYou talked about where the pipeline is. But can you give us an idea of how to think about how the selling season is going to play into 2023? And as we think about some of the newer deals, are any of them with some of the new payment models you talked about? And are there anything from an implementation cost perspective or anything else to think about as we think about headwinds and tailwinds going into '23.\n\nJason Gorevic -- Chief Executive Officer\n\nYes. Thanks, Lisa. I'd be disappointed if you didn't ask that now. So, appreciate the question.\n\nLet me start with sort of an overview of how to think about our revenue outlook going forward, and then I'll dig a little deeper into the bookings and what the pipeline looks like. So, if I think about the overall outlook, obviously, we won't give specific guidance until February, but I'll try to give you some of the dynamics going on. So, if I think about the swing factors for next year, first, BetterHelp. As I think about the direct-to-consumer business, it's reasonable to expect BetterHelp to be more closely tied to the financial health of the consumer, and therefore, a little bit more sensitive to the macroeconomic outlook.\n\nWe see a little bit of impact to BetterHelp growth from that macroeconomic dynamic this year, as we discussed in the July call. That, of course, can cut both ways though. So, if we see economic recovery next year and inflation coming down and the consumer feeling more confident, that could be helpful for us. If the consumer sees significantly more inflation and pressure, that could pressure the consumer since BetterHelp is one of the more expensive things that the consumer buys online that doesn't come in a box.\n\nI think you should also just expect us to continue to take a more balanced approach to growth and margin in BetterHelp. That business has grown and scaled incredibly fast. It's at a run rate of $1 billion. And I think it's fair to expect us to focus on driving both growth and efficiency.\n\nAnd you started to see some of the benefits of that in the second half of this year, and some of our gross margin improvement comes from specifically BetterHelp. The second thing I'd look at is what you asked about specifically, the pipeline development. I would call the third quarter kind of a catch-up quarter when it comes to bookings. So, you heard us talk about the first couple of quarters as the pipeline developing more slowly than it had in prior years or slower than our expectations.\n\nThe third quarter saw a turnaround of that, and it was not only our biggest quarter of the year in terms of bookings, but it was significantly larger than our third quarter bookings last year. So, it puts us at a place now where year-to-date through the third quarter, we're almost identical to the total sort of gross bookings that we saw through the third quarter last year. So just a reminder about how to think about that on the B2B side of our business. The B2B side of our business, if you look at revenue next year, it's essentially baseline revenue this year plus bookings minus churn.\n\nOur churn is in line to even slightly better than it was over the previous several years and in line with last year. So, we don't see any significant changes there. And we still have two months left in the selling season. The fourth quarter is always really important for us.\n\nAs I look at our pipeline, our pipeline is similar to what it was at this time last year. There are some good characteristics to the deals that we've closed. Our deals that we've closed are significantly larger than they have been in prior years. So, our average deal size is 2x what it was -- in the third quarter, it was 2x what it was in the first two quarters and 50% larger than a year ago period.\n\nWe're continuing to see good cross-sells. That contributes, obviously, to the significantly larger deal size. And over three quarters of our deals are multiple -- multiproduct sales. So, I think that hopefully gives you some color.\n\nYou asked a little bit about value-based deals. We do have some deals that we've signed this year that are more value-based deals and give us upside to share in the savings that we generate. And I'm excited by the results of the pilot that we talked about in our prepared remarks at that large Blue plan. And I think that portends well for us leaning further into more value-based arrangements.\n\nOperator\n\nThank you. Our next question comes from Richard Close of Canaccord. Richard, your line is now open.\n\nRichard Close -- Canaccord Genuity -- Analyst\n\nYes. Thanks for the questions. I had two, if I could flip those in. But Jason, you talked a little bit about balancing the growth in margins on BetterHelp.\n\nJust curious if you could go in maybe a little bit more detail on that. And then can you talk about market share? Obviously, with the tough economy, I suspect some of your competitors and the noise you talked about earlier in the year maybe have pulled back some. So just talk about the competitive environment in that as well.\n\nJason Gorevic -- Chief Executive Officer\n\nYes. I think, Richard, there's not a whole lot more to say with BetterHelp about focusing on the combination of growth and margin. We always try to optimize that business. I will say, for example -- I'll point out a couple of things that have yielded improvements in the margin, especially the gross margin on that business.\n\nWe're leaning more into digital interactions with consumers as well as group -- virtual group therapy sessions, which is a more efficient way of interacting with the consumer, improves the gross margins. It actually has the -- sort of the other effect of actually depressing our visit volume. So that's -- we actually see fewer visits. Fewer visits in the BetterHelp business is actually good because it improves our gross margin and enables us to serve more people with fewer professional resources.\n\nSo that's an example of some things that are good for lifetime value of a consumer, good for member retention, and also good for margin. When I think about margin or market share, Richard, I'll just give a couple of comments relative to what we're seeing in the overall landscape. I've spent a fair amount of time recently with a number of our clients, both some of our largest clients as well as, as I mentioned, at our client advisory group and then also with other CEOs in the healthcare industry. And we're definitely seeing an impact from a tightening economic environment and a higher cost of capital impacting some of the smaller companies.\n\nIn fact, I was with a very large client yesterday, and the challenge of them, quite frankly, questioning whether some of those smaller companies are going to be able to survive is definitely top of mind for them. So I'm not sure that I would say that we've seen a massive shakeout yet, but I'm hearing quite a bit among both clients as well as other healthcare companies that is very much attuned to that.\n\nOperator\n\nThank you. Our next question comes from Jailendra Singh from Truist Securities. Jailendra, your line is now open.\n\nJailendra Singh -- Truist Securities -- Analyst\n\nThank you, and thanks for taking my questions. Jason, I was wondering if you could spend a little bit more time on the BCBS pilot program you called out just in general. Trying to understand the role Teladoc is expected to play in the shift to value-based care. Clearly, the outcomes are pretty encouraging, but I'd like to understand if Teladoc's role is going to evolve in the shift.\n\nShould we think about the company more as a BBC enabler? Or should we think about them as like a company taking more risk at some point in the future? And if you can quantify how much of the benefit in the quarter from these shared savings.\n\nJason Gorevic -- Chief Executive Officer\n\nYes. So Jailendra, welcome back. It's nice to hear from you. I'll talk about that specific shared savings pilot and maybe a little bit of the downstream impact that we are seeing from that.\n\nI'll probably defer on -- it's a small, shared savings bonus, so I'm not going to quantify what that is. It's immaterial to the quarter. But what I will say is we signed up for a program specifically focused on chronic conditions. In this case, it was diabetes management.\n\nAnd we had a base PMPM and the opportunity to share in the savings that we generated. We significantly outpaced the savings that was expected. As I said in my prepared remarks, we beat it by 60% relative to the target. The way that, that deal was structured, we had a risk corridor where we had shared savings, where we share in the savings with the health plan in that risk corridor.\n\nAnd that worked out great for us. I think one of the downstream impacts that maybe isn't quite as obvious is that, that client as a result of our significant success has accelerated the expansion both in terms of the population that we serve and also the number of products and services that we bring to their populations. So we got the benefit of a little economic boost from the shared savings bonus that inured to us. The bigger impact, quite frankly, is acceleration of the expansion of both our products and the population that we serve within that client.\n\nIt also sets us up for great learning as we lean into more of those value-based arrangements. We're very happy to put our fees on the line to guarantee both clinical and economic impact, and we can do that because of the underlying data science and our significant track record and scale of making that impact.\n\nMala Murthy -- Chief Financial Officer\n\nAnd I would add that it sort of generates the return on the investments that we have been saying we are making in all of our data infrastructures over the past 18 months to two years. So this is an example of the return on investments such as that.\n\nOperator\n\nThank you. Our next question comes from Ryan Daniels of William Blair. Ryan, your line is now open.\n\nRyan Daniels -- William Blair and Company -- Analyst\n\nYes. Thanks for taking the questions. Jason, I wanted to go back to Primary360. It's interesting that you're seeing higher utilization, high NPS.\n\nSo I'm curious if there's an opportunity to move into value-based contracting with that as well so that you might be able to garner shared savings as the better utilization with your clinicians drives better outcomes over time. Thanks.\n\nJason Gorevic -- Chief Executive Officer\n\nYes. Ryan, I appreciate that. I'll go through just a couple of other stats that I didn't include in my prepared remarks. We're very, very pleased with the progress in Primary360.\n\nAs I sat down with some of our largest employer clients, some of the things that they were most moved by was not just the things that I talked about, the data points that I talked about relative to treating members with chronic illnesses, but especially the fact that what we're seeing is 60% of our Primary360 members who engage with a virtual primary care relationship haven't seen a physician in the last -- in at least two years. And almost 30% of them say that they wouldn't have seen a provider if they didn't have access to Primary360. And so those are some of the things that when I talk to the largest employers who are interested in the long-term health of their employees, are really focused on. Because we know if we can't engage consumers and their distant franchise from the healthcare system, they're never going to do early identification of chronic conditions or take the necessary steps relative to appropriate screenings.\n\nWhen we talk to large health plans, they're very focused, as you might imagine right now, on Star Ratings and closing and HEDIS measures and closing gaps in care. And because of all those reasons, Ryan, you're exactly right, we are starting to lean into value-based arrangements with some of our health plan partners, and to a lesser degree, with our employer partners for Primary360. And I think you'll see that continue to evolve over time.\n\nOperator\n\nThank you. Our next question comes from Sean Dodge of RBC. Sean, your line is now open.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nYes. Thanks. Good afternoon. Maybe going back to the gross margins for a moment.\n\nSo on a consolidated basis, those stepped up pretty considerably the last couple of quarters now. Jason, you mentioned the BetterHelp example. I guess beyond that, is there any more detail you can give us on drivers there? Are there any one-time items in that? And so with you closing in on gross margin of 70%, 69.6% adjusted for the last quarter, how sustainable should we think about that being -- going forward?\n\nMala Murthy -- Chief Financial Officer\n\nYes. Sean, if you think about the performance we've had in our gross margin, and you're exactly right, we have been seeing the uptick in the -- in our gross margins as we have gone through the year. The biggest increase is coming from improved efficiencies in BetterHelp, as we talked about in our prepared remarks. Specifically, the driver of that, that is helping in our gross margin is really around the utilization dynamics of the membership base.\n\nAs we talked about, we are seeing members engaging a little bit more digitally. And we are also seeing members utilizing things like group therapy more. And it's those kinds of things that lead to greater efficiency, and therefore, are improving our gross margin as we go through the year. The other thing to also note, and we have talked about this, we -- if you think about our provider model, we are certainly advancing from what a few years ago was a purely 1099 model, to a bit more of a hybrid model.\n\nAnd that is also going really well in terms of gaining more productivity and efficiency. We are really pleased with the productivity metrics that we are seeing on the part of the providers who are now our full-time employees. And we'll continue, obviously, to monitor that and optimize that. But it is in initiatives like that, that are driving the more sustained impact on our gross margins.\n\nOperator\n\nOur next question comes from Jessica Tassan from Piper Sandler. Jessica, your line is now open.\n\nJessica Tassan -- Piper Sandler -- Analyst\n\nHi. Thanks so much for taking the question. Congrats on a good quarter. We were hoping you could maybe give us some color just on how pricing within chronic care is trending, especially as you continue to see multi-solution kind of adoption and bookings? And then just how should we think about the growth rate of the chronic care business exiting '22 and into 2023? Thank you.\n\nJason Gorevic -- Chief Executive Officer\n\nYes. Jess, I'll take the pricing question and Mala can comment on growth rates. We're seeing pricing hold in the CCM market, I think for probably two, maybe three reasons. One, as you mentioned, most of our sales now are multiproduct sales.\n\nAnd so -- the truth is there aren't many out there who can match even a portion of the full portfolio that we have, much less the entirety of it. And so there is less apples-to-apples in buying the entire bundle of services. So it gives us the opportunity to be a little bit more clear about defining the price rather than having to react to a head-to-head single-point solution competitive bid. The second reason I would say is because of what we talked about before.\n\nWe are willing to put our fees at risk for the clinical outcomes that we drive. And because of that, it kind of de-risks the offering for the clients who are buying it. When we are willing to put ourselves at risk and our fees at risk for those clinical measures, and in some cases for guaranteed ROIs, that enables us to keep pricing solid and even in many cases, as you heard with that pilot with the Blue Cross Blue Shield plan, have upside opportunity relative to shared savings. And then the third reason, I think, is just because of our track record and our stability, what I mentioned earlier about fear among buyers, about whether some of those smaller players are going to be able to continue to exist in a more difficult cost of capital environment.\n\nThat does play in our favor relative to our scale, stability, and longevity. So I think generally, what we're seeing is that it's staying stable.\n\nMala Murthy -- Chief Financial Officer\n\nAnd then, Jess, in terms of your question around chronic care growth, revenue growth, we expect high single-digit chronic care revenue growth this year. And that's what I would expect to us have exiting through the end of this year into next year.\n\nOperator\n\nOur next question comes from Stephanie Davis of SVB Securities. Stephanie, your line is now open.\n\nStephanie Davis -- SVB Securities -- Analyst\n\nThank you. Thank you for taking my question, guys. Congrats on a solid quarter. Could you walk us through some of the granularity on the EBITDA beat and the upside surprises, such as greater scale efficiency or any benefit from the Blue Cross Blue Shield savings relationship? And given that upside, are you still considering a similar magnitude of DTC ad cuts to fuel the 4Q ramp? Or could you moderate this a bit more to focus on growth, especially when we think about January and February, its impact on that?\n\nMala Murthy -- Chief Financial Officer\n\nYes. Yes. Thanks, Stephanie. So in terms of the drivers of the beat, the majority of the upside came on the cost side of the equation.\n\nSo given the revenue performance this year and obviously in light of the macroeconomic environment, we are looking more closely at efficiency like many other companies. And all those efforts, I mentioned some of those efforts, resulted in just better margin pull-through in the quarter. Relative to our internal expectations, the biggest driver of our margin beat was on the technology and development line, OK? The second driver was the gross margin performance, and I just walked through the drivers of the gross margin performance, especially and largely at BetterHelp as we are seeing improved utilization dynamics. In terms of your question around what does this mean for the full-year adjusted EBITDA and the ramp for Q4, the way we -- I'm thinking about it is the following: we have -- when we talked about our full-year adjusted EBITDA expectations last quarter, we expect it to be near the low end of our prior guidance range.\n\nOur updated guidance assumes that we can deliver our adjusted EBITDA solidly at the -- in the range that we have just talked about, the 250 -- $240 million to $250 million range. But if I just take a step back and think about the Q4 adjusted EBITDA performance and therefore the full year, it still calls for the sequential ramp that will be largely driven by the seasonally -- the seasonal lower advertising expense in the fourth quarter. And again, I would remind you what we have said before, this is not new, right? If you think about the ad spend dynamics that we have had pre-COVID, the pullback in Q4 of our ad spend is something that we were doing in the BetterHelp business every single year just because we optimize for pricing, we optimize that business for returns. And therefore, as ad spending becomes much more expensive in the holiday season, so we sort of manage our ad spend around that.\n\nIt happened through COVID that those dynamics changed, became far more muted, and we are just now going back to what was pre-COVID dynamics. Of course, BetterHelp, as you know, is just a more scaled business now than it was pre-COVID, so it is a bit more visible in terms of those dynamics. And then the other thing I would say is just in terms of Q4 adjusted EBITDA, we do anticipate a sequential step-up in technology and development spend in the fourth quarter as we continue to invest in the business. That is included in the guidance that we have given out for 4Q for adjusted EBITDA.\n\nOperator\n\nOur next question comes from Charles Rhyee of Cowen. Charles, your line is now open.\n\nCharles Rhyee -- Cowen and Company -- Analyst\n\nYes. Thanks for taking the question. Jason, you gave us some metrics around Primary360, and I think you characterized it as for members who have engaged with it. Can you give us a sense for those members who it's available for, what the actual uptake has been in terms of members selecting a virtual primary care team? And then secondly, what are your expectations then as we think about for HCSC next year? If it's available to their self-insured clients, is the selling efforts really driven by you? Or is that something that's driven by HCSC in terms of pushing the product? Thanks.\n\nJason Gorevic -- Chief Executive Officer\n\nYes. It's always a team approach. We work with our partners to engage their self-insured clients. Their self-insured clients have to make the decision that they want to go with Primary360 or any of our chronic care management programs.\n\nAnd so that's a team sell. Our team is deeply engaged with theirs. And as we've said, that's a multiyear approach. So we expect to see the benefit of that over the course of multiple years as we penetrate that book of business and the other health plan partners that we work with.\n\nWith respect to the overall population, we now have several hundred thousand members who are eligible for Primary360 through their insurance coverage. We have tens of thousands of members who have enrolled in plans that have Primary360 as an integral part of them. We've done thousands of primary care visits this year, and it's growing rapidly. So remember, this is really the first year that we are in the market with that product.\n\nAnd we saw a significant step-up in volume in the third quarter versus the first half of the year. But we haven't quantified it at this point. We haven't given a direct number on either the penetration of the population that's eligible or the total number. I think you'll see us continue to expand the clarity on that as we get through the end of this year and into next year, and quite frankly, through this open enrollment season.\n\nOperator\n\nOur next question comes from Daniel Grosslight of Citi. Daniel, your line is now open.\n\nDaniel Grosslight -- Citi -- Analyst\n\nHi. Thanks for taking the question. Just a quick clarification before I get into my actual question. Did you say the Blue Cross Blue Shield bonus contributed to this quarter? And are you able to quantify that? And then my question is on 2023 revenue -- sorry, go ahead.\n\nGo ahead.\n\nMala Murthy -- Chief Financial Officer\n\nSo, Daniel, it was immaterial to this quarter.\n\nDaniel Grosslight -- Citi -- Analyst\n\nOK. Is it going to hit next quarter? Or it's immaterial to your revenue guidance?\n\nMala Murthy -- Chief Financial Officer\n\nIt's immaterial. It's immaterial.\n\nDaniel Grosslight -- Citi -- Analyst\n\nOK. Got it. OK. And then as I think about revenue growth for 2023, Jason, you mentioned your pipeline is similar to where you were last year.\n\nAttrition is a bit better. If you're likely to see a step-down in BetterHelp growth next year, assuming a softening economy, should we think about growth rates for 2023 at slightly below where you are based on your '22 guidance, which is around 18% year-over-year?\n\nJason Gorevic -- Chief Executive Officer\n\nSo we're not going to give guidance today. We'll do that in February. What we tried to do is give you sort of the components of how to think about that and how to start modeling that. And so I'm going to stop short of going further than that.\n\nI think I've given quite a bit relative to the bookings thus far, the pipeline thus far, and how we're thinking about BetterHelp. And obviously, at $1 billion, that's a big business, and it takes a lot to continue to drive those very impressive growth rates.\n\nOperator\n\nOur next question comes from Elizabeth Anderson from Evercore. Elizabeth, your line is now open.\n\nSameer Patel -- Evercore ISI -- Analyst\n\nHi there. This is Sameer Patel speaking on behalf of Elizabeth Anderson. Thanks, guys, for taking the question. I was just wondering, what are you guys seeing in the market in terms of the pricing on Virtual First plans? Is it coming up cheaper or not so much? Any light would be great.\n\nJason Gorevic -- Chief Executive Officer\n\nYou mean in terms, I assume, of the pricing, the premiums to the end consumer or the end buyer. We actually have seen -- what I can tell you is what we've seen last year. I don't think everything is fully baked yet and, in the market, relative to the exchanges and things like that. What I can tell you is that the exchange -- the Virtual First exchange products that we were part of in -- for this year were not the least expensive priced on the exchange.\n\nAnd I think that actually is really positive. I think it's a demonstration of the value that consumers are seeing in those Virtual First plan designs. Because all in, the premium may be a little bit more, but ultimately, the benefits are richer because the cost sharing is less and it's a plan that meets them on their terms. And so we're actually very pleased with what that looks like for this past year for pricing for '22 plans.\n\nAnd we'll see what happens as we head into '23. But so far, the experience has been very good.\n\nOperator\n\nOur next question comes from Steve Valiquette from Barclays. Steve, your line is now open.\n\nUnknown speaker\n\nHi, everyone. This is Tiffany on for Steve and for the question. I think you talked about the macro impact on the DTC side. I was wondering if you could give a bit more color on maybe what you're seeing on the B2B side in terms of macro environment and employer sentiment.\n\nJason Gorevic -- Chief Executive Officer\n\nYes. I think the only thing we're seeing directly is a little bit of distraction among HR executives who are responsible for both managing the benefits and health of their employee base and, in many cases, are facing a difficult inflationary environment where they have to think about managing their workforce in a different way. And of course, we're all dealing with workforces that are now remote more than in physical locations and office buildings. So I think there's just a little bit more distraction in the current environment.\n\nBut what we haven't seen is -- and again, I think in the first two quarters, I would have said that caused a little bit of slowdown in decision-making among employer benefits leaders. We saw that -- like I said, I described the third quarter as a bit of a catch-up quarter with respect to bookings. And so I think that the employer's greater focus in the third quarter led in part to that and enabled us to break through some of that. So I don't yet see a significant impact on employer buying patterns.\n\nMala Murthy -- Chief Financial Officer\n\nThe thing that's also hard to sort of pinpoint is if -- to the extent that there is a potential recession, what is the impact to our business? Virtual care was not really around in the last recession. So we don't exactly have a lot of history to lean on.\n\nOperator\n\nOur next question comes from George Hill of Deutsche Bank. George, your line is now open.\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nYes. Good evening, guys. And thanks for taking the question. I guess I've got one for Jason and one for Mala.\n\nJason, you talked a lot about kind of the margin opportunity and looking into '23 focused on cost opportunities as opposed to kind of outsized revenue growth. I guess my big-picture question would be is, do you feel like the company is rightsized from a cost perspective? And kind of how aggressive do you feel like you could be there to attack costs? And then, Mala, just kind of a housekeeping question on gross margins. You talked about the gross margin expansion being attributed to the growth in BetterHelp. If we see some of that consumer weakness that a lot of people are talking about for '23, would we expect to see gross margins revert a little bit?\n\nMala Murthy -- Chief Financial Officer\n\nYes. So I'll take both, George. So in terms of sort of the cost control, here's what I would say. We are always conscious of managing our costs.\n\nThat is not a new thing. And if you look at the current macroeconomic environment, as I said a few minutes ago, it does require all companies to be more focused on managing costs, and we are no exception to that. We've certainly increased our efforts to control expenses. We've talked about that as we talked about the adjusted EBITDA beat for the quarter.\n\nAnd so we are pleased we've seen the results of those efforts. We are being intentional in terms of multiple initiatives to date that are focused on driving the cost side of the equation. So I'll give you an example. We have had a project underway for several months now, where we are seeking to make several of our financial systems more efficient and streamlined.\n\nAs we talked about, we are consolidating our real estate footprint in a world where a large number of our colleagues are working remotely. We have assessed, evaluated, and we have begun to reduce the amount of office space that we need to maintain. That's just two small examples of many of the initiatives that we have underway. So I would say we did not, to be clear, say anything really about revenue growth rate for 2023.\n\nWe will, as always, provide more specific outlook, more specific guidance when we do our Q4 call in February. But we are looking for ways, as always, to optimize our cost structure, and we will take an even closer look at that as we head into 2023. I will say, though, in conclusion, we will look at it and we will be thoughtful about how we balance efficiency with the need to make the right investments to continue to drive our top-line revenue growth. As we have said before, there is still an enormous runway for top-line growth in this space, and it would be a shame for us to not make the right investments to continue to capture that growth.\n\nAnd we are really well positioned based on all of the things we have said on the call until now to go do that. So as always, we will look for both -- looking at our cost structure, optimizing it, and making the right investments toward longer-term revenue growth.\n\nOperator\n\nOur next question comes from Cindy Motz of Goldman Sachs. Cindy, your line is now open.\n\nCindy Motz -- Goldman Sachs -- Analyst\n\nHi. Thanks for taking my question. I just wanted to go back to chronic care a little bit. So in the quarter, you lost a client and you're down a little bit.\n\nBut judging by the enthusiasm and the bookings, it feels like that we can assume maybe that's going to go up next quarter with the guidance. And then with PMPM as well, you said it's sort of stable. So I would think the overall PMPM, we could assume that is going to rise. Is that correct?\n\nJason Gorevic -- Chief Executive Officer\n\nI mean we're not giving a specific outlook on CCM, on chronic care revenue, or membership in Q4. But you're exactly right. We feel good about where the overall CCM product portfolio is and the receptivity in the market. Mala called out what the growth would have been absent this one client loss.\n\nWe would have added 16,000 enrollment -- members in enrollment and 26,000 in total program enrollment. So we feel good about that, especially in the fourth quarter of -- sorry, in the third quarter of the year. So we'll continue to feel good, especially as we look at the bookings for the year and heading into next year. And then Mala, I think, gave the sort of general outlook as far as CCM growth as we look forward.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPatrick Feeley -- Vice President, Investor Relations\n\nJason Gorevic -- Chief Executive Officer\n\nMala Murthy -- Chief Financial Officer\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nRichard Close -- Canaccord Genuity -- Analyst\n\nJailendra Singh -- Truist Securities -- Analyst\n\nRyan Daniels -- William Blair and Company -- Analyst\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nJessica Tassan -- Piper Sandler -- Analyst\n\nStephanie Davis -- SVB Securities -- Analyst\n\nCharles Rhyee -- Cowen and Company -- Analyst\n\nDaniel Grosslight -- Citi -- Analyst\n\nSameer Patel -- Evercore ISI -- Analyst\n\nUnknown speaker\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nCindy Motz -- Goldman Sachs -- Analyst\n\nMore TDOC analysis\n\nAll earnings call transcripts"
}