{
  "companyName": "Five Below",
  "companyTicker": "FIVE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/five-below-five-q2-2022-earnings-call-transcript/",
  "content": "Five Below (FIVE -0.31%)\nQ2 2022 Earnings Call\nAug 31, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day and welcome to the Five Below second quarter 2022 earnings conference call. [Operator instructions] Please note that this event is being recorded. I would now like to turn the conference over to Christiane Pelz, vice president of investor relations. Please go ahead.\n\nPlease go ahead, Christiane.\n\nChristiane Pelz -- Vice President, Investor Relations\n\nOh, hi. Thank you, Cole. Good afternoon, everyone, and thanks for joining us today for Five Below's second quarter 2022 financial results conference call. On today's call are Joel Anderson, president and chief executive officer; and Ken Bull, chief financial officer and treasurer.\n\nAfter management has made their formal remarks, we will open the call to questions. I need to remind you that certain comments made during this call may constitute forward-looking statements and are made pursuant to and within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 as amended. Such forward-looking statements are subject to both known and unknown risks and uncertainties that could cause actual results to differ materially from such statements. Those risks and uncertainties are described in the press release and our SEC filings.\n\nThe forward-looking statements are made today -- that are made today are as of the date of this call, and we do not undertake any obligation to update our forward-looking statements. If you do not have a copy of today's press release, you may obtain one by visiting the investor relations page of our website at fivebelow.com. I will now turn the call over to Joel.\n\nJoel Anderson -- President and Chief Executive Officer\n\nThank you, Christiane, and thanks, everyone, for joining us for our second quarter 2022 earnings call. Ken and I will discuss three broad topics on today's call: first, review the second quarter results; second, discuss our updated outlook for the third quarter and the year; and third, discuss the strategic initiatives we are focused on to execute our longer-term vision for growth, the Triple-Double. Despite near-term challenges in 2022, we remain very excited about our business model and future opportunities for Five Below. Now on to the results for the quarter.\n\nTotal sales in the second quarter grew 3.5% over last year to $669 million, and comparable sales decreased 5.8% driven by reductions in ticket and transactions. While this result was lower than expected, we still delivered diluted earnings per share of $0.74 at the low end of guidance due to disciplined expense management. We believe our sales were impacted by both the macro environment, as well as factors specific to Five Below. On the macro front, on top of lapping an unprecedented year in 2021 due to payments of significant stimulus dollars in 2022, consumers are experiencing inflation levels not seen in decades.\n\nInflation in the needs-based areas of food, fuel and housing is cutting into consumers' budgets and we believe changing their spending behaviors. In addition, we are seeing a much more promotional retail environment than in years past due to the excess inventory across the industry. On top of these factors, with COVID restrictions largely lifted, travel and other experience-based sectors increased substantially over last year, which also had an impact on retail traffic and sales in the summer. Specific to Five Below, we had a phenomenal year last year due both to the healthy consumer backdrop I just mentioned and also due to multiple significant trends that drove customers to our stores.\n\nTrends collectively are less of a driver this year. Taken together with the macro environment, lapping last year's robust sales in trends was more difficult than we had expected. As we shared with you at our Investor Day in March, we expected 2022 to be a very unique year for us given many of these factors I just outlined. While we do see some specific positive emerging drivers for our Q4 performance, we do not see all the headwinds just mentioned dissipating in the near term.\n\nAs a result, we have reduced our sales and earnings outlook by nearly 3% and 13%, respectively, for the year. Ken will discuss our outlook in detail in a few minutes. Amid this challenging environment, we continued our journey of ramping back up our growth plan, opening 27 new stores across the country in Q2. Ken will share the details of our planned Q3 openings, but I can tell you the number is over 50% more than Q2.\n\nThis is a great sign that our long-term vision is intact, and we are collectively shifting from strategy to all-out execution. As for Q2, these -- three of these new stores ranked in the top 25 summer grand openings of all time, one each in New York, Texas and California. In addition, we made progress with our key strategic initiatives of product, experience and supply chain. On product, we continue to source amazing new merchandise to capitalize on our existing and emerging trends and also expanded our Five Beyond assortment.\n\nFor the popular Squish offering, we created cool new squish models for our customers' collection. We also sourced products for newer trends like Sanrio, which some of you know is the creator of Hello Kitty. The ability to participate in almost any trend is a unique differentiator of Five Below, and our eight worlds provide the flexibility to react to evolving customer preferences. Our unique approach to the consumables business resonated with customers, and we saw outperformance in categories like novelty candy, snacks, travel accessories, pet, and health and beauty.\n\nFive Beyond also continued to be a growth driver for us as we introduced our first-ever summer WOW Wall with brand-new Five Beyond products for pets and other items from our eight worlds like an outdoor tent and our giant tumbling tower game. In addition, during the second half of July, we kicked off our back-to-school campaign with amazing backpacks, cool tees and fun items for dorms and bedrooms, all at great value, which our teams focused on social media and in-store marketing campaigns. Finally, I'd like to add that we are seeing more closeout opportunities in onetime special buys in the marketplace, which we are choosing selectively to drive even more value for our customers. Turning to our second strategic initiative, experience.\n\nWe are diligently working to update our fleet into the latest prototype unveiled at our Investor Day in March. We are excited about the opportunities the new Five Beyond store-within-a-store concept provides with the reimagined Tech and Room worlds and doubled the SKUs dedicated to Five Beyond product. We are on track to deliver over 250 stores in the new Five Beyond prototype this year. This is another example of how our long-term vision is firmly intact, and we are back to playing offense.\n\nWe believe this offering will be both the traffic and comp driver for the holidays and into 2023. Another important aspect of the overall customer experience is the digital component, which encompasses marketing, customer data and analytics as well as e-commerce. Through increased and more effective digital marketing, we are focused on gaining new customers and growing brand awareness. Our continued investment in digital platforms like TikTok is gaining traction as evidenced by our Bluetooth speaker video with over 9 million views.\n\nSeparately, we are also developing better knowledge of our customers by gathering data through tokenization to better understand and market to them. For e-comm, we enhanced our offering by rolling out BOPIS to over 100 stores in July, and we'll complete our chainwide rollout by the end of this September. BOPIS allows our customers to shop Five Below when, where and how they like, furthering our goal of becoming an omnichannel retailer. This is yet another example of the ongoing implementation of our long-term vision to connect with our customers and deliver an even better experience for them.\n\nWith respect to our third priority, supply chain, we continue to be proactive and look for ways to control our destiny. We are pleased with our inventory position as we deliberately accelerated receipts to ensure good in-stock positions for the key holiday season and to avoid the out-of-stocks we experienced earlier this year and last holiday season. As a healthy retailer with a strong balance sheet, we were able to quickly execute strategic decisions like this to better serve our customers. As it relates to our distribution infrastructure, we are very excited to have officially opened our Indiana shipping center this summer to further gain efficiencies and speed to our stores and ultimately our customers.\n\nAs a reminder, this DC completes our five-node network and provides us capability to service approximately 90% of our stores within one day. We are now taking a pause from opening DCs for a couple of years. Currently, we are finishing up our back-to-school season and over the next several weeks, we'll be converting the Now section of our stores to Halloween while preparing for the all-important Q4 holiday. We are excited about some of the cool new products we have found that offer extreme value to our customers and can't wait to share them with you.\n\nIn summary, as I said earlier, this year has proven more challenging than expected. We remain focused on playing offense and delivering our Triple-Double growth strategy: that is triple the number of stores by 2030 and approximately double the sales and earnings per share by 2025. We are committed to continued high growth throughout the organization with our teams focused on preparing our people, systems and infrastructure. Next year's new store openings represent a significant milestone over -- of over 200 for the first time.\n\nWe feel confident in our ability to open them with the same consistent results we have achieved in the past. In this environment, in addition to the product opportunities I already mentioned, we are starting to see some signs of potential dislocations in real estate and are ready to capitalize on these opportunities. Our growth and scale continues to benefit us and our customers as we continuously reinvest in products and keeping inventory fresh. We are a go-to retailer for our customers, providing the combination of extreme value in a fun shopping experience.\n\nWe believe as this inflationary environment continues and we near the all-important holiday season, value will become even more relevant as customers rely on us for amazing, affordable gifts and stocking stuffers to celebrate the season. With that, I will turn it over to Ken to review our financials in more detail. Ken?\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nThanks, Joel, and good afternoon, everyone. I will begin my remarks with a review of our second quarter results and then provide guidance for the third quarter and the full year. As Joel noted, the second quarter was more difficult than we expected. Our sales for the second quarter of 2022 increased 3.5% to $668.9 million from $646.6 million reported in the second quarter of 2021.\n\nComparable sales decreased by 5.8%, which was driven by a decrease in comp ticket of 4.3% and a comp transaction decrease of 1.7%. On a three-year geometric comp stack basis, second quarter sales increased 15%. Our average ticket remains strong, increasing over 20% in the second quarter as compared to the corresponding pre-pandemic period of 2019. We opened 27 new stores across 18 states in the second quarter compared to 34 new stores opened in the second quarter last year.\n\nWe ended the quarter with 1,252 stores, an increase of 131 stores or approximately 12%, versus 1,121 stores at the end of the second quarter of 2021. Operating margin was 8.4%, which declined approximately 500 basis points versus the second quarter of 2021 and which was relatively in line with our outlook where we expect to deleverage in both gross margin and SG&A, largely driven by the negative comp. This deleverage was offset in part by cost management. In comparison to a pre-pandemic period, this operating margin result was relatively flat to the second quarter of 2019.\n\nGross profit for the second quarter of 2022 was $228.5 million versus $230.3 million in the second quarter of 2021. As expected, gross margin decreased by approximately 150 basis points to 34.2%, primarily driven by occupancy deleverage on the negative comp, as well as higher freight expense versus last year. As a percentage of sales, SG&A for the second quarter of 2022 increased 350 basis points to 25.8%, primarily driven by higher store expenses, a planned increase in marketing spend and fixed cost deleverage on the negative comp. Our effective tax rate for the second quarter of 2022 was 26.3% compared to 23.8% in the second quarter of 2021.\n\nNet income for the second quarter of 2022 was $41.3 million versus net income of $64.8 million last year. Earnings per diluted share for the second quarter was $0.74 compared to last year's earnings per diluted share of $1.15. We ended the second quarter with $272 million in cash, cash equivalents and investments and no debt, including nothing outstanding on our $225 million line of credit. Inventory at the end of the second quarter was $569 million, as compared to $347 million at the end of the second quarter last year.\n\nAverage inventory on a per-store basis increased approximately 47% versus the second quarter last year, while average total units on a per-store basis increased approximately 28% year over year. The increase was driven by the planned acceleration of merchandise deliveries and higher inbound freight costs versus last year. Our logistics teams continue to do an excellent job managing the supply chain disruptions, and our buyers remain flexible and disciplined in their purchasing to adjust the customer demands and preferences, chase trends and capitalize on closeout opportunities. Overall, we are experiencing significant improvements in the supply chain environment versus the back half of last year.\n\nWe are pleased with the progress we have made in accelerating our fall merchandise receipts and believe we are well-positioned for our holiday selling season. We expect significantly improved in-stocks this year and for our average per-store inventory levels and year-over-year comparisons to moderate significantly as we move through the back half of this year. Now on to guidance. As we stated at our Investor Day earlier this year in March, we expected 2022 to be a unique year for several reasons: first, the lapping of significant government stimulus; second, the negative residual impacts of the pandemic, primarily on our supply chain and store openings; third, the ongoing pressures of inflation, especially fuel and food costs; and fourth, the cycling of a very strong year of multiple merchandise trends.\n\nThe impact of these factors on our business was greater than we had planned. As a result, we have updated our 2022 outlook. For the second half of the year, we are reducing sales by approximately $70 million at the midpoint of our guidance, which assumes an approximate negative 4% comp. On a three-year geometric comp stack basis, this sales estimate for the back half of the year is slightly lower than the results achieved in the first half.\n\nSpecifically for the third quarter, our guidance includes the following: opening approximately 45 new stores; sales of $600 million to $619 million; comps of between negative 7% to negative 9%; a 25% effective tax rate, which excludes the impact of share-based accounting; net income between $4 million and $11 million with diluted EPS of $0.08 to $0.19. At the midpoint of this guidance, we expect operating margin to decline approximately 540 basis points over last year due to deleverage of fixed expenses on the negative comp, higher store expenses and increased marketing expense, all offset in part by tighter cost control. About one-third of the deleverage is expected to be in gross margin and two-thirds in SG&A. As we look out further to the fourth quarter, our current outlook implies comps of negative low single digits.\n\nThe fourth quarter itself is unique because it is driven primarily by holiday gifting and stocking stuff for purchases. And with the current macro environment expected to continue, we believe that more than ever, customers will be looking for places to save money for holiday shopping. We are in a great position to be the go-to shopping destination. Specifically for the fourth quarter, we expect an improved inventory position and merchandise in-stocks versus the fourth quarter last year, an expanded Five Beyond assortment in more stores, and increased and more effective marketing.\n\nWe also assume operating margin expansion in the fourth quarter versus last year as the fixed cost-driven deleveraging gross margin and SG&A from the implied negative comp is more than offset by tighter cost management and expense reductions. Our first half performance, combined with this moderation in the second half outlook, reduces our full year guidance for sales at the midpoint by approximately $85 million or nearly 3%. For the full year of fiscal 2022, we now expect sales of $2.97 billion to $3.02 billion and comps in the range of negative 3% to negative 5%. This assumes we would end fiscal year 2022 with average unit volumes of approximately $2.4 million versus 2019's $2.2 million.\n\nWe expect operating margin for the full year of 11% at the midpoint of guidance, which represents a decrease of approximately 120 basis points from our prior guidance. The decline versus last year of approximately 230 basis points is driven primarily by deleverage on fixed costs and higher SG&A expenses from a more normalized marketing spend offset in part by cost management. We expect EPS in the range of $4.26 to $4.56, which represents a reduction from our prior guidance of approximately 13%. For fiscal 2022, we plan to spend approximately $235 million in gross capex, excluding tenant allowances, primarily for opening approximately 160 new stores, executing over 250 conversions to the new Five Beyond prototype, opening a new distribution center in Indiana, and investing in systems and infrastructure.\n\nFor other details related to our results, please refer to our earnings press release. In closing, as we navigate the near-term headwinds that are pressuring our performance, we continue to focus on our longer-term strategy and financial goals. We remain fully committed to delivering an amazing experience and exceptional value for our customers while maintaining the financial and cost discipline that has always been core to how we operate this business. That concludes our remarks.\n\nAnd with that, I'll turn it over to the operator to begin Q&A. Operator?\n\nOperator\n\nThank you. [Operator instructions] And our first question today will come from Edward Kelly with Wells Fargo. Please go ahead.\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nYeah, Hi. Good morning, everyone. I wanted to start my question really is on Q4 and the guidance for Q4. Holiday is always seems to be a bit tough to predict, and this year is probably not going to be any different obviously.\n\nBut as we think about -- we're using -- we're talking a lot about sort of three-year geometric trends. But when you go to Q4, you have four more selling days than you have in 2019. And I think if you look at guidance versus sort of '18, which maybe becomes more realistic, it does imply some deceleration there. So I'm just kind of curious as to your thoughts around how you thought about rebasing that guidance.\n\nYou mentioned the potential for some positive emerging drivers. That doesn't -- I'm not so sure how much of that's actually in your outlook so thoughts there. And ultimately, just trying to figure out how much around Q4 you've kind of derisked with the guidance because it does seem like it's quite a bit.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. Ed, let me -- just a couple of thoughts, and I'll turn it over to Ken to talk about it financially. But clearly, as we think about Q4 and especially coming off this last quarter, the last thing we wanted to do was speculate at all on any emerging trends. I think Ken laid out pretty nicely for you several bullets on what's different in Q4 this year over last year, things like better inventory position, marketing, you mentioned more days.\n\nSo those are all nice tailwinds that are in there. I think you've got some of the headwinds, the unknowns of macro things that we certainly talked about at length. And so you put it all together, and I think what you see in Q4 is us certainly calling out potential tailwinds emerging but not baking all those into the guidance. And Ken, maybe if you talk about it from a geometric stack, I think it all starts to make sense.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nYeah. Add to Joel's point, obviously, we're -- we focus on the things that we can control, right? And we talked about improved inventory, expanded Five Beyond assortment, better and more increased marketing. When you look at the macro piece, I think what we did, we kind of looked at the first half of the year now to see what's going on. And as I mentioned, when you look at the full back half, it's a geometric stack that's slightly less than we saw in the first half, and then we kind of break it out into Q3 and Q4.\n\nWe are seeing some things having the benefit of going through August and seeing some improvement there, and that's why we're guiding to the comps that we're guiding to for Q3. But to Joel's point, from a macro perspective, I mean, obviously, there's still some uncertainty down there. So we feel it was appropriate to put forward the negative low single-digit comps, which when you push that into a geometric stack comp that you'd mentioned there, it kind of puts us in line with where we landed for Q2. And we felt that was appropriate in terms of a guidance, especially at this point in the year, specifically around Q4.\n\nJoel Anderson -- President and Chief Executive Officer\n\nThanks, Ed.\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nAnd our next question will come from Paul Lejuez with Citi. Please go ahead.\n\nKelly Crago -- Citi -- Analyst\n\nHi, guys. This is Kelly on for Paul. Thank you for taking our question. I'm just curious if you could elaborate on your comments around getting a bit more opportunistic for some closeout buys.\n\nWhat are you seeing out there in the market? Which categories stand to benefit? And is it showing up mostly in 4Q? And then just on that same line, just curious if the margin profile looks different than your planned business? Thanks.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. Thanks, Kelly. Look, I called out the opportunistic buys closeout less because of the materiality and more because it is something we haven't really seen in the last couple of years. So the fact that they are starting to emerge and our buyers are getting more inbound calls, it's just, I think, a positive to some opportunities we're going to have to really showcase value even more than we had originally planned.\n\nIt's still though -- I mean our business is very different than where we started 20 years ago as most of our buys are planned, and it will be still in the low single digits of the overall buy. And then, Ken, any commentary on margin?\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nYeah. Kelly, I don't know if that was around -- you were talking about merch margin or overall margins. But from a merch margin perspective, we feel that we're going to have and expect to have healthy merch margins going into Q4. And then we did call out, I know it's unusual, especially on the negative low single-digit comps to be seeing the -- what I'm calling out as operating margin expansion for the fourth quarter.\n\nBut that's solely due to the work that we've done internally here to adjust our cost structure and really go after tighter cost controls and expense reductions. And the majority of those are taking place in the fourth quarter. We started those a little bit later in the year. So we're really going to see the benefit in the back half, especially in the fourth quarter.\n\nAnd the magnitude of those are going to more than offset any type of deleverage that's going to happen on fixed costs due to that negative low single-digit comp.\n\nJoel Anderson -- President and Chief Executive Officer\n\nThanks, Kelly.\n\nOperator\n\nAnd our next question will come from Matt Boss with J.P. Morgan. Please go ahead.\n\nMatt Boss -- J.P. Morgan -- Analyst\n\nGreat. Thanks. So Joel, you called 2022 as unique, which obviously has proved pretty spot on. I guess larger picture, does anything you've seen this year alter the components of that multiyear Triple-Double plan? And then, Ken, to your point, the 3Q comp guide, it does stand 400 basis points better than the second quarter on that geometric stack.\n\nSo could you elaborate on improvement that you've seen in August that supports the guide?\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. Thanks, Matt. Yeah, we certainly called out, knew that 2022 was going to be unique. We talked about it at the March investor call.\n\nClearly, as we have now played through six months since then, it's proven out to be even more unique than we originally thought. As far as the long term goes, you put unique aside, we are still very confident in our long-term store growth opportunity and with that, the profit profile. I called out in today's remarks specifically some examples of that: the growth in our new stores starting to accelerate, the incredible progress we've made in the last six months on moving from strategy to execution around conversions, to the new Beyond prototype being over 250 for this year. I think BOPIS is another example that we're not sitting back anymore playing defense.\n\nWe're moving ahead with IT system rollouts, and BOPIS is one example of that. So really excited to continue to innovate. And clearly, this guide was meant to be a real focus on '22 -- all our efforts around '22. But behind the scenes, the teams are working and really accomplished a lot to maintain our Triple-Double.\n\nAnd at this point in time, we don't see any reason to be backing off of our long-term strategy.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nAnd then, Matt, I think the second part of that question was around the confidence in the guide for Q3 and a little discussion around August.\n\nJoel Anderson -- President and Chief Executive Officer\n\nAcceleration in geos versus Q2.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nCorrect. Yes. So -- and you're right, it's accelerating about 400 basis points over Q2. But just to go back to Q2, we did see a deceleration, right, coming off of our guidance and then in June and July.\n\nAnd then now that we have August in the rearview mirror, we have seen an increase in the geos that are comparable to what we saw back in the beginning of Q2. And August performance is in line with our comp guide. And the other piece out there is when you look at last year, we are up against the larger impact of trend items happened early in Q3. So that was in August.\n\nSo when you put all that together, we feel good about the guidance that we're putting forward for Q3.\n\nJoel Anderson -- President and Chief Executive Officer\n\nThanks, Matt.\n\nOperator\n\nAnd our next question will come from Michael Lasser with UBS. Please go ahead.\n\nMichael Lasser -- UBS -- Analyst\n\nGood evening. Thanks a lot for taking my question. Looking past the next couple of quarters into 2023, a, will the business be at a point where it can start to comp again, especially in light of having four or five Beyond stores, a cleaner macro environment who knows? And then two, even if the business is flat next year, given some of the cost reduction initiatives along with all the large increase in new stores, is it possible that Five Below could experience margin expansion, like I said, even on a flat comp, just considering that this year is on pace to have an 11% operating margin versus an 11.8% operating margin in 2019, and there's $1 billion of increased sales this year versus two years ago?\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. Michael, I think what you're asking is a really good question. I don't think this is the call to go speculate on giving you guidance for 2023. But if you read into some of my commentary, especially around the conversions will start to be both traffic and comp contributors.\n\nAnd the commentary we just had around Q4 and you can already start to see from a comps perspective, let's put geos aside for a second here, starting to see the comps start to accelerate again for us. And I don't think any of us are looking at '23 and beyond is not being back to positive comps, let's forget even flat. But everything is pointing toward a cleaner environment, as the old saying that sales cure all, but it's also true that sales exposes things. And I think in some ways, it's helped to make us a leaner organization.\n\nKen commented on a lot of costs we've taken out of the business. And those will benefit us as we go into '23, start to open over 200 stores. You really will leverage your fixed costs significantly. So I think what you're implying is all directionally correct.\n\nI just am not prepared here to sit and give you a concrete forecast for '23. But you're thinking about it the right way.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nYes. Just, Michael, to add to that, I mean we -- over the years, you've heard us reduce our leverage point in comp. I mean you're really asking the question can we lever on a flat comp. And to Joel's point, I mean, let's get through this year and we'll look at it.\n\nBut we will continue and carry through those cost efficiencies that we've looked at and found this year into next year. And obviously, we had the new store growth that we're talking about. And then the opportunities for comp in some of the various areas, including the Five Beyond conversions. But more to come on that as we kind of get through this year and then we get into beginning of next year to provide some guidance.\n\nJoel Anderson -- President and Chief Executive Officer\n\nThanks, Michael.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nThanks, Michael.\n\nOperator\n\nAnd our next question will come from Simeon Gutman with Morgan Stanley. Please go ahead.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nGood afternoon, Joel and Ken. Kind of two follow-ups. The first on the fourth quarter. Would you say whether the ticket benefit that you're seeing in the second quarter -- I think you cited the 20% versus 19%.\n\nDoes that stay the same through the fourth? Or maybe just share the ticket traffic assumption through the fourth quarter. And it feels like it would moderate given that last year's fourth quarter was helped by ticket or merchandising initiatives, which assumes traffic gets better, which it seems consistent with some of Joel's commentary. So that's the first question, just any more detail on traffic ticket for the fourth. And then to the last question, I think you answered it, that expenses that you save this year that becomes more muscle to the company.\n\nIt's not that there's a recapture or a step back up so that these incrementals that you're doing in the back half of the year, they could set the precedent and be sustained into next year.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nThanks, Simeon. I'll try that. So the first part of your question around traffic and ticket, again, kind of we're out ahead of a little bit trying to predict where that's going to come in Q4. But I think looking back really helps us predict go forward.\n\nAnd that's one of the things that if you've heard, we've maintained that improvement in our ticket when you go back to pre-pandemic levels back to 2019, I mean we've consistently been 20% and above, and we also saw that again in Q2. And given some of the things that are inside that, we -- I would expect us to continue along that path as we move through this year and potentially in the fourth quarter. There could be some opportunities, you're right, in transactions. I mean it has been down consistently since we've reopened post pandemic.\n\nLet's not forget we are down in terms of hours when you look at us versus 2019. And we'll continue to look at what the optimal store operating hours are as we move forward. And then your question about the expenses, yeah, those are -- the things that we've come across here are those reductions in efficiencies. We'll definitely carry that into the future.\n\nI don't view those in total as being kind of one-off for this year. Those are things we'll carry on into the future.\n\nJoel Anderson -- President and Chief Executive Officer\n\nThanks, Simeon.\n\nOperator\n\nAnd our next question will come from Chuck Grom with Gordon Haskett. Please go ahead.\n\nChuck Grom -- Gordon Haskett -- Analyst\n\nThanks. Good afternoon, guys. When we look at new store productivity over the past quarters, it's averaged around 76%, 77%, give or take. It's much lower than the pre-COVID run rate that you guys had formally run close to -- almost close to 100% in many quarters.\n\nWhen you look at the fleet openings, I'm curious if you're seeing any greater uptick in cannibalization? Are new markets still successful. It sounds like it is. I'm just trying to understand why the NSP has been compressing.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nYeah. Hi, Chuck, you're right. It is kind of averaging -- when you look at it on an adjusted basis, it's averaging around 80% as we kind of look back over the last handful of quarters. There's a couple of things going on there, especially post-pandemic, right, where we kind of pulled back on grand opening marketing and inventory levels and things like that.\n\nWhere the supply chain got really tight, we favored existing stores versus new stores. So that probably drove that reduction in productivity versus what we saw in pre-pandemic periods. I think you mentioned cannibalization. That's been relatively consistent from our calculations.\n\nIt did increase over the last couple of years, and we called that out. We expected that closer to about 100 basis points. That's embedded in our guide. And in terms of just overall performance, we continue to be really pleased with the new stores.\n\nI mean Joel called out, again, every quarter, we run across stores that have records for openings. And we had three stores. And it was great to see those stores come out throughout the country, right, one in California, Texas and New York. So overall, really pleased with where new store performance is.\n\nJoel Anderson -- President and Chief Executive Officer\n\nThanks, Chuck.\n\nOperator\n\nAnd our next question will come from Scot Ciccarelli with Truist Securities. Please go ahead.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nHey, guys. It's Scot Ciccarelli. Can you provide any more color on the magnitude of the inventory increase and specifically, Ken, I know you provide some color, but kind of where do you think the year will end? And does that become a good kind of go-forward figure wherever you end this calendar year?\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nYeah. Thanks, Scot. As we've mentioned on prior calls, we're actually really pleased with where we've been with our inventory levels post pandemic. I think that was an opportunity for us to even get tighter and leaner and operate really better from an inventory perspective.\n\nAnd we've been able to continue that. You are seeing a high number at the end of the second quarter, but that is because we've advanced deliveries because we wanted to make sure we got out ahead of any supply chain disruption. So our point was that we'd rather have it in our distribution center than somewhere else. So we really pushed that.\n\nAnd I did call out kind of cost versus units, which shows you that a chunk of that increase is due to the increase in freight costs because that's embedded in that number. The other piece as you move forward, you've -- what my expectations are that those numbers are going to moderate as we go into the end of Q3 and even down into Q4. I think you'll see significant moderation even getting closer to like flatter year-over-year numbers as we get down to the end of the year. And then my gut is that we'll be able to continue to perform that way as we move forward.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. I think the important thing on that, Ken, is -- and I called it out in my prepared remarks, this was intentional on our part and it was strategic. I think when we sat back, let's call it, April, May a year ago, and you're planning out when your goods are going to come in for fourth quarter, I don't think anybody that far back expected the severe and unprecedented backlog that went on for months and months and months. And so as we started thinking about this year and making sure we don't have a repeat of that, sitting with a balance sheet with no debt, we were able to make the decision to accelerate.\n\nAnd then you add in the freight and fuel that Ken just talked about it. You see most of it. It's a large increase in transit as most of our holiday stuff was on the water by the time Q2 ends. But thanks, Scot.\n\nGreat question.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nThanks, Scot.\n\nOperator\n\nAnd our next question will come from Jeremy Hamblin with Craig-Hallum Capital Group. Please go ahead.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nThanks. I wanted to ask about what you're seeing from a demographic perspective. What kind of color you have on performance across geographies? But then also what kind of color you have given the softness that you've seen and slowdowns since kind of going back to end of March in the Investor Day? Are you able to track or have a better sense of whether or not it's -- this change, I think, in trends overall, is that really coming from the bottom 50% of income earners and your customers? How much data do you have around that? And how much is it changing how you're thinking about inventory presentation for Q4?\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. Jeremy, good question. Look, we track all our stores and assign them a demographic profile. I would tell you, geographically, for the most part, it's a pretty tight range of, in this case, a decline in comp across the board.\n\nAnd then from a household income, we did see more of a compression in our low-income demographics than in our higher end, and I don't think that should surprise people. I think as I called out in my prepared remarks, as you get into fourth quarter, though, that kind of becomes our needs quarter as opposed to, right now, we're living mostly in the wants business. We did call out how our needs categories outperformed. But our whole box becomes a needs as people think about the holiday and they think about needing to fulfill Christmas gifts and Hanukkah and celebrating the holidays with their families, we become more of a go-to.\n\nSo I think there is one where we're not looking at changing presentation. We do have the capabilities with our inventory teams that we will refill stores based on sell-through. And so in the cases where stores are selling better, we will certainly replenish to that as we have a good amount held back in the DCs. It's not all shipped out upfront.\n\nSo we can make decisions closer to real time as the quarter plays out. Hopefully, that gives you some look into the demographics a little bit.\n\nOperator\n\nAnd our next question will come from John Heinbockel with Guggenheim. Please go ahead.\n\nJohn Heinbockel -- Guggenheim Securities -- Analyst\n\nSo guys, two quick things. Number one, I mean this is a holiday or fourth quarter that we haven't seen in a very long time. How do you think tactically, right, about tweaking what you do in terms of marketing, store operating hours, things like that, right, to drive a little bit better brand awareness? And then secondly, right, because this environment will probably persist into '23, how is Michael thinking about merchandise content for '23 at different price points, right? Because I know he does mandate, right, that the buyers find stuff at $1, $2, not just Five Beyond. Is the thought on '23 changing in terms of content?\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. Look, on Q4, I don't want to give away my whole holiday playbook yet, John. But I can tell you, I feel really good about it. The one or two things I would say is we do think it will be earlier.\n\nWe do think we've got to be prepared sooner, and so you're going to see some of that. And I think I also called out a number of times, I think value becomes -- in the past, I think I've always said value is important. I think the words I would use now is relevant. And you're absolutely right.\n\nYou have to go back to '07, '08 since we really saw a recession of -- that we can point back to. And of course, with inflation, you got to go back even further. But as we think back to '07, '08 and what happened there, the relevancy of value really came into play. So you can bet our messaging will probably tilt a little bit away from WOW and more to value as we really focus in and be sharp on our price points to get that value message across.\n\nAnd as far as '23 goes, it -- you're -- we believe you. We think it does continue in to '23. We always pick up new customers at holiday time. I think that will bode well for us going into '23 and beyond.\n\nAnd from Michael's perspective, it's again going to be sharp on value, really probably a refocus and look at our $1, $2 price points and also on our version of consumables. So that's kind of a couple of insights into it, John. Thanks.\n\nOperator\n\nAnd our next question will come from Michael Montani with Evercore ISI. Please go ahead.\n\nMichael Montani -- Evercore ISI -- Analyst\n\nYeah. Good evening. Thanks for taking the questions. Just wanted to ask, first off, if I could, can you just remind us about the tailwind that you see the comps from some of the store remodels, kind of what the cadence is there and then also the capex cost to put against that?\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. Look, it's a little too early to quantify those, Michael, as we've really just started ramping those up here in the last 30 days. We did call out at Investor Day, and there's no reason to deviate from it that remodels for us kind of in the mid-single-digit range. And then, Ken, on capex?\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nYeah. Michael, I mean, depending on the type of conversion that's out there for a store, whether it's a full on conversion going from a vintage store or it's just kind of what we would call a plus-up from an existing fresh store, I mean it can vary. If it's a small plus-up, you're probably talking $40,000, $50,000. If it's a full-on conversion of an older store, it's going to cost as much as an existing store really.\n\nIt's the same thing at the end of the day.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. So $100,000.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nYeah.\n\nJoel Anderson -- President and Chief Executive Officer\n\nThank you, Michael.\n\nOperator\n\nOur next question will come from Brad Thomas with KeyBanc Capital Markets. Please go ahead.\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nHi, good afternoon. I wanted to comment the holiday question from the perspective of some of your higher-price-point items from the Five Beyond perspective. And I was hoping, Joel, you could talk a little bit more about how much more assortment you're going to have this year, how many more stores are going to have that expanded selection, and any more quantification you'd be willing to give about how much of a potential comp driver that might be for you in the fourth quarter? Thanks.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. Look, I think as far as the comp driver at this point in time, Brad, I think it's embedded in the guide we gave you. And I think as we get more clarity as some of these are starting to come online to the tune of hundreds of them by the time we get into fourth quarter, we'll give some more insight into that. But it's roughly a doubling of SKUs.\n\nWe've seen a very positive reaction. Even in these really tough economic times, we have not seen a slowdown in it. And I think that points to the question I was asked answering to John a few minutes ago that value is becoming more relevant. And the -- as our customer walks in our stores, even though it's over $5, they recognize the value, and that's just as important as the $1 to $5 having to deliver value.\n\nSo that's kind of the early insights and looks into it. But I think the final thing is, you can remember, it's also -- that Five Beyond is newness, especially 200 -- plus 250 this year. It's newness they've never seen before. So you've got extreme value at the $1 to $5.\n\nYou've got newness and value in the Five Beyond. And we believe that's going to drive traffic, and we've outlined kind of the comp thoughts as we focus on Q4 here. Thanks, Brad.\n\nOperator\n\nAnd our next question will come from Joe Feldman with Telsey Advisory. Please go ahead.\n\nJoe Feldman -- Telsey Advisory -- Analyst\n\nYeah. Thanks, guys. Want to take a different question about the growth in the go forward. With regard to the real estate, you had mentioned seeing some more dislocation.\n\nAnd at the risk of giving up your sources or commenting too much, I was just curious where you're seeing that? Like are you seeing -- does that mean you're seeing better locations available or companies closing stores, so therefore, creating new opportunities for you?\n\nJoel Anderson -- President and Chief Executive Officer\n\nThanks, Joe. Yeah, I'm not going to give up all my sources. But publicly, I think even several hours ago, Bed Bath & Beyond just announced 150 closures. So for the last decade, retailers have ebbed and flowed, and we really haven't seen that dislocation in the last two years like we have in the past.\n\nSo part of -- a significant part of our growth strategy is not about greenfield. And I think the dislocation of retailers will help us only accelerate, and that's what we're starting to see and hence, why we've actually started to give you some insight into 2023, which is probably the earliest we've ever done some of that. And you got to remember, and I think we outlined at the Investor Day, our densification strategy going into detail about what we've done in Philadelphia, and that will continue to get easier as some of these dislocations start to emerge. But the specifics as to what our real estate team is working on, and I can tell you the pipeline is starting to grow.\n\nThanks, Joe.\n\nOperator\n\nAnd our next question will come from Jason Haas with Bank of America. Please go ahead.\n\nJason Haas -- Bank of America Merrill Lynch -- Analyst\n\nHey, good afternoon, and thanks for taking my question. Joe, could you elaborate more on your comment that you're seeing some of the trends that were successful last year start to wane. I'm curious if that was a reference to some of the sensory toys or anything else. And then I'm also curious, it seems like the Squishmallows are still pretty popular.\n\nI'm not sure if you'd be able to quantify any sense for how much -- how meaningful that is to comps right now just given the concern that that trend may wane in the future?\n\nJoel Anderson -- President and Chief Executive Officer\n\nSure. Well, I believe in my prepared remarks, I did call out Squish and you did hear an absence of me talking about poppers or sensory. So you can deduce who's waning and who's not there. But that's the nature of something that Five Below probably accelerates in, identifying trends and then getting out of them.\n\nAnd it is kind of the nature of trends, they come and they go. Trends are always a part of our business. And the fact that poppers and sensories have started to moderate, it's not unusual to us. But Squish, on the other hand, will probably continue to be with us at least through the balance of this year.\n\nAnd we -- teams have done a great job with that. We've created the Squish events on Sundays, still continue, especially when there's new Squish to see lines in the stores. And that's just the -- a great example of -- Five Below has been known as the place to go when a trend starts to emerge. We're starting to see a couple of others.\n\nI don't know if they're going to be big or little. At this point in time, I'm not in the position I want to talk about it publicly. But that's -- we just got a great merchant team, and they're constantly finding new things in there in the market that plays out on the newness and fresh. Thanks.\n\nAppreciate it, Jason.\n\nOperator\n\nAnd our next question will come from David Bellinger with MKM Partners. Please go ahead.\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nHey, thanks for the question. So you mentioned the areas of the store that performed well in Q2. So where did you see the largest deviation versus your plan on the downside? How are inventories in those categories? And also, has the category makeup shifted with trends improving somewhat into August? Just any other detail on what's changing early into Q3 up would be helpful.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. Look, I think in this case, what I would say, it's not who more outperformed. I would say, other than the ones I called out, we pretty much saw an across-the-board decline in the back half of Q2 obviously missing our sales guide. But it was the trends in food and consumables and all those I called out that accelerated.\n\nAnd I think that's what gave us confidence. It wasn't something that we did internally there to really turn off our customer. It was truly the macro environment, and I don't need to repeat all those. I talked about them a number of times that turned around the -- or why the business ended in a shortfall.\n\nWe are starting to see the moderation. I'm not worried about inventory. Anything that we were carrying over in the third quarter will just go away in third quarter. We're not expecting any big markdown or anything like that, David.\n\nThank you.\n\nOperator\n\nAnd our next question will come from Anthony Chukumba with Loop Capital. Please go ahead.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nThank you so much for squeezing me in. I have a little bit of a longer-term question. You have a deep-pocketed competitor in Dollar General that has this new concept they're rolling out pOpshelf. And I guess two questions but really sort of one question.\n\nI mean how do you think about the -- how their merchandise assortment compares to your merchandise assortment and the store experience? And then does the fact that they're playing to over time open 1,000 of stores, does it change your view at all in terms of your long-term store potential? Thank you.\n\nJoel Anderson -- President and Chief Executive Officer\n\nThanks, Anthony. I'll take the second part of that first. No, it doesn't change our outlook at all. I'm very much aware of pOpshelf, like any other retail arm and competition and other retailers all the time.\n\nYou specifically asked about the merch assortment. I'll tell you, to me, it feels much more like a home goods than it does a Five Below, and it caters to a different age segment than we do. So the fact that we now have some stores in our same centers and we haven't seen any impact at all, in fact, in some cases, there might even be some improvements, but it's a very small sample size because you're just -- you're driving more footsteps. We always want a vibrant center and a center that drives -- any store that drives footsteps is good for us.\n\nSo -- but they're largely in what I would call the home goods categories, and so very different and we target teens. Thanks, Anthony. I think we've got time for one more call.\n\nOperator\n\nThat will -- that's all unless you would like to ask a question, please press star then one.\n\nJoel Anderson -- President and Chief Executive Officer\n\nI don't want to ask any questions, operator. But -- so listen, I'll just finish up, and I appreciate everybody joining us today. I truly believe Five Below is an innovative and resilient retailer with a long runway for growth. A lot of your questions were about growth.\n\nWe are still focused on that. We've got an industry-leading new store payback model and a strong balance sheet. In these current economic times, we believe that value is going to be even more relevant. We talked about that several times today.\n\nWe are going to continue to deliver a compelling trend-right merchandise at incredible value. So I want to thank all of our teams. Most importantly, they've just done an amazing job through some really tough times here. Their continued hard work is really paying off and making Five Below a great company and brand.\n\nWe look forward to speaking to all of you again after Thanksgiving. Thank you and have a great night.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChristiane Pelz -- Vice President, Investor Relations\n\nJoel Anderson -- President and Chief Executive Officer\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nKelly Crago -- Citi -- Analyst\n\nMatt Boss -- J.P. Morgan -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nChuck Grom -- Gordon Haskett -- Analyst\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nJohn Heinbockel -- Guggenheim Securities -- Analyst\n\nMichael Montani -- Evercore ISI -- Analyst\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nJoe Feldman -- Telsey Advisory -- Analyst\n\nJason Haas -- Bank of America Merrill Lynch -- Analyst\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nMore FIVE analysis\n\nAll earnings call transcripts"
}