{
  "companyName": "Paycom Software",
  "companyTicker": "PAYC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/paycom-software-payc-q3-2022-earnings-call-transcr/",
  "content": "Paycom Software (PAYC -0.50%)\nQ3 2022 Earnings Call\nNov 01, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. Thank you for attending today's Paycom Software third quarter 2022 quarterly results. My name is Hannah, and I will be your moderator for today's call. [Operator instructions] I would now like to pass the conference over to our host, James Samford, head of investor relations.\n\nPlease go ahead.\n\nJames Samford -- Head of Investor Relations\n\nThank you, and welcome to Paycom's third quarter 2022 earnings conference call. Certain statements made on this call that are not historical facts, including those related to our future plans, objectives and expected performance, are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements represent our outlook only as of the date of this conference call. While we believe any forward-looking statements made on this call are reasonable, actual results may differ materially because the statements are based on our current expectations and subject to risks and uncertainties.\n\nThese risks and uncertainties are discussed in our filings with the SEC, including our most recent annual report on Form 10-K. You should refer to and consider these factors when relying on such forward-looking information. Any forward-looking statement made speaks only as of the date on which it is made, and we do not undertake and expressly disclaim any obligation to update or alter our forward-looking statements, whether as a result of new information, future events or otherwise, except as required by applicable law. Also during today's call, we will refer to certain non-GAAP financial measures, including adjusted EBITDA, non-GAAP net income, adjusted gross profit, adjusted gross margin and certain adjusted expenses.\n\nWe use these non-GAAP financial measures to review and assess our performance and for planning purposes. A reconciliation schedule showing GAAP versus non-GAAP results is included in the press release that we issued after the close of the market today and is available on our website at investors.paycom.com And now I'll turn the call over to Chad Richison, Paycom's president and chief executive officer. Chad?\n\nChad Richison -- President and Chief Executive Officer\n\nThanks, James, and thank you to everyone joining our call today. We delivered another very strong quarter with a focus on high-quality revenue growth that produces world-class margins. I'll spend a few minutes on the highlights and then turn it over to Craig to review our financials and our guidance, and then we'll take questions. Our third quarter 2022 revenue of approximately $334 million came in very strong, up 30% year over year, with rapid recurring revenue growth driven by new business sales.\n\nDemand for self-service solutions that enable employees to interact directly with their data continues to be strong, and feedback on self-service payroll remains very positive. At the center of our automation strategy is BETI, which is how businesses and their employees win in payroll. BETI is the future of payroll, and already nearly half of our clients have embraced self-service payroll. Our go-to-market strategy includes 54 outside sales teams that focus on penetrating their respective territories.\n\nAnd we augment their sales efforts with marketing and advertising that drive lead volumes, brand awareness and to call to action. Our efforts are producing strong demo leads and our new brand campaign is driving strong recognition across our target market range. We are also seeing a surge in organic lead referrals coming directly from employees. As more employees experienced BETI and Paycom's comprehensive employee self-service solutions, many are seeking to bring us into the current workplace.\n\nJust like in the consumer world, employees don't want to go backwards in technology. And with Paycom, employees get the best HCM user experience and the most control over their data interactions. Employee users are becoming Paycom advocates. And when they get promoted in their current position or move on to a new organization, they are becoming strong influencers.\n\nWe have a long runway to go, and our multifaceted go-to-market strategy should help deliver rapid new business growth for many years to come. To sum up, we are delivering high-quality profitable revenue growth. Based on our strong financial results to date and expectations for the remainder of the year, achievement of our full year guidance for 30% revenue growth and 41% adjusted EBITDA margin puts us back into the pre-pandemic Rule of 70. Our differentiated product strategy focused on employee experience and self-service payroll is producing outstanding fundamentals with accelerating revenue growth in 2022, expanding adjusted EBITDA margins and strong cash flows.\n\nI want to thank our employees for their focus and commitment to Paycom. With that, I'll turn the call over to Craig for a review of our financials and guidance. Craig?\n\nCraig Boelte -- Chief Financial Officer\n\nThanks, Chad. Before I review our third quarter and our outlook for the fourth quarter and full year 2022, I would like to remind everyone that my comments related to certain financial measures will be on a non-GAAP basis. Third quarter 2022 results were very strong, with total revenues of $334.2 million, representing growth of 30% over the comparable prior year period. Our revenue growth is being fueled by strong demand for our differentiated solution and strong new business wins.\n\nWithin total revenues, recurring revenue was $328.2 million for the third quarter, representing 98% of total revenues and growing 31% from the comparable prior year period. Total adjusted gross profit for the third quarter was $280.5 million, representing an adjusted gross margin of 83.9%. Our focus on high-quality revenue produces world-class margins, and we remain on target to achieve strong full year adjusted gross margins of approximately 85%. Adjusted sales and marketing expense for the third quarter of 2022 was $85.8 million or 25.7% of revenues compared to 25.9% of revenues in the prior year period.\n\nAdjusted R&D expense was $37.3 million in the third quarter of 2022 or 11.2% of total revenues. Adjusted total R&D costs, including the capitalized portion, were $52 million in the third quarter, compared to $40.7 million in the prior year period. Our investments in sales and marketing and innovation are fueling our market share gains, and we plan to continue to invest in these areas to drive our future growth. Adjusted EBITDA was $126 million in the third quarter of 2022 or 37.7% of total revenues compared to $89.7 million in the prior year or 35% of total revenues.\n\nI am pleased with the 270 basis points of year over year adjusted EBITDA margin expansion that we saw in the quarter, which reflects the strength of our business model and flow-through of high-margin revenue upside. GAAP net income for the third quarter was $52.2 million or $0.90 per diluted share versus $30.4 million or $0.52 per diluted share in the prior year period based on approximately 58 million shares. Non-GAAP net income for the third quarter of 2022 was $73.4 million or $1.27 per diluted share versus $53.6 million or $0.92 per diluted share in the prior year period. For 2022, we anticipate our full year effective income tax rate to be approximately 28% on a GAAP basis.\n\nTurning to the balance sheet. We ended the quarter with cash and cash equivalents of approximately $317 million and total debt of $29 million. The average daily balance of funds held on behalf of clients was approximately $1.85 billion in the third quarter of 2022. Now let me turn to guidance.\n\nWith our very strong third quarter and the strength of our recurring revenue model, we are raising our full year 2022 guidance. We now expect revenue in the range of $1.371 billion to $1.373 billion or 30% year-over-year growth at the midpoint of the range. We expect adjusted EBITDA in the range of $560 million to $562 million, representing adjusted EBITDA margin of 41% at the midpoint of the range and a 120 basis point expansion from the prior year. For the fourth quarter of 2022, we expect total revenues in the range of $366 million to $368 million, representing a growth rate over the comparable prior year period of approximately 29% at the midpoint of the range.\n\nWe expect adjusted EBITDA for the fourth quarter in the range of $144 million to $146 million, representing an adjusted EBITDA margin of roughly 40% at the midpoint of the range. Combining our 2022 guidance for revenue growth with adjusted EBITDA margin, we are now expecting to exceed the Rule of 70, which is at least five points greater than the Rule of 65 we achieved in 2021. We have a long runway for continued high-margin revenue growth. Our fundamentals continue to improve throughout 2022, and we have strong momentum heading into 2023.\n\nWith that, we will open the line for questions. Operator?\n\nOperator\n\n[Operator instructions] Your first question is from the line of Raimo Lenschow with Barclays. Please proceed.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nHey, thank you and congrats on a great quarter in this kind of environment. Chad, one question for you, then a follow-up for Craig. In terms of what you're seeing in the market at the moment, like obviously, there's one company after the other that's kind of talked to that talk about like lean demands, things happening. You guys are spending out a little bit in terms of like not seeing anything.\n\nCan you just talk a little bit about like how that's possible in terms of like the -- is there a different nature of what's going on that people holding on to their employees for longer, so then you guys don't see it. Is it kind of the offering? But it looks like it's more the [inaudible] space. So that's the first question. Then for Craig, any comments on the operating cash flow because that one number that came in lower than the model.\n\nSo I'm sure there's something going on there, would be great to hear. Congrats again.\n\nChad Richison -- President and Chief Executive Officer\n\nSure. I mean I'll take the first one. And I would say, first, I mean, the hiring market is still a little tight, not like it was. I mean I would say there's been a little softening in hiring as far as it shifting maybe more into an employer's market.\n\nI would still say that we're not there yet. I mean, for us, though, as far as moving deals around, I mean, moving deals forward, I mean, September and October were huge book sales months for us. And as a reminder, I mean, we only have 5% of the TAM. I mean we reported 33,800 clients at the end of last year.\n\nOur two largest competitors have a combined 1.7 million clients. And we're out there making businesses more efficient by having their employees do the payrolls themselves. So we're not short on opportunity right now. We're making businesses more efficient, and I don't see why that would slow down for us as that's really within our control.\n\nCraig Boelte -- Chief Financial Officer\n\nYes. And I would say on the operating cash flow, Raimo, a couple of things impacted this third quarter. And most of it was really just timing between quarters, but we had some additional tax payments here in the third quarter. Typically, we get some benefits as it relates to discrete items on stock comp.\n\nAnd that was -- so that caused our rate to be slightly higher, so we made some additional payments here in the third quarter. And then the rest is really more just expenses and the timing of those expenses and when they're paid. So nothing really to point out other than those two items.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nOK. Thank you.\n\nCraig Boelte -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you, Mr. Winslow. The next question is from Samad Samana with Jefferies. Please proceed.\n\nSamad Samana -- Jefferies -- Analyst\n\nHey, good evening. Thanks for taking my questions. Chad, maybe first one for you. If I think about the growth, staying above 30% even against normalized comps, it's clearly impressive.\n\nAnd if I look at the fourth quarter guidance, it's actually a stronger seasonal uplift as your initial guidance for the fourth quarter than normal. So the plus 10%, if I go back and look last year, I think you said something closer to like plus 7%, plus 8%. I'm just curious if you can help us maybe think about what's driving the confidence in that kind of strong seasonal uptick in the December quarter? If there's anything you're seeing in terms of change in renewal timing? Or is it just float revenue? Just help us understand that.\n\nChad Richison -- President and Chief Executive Officer\n\nYes. I mean we've had a lot of strong starts as of late. And so those starts, when a deal starts in the quarter, that really does matter. The size of our beat for a quarter is really dictated by when a deal starts.\n\nIf we start that new business, that new client for us, if we start them at the beginning of the quarter, we receive 100% of the revenue billing for that client. If we start the deal at the end of the quarter, we might receive only 15% to 30% of the revenue billing for that client for that quarter. Then of course, all subsequent quarters, we receive 100%. So we do have pretty good visibility as we go quarter-to-quarter.\n\nAnd what would be driving the fourth quarter is, obviously, we benefited from some rate increases. We've talked about that as how those layer in. I mean as you've seen, those do start to layer in. But also just the strength of our new client conversions.\n\nWe're converting clients at a rapid pace. They're using the product right off the bat, which is helpful. And so we're having strong growth into the fourth quarter.\n\nSamad Samana -- Jefferies -- Analyst\n\nGreat. And then maybe just a quick follow-up. We're getting close to lapping the new sales offices. Just any update on how we should think about them? Are they fully -- what you would consider to be fully productive? Or is there still room for productivity gains there? And how does that maybe factoring into both what happened in the third quarter and then your forward outlook?\n\nChad Richison -- President and Chief Executive Officer\n\nYes. I mean, with the offices that we've opened up last year, and I'm going to call it five, even though we opened up one late in the first quarter of 2021. And then I think we opened up four at the very beginning of 2022 or this year. I mean all offices, just as a reminder, it takes offices 24 months to reach full maturity, and that's having eight reps with the backlog and pipeline having been out in the field.\n\nToday, I mean, I would say our best one probably has four reps on quota right now, as we sit here today as they've been going through and selling. And so that will continue to increase throughout next year for them, and then they will become mature offices and have the exact same quota as all of our other offices in 2023 -- or sorry, at the end of -- or sorry, at the beginning of -- at the end of 2023 for one of them, and then at the beginning of 2024 for the other four.\n\nSamad Samana -- Jefferies -- Analyst\n\nGreat. Appreciate that. Thanks again.\n\nOperator\n\nThank you, Mr. Samana. The next question is from Brad Reback from Stifel.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks very much. Chad, have you seen any noticeable change in hiring or retention at your customers?\n\nChad Richison -- President and Chief Executive Officer\n\nNo, I can't say that we've seen any changes. Now obviously, we're seeing changes just from when we're out there hiring people ourselves. And I think to some extent, that mimics a little bit of what our clients would be doing. I would say it's not as extreme as what you were facing maybe even nine months ago as far as the additional bonuses people would look to pay or the recruiting bonuses people might have.\n\nI think more and more companies are getting people back into the office at some level. I think there's less work from home and more hybrid, if not even more work at the office. So again, we're not seeing any slowdowns in our at bats or our lead generation. But I think a lot of that also has to do just with our size.\n\nI mean we only have 5% of the market. Most everyone is using a vendor. I mean the craziest thing someone can try to do is try to do payroll by themselves without using a business or a provider. So we're having success making businesses more efficient with a very differentiated go-to-market strategy that is very much resonating out there with both the workforce, as well as with those companies that we serve.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nThat's great. Thanks very much.\n\nOperator\n\nThe next question is from the line of Mark Macron with Baird. Please proceed.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nHey, good afternoon. Let me add my congratulations on the strong quarter. Craig, I was wondering if you could give us a feel for like what sort of rates you're able to get right now on the tax filing float and how that might look or what you're factoring in for the fourth quarter?\n\nCraig Boelte -- Chief Financial Officer\n\nYes. So Mark, what we've talked about what each 25 basis points represents. We haven't disclosed the exact rate that we're achieving. Those kind of layer in over time.\n\nBut for every 25 basis points, at some point, we should be getting close to $5 million on an annualized basis. But all of our investments are fairly short term. We're doing CDs overnights and then also commercial paper. So those are the types of investments, as well as some two-year treasuries.\n\nSo those are really the investments we're seeing now. And then that's kind of where we're at, at this point.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nGreat. And then Chad, you mentioned really strong bookings here in September and October. Wondering, given the normal cadence, what does that make you feel like for the fourth quarter and the strength that you're seeing in terms of the pipeline, in terms of the key fall selling season?\n\nChad Richison -- President and Chief Executive Officer\n\nYes. I mean I would say I mentioned those months because they're the most recent. I mean I can go back to August, July, and I can go back as far as we want. We've just been having strong book sales.\n\nI mean, for a long time, I mean even since the pandemic started, we're getting a lot of leads from just employees. I mean -- and we're getting leads from the largest companies in the world. I mean, 20 of their employees will hit our database in a one-month period of time. And so we're having strong leads.\n\nWe're able to turn those leads, some of them into -- to influencers as we go in there. But definitely, they become data points and information that we're able to gather as we go into clients. And we're finding that employees really like to use the product. Once we convert a client over onto our system -- and again, all new clients have BETI.\n\nThey're all using BETI. But within the very first two payrolls, over 50% of their employees are already doing their own payroll. So that is a differentiated strategy. They're not doing that with any other company.\n\nAnd as those employees either get promoted where they're at or move to other companies, they're bringing us into other businesses. And so we're having a lot of success with that. And I wouldn't expect that to slow down. I think if the labor market loosens up or even becomes tighter or what have you, it doesn't really change the value proposition of eliminating and reducing exposure and risk for the company as well as helping those employees so that they don't suffer the negative consequences associated with your pay not matching what you expected to be paid.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nIt's perfect. Thank you.\n\nChad Richison -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question is from Brian Schwartz with Oppenheimer. Please proceed.\n\nBrian Schwartz -- Oppenheimer and Company -- Analyst\n\nYeah, Hi. Thanks for taking my questions this afternoon and congratulations on an excellent quarter. Chad, in terms of deal sizes or maybe the cycles as the lead generations going through to your conversions, are you seeing any meaningful changes in those metrics?\n\nChad Richison -- President and Chief Executive Officer\n\nNo. Deal sizes have continued to go up. So deal sizes every year, I mean, I can talk about how we continue to be pulled further and further upmarket. As far as the cycles, I wouldn't say there's been any big change to that.\n\nAnd let's see the other part of your question. Yes. I mean deal sizes are going up. And the cycles, no meaningful changes there.\n\nBrian Schwartz -- Oppenheimer and Company -- Analyst\n\nYes, you got them both. And then Craig, one follow-up for you. The guidance for 4Q for -- on the EBITDA, on the margin, it's showing less improvement than what the business has done for the last two quarters. And I'm just wondering if there's any catch-up in spend or maybe you're increasing your advertising here in Q4.\n\nSo I was just wondering if you have any color on that target. Thanks.\n\nCraig Boelte -- Chief Financial Officer\n\nI would say kind of similar to how we've done in the past. We want to make sure we have the ability to spend as we see necessary as we're going into fourth quarter. and if we want to increase those ad spend, it gives us the ability to do that.\n\nBrian Schwartz -- Oppenheimer and Company -- Analyst\n\nThank you.\n\nOperator\n\nThank you, Mr. Schwartz. The next question is from Joshua Reilly with Needham. Please proceed.\n\nJoshua Reilly -- Needham and Company -- Analyst\n\nHi. Thanks for taking my questions. Nice job on the quarter here. If you look at your R&D strategy, I think you have something like 2019 modules today.\n\nIs the focus going forward more on adding new additional paid modules? Or is it more enhancing the current offerings? Or just maybe an update there?\n\nChad Richison -- President and Chief Executive Officer\n\nYes, I would say it's both. Our strategy, when it comes to both module creation and adoption, hasn't changed. Sometimes, we create additional features and functionality within a product, and we do not charge for those features and functionality. DDX is an example of that.\n\nManager on-the-Go is an example of that, and I could name many others. And then sometimes, we create a product that has a different level of return on investment. And then we do charge for those products. And it's those products that we call modules, and we do have 29 of them.\n\nSo as we move forward, you'll continue to see a healthy mix of both as it makes sense for us.\n\nJoshua Reilly -- Needham and Company -- Analyst\n\nGot it. Thank you. And then just to clarify. On the guidance for the fourth quarter, are you considering the 75 basis point rate increase that's likely to come out tomorrow in the current guidance? Thanks.\n\nCraig Boelte -- Chief Financial Officer\n\nYes. I mean any rate increase in November and December will have very little impact on our fourth quarter. Those layer in over time. So those would have a very small impact on our fourth quarter.\n\nJoshua Reilly -- Needham and Company -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you, Mr. Reilly. Our next question is from Steve Enders with Citi. Please proceed.\n\nUnknown speaker -- Citi -- Analyst\n\nThis is George on for Steve. I want to ask about competitive landscape. Have you noticed any changes in your running into deals, in particular, as you started to move up market?\n\nChad Richison -- President and Chief Executive Officer\n\nNot really. I would just say we're running into some competitors. We've always had the same players, whether we were -- now I would say we would have different players if we're talking sub-100 employee company or sub-50 employee company. But when you're talking about the 2,000 plus, which we've always gone from 50 to 2,000 even at IPO we talked about since 2014.\n\nSo when you're talking about 2,000 employees or more, it's been the same players for a very, very long time. And so I wouldn't say that we're running into new players. I would say, because we're continuing to move up market, we're seeing some of the old faces a little more.\n\nUnknown speaker -- Citi -- Analyst\n\nGot it. Thank you. And then you mentioned the brand marketing program in your prepared remarks. I'd love to hear a little more on kind of the successes you've seen there? And if there's any plans to expand that program? Thank you.\n\nChad Richison -- President and Chief Executive Officer\n\nYes. And so I think what anybody -- when someone's looking at our new branding and marketing, there's really been a big shift. I mean, we've gone from single database, employee usage-driven strategies with the DDX, the direct data exchange, where employees are making all of the changes, which I will update within the Paycom system. About 95% of all changes are made directly by the employee without any touch or duplicative effort by HR or payroll.\n\nAnd so what you've noticed though now is our brand marketing is shifting toward employees doing their own payroll. And in fact, the consequence is suffered by the employees when they don't do their own payroll. It's funny we'll go into a business and we'll ask the payroll person as we're going through the analysis, hey, is your check ever wrong? And the payroll person is often, no, if my check looks wrong, I fix it before payroll. And so why not roll that out to all the employees because they'll do the same thing.\n\nAnd so I would say before, we oftentimes might retreat to what we're comfortable with, with the app and the single database. Today, we're staying in the lane, which is oftentimes uncomfortable of helping employees as well as HR and payroll individuals realize the advantages that can be realized when employees actually do their own payroll.\n\nUnknown speaker -- Citi -- Analyst\n\nThank you for taking the questions.\n\nChad Richison -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. The next question is from the line of Siti Panigrahi with Mizuho. Please proceed.\n\nAlex Kim -- Mizuho Securities -- Analyst\n\nHI. This is Alex on behalf of Siti Panigrahi. I just wanted to ask how has the BETI adoption been trending for this quarter? Like what percent of BETI is your current clients? And what do you expect BETI revenue for FY '22? Or how has BETI performance done versus your initial expectations? And then I have a follow-up.\n\nChad Richison -- President and Chief Executive Officer\n\nYes. We're about 50% of all current clients are on BETI. And again, that's every client that's onboarded or had been sold since last July. They may not have onboarded right at July, but every client sold since last July is using BETI.\n\nAnd the trend in BETI is continuing to go up. I mean that's why we're getting so many leads from employees after they leave one company and go to another, Nobody does good going backwards in technology. You take an app off somebody's phone and ask them to do it the old way, it becomes very difficult for them. And so -- and it's unnecessary.\n\nAnd so BETI usage continues to go up. I already did talk about or did make mention earlier of the fact that new clients within the first payroll or so, you've got 50% of their employees are already doing their own payroll. And that continues to increase as clients continue to get better at using the product. And so -- and it's our strategy.\n\nI mean today, everything is about BETI. I mean I tell our salespeople all the time. Look, if you can't get someone to understand the benefits and value of BETI to their organization as well as the positive impact on their employees, I don't have anything else for you to sell. I mean, because everything else comes with that being the case already.\n\nAnd so it's not -- it's a strategy that we've been continuing to drive, and it's a strategy that really fits within the problems that are already inherent between employees having correct data and receiving correct pay from their employer.\n\nAlex Kim -- Mizuho Securities -- Analyst\n\nGot it. And I wanted to ask, with the rising inflation, have you been able to pass on price increases to your customers for your modules? And how does BETI pricing compare to your other modules?\n\nChad Richison -- President and Chief Executive Officer\n\nYes. I mean, BETI pricing it's a nominal fee. I would not say that BETI pricing compares in fee with our more substantial modules from that standpoint. Our first pricing adjustment ever as a company was in 2019.\n\nWe did talk about that in the future should we choose to do or make pricing adjustments, it would be based on ROI that we're able to deliver for the clients. As I mentioned in the past, sometimes, we develop product, and we do not create a module from that where we're billing. So I think there -- that as we've continued on, any time that we make the product more valuable, it only makes sense that we're able to share in the value that we've created through pricing adjustments.\n\nAlex Kim -- Mizuho Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question is from Bryan Bergin with Cowen. Please proceed.\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nHi guys. Good afternoon. I wanted to start with margin. Can you comment on the uptick in 3Q adjusted opex levels? It sounds like there's no change to your 85% gross margin target for the year.\n\nI'm just curious what added leverage you're going to get in 4Q to achieve that.\n\nCraig Boelte -- Chief Financial Officer\n\nYes, I would say in Q4, a couple of things that have impacted the gross margin, I guess, would be the hiring that we've had. In the past, we've continued to increase our operations group to be able to catch the revenue that we're bringing on toward the end of the year and next year. So that's something that's had a small impact on the gross margin as well as depreciation. We brought the data center in Dallas online.\n\nSo that depreciation is impacting that gross margin. And then the levers we pull, we always look for efficiencies in the model. So we'll continue throughout the rest of the year to kind of look at where we can maybe have some efficiencies but get -- continue as a high-growth company. We want to make sure we're investing for the future.\n\nChad Richison -- President and Chief Executive Officer\n\nWe've made statements in the past about if our gross margin is up way too high, it oftentimes shows that we could be a little understaffed in operations and service. And so oftentimes, when you see it change a little bit toward the downside, it means that we're hiring ahead of the growth. And then as that growth begins to come in and those people take on full load clients, we start to get some of that back.\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nOK. That makes sense. I guess a follow-up just off of that, would you say that you're fully staffed now across those different parts of the organization? And then just a follow-up on the new sales offices. Are these newer offices ramping faster than historical pace? Or is it basically in line with what you've seen?\n\nChad Richison -- President and Chief Executive Officer\n\nYes. Well, what I was first to say about the organization about being fully staffed, I mean it is -- I believe that we've done a good job of hiring. I've talked about over the last nine months, I think it's become easier for everyone to hire as it's been more of a shift back to maybe more of the middle where we were definitely in an employee-driven environment. And then I don't know you fit in like four or five questions in this.\n\nWhat was the other one, something about hiring?\n\nCraig Boelte -- Chief Financial Officer\n\n[inaudible]\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nThat's right. Yes.\n\nChad Richison -- President and Chief Executive Officer\n\nOK. Yes. I would say that when it comes to the new sales offices, as we've always had, we've always had increasing -- increasingly more success with new offices than what we'd have with the past, just because the amount of product we're selling, the fact that we continue to go upmarket. I mean, as I said in the past, I mean, I don't know it's about four, five years ago, I said the first rep that sells $1 million in a year, we're going to name the -- we're going to name the award after them.\n\nAnd it wasn't long after that someone did $2 million in a year as an individual. And I'm sure this year, someone will finish at $3 million that they've sold. And so you would expect a new office when you have your executive reps going from an average sale below $1 million to over $3 million, not an average rep, but I'm saying a top rep, selling that much. You would expect that to raise that type to raise all boats, including the new office opportunities as we open them.\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nThank you.\n\nOperator\n\nThank you Mr. Bergin. Our next question is from the line of Jason Celino with KeyBanc. Please proceed.\n\nJason Celino -- KeyBanc Capital Markets -- Analyst\n\nGreat. Chad, Craig, I don't know if it's just me or I've been thinking about Paycom too much, but I've been seeing more Paycom commercials, especially on football games. During the pandemic, you really leaned into marketing and advertising to capture incremental share. Is it possible that some of the strength we've seen over the last couple of quarters is coming from increased top-of-funnel efforts?\n\nChad Richison -- President and Chief Executive Officer\n\nYes, we're definitely getting better at marketing and retargeting and how we brand ourselves. So yes, I mean marketing is definitely one of those levers that we feel impact sales. And oftentimes, we're landing on a softer beach because of it. I think our market has changed dramatically even since the beginning of the pandemic when we started spending because we are able to do things with -- I'm not going to call them indirectly, but softer employee-driven leads that come from rank-and-file employees that are just tired of dealing with the consequences of having their check wrong.\n\nJason Celino -- KeyBanc Capital Markets -- Analyst\n\nOK. No, that's fair. I guess we've been hearing about falling advertising prices as other types of tech and software companies pull back. With this dynamic, does that change the ROI for some of the marketing efforts or cost of acquisition efforts that you do?\n\nChad Richison -- President and Chief Executive Officer\n\nNo. I mean I still believe you can waste money in advertising. So I mean, it's not going to change our strategy. It is an ROI metric.\n\nWe do measure it every single week based off not only leads but the percent of appointment that we get from those leads and then how we convert them and to close deals as they start. So that -- how we measure effectiveness of our marketing hasn't changed.\n\nJason Celino -- KeyBanc Capital Markets -- Analyst\n\nOK. Very helpful. Thanks.\n\nOperator\n\nThank you, Mr. Celino. The next question is from Alex Zukin with Wolfe Research. Please proceed.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nHey guys. First is, usually, we just say congratulations on a solid quarter. But I would say relative to everybody that's reporting this season, just amazing where you guys continue to put up in an obviously very volatile and difficult macro environment. So again, complements aside, I guess I'll start with that question, which is, Chad, if you zoom out, is the tougher macro actually helping you? Meaning that companies are starting to reprioritize certain efforts either around efficiency, more automation in their back office and their payroll, and then the hiring environment to which you refer to as being back to kind of more normalized levels? Like, I guess, how much of a tailwind is this for you? And how long -- like if you had to -- if you look at your crystal ball and you kind of think about the durability of this trend, like what's your thinking around that?\n\nChad Richison -- President and Chief Executive Officer\n\nI mean, I will just say we're just getting started with BETI. I mean all employees are going to be doing their own payroll. Everybody on this call is going to be doing their own payroll. It's how companies win at payroll.\n\nIt only makes sense that employees do it themselves. The only reason why employees haven't been doing it themselves is because it's always been overly complicated in multiple systems in blah, blah, blah. So I mean, I think that our biggest opportunities, the fact that people are waking up to this, and they want to do less. I mean, your back office, they want to do less, especially when that equivalates into less exposure for them.\n\nThey can do less work and create less exposure, less risk and greater satisfaction with their employees. So I don't really think it matters what's going on in order for us to move our product from a strategic basis. Now could the size of the deals be smaller if you're in a looser versus a tighter labor market? Well, maybe yes. But I mean -- and I'm not saying that's the case now, but I'm saying their reason for making the change is going to be -- exist regardless of what the labor market is.\n\nAnd so -- and I believe that we provide that for them. So that's really what's driving it. And I think that as we've shifted over to really giving the employee control over their own payroll and everything else that feeds it. Now if I have you responsible for your time and labor management of clocking in and clocking out, OK, which all employees are, but have you responsible for your expense management, which all employees are, your benefits administration, which all employers are, I'm just not showing you how it all added up at the end.\n\nI'm having you do all this work without ever showing you where you're going. And so now what Paycom does is we show you where you're going and how it's going to impact your payroll. You'll be amazed at how much better everybody gets it, time tracking, expense management, benefits administration. When you take the blindfold off of them and show them what it should look like at the end, they get a lot better.\n\nAnd I don't see that slowing down regardless of what's going on in the labor market.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nUnderstood. And then I guess maybe as a different direction, if you look at the funding environment with private companies now and I don't know if valuations are corrected or they will correct, given the incremental opportunity that you're seeing, particularly further upmarket, what -- how would you say your approach is either the same or changed over the course of the next 12 to 24 months around organic versus inorganic innovation.\n\nChad Richison -- President and Chief Executive Officer\n\nI mean, I think that we're an organic innovation company. I mean, I've always said that we always look to do things that make sense to us. But I mean, we've always developed our product. We continue to be ambitious with our product and what we look for in the future.\n\nWe are continuing to be pulled up market. And honestly, I think that the larger the company it is, the larger company is, the more opportunity for exposure and risk they have and even the more difficult it is to keep everybody paid correctly. And so I think you're going to see more and more -- as we have definitely see the employees of those companies call us. I mean, I don't think we're going to have less opportunity with larger companies as time goes on.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nGot it. Thank you, guys.\n\nOperator\n\nThank you, Mr. Zukin. Our next question is from Bhavin Shah with Deutsche Bank. Please proceed.\n\nBhavin Shah -- Deutsche Bank -- Analyst\n\nGreat. Thanks for taking my question. Chad, on that quip you made earlier on value of 50% self-service adoption by the first two payrolls, what are the things you can do to maybe accelerate that? Like what could those things be in? Is it more awareness than anything else? And any sense of what the upper balance would look like?\n\nChad Richison -- President and Chief Executive Officer\n\nWell, I mean our clients are -- you're a new client and you're rolling something out to your employees. I mean, I would say that our clients are getting better at it as well. I mean this 50% are just from the group that wanted to. I believe our clients are getting better at talking about the impact that can be had when an employee does their own.\n\nAnd so -- and you see that number go up. I'm just saying that's where they're starting, which, to me, showing a very strong interest. I mean it's one thing to buy something, it's another thing to use it. And BETI's definitely a product that's getting high usage from the point of conversion on.\n\nBhavin Shah -- Deutsche Bank -- Analyst\n\nThat's helpful there. And just a quick follow-up. I mean you talked earlier about maybe tweaking the brand marketing strategy a little bit of kind of going at it from a different angle. How is the effectiveness of this marketing campaign evolved for the last few months given some of these changes? Are you able to go after a different customer base or attract buyers that maybe wouldn't come into your full otherwise?\n\nChad Richison -- President and Chief Executive Officer\n\nNo, because at the end of the day, there's no such thing as an enterprise employee. I mean, whether a person works for a large enterprise company or a small company, they have the same mortgage, same bills, same medical needs, same child care needs. They all expect their check to be correct. So employees that work from enterprise company one day, can work for a smaller company the next day and they can be back working for a large company.\n\nThey're the same person. They expect the same things. And so when it comes to BETI, it's for everyone. It's for the employee and it's regardless of the company's size.\n\nBhavin Shah -- Deutsche Bank -- Analyst\n\nGot it. That's helpful. Congrats.\n\nChad Richison -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. The next question is from Daniel Jester with BMO. Please proceed.\n\nDaniel Jester -- BMO Capital Markets -- Analyst\n\nGreat. Thanks for taking my question. Maybe just as kind of -- earlier on the call about bookings in the quarter. Chad, you mentioned -- called out September and October specifically.\n\nJust in terms of the linearity, like how did this third quarter look like other third quarters? Did you book more business on a relative basis in September, October? Or were you just commenting on sort of the macro outlook? Thanks.\n\nChad Richison -- President and Chief Executive Officer\n\nYes. Well, it was commented on the macro outlook, and I just took our most recent two months. I mean, I could go back further into August, July, June. The answer to your question is absolutely, we are booking more today than we've booked in the past.\n\nAnd I wouldn't say that -- I mean, September is strong, October's strong, but so is August, so is July, so is June. As far back as you go, we've continued to be strong.\n\nDaniel Jester -- BMO Capital Markets -- Analyst\n\nOK. And then with you've actually obviously run this business for a very long time through all sorts of different macroeconomic cycles. I think clearly, there's a lot of uncertainty about what 2023 looks like. So maybe, just philosophically, Chad, how do you run Paycom in a recession? What changes? What are the levers that we should expect you to pull either to manage cost or drive additional growth?\n\nChad Richison -- President and Chief Executive Officer\n\nI mean very little change for us based on what we're already doing. I mean just as a reminder, I mean, we have 5% of the TAM. We have a differentiated product. As I said before, we started off the year with 33,800 clients.\n\nWe've got two competitors that if you combine their client count, it's 1.7 million. And so what happens to us next year is dependent upon us, and I think we're in control of that. So I mean, I wouldn't see any major changes from what we're going to be doing into next year.\n\nDaniel Jester -- BMO Capital Markets -- Analyst\n\nGreat. Thanks very much.\n\nOperator\n\nOur next question is from Kevin McVeigh with Credit Suisse. Please proceed.\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nGreat. Thanks so much. And I'll let my congratulations just given fantastic outcome. Can you give us a sense, relative to expectations that you initially said, where was the source of the most upside? Was it modules kind of new logos, just employee per logo per CAC? And any way to just frame that?\n\nChad Richison -- President and Chief Executive Officer\n\nNew logos.\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nNew logo, that's super helpful. And then Chad, is there any way to think about -- I mean, we've got a [inaudible] number this morning is north of like $10 million. Is there any way to think about that relative to kind of the module adoption and the type of modules that folks are using? Because obviously, one of the debates in the market now is we get a soft landing. And based on the general market in and of itself, seems that's potentially a real likely outcome.\n\nBut how to think about modules within the context of the [inaudible]. Is there any way to think about that?\n\nChad Richison -- President and Chief Executive Officer\n\nI mean we definitely have leading indicators that we look at like for background checks, how many people running background checks, which is an impact of oftentimes onboarding and what have you. I mean all I would say is this. I mean, those types of things are going to impact us a little bit on the margin. But for us, it's really about new logo wins with our differentiated strategy.\n\nThat's what's really going to drive our growth. Sometimes you have some things that help you with that a little bit, and that could be what's going on in the labor market. But I would say it would have to be something extreme to have any negative impact on us. And likewise, I would say it would have to also be extreme on the other side to have some major positive impact on us, except for the fact that our go-to markets normalize and how we're going to market.\n\nIt's like the way we were going to market prepandemic, which for us being out there face-to-face and having those personal interchanges and exchanges of ideas and information really helps us when we're selling deals.\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nThat makes sense. Congrats again.\n\nChad Richison -- President and Chief Executive Officer\n\nThank you.\n\nCraig Boelte -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you, Mr. McVeigh. Our last question comes from Robert Simmons with D.A. Davidson.\n\nPlease proceed.\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nHey, thanks for taking the question. So following up on Samad, your sequential guide is the strong as it's been, and I believe, five years. Are you expecting anything unusual in the quarter such as extra strong Bernstrom this year or anything like that?\n\nChad Richison -- President and Chief Executive Officer\n\nOK. I'm making sure I understand the sequential guide into fourth quarter. We kind of talked -- I kind of talked a little bit about this earlier. When deals start in a quarter matters.\n\nAnd so if a deal starts at the first of the quarter in October, we get 100% of the revenue billing for that. If a deal start -- or let's even take this quarter that we just finished with the deal started at the beginning of July, we get 100% of the revenue dollars for that deal. If the deal starts in mid-September, we might get 15% of the revenue for that deal. But in subsequent quarters, we get 100% of it.\n\nAnd so it's a recurring revenue -- recurring revenue model that we have here. So all I would say is that does matter. I've also talked about how, Craig and I have been talking about how interest rates layer in over time. Eventually, they start layering in as well.\n\nI think you get a little bit of uplift from that as well. But for us, it's really the new client adds onto our platform when they start and our expectation that there'll be -- we'll receive 100% of the revenue billing in subsequent quarters, fourth quarter being the next one.\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nGot it. So it's basically just those two things, I might switch moving around Q3 versus Q4. All right. Great.\n\nAnd then I guess just, have you seen any notable -- competition? I realize it's the same basis as usual, but any changes in kind of the pricing, marketing approach? Any idea who's commenting recently that seeing their churn kind of increase in normalized but only a little bit. I mean, what are you seeing on that front?\n\nChad Richison -- President and Chief Executive Officer\n\nYes. I mean I will tell you that we've always been in a very competitive market. As you've mentioned, it's been with the same people. We're the new people.\n\nWe're the new guys. And next year, we're 25 years in business. So we really benchmark against ourselves in the current situation about the -- with the ROI that we can create if someone uses our product. You're not going to get the same ROI if you use one of our competitors.\n\nYou're just not. And so the extent someone agrees with our strategy and can realize the ROI available for them if they deploy it correctly, they're going to choose us over someone else, regardless of what's really going on with pricing. That said, pricing does matter. There's a market for pricing, and I think that we all understand that.\n\nBut as far as seeing any changes with our competitors, no, other than they all continue to deploy things that they believe will make them more competitive. And sometimes that's pricing. And sometimes it's giving things for free. So it just kind of it kind of depends on what we'll see out there.\n\nBut it's really been the same that we've always seen.\n\nOperator\n\nThat concludes the question-and-answer session. I will now turn the call over to Chad Richison for closing remarks.\n\nChad Richison -- President and Chief Executive Officer\n\nOK. Well, I want to thank everyone for joining our call today, and thank you all, and I want to thank all of our employees for contributing to our continued success. In November, we'll be hosting meetings in Las Vegas at the Wells Fargo TMT Summit and presenting at the Credit Suisse Annual Technology Conference in Scottsdale. Then in December, we'll be presenting at the Barclays TMT Conference in San Francisco.\n\nWe look forward to speaking with many of you soon. Operator, you may disconnect.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJames Samford -- Head of Investor Relations\n\nChad Richison -- President and Chief Executive Officer\n\nCraig Boelte -- Chief Financial Officer\n\nRaimo Lenschow -- Barclays -- Analyst\n\nSamad Samana -- Jefferies -- Analyst\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nBrian Schwartz -- Oppenheimer and Company -- Analyst\n\nJoshua Reilly -- Needham and Company -- Analyst\n\nUnknown speaker -- Citi -- Analyst\n\nAlex Kim -- Mizuho Securities -- Analyst\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nJason Celino -- KeyBanc Capital Markets -- Analyst\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nBhavin Shah -- Deutsche Bank -- Analyst\n\nDaniel Jester -- BMO Capital Markets -- Analyst\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nMore PAYC analysis\n\nAll earnings call transcripts"
}