{
  "companyName": "AbCellera Biologics Inc.",
  "companyTicker": "ABCL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/abcellera-biologics-inc-abcl-q3-2022-earnings-call/",
  "content": "AbCellera Biologics Inc. (ABCL 0.80%)\nQ3 2022 Earnings Call\nNov 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to AbCellera's third quarter 2022 business update conference call. My name is Daniel, and I will facilitate the audio portion of today's interactive broadcast. [Operator instructions] At this time, I would like to turn the call over to Tryn Stimart, AbCellera's chief legal and compliance officer.\n\nTryn Stimart -- Chief Legal Officer and Chief Compliance Officer\n\nThank you. Good afternoon, and welcome to AbCellera's third quarter 2022 business update. We're pleased to have you with us today as we discuss the results announced in our press release issued just after the market closed today, which you can find on our investor relations website. With me on the call today are Dr.\n\nCarl Hansen, AbCellera's chief executive officer and president; and Andrew Booth, AbCellera's, chief financial officer. The webcast portion of this call contains a slide presentation that we will refer to during the call. If you are following along on the phone and wish to access the slide portion of this presentation, you may do so on the investor relations section of our website. For those of you who have accessed the streaming portion of the webcast, please be aware that there may be a delay and that you will not be able to pose questions via the web.\n\nThis presentation may contain forward-looking statements pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Any forward-looking statements are based on management's current expectations and are subject to certain risks and uncertainties. Please review our SEC filings for risk factors that could impact our future performance. Our presentation and SEC filings are available on our investor relations website.\n\nNote that all dollars referred to during our call today are U.S. dollars. Now, I am pleased to turn the call over to Dr. Carl Hansen.\n\nCarl Hansen -- Chief Executive Officer and President\n\nThanks, Tryn. And thanks, everyone, for joining us today. It's my pleasure to provide an update on our business for the third quarter of 2022. Today, November 8th, marks the 10th anniversary AbCellera's incorporation.\n\nWe founded AbCellera on a bold idea: to deliberately rethink and rebuild the critical product creation step in bringing new antibody therapies to the world. After a decade of company building, we believe we now have the industry's most powerful engine for antibody discovery. Along the way, we've grown from six founders in a lab, to a business of nearly 500 people spread across four countries and three continents. We've earned a reputation as a leader in the industry, and I've worked on over 90 different programs and have succeeded where others have failed.\n\nWe've also validated our platform, not just once, but twice, in bringing therapies to patients, delivering authorized antibodies, bamlanivimab and bebtelovimab for the COVID-19 pandemic in what was arguably the most competitive and time-sensitive drug development effort in history. For a young company, our competitive position is exceptional. We've assembled an outstanding team. We have put in place the core proprietary technologies that we need to execute our strategy.\n\nAnd we have nearly 600,000 square feet of state-of-the-art facilities that are either operational or under construction. Over this 10 year period, we have achieved all of this while building the balance of over $450 million in accumulated earnings and nearly $900 million in total cash equivalents and marketable securities. It is on this solid foundation that we embark on the next decade of accelerating innovation and taking our business to the next level. Our business strategy is simple.\n\nFirst, it is to be the best in the world in bringing antibody therapies from target to the clinic. And second, it is to use this capability with partners to build a large and diversified portfolio of stakes in future antibody drugs. This is fundamentally a win-win strategy. We provide partners with a full solution and a competitive technology advantage in taking their programs to the clinic.\n\nIn exchange, we share in the future success of therapies that are ultimately delivered to patients in need. In addition, for our shareholders, this model smooths out the binary risk of biotech investing by providing access to a curated slice of the market that is enriched for its best parts. We assemble our portfolio using deal structures that are tailored to each opportunity and each partner. Our programs fall into three categories: first, partner-initiated discovery programs; second, partner-initiated co-development programs; and third, pre-partner programs that arise from our ongoing technology development efforts.\n\nIn our most typical discovery partnerships, deals are structured around partner-initiated work and include upfront research fees, clinical milestones, and single-digit royalties on net sales. Through these deals, we generate antibody candidates to deliver back to partners for further preclinical development and IND-enabling studies. We know that we are succeeding when molecules we've helped to discover progress through to the clinic. This quarter, we can update you on two partners, bringing AbCellera-discovered antibodies closer to patients.\n\nFirst, an antibody discovered by AbCellera for an unnamed partner entered clinical development at the start of the quarter. This phase 1 molecule is indicated for the treatment of Alzheimer's disease, which is a huge area of unmet need. Second, this quarter, Regeneron elected to advance an antibody forward in preclinical development that was discovered as part of our 2020 partnership. This molecule targets an undisclosed G-protein-coupled receptor, or GPCR.\n\nGPCRs are large and valuable class that is widely regarded as one of the most challenging for antibody discovery. Success in this program highlights the ability of our discovery technology to address difficult targets and also to move the needle for highly enabled partners like Regeneron. Last year, we announced a co-development partnership structure that represents a further amplification of our business model, enhancing the potential economics in our portfolio by giving us the option, but not the obligation, to invest in the co-development of molecules in order to retain an up to 50% stake. To date, we have initiated a total of seven programs under the structure with four different partners.\n\nFor the most advanced co-development programs, we have discovered high-quality lead candidates that meet program requirements and are undergoing optimization. In 2023, we expect to select final lead candidates for one or more of these programs, positioning them for IND-enabling studies. Finally, in the last quarter, we introduced to you our pre-partner programs, which is the third way which we create value. As a reminder, these are wholly owned assets discovered in connection with our high-value technology development work to unlock new areas in drug development.\n\nThe two main areas for our pre-partner programs are currently T cell engagers and difficult memory protein targets, specifically GPCRs and ion channels. Last quarter, we shared with you the progress we've made over the past year in developing our CD3 T cell engager platform, which offers access to what we believe is now the deepest and most diverse CD3 panel in the industry. In combination with the OrthoMab platform, this panel offers unprecedented opportunities for T cell engager optimization and continues to attract a high level of interest. We will present new data on the characteristics of this panel at the 2022 annual meeting of the Society for Immunotherapy of Cancer, or SITC, which will be held later this week in Boston.\n\nNow, moving on to our efforts to unlock GPCRs and ion channels. We believe that continued progress in this area across all partnership models will drive substantial value for our business. To date, our technology development efforts have been applied to roughly a dozen GPCR and ion channel pre-partner program targets. In some cases, this work is still at an early stage.\n\nFor other targets, we have made exciting progress. And while technical risk remains, we anticipate sharing data on one or more of these clinical candidates from these programs in 2023. In summary, AbCellera is ideally positioned for another decade of success. We will continue on our strategy, investing to become the global leader in antibody product creation.\n\nBefore I hand over to Andrew, I would like to provide an update on bebtelovimab and our COVID-19 program. Through much of Q3, bebtelovimab continues to be the only authorized monoclonal antibody that remained effective against all variants of concern. More recently, two new variants, BQ.1 and BQ.1.1, have emerged. And our experiments suggest that these variants are likely to be resistant to bebtelovimab.\n\nIn response to this, and as part of our continuing collaboration with Eli Lilly, we have identified a new lead antibody candidate that is highly potent and that we expect will be effective against BQ.1, BQ.1.1, and all other known variants of concern. We believe this candidate has high potential to address an ongoing medical need both for therapy and prophylaxis in COVID 19. If a clear path for clinical development and patient access can be established, together with Eli Lilly, we stand ready to move these molecules forward quickly as we have done in the past. And with that, I'll now hand it over to Andrew Booth, our CFO, to provide an overview of our third quarter 2022 financials.\n\nAndrew?\n\nAndrew Booth -- Chief Financial Officer\n\nThanks, Carl. I'll start by highlighting our progress made on our key business metrics in the third quarter of 2022 as we continue to see strong momentum in the business. This quarter, we started work on four new discovery programs, taking us to a cumulative total of 92 program starts. Overall, we have started work on 23 programs over the trailing 12 months, which represents a quarter of all the programs that we have ever started with partners.\n\nThis demonstrates the continued strong growth of our portfolio. All four starts in the quarter include downstream participation. We signed no new programs under contract in the quarter, and we ended the third quarter of 2022 with 164 programs under contract, with 38 unique partners. While the number of starts in any given quarter will be irregular, we expect the trajectory of starts to continue to be strong.\n\nImportantly, the numbers included in our key business metrics do not include the pre-partner technology development efforts initiated by AbCellera that Carl referenced earlier in the call. For our molecules at a clinical stage, we are excited to see another molecule from a discovery partnership reach the clinic, bringing our total number of molecules in the clinic to seven. As Carl mentioned earlier, this new molecule was discovered by us in partnership with an undisclosed partner and has entered clinical trials with an indication in Alzheimer's disease. We continue to view our growing list of molecules in the clinic as specific examples of our near and midterm potential revenue from downstream milestone fees and long-term royalty payments.\n\nWith respect to marketed molecules, Lilly announced in Q2 that they had begun commercial sales of bebtelovimab to states hospitals and healthcare providers, which subsequently materialized in Q3. Turning to revenue, revenue in the quarter was approximately $101 million. This was driven in large part by the roughly $93 million of royalties we earned from shipments of bebtelovimab in the quarter from both the 139,000 doses to the U.S. government and from the first commercial sales of approximately 60,000 doses.\n\nWhile we expect some bebtelovimab sales to continue in Q4, future sales are uncertain, given the impact of potentially resistant variants, case counts, and the availability of other treatments. As Carl mentioned, the situation with COVID remains fluid. We have always viewed these royalties earned from sales of our COVID-19 antibodies as a source of nondiluted funding. With or without future royalties from COVID antibodies, our strategy is to invest in forward integration and scale our business with world-leading capabilities and antibody discovery and development from target to the clinic.\n\nLooking at other revenues, this quarter, we earned $7 million in research fees relating to work on discovering programs, compared to approximately $5 million in Q3 of 2021. This increase reflects the growing scale and capabilities of our discovery engine and the underlying robustness of our business. This quarter's revenues also included some small amounts related to milestone payments and licensing fees. Turning to operating expenses, our research and development expenses for the third quarter were nearly $27 million, representing a roughly $9 million increase over the same period of the previous year.\n\nThe increase reflects continuing investments as we continue to expand the capacity of our teams and business to deliver on a growing number of discovery programs, while organically scaling and expanding our internal capabilities. Approximately two-thirds of our R&D efforts continue to be directed at enhancing the capabilities of our discovery and development engine with about one-third relating to execution on discovery programs. In sales and marketing, expenses for the quarter were approximately $3 million, compared to approximately $1 million in Q3 of 2021. This increase reflects continuing investments in the business development.\n\nGeneral and administration expenses for the quarter were almost $14 million, compared to approximately $11 million in Q3 of 2021. The increase is driven by the need to support the growing business overall. Looking at earnings, this quarter, we are reporting a net profit of approximately $27 million. This compares to a loss of roughly $21 million in Q3 of 2021.\n\nThis result reflects the recognition of royalties on bebtelovimab, offsetting our investments to expand our capabilities while continuing to run discovery efforts for our partners. In terms of earnings per share, this quarter's results worked out to a profit of $0.09 per share on a basic and $0.08 per share on a diluted basis. We continue to expect to be profitable for the full fiscal year of 2022. Looking at cash flows, operating cash flows for the first nine months of 2022 contributed $246 million to cash.\n\nAs a part of our treasury strategy, we keep almost $500 million invested in short-term marketable securities. And our investment activities for the first nine months of the year include an approximately $250 million net increase in those holdings. All other investments amounted to approximately $80 million, largely related to the purchase of property, plant, and equipment, as well as payments connected with our facilities expansion. All together, we finished the quarter with well over $850 million of cash equivalents and marketable securities.\n\nWe are in a strong liquidity position that allows us to fully execute in our strategy with excellent visibility and runway. We believe that we have sufficient liquidity to fund well beyond the next three years of investment and growth. And with that, we'll be happy to take your questions. Operator?\n\nOperator\n\n[Operator instructions] The first question comes from the line of Do Kim of Piper Sandler. Please proceed.\n\nDo Kim -- Piper Sandler -- Analyst\n\nHi. Thanks for taking my question. And congrats on the progress. I was hoping you could talk a little bit more about the discovery process that it takes -- that takes for going against a GPCR target.\n\nIs it different than your conventional target? And does it have extended discovery timelines? And, specifically, for Regeneron, when they take responsibility of the antibody candidate, are they starting at IND-enabling studies at this point?\n\nCarl Hansen -- Chief Executive Officer and President\n\nGreat. Thanks, Do. This is Carl Hansen. I'll take those two questions in turn.\n\nSo, first, your question related to differences in discovery against non-GPCR targets, or more standard targets and GPCRs. And, perhaps, I'll even frame that by expanding the question to talk about ion channels as well, which are both within this effort that we're running. So, GPCRs and ion channels represent a huge class of targets. They are two of the largest target classes.\n\nThere are many high-profile targets that are out there that have been well-validated, either through clinical development of small molecules, but where, perhaps, specificity or toxicity had been an issue, or that are well-validated through other mechanisms, and where antibodies are believed to be a very attractive modality to solve some of those challenges. Despite that, both historic classes have been notoriously difficult to run discovery against. And the reasons are not just one thing, the reasons are manifold. It includes poor immunogenicity of the targets.\n\nIt includes a small epitope or real estate that's available for binding an antibody. And it also includes the need for special capabilities in functional assays and identifying antibodies that are both developable and that have the right functional activity against the target. So, it's not one thing. What is really needed is a latticework of technologies that allow you with high probability to go from a target name through to a molecule that does what it's supposed to do, it's efficacious, and also has the properties to develop it as a drug.\n\nWe have been working in this space now for many years. And for just about three years now, I've had a long-range intensive R&D effort to put in place all of those different technologies and leverage AbCellera's core platforms to unlock that space. So, once that technology development has been done, the timelines for development of those targets are not different. But, of course, many of these would still be considered some of the hardest in the industry.\n\nAnd we are still doing work to break those open. With respect to the Regeneron collaboration, as mentioned, we worked with Regeneron productively on a GPCR target. And we've helped them to overcome the formidable hurdle of finding a candidate that's ready for further development. That molecule is not yet in an IND-enabling study, but our belief and the indication from Regeneron is that they are now moving that molecule toward those studies and ultimately toward IND.\n\nDo Kim -- Piper Sandler -- Analyst\n\nGreat. Thank you for all those details. That was very helpful.\n\nOperator\n\nThe next question comes from the line of Puneet Souda of SVB. Please proceed.\n\nUnknown speaker -- SVB Leerink Partners -- Analyst\n\nHi. You have Michael on for Puneet. Thank you for taking my question. My first question is about the early pipeline.\n\nSo, we've been hearing a little bit about increased caution for capital spending by biopharma. I am wondering if that's at all reflected in the program starts for new programs on the contract, or do you think if you're seeing any sort of similar impact on your pipeline? Then one quick question about bebtelovimab and the new COVID mab. I was wondering if the development timeline for this new mab would be at all similar to bebtelovimab, or the fact that COVID kind of have the pandemic state to an extent, if that affects the timeline. Thank you.\n\nCarl Hansen -- Chief Executive Officer and President\n\nMichael, this is Carl. So, maybe I'll start first by answering your question on bebtelovimab and the new lead that we've identified as a next-generation -- or third-generation molecule for COVID-19. So, as you know, we have now applied our platform three times to come up with solutions for COVID-19. The first, of course, was bamlanivimab, which was done at tremendous speed in combination with Eli Lilly.\n\nThat was, I believe, and still is a record in speed in developing the therapeutic. The next one was bebtelovimab, where we focused on breadth and potency. And in this case, we have now developed -- or we've now discovered a new antibody that we believe has the potency and breadth to cover the current situation with COVID-19 and what is in the foreseeable future. I would expect that the timeline to bring that to the clinic, and then through clinical development, would be similar to what we've done in the past with Eli Lilly, provided that we are successful in finding a clear regulatory path for that development.\n\nAnd I do know that there have been conversations between Eli Lilly and the FDA about how that would proceed. I don't know the status of that. But we are ready with that solution if that opening is there. Now, moving on to the other part of your question, which, I believe, was related to program starts.\n\nThere certainly is, you know, some element of the macro environment that everyone's keeping an eye on. But I will remind you that in the Q4 call of last year, we indicated that we were shifting our business development priority from volume from the number of programs and partners that we have secured, to prioritizing the highest value deals. And we expected that we would do fewer deals but do some deals that we have greater participation in and where, as we forward integrate, we are doing more of the work per program. For us, that is one of the ways in which we maximize the overall value of the portfolio.\n\nThat is what has been happening over the last couple of quarters. And I did mention some exciting progress on the co-development programs, where we have completely in-house brought these from an email with the target right through to what we expect in 2023 will be a development candidate. And on those programs, as I mentioned, we have currently a 50% ownership stake and an option to co-invest and maintain that ownership stake. So, there are now seven programs in that bucket with four different partners.\n\nAnd of course, as we apply more effort and do more of the work per program, we expect that the total number of programs were going to be lower. We expect the total value will be higher. And importantly, it's our belief that the timelines to clinical development will be faster and the probability of each program getting to clinical development will also be very significantly improved.\n\nUnknown speaker -- SVB Leerink Partners -- Analyst\n\nGot it. Thank you very much.\n\nOperator\n\nThank you. The next question comes from Gaurav Goparaju of Berenberg. Please proceed.\n\nGaurav Goparaju -- Berenberg Capital Markets -- Analyst\n\nCongrats on the quarter. Just two for me. You know, given you announced the Regeneron program, you know, entering preclinical studies, should we expect similar announcements on future programs that enter preclinical studies? And then, as a follow-up to that, you know, are you able to disclose how many programs are currently in preclinical studies based on, you know, the answer?\n\nCarl Hansen -- Chief Executive Officer and President\n\nGreat question. Yes. So, we typically do not make an announcement when programs move toward preclinical studies. In this particular case, we did make an announcement in part because we had not formally announced that deal back in 2020.\n\nAnd also because of the significant progress with a high-profile partner in moving forward a program against a very difficult target. So, I would consider this the exception, and we will not routinely be giving progress updates on molecules until they reach IND for sure. And, perhaps, earlier on a case-by-case basis.\n\nGaurav Goparaju -- Berenberg Capital Markets -- Analyst\n\nGot it. Thanks. And then, one more for me. Just -- is there any update on the timeline regarding the GMP facility?\n\nAndrew Booth -- Chief Financial Officer\n\nYeah. You remember previously -- hey, Gaurav, it's Andrew speaking here. Previously, we'd indicated that the GMP facility was on track for the end of 2024. I'd say in terms of having the facility up and working on our first batches and qualification batches at the end of 2024, we're still on track for that with the first kind of commercial batches being in 2025.\n\nSo, that would be -- so, roughly on schedule of where we were and how we've indicated previously.\n\nGaurav Goparaju -- Berenberg Capital Markets -- Analyst\n\nAwesome. Appreciate it. Cheers, guys.\n\nOperator\n\nThank you. Next question comes from Stephen Willey of Stifel. Please proceed.\n\nSteve Willey -- Stifel Financial Corp. -- Analyst\n\nGood afternoon. Thanks for taking the questions. With respect to the in-house work that's being done on ion channel and the GPCR side, I understand the Regeneron lead candidate was developed via the VelociMouse that Regeneron has. Are you guys using the Trianni transgenic platform for the in-house GPCR work?\n\nCarl Hansen -- Chief Executive Officer and President\n\nThanks, Steve. Carl here. So, yes, the program with Regeneron took advantage of VelociMouse with our internal work, which is really, you know, intimately connected with long-range R&D efforts on unlocking target space and unlocking new modalities, you know, T cell engagers, as well as GPCR and ion channels. We are using the Trianni platform.\n\nWe have access to another transgenic platform. And on a case-by-case basis, we also use other sources of diversity, including different animal species, such as camelids, you know, wild-type rats, and other animals, in order to maximize the chance of finding leads that can be developed. Of course, if we start with humanized rodents, then the path to a final candidate is shorter. But for many of these targets, the name of the game is getting a molecule over the finish line period because they've been out of reach for a long time.\n\nAnd so, we don't pull punches on that.\n\nSteve Willey -- Stifel Financial Corp. -- Analyst\n\nOK. And I guess maybe just sticking on the in-house development work. I know that you mentioned you'll be presenting some of the CD3 variant data at SITC. And I believe in the abstract, you also talk about how you've identified some -- I don't know if you want to call them leads, but you've identified some candidates, both EGFR CD3 targeting.\n\nShould we anticipate that there's an opportunity to maybe move one of these forward into, perhaps, IND-enabling studies at some point?\n\nCarl Hansen -- Chief Executive Officer and President\n\nYes, Steve, so the update at SITC, you know, will be later this week. And so, I don't want to steal any thunder from that. Some of that work will be showing a further characterization and expansion of the panel. And we believe that that's one of the critical steps to being able to generate optimal therapeutic molecules.\n\nThe work that will be presented on EGFR, I would characterize as proof of concept. So, we do not intend and do not expect that work to lead to assets. Although, of course, you know, we could be surprised. I did mention on a previous call that in order to validate the hypothesis that an improved diversity and quality of CD3 combined with OrthoMab can lead to therapeutic candidates with a better profile in terms of cell killing and cytokine release, we have initiated some work internally on well-known targets that are focused on solid tumors.\n\nWe are not yet at the point to share that data. So, I don't expect sharing that data at SITC. But that -- we will share that as those programs mature.\n\nSteve Willey -- Stifel Financial Corp. -- Analyst\n\nOK. And then, just lastly, are you able to say whether or not the new clinical candidate from the undisclosed partner in Alzheimer's, if that has downstream economics associated with it?\n\nCarl Hansen -- Chief Executive Officer and President\n\nYes, it does have downstream economics. Thank you.\n\nSteve Willey -- Stifel Financial Corp. -- Analyst\n\nOK. Great. Thanks for taking my questions.\n\nOperator\n\nThank you. Next question comes from Gary Nachman of BMO. Please proceed.\n\nGary Nachman -- BMO Capital Markets -- Analyst\n\nHi, guys. Good afternoon. First, for the four new programs starts in 3Q, to get to 92, is there anything that you're doing differently now versus a couple of years ago in terms of leads to start these programs or how you approach them? And you also had four new starts in the second quarter. Is that a good cadence to think about? And then, are you making any further inroads with the VCs after the Atlas and Versant partnerships that you announced last quarter? That seemed like a, you know, nice initiative for you and maybe a lot of room to run there.\n\nSo, I'm curious if you're making any more progress there and if you think we're going to hear about more of those partnerships going forward.\n\nAndrew Booth -- Chief Financial Officer\n\nYeah. Hey, Gary. It's Andrew here. I'll take the first part.\n\nAnd then, when it comes to the question about the VCs, I'll hand off to Carl. So, with the program starts, you know, it's the same definition of what constitutes a program start, as we've always been using. It's quite a rigorous definition. There's always going to be some variability quarter to quarter.\n\nImportantly, when you said, \"Hey, is there anything we're doing differently?\" I think what's important, and Carl mentioned in one of the previous questions, is that in each of the programs, we're doing more and more work. And so, if we use program starts as kind of a measure of both capacity and value that is being generated, we're doing more and more work in each of them. So, it does -- the fewer programs start shouldn't be an indication of less capacity within the company, nor should it be an indication of less value that is being created because we are adding more and more to each of the programs. And as you can see, even in the increase in expenditure for our R&D, that is growing significantly.\n\nAnd still a similar percentage of it is being spent on the efforts in partnership and program discovery compared to this time last year. So, I think a way to think about the program starts going forward is that the roughly what we've seen in the past year or so will probably be a good indication of what's going to be in the future. We still have a full book of work from the large number of 164 programs under contract, which our partners will continue to call with whatever frequency that they determine is correct. And that's how we'll continue moving going forward.\n\nCarl Hansen -- Chief Executive Officer and President\n\nAnd, perhaps, I'll pick up from there and respond to your question about AbCellera's strategy of engaging with high-profile and top VCs to assist in the early stages of company creation and product development. I would agree with you that we see that as an opportunity that has a lot of headroom and also one that really exemplifies our business model and what we think we can do for the industry. So, it's not just about having great scientific insight. That insight needs to be connected with strong technical teams, which we can provide; with the facilities and technology, which we have built in our engine; and also with the management teams and the capital to move those forward to the clinic and then through the clinic to build new companies.\n\nWe have, you know, over the last couple years, spent a big effort or put a big effort into completing our process so that we can fully integrate from an email and a specification of a drug target, right through to a value inflection point. And by connecting with the right partners, we believe that allows for company creation with much better economics and much better timelines. We have previously announced a couple other deals. We have also been continuing those conversations with various groups.\n\nAnd I'm hopeful and I'm confident that you'll see more of that in the future.\n\nGary Nachman -- BMO Capital Markets -- Analyst\n\nOK. Great. And if I could squeeze in one other follow-up, just on the molecule that's advancing into the clinic for Alzheimer's. That sounds pretty exciting.\n\nAnd you mentioned there's good downstream economics. But anything you can tell us just about that program, maybe at a high level, your discovery efforts with it, if there's something unique about it in terms of the antibody that was discovered, and that's being moved forward? I know it's with an undisclosed partner, but I don't know, just -- it sounds like a nice important program. So, anything more you could say about it. Thanks.\n\nAndrew Booth -- Chief Financial Officer\n\nThanks, Gary. We think that it's a very significant announcement, mostly because it adds further weight to validation of the platform that our work is now moving forward. Molecules are getting to the clinic for important unmet medical need with a top partner. I don't think that I can go into the details of the program, given that we still haven't identified who the partner is.\n\nAnd we'd want to wait until that is fully in the open before we say any more about it.\n\nGary Nachman -- BMO Capital Markets -- Analyst\n\nOK. Fair enough. Thanks.\n\nOperator\n\nThank you. The next question comes from Antonia Borovina of Bloom Burton. Please proceed.\n\nAntonia Borovina -- Bloom Burton -- Analyst\n\nHi there. Thank you for taking my questions. My first one is just related to your commentary on the program starts and how you're adding more value per program. So, I'm just wondering, can we expect your average royalty rate, which I think average is around 5% now, can we expect that to tick up as you are doing more work per program?\n\nAndrew Booth -- Chief Financial Officer\n\nHey, Antonia. It's Andrew here. Yeah, great question. If you'll remember, we disclosed kind of aggregate royalty rates and how they've moved over time in the 10-K.\n\nFrom -- in the earlier years up to 2018, they averaged about 2.5%. And in the 2020-2021 timeframe, they went up to 4.2%, I think, was the median royalty. We do see -- you know, as we are doing more work, we do see the value of each of these programs to AbCellera increasing. I think, most notably and probably in the extreme, in the co-ownership case where -- that Carl mentioned, where we have actually a 50% ownership stake as we start those programs, and then an option to invest in order to maintain that 50% ownership stake going forward, those are, of course, extremely valuable programs and will be accretive to the average royalty rate overall as they're in the portfolio.\n\nSo, in those sorts of cases, you know, absolutely, we would expect the overall value and especially in the royalty or equivalent in the program will increase. Importantly as well, though it's not included in the program starts number, there's the pre-partner program that Carl alluded, where those are wholly owned. But it is still our intention to be partnering those out at the right point in time. And those, once we've -- because we've done more work on them and because we've retired more risk and put in more development on our own steam, we would expect the economics to those to be considerably accretive to the overall portfolio in that 4.2%.\n\nAgain, in the extreme case, the first pre-partnered program, of course, was the COVID molecule. And while the situation was exceptional there, it resulted in a very high royalty, sort of proving out the business model that we've chosen, overall, how to capture value in the success of the molecules that we work on.\n\nAntonia Borovina -- Bloom Burton -- Analyst\n\nOK. And then, just moving to the Regeneron deal, so I believe the deal was focused on four different targets, and one is advancing to preclinical development. So, just wondering if there's still a possibility to advance the other three targets? Or was it just this one target that was selected to go forward?\n\nCarl Hansen -- Chief Executive Officer and President\n\nYes. So the original deal was with four targets, this is just the first one that has moved forward, and the other programs are still live. So, we're hopeful that those will also move forward.\n\nAntonia Borovina -- Bloom Burton -- Analyst\n\nOK. And then, related to that, we've seen some other big pharmas acquiring technologies to move GPCR drug discovery in-house. So, maybe you could just speak to what was the key selling point for executing this deal with Regeneron. Was it primarily focused on the speed of the platform? Or was it -- were you able to demonstrate that you could identify drug candidates that they couldn't have?\n\nCarl Hansen -- Chief Executive Officer and President\n\nYou know, I wouldn't speculate on what was the single, you know, value proposition that resulted in the deal with Regeneron. It's a multi-target partnership. And there's a multiplicity of ways in which we see synergy between our capabilities and theirs. And obviously, Regeneron is a very well-enabled and sophisticated partner, and one that we're very happy to be working with.\n\nMore generally, in the class of GPCRs, and I would put ion channels another difficult targets in there, that tends to be one of the places where we have had the most engagement with the large and well-enabled firms. And typically, it is because these groups have tried or they have experienced with similar target classes and have realized that the existing conventional technologies are not up to the task. And so, the value proposition there is to take a target or a program that is completely stuck, get it unstuck, and help move it toward clinical development in what are often potentially first-in-class, very high value, unmet medical need indications.\n\nAntonia Borovina -- Bloom Burton -- Analyst\n\nOK. Thanks for the color.\n\nOperator\n\nThank you. There are currently no additional questions registered at this time, so I will pass the conference back over to Carl Hansen for closing remarks.\n\nCarl Hansen -- Chief Executive Officer and President\n\nThank you, everyone, for joining the call today. We look forward to providing further updates and wish you a good night.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTryn Stimart -- Chief Legal Officer and Chief Compliance Officer\n\nCarl Hansen -- Chief Executive Officer and President\n\nAndrew Booth -- Chief Financial Officer\n\nDo Kim -- Piper Sandler -- Analyst\n\nUnknown speaker -- SVB Leerink Partners -- Analyst\n\nGaurav Goparaju -- Berenberg Capital Markets -- Analyst\n\nSteve Willey -- Stifel Financial Corp. -- Analyst\n\nGary Nachman -- BMO Capital Markets -- Analyst\n\nAntonia Borovina -- Bloom Burton -- Analyst\n\nMore ABCL analysis\n\nAll earnings call transcripts"
}