{
  "companyName": "Nordstrom",
  "companyTicker": "JWN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/nordstrom-jwn-q2-2022-earnings-call-transcript/",
  "content": "Nordstrom (JWN 0.31%)\nQ2 2022 Earnings Call\nAug 23, 2022, 4:45 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Nordstrom second quarter 2022 earnings conference call. [Operator instructions]. We will begin with a prepared remarks, followed by a question-and-answer session. [Operator instructions].\n\nAs a reminder, this conference is being recorded. At this time, I'll turn the call over to Heather Hollander, head of investor relations for Nordstrom. You may begin.\n\nHeather Hollander -- Head of Investor Relations\n\nGood afternoon, and thank you for joining us. Before we begin, I want to mention that we'll be referring to slides, which can be viewed in the investor relations section on nordstrom.com. Our discussion may include forward-looking statements, so please refer to the slide with our safe harbor language. Participating in today's call are Erik Nordstrom, chief executive officer; Pete Nordstrom, president and chief brand officer; and Anne Bramman, chief financial officer, who will provide a business update and discuss the company's second quarter performance.\n\nAnd now I'll turn the call over to Erik.\n\nErik Nordstrom -- Chief Executive Officer\n\nThank you, Heather, and good afternoon, everyone. Thank you for joining us today. We delivered solid results in the second quarter with topline growth, increased profitability, and continued progress toward our long-term strategic and financial goals. We delivered these results despite customer demand decelerating significantly in late June predominantly at Nordstrom Rack and in our lowest income customer cohorts.\n\nThough second quarter was consistent with our previous guidance, we are updating our outlook for the balance of the year to reflect the softening trends and actions we are taking to reduce our inventory levels. In the second quarter, customers continued to shop for occasions while also refreshing their wardrobes, which drove demand for our core categories and services. We know customers look to us for the occasions that matter most, and we are well-positioned to serve them with our differentiated product offering, the convenience of our interconnected model, and our commitment to customer service. Total sales increased 12% over last year, which includes a benefit of approximately 200 basis points from one  week of the anniversary sales shifting into the second quarter.\n\nTotal digital sales grew 6%. Nordstrom banner sales and gross merchandise value, or GMV, each increased 15% over last year, and sales showed sequential improvement over pre-pandemic levels. Rack sales grew 6%. Before I discuss the second half of the year, I'll share our perspective on spending and behavior within our customer base.\n\nAs we discussed while reporting our first quarter results, at the time, we did not see macroeconomic pressures adversely impact customer spending, which we attributed to the higher income profile of our customer base. This continued through most of the second quarter until late June, when demand began to soften, mostly in Nordstrom Rack. Compared to the first two months of the quarter, July sales decelerated 9 percentage points in the Rack banner. Across both banners, the softening trend was more significant in customer segments with the lowest income profiles, while we saw greater resilience in the higher income segments.\n\nFor example, in the Nordstrom banner, items with lower AURs underperformed higher AURs. Within our designer business, higher-priced luxury products significantly outperformed lower-priced product. Customers sought newness and responded very positively to the fall assortment overall, but were less responsive to our private label product and clearance items. Taking all this into account, we are updating our 2022 financial outlook to reflect the deceleration at the end of the quarter as well as anticipated margin pressure from clearing through excess inventory.\n\nAnne will provide more detail on those updates. We are prioritizing actions in the short term to position our business for success in a rapidly evolving environment. This means adjusting our plans for the second half, aligning our expenses to those plans, reducing inventory levels, and exiting the year in a clean and current inventory position. At the same time, we continue to focus on improving Rack performance, increasing profitability and optimizing our supply chain and inventory flow.\n\nWe are making progress in these initiatives. And while they will not fully offset the gross margin impact of our inventory reductions this year, we expect them to benefit our performance in 2023 and beyond. While we take action to address these short-term headwinds, we will continue to build additional capabilities to better serve customers and drive profitable long-term growth with a focus on winning in our most important markets, advancing our digital capabilities and improving Nordstrom Rack performance. A fundamental component of our closer-to-use strategy is winning in our most important markets.\n\nOur strategy provides customers convenience, connection and access to the best product selection through a strong store fleet, two unique banners and omnichannel capabilities linked at the market level. For example, during this year's anniversary sale, as customers utilized the convenience of our integrated touch points, order pickup in stores increased 9% compared to last year's event. Building on our progress, this quarter, we scaled our Closer to You strategy by expanding next-day order pickup capabilities to more than 60 additional Rack stores in our top 20 markets. And our top 20 markets outperformed our other markets by 7 percentage points.\n\nWe also continue to advance our digital capabilities working to further extend our heritage of customer service and personalization to a digital world. We are scaling our styling program and offering a range of digital services, including stylist-inspired looks, virtual style boards and online styling appointments. While we still see the highest number of customers engaged with our in-person styling, we are seeing rapid growth within these digital services. Digital styling customers are also highly engaged, spending five times more than an average Nordstrom customer.\n\nFinally, we continue to focus on improving Nordstrom Rack performance by increasing our supply of premium brands, improving our assortment and growing brand awareness. We are making progress and have driven sequential improvement in sales growth versus pre-pandemic levels the last three quarters since initiating these work streams. We're also encouraged by the positive customer response to our growth initiatives. For example, we are seeing strong early results from our Rack beauty program expansion.\n\nDespite this progress at Rack in the first half of the year, demand trends decelerated significantly in late June. The deceleration was more pronounced in the lowest income customer segments, which represent a greater proportion of Rack's customer base than at Nordstrom. We also have more work ahead to fully optimize our Rack assortment. As we've said before, 90% of the top brands at Nordstrom are sold at Nordstrom Rack.\n\nPremium brands are a differentiator for the Rack, and we are focusing on having the best brands at the best prices at each of our locations. This quarter, sales of our top 100 brands at the Rack increased 17%, which underscores the opportunity from increasing our supply of premium brands. In addition to improving penetration of premium brands, we are shifting away from the lower price point items that have not resonated with Rack customers. As Pete will describe later, we are taking aggressive action to clear through this inventory in the second half of the year.\n\nWe believe that increasing the penetration of top brands at the Rack will differentiate our offer and fuel our growth. In closing, though we face uncertainty as the consumer shifts, we have a seasoned team that has successfully managed through a range of business cycles. We have continued to build on our legacy of being a market leader in customer service that is always a result of our teams putting the customer at the center of everything we do. We are fortunate to have so many people with us who truly care about the customer.\n\nWe have a strong balance sheet and cash position. And through investments in our Closer to You strategy and digital assets, we are well-positioned to capture pockets of demand. We are taking the necessary steps to navigate the short term while also continuing to invest in capabilities to better serve our customers, drive long-term profitable growth, and increase shareholder value. With that, I'll turn it over to Pete.\n\nPete Nordstrom -- President and Chief Brand Officer\n\nThanks, Erik. I'll begin by talking about our category performance and the anniversary sale. Then I'll discuss the actions we're taking to clear through excess inventory in the second half of the year. Finally, I'll update you on our work to improve supply chain and inventory flow and increase gross margin.\n\nStarting with the category performance. We were pleased to see customers shopping for events and updating their closets this quarter, driving double-digit growth over last year in both men's and women's apparel. Sales of occasion-based items such as suiting and dresses were particularly strong. Both our shoes and beauty categories also had double-digit growth this quarter with Shoes performing well across dressy and casual styles.\n\nBeauty's results were supported by our expanded offering at the Rack. Designer also posted double-digit growth, although growth trends decelerated. As Erik indicated, higher-priced premium products significantly outperformed lower-priced product. Turning now to our anniversary sale.\n\nAs always, the anniversary sale rewards and engages our loyal customers as we offer new product from the best brands at reduced prices for a limited time. Each year, we use a data-driven process to evolve and improve event performance. This quarter, total anniversary event sales increased 5% over last year, including one day that fell in the third quarter, despite softening customer trends that began in late June. We were pleased to see customers responding positively overall to new fall product during the event.\n\nHowever, private label product underperformed, leaving us with a portion of that inventory to clear in the third quarter. While our sales to inventory spread improved in the second quarter, we are reducing our sales plans and inventory levels in the second half of the year. We are taking action to align our inventory with current demand trends and improve the balance of our offering by clearing through product that customers are not responding to and focusing on the fashion and newness they want. Our rightsizing efforts are focused in the following areas: First, customers have been less responsive to clearance product.\n\nIn the second quarter, we had to take deeper markdowns than anticipated to move clearance inventory, and we expect that dynamic to continue in the second half of the year. Second, we are disappointed in the performance of our private label product. We have brought in new leadership and are resetting our strategy to deliver more compelling product to our customers. Third, though designer category sales are still posting double-digit growth, trends have decelerated.\n\nWe are anticipating increased markdown pressure based on current sales trends. And finally, we are clearing through lower price point items at Nordstrom Rack to make room for the premium brands at great prices that drive the Rack business. We expect that this clearance activity and associated markdown pressure will reduce second half gross profit by approximately $200 million, which we're reflecting in our updated outlook. We estimate that approximately half of this additional markdown pressure reflects actions we are taking to improve our assortment.\n\nThe other half is related to external factors such as softening demand and our expectation that the promotional environment in retail will become more competitive in the second half of the year. We are taking aggressive action to clear through excess inventory and plan to have inventory clean and current by the end of the year. While this clearance activity exerts pressure on gross profit in the near term, it is necessary to align with consumer shifts and implement strategies that will drive our longer-term growth and profitability. We are also taking action to deliver operational efficiencies through our supply chain optimization work and we are making good progress.\n\nWe realized initial benefits from our improved supply chain capabilities in this year's anniversary sale. With better inventory flow, we delivered product to our customers three days faster on average, reduced order cancellation rates and decreased handling cost per unit. In the second half of the year, we expect to deliver more significant customer benefits and operational efficiencies by accelerating our work on the following four initiatives: First, improving the consistency and predictability of unit flow through our network; second, increasing productivity in our distribution and fulfillment centers; third, accelerating delivery speed; and finally, expanding the market level selection for in-store shopping as well as same day and next day pickup. Beyond supply chain improvements, we remain focused on expanding our merchandise margins over the long term using advanced analytics to better understand customer needs, identify opportunities to improve assortment, increase promotional effectiveness, and optimize markdowns.\n\nMost importantly, we know that managing our inventory levels conservatively will allow us to be more agile in responding to a rapidly changing business environment. In closing, we're taking action to rightsize our inventory, improve our sales to inventory spread, and enter 2023 in a clean inventory position. We're confident in our ability to deliver long-term benefits from our supply chain optimization work and improved merchandising capabilities. I'll now turn it over to Anne to discuss our financial results.\n\nAnne Bramman -- Chief Financial Officer\n\nThank you, Pete. I'd like to start with a review of our results then take you through our outlook for the remainder of the year. Earnings for the second quarter were $0.77 per diluted share. After excluding charges related to the wind down of Trunk Club, adjusted EPS was $0.81.\n\nOverall, net sales increased 12%, which includes a benefit of approximately 200 basis points from one week of the anniversary sales shifting into the second quarter. Nordstrom banner sales and GMV grew 15% with sales exceeding pre-pandemic levels. Nordstrom Rack sales increased 6% in the second quarter. Digital sales increased 6% and represented 38% of total sales during the quarter.\n\nGross profit as a percentage of net sales increased 65 basis points, primarily due to leverage on buying and occupancy costs, partially offset by higher markdown rates on clearance product. Ending inventory increased 10% versus a 12% increase in sales. Total SG&A as a percentage of net sales decreased 15 basis points due to leverage on higher sales partially offset by higher labor expense. Inflationary cost pressures were consistent with our expectations.\n\nSince last year, we've been making progress on our supply chain optimization initiatives to provide offsets to labor and fulfillment cost pressure. We expect that these initiatives will deliver more significant benefits in the second half of the year. EBIT margin was 5.1% of sales for the second quarter. After excluding charges related to the wind down of Trunk Club, adjusted EBIT margin was 5.3%.\n\nWe maintained a strong financial position ending the second quarter with $1.3 billion in available liquidity, including $494 million in cash and the full $800 million available on our revolving line of credit. Now turning to our updated outlook for fiscal 2022. In the first quarter, we were encouraged by the momentum in our business as customers updated their wardrobes and prepared for occasions. As we described on our Q1 call, we had not seen an adverse impact on customer spending from inflationary pressures.\n\nThat continued until late June when demand began to soften, predominantly at Nordstrom Rack and in our lowest income customer segments. We reacted quickly to the shift by managing expenses and aligning staffing schedules. As Pete described, we are rightsizing and rebalancing our inventory in the second half of the year to address customer demand shifts and improve our assortment. Taking all these factors into consideration, we are updating our 2022 financial outlook to reflect deceleration at the end of the second quarter, reduced topline growth expectations for Nordstrom Rack, and increased markdown pressure.\n\nFor fiscal year 2022, we now expect revenue growth of 5% to 7% versus 2021, supported by high single-digit sales growth in the Nordstrom banner. We expect adjusted EBIT margin of approximately 4.3% to 4.7% for the full year, up from 3.4% in 2021. Our forecast assumes that EBIT margin improvement for the year will be driven by SG&A leverage. Though first half gross profit margin improved by 115 basis points over last year, we expect gross profit to be roughly flat for the full year.\n\nOur revised outlook reflects approximately $200 million of incremental markdown impacts in the second half relative to our previous outlook. Despite our lower sales outlook, our SG&A leverage assumptions for the year remain unchanged. Though we are facing inflationary expense pressures, we contemplated that pressure in our outlook at the beginning of the year along with the offsetting benefits of our supply chain optimization initiatives. Our effective tax rate is expected to be approximately 27% for the fiscal year.\n\nWe now expect adjusted EPS of $2.30 to $2.60. Our outlook excludes the impact of any future share repurchases. I'd also like to provide some additional detail on our forecast for the third quarter. At the beginning of the year, we expected that third quarter year-over-year sales growth would decelerate versus the second quarter, given tougher prior year comparisons and the anniversary sales shift.\n\nDue to the demand deceleration we saw in the latter part of the second quarter, we now expect a mid-single-digit decrease in revenue in the third quarter versus the prior year. Our projections include the impact of one week of our anniversary sales shifting out of the third quarter, which reduces revenue growth by approximately 200 basis points. We anticipate that third quarter EBIT margin will be approximately 200 basis points below last year's third quarter. Our forecast assumes that the $200 million of incremental markdown pressure in the second half of the year will be split relatively evenly between the third and fourth quarters.\n\nTurning to capital allocation. Our first priority is to invest in the business to better serve our customers and support longterm growth. We're planning capital expenditures at normalized levels of 3% to 4% as we continue to invest in supply chain and technology capabilities. Our second priority is reducing our leverage.\n\nWe are committed to an investment-grade credit rating and expect to decrease our leverage ratio below 2.9 times by the end of 2022. We continue to target a leverage ratio below 2.5 times. Our third priority is returning cash to shareholders. Last week, our board of directors declared a quarterly cash dividend of $0.19 per share.\n\nIn the second quarter, we also repurchased approximately $35 million of our stock at an average price of $23 per share. We have approximately $465 million remaining on our share repurchase authorization. We will continue to take a measured approach to share repurchases this year, aligning with our cash flow and market conditions. In closing, though customer demand decelerated at the end of the quarter, we are encouraged by continued demand for occasion-based apparel and wardrobe refreshes as well as big ticket items.\n\nWithin Nordstrom Rack, despite a recent softening of demand, customers are responding well to our growth initiatives and we are actively working to improve our supply of premium brands. Though clearance activity in the second half of the year will pressure gross profit, we still expect to drive SG&A benefits from our supply chain optimization work and expense management, and we still plan to increase our year-over-year profitability. We remain confident in our ability to navigate the current environment and deliver on our long-term strategic and financial goals. With that, Heather, we're now ready for questions.\n\nHeather Hollander -- Head of Investor Relations\n\nThank you, Anne. Before we get started with Q&A, we ask that participants limit their responses to one question and one follow-up. We'll now move to the Q&A session.\n\nOperator\n\n[Operator instructions]. Our first question comes from the line of Edward Yruma with Piper Sandler. Please proceed with your question.\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nHey, good afternoon, guys. Thanks for taking the questions. Two for me. I guess first, you guys had kind of opened up the aperture on Rack price points, particularly at the lower end a couple of years ago really indicated that you thought you could gain an incremental consumer.\n\nI guess is the commentary on reducing some of the lower price offering backing away from that strategy? Are there doors that are now probably not productive given that? And then as a follow-up, I just want to -- not to draw a few final point on a bit, a lot of companies indicated that the end of July got better. I guess, did you see any kind of stabilization of trend in either Rack or full line? \n\nAnne Bramman -- Chief Financial Officer\n\nYes. Erik, do you want to take the first couple of questions there?\n\nErik Nordstrom -- Chief Executive Officer\n\nSure. So yes, our price points, we highlighted having some lower price points, and as we talked about last year, our Rack inventory got a little out of balance from adding some of that product and the difficulty in obtaining the level of premium brands that we'd like. So we really entered this year with a singular focus of having great brands at great prices. That is what differentiates us.\n\nThe brands we carry in Rack are unique in the off-price environment. And it's what customers come to Rack for. So that is our strength. And to your question, the lower price point product we brought in, some of it performed well.\n\nBut in general, we're looking to rebalance our inventory to have a greater proportion of those premium brands in our inventory and lessen the amount that's in those lower price points. As for the end of July, we did, as we mentioned, saw a clear deceleration at the end of June. It bounced around a bit from end of June to the end of the quarter. And I think it's quite not a shock to say that it's a volatile environment.\n\nSo I don't think it's appropriate to make too much out of a week or two one way or the other. We saw a change in particularly lower income customer segments. And we think the prudent thing is to change our plans accordingly.\n\nAnne Bramman -- Chief Financial Officer\n\nYes. And I would just add on to that, that we did see June, July, particularly in Rack with the meaningful deceleration of trend. In the Nordstrom banner, we had a plus 5% in the anniversary sale. And really where we saw some softness within our private label that Pete talked about in his comments, as well.\n\nSo in general, the core categories for the Nordstrom banner are performing well. We just -- we had a pocket with the private label that wasn't performing well, particularly in anniversary sale in July, but really the deceleration we saw within the Rack customer.\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nThank you. \n\nOperator\n\nNext is Omar Saad with Evercore. Please proceed with your question.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nThank you. A couple of quick questions. Overall, maybe your learnings and satisfaction level with the anniversary sale. You guys are pretty optimistic going in.\n\nAnd then maybe talk a little bit about private label. I know you've got some initiatives underway to get that back on the right course. So maybe talk a little bit more detail what went wrong with the offering in private label. Was it too much, too little, too much fashion, wrong type of inventory? A little color there would be great.\n\nThank you.\n\nAnne Bramman -- Chief Financial Officer\n\nGreat. So, Erik, do you want to take the anniversary sale? And Pete, maybe follow up on the private label?\n\nErik Nordstrom -- Chief Executive Officer\n\nYes. So Vans data, our anniversary sale turned into 5% increase overall. And that was lower than our plans and off our trend year-to-date at that point. It's kind of a mixed bag.\n\nSay we saw strong sell-throughs in a number of products. In general, it was higher AUR products that did better. Our branded products did better. The softness call out -- I've made two call-outs.\n\nOne is our private label business, which will set up your second question. And also, we've seen a softness in clearance business. And while anniversary is not a clearance event, clearance is always a portion of our inventory and an important portion. And we've seen that there is a softness in demand for clearance product.\n\nThe customers are more interested in newness than they are in reduced prices on clearance merchandise. So for the private label in clearance both were drivers of some of the softness that we saw in anniversary.\n\nPete Nordstrom -- President and Chief Brand Officer\n\nYes. This is Pete. The double-click in the private label. I think the biggest challenge there is the fact that it's the longest lead time of anything that we do.\n\nAnd if you think about the last couple of years in the way customer demand has shifted and changed given the macro environment has put added pressure and stress on just our goal to be able to execute well. And I think that's probably not unique to us, but it's -- I think it also has revealed some of the vulnerability that we have in that part of our business and that when you talk about what's working, what's not, I mean, largely what it is, it's a bit of a glass ceiling in terms of the levels that we achieved over the years. And as we've tried to buy into more private label, you've heard us talk about the importance of that, we've not been able to execute that successfully. So we're really taking a scrub of all of it.\n\nWe changed our leadership there and we're looking at design, we're looking at pursing, we look at field to play, the categories where we think we have the chance to be successful. I mean all that is really on the table to consider it, and we're working on that right now. So it's still something -- it's a category that we want to get better at. It's important to our future.\n\nWe're investing in it. We have every reason to believe we will do better at it. But we've got to clear out some of the underperforming inventories that we get ourselves in a position probably a year from now, really kind of midpoint in '23, where you'll see us bending the curve of private label.\n\nAnne Bramman -- Chief Financial Officer\n\nYes. Omar, the other thing I would add is, from an execution perspective on Anniversary Sale, we, across the board, our team did a phenomenal job. We had great site traffic and volume on the site and great service on that. Our inventory flow was really well.\n\nWe shortened the number of days to deliver to customers from our supply chain. And of course, our selling teams were fantastic and engaging our customers. So from an execution perspective, we couldn't be prouder of our team in delivering a great event to our customers.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nThank you. Best wishes.\n\nAnne Bramman -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nNext is Matthew Boss with J.P. Morgan. Please proceed with your question.\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks. So, Erik, on the 900 basis points of sequential softening that you cited at the Rack, how much of the trend changed do you attribute to larger picture macro pressure versus more company-specific product assortments or inventory? And then at full-line, are there any merchandising initiatives in place to stabilize spending at the lower income customer cohorts that you cited?\n\nErik Nordstrom -- Chief Executive Officer\n\nThanks, Matthew. We've -- what does stand out with the softness that we've seen has been looking at customer segments by household income. And our customer household income is higher than average. But within the range of our customer segments, the lower income customer segments saw significantly more pullback versus the higher income.\n\nRack is more exposed to that customer. That customer makes up a bigger portion of our Rack customer base than it does the Nordstrom banner. So there is a pretty clear correlation there, which leads us to believe that a significant part of the pullback is macro. As far as the full-line stores focusing on stabilizing at lower income customer segment, what we think we're best served at what really cuts across and I want you to take away from what you're hearing here is we're in volatile times.\n\nAnd that it seemed that way for a while. But the uncertainty moving forward is significant. And there's cases to be made that things could get better pretty quickly. And then there's credible cases to be made that it's going to be tough.\n\nWe think we're well served by having plans that give us flexibility and allow us to be agile and responsive. And I see the case for responding to customers, we need to be able to respond not only customer income segments, but category to category, you've seen a significant shift in demand by category over the last two years. And we think we need to be able to be super responsive to that. So what do we do about that? First thing we do is bring inventory levels down.\n\nAnd while they're not super high right now. We really want to give ourselves that flexibility. And we have segments of our inventory that are less productive, which there always is, but that gap, and I mentioned clearance earlier, the softness there. That gap between that less productive part of the inventory and the more productive part is unusually high, which the nice part about that is there is -- the customer is spending.\n\nThere's product that customer is responding to. The pressure that puts on us is we have segments of our inventory that are preventing us from being as responsive to the customer as we want to be. So that's our message here is get our inventories down to where we can be really responsive no matter where it goes because regardless of what I say here today, how it plays out the rest of the year more likely it's going to be a little different than I think anyone would say. So that's what we're looking to really address those less productive parts of our inventory, clean that up, get us in a position where we're flexible and can be agile to respond to whatever the customer demands are.\n\nOperator\n\nThank you. Next is Noah Zatzkin with KeyBanc. Please proceed with your question.\n\nNoah Zatzkin -- KeyBanc Capital Markets -- Analyst\n\nHi. Thanks for taking my question. I think last quarter, you mentioned that you're about 80% of the way there in terms of brand mix at the Rack. Where do you think you were ending this quarter? And how should we think about kind of the writing of the brand mix moving forward? You mentioned using the Rack as kind of a clearance channel.\n\nI think for some of the private label items that didn't sell through well in full-line. So just trying to think about the time frame for the brand next to be righted at the Rack. Thank you.\n\nAnne Bramman -- Chief Financial Officer\n\nErik, can you take that?\n\nErik Nordstrom -- Chief Executive Officer\n\nYes. Thanks, Noah. Yes, we -- the share of premium brands to our total mix has steadily grown this year. We still have a ways to go.\n\nWe're not at 100%, but the availability of that product has improved, and we expect that that will continue. And we have more confidence than ever that that's the right direction. The data point we shared with you for last quarter, if you take the top 100 brands in our Rack business, those brands grew 17% over last year. So significantly outperformed the business overall.\n\nSo we're not there. It's where we need to be. We still have some pockets of our inventory that are almost down a bit. We have clearance in both banners that we need to clean up.\n\nAnd for Rack in particular, it's particularly important, and it's a particularly opportune time to have open to buy dollars in our inventory to be able to get the great buys that are out there, and we think are going to be out there as there is excess inventory in the industry. So still ways to go, and we would expect that portion of premium brands to continue to grow as a proportion of our inventory.\n\nNoah Zatzkin -- KeyBanc Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nNext is Chuck Grom with Gordon Haskett. Please proceed with your question.\n\nCharles Grom -- Gordon Haskett Research Advisors -- Analyst\n\nThanks. Good afternoon. On the third quarter guide for a mid-single-digit decline, should we think about that pace at both banners? And then as we look ahead to the fourth quarter, it looks like you're expecting a big improvement on a one- and three-year basis in order to hit the new full year sales range. So I guess what's driving that assumption for the improvement in the fourth quarter?\n\nAnne Bramman -- Chief Financial Officer\n\nYes. Chuck, so a couple of things. We gave the guide for the second half. We talked about the fact that a shift in anniversary sale on a year-over-year basis, which will impact the Nordstrom banner component to -- it's a couple of hundred basis points.\n\nAnd so for the full year, we expect the Nordstrom banner to be mid-single-digit growth. And so we do believe that that will continue. So what I would also say is in the Rack, we did see deceleration as we've talked about. We are anticipating some continuing trends in that in the second half.\n\nSo when we look at the total year sales, we do -- and we're still seeing the customer respond really, really well to our core categories in the Nordstrom banner. So it is a bifurcated approach to the sales component to it. And I think for the Q4 piece to it as the anniversary last year, what I would say there's a couple of things in Q4 to think about: one, supply chain. We have a lot of supply chain issues in Q4 last year.\n\nWe got late deliveries for holiday, which we have pulled forward actually we'll start receiving quite a bit of that in Q3 as we prepare for Q4. And then the second component is particularly as it impacts our store business. Last year, as you guys all may recall, we had -- I think we all had the impact of the omicron variant particularly in the December time frame. So I would say it's a little bit easier to lap as you think about year-over-year.\n\nCharles Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK. That's helpful. And then the pace of credit revenue really slowed in the quarter, Macy's and Kohl's had similar developments over the past couple of days. Can you help us think about that line item in the second half of the year?\n\nAnne Bramman -- Chief Financial Officer\n\nYes. So from a credit perspective, overall, would say it's absolutely in line with what we were expecting to see. Throughout the quarter, we had a gradual increase in customer payment rates. But overall, the payment rates remained elevated above what we saw pre-pandemic.\n\nSo we saw a very different shift in the last few years. We're seeing a little bit of a different trend, but it's still much better than we saw in 2019. I think the other thing I would just say is, in general, we have -- this has not translated to losses impacting our credit card revenue in the quarter, and we'll continue to see very healthy portfolio. We're very pleased with our portfolio.\n\nCharles Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK. Great. Thanks, Anne.\n\nOperator\n\nNext is Katy Hallberg with Cowen. Please proceed with your question.\n\nKaty Hallberg -- Cowen and Company -- Analyst\n\nHi there. Thanks so much for taking our question. The first one is sort of if you're seeing any sort of sign of trade down either in the Rack or the Nordstrom businesses, just in terms of maybe more toward clearance or other basic items? And then second is just on the sort of different channels and how did the channels perform versus your expectations, specifically the digital performance, that would be great. Thank you.\n\nAnne Bramman -- Chief Financial Officer\n\nErik, do you want to take the first piece on the trade down compared to Rack?\n\nErik Nordstrom -- Chief Executive Officer\n\nSure. Quick answer is we have not seen a lot of evidence of trade down. As I mentioned earlier, clearance is actually been a real soft part of our inventory. So it's, I think, an example that we're not seeing customers looking really driven by price as the main driver.\n\nWhat we're seeing from our customers is they want what they want. They want newness. And lowering prices on what didn't sell at regular price is tougher. It's taking more markdowns to clear out older products.\n\nSo no signs of trade down.\n\nAnne Bramman -- Chief Financial Officer\n\nYes. I would just add on the pricing piece as Erik mentioned, it's kind of the opposite. I think it's reflected in the fact that we're having to take deeper marks on clearance than we normally would. It's a little bit different pattern and the sellthrough on our higher-priced items is actually quite strong.\n\nSo I think it's freshness, the newness, the fashion components to is what customers are really responding to. On your question on channel, I would just say in general, the channel performed in line with our expectations.\n\nKaty Hallberg -- Cowen and Company -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nNext is Tracy Kogan with Citi. Please proceed with your question.\n\nTracy Kogan -- Citi -- Analyst\n\nThank you. I was wondering if you guys could give any more color on the slowdown you mentioned in designer? I was wondering if it was across all designer categories? And did the slowdown correspond with the slowdown in the Rack business at the end of June? And just was wondering any more color you can give there. Thanks.\n\nPete Nordstrom -- President and Chief Brand Officer\n\nYes, this is Pete. This is kind of a nuance deal because we've been talking about, gosh, for quite some time that the designer power business is the fastest growing and the strongest part of our business. And we're still having really good growth there, raving double-digit growth. But fact is there has been some deceleration.\n\nSo our -- what we bought into our plans that are generated were those plans happened before we saw the deceleration. So we were buying into an elevated plan compared to what the actual consumer demand trend is. So that's what that's about. I think if you want to parse it and see exactly what's happening, what we're tending to see is in the range of what happens is designer some of the lower-priced more item-oriented parts of those businesses has slowed down, some compared to what would really be the higher end of the luxury part That's super durable.\n\nSo we're continuing to work through that and look at it. As we get flow and newness, that's always good, but it's really just a quantity issue here that I think in certain parts of the business, we're taking a cautious approach on and just being prepared that if we don't see a change in that customer sentiment, we should be prepared for perhaps promotional activity that would happen later on this year, and we're preparing for the possibility of that.\n\nTracy Kogan -- Citi -- Analyst\n\nSo would you say when you noted that kind of the lower price points, I guess the entry price points of some of these designer brands are slowing. Is it -- is it more that that maybe aspirational customer is kind of trading out of the true luxury brand? Or is there not enough evidence of that?\n\nPete Nordstrom -- President and Chief Brand Officer\n\nNo, I think that could be. I don't know that we know that specifically, but I think that's a reasonable assumption to make. I mean if you look at the breadth of our customer base, that very well could be what we're seeing. We're learning more all the time and try to stay close to that.\n\nTracy Kogan -- Citi -- Analyst\n\nRight. Thanks very much.\n\nAnne Bramman -- Chief Financial Officer\n\nAnd we have time for one more question.\n\nOperator\n\nOur last question comes from Simeon Siegel with BMO Capital Markets. Please proceed with your question.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nThanks. Hey, everyone. Hope you had a nice summer. Within that 17%, if I heard correctly, the top 100 brands, any way to think through what that is between AUR and units -- and then -- and if I can just ask three quick ones on inventory.\n\nInventory, how has the inventory changed between Rack and full price and then maybe the change in units versus dollars? And then just any update on how you're thinking about inventory in packaway. Sorry, I know there was a bunch in there.\n\nAnne Bramman -- Chief Financial Officer\n\nSo, Erik, do you want to start with the 17% brand?\n\nErik Nordstrom -- Chief Executive Officer\n\nYes. It's sum of both. And we're not going to break it out specifically. It's sum of both.\n\nBut we are -- what we're encouraged about is as we increase proportion of our inventory in these premium brands. So adding units, the proportion of our inventory and dollars, we're seeing increased sales. So the 17% would be both AUR and units increased.\n\nAnne Bramman -- Chief Financial Officer\n\nYes. So on the inventory piece, we really don't split out the inventory components to it. What I would say is that we're working to get through. We saw inventory increase in both banners, and we're taking markdowns in both banners as well.\n\nAnd our intent is to be very clean really on the current inventory that we own by the end of Q3. And I think what you see in the guide is the fact that 50-50 the markdown between Q3, Q4. Q4 really contemplates what we anticipate to be a continued highly promotional environment in Q4. So it's really baking in what we think it could be a more -- continued pressure on the promotional environment inventory at that point.\n\nSo the plan, the intent is to be out of -- to reduce the current inventory to plan and be thoughtful and have powder dry in Q4 and exit '23 very, very clean as we continue to be responding to the customer in a volatile environment.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nGreat. Thanks so much. Best of luck for the rest of the year.\n\nAnne Bramman -- Chief Financial Officer\n\nThank you. We want to thank you for joining today's call. A replay, along with the slide presentation and prepared remarks, will be available for one year on our website. Thank you for your interest in Nordstrom.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHeather Hollander -- Head of Investor Relations\n\nErik Nordstrom -- Chief Executive Officer\n\nPete Nordstrom -- President and Chief Brand Officer\n\nAnne Bramman -- Chief Financial Officer\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nOmar Saad -- Evercore ISI -- Analyst\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nNoah Zatzkin -- KeyBanc Capital Markets -- Analyst\n\nCharles Grom -- Gordon Haskett Research Advisors -- Analyst\n\nKaty Hallberg -- Cowen and Company -- Analyst\n\nTracy Kogan -- Citi -- Analyst\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nMore JWN analysis\n\nAll earnings call transcripts"
}