{
  "companyName": "FTC Solar, Inc.",
  "companyTicker": "FTCI",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/ftc-solar-inc-ftci-q2-2022-earnings-call-transcrip/",
  "content": "FTC Solar, Inc. (FTCI 5.10%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and welcome to the FTC Solar second quarter 2022 earnings conference call. [Operator instructions] Please note this event is being recorded. At this time, I would now like to turn the conference to vice president of investor relations, Mr. Bill Michalek.\n\nPlease go ahead.\n\nBill Michalek -- Vice President, Investor Relations\n\nThank you, and welcome, everyone, to FTC Solar's second quarter 2022 earnings conference call. Prior to today's call, you'd likely had an opportunity to review our earnings release, supplemental financial information and slide presentation, which were posted earlier today. If you've not yet reviewed these documents, they are available on the investor relations section of our website at ftcsolar.com. I'm joined today by Sean Hunkler, FTC Solar's president and chief executive officer; Phelps Morris, the company's chief financial officer; and Patrick Cook, the company's chief commercial officer.\n\nBefore we begin, I remind everyone that today's discussion contains forward-looking statements based on our assumptions and beliefs in the current environment and speak only as of the current date. As such, these forward-looking statements include risks and uncertainties and actual results and events could differ materially from our current expectations. Please refer to our press release and other SEC filings for more information on the specific risk factors. We assume no obligation to update such information, except as required by law.\n\nAs you'd expect, we will be discussing both GAAP and non-GAAP financial measures today. Please note that the earnings release issued this morning includes a full reconciliation of each non-GAAP financial measure to the nearest applicable GAAP measure. In addition, we'll discuss our executed contract and awarded orders and our definition for that metric is also included in our press release. With that, I'll now turn the call over to Sean.\n\nSean Hunkler -- President and Chief Executive Officer\n\nThanks, Bill, and good morning, everyone. I'm going to start again this quarter with an update on the market environment as there's been a fair amount of activity. As you may recall, at the time of our last update in May, the antidumping countervailing duties investigation or AD/CVD, with its risk of significant retroactive tariffs, was by far the biggest concern in the industry. That, along with some lingering WRO related import concerns, had essentially halted U.S.\n\nimports of most solar modules and module makers had idled their factories. As a result, U.S. solar project construction time lines and decisions on new projects were pushed to the right. Since then, the President issued an executive order in June that essentially removes the AD/CVD tariff risk for 24 months.\n\nThe market cheered this news and we have seen a marked increase in customer activity and discussion around projects since the executive order. At the same time, however, the Uyghur Forced Labor Prevention Act, or UFLPA, became effective in June, resulting in new rules for module importers and reviews by customs and border patrol. There is still a bit of uncertainty in the market around achieving full compliance with UFLPA, whether related to sufficient mapping of materials or other factors. Once there is additional clarity around this and customers get line of sight to module deliveries, we believe the market will see a swift and substantial recovery.\n\nOne other potential change that is on the table is the proposed Inflation Reduction Act, which includes incentives and an extension of the investment tax credit. While there are already many underlying drivers of growth in the solar industry, we believe this bill would serve to further bolster and extend future demand. Based on our recent channel checks and customer discussions, we are hearing that many EPCs and developers are anticipating clarity on module supply within a late August, early September time frame. There is such a significant amount of pent-up demand in the market with both delayed 2022 projects and a strong funnel of new 2023 projects that some customers are worried about the availability of sufficient labor and materials to meet the demand.\n\nOur focus at FTC Solar during this regulatory-driven downturn has simply been to best position ourselves to capture that demand, to emerge even stronger when modules start flowing again and to grow faster than the market once again with significant enhanced profitability. To that end, we have focused on a few key things. Gross margin improvement through our design-to-value initiative. We continue to take costs out of our tracker systems, enabling future projects to be at higher margins than historical, building our DG business, which has higher margins, improving our operational efficiency and controlling costs, building and strengthening customer relationships, accelerating international growth.\n\nAnd finally, one that cuts across both growth and profitability is strategic R&D. We have an incredible R&D team. We have continued to invest in this area and are excited about our R&D pipeline of new products. We'll talk more about this in future calls.\n\nSo those are our focus areas. And despite the recent industry environment and slowdown, we have made good progress and have several highlights from the quarter. We added a significant $141 million to customer bookings since our last update, bringing total contracted and awarded now to $774 million. This includes the addition of a new top 10 utility customer and a new strategic EPC customer.\n\nIt also includes an award for our first project in Thailand, continuing our international expansion and following the additions of Kenya, Malaysia and South Africa last quarter. As we talked about last quarter, the vast majority of our contracted and awarded moving forward will be at a significantly improved margin profile relative to historical projects as we have taken cost out of our systems. As our old projects roll off in Q3 and new projects begin in Q4, we expect this improvement to become very apparent in Q4 margins, and Phelps will talk more about that shortly. We continue to believe that we're well positioned to make significant progress toward our stated long-term target gross margins in the 20-plus-percent range when project activity normalizes.\n\nWe've grown our pipeline to a new record high at more than 86 gigawatts. The international growth has been exceptional, and now, for the first time, stands at more than half of our total pipeline. We also closed on the HX transaction during the quarter and we believe it will provide many benefits, including further accelerating our international expansion, providing complementary 1P technology and strengthening our capabilities. And in DG, we've continued our progress and just yesterday, announced that AUI Partners will be our EPC partner.\n\nOur DG business is focused on providing rapid design through installation services for sites under 20 megawatts. The offering includes fast quotes and all the benefits of our differentiated tracker systems and software with delivery lead times as short as eight weeks. We're excited about the margin profile of this business and are off to a good start in terms of demand. So in summary, volumes are depressed at the moment in this module constrained environment but the pent-up demand is incredibly large.\n\nOur legacy projects roll off after Q3 and we now have a strong cost structure as we move forward. We're building backlog and pipeline, adding new customers, including in new countries. Simply put, we believe our actions during this industry slowdown have positioned us to outpace market growth once again when modules start to flow normally and to do so with significantly improved profitability. With that, I'll turn the call over to Phelps to provide more detail.\n\nPhelps Morris -- Chief Financial Officer\n\nThanks, Sean, and good morning, everyone. As a follow-up to Sean's comments, I'd like to provide some additional color on the second quarter performance and our outlook. Beginning with the results in the second quarter, our results were generally in line with expectations with adjusted EBITDA and gross margins coming ahead of our midpoint of our guidance range, while revenue was at the lower end. Specifically, second quarter revenue was $30.7 million, which was at the lower end of our guidance range and reflects the lower demand environment in the U.S.\n\nand makes the regulatory backdrop of AD/CVD, WRO, UFLPA, that Sean talked about. This revenue represents a decrease of 38% compared to the prior quarter and a decrease of 39% year over year, driven by lower volumes and partially offset by higher ASPs. GAAP gross loss was $6.5 million or 21.2% of revenue compared to $9.3 million or 18.7% of revenue in the prior quarter. Non-GAAP gross loss was $5.4 million or 17.5% of revenue.\n\nThe margin percentage was better than our guidance range as some of the lower-margin logistics revenue shifted between quarters into Q3. On a sequential basis, the non-GAAP margin percentage was approximately flat as improved product and logistics direct margins were offset by reduced overhead cost absorption on the lower revenue levels. GAAP operating expense was $18.7 million. On a non-GAAP basis, excluding stock-based compensation and certain other expenses, operating expenses were $12.4 million compared to $8.3 million in the year ago quarter.\n\nThis was a bit higher than our guidance range due to a $1.1 million allowance for doubtful accounts and a small amount of ATX tracker operating expenses that were not included in our guidance. The year-over-year increase was driven primarily by the same items as well as the necessary growth in staffing and other costs related with becoming a public company last year. GAAP net loss is $25.7 million or $0.26 per share compared to a loss of $27.8 million or $0.28 per share in the prior quarter and compared to a net loss of $52.4 million or $0.61 per share a year ago quarter. Adjusted EBITDA loss, which excludes approximately $7.9 million of expenses, such as stock-based compensation expense, certain consulting and legal fees, severance and other non-cash items was $17.7 million.\n\nThis was better than the midpoint of our guidance range and the results compared to an adjusted EBITDA loss of $20 million in the prior quarter and $16.7 million in the year ago quarter. Regarding liquidity, we generated positive cash flow in Q2 of $17 million and ended the quarter with a cash balance of $66 million. In addition, we amended our revolving credit facility during the quarter, which, among other modifications made reduced liquidity covenant from $125 million to $50 million for Q1 2023, providing enhanced liquidity for the company. With that, let's turn to our outlook.\n\nWe expect the third quarter represents a low watermark in terms of revenue and margins. Third quarter revenue consists primarily of in-flight legacy projects with new projects largely being delayed beyond Q3 due to the module supply issues. Our gross margin expectations reflect these low-margin legacy projects being delivered, a higher percentage of logistics revenue compared to materials revenue, which come with lower margins as well as the overhead cost absorption being spread across a relatively lower revenue base. Collectively, these factors flow down to adjusted EBITDA, offset to a degree by expense reduction initiatives we have implemented in light of the module uncertainty in the marketplace.\n\nSpecifically, our targets for the third quarter call for revenue between $16.5 million and $19 million, non-GAAP gross loss of $8.3 million to $3.8 million or negative 50% to 20%. And as you may expect, the percentage gains vary more greatly at these lower revenue levels. Our non-GAAP operating expenses are expected to be between $10 million and $11 million and the adjusted EBITDA loss between $13 million and $14 million. Finally, looking ahead to the fourth quarter, we're starting to see some light at the end of the tunnel.\n\nBased upon what we see today, we anticipate new wins to begin production, helping drive strong sequential revenue growth. Importantly, we expect significant gross margin improvements to be delivered in Q4, moving into positive territory as these new products will incorporate our latest DTV initiatives, coupled with having the lower margin legacy products behind us. Specifically, our expected targets for the fourth quarter call for revenue between $75 million and $90 million, again represented a significant rebound from Q3 as our new project wins begin production. Gross margins are anticipated between 9% and 14%, with our new projects delivering enhanced margins relative to our historical norms, and finally, an adjusted EBITDA range of plus or minus $3 million.\n\nWith that, we'll conclude our prepared remarks, and I'll turn it over to the operator for questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question comes from Kashy Harrison of Piper Sandler. Please go ahead.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nGood morning, everybody, and thank you for taking my question. So I wanted to maybe start on the cash management side of the equation. It looks like you managed working capital well this quarter. AR came down a bit.\n\nCan you just walk us through how you're thinking about changes in the working capital and cash flow from ops as you think about the second half of the year?\n\nSean Hunkler -- President and Chief Executive Officer\n\nHey, Kashy. This is Sean. Thanks for the question. Yes, so we're really happy with the company's performance in terms of cash management in the quarter.\n\nWe saw a really good progress by the team and a great level of focus. In addition, we were able to renegotiate the revolver as well. And so we feel good about the position of the company moving forward. So why don't I turn it over to Phelps to give you a little bit more color?\n\nPhelps Morris -- Chief Financial Officer\n\nYeah, thanks. So we did a great job in terms of working capital during the quarter. As you look at kind of future, we're not going to provide guidance on cash but the way I think you need to think about it is a couple of ways. Number one, we'll continue to focus on collections and for the prior sales, bring down the accounts receivables.\n\nWhen you look at, obviously, the guidance for Q3, we'll burn some cash from an EBITDA perspective but there's some potential offsets there in terms of new deposits being made on new sales and the customers as it going forward. So a big continued focus. I think one of the other things we're really, really happy about is PwC removed the substantial date language that was placed last quarter based upon all of the activities that we put in place.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nThat's good to hear on the going concern language. My second question. You indicated bookings of $140 million. That's up from what you said last quarter.\n\nAnd just doing the quick math here, your second half revenue guidance is about $100 million and your backlog is about $774 million. So $774 million less $100 million gives us $674 million of backlog for '23 and beyond. Can you maybe walk us through how much of that $674 million is scheduled for '23 as opposed to '24 and beyond?\n\nPhelps Morris -- Chief Financial Officer\n\nSo we're really excited about the continued progress on the backlog. We've seen, frankly speaking, as we said in the prepared remarks as well, the entire customer base seems to be anticipating a very strong '23. And in fact, as we mentioned, there's some concern about there being enough capacity, manpower capacity, materials capacity, etc., to be able to do what people want to see happen in '23. So we're very excited about the continued growth of the backlog and we think '23 is going to be a very, very strong year.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nOK, fair enough. And then maybe just one final one, if I could sink it in. How are you thinking about the risk toward 4Q 2022 revenue guidance? Specifically, what does it assume for module supply? Are you effectively assuming that the market has sort of figured out UFLPA or are you still effectively assuming that it takes a little bit longer for that to sort itself out? That's it for me. Thank you.\n\nPhelps Morris -- Chief Financial Officer\n\nYes. So as we see the market, Kashy, it's really a single issue today, and that's module supply. And obviously, we've been able to put WRO behind us as an industry. With the executive order, we've put AD/CVD behind us and now, people are working through UFLPA.\n\nIt seems that UFLPA has some of the same issues that WRO had and that the industry was able to work through in terms of just figuring out the regulatory environment, what exactly is required, so modules can make their way into the U.S. and not be ceased. And so our view is, in talking to the customer base is, that the module supply is going to get itself worked out here in the coming months. And so that's what will enable Q4 to be our inflection point.\n\nAnd so our assumption on Q4 revenue is based again on the module situation getting worked out by our customers.\n\nPatrick Cook -- Chief Commercial Officer\n\nAnd the other thing you talk to, as we've talked about -- this is Patrick. The continued growth and expansion in the international market as well. So you saw last quarter, we went out and booked 340-plus megawatts of international sales, we expect that to continue as well. And so there's an international component that is not affected by UFLPA that is going to contribute to the strong Q4 that we see in front of us.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nAnd our next question comes from Don Schafer of Northland Capital. Please go ahead.\n\nDonovan Schafer -- Northland Securities -- Analyst\n\nHey, guys. Following up on kind of Kashy's question about Q4, I'm kind of thinking, I got to have the kind of pleasure of looking at your Voyager tracker at your demonstration site in Aurora, Colorado, and kind of see all the different components and coming away from that, as I understand it, the one piece that really you have to wait until you know exactly what module specifications, what the final module is going to be, it's the Pearland or some people call it the rail. And it's kind of like where are you going to punch the holes in the rail or how long does the rail have to be, there's little tweaks there. But the rest of the parts can be even knowing what sicknesses or size piles and such are required.\n\nYou can kind of know all of that ahead of time. So the orders that you're looking at in Q4, is this kind of a dynamic where you know you're in a position because of course, we've had a constrained supply chain environment but also just in terms of sourcing materials, so are you in a position where you kind of have everything in place for what those deliveries would be in Q4, and you're just kind of waiting on knowing the final spec so that you can finalize with the Pearland's and the rest is kind of ready to go or is it more than that?\n\nSean Hunkler -- President and Chief Executive Officer\n\nSo Donovan, thanks for the question. So as you said, our system, effectively, the Voyager tracker is agnostic to the module. We can accommodate any module. And in order to do so, like you said, there is some adjustment on the rail itself but we feel very good about, once the module supply is resolved, that our view of if Q4 is sound based on everything we know today.\n\nSo frankly speaking, it's just a matter of the module issue itself getting resolved in terms of the supply chain constraints. As you know, we use an asset-light model. So we have multiple suppliers around the world, including suppliers in the U.S. And so that flexible supply chain, having multiple suppliers with multiple qualifications, yes, it gives us confidence that any issues that might appear are absolutely resolvable simply because of the fact that we have multiple suppliers and have that flexibility by the design of our supply chain.\n\nPhelps Morris -- Chief Financial Officer\n\nAnd I'd say the other thing to check on a lot of the customers that we're talking to and informed kind of by the increased contracts in the order that we've got with this earnings call, so really narrowing in on two or three or one or two different module manufacturers. And so you've got a good sense of what the form factor is going to be with those. So to your point, Don, on the Pearland's and the module rails, we're able to really kind of narrow into one or two versus we don't know when the modules are going to come or who they're going to come from. But the additional clarity, we've been able to kind of narrow that down with a lot of these awards.\n\nDonovan Schafer -- Northland Securities -- Analyst\n\nOK, great. That's helpful. And then if I could ask about the project in Thailand. It caught my attention because I know that back in 2019, I think it was 2019, you also had some sales in Vietnam.\n\nI think that may have been more of kind of engineering services, I can't remember if that was the AP90 tracker or if it was [Inaudible] tracker. And we don't necessarily need to get into that but it does make me curious. Do you have sort of some kind of a presence or some good advocacy or sales presence in that kind of part of Southeast Asia, that sort of Peninsula, Cambodia, Thailand, Vietnam? Is that kind of something like that behind that? The other would be, if you are willing to kind of disclose the size of the project? Was it a Voyager tracker or an HX1P tracker since that's kind of starting to get into that kind of Asian territory? Maybe I thought it could be the HX tracker. And then if you can talk at all if there's specific site conditions there in Thailand, if it was something to do with soils or what may have caused the win of FTCI versus other trackers that could have gone with?\n\nSean Hunkler -- President and Chief Executive Officer\n\nThanks, Donovan. So the project in Thailand is relatively small. It's two megawatts. But I'm really, really excited about it because we're following the path in Thailand that we've seen in other countries as well, that we've seen in South Africa, that we've seen in Australia, where we get a proof of concept basically on the ground that people can come and see in country that leads to additional business and the growth of the business in that country.\n\nSo I'm absolutely confident. We have a team in Southeast Asia of five people who call on Thailand and other countries as well. And they've been making really good progress. As you know, we announced our first project in Malaysia recently as well.\n\nAnd then on top of that, the other thing that I'm excited about is with the acquisition of HX, we now have the Helios 1P tracker in our product road map and so we're able to sell that product as well. But this particular sale in Thailand is the Voyager 2P tracker. And I think it's going to lead to other opportunities there as well as it has in other countries. Thanks for the question.\n\nDonovan Schafer -- Northland Securities -- Analyst\n\nOK, and then -- if I could just squeeze in -- well, actually, so the other question about, were there certain things on the site in Thailand that made the fewer piles or maybe odd shape lots or anything like that, that kind of plays the 2P track redesign you have?\n\nPhelps Morris -- Chief Financial Officer\n\nYeah. I mean, I think it fit well for a 2P solution, oddly shaped parcel with some land challenging for ultimate undulation. And this is a developer that has really kind of taken a long-term view on FTC and there is, we expect this is what we've seen in other geographies, additional project wins that augment our 2P solution very well. And so that's kind of the tie-in with this 2-megawatt project is really a start to future business.\n\nDonovan Schafer -- Northland Securities -- Analyst\n\nAnd then my last question, just because people are looking at Europe with the energy security concerns with Russia's invasion of Ukraine. So just as my last question, just if you can talk about if there's any maybe like demonstration projects you're kind of looking at doing there, if you've seen an uptick in interest, whether Spain has historically had a decent amount of 2P trackers with some of the legacy Spanish companies? Germany has had a lot of solar penetration, so maybe they're in a situation like the U.S. where fewer sites are available that are large block acreage. You might have more odd lot shapes.\n\nSo curious if you're seeing any developments kind of in the European area?\n\nPhelps Morris -- Chief Financial Officer\n\nYeah. No, great question, Don. I mean certainly, energy independence in Europe has been a big focus over the last several months. And in terms of just kind of uptick in activity, obviously, there's going to be some policy changes that are going to be rolled out here in Europe over the next several quarters.\n\nBut we have seen internally an uptick in the amount of kind of bidding activities you look out into 2023 and beyond. And so we've had a team on the ground there for about 12 months engaged with the developers and EPCs in the region have a very good sense and pulse ultimately where that market is going. And it's a focus point for us and feel confident that we'll be able to capture that market with these policy changes. Thanks, Donovan.\n\nDonovan Schafer -- Northland Securities -- Analyst\n\nYeah. Thank you guys. I'll take the rest offline.\n\nOperator\n\nYour next question comes from Pavel Molchanov of Raymond James. Please go ahead.\n\nPavel Molchanov -- Raymond James -- Analyst\n\nThanks for taking the question. Can you clarify, in the Inflation Reduction Act, there are references to the advanced manufacturing credit in relation to solar trackers but it's a bit confusing on kind of what the amount of subsidy is? Have you looked at that already?\n\nSean Hunkler -- President and Chief Executive Officer\n\nHey, Pavel. This is Sean. So we've been studying this for some time and waiting for the bill to pass. So we think, in general, this is very much a net positive.\n\nBut as you said, we're studying the bill. So we have our folks internally as well as some folks externally studying the bill so that we best understand how with our supply chain to take advantage of it. But we'll share some more details in future calls on what our approach is. But again, we continue to study the bill and we see it as absolutely a net positive for the industry.\n\nPavel Molchanov -- Raymond James -- Analyst\n\nOK. Let me ask about what's happening with steel. Spot price of just benchmark steel futures is down 30% from its peak of last October. How much of that is being reflected in your cost of goods directly?\n\nSean Hunkler -- President and Chief Executive Officer\n\nSo we're excited about the improvement in steel costs as well as logistics. While both are down and the trend is that way, they're still above historical highs but we see it as definitely a net positive moving forward.\n\nPavel Molchanov -- Raymond James -- Analyst\n\nGot it. And then just a quick kind of statistical question. What percentage of this year's revenue do you expect to be non-U.S,?\n\nSean Hunkler -- President and Chief Executive Officer\n\nIn terms of revenue, so we've talked about the pipeline and the pipeline is now about 50-50. But in terms of revenue, likely in the 20%, 30% range.\n\nPavel Molchanov -- Raymond James -- Analyst\n\nVery clear. Thank you, guys.\n\nSean Hunkler -- President and Chief Executive Officer\n\nThanks.\n\nPatrick Cook -- Chief Commercial Officer\n\nThanks.\n\nOperator\n\nOur next question comes from Jeff Osborne of Cowen and Company. Please go ahead.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nYeah. Good morning. Just a couple on my end. I was wondering, Phelps, if we should use the EBITDA loss as a proxy for cash.\n\nJust going back to Kashy's question around the new covenants. It seems like you'll be pretty close to breaking that $50 million. So I just wanted to think about how we think about the third quarter being the bottom and the cash needs?\n\nPhelps Morris -- Chief Financial Officer\n\nYeah. So the way you got to think about number one on the liquidity covenant is unused revolver capacity plus cash. So when you think about liquidity covenants, you got to factor that in. So we don't have any borrowings on the revolver rather than a couple of million dollars of LCs.\n\nSo there's no borrowings. We don't have any intentions to borrow that. And as a consequence, yes, if the cash goes down from an EBITDA burn for next quarter, again, what I talked about earlier is there's potential offsets, so we'll continue to collect and really focus on the questions of the prior sales. In addition, the cash can be further supplemented by deposits or capacity deposits that we received during the quarter for future capacity.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nGot it. And then on those deposits, it's the first I've heard you mention those. Is there a rule of thumb as, if you bought $100 worth of trackers, do you get 5% upfront or is every deal different?\n\nSean Hunkler -- President and Chief Executive Officer\n\nYeah. No, generally, at the time the PO is placed, you're getting roughly 20% down upfront. There's also talk within the industry just given capacity constraints for next year as we look forward to even getting higher amounts.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nA couple of other quick ones for you. The allowance for doubtful accounts, was that a U.S. customer or international and was that on one of the loans that you had made for developments or was that an actual trackers delivered?\n\nSean Hunkler -- President and Chief Executive Officer\n\nThis is actually on tracker delivered on U.S. project.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nAnd lastly, just going back to Pavel's question, the 20% to 30% international. Are all those deals denominated in U.S. dollars or how do we think about your FX exposure given now half your pipeline is in the international markets?\n\nSean Hunkler -- President and Chief Executive Officer\n\nYeah, they're all in USD.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nAll right. Great to hear. That's all I had. Thank you.\n\nSean Hunkler -- President and Chief Executive Officer\n\nOK, thanks.\n\nOperator\n\nOur next question comes from Maheep Mandloi of Credit Suisse. Please go ahead.\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nHey. Thanks for taking the question. Maybe just on the guidance side, could you talk about how much of the commercial guidance for Q4 specifically is dependent on getting modules for UFLPA? I mean you talked about 20%, 30% international, so most of that 70% dependent on that UFLPA kind of getting settled in early Q4?\n\nSean Hunkler -- President and Chief Executive Officer\n\nSo the way I would think about it is, like you said, there really aren't restrictions on the international and we're super excited about the continued growth internationally. The number of countries that we've added recently this quarter and last quarter, it used to grow. And then as we've seen in other international countries, as we start with a small project, it eventually leads to bigger and bigger projects. And so one of the things that we've seen during this period of a low in the U.S.\n\nmarket is that it's been a real opportunity for us to really dig deep with the customers in the global market and we've seen progress as a consequence. And then the U.S. market -- so we've talked to multiple customers. We said in the prepared remarks that many of our customers are indicating they'll get their module situation resolved, which includes something related to modules.\n\nAnd today, obviously, is UFLPA. But our assumption is that, as we've heard from the customers that the module situation is resolved and that will allow things to move forward, we also hear that with the concern with '23 being such a strong year that people are wanting to look at opportunities to pull things in. So the sooner they can get the module issue resolved, I think the better it will be for Q4. And as we said today, we're seeing that as an inflection point for us.\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nYeah. One other comment just on the Q4 guidance, specifically that it's going to be more equally weighted between U.S. and international projects based upon our current rollout?\n\nPhelps Morris -- Chief Financial Officer\n\nYes. So 20% to 30% was on the aggregate. It was on the full year 2022.\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nYes. So it's almost like 50% in the Q4, you're saying U.S. and international then?\n\nSean Hunkler -- President and Chief Executive Officer\n\nYes, roughly for U.S. and international in Q4.\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nGot you. And just on the previous comment on just on this potential visibility improving in Q4 as you felt because you resolved either late in Q3 or late in Q4. So can you just help us understand like when do you recognize revenues? Is it on shipments from the factories or is it on site deliver? And do you see some demand pull in and like people just installing these trackers and just waiting for modules to come in whenever they come in, in December or January or February?\n\nSean Hunkler -- President and Chief Executive Officer\n\nSo generally speaking, when someone places a contract with us, they'll have the modules identified because of the needing to understand that just to get the design completed. So we aren't seeing too many situations where people are asking for a tracker in advance of the module situation getting resolved. So we see that, again, the module situation is the key area. And then in terms of revenue recognition, we follow the standard rules.\n\nYes. So specifically on the materials revenue, that's generally going to be recognized through the manufacturing process. And then if you look at the service revenue breakdown, that's really tied to logistics and that would be once the underlying materials is delivered to the final destination.\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nGot you. That's really helpful. And just on the opex side, I think the guidance kind of implies you're expecting almost $9 million of opex in Q4, it's a sharp and steady decline from Q2. Could you talk about the drivers to that and is it something you're expecting in the near term? And obviously, as the sales come back in '23, do we expect to go back to the historical opex run rate or how should we think about that? Thanks.\n\nSean Hunkler -- President and Chief Executive Officer\n\nYeah. So we've been really mindful on the opex, obviously, given the near-term challenges within the marketplace, given all the regulatory issues. So we've really cut out discretionary spend, taken a look at across the organization for the overall spend. As you look toward 2023, obviously, we're not providing guidance at this point but we would expect with the projected industry growth that we would start to scale some of the opex just to support the delivery of the online projects.\n\nBut in the near term, again, we've taken across the organization view on opex and really curtailed that significantly.\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nGot you. Appreciate you taking the questions. Thanks a lot.\n\nSean Hunkler -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nNext question comes from Phil Shen of ROTH Capital Partners. Please go ahead.\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nFirst one is a follow-up on the Inflation Reduction Act. So the incentive in there is for $0.87 per kilogram of incentive for the torque tube supplier. My sense is you guys don't manufacture your own torque tubes. So I was wondering how you might share that incentive with your supplier and how those economics might work? Thanks.\n\nSean Hunkler -- President and Chief Executive Officer\n\nSo Phil, we're super excited about the Inflation Reduction Act and the prospect of it fully passing. We've been studying it back to the time of build back better before it. And so, as you know, we have multiple partners in our supply chain. And so we've been studying it.\n\nWe've been in discussions. And we'll have further comments on this in the future but it's absolutely a positive for the industry and something that we definitely plan to take advantage of.\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nI have a follow-up here in terms of, does it need to be U.S. Steel? It seems like it might be and if so, how do you think the U.S. steel is to be defined? For example, iron ore and coking coal mined in the U.S. steel produced in the U.S.\n\nblast furnace or could it be scrap melted in the U.S. furnace. How would you look at the requirements there? And over what time do you think that might become clearer for us? Thanks.\n\nSean Hunkler -- President and Chief Executive Officer\n\nSo we're looking at it very closely. It appears to be the latter in terms of definition for U.S. Steel. But again, that's something that we're working through very closely and we'll follow very closely in terms of how it is interpreted but we tend to see it as the latter.\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nOK. Thanks, Sean. And then as it relates to the Q4 guide, can you talk through the skew of deliveries between October through December?\n\nSean Hunkler -- President and Chief Executive Officer\n\nSay it again, Phil. I'm sorry, that broke up.\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nSorry, can you talk about the revenue recognition that you expect by month in the quarter? So for example, is it back and weighted for Q4 or do you think it's more evenly weighted as you get through the quarter between October, November.\n\nSean Hunkler -- President and Chief Executive Officer\n\nTypically, Phil, we don't give guidance by month. But as I said before, I feel very confident about our performance, and I think Q4 is definitely an opportunity for the inflection point. So our expectation is a solid Q4, again, under the assumption that the module situation is resolved but I'm very, very excited about the prospect of Q4.\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nGreat. Thanks, Sean. I'll pass it on.\n\nOperator\n\n[Operator instructions] Our next question comes from Julien Dumoulin-Smith, Bank of America. Please go ahead.\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nHey. Good morning, team. Thanks for the time and the opportunity. Can you guys hear me?\n\nSean Hunkler -- President and Chief Executive Officer\n\nYeah, we can hear you.\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nHey. Excellent. Thank you, guys. Just following up on where we started the call here a little bit.\n\nCan you talk a little bit about the gross margin implied in your backlog here, especially if you think about '23? Obviously, you talk about this inflection for 4Q. What do you see as implied by what you know today on pricing of your cost structure relative to what you've locked in otherwise here heading into '23? If you can just talk about this a little bit, like how much of a structural uplift in gross margin we've seen from 4Q here? And then I got a follow-up.\n\nSean Hunkler -- President and Chief Executive Officer\n\nSo we're very optimistic in terms of gross margin. Despite the focus on opex and spend, we've continued to invest in R&D, our team. Our R&D team has done some pretty phenomenal things in terms of looking at the steel content. You know about our DTV initiative.\n\nIn addition, we further strengthened our partnerships with our suppliers in our asset-light model. And so those things have really helped us in terms of reducing costs. And that's why we feel good about the inflection point. And we also feel that we feel good about the long-term gross margins that we talked about during the IPO as well and seeing that happen in the '23 time frame.\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nOK, fair enough. And then I just want to come back to the liquidity conversation and brief here. Can you talk about, again, relative to the Q here, the $50 million described here for the credit facility. What is the latitude relative to the minimum that you have today just under the definition, number one? And then related to that, can you talk about, especially considering the deposit dynamic that you just alluded to, how that might trend here into the back half of the year? And ultimately, how you think about extending that versus the 3/31/23 maturity? What options do you have as you think about it?\n\nPhelps Morris -- Chief Financial Officer\n\nJulien, it's Phelps, let me just reconfirm how the covenant works. So today, the way the liquidity covenant is calculated, cash plus unutilized credit facility. So prior to the amendment, the revolver amendment was $125 million, which meant you needed cash plus unused revolver of $125 million or greater. By reducing the liquidity covenant to $50 million, effectively, you have the entire credit facility of $100 million utilized minus a couple of million dollars of LCs, plus your cash balance, that needs to be above $50 million.\n\nSo effectively, your total liquidity at quarter end that we calculated was about $164 million versus the new liquidity covenant of $50 million. You had $98 million of revolver capacity plus $66 million of cash gives you a total liquidity of $164 million at quarter end. So that gives you a lot of significant runway even in the light of some cash burn that you're not going to run to solve that liquidity covenant. Does that make sense?\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nNo, 100%. Absolutely. I wanted to establish that at the asset and then pivot here into how you think about this trending through the back half and into '23 here and ultimately, how you think about your refinance options here? I know you alluded to this deposit dynamic to the extent to which that you see orders come in, how much could that actually contribute to liquidity profile here, for instance?\n\nPhelps Morris -- Chief Financial Officer\n\nYeah. So it's obviously outside. If you look at overall cash for the quarter, we're not providing cash guidance for the quarter, how we talked about, you have the EBITDA, which is a potential cash usage but we'll continue to focus on the collection efforts on the ER for prior sales. We've done a really good job on that.\n\nAnd then secondarily, I think you look at the deposits of upside to the cash balances, as the orders come in and as people try to lock in capacity for 2023, if they're willing to put down deposits, that's an upside for the cash on a go-forward basis.\n\nSean Hunkler -- President and Chief Executive Officer\n\nThe way we structure our customer contracts, as Phil alluded to at the onset here is, we get about a 20% down payment from our customers and then really maintain cash flow positive through the life of these projects. And as capacity is kind of constrained and we've seen that with the uptick in contract and awarded, folks are more willing to put down larger down payments, which will potentially improve that cash flow profile as well.\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Fair enough. I will leave it there. Thank you, guys.\n\nSean Hunkler -- President and Chief Executive Officer\n\nThank you, Julien.\n\nPatrick Cook -- Chief Commercial Officer\n\nThanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBill Michalek -- Vice President, Investor Relations\n\nSean Hunkler -- President and Chief Executive Officer\n\nPhelps Morris -- Chief Financial Officer\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nPatrick Cook -- Chief Commercial Officer\n\nDonovan Schafer -- Northland Securities -- Analyst\n\nPavel Molchanov -- Raymond James -- Analyst\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nMore FTCI analysis\n\nAll earnings call transcripts"
}