{
  "companyName": "Titan Machinery",
  "companyTicker": "TITN",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/25/titan-machinery-titn-q2-2023-earnings-call-transcr/",
  "content": "Titan Machinery (TITN -0.28%)\nQ2 2023 Earnings Call\nAug 25, 2022, 8:30 a.m. ET\n\nOperator\n\nGreetings, and welcome to the Titan Machinery second fiscal quarter 2023 earnings call. [Operator instructions] As a reminder, this conference is being recorded. I would now like to turn the conference over to your host, Jeff Sonnek of ICR. Thank you.\n\nYou may begin.\n\nJeff Sonnek -- Investor Relations\n\nThank you. Good morning, ladies and gentlemen, and welcome to Titan Machinery second quarter fiscal 2023 earnings conference call. On the call today from the company are David Meyer, chairman and chief executive officer; Mark Kalvoda, chief financial officer; and Bryan Knutson, president and chief operating officer. By now, everyone should have access to the earnings release for the second quarter ended July 31, 2022, which went out this morning at approximately 6:45 a.m.\n\nEastern Time. If you've not received the release, it's available on the investor relations page of Titan's website at ir.titanmachinery.com. This call is being webcast, and a replay will be available on the company's website as well. In addition, we are providing a presentation to accompany today's prepared remarks.\n\nYou may access the presentation now by going to Titan's website at ir.titanmachinery.com. The presentation is available directly below the webcast information in the middle of the page. You'll see on Slide 2 of the presentation our safe harbor statement. We would like to remind everyone that the prepared remarks contain forward-looking statements, and management may make additional forward-looking statements in response to your questions.\n\nThese statements do not guarantee future performance, and therefore, undue reliance should not be placed upon them. These forward-looking statements are based on current expectations of management and involve inherent risks and uncertainties including those identified in the Risk Factors section of Titan's most recently filed annual report on Form 10-K and updated and subsequently filed quarterly reports on Form 10-Q. These risk factors contain a more detailed discussion of the factors that could cause actual results to differ materially from those projected in any forward-looking statements. Except as may be required by applicable law, Titan assumes no obligation to update any forward-looking statements that may be made in today's press release or call.\n\nPlease note that during today's call, we'll discuss non-GAAP financial measures, including results on an adjusted basis. We believe these adjusted financial measures can facilitate a more complete analysis and greater transparency into Titan's ongoing financial performance, particularly when comparing underlying results from period to period. We have included reconciliations of these non-GAAP financial measures to their most directly comparable GAAP financial measures in today's release. The call will last approximately 45 minutes.\n\nAt the conclusion of our prepared remarks, we'll open the call to take your questions. With that, I'd now like to introduce the company's chairman and CEO, Mr. David Meyer. David, go ahead.\n\nDavid Meyer -- Chairman and Chief Executive Officer\n\nThank you, Jeff. Good morning, everyone. Welcome to our second quarter fiscal 2023 earnings conference call. On today's call, I will provide a summary of our results; and then Bryan Knutson, our president and chief operating officer, who will give you an overview for each of our business segments.\n\nMark Kalvoda, our CFO, will then review financial results for the second quarter of fiscal 2023 and provide an update to our full year modeling assumptions. If you turn to Slide 3, you will see an overview of our second quarter financial results. This was a great quarter for Titan across the board and demonstrates the continued momentum we are enjoying in connection with the strong farm economy. Revenue grew 32% to $496.5 million in fiscal second quarter, and we are pleased to deliver second quarter earnings per share of $1.10, which marks the highest quarterly earnings performance in our 42-year history.\n\nThis is the result of our team's unrelenting focus on customer service and operating efficiencies and which translated into a consolidated pre-tax margin of 6.7%, which is a great accomplishment. At the segment level, our agriculture segment was a clear beneficiary of the strong demand we are seeing, which was supported by timely deliveries of inventory. Our construction segment also experienced strong same-store sales growth, driven by robust demand for equipment, a notable strength in parts, service and rental. Likewise, the improved pre-tax margin in our construction segment reflects the improved operating efficiency that we've been focusing on driving over the past several years across the optimized footprint.\n\nWhile revenue growth in our international segment remains impacted due to the ongoing conflict in Ukraine, our business continues to be resilient as demonstrated by the positive same-store sales growth in the second quarter. Further, our ability to drive higher segment pre-tax margins is also notable. While this is partially due to mix, our business continues to improve across the region and we would like to recognize the hard work by our operating team to execute on its important parts and service, customer support growth strategy. Through resolve and perseverance, the Foreign Ministry in Ukraine has adapted to the food environment.\n\nAnd we continue to be inspired by the commitment of our customers and our employees to help keep valuable equipment up and running as the majority of the farmland in our Ukrainian markets continue to be farmed. On August 1, we completed our acquisition of Heartland Ag Systems for $95.5 million, giving us access to the full product line of Case IH commercial application equipment which includes self-propelled sprayers and fertilizer applicators. Our integration is already well underway, and our teams are working hard to efficiently establish our complete distribution model that covers both the farmer and commercial applicator. This provides us the ability to generate long-term revenue synergies through equipment packaging opportunities with the commercial applicator customer, along with the full portfolio of Case IH application products for our traditional farmer/rancher customer and also provides additional avenues of growth as we leverage our expansive parts and service network.\n\nWe share remarkably similar cultures focused on exceptional customer service and look forward to the Heartland's teams' future contributions. There continues to be a good pipeline of potential acquisitions, and we continue to target quality ag dealerships. In summary, our results showcase the improvements we've made to our business over the past several years to drive higher levels of profitability through the cycle and demonstrate the value we've added through organic growth and accretive acquisitions. We remain confident in our ability to build on our momentum in the second half and thus, we are increasing our modeling assumptions to a new EPS range of $3.70 to $4.\n\nNow, I'll turn the call over to Bryan Knutson.\n\nBryan Knutson -- Chief Operating Officer\n\nThank you, David. Good morning and good afternoon, everyone. I will start with an update on our domestic agriculture segment, which is our largest segment, and then we'll follow with some additional color on our domestic construction and international business segments. On Slide 4, you'll see an overview of our domestic agriculture segment.\n\nTo date, we continue to see exceptionally strong demand for both new and used agricultural equipment, primarily supported by the continued elevated levels of commodity prices. Furthermore, today's new equipment technologies and precision components, which increase yields, productivity and efficiencies become even more critical in these times of higher end-user input costs and as a result are another key factor that is driving new equipment demand. As our customers continue to look for solutions to upgrade their aged fleets with new and late-model used equipment with today's advanced technology, the current aged and higher-houred fleet that is out there remains a catalyst for parts and service revenue growth. As a reminder, even with the strong industry volumes we have experienced, the current fleet age is still well above historical average.\n\nCrop development and yield potential varies across our footprint depending on weather events and rainfall timeliness. While dry conditions persist in some of our markets, the moisture situation overall is better than last year. Additionally, for those customers that have prevented plant acres or experienced other crop losses, most have available multi-crop insurance and USDA safety net programs. While corn and soybeans are the primary crops growing in our markets, we have growers that raised sunflowers, edible beans, canola, wheat, barley, alfalfa, potatoes and sugar beets.\n\nThis crop diversity allows growers the flexibility to adapt crops to the field conditions, moisture levels, timing of planting and seeding, variable input costs and end markets. As most people are aware, new equipment supply continues to be challenging and somewhat unpredictable as unfinished units remain at the factories waiting for completing parts and components, which can move deliveries from quarter-to-quarter and, in some cases, calendar year to calendar year. This volatility and resulting unknowns are further complicated by new equipment allocations and shorter pricing windows by our major supplier which is a change from historical practices. Equipment allocation is at the discretion of our suppliers and, depending on production capabilities, has the potential of limiting the availability of high-demand cash crop products.\n\nConversely, we see better availability of hay equipment and under 140-horsepower tractors, which is the largest tractor industry segment in terms of units. We feel confident we will receive presold units and equipment orders needed in line with our increased modeling assumptions for the current fiscal year. We continue to work with our main suppliers in short-line manufacturers to source future inventory to meet the current strong demand. We will have more visibility on next year's inventory availability as we enter calendar year 2023 and we'll provide more details when we discuss our FY '24 modeling assumptions as we traditionally do on our Q4 earnings call.\n\nAs David stated, we have begun integration of Heartland Ag Systems acquisition that we announced on August 1, and we are excited for the future opportunities we see in the application equipment space. Turning to Slide 5. You'll see an overview of our domestic construction segment. Similar to our North American Ag segment, see, equipment demand outpaces supply, is experiencing long lead times and allocation for new equipment.\n\nWe are seeing energy-related construction activity in our oil and natural gas producing markets in the Colorado Front Range in Western North Dakota Bakken fields. Although moderating from peak levels, we are still seeing good residential housing activity, along with robust commercial construction taking place across our footprint. Road construction and other infrastructure projects are in full swing throughout our markets, and farmers and ranchers are continuing to purchase equipment for land improvement, feedlots and material handling. Furthermore, the strong overall industry also continued to drive demand for rental equipment, which produced another solid quarter for fleet utilization.\n\nI'm very proud of our North American agriculture and construction employees and their ability to put up a record second quarter and overall, an outstanding first half performance for our domestic segments. We are looking forward to a busy harvest with what has the potential to produce above-average yields in much of our footprint and a very strong fall construction season as we go into the back half of our fiscal year. On Slide 6, we have an overview of our international segment, which represents our business within the countries of Bulgaria, Germany, Romania and Ukraine. The spring small grain harvest is complete with average yields overall.\n\nLate season crop development varies between countries as our customers are experiencing dry weather conditions in Eastern Germany, Romania and Southern Ukraine. Like North America, our European customers are also benefiting from the higher global commodity prices, but the availability of new cash crop equipment in Europe is extremely tight. Ukrainian growers continue to farm as we support them with parts and service and limited equipment sales, while Ukrainian grain exports are beginning to move through secured corridors which is an important development for farmers who need to monetize their crops. Our operational improvements and outstanding team in Europe are allowing us to deliver excellent Q2 and first half results in the midst of these geopolitical, economic and weather challenges.\n\nNext, I will turn the call over to Mark to review our financial results in more detail. But before I do, I'd like to sincerely thank all our Titan employees who have done such a fantastic job navigating through these unprecedented supply chain challenges. Our phenomenal team worked very closely with our customers, got out of the gate early to execute on presales as well as equipment procurement. And finally, I'd like to thank our key suppliers and their employees who work so hard to produce product, unfortunately not keeping pace with our demand, but an impressive feat, nonetheless.\n\nNow, I will turn the call over to Mark to review our financial results in more detail. Mark?\n\nMark Kalvoda -- Chief Financial Officer\n\nThanks, Bryan. Turning to Slide 8. Total revenue increased 31.5% to $496.5 million for the second quarter of fiscal 2023. Our equipment business increased 37.6% versus prior year, driven primarily by strong same-store sales in our agriculture segment and further supported by contribution from our Jaycox and Mark's Machinery acquisitions, which were not in the prior-year's second quarter results.\n\nGrowth in our parts and service business improved in the second quarter, increasing 18.9% and 12.4%, respectively, which was anticipated given the later start to the planting season this year. Rental and other revenue increased 3.7% versus prior year with dollar utilization of our construction segment rental fleet increasing to 31.9% compared to 26.6% and in the prior-year quarter. This material improvement in utilization allowed us to grow revenues on a notably smaller fleet, which in turn drove strong margin expansion. On Slide 9, our gross profit for the quarter increased 36.9% to $103 million, and gross profit margin increased by 80 basis points, driven by the expansion of equipment, parts and rental margins.\n\nEquipment margins were supported by a $2.6 million benefit recognized on the expected achievement of annual manufacturer incentives. The higher margins in these revenue categories were partially offset by a shift in sales mix toward equipment. Equipment margins continue to be supported by very good end market conditions and healthy inventories. Operating expenses increased $11.8 million versus the prior year to $68.8 million for the second quarter of fiscal 2023 due to higher variable expenses and acquisition-related costs associated with the Heartland Ag Systems transaction that closed earlier this month.\n\nHowever, this increase was more than offset by revenue growth and led to 120 basis points of operating expense leverage compared to the prior year, reducing our operating expenses to 13.9% as a percentage of revenue compared to 15.1% in the prior-year period. Given the strength in parts and service and our discipline on expenses, we continue to build on an improving absorption rate. A chart reflecting this annual progress can be found in the appendix to this slide presentation. Floor plan and other interest expense remained relatively flat at $1.6 million compared to the prior-year period.\n\nIn the second quarter of fiscal 2023, our adjusted net income nearly doubled to $25 million, which equated to adjusted earnings per diluted share for the quarter of $1.10 and compares to last year's $0.56 performance. Adjusted EBITDA increased 71.1% to $40.2 million compared to the second quarter of last year. You can find a reconciliation of adjusted net income, adjusted earnings per diluted share and adjusted EBITDA to their most comparable GAAP amounts in the appendix to the slide presentation. On Slide 10, you will see an overview of our segment results for the second quarter of fiscal year 2023.\n\nagriculture segment sales increased 59.1% to $349 million and helped drive nice operating leverage, resulting in segment adjusted pre-tax income increasing 106.3% to $24.9 million, which represents a pre-tax income margin of 7.1%. Beyond the extensive improvements we've made to our operations since the last cycle, second quarter's strong margin performance was also supported by the aforementioned recognition of the manufacturer incentives. Turning to our construction segment. Revenue decreased 13.5% to $70 million compared to the prior-year period due to the lost sales contributions from the company's recent divestitures in this segment.\n\nOn a same-store basis, excluding the divested stores in the prior-year period, revenues were up 14.9% for the quarter. Pretax income grew 39.4% to $3.9 million versus the prior-year period, representing a margin of 5.6%, which was a 210 basis point improvement versus the prior-year quarter. We are proud of the continued margin improvement in this segment and expect to see further margin expansion as we continue to focus on this area of our business. The revenue of our international segment was essentially flat at $77.6 million versus the prior year despite an 11% currency headwind on a weakening euro and the disruption within our Ukraine business due to the ongoing conflict in that market.\n\nDespite this pressure, our international team more than tripled our adjusted pre-tax income to $5.9 million. This represents a robust pre-tax income margin of 7.6% and reflects improved equipment margins as well as ongoing focus and improvement in our parts and service business in this segment. Turning to Slide 11. You can see our first six months results.\n\nTotal revenue increased 27.6% compared to the same period last year. Year-to-date equipment sales increased 33.3%, parts increased 14.3%, service revenue increased 9.6% and rental and other revenue increased 3.2%. The six-month dollar utilization of our dedicated rental fleet improved 570 basis points to 28.6% as compared to 22.9% in the same period last year. Turning to Slide 12.\n\nOur gross profit for the first six months was $191.4 million, a 31.1% increase compared to the same period last year. Our gross profit margin increased 50 basis points to 20% for the first six months of fiscal 2023. Our operating expenses increased by 17.2% for the first six months of fiscal 2023 to $133 million. However, this increase was more than offset by revenue growth and led to 120 basis points of operating expense leverage compared to the prior year, reducing our operating expenses as a percentage of revenue to 13.9%.\n\nAdjusted diluted earnings per share increased 85.3% to $1.89 for the first six months of fiscal 2023 compared to $1.03 in the prior-year period. Our six-month adjusted EBITDA increased 62.5% to $70.4 million compared to $43.3 million in the prior year. On Slide 13, we provide our segment overview for the six-month period. Overall, our adjusted pre-tax income increased 86.3% to $57 million for the first six months of fiscal 2023, representing a margin of 6% and demonstrating the efficiency of our operations.\n\nOn Slide 14, we provide an overview of our balance sheet highlights. We had cash of $142 million as of July 31, 2022. It did go into our bank syndicate line at the end of the quarter to ensure adequate cash for the August 1 closing of the Heartland acquisition, in which we used cash of $95.5 million. Exclusive of future acquisitions, I would not expect to be in our line at the end of our fiscal year as we are now entering the seasonally stronger cash generation period in the back half of our fiscal year.\n\nOur equipment inventory at the end of the second quarter was $444 million, an increase of $121 million from January 31, 2022, reflecting the net effect of a $130 million increase in new equipment, partially offset by a $9 million decrease in used equipment. Strong sales continued to drive equipment inventory turns higher, which increased to 3.6 versus 2.7 in the prior year. I will provide a little more color on our inventory on the next slide. Parts inventory increased to $109 million at the end of the second quarter fiscal 2023 from $96 million at the end of fiscal 2022.\n\nThis higher level of parts inventory is the result of a concerted procurement effort to better ensure parts availability as well as the first quarter acquisition of Mark's Machinery. Our rental fleet assets at the end of the second quarter increased to $73 million compared to $65 million at the end of fiscal 2022. Given the healthy increases in utilization, which has driven margins in our rental fleet business to over 50%, we have increased the anticipated fleet size at the end of fiscal 2023 to be around $78 million. With respect to our Ukraine business and related assets, we are seeing total assets and in-country assets and customer receivables stabilize at $33 million and $25 million, respectively.\n\nThis is consistent with our update from last quarter and down since the beginning of the conflict. Conflict continues as it has over the past few months. I would expect these assets will remain around these levels for the balance of the fiscal year. To date, we have had no material loss or damage to our inventories or dealership locations.\n\nI will update you on top and bottom-line income statement expectations for Ukraine in a few minutes. Turning to Slide 15, the amount of new and used equipment inventories are reflected in the size of the blue and red bars on this slide. We were very pleased with the level of inventory shipments received from our suppliers during the second quarter. The receipt of these orders generated the higher sales performance and are reflected in the $130 million increase in new equipment inventory, which includes a high percentage of presold units awaiting predelivery setup from our service team, with deliveries to customers expected in the back half of the year.\n\nAt the end of the second quarter, inventory turns now reached 3.6 times. Given the favorable industry conditions, health of our inventory and ongoing supply chain challenges, I continue to expect we will operate at higher turn levels throughout the balance of the year. Slide 16 shows our updated fiscal 2023 annual modeling assumptions, which we are raising today. For the agriculture segment, we are increasing our revenue growth assumption to up 50% to 55% from up 37% to 42%, which implies continued momentum through the second half of our fiscal year.\n\nAs a reminder, we updated our assumptions in mid-July in connection with the announcement of our Heartland acquisition. However, that update was limited to the influence of the transaction on our prevailing fiscal 2023 outlook. Today's update can be considered the incremental build off that forecast to reflect our year-to-date performance and positive outlook for the second half. Also, as you consider the growth rates versus prior year, please keep in mind that growth is benefiting from the full year revenue contribution from our Jaycox acquisition, which closed in December 2021, the partial-year revenue contribution from the Mark's Machinery acquisition, which closed in April 2022 and the expected partial year impact of the Heartland acquisition, which closed this month.\n\nFor the construction segment, we increased our assumption for revenue to improve from a range of down 10% to 15% to our current assumption of down 5% to 10%. Impacting this assumption is the divestment of our five construction equipment stores in Montana, Wyoming and North Dakota in January and March of calendar 2022, which accounted for approximately $73 million of combined revenue. Excluding these revenues from the prior-year base, our assumption equates to same-store sales growth of up approximately 15% to 20%. For the international segment, we are reiterating our revenue growth assumption of down 0% to 5%.\n\nWe are quite pleased that our expectation for this segment remains near flat levels given the currency headwinds within this segment and the ongoing conflict in Ukraine. Regarding Ukraine, we are now modeling revenues to be down approximately 45% versus 50% previously and earnings per share to improve to a loss of approximately $0.05 per share versus $0.15 per share previously. The disproportionate lift in the bottom line versus top-line expectations is due to an improvement in revenue mix and an increase in margins. Given the improved modeling assumptions and the expected achievement of the annual manufacturing incentives, we are increasing our diluted earnings per share assumption by $0.80 at the midpoint to a new range of $3.70 to $4 for fiscal 2023.\n\nThis concludes our prepared remarks. Operator, we are now ready for the question-and-answer session of our call.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Daniel Imbro with Stephens, Inc. Please proceed with your question.\n\nUnknown speaker\n\nHey, guys. This is Reed on for Daniel. Construction has seen multiple years of improved profitability. David, what levers do you have left to pull internally to drive margins further there?\n\nBryan Knutson -- Chief Operating Officer\n\nHi, Daniel. This is Bryan. I'll take it and then Dave can weigh in with anything I missed here. Yeah, I appreciate you noticing.\n\nAs Mark pointed out, we're really proud of the continued year-over-year improvements in our construction business. I think that's showing through in the numbers here. And if you look at the rental fleet was a strong contributor again this quarter, just a lot of initiatives we've had there in improving our rental fleet utilization, the mix of our fleet. And so that'd be another lever we'll continue to work as driving, increasing our fleet with demand and as the supply chain opens up a little bit, but as appropriate with the utilizations and again, focusing on those higher utilization products.\n\nLikewise, with parts and service, Mark mentioned, our absorption rates continue to have good year-over-year growth in our absorption coverage on the construction side. And a lot of opportunity there as we -- if we can get that near where our agriculture segment levels are. And so a lot of initiatives on the parts and service side to continue to focus on that and drive that side of the business. And then also just with our suppliers, working closely with them.\n\nThey've got a lot of great products coming out here and continue to fill some product gaps that we've had. And so a good opportunity on the equipment side. And then just finally, with what you've seen with our inventory turns, and the return on assets on that side of the business. So the initiatives we've done around inventory management and also driving through to the higher margins that you see in our numbers.\n\nAnd on every one of those, we believe we've got more room on the construction side.\n\nUnknown speaker\n\nRight. And I guess touching on those inventory turns. As supply starts to normalize, where can we expect the inventory turns to stabilize in the future going into like the back half of next year and forward?\n\nBryan Knutson -- Chief Operating Officer\n\nYeah, I think once we get back to more of a normal supply side time frame, I think what we've always talked about is that three times turn. I think we're very comfortable at three times. You get to -- especially on the Ag side, you get to some of our international and construction where there's some rental within our inventory -- maybe it's just under that. So I would say comfortably, it's, call it, 2.75 to three and a quarter.\n\nSo right around that three time turn is what we're targeting for normal time.\n\nUnknown speaker\n\nAwesome. Congrats on the quarter.\n\nBryan Knutson -- Chief Operating Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Larry De Maria with William Blair. Please proceed with your question.\n\nLarry De Maria -- William Blair and Company -- Analyst\n\nHi. Thanks. Good morning, everybody, and nice job. \n\nDavid Meyer -- Chairman and Chief Executive Officer\n\nHi, Larry. \n\nLarry De Maria -- William Blair and Company -- Analyst\n\nHi, there. First things first, obviously, strong same-store sales. You always had some significant supply chain talent, just unlike everybody else. So I'm just kind of curious to like about what the driver is.\n\nAre we getting -- are you getting better allocations than other dealers? Is it used equipment being the big driver or is it price? Or what's behind the surge of same-store sales considering the supply chain challenges?\n\nBryan Knutson -- Chief Operating Officer\n\nI think -- Larry, this is Bryan. I think you just hit on a number of them there. So you do see pulling through in the margins. So certainly, price has been a bit of a factor, both -- and our ability to certainly pass that through to the customer and then actually a little bit of an increase in our margins that you see.\n\nAnd then yes, just as I mentioned in the prepared remarks, a great effort by our team getting out of the gate early. And doing presales and just staying really close with our customers and getting our orders in early. Our team here in Fargo, really staying close to those order books and the pricing and when the windows open up, having the knowledge from our teams in the field, again, staying close with the customers to get those orders in right away. And then just working with the customers to know what their needs are and then to procure the equipment that is available.\n\nAs you know, there's pockets, some of the plants experience different component shortages versus other plants. And so planning the business, really, with our customers and capitalizing on those opportunities. So you see it, I think, both in revenue and margin and the inventory turns all really pulling through to that higher same-store sales.\n\nLarry De Maria -- William Blair and Company -- Analyst\n\nOK, thanks. And then obviously, expressed optimism into next fiscal year with the share. Can you discuss kind of current orders, how they're shaping up year-over-year maybe? And as it relates to the allocation, which they're opening up, I guess, periodically, how does the allocation tie in to your ability to successfully bundle the Heartland, which is obviously a big sales engine next year? So any update on the allocation, synergy outlook and your ability to execute on that and the order out, orders that you're seeing maybe year-over-year?\n\nBryan Knutson -- Chief Operating Officer\n\nSure. Yeah, Larry, we feel really good with our modeling assumptions here to -- for this fiscal year. So as we look at FY '24 and the end of FY '24 being 18 months out here gets to be a long look. As I mentioned, we'll be coming with guidance here as we usually do at the end of our Q4.\n\nBut we feel good about the order windows that have opened up so far. As you know, with like CNH as an example, through Q1, and we don't have allocations for the rest of the year yet. But as I mentioned, just -- we control what we can control on that, and our team works really hard to stay close with the customers and be ready to jump on those opportunities. And again, I just want to credit our team for what they have done and -- with the preselling and also with the manufacturers, as I mentioned, just a ton of challenges.\n\nYou heard it on Deere's call and AGCO's call, CNH's call and you know what they're all managing through. And so real credit to our suppliers. And again, I want to thank them for what they've been able to produce. It's quite a challenge right now.\n\nAnd as you can see in our numbers, they're getting us the inventory, and we anticipate just working in lockstep with them as we go over the next balance of this year and on in through next year.\n\nLarry De Maria -- William Blair and Company -- Analyst\n\nThanks. Last quick question if I could sneak one more in. As it relates to the Germany business and I guess you reportedly out in Germany is small, but any change in sentiment you're seeing there from the energy rationing, energy shortages, and any concerns about the ability for this day and age to produce? I don't know if they have rolling shutdowns, etc. So just an update on Germany specifically and the ability to produce that you've heard?\n\nDavid Meyer -- Chairman and Chief Executive Officer\n\nYeah. Yeah, I think the small grain crop was pretty good in Germany. And I think the southern was good, Larry. Yeah, definitely, the economic backdrop in all of Europe is challenged right now.\n\nYou can see the devaluation of the euro. And then also, we've got some of this drought kind of creeping into the eastern part of Germany, Romania, Southern part of Ukraine, just some of those areas. So we continue to watch that a little bit. But one thing about Germany, I think we've got -- we've been making some pretty serious improvements in our operation in that country.\n\nSo that's a positive, but I think we have to continue to watch the weather and the development of the late season crop, I think this is going to be the biggest variable in Germany this year.\n\nLarry De Maria -- William Blair and Company -- Analyst\n\nOK. Thanks, and good luck.\n\nOperator\n\nThank you. Our next question comes from the line of Steve Dyer with Craig-Hallum Capital Group. Please proceed with your question.\n\nUnknown speaker\n\nGood morning, guys. Ryan on for Steve. Nice quarter.\n\nDavid Meyer -- Chairman and Chief Executive Officer\n\nYeah. Good morning.\n\nUnknown speaker\n\nMark, I think I heard you mention outsized manufacturing incentives again this quarter. If that's right, I guess, how much was that benefit in the quarter? And then secondly, is there any incremental for that assumed in the second half guidance?\n\nMark Kalvoda -- Chief Financial Officer\n\nYes. Hi, Ryan. Yes, we did -- I did mention the manufacturing incentives. So at this point, we're expecting to earn them for this year.\n\nIt looks very good. And as it looks very good and probable, we did book $2.6 million for the -- into the second quarter. We do have some baked in for the full year, if you recall last year, and this is just for our domestic business that we're talking about, just our Ag segment. Last year, we had like $5.1 million that we booked on the Ag side and $1.3 million for the full year in international.\n\nThis pertains just to the Ag segment. And so $2.6 billion is what we booked so far, and I would expect at least that for the back half of the year. So call it at least like $3 million is what we would have assumed in the guidance for the remaining six-month period.\n\nUnknown speaker\n\nAnd then maybe Mark, what were you previously assuming or is that all incremental relative to the previous guidance?\n\nMark Kalvoda -- Chief Financial Officer\n\nIt is all incremental. As you know, as we talked about last year, these manufacturing incentives are kind of a cliff-type situation that either you hit them or you don't hit them. So we're very conservative and not putting them in the guidance or not booking them until there's a high degree of certainty there. And yes, we hit it.\n\nSo it's all incremental at this point to what we had in our previous guidance.\n\nUnknown speaker\n\nGood. Make sense. On the -- so for the full year guidance on sales, you gave the construction segment -- you gave same-store sales 15% to 20%. There was a lot of moving pieces in Ag.\n\nI can try and do the math, but do you have kind of what the implied same-store sales is within the Ag guidance on the sales line?\n\nMark Kalvoda -- Chief Financial Officer\n\nYeah, there are. With all those acquisition we had last year, acquisition we had in the second quarter and then obviously, the big Heartland acquisition. Adjusting for all that or putting that in there and we kind of provided the numbers for that. It would equate to about assume 30% for the full year in Ag for same-store sales growth.\n\nUnknown speaker\n\nHelpful. Last one for me. You mentioned a lot of presold for the second half of this year. How much visibility? You mentioned some kind of stuff that needs configuration that's just waiting to be shipped.\n\nBut what visibility do you have to getting the equipment from your OEMs or there's Case IH or others, but getting the equipment you need to fulfill those preorders?\n\nBryan Knutson -- Chief Operating Officer\n\nYes. Our -- we're in constant contact with our suppliers as well as the different systems we have in place to have good visibility to that. With that said, as I mentioned, you do see movement from quarter-to-quarter and then -- and potentially, as we get closer to the end of the year here than movement from one quarter to another. So we feel really good about -- that we'll receive those.\n\nIt does certainly get choppier, which quarter they'll be in or again, as we get to the end of the year, which year they'll be in as there does tend to be some movement just as you've seen with the OEMs in their reporting.\n\nUnknown speaker\n\nGreat. Thanks, guys. Good luck.\n\nBryan Knutson -- Chief Operating Officer\n\nThank you.\n\nOperator\n\nThank you. Ladies and gentlemen, our final question this morning comes from the line of Mig Dobre with Baird. Please proceed with your question.\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nGood morning. Thanks for fitting me in here. I guess I'd like to ask a question on the guidance as well. So you raised your core assumptions in Ag by 13%.\n\nAnd I'm sort of curious if you can kind of help us understand the moving pieces here. How much of this was maybe incremental realized pricing? How much of this is really kind of driven by new equipment versus used? Because obviously, this is a pretty material raise with just kind of six months left.\n\nMark Kalvoda -- Chief Financial Officer\n\nYeah, so first of all, Mig, with that 13%, I would say about half of it happened in the current quarter. The remaining half is for the back half of the year. And I would say it's kind of across the board, mostly, not necessarily as much on the pricing. I don't think that's changed as much in our assumptions.\n\nBut between new and used, it's -- it was kind of across the board. As you know, as the new comes in, we get the used and it kind of frees up the use with the trade to sell to the customer there as well. Maybe just as far as the same-store sale that was kind of on the last call too or the last caller there. So 30, yeah, about 30% right now, we're at about 36% same-store sales growth for the year.\n\nSo Again, there's just -- there's still some level of uncertainty as far as the deliveries, the timing, as BJ mentioned on the call between quarters, between fiscal years, but that's kind of our best estimate at this point.\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nThat's helpful. Thank you for that. And then on the discussion that you had on manufacturer incentives, the way I heard it is $2.6 million, obviously, in the quarter, you expect at least $3 million, but that seems to be more or less the same amount that you've recognized last year in incentives. And maybe this is where you can educate me a little bit as to how these work.\n\nIsn't it fair to assume that your incentives would actually be higher this year since you're obviously selling a lot more equipment?\n\nMark Kalvoda -- Chief Financial Officer\n\nSo, yeah. So first of all, the -- yeah, the three -- so last year, we had $5.1 million. So with the $3 million on the back, that would be $5 million, $6 million, so up a little bit. And we can't get into how these manufacturer incentives are.\n\nFor competitive reasons, we just -- we don't get into the makeup and the details of it. But yes, I would expect that there would be some growth there. We have some growth kind of built in from last year in the numbers in our guidance now. And certainly, it could grow from there.\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nOK. I'm sorry, I have two more. One of them, you talked about your supplier being able to ship equipment and it was pretty clear in the quarter. When I'm looking at new equipment inventory, this is really the highest inventory you've had in a couple of years now.\n\nAnd I guess -- I'm wondering why is it that you're seeing this? Because it strikes me that everything that we've heard from the OEMs broadly, not just your supplier is that, frankly, things have remained pretty difficult, pretty choppy and production still struggles to ramp sequentially. So you seem to be in better shape in terms of your deliveries than pretty much anybody else that I've seen and I'm wondering why that is.\n\nMark Kalvoda -- Chief Financial Officer\n\nYeah, Mig. You're right. And again, really pleased with the deliveries we have gotten and the effort from our suppliers and really, like I said, back to our team. So a lot of presales coming through here and a lot of those go back to ordered a long time ago, and our team got out of the gate really early.\n\nAnd also when order books came out, in some cases here, we're looking at well over a year ago, and ordered up right away and got orders in early, again, from staying close to our customers as well as a lot of the initiatives we've had around inventory management here and just closely monitoring what our needs are and again, getting those orders in really early. So we're starting to see some of those shipments come through on those orders that were placed a long time ago. And then a little bit of that uptick, of course, that you see on the inventory is sales whip that is built into our modeling that then will come through and book through here in the second half of the year as well as. It just takes us a little bit of time to get the machines predelivered and get them out to the customer.\n\nAnd so during that transition period, those used being on our balance sheet even on the presales. But yeah, just working really closely with our suppliers and really managing what we can control as tightly as we can and hope to continue to execute that going forward and hope the supply chain starts to open up here one of these days as you know certainly been a challenge for manufacturers.\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nUnderstood. Last question, and I understand that you're not providing fiscal '24 guidance, but I am curious as to how you're managing the business as you're looking at fiscal '24, right? Because presumably, the conversations you're having with customers right now, they're not really involving near-term equipment deliveries. If people are putting in an order now, they probably don't get billed until '24. So are you able to pre-sell equipment right now? If you're not, how are you managing the demand pipeline? And can you give us more context in terms of how that demand pipeline is shaping up your customer conversations into fiscal '24 or calendar '23 as it were? Thank you.\n\nMark Kalvoda -- Chief Financial Officer\n\nYeah. So our teams, like you said, staying really close with the customers, having those conversations, planning the business. You -- we do -- as you -- we know our current pricing today, stay close with our manufacturers, a lot of conversation around anticipated price increase and then work with our customers as best we can to anticipate price and anticipate deliveries. And both of those have been very fluid.\n\nSo just doing the best job we can, giving them a directional idea on price in their businesses, knowing what they need and hey, directionally, here's the price. This will work for them in that area. And then the timing, just securing it as fast as we can then and clarifying expectations with the customers so that they know, hey, this is -- may not make it in time for harvest as an example, with a combine or a spring planting with a planter, but then working with them proactively to make provisions for using their old one or whatever we need to do if the deliveries do get delayed, which has been a very common thing that our teams are getting pretty good at working through now.\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nSorry to press you on this, just so that I understand this. Are you able to sort of take a firm order and a firm commitment from customers now for fiscal '24 deliveries? Are you able to do that? Or is it just sort of an indication of interest, and you'll come back to it when the OEM decides that they're kind of opening the order book?\n\nMark Kalvoda -- Chief Financial Officer\n\nYeah. So firm orders for Q1, Mig, we can take. And then as you get beyond that, so if you go to the other end of the spectrum, Q4 starts to be, as I described, more of a business planning together and directional, if you will. We'll get the orders in and then caution them and just work together and hey, we know they want it.\n\nThey know -- here's about the price, and we're going to get it as soon as we can, and we're going to work with them on the timing. But yes, as far as firm just comes as the order books released, if you will. And so we'll get into Q2 and Q3 order books here, anticipated sometime soon in Q3 here.\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nUnderstood. OK, thank you, guys.\n\nMark Kalvoda -- Chief Financial Officer\n\nThanks, Mig.\n\nOperator\n\nThank you. Ladies and gentlemen, that concludes our time allowed for questions. I'll turn the floor back to Mr. Meyer for final comments.\n\nDavid Meyer -- Chairman and Chief Executive Officer\n\nWell, thank you, everyone, for your interest in Titan Machinery and your time on the call today, and we look forward to updating you on our progress on our next call. So have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJeff Sonnek -- Investor Relations\n\nDavid Meyer -- Chairman and Chief Executive Officer\n\nBryan Knutson -- Chief Operating Officer\n\nMark Kalvoda -- Chief Financial Officer\n\nUnknown speaker\n\nLarry De Maria -- William Blair and Company -- Analyst\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nMore TITN analysis\n\nAll earnings call transcripts"
}