{
  "companyName": "Rapid Micro Biosystems, Inc.",
  "companyTicker": "RPID",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/rapid-micro-biosystems-inc-rpid-q2-2022-earnings-c/",
  "content": "Rapid Micro Biosystems, Inc. (RPID -8.87%)\nQ2 2022 Earnings Call\nAug 12, 2022, 8:30 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the Rapid Micro Biosystems second quarter 2022 earnings conference call. I would now like to turn the call over to Mike Beaulieu, investor relations. Please go ahead.\n\nMike Beaulieu -- Investor Relations\n\nGood morning, and thank you for joining the Rapid Micro Biosystems second quarter 2022 earnings call. Joining me on the call are Rob Spignesi, chief executive officer; and Sean Wirtjes, chief financial officer. Earlier today, we issued a press release announcing a business update and our second quarter financial results. A copy of the release is available on the company's website at rapidmicrobio.com under investors in the news and events section.\n\nBefore we begin, I'd like to remind you that many statements made during this call may be considered forward-looking statements within the meaning of federal securities laws, which are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Any statements contained in this call that relate to expectations or predictions of future events, results or performance are forward-looking statements, including, but not limited to, statements relating to Rapid Micro's financial condition and future revenue and system placements, expectations for organizational restructuring plan, expectations for business development and growth, the board of directors' review of potential strategic alternatives, customer interest and adoption of the growth direct system and the potential impact of macroeconomic uncertainty and COVID-19 on Rapid Micro's business. Actual results may differ materially from those expressed or implied in the forward-looking statements due to a variety of factors. For a list and description of the risks and uncertainties associated with Rapid Micro's business, please refer to the Risk Factors section of our annual report on Form 10-K filed with the Securities and Exchange Commission on March 24, 2022, as such risk factors are updated in our subsequent filings with the SEC.\n\nWe urge you to consider these factors and you should be aware that these statements should be considered estimates only and are not a guarantee of future performance. Also, the company's contract with the U.S. Biomedical Advanced Research and Development Authority, or BARDA, was completed in the fourth quarter of 2021. Throughout our quarterly performance discussions, we'll be excluding the noncommercial revenue impact from BARDA by comparing total 2022 revenue to commercial revenue in 2021.\n\nThis conference call contains time-sensitive information and is accurate only as of the live broadcast today, August 12, 2022. Rapid Micro disclaims any intention or obligation, except as required by law, to update or revise financial projections or forward-looking statements, whether because of new information, future events or otherwise. And with that, I'll now turn the call over to Rob.\n\nRob Spignesi -- Chief Executive Officer\n\nThank you, Mike. Good morning, everyone, and thank you for joining us today. Typically, I will start our prepared remarks with a brief review of our Q2 results. However, given that we issued two significant press releases this morning, I'll focus my remarks today on the key takeaways from those announcements, as well as a few other important business updates.\n\nSean will then cover our Q2 results in his remarks. First, we are lowering our full year 2022 commercial revenue guidance to be at least $17 million due to a significant decrease in the expected number of system placements in the second half of this year based on an assessment we completed following the close of the second quarter. This decrease was driven by changes in our expectations regarding the time it will take to close system opportunities we had previously forecasted for the second half. I'll provide more details on the specific reasons behind this later in my remarks.\n\nSecond, we are implementing an organizational restructuring plan to better align our cost structure with our revised 2022 outlook with a focus on prioritizing improved commercial execution and investments and key growth initiatives to drive future revenue growth. The actions under this plan include an approximately 20% reduction in our workforce, which is largely focused on noncommercial functions and the reduction of certain other expenses and capital expenditures. We expect these actions will result in approximately $8 million to $9 million in annualized cost savings by Q1 2023, helping us protect our significant cash position. We are extremely focused on responsible cash management and continue to expect our current cash and investments of nearly $170 million to provide us runway into at least 2026.\n\nDecisions like these are never easy, and this was especially difficult given how hard the entire RMB team has worked. I would like to personally thank every colleague that is being impacted for their unwavering commitment to the company. You have played an important part in the company's growth and path and your contributions are truly appreciated. As part of the restructuring action, we are making changes to enhance our commercial organization and capability.\n\nAs a result of these changes, our chief commercial officer will be leaving the company, and I am assuming commercial leadership responsibilities. In this role, I will be working very closely with our sales team to drive system placements through increased customer engagement and improved sales execution. I spent several weeks in the field with customers during Q2, and those interactions helped to clarify from both the challenges we saw in the latter half of the quarter and the actions we need to take to address them. Getting system placements back on track is my highest priority.\n\nThird, as many of you know, on June 30, we received an unsolicited proposal from Kennedy Lewis Investment Management to acquire all outstanding shares of the company for $5 per share. After a comprehensive review, our board has rejected this proposal after determining that it is inadequate and is not in the best interest of the company or our shareholders. Also this morning, we announced that our board has engaged Morgan Stanley to work with us on a review of strategic alternatives to maximize shareholder value. This process will include consideration of a wide range of options, including opportunities for sale, merger or other strategic transaction.\n\nAlthough the board has determined that Kennedy Lewi's proposal of $5 per share is inadequate and is not in the best interest of the company or its shareholders, Morgan Stanley has reached out to invite them to participate in the process. As I'm sure you're all aware, we now need to let this process play out, and therefore, we won't have further comment on it today. The board has also adopted a limited duration of shareholder rights plan to protect the company and its shareholders and provide the board with the appropriate time and flexibility to conduct their review of strategic alternatives and pursue the best course of action for all shareholders. The shareholder rights plan will automatically expire on the day after our 2023 Annual Meeting of Stockholders, unless approved by our stockholders at the 2023 annual meeting, in which case, it will expire in one year on August 11, 2023.\n\nAs our board commences their strategic review, we remain confident in the significant potential of our market opportunity, business model, product and service differentiation and land-and-expand strategy. Competitive intensity remains low and the value proposition for the growth direct system continues to resonate with both current and prospective customers. Our recurring revenue from consumables and service contracts remain strong, reflecting the use and value of our systems in critical applications. Additionally, customers are excited about our rapid sterility and mold detection products in development.\n\nWe are also ahead of schedule on our manufacturing efficiency initiatives to lower costs and improve gross margins in consumables, and we have a strong balance sheet, which provides us with long cash runway and resources to fund our key growth and margin improvement initiatives. Sean will provide additional details for each of these in a few minutes. I would now like to shift back to discuss our revised guidance and walk through the key factors underlying our lowered expectations for full year 2022 system placements. As we've discussed on previous calls, direct site and customer access is critical in our sales process, which can take up to 12 to 18 months from initial customer contact to the sale of a growth direct system.\n\nAs access to customer sites and in-person engagement continue to improve gradually as we move through the second quarter and into Q3. We gain deeper insight into our customers' current processes for purchasing capital equipment, including challenges created by the pandemic, allowing us to more accurately assess the status and timing of sales opportunities during our post-quarter analysis. We have also identified and are acting on opportunities to improve aspects of our sales process and sales team training. With the insights gained, it also became clear that many sales opportunities generated during the pandemic lack the accuracy of timing information that we historically got from on-site interactions with customers.\n\nWe learned that as customer site access improved, we gain increased clarity of when system placements could be expected, particularly toward the end of the quarter. Our ongoing discussions with customers give us confidence that a significant number of the opportunities we've generated will ultimately close. We anticipate that more time will be required to move deals to the finish line. As a result, we expect this to meaningfully impact our ability to close a significant number of the system placement opportunities that we had previously anticipated in the second half of the year, including several multisystem deals with existing customers.\n\nHaving said that, we continue to work diligently with a number of these customers in an effort to pull additional placements into 2022. It's important to note that approximately 70% of our global capital equipment sales force has been hired within the last year and is still ramping as site access expands and ongoing sales process improvements, training and enablement initiatives take hold. Improving the consistency and effectiveness of our global sales team remains a top priority and in conjunction with direct customer access is one of the most important elements in driving system sales. Selling happens best and our teams learn the most when they are on-site and in-person with customers.\n\nSo we are confident they will begin to ramp faster as we implement further initiatives to align and improve training and processes as in-person engagement continues to progress in the coming quarters. While we are ramping up on-site engagement with customers and taking decisive action, we expect meaningful improvement in system placements to take time. Some of the key actions that will drive this improvement include, we have largely completed our near-term investments in expanding our commercial sales and field service support organizations with highly experienced industry professionals. We are enhancing our sales processes with additional training and new sales tools and marketing campaigns.\n\nWe are actively engaging with our key existing customers who support them as they integrate their existing growth direct system and identifying new opportunities to expand within their global manufacturing networks. We continue to focus on our funnel quantity and quality and new high-quality lead and opportunity generation. During the second quarter, we participated in six in-person industry conferences, three in the United States, two in Europe and one of the largest industry conferences in Korea. We held multiple seminars, teach-ins and growth direct demonstrations, which generated dozens of new high-quality customer leads.\n\nCustomer feedback and reception was very strong across these events, and we are well-positioned as customer site access and in-person activities improve, all of which continues to give us confidence in our market opportunity. In addition to these specific commercial action items, we continue to advance development of our mold detection and rapid sterility products, both of which remain on track. We expect to begin prelaunch activities for our exciting new mold detection product later this year and fully launch our product in the first half of 2023. As a reminder, our mold detection software will enable customers to differentiate mold from other categories and microorganisms such as bacteria.\n\nMole detection will be integrated into the growth direct platform and is a highly differentiated product that provides customers valuable operational and quality information much faster that will provide improved decision-making within the larger value proposition of our growth direct to include data integrity. Also during the second quarter, we began beta testing our Rapid Sterility system with a large top pharma company. Our Rapid Sterility offers compelling differentiation versus existing sterility products and will be especially important for time-sensitive products such as vaccines, biologics, sterile injectables and cell and gene therapies. The beta is going well, and we are receiving valuable real-world feedback that will help to ensure a successful launch.\n\nWe will continue to keep you updated on our progress over the coming months. In summary, we remain confident that the growth direct system is creating the future of Rapid secure microbial quality control automation. We have a strong customer base, which includes over half of the top 20 largest global pharmaceutical manufacturers. Competitive intensity remains low, and we continue to receive strong positive signals from customers and stakeholders as there's a large market opportunity for our growth direct system.\n\nWe expect the steps we are taking to enable our commercial team to more effectively reach customers, help them understand the benefits of our system and guide them through the implementation process in their facilities worldwide. While our recent performance and revised 2022 outlook are disappointing, we are confident that the totality of our actions while a meaningful positive impact on accelerating system sales and sustain a strong balance sheet for years to come. That concludes my prepared remarks. I will now turn the call over to Sean to discuss our second quarter performance and provide some additional details on our outlook.\n\nSean?\n\nSean Wirtjes -- Chief Financial Officer\n\nThanks, Rob. Good morning, everyone. This morning, we reported second quarter 2022 revenue of $3.9 million, which compares to $5.7 million of commercial revenue reported in Q2 2021. Product revenue, which is comprised of systems and consumables, was $2.4 million in Q2, compared to $4.1 million last year.\n\nThe decline was due to few replacements of growth direct systems, partially offset by continued growth in consumables. We placed two growth direct systems in Q2, which was consistent with our expectations and compares to eight systems placed in the second quarter last year. Revenue from consumables increased approximately 20% in the second quarter, despite some third-party logistics delays in the final days of the quarter that pushed approximately $200,000 of consumable revenue out of Q2 and into the third quarter. The growth in consumables revenue continues to be driven by our expanding base of validated systems in the field and additional validated systems entering routine use.\n\nWhile we expect consumables to continue to be a primary contributor to our growth over time, the rate of growth can vary from quarter to quarter due to factors such as the pace and timing of system placements and validations, the speed at which customers transition to routine use and their ordering patterns. Service revenue was $1.4 million in Q2, compared to $1.6 million in the second quarter of 2021. We completed the validation of three systems in the second quarter, which was somewhat below our expectations. This compares to 11 validations completed in the same period last year.\n\nA few validations we expected to finish in Q2 pushed into Q3 due to customer-related delays in the second half of the quarter. As we've discussed previously, the timing of validations can vary based on customer resources or project variables such as site construction, and this was the case in Q2. That said, the decline in validations was partially offset by encouraging growth of nearly 70% in service contract revenue associated with our growing base of validated systems. Recurring revenue increased 31% to $2.5 million in the second quarter, driven once again by both consumables and service contracts, despite the impact of the consumables delay I mentioned earlier.\n\nExcluding the impact of these delays, recurring revenue grew over 40% in Q2. Nonrecurring revenue was $1.4 million in Q2, compared to $3.8 million last year as a result of lower revenue from system placements and validation. Turning to gross margins. Product margins were negative $0.8 million in Q2, compared to negative $2.0 million in the second quarter last year.\n\nWhile system margins were negative in the quarter due to lower system revenue, consumable margins improved meaningfully on both a year-over-year and sequential basis. We remain ahead of schedule as we continue to execute against our manufacturing efficiency initiatives to lower costs and improve margins on our consumable products. Service margins were negative $0.4 million in Q2, compared to positive $0.3 million last year. The decline was due to lower validation revenue, as well as higher spending on personnel, travel and materials associated with field service and validation activity.\n\nOn a combined basis, our second quarter gross margin percentage was flat at around negative 30% versus Q2 last year, despite a headwind from lower revenue. The strong progress we've made with our ongoing manufacturing efficiency initiatives and consumables largely offset the negative impact from lower system and service revenue in the quarter. While we continue to see some inflationary headwinds in certain material, freight and labor costs, it did not have a meaningful impact during the quarter. Moving down the P&L.\n\nTotal operating expenses were $12.9 million in the second quarter, consisting of $3.5 million in sales and marketing, $3.0 million in R&D and $6.4 million in G&A. This compares to total operating expenses of $9.1 million in the second quarter of 2021. This increase was largely due to investments in commercial and product development, as well as higher expenses incurred to operate as a public company. Net loss was $13.1 million in Q2.\n\nThis compares to a net loss of $11.8 million in the second quarter of 2021. Net loss per share attributable to common shareholders was $0.31 in Q2 2022 as compared to $20.01 in the prior-year quarter. The majority of this difference is due to the increase in weighted average common shares outstanding in connection with the company's initial public offering in July 2021. With respect to noncash expenses and capex, depreciation and amortization was $0.7 million, stock comp expense was $1.3 million and capital expenditures were $2.0 million in the second quarter of 2022.\n\nAs of June 30, we had $166.9 million in cash, cash equivalents and investments. While the restructuring actions we announced this morning will reduce our underlying cash burn rate meaningfully, they also involve severance and other nonrecurring cash payments that will negatively impact our burn rate through Q3 next year. At the same time, we also continue to selectively invest in our growth initiatives. Taking all this into consideration, we expect to finish the year with between $140 million and $145 million in cash and investments.\n\nWe are focused on managing our cash prudently and continue to expect that this will give us cash runway at least into 2026. I'll now shift to the revised guidance we announced earlier today. As Rob discussed, we are lowering our full year commercial revenue guidance to at least $17 million. This assumes that the company will place between three and five systems in the second half of the year with most or all of these placements made in the fourth quarter.\n\nThe change to our revenue guidance reflects our revised expectation for fewer system placements in fiscal year 2022 as we continue to work on expanding on-site customer access, ramping our commercial team and optimizing commercial execution. It also reflects macroeconomic uncertainty impacting the timing of some customer purchase decisions that we expect to persist through the end of the second half of the year. For example, turnover and staffing shortages have delayed some customer purchase decisions and supply chain disruptions at other customers have delayed new construction where growth directs are planned. We are also experiencing longer-than-expected lead times for some multisystem orders as we work with customers across several sites and geographies.\n\nCompared to our previous guidance range, lower system placements account for 70% to 80% of the reduction with lower validations revenue due to lower system placements accounting for the majority of the remainder. Moving to validations. We now expect to complete at least seven validations in the second half. We expect them to be split relatively equally between Q3 and Q4.\n\nThis change is largely driven by our expectation of lower system placements, which will likely limit our opportunities to complete new validations in the second half. With respect to consumables, we work closely with our customers to ensure they have appropriate inventory levels to run their businesses and believe this gives us good near-term visibility into this key recurring revenue stream. We currently expect year-over-year consumables revenue growth of around 30% in the second half of the year with revenue increasing sequentially from Q2 to Q3 and then again from Q3 to Q4. In service, we now expect full year 2022 revenue growth in the single digits with lower validations revenue due to lower system placements more than offset by mid-double-digit growth in recurring revenues from service contracts.\n\nWe also expect service revenue to be relatively consistent between Q3 and Q4. From an overall gross margin standpoint, we currently expect to take a step back in Q3 due to lower forecasted system placements. While we are now unlikely to achieve positive gross margins in Q4 due to lower sales volume leverage versus our prior outlook. We continue to make good progress on our manufacturing efficiency initiatives in consumables and expect to benefit from higher system placement volume compared to the first three quarters of the year.\n\nWe are optimistic that these factors will move us meaningfully closer to this important milestone in Q4 and position us to achieve it in 2023. Finally, we are expecting GAAP operating expenses in Q3 and Q4 to be between $14 million and $15 million. This is higher than Q2 due mainly to onetime costs relating to the restructuring and other related activities, as well as estimated costs related to the unsolicited proposal we recently received from Kennedy Lewis and the strategic review our board is commencing. Excluding these onetime costs, we expect our operating expense run rate to rebase around roughly $12 million per quarter by the end of the year once the cost-saving measures we announced today take full effect.\n\nThat concludes my comments on our updated 2022 outlook. So at this point, we'll open the call up for questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question comes from Tejas Savant from Morgan Stanley.\n\nYuko Oku -- Morgan Stanley -- Analyst\n\nThis is Yuko on for Tejas. Thank you for taking our questions. With a few quarters now of soft system placements, could you remind us of the efforts underway to decrease that time lag between quarters and full utilization?\n\nSean Wirtjes -- Chief Financial Officer\n\nYuko, you're coming across very quiet to us.\n\nRob Spignesi -- Chief Executive Officer\n\nCould you repeat the question?\n\nYuko Oku -- Morgan Stanley -- Analyst\n\nYeah, just efforts underway to decrease the time between system orders and full utilization.\n\nRob Spignesi -- Chief Executive Officer\n\nSean will take the first.\n\nSean Wirtjes -- Chief Financial Officer\n\nYeah, yeah, sure, Yuko. So we have a number of different things happening in the business on each phase, kind of taking it from installation, speeding that process up, moving us into validation more quickly and then each of the steps that we are required to do with customers to validate their systems. I think, we've talked in the past about some things we're doing to automate parts of that process or standardize them so that we have documentation in hand as opposed to needing to bespoke work with each customer. We are making good progress on that.\n\nI think, we've got one phase of that work that's completed now that is removing several weeks from a typical validation processes at this point, but with more substantial opportunity in front of us that we continue to work on as well. We are also looking at opportunities using some folks that we've added to our organization to help manage the process with each customer to work with customers more proactively upfront to help them get from the point where they complete their validation to routine use more quickly as well. So we're seeing some benefit from that. I'd say, it's still relatively early days, but there's -- we believe there's significant potential to speed that part of the process as well.\n\nRob Spignesi -- Chief Executive Officer\n\nYeah. And just to build on Sean's point, the group that we've constituted last year, are basically global project managers that work hand in well with our teams and our customers critically to move efficiently through the process. You saw and touched on this as well, but it's important to note that we've done this dozens of times around the world, and we've built a database up of the various organisms and approaches to implement the system. And customers are starting to accept this data which obviates the need to do some on-site testing, which also accelerates the process, and additionally, we're able to parallel path a number of processes as well.\n\nSo all of this is geared toward getting customers into routine use faster. And I think, a very clear proof point and that continues to prove itself out as our systems are being used and pulling through consumables and driving value for our customers globally as you can see in our recurring revenue.\n\nYuko Oku -- Morgan Stanley -- Analyst\n\nGreat. And then, you also noted longer lead times closed sale in your prepared remarks. Could you elaborate on those dynamics? And do you see this more pronounced in any particular region?\n\nRob Spignesi -- Chief Executive Officer\n\nYeah, no, it's the -- really, the -- as we discussed on previous calls, it's critical for us to be on site working with customers. It's just a relatively complex sales process. It's usually more than one stakeholder involved in the decision-making process. So the remote nature of some elements of the sales process during COVID think about risk in the gear, it just puts friction into the sales process.\n\nIt makes it harder to estimate the timing. We are encouraged in Q2. We've been able to get on to many more sites as we discussed globally. This is region independent.\n\nWe've had very good access in the U.S., certainly good access and improving access in Europe. Even improving access in Asia. Importantly, as well, customers are back at trade shows. So this live activity is increasing both at the big industry events globally, as well as on-site critically customer environment, which helps us to, a, get better visibility of the timing of our process and also to facilitate the speed up.\n\nNow things are opening up in Q2, and we're gradually -- and we're getting encouraged, but that was a feature in COVID with regard to things being a bit difficult to resolve visibility, but we do see the visibility on gradually increasing as we are engaging more directly with customers.\n\nYuko Oku -- Morgan Stanley -- Analyst\n\nRight. Thank you.\n\nOperator\n\nOur next question comes from Daniel Arias from Stifel.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nMorning, guys. Thanks for the questions. Sean, on the longer-term forecast, during the IPO process, I think you had talked about cumulative placements by 2024 being sort of in the neighborhood of 350 to 360 placements or installs. Given the way that this year is shaping up and next year might look, what do you see as a reasonable target at this point?\n\nSean Wirtjes -- Chief Financial Officer\n\nYeah, I think, not going to give a specific number, Dan, but I think what I can talk about is what we expect that to kind of happen as we move our way out of this year and into next year. So '23, we expect to get back to good double-digit growth. We expect our recurring revenue to continue to crank along and well into the double digits. We expect system placements to be meaningfully better than they are this year.\n\nI think, Rob talked a lot about the reasons why we have experienced what we've experienced, but also why we have growing confidence in our funnel and our ability to convert those deals with better and better clarity. So I think, as we look -- there will be probably a bit of a headwind on service and validations just given what this year's placements look like. But I think, overall, particularly with an expectation that placements get back on track that we'll be able to deliver the kind of growth that we typically expect for this business as we look at '23 and beyond.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nOK. And then, Rob, maybe on validation timelines that I think have been a little longer in cases than maybe you would like three to nine months on average. When you think about the parts of that process, installation, performance qualification, method qualification, which of those do you think you can most meaningfully shorten at this point and given the way that the business will be evolving next year?\n\nRob Spignesi -- Chief Executive Officer\n\nYeah. We've -- with what we call Project Rapid, we've impacted, Dan, meaningfully the IOQPQ process, which we contracted the timelines on -- as Sean touched on, we're still working on different parts. There are some downstream parts that we work with the customer on our time to result studies and what's called method qualifications, which is certainly in scope for us to continue to improve. So the takeaway is, we're pleased with the ongoing and recurring and continuous improvement we're making, and we expect more gains in the coming quarters.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nOK. Appreciate it. Thank you, guys.\n\nOperator\n\nOur next question comes from Max Masucci from Cowen.\n\nStephanie Yan -- Cowen and Company -- Analyst\n\nHi, this is Stephanie on for Max. Thanks for taking my question. Rob, you noticed that you identified some sales-related challenges and opportunities to improve aspects of your sales process and sales team training. Do you mind just walking us through what exactly the sales process and training looks like in Q2, the challenges that you saw and what areas you specifically see room to improve?\n\nRob Spignesi -- Chief Executive Officer\n\nYeah, sure. So as I mentioned, our sales team is relatively new, and Q2 marked the first time in a while that on a reasonably recurring basis we were gradually more to our customer environment. So it was -- I spent quite a bit of time with the team in the field as well. So first is the process itself, increased focus on the training around our process.\n\nAgain, a relatively complex sales process going from initial conversation to a customer through understanding the customer needs all the way through a close. I won't go through the detail on this call, but it is a process that the sales reps have to be proficient and it's a consultative sale to move through that in a proficient way, an organized way to close the sales of critical skills. So that's clearly an area that we've identified as increased in training opportunities. And then, with that, to continue product exposure with our new team, understanding the growth direct and how it fits into the broader customer environment, also a strong training element that we're focused on.\n\nAnd then, lead generation, a new opportunity of generation, both with our increased marketing effort, as well as our direct prospect with our sales team. We are all among other initiatives that we're focused on to improve new opportunity creation and then having our sales team close them on a streamlined time frame.\n\nStephanie Yan -- Cowen and Company -- Analyst\n\nGot it. Thanks for that color. And then, second question around the organizational restructuring plan. So you mentioned that involved a 20% reduction in your company's workforce, mostly on noncommercial functions.\n\nCan you remind us where your current company headcount stands in addition to where your sales team headcount stands? And then, more typically, around other initiatives other than the portfolio transaction that the restructuring plan involved.\n\nSean Wirtjes -- Chief Financial Officer\n\nYeah, I'll start it off, and I think Rob will have some comments, too, Stephanie. Yes. So we'll end after this action, right? Just think of it as right around 200 headcount for the business, and that -- we think that's the right place to be given kind of where we are right now as a business and what we need to get done, including the areas where we're investing for growth in terms of our commercial organization and our product development. Rob talked about mold and sterility, which are very important to us at this point strategically.\n\nRob Spignesi -- Chief Executive Officer\n\nStephanie, the sales headcount, think of our direct sales force, our capital equipment sales force deployed across U.S., Europe and Asia as low double-digit numbers and full quota carrying. This doesn't include other elements of our commercial team, such as our consumable salespeople and our validation and service folks.\n\nStephanie Yan -- Cowen and Company -- Analyst\n\nGot it. Understood. Thanks for taking my question.\n\nRob Spignesi -- Chief Executive Officer\n\nSure. Thank you.\n\nOperator\n\nOur next question comes from Rachel Cascio with J.P. Morgan.\n\nRachel Cascio -- J.P. Morgan -- Analyst\n\nHi. Thanks for taking the questions, you guys. So first off, on gross margin, you said you no longer expect gross margins to flip positive in 4Q. So can you just walk us through how we should think about the margin progression here.\n\nAs a side, you've also topped out that 70% gross margin target before. We appreciate that most of that really comes from operating leverage on the consumables volume line. So can you just walk us through, is there a consumables number that's really tied to that 70% gross margin target? Would it be at $50 million in consumables, $100 million to be able to reach that? Any color on how you're thinking about gross margins would be helpful. Thanks.\n\nSean Wirtjes -- Chief Financial Officer\n\nYeah, I'll start more near term, Rachel. I think, you touched on it. Operating leverage is what is driving the change in where our expectation for Q4 with system placements expectations now where we have them, it doesn't give us enough leverage there. I mentioned it in my comments, we were ahead of schedule on consumables margins compared to what I think longer term, that's very encouraging that we're doing the things that we had intended to do and doing them faster at least at this point in the year than what we expected.\n\nYes, I'm not going to give a specific number. It's out in that range that you're talking about in terms of when we can get consumable margins up to the kind of range that you mentioned. I think -- but it's contingent upon both operating leverage and a number of internal initiatives, both the ones we're doing today and others we've got. We have teed up for the future to get to that point.\n\nSo there's an execution element there that we are very, very focused on in the business and our operations organization in particular, but that operating leverage is critical to getting us there as well. So we'll make progress on both fronts, we believe, as we look toward '23. Those are both areas that will help us continue to push those margins forward, both in consumables and overall and give us confidence that we'll get it positive in 2023.\n\nRachel Cascio -- J.P. Morgan -- Analyst\n\nGot it. And then, you flagged a few multisystem orders that were delayed during the quarter. Those large multi orders, obviously, can drive a fair amount of lumpiness. So can you walk us through specifically what's going on with those? And since as -- and then is there a risk that those leads could really fall out of the funnel? And what's assumed for closing rates for each of those multisystem orders going forward? Thanks.\n\nRob Spignesi -- Chief Executive Officer\n\nYeah. So many of the orders that we referred to are existing customers. Not all is a good blend that we think the -- we are confident that we will secure those orders. It's more a function of time than if it's if.\n\nAnd it typically boils down in these cases were no different to usually cut customer-specific issues. We see construction -- these macro -- broadly macro areas. We can call it, turnover, for example, has still been a feature. If we lose a project champion or someone we deploy to a different internal project can slow down a process.\n\nWe see construction somewhat frequently getting our way, too. In some cases, a site needs to be fitted for the growth racks. In some cases, new later being built. All these can create lags with regard to system placements, and the current situation is no different.\n\nRachel Cascio -- J.P. Morgan -- Analyst\n\nGot it. That's it for me. Thank you.\n\nOperator\n\nThat does conclude today's questions. I would now like to turn the call over to Rob Spignesi, CEO, for closing remarks.\n\nRob Spignesi -- Chief Executive Officer\n\nWell, thank you all for joining us today. We appreciate your interest in our company and look forward to speaking with many of you in the coming weeks, and we hope to see many of you in-person on September 13 at the Morgan Stanley Healthcare Conference. Thank you again.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMike Beaulieu -- Investor Relations\n\nRob Spignesi -- Chief Executive Officer\n\nSean Wirtjes -- Chief Financial Officer\n\nYuko Oku -- Morgan Stanley -- Analyst\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nStephanie Yan -- Cowen and Company -- Analyst\n\nRachel Cascio -- J.P. Morgan -- Analyst\n\nMore RPID analysis\n\nAll earnings call transcripts"
}