{
  "companyName": "Crescent Energy Company",
  "companyTicker": "CRGY",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/crescent-energy-company-crgy-q2-2022-earnings-call/",
  "content": "Crescent Energy Company (CRGY -0.17%)\nQ2 2022 Earnings Call\nAug 10, 2022, 11:00 a.m. ET\n\nOperator\n\nGreetings. Welcome to Crescent Energy's second quarter 2022 results conference call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation.\n\n[Operator instructions] Please note, this conference is being recorded. I will now turn the conference over to Brandi Kendall, chief financial officer. Thank you. You may begin.\n\nBrandi Kendall -- Chief Financial Officer\n\nGood morning and thank you for joining Crescent's second quarter 2022 earnings call. Our prepared remarks today will come from our CEO, David Rockecharlie, and myself. Todd Falk,  chief accounting officer; and Ben Conner and Clay Rynd, both executive vice presidents are also here today and available during the Q&A. Today's call may contain projections and other forward-looking statements within the meaning of the federal securities law.\n\nThese statements are subject to risks and uncertainties, including commodity price volatility, the continued impacts of COVID-19, geopolitical conflict, including in Russia and Ukraine, our business strategies, and other factors that may cause actual results to differ from those expressed or implied in these statements and our other disclosures. We disclaim any obligation to update any forward-looking statements after today's call. In addition, today's discussion may include disclosure regarding non-GAAP financial measures for reconciliation of historical non-GAAP financial measures to the most directly comparable GAAP measure, please reference our 10-Q and earnings press release available on our website. With that, I will turn it over to David.\n\nDavid Rockecharlie -- Chief Executive Officer\n\nThanks, Brandi, and good morning, everyone. We appreciate your joining us today for our second quarter 2022 earnings call. It's been less than a year since we began trading publicly as Crescent Energy, and we continue to be excited about the market opportunity ahead of us. For over a decade, our organization has maintained a consistent strategy based on cash flow, risk management, and investment returns, with the goal of creating long-term value for shareholders through commodity cycles.\n\nWe believe now more than ever that Crescent remains exceptionally well-positioned to execute on this strategy. We are pleased to share with you today's results as this is our first full quarter, including our recent Uinta Basin acquisition. As a reminder, we will also take your specific questions at the end of our remarks. Overall, our second quarter results were in line with our performance expectations as we focused on operations of our existing assets and the successful integration of our highly accretive Uinta Basin acquisition.\n\nThe addition of the Uinta assets has significantly increased the scale of our production base, reduced our per unit cost structure, and added high margin oil inventory, which has resulted in significant growth in our business. Relative to our first quarter results, net production has increased 18% and adjusted EBITDA has increased 92%, offering another tangible example of our acquisition strategy creating value for shareholders. In the second quarter, we continued to generate significant free cash flow and strong returns on invested capital, allowing us to maintain a healthy balance sheet and return capital to shareholders through our fixed quarterly dividend structure. Operationally, we continue to execute on our 2022 capital program, having maintained three rigs across the Uinta and Eagle Ford and brought on line 13 gross operated wells for the quarter.\n\nAdditionally, we participated in nine gross and two net wells drilled across our non-operated assets in the Eagle Ford. Crescent's large held-by-production resource position has always allowed us to make returns-driven development decisions. And in today's commodity environment, our quality multi-year inventory continues to see exceptional returns on capital with short payback periods. While operational performance has been strong and the business continues to grow significantly, Crescent remains relatively new to the public markets.\n\nWe believe it's critical that we continue to increase market awareness of the company, our strategy and our proven track record of generating shareholder value. As I said earlier, we describe our strategy as focused on cash flow, risk management, and returns. We generate significant free cash flow from our large, diversified, and low decline producing asset base. We manage risk through a portfolio approach to asset selection and by maintaining our strong balance sheet supported by our hedge program.\n\nAnd we seek to deliver strong returns on invested capital both through internal development and complementary accretive acquisitions, all in order to drive profitable long-term value for shareholders. This is the same strategy we've executed on for the last decade in the private markets across commodity cycles, and we continue to believe it's the optimal approach to creating value in our sector. Turning to the market backdrop, we would highlight that following years of underinvestment in the oil and gas sector, we are in a period of unique volatility, which has been driven by the rapid recovery of global economies, post-pandemic and exacerbated by unprecedented geopolitical dynamics. While sustained higher commodity prices have bolstered our overall outlook, broader inflationary pressures and supply chain constraints continue to manifest across the oil and gas industry and will remain a key theme for the remainder of this year at least.\n\nIn the A&D market, we're on pace to evaluate around 150 to 200 opportunities this year, which we firmly believe provides us with a differentiated view of the opportunity set available today. Given the heightened commodity price environment, we've seen a significant increase in assets on the market in 2022 as private sellers look to capitalize on higher prices and certain publics look to rationalize their portfolios of non-core assets. In our view, the volatility in commodity prices alongside the steep backwardation in the forward curve has widened the bid/ask spread in the A&D market and will likely lead to more failed sales than usual. We believe Crescent is well positioned to create significant shareholder value through this environment, given our differentiated investor mindset and broad operational capabilities covering both conventional and unconventional assets, which expands our list of actionable opportunities, ensuring we can find attractive risk-adjusted returns that complement our existing portfolio.\n\nAnd given the nature of our business today, our low decline rate and multiyear inventory of high returning locations allows us to be patient in evaluating new transactions while remaining well-positioned to capitalize on compelling opportunities as they arise from within the large volume of assets on the market today. On new acquisitions, we remain focused on generating attractive returns through the disciplined criteria that has underpinned our investment philosophy for over a decade. First and foremost, we emphasize M&A activity that generates returns in excess of two times our invested capital with sub five-year paybacks. Second, we look for strong downside support through a large producing base and financing that maintains balance sheet strength.\n\nAnd finally, we prioritize opportunities in basins with proven reserves, where we have an existing position or we see an ability to scale efficiently, allowing us the opportunity to benefit from both administrative and operational synergies. Throughout our continual portfolio construction over many years, we believe we have proven our ability to capture attractive assets, integrate them into our portfolio and apply our strong operating skills to find synergies and create value for shareholders. Our recent Uinta acquisition offers a prime example of the benefits of the Crescent platform. With our differentiated business model, including a unique combination of operating, financial, and investment expertise, we were well positioned to move quickly amid complex sales process dynamics and to capitalize on a large and compelling opportunity for our shareholders.\n\nWhile maintaining pro forma leverage of 1.3 times, we closed on the acquisition in March for total cash consideration of $690 million, a very attractive headline value for assets with $1 billion of proved developed PV-10 NYMEX pricing as of March 31st and substantial development upside. We executed three years of hedges on a portion of PDP volumes at closing, ensuring strong downside protection while maintaining significant commodity upside on the large base of unhedged reserves. The assets are a fantastic addition to our existing Rockies footprint, and with 65% oil and low operating costs, they significantly enhance our overall margins and inventory of high returning development locations. Since closing the Uinta acquisition on March 30th, we've made significant progress on integration.\n\nWe are actively engaged with all stakeholders on our current and future operating plans. Operationally, we plan to run one rig in the Uinta for the remainder of the year. The reduction in activity allows us to manage development timing while our midstream provider adds additional capacity to our in-field gathering system to support future volume growth from us and other operators who continue active development programs. Additionally, this allows us to validate both our spacing and completion design optimization relative to the previous operator, which we believe will create more shareholder value over time.\n\nLike all capital projects, especially in today's environment where real operational constraints exist, there are risks of delays which could negatively impact some of our planned development activity in the latter part of this year. Furthermore, as I noted earlier, we continued to see the same broader inflationary pressures and supply chain constraints as the rest of our industry, which remain a byproduct of the higher commodity price environment. While Brandi will review capital guidance in a little more detail, I want to emphasize our team has done an exceptional job of mitigating these headwinds and our capital guidance for the year remains unchanged. I will now turn to ESG, which is an integral part of everything we do and deeply ingrained in our long-term organizational outlook.\n\nWe plan to issue our 2021 ESG report later this year, which will include both short- and long-term ESG targets with a focus on EHS and emissions. As touched upon during our first quarter earnings call, in January of this year, we joined the Oil & Gas Methane Partnership 2.0 initiative, or OGMP 2.0. We believe reducing methane emissions is critical to slowing the impact of climate change, and the first step to methane reduction is high quality measurement data. The rigorous OGMP 2.0 framework will aid our efforts to create targeted programs to reduce emissions, accurately report our data and help us to be positioned as an industry leader in emissions reduction over time.\n\nOur inaugural implementation plan and annual report to the OGMP 2.0 was rated the highest level gold standard, which means we both adequately adhered to their methane emissions reporting standards as well as outlined a clear path for identifying and reducing methane emissions above and beyond current reporting requirements. We were pleased to see that additional U.S. operators such as Conoco Phillips, Devon, and Pioneer have joined the OGMP 2.0 as well, ensuring that we are in good company as we strive to identify and reduce emissions as an industry. We will continue to keep you updated on our progress in this area and look forward to discussing our sustainability report once formally published.\n\nIn short, our acquisition strategy, operational performance, and a supportive commodity backdrop have all contributed to the strong results posted this quarter, including our substantial free cash flow generation. With that, I'm happy to turn the call over to Brandi to cover our second quarter 2022 financial results and 2022 outlook. Brandi?\n\nBrandi Kendall -- Chief Financial Officer\n\nThank you, David. We are pleased with our results for the first half of this year as we are successfully integrating our accretive Uinta acquisition while maintaining our rigorous commitment to cash flow priorities 1A and 1B, shareholder returns, and the balance sheet. Alongside earnings, we announced a quarterly dividend payment of $0.17 per share consistent with the second quarter. We intend to pay $0.17 per share quarterly for the remainder of the year, generating an attractive 5% yield based on recent trading prices.\n\nOn the balance sheet, we exited the quarter with LTM leverage at 1.2 times and over $500 million in liquidity. As we continue to generate significant free cash flow through the remainder of the year, we expect to reduce leverage to our target level of 1.0 times EBITDA, absent any potential acquisitions. For the second quarter of 2022, our first full quarter following the Uinta acquisition, we produced over 140,000 net barrels of oil equivalent per day in line with our previous guidance. Additionally, we generated $373 million of adjusted EBITDAX and $137 million of levered free cash flow, which represents a 92% and 53% quarter-over-quarter increase, respectively.\n\nOur strong second quarter results underscore the relative strength of the business and quick integration of the Uinta assets within our broader portfolio. Operating expenses, excluding production and other taxes for the quarter, were $14.68 per BOE, an 8% decrease quarter over quarter. The improvement is credited to the addition of high margin Uinta volumes, partially offset by higher commodity link costs. For the remainder of the year, we continue to expect operating costs to trend lower on a dollar per BOE basis, which we anticipate will result in full year opex per BOE around the high end of our previous guidance range.\n\nThe addition of the Uinta assets has also modestly increased our differentials, given its production prices as a percentage of WTI, which has been more than offset by the higher oil weighting of our portfolio, increasing our total realizations. Adjusted recurring cash G&A totaled $1.40 per BOE, which was in line with previous expectations and represents an 18% quarter-over-quarter decrease. This decrease was primarily driven by synergies associated with the Uinta Basin acquisition, which added significant scale to the broader business while contributing minimal incremental G&A. Note, this calculation excludes certain non-recurring expenses that we incurred associated with the Contango merger, the Uinta acquisition, and the formation of Crescent Energy as a public company.\n\nAnd we expect an incremental $10 million of onetime expenses for the remainder of 2022, including post-merger integration and other transaction-related costs. Moving on to capital spend, we invested 193 million in the second quarter, drilling 16 gross-operated locations in the Uinta and nine in the Eagle Ford. Additionally, we brought online for gross wells in the Uinta and nine in the Eagle Ford. Our wells brought online during the quarter are posting strong early results.\n\nWe expect them to pay back in less than 12 months and generate more than two times our capital invested at current commodity prices. Today, we are continuing to operate one rig in Eagle Ford and two rigs in the Uinta. As David mentioned, we plan to shift to one rig in the Uinta Basin in this upcoming quarter as we implement and monitor our optimized spacing and completion design and manage volumes ahead of our third-party gas gatherers planned expansion. Our 2022 capital guidance is unchanged at $600 million to $700 million, with more than 80% allocated to the operating development in the Eagle Ford and Uinta Basin.\n\nLike our peers, we are seeing inflationary pressures and potential for a logistical and other process delays across the business, and we continue to find new ways to mitigate some of these pressures. Based on what we know today, we believe our capital range continues to accurately account for expected inflation as our February guidance incorporated a 10% to 15% increase in capital costs year over year. Given we are seeing additional pressure of around 10% for the remainder of the year, we anticipate our total capital spending trend toward the mid to high end of our expectations but still within the targets we outlined in guidance. Moving to our capital markets activities, we continue to engage with the market to expand our followership, improve our float and increase equity research coverage.\n\nAs we touched on last quarter, we recognize that the current market positioning and awareness of Crescent is not yet at a level consistent with peers of similar size. And more nuanced aspects of the business, such as impact hedges have on near-term cash flows are not fully appreciated and reflected in our current valuation. Market visibility and education is a key piece of our strategic plan for 2022 and beyond. And we are committed to an active approach to building awareness of our story and accessibility to invest in the stock through increased liquidity over time.\n\nBut that being said, we continue to monitor and balance our intentions to increase market presence with the state of the broader equity markets, which, as you all know, have undergone a period of extended volatility over the first half of the year. Given our initiative to increase market exposure, we do not intend to pursue a share buyback program like many of our public company peers, which we believe would run counter to the creation of long-term value that increased float and market presence would provide. Additionally, we believe the relative shareholder returns of our ongoing development program alongside preserving balance sheet strength and maintaining ongoing quarterly dividends is a more attractive use of excess cash flow. In summary, Crescent continues to perform in line with our expectations and remains well positioned to create shareholder value in today's market.\n\nWe are focused on generating cash flow, making disciplined investments, maintaining our strong balance sheet and returning cash to investors. With that, I will turn the call back to David.\n\nDavid Rockecharlie -- Chief Executive Officer\n\nThanks, Brandi. Before moving on to the Q&A, let me quickly summarize today's key highlights. We are very pleased with our second quarter performance. Crescent's differentiated business model is working and Crescent benefits from a number of key and important characteristics.\n\nNumber one, we're big. We've made seven accretive acquisitions in the last 18 months and grown adjusted EBITDA to $1.5 billion on a hedged basis and $2.6 billion on an unhedged basis on an annualized basis for Q2. We continue to deliver strong free cash flow, which supports our high quality balance sheet and dividends. Number two, we have a low decline PDP asset base at 22% with a proved developed PV-10 value of $7 billion as of 6/30.\n\nNumber three, we have a proven high quality multi-year development inventory. Number four, we have excellent alignment with supportive and proven investors as long-term insiders. Number five, we believe our stock will gain momentum in the market as our legacy acquisition hedges roll off, and we continue to increase market awareness, trading liquidity, and float in our shares over time. And finally, number six, we continue to believe Crescent presents a compelling long-term value proposition for shareholders.\n\nThanks again for joining us today and as always, for your interest in our company. We will now be happy to take your questions.\n\nOperator\n\n[Operator instructions] Our first question is from Neal Dingmann with Truist Securities. Please proceed.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nMorning, all. Thanks for the time. My first question, David, probably a strategy question for you and pretty broad, obviously, kind of the topic. And specifically, I wanted to get a sense of now that you guys are making obviously great some great progress, how you're thinking about future shareholder returns, really decide -- I think it's fair to say you're certainly going to maintain the base dividend, which is great to see, but I just want to see sort of beyond that.\n\nI wanted to get a sense of how you're thinking about allocating the remaining free cash flow. Do you think these days is it best to -- you mentioned that doing buybacks. I do that, but not paying more back to investors either through variable or whatever reason, or would you think about more organic growth or would you build dry powder for further deals that you've been very successful with?\n\nDavid Rockecharlie -- Chief Executive Officer\n\nYeah. Great. Thanks for the question. Happy to take that.\n\nThe most important thing is as we consider that question, is just ultimately we're stewards of capital. So we can be patient. We don't have to do anything other than produce the assets we have efficiently. And to your question, I think the first things we think about are the investors.\n\nAnd so that's the balance sheet and the current dividend strategy we have. What I would say that's differentiated about us and we think presents a really compelling opportunity is the rest of the industry faces higher decline rates, faces a lot of pressure to return on capital given what's happened in the public markets over the last decade. And in some senses, we see other companies really liquidating the assets they have. And so at a time when equity capital in particular is scarce in the sector, we do think our acquisition strategy, which has been proven over many years, should deliver us really compelling opportunity to continue to grow the company.\n\nSo I would say again, just to repeat that, number one, we're focused on the balance sheet and the existing dividend. We're just patient with the excess capital we have. And in an ideal world, we'll find really attractive acquisitions while others are focused on a different strategy than we are. All that said, though, we are, number one, as I said, focused on investor returns.\n\nAnd so as this market evolves, we'll be happy to consider what I would call more traditional uses of the other free cash flow we're generating.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGot it. OK. And then just second question maybe for Brandi or for you, David, just kind of intertwines what you were just talking about, given the improved finances. Also your hedges, I noticed you haven't put too much on lately, but again wondering more on the hedging strategy.\n\nIs it still I understand if you buy something, you're probably still hedges with more on existing on a go forward, would you continue with the same sort of hedging level at all?\n\nBrandi Kendall -- Chief Financial Officer\n\nNeal, it's Brandi. So no change in our position quarter over quarter. The last time we executed hedges was really in relation to signing the PSA for the Uinta transaction. We feel really good about where the balance sheet is today, so we would expect new hedges to come in the context of an acquisition.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGot it. Got it. And then if I can squeeze one last in. Just in Uinta, it sounds like things going Tier 1 rig, it sounds like now post-deal, all this energy, everything kind of -- maybe, David, can you talk about anything there that was unexpected or -- really, it sounds to me like things are going very much as expected, but I don't know if anything stood out to you on that?\n\nDavid Rockecharlie -- Chief Executive Officer\n\nYeah. I'll let Ben Conner take that one.\n\nBen Conner -- Executive Vice President\n\nHey, Neal. Yeah, look, I think the overall message is that we've been pretty pleased with the overall transition and the integration of the assets. So obviously when you take over things, there's certain things that you learn along the way, but nothing notably surprising and everything kind of really in terms of overall our investment thesis is really playing out as expected. It's early days, but I think where we're most excited about is how quickly we were able to implement some of the operational changes, particularly around the development of the asset.\n\nAnd so the results are early, but they're encouraging and so we'll be excited to talk about that in future quarters. But all in all, nothing, nothing surprising and things are going pretty well.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGreat to hear. Thank you, all.\n\nOperator\n\nOur next question is from Tarek Hamid with J.P. Morgan. Please proceed.\n\nTarek Hamid -- JPMorgan Chase and Company -- Analyst\n\nGood morning.\n\nBrandi Kendall -- Chief Financial Officer\n\nHey, Tarek.\n\nDavid Rockecharlie -- Chief Executive Officer\n\nGood morning.\n\nTarek Hamid -- JPMorgan Chase and Company -- Analyst\n\nJust want to ask around the acquisition environment. We've also seen a number of trades in the last couple of weeks one reasonably large one in the Eagle Ford. So just wanted to get a sense of sort of what are you guys seeing? And do you think we sort of hit a price point on strip where sort of transactions are a little bit more viable than they were maybe a few months ago?\n\nClay Rynd -- Executive Vice President\n\nYeah. Hey, it's Clay. I'm happy to take this one. I think David did a good job of kind of laying out our thoughts in the opening comments.\n\nBut it certainly -- I think the volatility has made it tough to get things done. You obviously referenced the deal that got done. I assume you talked about the one in Eagle Ford that happened. We've certainly seen some of the more strategic deals get done that public operator's done a couple.\n\nBut I'd say the market's pointing out as we expected, right. We're seeing a ton of asset supply. There hasn't been as much capital formation relative to that asset supply and volatility is creating some more uncertainty around transactions. So I don't think we view that kind of individual deal or a couple as a signal to a broader market.\n\nWe expect things to start getting done as we head into the fourth quarter as we kind of have some stability here. But this is the market kind of we expect it and do think it plays well to our strengths.\n\nTarek Hamid -- JPMorgan Chase and Company -- Analyst\n\nGot it. And then you touched on this. I think everybody in the industry has touched on just the broader inflation narrative. Any sort of particular items that are worth highlighting in terms of where you think there's a little bit more risk on the cost side?\n\nBen Conner -- Executive Vice President\n\nYeah. I mean, look, I think it's been a pretty dynamic market and I think a lot of places where I've seen it and you've heard it is around steel pricing, diesel, obviously just given where oil and gas prices have been. Sand has been a particular notable item. And then just with the tight service market, you're just kind of seeing steady creep as you think of rig rates, which are a smaller part of the capital costs as well as just the availability of a completion crew.\n\nSo it's really kind of been steady. In certain places, you've seen higher growth. But I think what we're starting to see, particularly with the pullback in oil and again, it's too early to call it, is just some stability starting to shake up in kind of the day to day commentary. But it's really been across the board, but it's really kind of steel, diesel pricing, and sand is where I say we've seen the most notable price increases.\n\nDavid Rockecharlie -- Chief Executive Officer\n\nTarek, this is David. Just one other thought on that, which is in terms of things evolving the way we expected, we really -- we built our portfolio over the last seven- or eight-year downturn to be heavily production weighted and lower decline. And anticipating inflationary environment like this with increasing commodity price environment, we do from production perspective just have less exposure on the opex side to inflation than the typical D and C side that a lot of the industry faces. So we feel really good about the overall portfolio positioning despite the -- just general industry trends which, obviously, we expect to continue.\n\nTarek Hamid -- JPMorgan Chase and Company -- Analyst\n\nIt's a great color, David. Thank you. I'll hop back in the queue.\n\nDavid Rockecharlie -- Chief Executive Officer\n\nGreat. Thanks.\n\nOperator\n\nWe have reached the end of our question-and-answer session. I would like to turn the call back over to management for closing comments.\n\nDavid Rockecharlie -- Chief Executive Officer\n\nGreat. Well, thank you all again for joining us. And for all the support and attention you've given the company. We are, as you hopefully heard today, hard at work, continuing to try to deliver exceptional results.\n\nAnd we look forward to staying in touch and we'll talk to you next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrandi Kendall -- Chief Financial Officer\n\nDavid Rockecharlie -- Chief Executive Officer\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nBen Conner -- Executive Vice President\n\nTarek Hamid -- JPMorgan Chase and Company -- Analyst\n\nClay Rynd -- Executive Vice President\n\nMore CRGY analysis\n\nAll earnings call transcripts"
}