{
  "companyName": "Geron",
  "companyTicker": "GERN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/geron-gern-q3-2022-earnings-call-transcript/",
  "content": "Geron (GERN 15.24%)\nQ3 2022 Earnings Call\nNov 03, 2022, 9:00 a.m. ET\n\nAron Feingold\n\nGood morning, everyone. Welcome to the Geron Corporation third quarter 2022 conference call. I am Aron Feingold, Geron's vice president of investor relations and corporate communications. I'm joined today by the following members of Geron's management team: Dr.\n\nJohn Scarlett, chairman and chief executive officer; Olivia Bloom, executive vice president of finance and chief financial officer and treasurer; Dr. Faye Feller, executive vice president and chief medical officer; and Anil Kapur, executive vice president of corporate strategy and chief commercial officer. Before we begin, please note that during the course of this presentation and question-and-answer session, we will be making forward-looking statements regarding future events, performance, plans, expectations, and other projections, including those related to the therapeutic potential and potential regulatory approval of imetelstat, anticipated clinical and commercial events and related timelines, the sufficiency of Geron's financial resources and other statements that are not historical fact. Actual events or results could differ materially.\n\nTherefore, I refer you to the discussion under the heading Risk Factors in Geron's quarterly report on Form 10-Q for the quarter ended June 30, 2022, which identifies important factors that could cause actual results to differ materially from those contained in the forward-looking statements. Geron undertakes no duty or obligation to update our forward-looking statements. And now I will turn the call over to CEO, Dr. Scarlett.\n\nChip?\n\nChip Scarlett -- Chairman and Chief Executive Officer\n\nThanks, Aron. Good morning, everyone. Thanks for joining us today. Throughout the year, we've highlighted our vision for Geron, which is to become a leader in the treatment of hematologic malignancies.\n\nThe strategic pathway to achieving this goal is defined by our expected journey to develop and commercialize imetelstat. Based on the imetelstat Phase 2 data and lower-risk MDS and in relapsed and refractory myelofibrosis, we believe imetelstat has a highly differentiated, compelling clinical profile. First, as a telomerase inhibitor, imetelstat has a unique mechanism of action that strikes at the very heart of these malignancies by targeting the malignant stem and progenitor cells that drive both lower-risk MDS and JAKi relapsed and refractory MF. Second, the Phase 2 data also provided strong evidence for disease modification.\n\nAt a molecular level, in both Phase 2 studies, we reported depletion of mutated and cytogenetically abnormal malignant cells that have been correlated with the direct clinical benefits of imetelstat, providing additional evidence of disease modification. Imetelstat's potential for disease modification, not only differentiates it from other currently available therapies but also directly addresses critical unmet needs in lower-risk MDS and relapsed/refractory MF, which we expect will provide a needed treatment option for patients with these diseases. Third, in both lower-risk MDS and relapsed/refractory MF patients treated with imetelstat, we saw unprecedented durability of clinical effects. For instance, Faye will describe an ASH abstract published today in which we reported the approximately one-third of the 38 patients in our Phase 2 lower-risk MDS study, who despite a medium pretreatment transfusion burden of six RBC units for eight weeks, experienced one year or more of transfusion independence.\n\nSimilarly, in our Phase 2 relapsed/refractory MF study, median overall survival for patients improved to almost twice as long as it has been reported in medical literature. Based on these attributes of imetelstat and compelling Phase 2 data, we expect potentially highly differentiated clinical profiles from the results of our ongoing imetelstat Phase 3 trials in these indications. We are, therefore, very excited by the lineup of expected milestones coming soon and over the next two years. We expect disclosure of top-line results or TLR, from our IMerge Phase 3 trial in lower-risk MDS in only two months from now in early January of 2023.\n\nIf TLR is positive, we expect great value will be unlocked for both patients and for shareholders. Assuming positive TLR, the next expected key Geron milestones are regulatory submissions for imetelstat in lower-risk MDS. As of today, we expect submission of the NDA during the first half of 2023 and of the EU MAA during the second half of 2023. As Faye will discuss in a few minutes, we've been actively preparing for many months for both disclosure of TLR in early January 2023, as well as for these key regulatory submissions later in the year.\n\nSimilarly, we've also been preparing for potential commercialization of imetelstat and have recently made key hires across the team in order to begin building the foundation for a successful commercial launch for lower-risk MDS. Finally, becoming a leader in the treatment of hematologic malignancies requires breadth of effect. Thus, the next significant step is to bring imetelstat to patients who suffer from JAKi relapsed refractory myelofibrosis. To achieve this, we're working toward having an interim analysis from our IMPACT MF Phase 3 trial in patients with this indication in 2024 and then the final analysis in 2025.\n\nThis study is the first and only Phase 2 myelofibrosis trial with overall survival as the primary endpoint and thus represents great potential value for patients, as well as for our shareholders. Achieving these milestones requires the motivation and expertise of each Geron team member. Their continued dedication and commitment inspire me every day. With that, I'll turn the call over to our chief medical officer, Dr.\n\nFaye Feller, for a clinical update. Faye?\n\nFaye Feller -- Executive Vice President and Chief Medical Officer\n\nThank you, Chip, and good morning to everyone on the call. We at Geron are incredibly excited that the top-line results of the IMerge Phase 3 study in lower-risk MDS are just two months away. The clinical team has been actively preparing for the readout in accordance with industry best practices. The clinical cutoff for the top-line results occurred last month, which per protocol is one year following the first dosing of the last patient randomized in the study.\n\nWe have been continuing database cleaning activities and monitoring visits with our clinical sites in preparation for database lock, which is expected to occur before the end of the year. In early January 2023, we expect to deliver the Phase 3 IMerge top-line results, which will comprise a robust package of data that we believe will highlight the differentiating qualities of imetelstat. We anticipate sharing data on the primary endpoint of 8-week transfusion independence or TI, as well as key secondary endpoints of 24-week TI and hematologic improvement erythroid or HIE, which is a composite measure of the percentage of patients who experienced an increase in hemoglobin and/or a reduction in their transfusion burden. We also plan to provide safety data in order to give a balanced benefit-risk profile of imetelstat in lower-risk MDS.\n\nAs is typical for a Phase 3 trial, top-line results represent only a portion of the full clinical study readout, and we anticipate to present more comprehensive results at a future medical meeting. We expect the later additional data will include information on molecular indicators of disease modification, such as mutational burden reductions and an effect on cytogenetic abnormality. The Phase 3 IMerge trial design matches many of the elements of the Phase 2, including clinical site locations and investigators, patient population and enrollment eligibility criteria, imetelstat dose and schedule, primary and secondary endpoints, and other protocol-specified guidelines. Given such similarities, we believe the Phase 2 results will help inform us on the Phase 3.\n\nAs Chip alluded to in his comments this morning, on Sunday, December 11, longer-term follow-up data from the IMerge Phase 2 study will be presented in an oral presentation at ASH this year. The abstract for this upcoming presentation published this morning is summarized on Slide 9 of our Q3 earnings call deck and is currently displayed on the webcast for those watching. The abstract describes the 29% of patients in the IMerge Phase 2 study who achieved sustained transfusion independence for greater than one year in the setting of a median pretreatment transfusion burden of six units of red blood cells over eight weeks. We believe this to be an unprecedented durability effect in patients with lower-risk MDS post-ESA treatment.\n\nThese 11 transfusion-dependent patients were treated with imetelstat for a median of approximately 2.4 years, and their median duration of TI was 1.8 years. After a median follow-up of 4.3 years, median progression-free survival was 2.9 years and median overall survival was 4.8 years. None of these patients progressed to AML. Mutation data was available for the majority of the patients who achieved greater than one-year sustained TI and 89% had any reduction in SF3B1 variant allele frequency or VAF, while 56% achieved greater than or equal to 50% VAF reduction.\n\nReduction in VAF correlated with longer TI duration and shorter time to onset of TI. We believe these data, along with the long-term sustained TI indicates strong evidence of disease modification. Safety findings for these patients were consistent with the overall population and the most frequent adverse events were reversible thrombocytopenia and neutropenia. The abstract concludes that the greater-than-one-year period of transfusion independence observed in these patients represents relief from iron overload and other transfusion-associated complications and a decreased demand on healthcare resources.\n\nFurthermore, durable TI, meaningful reduction in mutation burden, and good survival post ESA suggest imetelstat may have disease-modifying activity. These recent data, as well as the prior publications of IMerge Phase 2 data, reinforce what we believe are key attributes of imetelstat in lower-risk MDS. First, we observed durability of continuous transfusion independence, which we consider differentiating from any treatment currently on the market or being investigated today. Second, broad efficacy was observed across patient subtypes, including RS-positive, RS-negative, high, and very high transfusion burden patients.\n\nThird, there was strong evidence of disease modification, as described previously by Chip, that, due to imetelstat's unique mechanism of action, aims at the very nature of the disease mechanistically and that has not been previously observed with other treatments for this patient population. Moving on to myelofibrosis. There are two posters being presented at ASH this year for our current MF trials in progress. As many of you know, abstracts for this category describe innovative ongoing clinical trials that have not yet reached their primary endpoints.\n\nThe first trial-in-progress abstract describes our pivotal Phase 3 IMpactMF study, which is designed to enroll approximately 320 patients with relapsed/refractory in myelofibrosis. IMpactMF is the first and only Phase 3 MF trial with overall survival as primary endpoint. Approximately 85% of clinical trial sites are open to date, and we remain on track to open all selected clinical sites by the end of this year. Under current planning assumptions, we continue to project the interim analysis for IMpactMF will occur in late 2024.\n\nOf course, because these analyses are event-driven and it is uncertain whether actual rates for enrollment and rates for events will reflect current planning assumptions, the results of the interim analysis may be available at a different time than currently expected. The second trial-in-progress abstract accepted at ASH describes IMproveMF, which is our Phase 1 study designed to evaluate the safety and clinical activity of imetelstat in combination with ruxolitinib in patients with frontline MF. This study design was informed by preclinical data that showed that sequential treatment with ruxolitinib followed by imetelstat had a selective inhibitory effect on malignant MF stem cells while sparing normal hematopoietic stem cells. In this clinical study, we expect to determine the safety profile of combination therapy and explore any potential for disease-modifying activity in a frontline MF disease setting, similar to what was observed with imetelstat treatment in the Phase 2 IMbark trial in a relapsed/refractory MF patient population.\n\nTwo of the three trial sites for the study are open for patient enrollment. We expect to present preliminary data from the study by the end of 2023. As part of our imetelstat pipeline expansion, we are also exploring use of the drug in other indications and combination regimens. At ASH this year, additional nonclinical data related to acute myeloid leukemia, or AML will be presented.\n\nThe abstract for the upcoming oral presentation describes the results from nonclinical in vitro and in vivo experiments with imetelstat using AML cell lines and AML patient samples. Conducted by our collaborators in Australia, Germany, and the U.S., the experiments found that imetelstat promotes the formation of polyunsaturated fatty acid-containing phospholipids, which cause excessive levels of lipid peroxidation and oxidative stress in AML cells, potentially leading to programmed cell death. The abstract concludes that this mechanistic insight could be leveraged to develop an optimized therapeutic strategy using oxidative stress-inducing chemotherapy to sensitize patients to imetelstat and potentially cause significant delay of relapse in AML. Based on these and other nonclinical data in AML, as well as the clinical data we have in lower-risk MDS, we are supporting an investigator-led study called IMpress in relapsed/refractory AML and higher-risk MDS.\n\nIn that study, imetelstat is being evaluated as a single agent. We continue to expect the first site to be open for the study by the end of this year. Meanwhile, we have another investigator-led study in relapsed/refractory AML named TELOMERE. In this study, we plan to evaluate imetelstat in combination with a hypomethylating agent and in combination with venetoclax.\n\nThis study has been deferred until we have data from the IMpress single-agent study in relapsed/refractory AML. We expect data from IMpress to help inform the dose and schedule to be used in the two combination dosing regimens that will be evaluated in TELOMERE. The principal investigators for both studies continue to be highly enthusiastic as relapsed refractory AML remains an extraordinarily difficult malignancy to treat. They believe a new mechanism of action from a drug like imetelstat that directly affects the malignant stem and progenitor cells that drive disease progression could provide an effective treatment option for patients suffering from relapsed/refractory AML.\n\nAlso, in keeping with our pipeline expansion activities, new nonclinical data with imetelstat in lymphoid malignancies will be published online in Blood. The abstract describes the characterization of telomerase activity and telomere length and results from in vitro experiments of imetelstat on a panel of diffuse large B-cell lymphoma, or DLBCL, and peripheral T-cell lymphoma, or PTCL, cell lines. Conducted by our collaborators at MD Anderson Cancer Center, these in-vitro experiments demonstrated that imetelstat reduced cell viability and increased apoptosis in DLBCL cell lines. In contrast, imetelstat single agent activity on cell viability was limited in PTCL cell lines even though a time and dose-dependent reduction of telomerase activity was noted.\n\nThe greater inhibitory effect of the imetelstat and DLBCL compared to PTCL may be attributed to the observation of higher telomerase activity in DLBCL, compared to PTCL cell lines. Furthermore, the PTCL cell lines had an approximately 7.3-fold longer telomere length than the DLBCL cell lines, which potentially also influenced the lower response to imetelstat. We expect further experiments to be conducted to explore these insights and to assess the potential therapeutic effect of imetelstat in lymphoid malignancies. Finally, I am pleased to report that we are making progress in our next-generation telomerase inhibitor program, from which we anticipate generating lead compounds for further characterization and evaluation.\n\nWe anticipate completion of the current discovery effort in 2023, upon which we plan to potentially advance any lead compounds into the next step of discovery research. If successful, these efforts would permit initiation of IND-enabling nonclinical studies. Overall, I am delighted with the progress of the research and development team, both with regards to advancing critical activities for our lead indications in lower-risk MDS and relapsed/refractory myelofibrosis, as well as our pipeline expansion programs, which aim to understand the broader potential of imetelstat. With that, I will turn the call over to Olivia for a financial update.\n\nOlivia?\n\nOlivia Bloom -- Executive Vice President, Finance, Chief Financial Officer, and Treasurer\n\nThanks, Faye, and thanks to everyone on the call for joining us today. Please refer to the press release we issued this morning, which is available on our website for detailed financial results. As of September 30, 2022, we had approximately $195 million in cash and marketable securities. This includes approximately $4 million in proceeds from warrant exercises that we received this quarter.\n\nOverall, operating expenses were higher for the three and nine months ended September 30, 2022, compared to the prior period, which reflects increased activity across the company, as well as accounting for the recent settlement agreement related to the class action lawsuit. On the R&D side, the increase in expenses for the three- and nine-month periods of 2022 compared to the same period in 2021, primarily reflects the net result of increased personnel-related expenses for additional headcount and higher consulting costs related to preparation for top-line results and regulatory submissions and lower-risk MDS, which were partially offset by decreased manufacturing costs due to the timing of imetelstat manufacturing batches. On the G&A side, the increase in expenses for the three- and nine-month periods of 2022 compared to the same period in 2021, primarily reflects increased costs for commercial preparatory activity, higher personnel-related expenses for additional headcount and an accrual of approximately $7 million for our portion of the settlement for the class action lawsuit, which we expect will be paid in either shares of general common stock and/or cash at our election after final approval of the settlement by the court by the end of the first quarter of 2023. We continue to expect non-GAAP total operating expenses of up to $150 million for the full year of 2022.\n\nUnder current planning assumptions, we expect to have approximately $140 million in cash and marketable securities at the time of the lower-risk MDS top-line results in early 2023. We also expect to have up to $171 million in additional funding available to us in 2023, which is comprised of approximately $121 million from potential exercises of currently outstanding warrants and an additional $50 million from potential debt drawdown under our current loan agreement upon the achievement of certain milestones and capital requirements. Under current planning assumptions, we project our existing capital resources plus the projected future proceeds that I just outlined will be sufficient to fund our estimated levels of operations, which includes stage-gated activity for potential U.S. commercial launch of imetelstat in lower-risk MDS until the middle of 2024.\n\nWith that, I will now turn the call over to Chip for closing remarks.\n\nChip Scarlett -- Chairman and Chief Executive Officer\n\nThanks, Olivia. As I indicated at the start of this call, we're on a journey toward becoming a leader in the treatment of hematologic malignancies. On this journey, we expect to achieve very meaningful milestones, which we believe will not only move the company from clinical development toward commercialization but also potentially change the treatment landscape for lower-risk MDS and relapsed/refractory MF. Thank you all for your interest in the company and support for our continuing activities.\n\nWe'll be glad to take your questions.\n\nOperator\n\n[Operator instructions] And your first question comes from Kalpit Patel from B. Riley. Please go ahead.\n\nKalpit Patel -- B. Riley Securities -- Analyst\n\nThanks for taking the question. So, there was a positive announcement earlier this week from Bristol Myers Squibb regarding the COMMAND study, testing luspatercept in the frontline setting for MDS. I guess, what implications, if any, does this have on your potential path for imetelstat? I think your trial is enrolling patients who have received luspatercept before. So, curious if you see or foresee any shift in how imetelstat may be used in the real world, assuming the Phase 3 is positive? And then does it change anything from a regulatory perspective as well? Thank you.\n\nAnil Kapur -- Executive Vice President of Corporate Strategy and Chief Commercial Officer\n\nThe imetelstat IMerge Phase 3 trial does include patients who are previously treated with luspatercept. We expect imetelstat to become part of the standard of care in low-risk MDS and to be broadly adopted for the treatment of these patients with very high unmet medical need. I would also like to remind all of us that we had multiple other patient subtypes that were eligible for this trial irrespective of their ring sideroblast status. This included heavily transfusion-burdened ESA relapsed and refractory patients and also frontline ESA ineligible patients given their high baseline serum levels.\n\nAs Chip and Faye said in their prepared remarks, we expect imetelstat to be highly differentiated given our distinct mechanism of action that targets and kills the malignant stem and progenitor cells and allows for the ability to modify the disease and achieve continuous and highly durable transfusion independence rates. This data, which is reported in today's ASH abstracts, directly addresses significant unmet medical need in low-risk MDS, and we expect it to be very favorably received by the physician community. I also want to remind everyone that from a commercial perspective, the market imetelstat is addressing is highly attractive and approximately three times larger than the patient group indicated under the current luspatercept label, which is limited to RS-positive patients. We expect broad adoption and remain confident that what imetelstat is addressing is truly disease-modifying, and we expect broader options.\n\nSo, I'll just stop here.\n\nKalpit Patel -- B. Riley Securities -- Analyst\n\nOK. And one question on the IMerge readout that's coming up in January. What level of detail should we expect on some of the secondary endpoints, maybe the 1-year TI rate and some of the other endpoints there?\n\nChip Scarlett -- Chairman and Chief Executive Officer\n\nI think you should expect the secondary endpoints would include, of course, the 24-week TI. And obviously, all of the safety data, as well as the primary endpoint. Faye, any other comments?\n\nFaye Feller -- Executive Vice President and Chief Medical Officer\n\nI would HIE as well.\n\nKalpit Patel -- B. Riley Securities -- Analyst\n\nOK. So, we shouldn't see any one-year TI rates there in the Phase 3 window?\n\nChip Scarlett -- Chairman and Chief Executive Officer\n\nNot sure.\n\nKalpit Patel -- B. Riley Securities -- Analyst\n\nOK. All right. Thanks for taking the questions.\n\nOperator\n\nYour next question comes from Steve Willey from Stifel. Please go ahead.\n\nSteve Willey -- Stifel Financial Corp. -- Analyst\n\nYeah. Good morning. Thanks for taking the question. I guess maybe just following up on the top-line disclosure in January.\n\nI was just curious if we should expect to see any specific efficacy data within certain subgroups of interest. And I guess those subgroups would be those patients who have a very high transfusion burden at baseline and maybe have serum EPO levels of greater than 500. Is that something that you think will be saved for a future presentation? Or is that something that we could see in the top-line press release just kind of given the importance of that from a competitive differentiation perspective?\n\nFaye Feller -- Executive Vice President and Chief Medical Officer\n\nThanks for your question. I'll take that. Yes, we will have subgroup analysis at the time of TLR. We will provide additional data, of course, at a major medical meeting subsequently.\n\nSteve Willey -- Stifel Financial Corp. -- Analyst\n\nOK. That's good to know. And then maybe just a question on IMproveMF. I guess when you look across the competitive landscape, it kind of seems like there's an effort to combine various agents with rux that actually address some of the anemia that is caused by rux.\n\nAnd just curious, just given, I think, in the Phase 2 IMbark study, there was a bit of an anemia signal from imetelstat. How do you just think about the notion of potentially exacerbating the toxicity that is across the competitive landscape trying to be improved right now?\n\nChip Scarlett -- Chairman and Chief Executive Officer\n\nFaye, do you want to comment about that study?\n\nFaye Feller -- Executive Vice President and Chief Medical Officer\n\nSure. The IMproveMF study is, as you say, our combination study in frontline patients with ruxolitinib and imetelstat. And the primary objective of that study will be to assess the safety profile of the combination therapy, including any potential cytotoxicities and cytopenias. That's the main objective.\n\nChip Scarlett -- Chairman and Chief Executive Officer\n\nWe're not 100% sure what we're going to see, and that's why it's really a safety study as opposed to primarily an efficacy study. We'll obviously look for efficacy signals. And of course, the paradox here is that we know that we have in the Phase 2 data, certainly, very strong anemia responses, positive anemia responses. And so, I think we'll just have to see how it works out.\n\nBut I think we'd be -- the real focus of this is indeed getting a safety look.\n\nSteve Willey -- Stifel Financial Corp. -- Analyst\n\nOK. And then just lastly, I guess on IMpactMF. Congrats on getting a lot of the sites opened. How should we think about the manner in which you're going to be communicating enrollment milestones? Or is that something that you will not be providing? And I guess I'm just thinking about whether or not we hear as to half of the patients have been enrolled or just various milestones like that.\n\nChip Scarlett -- Chairman and Chief Executive Officer\n\nHistorically, Steve, we've communicated when we hit 50% enrollment. We'll probably do that with this study as well. Of course, I'd want to remind everybody that because this is an overall survival study, and it's really event-driven, the specifics of the enrollment kinetics, while they're certainly linked to that, you can't have events unless people are enrolled. At the same time, they're not -- we're not on a hard schedule of events where enrollment completely dictates when results come.\n\nSo, we still currently expect the interim analysis in 2024.\n\nSteve Willey -- Stifel Financial Corp. -- Analyst\n\nOK. That's helpful. Thanks for taking the questions.\n\nChip Scarlett -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from Gil Blum from Needham and Company. Please go ahead.\n\nGil Blum -- Needham and Company -- Analyst\n\nHi, everyone, and good morning, and thanks for taking our questions as well. So, maybe a quick one on the oral presentation, the long-term follow-up of IMerge. It kind of struck me that some of the details you provided there looked a lot like what you saw in MF regarding the reduction of specific clones. So, maybe a longer-term thought.\n\nIs there any reason to consider maybe an overall survival outcome study in MDS at some point? Thank you.\n\nChip Scarlett -- Chairman and Chief Executive Officer\n\nSorry, just to make sure we understood the question. We were having a little bit of trouble hearing you. Could you just -- so overall survival, obviously, I think you were trying to relate the question about overall survival in long-term follow-up of MDS. Did I get that right?\n\nGil Blum -- Needham and Company -- Analyst\n\nYeah, that's correct, because the results looked a lot like what you saw in myelofibrosis on a molecular level.\n\nChip Scarlett -- Chairman and Chief Executive Officer\n\nFaye, do you want to comment on that?\n\nFaye Feller -- Executive Vice President and Chief Medical Officer\n\nSure. Thanks for confirming. So, overall survival, in addition to progression-free survival are both secondary endpoints on the myelodysplastic syndrome study, IMerge. So, we will be looking closely at that.\n\nGil Blum -- Needham and Company -- Analyst\n\nOK. Excellent. And as for the combination studies in AML. Preliminarily, you're going to first look at the single agent activity and then add combinations on top of it.\n\nBut how do you see that kind of the evolving landscape?\n\nFaye Feller -- Executive Vice President and Chief Medical Officer\n\nInitially, the goal of the combination studies -- and AML is evolving into and has been actually always treated with combination therapy and multiple approaches, especially in the frontline setting. As we investigate the safety of the combination therapy in the TELOMERE study combining with either venetoclax or azacitidine, we'll, in addition to the safety, of course, be looking for any preliminary signal of efficacy. And there's a clear need for a novel mechanism of action that works differently than the currently available therapies in AML and especially in relapsed/refractory AML.\n\nGil Blum -- Needham and Company -- Analyst\n\nAll right. Thank you for the clarifications, and thanks for taking our questions.\n\nOperator\n\nYour next question comes from Joel Beatty from Baird. Please go ahead.\n\nJoel Beatty -- Baird -- Analyst\n\nGood morning. Thanks for taking the questions. The first one is on the Phase 3 MDS trial. Could you -- IMerge.\n\nCould you discuss the DSMB reviews that have taken place throughout the study and recently? And anything learned about safety there?\n\nFaye Feller -- Executive Vice President and Chief Medical Officer\n\nWe have an independent data monitoring committee in place for the study who reviewed the unblinded safety data. And to date, they have continued to recommend the study proceed as indicated. They meet on a regular basis.\n\nJoel Beatty -- Baird -- Analyst\n\nTerrific. Thank you. A question on the COMMAND study. Whenever we get more data on that from BMS, could you discuss what data points you'd be curious to look for?\n\nAnil Kapur -- Executive Vice President of Corporate Strategy and Chief Commercial Officer\n\nI can take that question first, Joel, and obviously, Faye can add on to it. So, one of the more important things in low-risk MDS, especially for patients who are predominantly anemic, is continuous and highly durable transfusion independence rates. In all our market research from clinical scientific forums and discussions with our advisors, this remains a high unmet medical need. And there is significant dissatisfaction in this market being expressed with agents that have been currently approved and have existed for the armamentarium for physicians to treat this disease.\n\nSo, we would look for the quality of data, the durability of TI in various subgroups and adoption is dependent on all of those things. But I also want to restate one more time, we target the malignant stem and progenitor cells. Imetelstat has the ability to modify the disease. And what we are seeing in our Phase 2 data is highly encouraging in terms of continuous and durable transfusion independence in high transfusion burden patients.\n\nSo, the value proposition for imetelstat should be very, very strong. But obviously, we would be curious to see what happens in the frontline settings. Faye, anything to add from your side?\n\nFaye Feller -- Executive Vice President and Chief Medical Officer\n\nI would add to that that I'd be interested to see not only anemia improvement and improvement in hemoglobins, but the amount of transfusion burden reduction, especially, as you mentioned, on a continuous basis in that study.\n\nJoel Beatty -- Baird -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from Vernon Bernardino from H.C. Wainwright. Please go ahead.\n\nVernon Bernardino -- H.C. Wainwright -- Analyst\n\nGood morning, everyone, and thanks for taking my question. Thanks also for the update on the Phase 3 IMpact MF trial. It looks like that's making good progress. I'm curious about the improved MF Phase 1 trial in frontline myelofibrosis.\n\nI think, if I remember correctly, the study is being conducted in three sides. Just wondering how enrollment is progressing in that study. And then also, Faye, you mentioned the presentation of IMproveMF Part 1 or some of the data at ASH. Just wondering, as far as the optimization of dose in Part 1 of the study with ruxolitinib, what are your expectations as to how long those patients would be on ruxolitinib? And then in the Phase 2 part, what if our patients are not able to tolerate at least 12 rigs of ruxolitinib, how that study may be conducted and completed? Thank you.\n\nFaye Feller -- Executive Vice President and Chief Medical Officer\n\nJoe, thanks for your question. I'll start with the first one, first, regarding the enrollment. You are correct that we have our plan for three sites to be open. Currently, two of those are open.\n\nAs this is a dose escalation study, we are proceeding with enrollment as expected at the various dose levels. The next question was regarding ruxolitinib and how long we anticipate patients to say on ruxolitinib. And I think that is one of the questions that the trial will answer and intends to answer of how long a combination therapy could be tolerated and whether there are options for a single agent treatment as well.\n\nVernon Bernardino -- H.C. Wainwright -- Analyst\n\nOK. Just to follow up there, what kind of preliminary data might we expect in 2023 from IMproveMF?\n\nFaye Feller -- Executive Vice President and Chief Medical Officer\n\nWe anticipate preliminary safety data most.\n\nChip Scarlett -- Chairman and Chief Executive Officer\n\nYeah. I think it's mostly related to safety. Obviously, if we see interesting efficacy signals, we'll probably talk about that. This is an early phase study, so we can do that.\n\nBut we'll have to see how it works out. It's an open question of whether the two drugs will be able to be combined, and we have great hope. And then obviously, where does the dose go? And so, it's a dose-finding study, as Faye just said. That's a critical element of it as we escalate dose.\n\nVernon Bernardino -- H.C. Wainwright -- Analyst\n\nI'm very interested in the front-line possibilities of imetelstat in MF.\n\nOperator\n\nThere are no further questions at this time. I will turn the call back over to Aron Feingold, for closing remarks.\n\nAron Feingold\n\nThanks so much everyone for joining us today and for your questions. We really appreciate you taking the time to dial in and participate. Be well, everyone. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAron Feingold\n\nChip Scarlett -- Chairman and Chief Executive Officer\n\nFaye Feller -- Executive Vice President and Chief Medical Officer\n\nOlivia Bloom -- Executive Vice President, Finance, Chief Financial Officer, and Treasurer\n\nKalpit Patel -- B. Riley Securities -- Analyst\n\nAnil Kapur -- Executive Vice President of Corporate Strategy and Chief Commercial Officer\n\nSteve Willey -- Stifel Financial Corp. -- Analyst\n\nGil Blum -- Needham and Company -- Analyst\n\nJoel Beatty -- Baird -- Analyst\n\nVernon Bernardino -- H.C. Wainwright -- Analyst\n\nMore GERN analysis\n\nAll earnings call transcripts"
}