{
  "companyName": "DLocal Limited",
  "companyTicker": "DLO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/dlocal-limited-dlo-q2-2022-earnings-call-transcrip/",
  "content": "DLocal Limited (DLO -0.64%)\nQ2 2022 Earnings Call\nAug 23, 2022, 9:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the dLocal second quarter 2022 results conference call. [Operator instructions] Please be advised that today's conference is being recorded. And I would now like to hand the conference over to your speaker today, Ms.\n\nSoledad Nager, head of investor relations. Ms. Nager, please go ahead.\n\nSoledad Nager -- Head of Investor Relations\n\nThank you. Good morning, everyone, and welcome to dLocal's second quarter 2022 earnings call. On the call today, I'm joined by Sebastian Kanovich, our chief executive officer; Jacobo Singer, our president; and Diego Cabrera Canay, our chief financial officer. We are providing a slide presentation to accompany our prepared remarks.\n\nThis event is being broadcast live via webcast and both the webcast and presentation may be accessed through dLocal's website at investor.dlocal.com. The replay will be available shortly after the event is concluded. Before proceeding, let me mention that any forward statements included in the presentation or mentioned in this conference call are based on currently available information and dLocal's current assumptions, expectations and projections about future events. While the company believes that our assumptions, expectations and projections are reasonable in view of currently available information, you are cautioned not to place undue reliance on those forward-looking statements.\n\nActual results may differ materially from those included in dLocal's presentation or discussed in this conference call for a variety of reasons, including those described in the forward-looking statements and Risk Factors section of dLocal's filings with the Securities and Exchange Commission, which are available on dLocal's Investor Relations website. Now I will turn the conference over to Seba. Thank you.\n\nSeba Kanovich -- Chief Executive Officer\n\nHello, everyone. Thanks for joining us today. Second quarter 2022 marked our first anniversary as a public company. During the past year, we have proven that going public was just the beginning of a new chapter for dLocal.\n\nWe continue to build the best financial infrastructure to connect the emerging markets to the rest of the world, making our services available in 37 countries and offering more than 700 dLocal payment methods. Our merchants value the convenience of a one-stop-shop solution, and this gives us an immense opportunity to continue scaling with our customers and increase the barriers of entry for our competitors. We remain humble and focused on providing the most comprehensive solution for our merchants in emerging markets. A big thank you to our global team, our customers and our investors for their continued support.\n\nOn Slide 5, moving into our second quarter 2022 results. I'm happy to say that we've had another quarter of strong results, reaching new records during the quarter. Despite the challenging global macro context, including rising interest rates and inflation, our business has shown resilience and sustained growth, supported by the diversity of our merchants across industry verticals, geographies and products. Our total process volume reached $2.4 billion in Q2, and we've achieved a $100 million revenue milestone in the quarter as we continue to bring new merchants to our platform and monetize our existing ones.\n\nWe saw robust growth in TPV and revenue increasing by 67% and 72% year over year, respectively, despite the high comparison base from last year. Both TPV and revenue accelerated by 16% quarter over quarter. We continue to retain our clients with a healthy NRR of 157% in Q2 2022 as we grew wallet share with our existing merchants. We continue to operate with the philosophy of delivering disciplined profitable growth.\n\nAdjusted EBITDA was up by 47% year over year and 16% quarter over quarter to $38 million. And for the fourth consecutive quarter, we maintained our adjusted EBITDA margin stable at 38%. Our strong performance of the quarter has led us to a combined year-over-year revenue growth rate plus EBITDA margin of 109%. On Slide 6, we continue to see more merchants joining our platform.\n\nTotal merchants on our platform have grown to more than 500, and we currently actively manage around 200 key accounts. As we add new merchants and scale existing ones, our revenue share from our top 10 merchants has continued to decrease from 63% in Q2 2021 to 51% in this quarter. Top 10 merchants in second quarter 2022 were spread across diverse verticals, including ride hauling, commerce, streaming, advertising, financial services and on-demand delivery. Besides that, our top 10 merchants vary from quarter to quarter.\n\nFor instance, compared to the second quarter of 2021, we have 3 different merchants among our top 10, which shows the value of our customer diversification and the strength of our commercial teams. We have built trust with our merchants, successfully taking them to new geographies. The chart on the right shows our continued success in bringing our top 10 merchants to more countries. As of second quarter 2022, our top 10 merchants in terms of revenue on average process payments with us in nine countries, with the maximum being 17 countries per merchant and minimum four countries per merchant.\n\nAs we offer our services in 37 countries, and we keep adding new geographies, we see an immense opportunity to continue scaling our existing customers. Therefore, we remain laser focused on monetizing our existing client base and gaining share of wallet, which we believe is still low across our most relevant customers. I will now hand it over to Jacobo.\n\nJacobo Singer -- President\n\nThanks, Seba. I'm delighted to join you all today from Capetown and share more about our expansion plan. Growing our business outside Latin America remains a key strategic priority and that's why a few months ago, I decided to make South Africa my base for the near future. We believe that in the future, further diversifying our geographical footprint will strengthen our business as merchants look for a single API and a single integration to access multiple emerging markets, including fast-growing, large markets in Africa and Asia.\n\nBesides, we believe that the infrastructure we are building across geographies make us as an important partner for our merchants to achieve their own growth objectives. We are focused on growing with our merchants as they grow organically. Also today, 22 out of the 37 countries in which we make our service available are also in Latin America compared to 16 a year ago and with prospects of opening new countries in these regions in the near future. We started with one country in Africa, Turkey, back in 2016, adding Morocco two years after.\n\nAnd today, we have a presence in 13 countries in Africa. In Asia, we followed a similar journey, and today, we operate in nine countries. Our presence in these countries is already relevant with three countries from Asia and Africa being among our top 10 countries in terms of TPV and revenue. We have been able to not only add new countries, but also to deepen our presence in the countries where we currently operate by bringing new merchants and cross-selling to our existing.\n\nFor instance, 9 out of our top 10 merchants in terms of TPV are already processing with us in these regions, and we see significant opportunities to continue scaling. During the last quarter, we continued to enhance our infrastructure and network, adding more than 10 new payment methods in Africa and Asia. Adding new countries and establishing multiple local connections is complex and merchant-valued infrastructure and network we are creating. This, in turn, improves our moat.\n\nWe continue to explore selective inorganic opportunities to improve our scale, network and products across key markets. Moving on to Slide 8. We continue to see strong revenue growth across all geographies. Dollar revenues in LatAm increased by 63% year over year to $88 million.\n\nOur expansion efforts outside Latin America continue to yield solid results as once again, our revenues in Africa and Asia outpaced the growth in LatAm, increasing triple digits by 155% year over year or a strong 38% quarter over quarter. Our revenues from Africa and Asia were 14 million in the quarter, having accumulated $23 million during the first six months of the year. As a comparison for the full year 2021, our revenues from Africa and Asia were $21 million, and we are pleased with our Q2 run rate revenues for our business in Africa and Asia of around $60 million. Our share of Africa and Asia increased to 13% of total revenues, and we expect to see a gradual increase over time as we continue to cross-sell to merchants that originally started the relationship with us in Latin America.\n\nBesides, we continue to see merchants initiating the relationship with us through markets in Africa and Asia and then expanding to Latin America. We continue to invest in expanding our global team, responding to the incremental opportunities we face. At the end of Q2 2022, we had 632 employees increasing by 48% or by 205 FTEs year over year. Our headcount has significantly expanded outside the Americas as we focus on hiring locally to grow faster reaching 118 FTEs outside of the Americas by the end of June 2022, increasing by 2.1 times year over year.\n\nDuring the year, we grew in all areas with particular focus on tech and products, sales and marketing and our operations and expansion team. Tech-related roles, including those outside of the tech and product team continue to represent around 40% of our FTE. Diego will now review our financial highlights.\n\nDiego Canay -- Chief Financial Officer\n\nThanks, Jacobo. Let's begin with Slide 10. We continue to see strong TPV growth during the quarter. In Q2 2022, our TPV reached $2.4 billion, increasing by 67% year over year and 16% compared to the first quarter of 2022.\n\nAs Seba highlighted, we have a fast-growing and resilient business that continues to benefit from diversification. As you can see in the pie chart on the right, our business model is not dependent on the performance and outlook of any single industry vertical. We have merchants for more than 10 different verticals and every vertical is well balanced in our portfolio with no single one accounting for more than 20% of our TPV in Q2 2022. The TPV growth is attributable to the performance and continued growth of our merchants across most verticals, particularly in commerce, on-demand delivery, travel, Software-as-a-Service and advertising.\n\nI would also like to highlight that we have experienced growth both in pay-ins and payouts during the quarter. For pay-ins, we have seen a steady increase in TPV quarter after quarter. Specifically, in Q2 2022, pay-ins have doubled year over year. We continue to see improvement in our payouts volumes with double-digit growth quarter over quarter.\n\nYear over year, payouts experienced mid-single-digit growth. As in the second quarter of last year, we saw higher-than-average volume that came from certain merchants that ran big marketing campaigns in that period. Regarding our cross-border and local-to-local volumes, the relative contribution has remained stable in the past three quarters, both showing solid growth year over year and quarter over quarter. Slide 11.\n\nRevenue also reached a new record, surpassing for the first time the $100 million threshold in a quarter, having grown 72% year over year and 16% over the first quarter of 2022. Our revenues of our TPV or take rate was 4.2% during the quarter, stable quarter over quarter and slightly above the 4.1% seen in the second quarter 2021, mainly driven by a change in business mix as pay-ins increased the relative contribution year over year. Zooming in on revenues, we continued delivering strong revenue growth, both from our existing and from our new merchants. Revenue from existing merchants are those revenues that are driven by merchants, but were already processing with us in the same period of last year and revenues from new merchants are those revenues that are driven by merchants that started operating with us after the same period of last year.\n\nDuring the second quarter of 2022 of the 72% year-over-year revenue growth, 57% or $33 million came from existing merchants. Our revenue from existing merchants continues to grow from quarter to quarter, reaching $92 million in Q2 2022, more than doubling the $40 million that we achieved in the same period of last year. Our net revenue retention for the second quarter of 2022 was 157%. We calculate net revenue retention as the revenue from existing merchants over the total revenue of the same period of last year.\n\nAs we commented in previous earnings presentation, the second quarter of 2021 represented an all-time high in terms of revenue and TPV growth. And therefore, in this quarter, we'll start to have a tougher comparison with last year. For the full year 2022, we continue to expect a net revenue retention north of 150%. The remaining 15% year-over-year revenue growth or $9 million came from new merchants.\n\nThis compares to $11 million recorded in the first quarter of 2022 and $19 million in the same period of 2021. As our merchants typically have a three to six quarters ramp-up period, we believe that revenues from new merchants are just an initial indication of the potential of our new customers. Moving to Slide 12. We were going to scale a gross profit to $50 million in Q2 2022, up 47% year over year, while experiencing the largest quarter-over-quarter expansion in the past four quarters, increasing by a solid 14% or $6 million compared to Q1 2022.\n\nGross margin came in at 49%, pretty in line with the margin level seen during the second half of 2021 and Q1 2022. Our cost of processing for the quarter represented 2% of our TPV, stable quarter over quarter and compared to 1.6% a year ago. The increase versus Q2 2021 was mainly driven by a change in business mix as pay-ins, which have a higher processing cost increased the relative contribution. Moving on to our adjusted EBITDA.\n\nIt was $38 million for the second quarter of 2022. It followed the same trend as gross profit, increasing by 47% year over year and experiencing the highest quarter-over-quarter growth in the past four quarters, increasing by a strong 16% or $5 million compared to Q1 2022. Our adjusted EBITDA margin was 38%, in line with our margin in the second half of 2021 and in Q1 2022. For the full year 2022, we continue to expect our adjusted EBITDA margin to remain north of 35%.\n\nIf we look at operating expenses for the quarter, excluding onetime noncash items, we see that they have grown 36% year over year as we expanded our team and other more senior members, in line with our strategy to keep investing in building infrastructure and harvesting long-term sustainable growth. In addition, we increased our travel and in-person marketing events as things went back to normal, and we also increased third-party professional services as part of becoming a public company. Before handing the call back to Seba for the closing remarks, let me say that our cash generation and our balance sheet are stronger than ever. We have continuously delivered positive free cash flow, generating $168 million in the last 12 months, compared to $99 million in the full year 2021, excluding the PrimeiroPay acquisition and $85 million in 2020 with a solid cash conversion of 168% for the last 12- month period or 103% when excluding funds from merchants.\n\nAs a result, as of June 30, 2022, we had a robust cash position of $554 million, which comprises $270 million of own funds and $184 million of merchant funds. Seba, the floor is yours.\n\nSeba Kanovich -- Chief Executive Officer\n\nThanks, Diego. I would like to conclude by saying that we are very excited about the opportunities that we foresee for the rest of 2022 to continue expanding our financial infrastructure across emerging markets and provide tailored solutions for our merchants to help them achieve their growth plans. As I previously highlighted, our business has shown resilience and sustained growth, supported by the diversification of our business. We have been able to keep delivering high growth in a profitable way, increasing our TPV and revenue by 91% and 90% year over year, respectively, in the first half of 2022, with a strong NRR rate of 177% and with an adjusted EBITDA margin of 38%.\n\nOur top execution capabilities, combined with our strong cash generation give us confidence that we are well placed to consolidate our leading position as the online payment solution of choice in emerging markets amid the challenging and uncertain global environment. We do not anticipate changing our expectations for our own business for 2022. Thus, we reiterate our expectation of our net retention rate to be at 150 plus level in 2022, and we expect our EBITDA margin for the full year 2022 to be north of 35%. We will continue to execute with discipline into the massive opportunity ahead of us.\n\nWe reiterate we are just getting started. I'll now turn it back to the operator to open it up for questions. Thank you all for listening. It was a pleasure being here today.\n\nOperator\n\n[Operator instructions] Our first question will come from Jason Kupferberg of Bank of America.\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nI just wanted to pick up on some of that guidance commentary around both NRR and adjusted EBITDA margins. Obviously, on both metrics, you're trending comfortably ahead of your full-year target through the first half of the year. So just wondering if we should expect some meaningful moderation in both NRR and margin in the second half? And if so, what would drive that? Or are you just being conservative given some of the macro uncertainty out there?\n\nSeba Kanovich -- Chief Executive Officer\n\nJason, thanks for the question. Diego, I'll start. Please feel free to complement. So we've stayed very consistent on this topic from the beginning of the year.\n\nWe insist on our expectation of 150% for the full year and 35% plus on EBITDA margin. We think that's the right thing to do. We are very bullish on what we've seen in our business. We are very proud of the quarter we just posted.\n\nBut we think it's the right thing to do to stay consistent and continue with the expectations of what we've said in the past.\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nOK. OK. So nothing obvious you would call out that we should be wary of in the second half?\n\nSeba Kanovich -- Chief Executive Officer\n\nSo we are today presenting on our Q2, and it's one we're very proud of, and we are happy to discuss. We've never been a better company in our history, and we are very comfortable saying that. We've never had more products. We've never had more geographies.\n\nWe never had a better customer [indiscernible]. And we are building this for the long run and part of being very consistent on the expectations and what we share with you is having the flexibility of building for the long term, which is what we want to do. We believe the opportunity ahead of us is massive. And that won't change in any short-term hiccup that we might find in the future.\n\nWe are very consistent, and we want to continue to be so. We are extremely proud of the quarter we just posted. We are proud of the business we are building, and we believe the opportunity ahead of us is massive.\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nThat makes sense. Just a follow-up on TPV in the quarter. It seemed like the strength was pretty well balanced among a bunch of your verticals and obviously, you continue to benefit from diversification. But I was just wondering if you can talk about which parts of the business maybe lagged a little bit in the quarter in terms of TPV growth.\n\nI mean I'm thinking maybe parts of your financial services vertical, for example.\n\nSeba Kanovich -- Chief Executive Officer\n\nJust to complement. But, Jason, we've shared in the past that we are a very balanced basket of different industries in the Internet economy. We've seen things like streaming growing slower than it used to be. I think that's not news and that's information you can probably get on the wider market.\n\nBut the fact that we are very diversified means that there's always winners and losers. We've been through cycles like this in the past. The winners are the one you would expect on-demand delivery, travel, ads and SaaS. And some of the ones that have grown slower are on the streaming side.\n\nBut again, the fact that we are very well diversified, have continued to work as a hedge. And we've said this in the past that we are still micro in a macro environment. So we still believe that our ability to grow will be very much dependent on our ability to drive value to our customers and bring them to new geographies and products.\n\nOperator\n\n[Operator instructions] Our next question will come from Neha Agarwala of HSBC.\n\nNeha Agarwala -- HSBC -- Analyst\n\nCould we take a bit on the EBITDA margin your guidance is above 35% for the full year. But for the first half, you've been pretty stable at 38%. So should we expect higher investments in the second half of the year, which could lead to a compression in the EBITDA margin. Where are these investments going to come from? More specifically, if you can shed some light on that.\n\nSeba Kanovich -- Chief Executive Officer\n\nSure. Neha, thanks for the question. Diego, do you want to take it?\n\nDiego Canay -- Chief Financial Officer\n\nSure. How are you doing? So as you saw in the past four quarters, our adjusted EBITDA margin has been around 38%, very consistent across the board, actually, have a 10 basis point increase quarter over quarter. We write 35-plus percent for the full year. We don't see any significant change in trends, but we always want to have the flexibility to invest and accelerate growth whenever it makes sense for us.\n\nSo the guidance is still 35% plus for the full year. And -- but if you want, we don't see any significant changing trends going forward.\n\nNeha Agarwala -- HSBC -- Analyst\n\nSo it is possible that for the full year, you might come at around 38% adjusted. It could be around 37%, 38%.\n\nDiego Canay -- Chief Financial Officer\n\nSorry, Neha, the right value is 35 plus, so we want to have that flexibility. We don't have any significant change in trends, but we are not guiding to 38% or any number different to 35 plus.\n\nNeha Agarwala -- HSBC -- Analyst\n\nOK. But there are no specific investments that we should be mindful of in the second half, which should lead to necessarily for the margin to decline.\n\nDiego Canay -- Chief Financial Officer\n\nNothing different to what we have been doing, very focused on our expansion and our technology team or our sales team. Those are the main focus of our investments, but nothing very different to what we have been doing in the past few months.\n\nNeha Agarwala -- HSBC -- Analyst\n\nOK. Another question I have is on the cost of services. It has gradually been inching up. I mean it was marginally higher, now around 51% of the gross revenues, a bit higher than what we expected.\n\nCould you give us some color as to why the pickup against this quarter? Anything related to a change in mix that might have led to a higher cost of services?\n\nDiego Canay -- Chief Financial Officer\n\nSorry. So basically, the change quarter over quarter is three basis points, which we consider very minor. Remember that we don't focus in percentages. We focus in absolute dollars.\n\nAnd we incentivize our teams in absolute dollars. If you see the increase in gross profit in the quarter, quarter over quarter was actually $6 million compared to $4.5 million in the previous two quarters. So we are very pleased that in absolute values, the gross profit has grown higher -- the highest growth in the past four quarters. Things like changes of three basis points in a quarter, I think that will happen from time to time.\n\nWe have 47 countries, 450-or-more merchants and any changes in the processes of those merchants or countries may modify slightly the gross profit or cost up or down. Also, keep in mind that we launched many countries when we launch smaller countries, typically, we do start at an optimal level of gross profit. But after we launched, we're continuously ready to get to those -- to that optimization. So those smart things may change a little bit the gross profit or cost.\n\nBut again, we're talking about only three basis points in the quarter. And in absolute values, it's the highest growth we had in the past year.\n\nNeha Agarwala -- HSBC -- Analyst\n\nOK. But 50% gross profit margin sounds reasonable and should be around there. No reason for it to fluctuate a lot.\n\nSeba Kanovich -- Chief Executive Officer\n\nSeba here. So we continue to not optimize for our percentage take rate. And I think it's really important to explain the rationale behind that. We are building a business for many years based on the dollar amount.\n\nWe are happily going to trade a higher dollar amount for a lower take rate. We want both to do that. We believe the opportunity ahead of us is massive, and we shouldn't hold ourselves to any given revenue -- given a margin threshold, we don't think that's the right way of building the company long term. We've shared -- these objectives are shared with the team.\n\nWe have them go and get us more customers to use our infrastructure and do so at a profitable level. Every dollar in our platform contributes to our margins, and that's something that has always been the case. So while the margin numbers you mentioned have been relatively stable in the past, we are not optimizing for that, and that's not an internal goal of forwards. We want to build a bigger business on a gross profit dollar amount because we think that's the right way of building it in the dormant.\n\nNeha Agarwala -- HSBC -- Analyst\n\nUnderstood, sir. Last thing I wanted to check on is the issue in Chile, the litigation that came up. Do we have any update there?\n\nDiego Canay -- Chief Financial Officer\n\nSo, Neha, on Visa and Mastercard, we don't have any significant updates. Just to get everyone up to speed, both Visa and Mastercards are valued partners of ours. We are all in for transparency and making sure that we contribute to the ecosystem. So far, we are still in start of school in Chile, and we are yet to see a final resolution for this.\n\nBut we feel very comfortable that both Visa and Mastercard are great partners of ours. We've been a healthy part of the ecosystem, and we intend for that to continue to be the case in the future.\n\nOperator\n\n[Operator instructions]Our next question will come from Ygor Azevedo of GS.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nThis is Tito. Can you hear me?\n\nSeba Kanovich -- Chief Executive Officer\n\nYes, Tito.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nTito Labarta from Goldman. A couple of questions. First, can you give any color in terms of the mix between, say, payment message? You talked to, I think, payouts, you said were kind of stable, that you're growing a lot in pay-ins. Any color you can give on that in terms of like how much is payout, how much pay-in cross-border versus local to local.\n\nJust to give some context on how the different payment methods are evolving and also between the alternative payment methods and cards. If you can give any color on that? And then I have a separate question.\n\nSeba Kanovich -- Chief Executive Officer\n\nDiego, do you want to take it?\n\nDiego Canay -- Chief Financial Officer\n\nYes, sure. So mixes have been very stable, Tito. So pay-ins remains roughly close to three-quarters of the total for the past three quarters, I would say. Local to local is roughly one-third of the business.\n\nAnd again, in the past two quarters have been very, very stable. Both pay-ins and payouts grew mid- to high single digits quarter over quarter, so that consistent to what I just said. And sorry, was there any other part of your question in terms of mixes?\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nAnd then I'll turn the payment methods for its credit card.\n\nDiego Canay -- Chief Financial Officer\n\nYes, also, let me say, but roughly credit cards is roughly one-third of the business and close to 50% of pay-ins.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nOK. Perfect. And my second question, in terms of the growth we're seeing in Asia and Africa, a very strong growth there. And I think you're on average around nine countries per merchant, if I saw that slide correctly.\n\nShould we expect Asia and Africa to continue to outpace the growth in LatAm. Is this driven by your – I used to go to Asia and Africa? And can you give any color on the unit economics between Asia and Africa versus LatAm, I don't know if it different margins. So is it maybe a little bit earlier? Is there upside to margins as you grow in those countries?\n\nSeba Kanovich -- Chief Executive Officer\n\nTito, we lost you for a few seconds on the second half of the question. We got on the trends in Africa and APAC, but we've lost a part of the second of the question. Would you mind repeating?\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nSorry. Sure, no problem. Just any unit economics you can give between like Asia and Africa and Latin America, I don't know if like margins or take rates? Is there upside as you scale up in those countries?\n\nSeba Kanovich -- Chief Executive Officer\n\nJacobo, I'll start. Feel free to complement. Tito, It's one of the things we are the [Inaudible]. The fact that our business in Africa and APAC continues to grow really fast.\n\nIt was one of our strategic bets, having $40 million in a quarter, growing at 155%. It's definitely something we are extremely proud of. When we launch a new geography and both geographies in Africa and APAC are newer, we are not optimized for margin. That's some what we're optimizing for.\n\nWe want to make sure we are bringing the right customers, and we are bringing them in the right countries and with healthy unit economics. But we are not optimized the way we are in LatAm where -- in some of the markets we've been live for seven years. So while the unit economics, there's no fundamental reason why they should be different on the long run. Obviously, on the short term, we are less optimized and on purpose.\n\nWe are willingly probably paying a little bit more on the cost side than we are going to be paying on a more mature stage. We think that's the right thing to do on the short term that gives us the ability to build the infrastructure. And we know the more scale we build them, we have the ability of getting better conditions from our partners downstream.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nGreat. That's helpful. And then just on the first part, in terms of the growth, should we expect Asia and Africa to continue to outpace Latin America. I don't know if you have a target for what percent of revenues should come from those countries or anything like that?\n\nSeba Kanovich -- Chief Executive Officer\n\nJacobo, do you want to take it?\n\nJacobo Singer -- President\n\nThanks for your question. So we expect Africa and Asia to continue outpacing LatAm. Just to remark a little bit of number that we captured Africa and Asia have grown 155% year over year compared to 63% year over year in Latin America. I'm being -- Africa and Asia revenues also grew 38% quarter over quarter.\n\nSo we're super excited and positive on the growth Africa and Asia and representing within the company. In relation to your -- the second part of the equation, we are not pursuing a particular target. But we are pursuing all the opportunities we have with our merchants to bring them to this geography.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nGreat. And maybe just one quick follow-up on that. In terms of the competitive environment there, do you see more opportunities? Is it more competitive than Latin America? Just in terms of things to think about that opportunity and where you fit in versus competitors?\n\nJacobo Singer -- President\n\nSorry, so basically, Tito, on that, each region, it's particular. But the most important part is the value of having a single API for our merchants, while expanding into geographies, it represents a value added over service. So we see the same trends and opportunities in regard to facilitating the international merchants to come to these geographies. So competitive landscape and environment, it's good for us having the value of having most of the merchants integrated into the platform.\n\nSeba Kanovich -- Chief Executive Officer\n\nAnd, Tito, just to complement on that. Some markets in Africa and some geographies in APAC look very much like LATAM did when we started the dLocal. You see fragmentation. You see the clear need and the clear demand for merchants to go into these markets.\n\nThe other thing that has happened is that businesses that didn't have healthy business models are clearly struggling, sorry, and that's obviously an opportunity for us. So we think in a market like the one we are in businesses that have invested on -- sorry to be redundant, but on building a business the right way and doing so profitably and investing step by step are going to be able to differentiate. And as Jacobo was saying, the fact that we are covering not only APAC, but Africa and LatAm will continue to prove a differentiated offering even more than ever in the current environment where resources for engineers are less available than they used to be in the past.\n\nOperator\n\n[Operator instructions] Our next question will come from Andrew Bauch of SMBC Nikko Americas Inc.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nJust wanted to get a sense of the level of visibility you have within your merchant base today. I know one of the challenges with modeling this business has been around really your growth being somewhat dictated by the ambitions of your merchant partners. And so as you kind of reach these greater levels of scale within each of these different merchants, is there more visibility that they're giving you today on what revenue could be shifted over, what they plan on pushing through the platform over time?\n\nSeba Kanovich -- Chief Executive Officer\n\nAndrew, thanks for the question. And yes, we do have further visibility than we used to have essentially because we have more touch points, and we have become a more strategic partner for our merchants than we used to be before. Years back, we would only discuss one country, Latin America, then the whole of Latin America. And now we are discussing the whole emerging market strategy.\n\nSo that's definitely beneficial for us. Our business will continue to depend on our merchants, and that's the nature of who we are as a company. We don't have any dependencies and we don't have any concentration, not by industry and not by merchant. But the reality is that we are as good as our merchants are and we are indexed to their growth, and that's going to continue to be the case.\n\nWe continue to keep track of our pipeline. It's in a very healthy position. We see that emerging markets continue to be a priority for global companies and more than ever, they understand the importance of being local in those markets. One of the things we've worked really hard on is making sure we have turned the visibility on our merchants plan.\n\nSo we can plan accordingly. Keep in mind that drives a lot of our product strategy. We want to be going with our merchants want us to go. So the more information we can have the better offer.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nGot it. And then in previous quarters, we've talked about some of your efforts around local to local. Could you just give us an update on what you're seeing in regards to that effort? And remind investors and the community of the value proposition that you can provide there?\n\nSeba Kanovich -- Chief Executive Officer\n\nSure. So local to local is a very complementary business from what we call cross-border. The service itself is the same. We always process payments locally through local payment methods and in local currency.\n\nThe only difference is if the merchant wants to receive the funds internationally or they want to receive them locally in market. Many of our biggest merchants use us in both models. So in some selected geography they'll ask us to settle those funds locally. And in other countries, they will ask us to expatriate or repatriate and then sell it to them.\n\nFor us, we are agnostic. We want to make sure that merchants don't graduate from us. And whatever way they decide to do business, we have a solution to go with them. Both businesses are important to us.\n\nThey both contribute to our margin. We believe both are strategically important to our merchants. We don't want them to have a partner for local to local and then one for cross-border. That's not a good business for us.\n\nWe want to make sure we have a holistic solution and that we can work with them for many years, no matter what way they decide to operate.\n\nOperator\n\nI am seeing no further questions in the queue. I would now like to turn the conference back to Sebastian Kanovich for closing remarks.\n\nSeba Kanovich -- Chief Executive Officer\n\nSure. So I want to thank everyone for participating today. We are extremely proud of the second quarter we've just posted and the great progress we've made in diversifying our business outside of LatAm with Africa and Asia, increasing influence in our old business. We've reached 13% of revenues.\n\nSo we think that's a very important milestone. We want to reiterate our expectation of NRR to be north of 150% and EBITDA margin to be north of 35%, both metrics for the full year. And as always, we are available. So feel free to ask any questions at any point.\n\nWe are available to you. It was great here being here today, sorry, and thanks very much for your time.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSoledad Nager -- Head of Investor Relations\n\nSeba Kanovich -- Chief Executive Officer\n\nJacobo Singer -- President\n\nDiego Canay -- Chief Financial Officer\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nNeha Agarwala -- HSBC -- Analyst\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nMore DLO analysis\n\nAll earnings call transcripts"
}