{
  "companyName": "HealthEquity",
  "companyTicker": "HQY",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/07/healthequity-hqy-q2-2023-earnings-call-transcript/",
  "content": "HealthEquity (HQY 1.03%)\nQ2 2023 Earnings Call\nSep 06, 2022, 4:30 p.m. ET\n\nRichard Putnam\n\n[Audio gap] Second Quarter Fiscal Year 2023 Earnings Conference Call. My name is Richard Putnam, and I do Investor Relations here for HealthEquity. Joining me today, we have Jon Kessler, who's our president and CEO; Dr. Steve Neeleman, who is our vice chair and founder of the company; and Tyson Murdock, the company's executive vice president and CFO.\n\nBefore I turn the call over to Jon, I have two important reminders. First, a press release announcing our financial results for the second quarter of fiscal year 2023 was issued after the market closed this afternoon. The financial results in the press release include contributions from our wholly owned subsidiary, WageWorks and the accounts at administers. The press release also includes definitions of certain non-GAAP financial measures that we will reference here today.\n\nA copy of today's press release, including the reconciliation of those non-GAAP measures with comparable GAAP measures and a recording of this webcast can be found on our Investor Relations website, which is ir.healthequity.com. Second, our comments and responses to your questions today reflect management's view as of today, September 6, 2022, and will contain forward-looking statements as defined by the SEC, including predictions, expectations, estimates or other information that might be considered forward-looking. There are many important factors relating to our business, which could affect the forward-looking statements made today. These forward-looking statements are subject to risks and uncertainties that may cause the actual results to differ materially from statements made here today.\n\nWe caution you against placing undue reliance on these forward-looking statements, and we also encourage you to review the discussion of these factors, as well as other risk factors that may affect our future results or the market price of our stock, and they are detailed in our latest annual report on Form 10-K and subsequent periodic reports filed with the SEC. We assume no obligation to revise or update these forward-looking statements in light of new information or future events. And at the conclusion of our prepared remarks, we will open up the call for Q&A with the help of our operator. So let's get started by turning this over to our CEO, Jon Kessler.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nThank you, Richard, and thanks, everyone, for joining us this afternoon. Today, we are announcing solid results for HealthEquity's fiscal 2023 second quarter on the back of strong performance in our core HSA business, and we're also raising our full year outlook. I will discuss Q2 operating results, and Tyson will review the financial results in detail and provide updated guidance. And then Steve is here for Q&A.\n\nLet's start with the five key metrics that drive our business. As always, revenue of $206.1 million, grew 9% versus the second quarter last year, driven by strong organic and acquisitive growth in HSA members and assets, and that was notwithstanding nonrecurring regulatory drivers of CDB service fees in the year ago period. Excluding these nonrecurring factors, revenue grew 15% year over year. Adjusted EBITDA of $67.0 million grew 2% versus the second quarter of last year, weighed down the absence of those regulatory drivers and the timing of synergies from the further acquisition.\n\nTotal accounts grew to $14.5 million, up 11% compared to Q2 last year. HSA members reached $7.5 million, up 26% year over year. And HealthEquity's HSA members grew their assets to a record $20.5 billion at quarter's end, which is up an even larger 33% from a year ago. Team Purple continued its strong FY '23 sales effort, adding 196,000 HSAs, which is 9% more than we added in the second quarter of last year.\n\nOrganic account growth of 12% over the past year is, we believe, well ahead of the market. Looking forward to year-end, we are particularly excited about pipeline growth from network partners, conversion of enterprise cross-sell opportunities and enterprise uptakes of max enroll, which is our package of virtual education and live support for clients' employees considering stepping up to an HSA qualified health plan and an HSA during this open enrollment season. Despite volatile market conditions, HSA invested assets grew $111 million in the quarter, HSA investing members grew 28% and the average balance of our HSA members overall grew 5% year over year. Custodial revenue growth was very strong.\n\nOn top of the small favorable impact of in-quarter increases in the overnight Fed funds rate, robust adoption by HSA members of HealthEquity's enhanced rates offering in Q2, puts us on track to meet or exceed our target of having 20% of HSA cash in enhanced rates by the end of the fiscal year. Both macro conditions and the team's efforts are, we believe, creating the opportunity for years of custodial growth to come. Robust card fee growth suggests that inflationary pressures in the broader economy have not put a dent in consumption of medical and other coverage services by consumers to date. As you may recall, card fees in the year ago period were high due to the timing of pandemic extended runoffs, particularly FSAs and HRAs.\n\nWe're, of course, carefully monitoring for signs of inflation or a COVID resurgence, crimping member spend beyond the usual seasonality that we see in Q3. Today's results and the guidance Tyson will detail in a moment, would be even stronger but for softness in CDB administration services. As you know, HealthEquity offers CDB services to increase core HSA opportunities. And indeed, cross-selling and bundled selling have helped drive record HSA sales, as I discussed a moment ago.\n\nHowever, service fees from CDBs themselves declined through the first half of fiscal '23 versus the same period in fiscal '22, primarily due to one-time COBRA subsidy driven income in the year ago period and greater-than-expected CDB fee attrition from the now completed WageWorks platform migrations. Service costs declined sequentially in Q2, as promised, and we believe there is more opportunity in efficiencies, as well as commuters slow but steady recovery. As pandemic and WageWorks integration impacts finally recede, we believe that CDBs can bring net unit growth and a larger contribution to gross profits alongside the great things that are happening in the HSA core. With that, I will turn it over to Tyson to review the financial details and give us some guidance.\n\nTyson Murdock -- Executive Vice President and Chief Financial Officer\n\nThank you, Jon. I'll review our second quarter GAAP and non-GAAP financial results. A reconciliation of GAAP measures to non-GAAP measures is found in today's press release. Second quarter revenue increased 9% year over year with lower service revenue more than offset by robust custodial and interchange growth.\n\nService revenue was $103 million, down $6.1 million or 6% year over year. Last year's second quarter included approximately $10 million of nonrecurring revenue attributed to the COBRA subsidy. Excluding the nonrecurring subsidy impact, Q2 service revenue grew approximately 4%, primarily from strong HSA growth and an uptick in commuters returning to work, offsetting about $5 million of FSA and COBRA revenue attrition that Jon mentioned. Custodial revenue grew 34% to $65.6 million in the second quarter, benefiting from 30% growth in average HSA cash and 37% growth in average HSA investments combined with an uptick in the annualized yield on HSA cash.\n\nThe annualized interest rate yield on HSA cash was 180 basis points during the second quarter of this year, and 175 basis points year to date compared to 177 and 178, respectively, for last year. This yield is a blended rate for all HSA cash during the quarter and represents a better-than-expected yield due to rate hikes in June and July, impacting the variable rate portion of our HSA cash combined with higher enhanced rate balances in the quarter. Interchange revenue grew 20% to $37.5 million, compared to $31.1 million in the same quarter last year. As Jon mentioned, interchange revenue in the year-ago period benefited from accelerated spend as FSA rollover extensions expire, year-over-year growth in Q2 benefited from growth in average total accounts with cards and increased spend per account.\n\nGross profit was $117.8 million, compared to $112 million in the second quarter of last year. Gross margin was 57% in the second quarter this year versus 59% in the year ago period and service costs decreased $6 million sequentially as we executed on our commitment to address our overstaffing and member services, as we discussed with you approximately 90 days ago. However, we have work to do to bring our expectations of service costs in line with revenue in future periods. This includes realizing additional efficiency from the integration work and managing the impact of inflation on service costs.\n\nIn addition, we are committed to delivering the $15 million of synergies connected to the further integration, the bulk of which is associated with the exit of the transition services agreement and the consolidation of the platform expected to be realized in fiscal '24 and '25. Operating expenses were $120.2 million or 58% of revenue, including amortization of acquired intangible assets and merger integration expenses, which together represented 15% of revenue. Loss from operations was $2.4 million. Net loss for the second quarter was $10.7 million or a loss of $0.13 per share on a GAAP EPS basis, compared to a net loss of $3.8 million or $0.05 per share in the prior year.\n\nOur non-GAAP net income was $28.1 million for the second quarter this year, compared to $33.4 million a year ago. Non-GAAP net income per share was $0.33 per share, compared to $0.40 per share last year. Adjusted EBITDA for the quarter was $67 million and adjusted EBITDA margin was 33%. For the first six months of fiscal '23, revenue was $411.8 million, up 10% compared to the first six months of last year.\n\nGAAP net loss was $24.3 million or $0.29 per share -- diluted share, non-GAAP net income was $50.8 million or $0.60 per diluted share, and adjusted EBITDA was $125.4 million, up 1% from the prior year, resulting in 30% adjusted EBITDA margin for the first half of this fiscal year. Turning to the balance sheet. As of July 31, 2022, we had $177 million of cash and cash equivalents with $928 million of debt outstanding net of issuance costs. This includes $346 million of variable rate debt.\n\nThere are no outstanding amounts drawn on our $1 billion line of credit. We are providing the following revision to our guidance for fiscal '23. We are increasing our revenue estimates for fiscal '23 to range between $834 million and $844 million. We are maintaining non-GAAP net income to be between $103 million and $111 million, reflecting increased interest expense offsetting the benefit of higher operating income.\n\nThis results in non-GAAP diluted net income between $1.23 and $1.32 per share based upon an estimated 84 million shares outstanding for the year. We are raising our adjusted EBITDA estimate to be between $252 million and $262 million. Today's guidance includes our most recent estimate of service, custodial and interchange revenue and expense based on results today. On service revenue, today's guidance reflects the continued solid performance of core HSA offsetting the full year impact of the roughly $5 million per quarter of CDB service fee attrition observed in the first half.\n\nWe remain cautious on increased commuter uptake. Based on the strong sales outlook Jon discussed in continuing labor market tightness, today's guidance assumes incremental service costs during peak season comparable to those experienced in prior years. On custodial revenue, today's guidance assumes a full year yield on HSA cash of at least 80 basis points, pointing to a stronger second half based upon current conditions. As in the past, our guidance does not assume further increases in the overnight funds rate or other changes in macroeconomic policy for the remainder of the fiscal year.\n\nAdditional rate hikes would have only a modest impact this year, but would have a much greater impact on fiscal '24 and beyond as we roll over fixed rate contracts and place new HSA cash from growth at the end of the fiscal year. In the same vein, today's guidance reflects additional interest expense on HealthEquity's variable rate debt for the second half of fiscal '23 based on current conditions, but not for their rate hikes. On interchange, we want to remind you that Q3 has historically been our weakest interchange revenue quarter. We expect the normal sequential decline in spend in Q3 with a rebound in Q4 due to use or lose spending and January growth.\n\nFinally, we assume a projected statutory income tax rate of approximately 25% and a diluted share count of $84 million in our calculation of non-GAAP net income and earnings per share. As we've done in recent reporting periods, our full year guidance includes a detailed reconciliation of GAAP to the non-GAAP metrics provided in the earnings release and a definition of all such items is included at the end of the earnings release. In addition, while the amortization of acquired intangibles is being excluded from non-GAAP net income, the revenue generated from those acquired intangible assets is not excluded. With that, I'll turn the call back over to Jon for some closing remarks.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nYou should have a button which just says that. It's like a little recorded button. Anyway. So before we go to Q&A, I'd like to just take a second on behalf of Team Purple to thank Ted Bloomberg, who is our former COO.\n\nWe truly appreciate, I truly appreciate, everything that Ted has done in furtherance of our mission to connect health and wealth. Through the WageWorks integration, the pandemic, the acquisition of further launch of enhanced rates and other milestones. We all truly wish Ted the best. The team and our partners and clients are all now focused on delivering a deep purple open enrollment and onboarding season.\n\nHopefully, that will not get me in copyright trouble. I've said before that present sales are the best predictor of future sales. And on that basis, given what I've said today, and what we're reporting today, we expect a very busy and productive rest of the fiscal year. Thank you.\n\nOperator?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from C. Gregory Peters with Raymond James. You may proceed.\n\nC. Gregory Peters -- Raymond James -- Analyst\n\nSo I guess let's start off with the sales results. And I'm just trying to unpack the strong new HSA number that you reported for the second quarter and trying to figure out the components of what are existing customers just from new employees, new accounts coming on board? Just trying to break apart what led to the, I would think, better-than-expected result there.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nYeah, it's a great question. Thank you, Greg. So just kind of for sake of summary, if I look at the first half of the year as a whole, we've added 355,000 accounts or opened 355,000 accounts, and account closures have been very much under control. And that 355,000 is 20% plus relative to last year, which itself was obviously the best we've ever had for the first half.\n\nAnd kind of if you -- you've been with us kind of from the beginning here, and you remember when we would report 400,000 for a year and be pretty happy about it. So reporting this kind of number for the first half feels pretty good. And to your question, if I look at the components of that and try and break it down, as we said at the end of the first quarter, the fact that the labor market has remained strong is definitely a -- [Technical difficulty]\n\nC. Gregory Peters -- Raymond James -- Analyst\n\nHello?\n\nOperator\n\nOne moment, please.\n\nC. Gregory Peters -- Raymond James -- Analyst\n\nSomething happened on the phone?\n\nOperator\n\nPlease remain on the line. Your conference will resume shortly.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nI'm not sure that Greg will still be on the microphone, so I'm going to answer his questions and then -- his question and then, operator, we'll go to -- we'll have to work on getting Greg's part B through L. But --\n\nOperator\n\nGreg is now on an open line.\n\nC. Gregory Peters -- Raymond James -- Analyst\n\nJon, can you hear me? Let's start over.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nWe can hear you. All right. This is fun. When I was doing this in my neighbor's bedroom, right at the pandemic start, it was much more reliable than what we got built on now that we're all back traveling the way we used to.\n\nAnyways, so Greg, your question, why don't you reask first part of your question, and I'll start the answer over.\n\nC. Gregory Peters -- Raymond James -- Analyst\n\nOK. So I was -- my question was focused on the net new sales result for HSAs in the second quarter, and definitely running stronger than probably what most were looking for. And so what I was looking -- the question was about unpacking what caused that result to be so strong. Was there some anomalies in some existing accounts with new employees coming on that won't repeat itself? Were there are new accounts, new employers that came on that bolstered the result? Just trying to unpack the components of the sales result for new HSAs.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nYeah. So to repeat a little bit, and then I'll get to the new stuff. We -- if I look at the first half of the year as a whole, we added 355,000. We opened 355,000 new accounts.\n\nAnd that's 20% over year over year. And obviously, last year was pretty good, too. As your question suggest, Greg, the strong labor market, in particular, continued strong job adds as people come back into the workforce and so forth, definitely played a role, and you can see that in the growth of existing clients that is existing logos at the client level. And as we said after we reported -- truthfully after we reported the fourth quarter and again, after we reported the first, we did want to caution people kind of not to go crazy with this because obviously, that can turn around on us.\n\nThat having been said, even without that factor, we had a very strong quarter. And there wasn't anything in particular, no 50,000 account thing that came on or anything along those lines. But rather, we -- in particular, what continues to perform well, Greg, is our -- if I look across our channels, the stuff that focuses on the middle market, where you can see new adds in the middle of the year, new client logos in the middle of the year continues to perform well. And fantastically, what we're reporting HSAs.\n\nBut as I look -- I commented in the prepared remarks, from a pipeline perspective, as I look toward the end of the year, I'm also quite enthusiastic notwithstanding the current softness about the new sales on the CDB side. We have some really, really good opportunities to close here and close, meaning, ultimately, get the member input from them. And we'll also see if we get some -- finally see some post pandemic rebound in the FSAs that we haven't yet seen. So -- but no, there isn't some single factor outside of, obviously, employment growth giving us a boost here that we've commented on the first quarter as well.\n\nC. Gregory Peters -- Raymond James -- Analyst\n\nOK. Got it. I guess the second question is probably directed more toward Tyson, but probably Steve or Jon, you'll chime in on this. So you've raised your revenue guidance for the year, you've raised your adjusted EPS guidance, but -- your adjusted EBITDA guidance.\n\nBut you've kept your EPS guidance flat. So I'm just trying to reconcile the different moving parts why two components are going up and the other isn't. Does that make sense?\n\nTyson Murdock -- Executive Vice President and Chief Financial Officer\n\nThere we go. Yeah. I mean this is really about the interest expense that we have on the other side, right? That compounded with the fact that you tax affect non-GAAP net income, and then also just going back to the service costs that we talked about as well and really building in, those are in there plus some additional travel cost. There just was a place where we were like, we don't want to get ahead of ourselves on that, even though we're generating a lot of good high-margin revenue.\n\nWe realize that that is not falling down to the bottom line. But those are the reasons why. And it's really thinking about that debt cost coming in and the rates increasing on the $350 million TOA.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nA way to think about it is, yes, we raised EBITDA by three. You've got roughly two of -- that translates into about two after tax, and that's about the same as the interest expense increase that we're projecting. Again, in both cases, without the assumption of future Fed ratings.\n\nC. Gregory Peters -- Raymond James -- Analyst\n\nAnd just a point of clarification on that, Tyson. How much was -- how much of the debt is variable?\n\nTyson Murdock -- Executive Vice President and Chief Financial Officer\n\n$350 million. So if you think about how that calculates out, that's about $2.5 million of additional interest costs. And then you think about the other piece of that is the tax effect of the rest of the stuff falling down through non-GAAP EPS. So that's about $3 million worth of items that don't get added back in that reconciliation versus they do in the EBITDA reconciliation.\n\nC. Gregory Peters -- Raymond James -- Analyst\n\nGot it. Thanks for the answers.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nThanks, Greg.\n\nOperator\n\nThank you. Our next question comes from Allen Lutz with Bank of America. You may proceed.\n\nAllen Lutz -- Bank of America Merrill Lynch -- Analyst\n\nHey, everyone. Thanks for taking the questions. I guess my first question here on the sequential increase in custodial revenue, about $6 million here. Is there any way to frame what percent of that is coming from that increase in the Fed funds, Jon, you mentioned? And then what percent is coming from enhanced yield and if there's anything else that's in there, too?\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nYeah. So you basically have it right in terms of the two contributors. When you look at the rate increases from the Fed, I just sort of generally think about those as policy factors. Those are contributing the bulk of it.\n\nAnd as a reminder, right, where we get the benefit of those is really on the variable cash that we have out there, which can be as high as $1 billion. It starts to dwindle off as we get toward the end of the year a little bit. But in any event, so that factor, if you do the math, is more than 50% of it. Enhanced rates is -- if you kind of think about it is what their -- really accounts for the rest.\n\nAnd enhanced rates, we're really pleased with where we are. I mean this is something where I think if these trends continue, we'll be in really great shape at the end of the year. Of course, most of that won't show up as a benefit in the current year. But there are three things that are performing well here.\n\nOperationally, the product is performing well in terms of all of the liquidity controls and the like that we want to have on it. Secondly, in terms of rate performance for HealthEquity in the members, it's -- the product is doing precisely what we predicted. And then I think, third, in terms of uptake, which is the thing I highlighted in the comments, we're very confident about our 20% goal for the end of the year and hoping to give you more than that. And the benefit of that, as I said earlier, will be as you look out into '24, '25, etc., I mean, these are -- you know the term of these agreements.\n\nSo we're kind of locking in benefits at a very fortuitous time, I think, for a long period of time to come.\n\nAllen Lutz -- Bank of America Merrill Lynch -- Analyst\n\nThank you. And then kind of on the core HSA business. Obviously, we have a Devenir report coming out soon. In 2020 and 2021, the industry was growing, call it, mid-single digits.\n\nAs we think about kind of what you think the industry grew at so far year to date, is there any reason to think that we've deviated from there? I know you mentioned that kind of the mid-market was strong to HealthEquity, but is there anything that you're seeing there that would kind of make you think that the market growth rate is changing one way or another?\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nI wouldn't be surprised if we saw a little bit of an uptick in market growth, maybe high single digits, but I don't -- they don't send us an advanced copy. They're more likely to send you an advanced copy. So I'm hoping they're not doing that either, but you never know. But I think that wouldn't surprise me on the basis of our results.\n\nAnd as I said in answer to Greg's question, look, I think there's a piece of that that is growth in -- where -- I said last quarter, we were almost back to pre-pandemic levels of total benefit eligible employment or total civilian employment. And we're now kind of just a little bit above those, which is great. We also have a lot more people who reentered the labor force and haven't yet found work. But given the availability of jobs, they're likely to find work, which is great.\n\nAnd so from my perspective, I wouldn't be surprised to see a little bit of an uptick, but I'm not sure it matters that much either way. Either way, if you look at it on an organic basis, we're -- and I mean, obviously, we reported 26% growth year over year in total, 12% organic growth year over year in accounts, and that's going to be well ahead of whatever the market delivers. And when you combine that with very high asset growth, notwithstanding market volatility, that's kind of what we're trying to deliver.\n\nAllen Lutz -- Bank of America Merrill Lynch -- Analyst\n\nThat's great. Thank you.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nThank you.\n\nTyson Murdock -- Executive Vice President and Chief Financial Officer\n\nThanks, Allen.\n\nOperator\n\nThank you. Our next question comes from Stephanie Davis with SVB Securities. You may proceed.\n\nStephanie Davis -- SVB Leerink Partners -- Analyst\n\nTalk to me about your commuter revenues. You're in the office, you're having IT issues, I'm in the office, my teams in the office. Are you seeing commuter fully come back? And what are you baking in the guidance?\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nI must first say for my IT team that we are not in the office. We are at a -- other bank's conference. So I won't name them, so it's not to throw anyone's IT under the bus, but this is one case where the HealthEquity technology team and corporate infrastructure team, hardworking and long suffering are off of. They were quick to ask if we needed help though.\n\nThere were a lot of immediate tests. But in any event, commuter. So look, commuter revenue is -- continues to grow at a kind of modest but steady clip. And you see the growth on the interchange side, which, as you know, is the smaller component of commuter revenue.\n\nAnd then obviously, on the service fee side. And as you know, and we just took a look at this actually, if I look throughout the pandemic period and so forth, pricing on commuter has held up really well. Some of the things we try to do to even out for the future, for the next -- I don't know what's after Omicron. Mu, I don't know what's next.\n\nIs it Mu? I don't know. I think -- and whatever the next one is, we've tried to set it up so things will be much more even, if not perfectly even. So I have, Stephanie, very high hopes for commuter. That having been said, hope is not a plan.\n\nAnd so from a forecasting perspective, we're going to continue to be, as we said when we gave our first guidance for the year, what is that, once bitten, twice bitten. I don't know how many times we've been bitten by this, but a couple of times. So we're very shy and we're going to just kind of see what we get each quarter and then bake that level into our forecast and that's that. But it's certainly -- after HSA, it is, in percentage terms, our fastest-growing component of the book and we did a lot of work over the pandemic to, a, get -- improve ultimately margins from that business as it grows; and then b, make it a more flexible product, as you know.\n\nSo I think there's a lot of opportunity there. And it's a product that if you had asked me six months ago, I probably would have said, in fact, I did say, while ultimately it will recover, who knows where it's going to be. I feel somewhat more optimistic about where this product really ends up than I would have six months ago. It's not that I really think people are being dragged back to the office full time.\n\nClearly, that's not happening. But when you look at our cases that have been around a while, as people kind of get used to the hybrid thing and figure out how to use the commuter benefit recognizing that most of the revenue comes from service fees, those service fees are starting to come back. So again, slow, slow, slow relative to what one might have expected a while back, but feeling somewhat optimistic about the trajectory there.\n\nStephanie Davis -- SVB Leerink Partners -- Analyst\n\nGot it. So thrice bitten, incredibly shy, but still more optimistic than we were before. We're just not baking it in yet. So with that --\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nYeah. As you know, we're all pretty shy people around here anyway.\n\nStephanie Davis -- SVB Leerink Partners -- Analyst\n\nOf course. So wait, with that in mind, then I look at your guidance and you raised by more than the beat, which is pretty uncommon versus what you guys historically did. So it -- is that a change in philosophy? What was that?\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nIn the Mott years, that would -- no, Tyson, do you want to speak to this?\n\nStephanie Davis -- SVB Leerink Partners -- Analyst\n\nYeah, that's very not Mott of you.\n\nTyson Murdock -- Executive Vice President and Chief Financial Officer\n\nYes. I think what it is, is it just kind of calculates out. So if you think about what we've said about the variable portion of the cash, which is $500 million to $1 billion. If you kind of go to the midpoint, do the math on the raises, you get a number that's underneath that seven plus the enhanced rate portion that comes in there.\n\nAnd so in my mind, it's just the math working out. And then like I said before, it's just how much can we get to come down to margin. And as we get more acceleration, we get placements at the end of the year, we're going to make more and more progress against that. We just need the rates to just stay where they're at or get a little better, and that's a very positive thing for us, all in.\n\nStephanie Davis -- SVB Leerink Partners -- Analyst\n\nAll right. Positive change in philosophy. Well, thank you, guys. Appreciate it.\n\nAnd congrats again.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nI don't know about that. Let's not go crazy with the positive change in philosophy, but it does pencil out. I mean it is -- if you look at the change that we made in yield guide on the custodial side and run that out, it kind of explains what we do.\n\nStephanie Davis -- SVB Leerink Partners -- Analyst\n\nSo if you run that out, I actually get $9 million of upside versus -- including the 2QB.\n\nTyson Murdock -- Executive Vice President and Chief Financial Officer\n\nYou're using $1 billion to do the calculation.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nYeah. Just make -- as I said in the earlier somewhere, the marginal cash starts dwindling off a little as you get to the end of the year. So there's less. It's not a full $1 billion at the end of the year.\n\nStephanie Davis -- SVB Leerink Partners -- Analyst\n\nAll right. All valid. Thank you, guys.\n\nOperator\n\nThank you. Our next question comes from David Larsen, BTIG. You may proceed.\n\nDave Larsen -- BTIG -- Analyst\n\nHey, guys. Congratulations on a very, very good quarter here. What was the revenue and earnings contribution from health savings administrators and also further?\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nYeah. So I don't think we've ever -- we've broken out health savings on an annual basis, and it contributed for most of this quarter, maybe all of it, actually, but it's small. I mean you're talking about $1 million or $2 million, something like that, a couple of million bucks. With regard to further, Tyson, do you want to hit that one?\n\nTyson Murdock -- Executive Vice President and Chief Financial Officer\n\nYeah. I mean I'd just go back to what we had stated at the beginning. We haven't really come out and given a refreshes on that, but it was about a $60 million business with a 20% EBITDA margin. We're working on improving that margin with the $15 million of synergies that will come in over time.\n\nSo it gets to be like a 40% margin at some point off of that -- off of those dollars. And right now, we're in the middle of getting through the TSA, and we'll do a technology platform shift in '24 and '25. And so we'll make those improvements there. And that will help not only the servicing costs get better also revenue improvement that they're selling, but also the technology line item will get better because of those synergies.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nI mean one of the flip side, I'll just say, of the sales side of things that we talked about is we're seeing very good production and good partnership from the 10 new health plans that we became partners with as a result of the further acquisition. And a piece of that is having taken, I think, a very collaborative approach to how we're approaching the platform work that we have to do, the features they're going to get, talking to them about how we can deliver more value, being able to deliver the full CDB bundle that they kind of didn't really have with further. And we had a meeting, actually our first live customer event since pandemic, back in July with all of our Blues partners. And obviously, that group makes up a big chunk of that.\n\nAnd so I think that taking it a little bit slow on the further synergy, which we said we would take slow at the very outset is paying dividends on the sales side. And so that seems like it's OK.\n\nDave Larsen -- BTIG -- Analyst\n\nGreat. So it sounds like you're generating good revenue synergies from both of those transactions. That's great. And then there's a lot of chatter in the market about the risk of a recession, potential slowdown in hiring.\n\nI mean, are you seeing any of this at all? Or is this actually working to your benefit with people maybe saving more and obviously an increase in interest rates? I mean, any thoughts there would be great.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nYeah. I love this question because I get to play like macroeconomists, which is a joke. But -- especially if you ever try to teach me macro. But first, I would say, the slowdown in hiring does not appear in our data and does not appear in the national data.\n\nI mean last month's numbers were 350,000 new jobs. I think consensus was like 352,000, right? And those are -- when you think about that like steady state is something, given current demographics, is something between 100 to 150. What's really happening is people are coming back into the labor force and those jobs being created. So I don't -- I mean, we have not seen that in the data.\n\nBut I think ultimately, as Chairman Powell said, employment is going to be a piece of the pain, right? The relevant question is not so much the -- for us, it's not so much the unemployment rate. It's the pace of job creation. And a way to look at that within our book of business is to say, OK, are we going to grow our new HSAs by 20% year over year. I don't think so.\n\nI mean that would be a tremendous outcome. But to do that, you would have to see the second half, have a as much job out creation as the first. And I don't think that's the idea. So I would certainly -- certainly, when we do our forecasting, we're looking at having a -- by historical standards, a very, very strong end of the year, but I don't think we're expecting to have this tailwind for the full fiscal year.\n\nBut as I say, even if you look at August, neither our data nor the national data tell the story of reduced employment growth or much reduction employment growth. So that -- the second part of your question was about spend. I do think that -- what you would expect is in the context of inflation, right, that the balanced growth on a per HSA basis would slow down, and that's exactly what we've seen, right? So we grew balances on average about 10%, 11%, 12 percent-ish in the last few years. On a year-over-year basis, this year, we're looking at about 5%.\n\nI mean, a big piece of that is simply a reduction in equity net asset values during the quarter. But nonetheless, it's still the case that when you have an inflationary period, people are less -- savings rates go down. It's a little bit counterintuitive, but the same thing that when you have a quick economic shocks, savings rates go up. So we've seen that average balance growth trickled back into the single digits, but still at very healthy levels, again, particularly when you factor in that during the quarter, there were significant reductions in asset value, and now we're at the place where roughly a third of total assets are in debt and equity securities.\n\nSo that's kind of what's going on there.\n\nDave Larsen -- BTIG -- Analyst\n\nGreat. Thanks very much. Congrats on a very good quarter.\n\nOperator\n\nThank you. Our next question comes from Glen Santangelo with Jefferies. You may proceed.\n\nGlen Santangelo -- Jefferies -- Analyst\n\nYeah. Thanks, and good evening. Thanks for taking the questions. Hey, Jon, I want to ask you about the service fee portion of the business.\n\nI mean, it seems like there's obviously a lot of good things going on, on the HSC and custodian side. But if -- I think I heard you correctly, it kind of sounds like some of that strength is being offset by lower service fees. And I think, Tyson, in your prepared remarks, you suggested you're seeing $5 million quarter in service fee deterioration. I think you gave some numbers on a year-over-year basis, normalizing for the COBRA subsidy that you got last year.\n\nSo I was wondering if you could just elaborate a little bit more on the service fee portion of the business and kind of what you're seeing and assuming through the balance of the year. Thanks.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nWhy don't you start this one, Tyson?\n\nTyson Murdock -- Executive Vice President and Chief Financial Officer\n\nYeah. I mean that we wanted to lay those out pretty concisely in the script, and I think you did a good restatement of it, Glen. So I appreciate that. I won't regurgitate that back.\n\nBut really what we're trying to say is that there is some revenue decline related to migration, some of the attrition that occurred there as we got that done. And so we want to make sure people are aware of that. And so just calling out specifically the CDBs relative to that $5 million decline per quarter. I mean the thing you need to keep in mind, too, is it's really there's headwind automatically there because you have the $10 million of subsidy revenue from last Q2 on the COBRA side from the legislation, that's not there this year.\n\nAnd then you also have that decline we're talking about on the COBRA side. So COBRA comes down quite a bit because of low unemployment rate and the subsidy coming off. And then you have some FSA decline because of the way that we did the migrations and just some fall off there. So we wanted to call that out.\n\nWe called out service expense in Q1 as a little overstated. We got that under control. That was the $5 million to $7 million. But I still think there's opportunities there when you think about bringing that service costs in line with that revenue.\n\nI know that wasn't particular to your question necessarily, but it really, to me, is kind of wholesale running that part of it. So I don't know, maybe there's a follow-on there. Jon can add to that.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nYeah. I mean I would just -- the way I sort of look at it, and again, I think this is consistent with the prepared remarks is let me first -- let me ask you back up first. This is all in. The HSA side of service fees, which is the minority of service fees, but nonetheless, it's something we talk about a lot and have answered many questions on over the years was rock solid, second quarter and first quarter.\n\nHSA, if you were to look at it, and we don't break down service revenue by product, etc., it would be very difficult for us to do that in a way that we can consistently report to you. But suffice it to say that in rough terms, HSA attributable service revenue grew by the same percentage of HSA accounts. And so that's a good news story, and I think reflects a lot of work on the team's part to make sure that the revenue efficiency associated with our HSA business remains strong. Now -- and that's notwithstanding the obviously, the increase in rates.\n\nSo what we had is really two factors on the CDB side. And now I'm thinking about the first -- the full first half and just extending out for the full year. One that I think is easy to understand is the COBRA subsidy that we had last year, we didn't have this year. I think everyone understood that.\n\nAbout $10 million and in the second quarter. And obviously, there is no COBRA subsidy this year. So $10 million, that's easy. The second factor is that as we kind of got into this year, and this was reflected in our earlier year guidance.\n\nIt's not a surprise to us at this point. But as we got into the year, it was clear that in our work to assure that we completed our migrations as promised, we have made a big deal both internally and externally to say are going to complete the WageWorks related platform migrations work in -- we said we had a big deal of saying we were going to substantially complete that in fiscal '22 to the point where we told you, for example, that we would not include those costs, any WageWorks integration costs, in the integration add back after the end of fiscal '22, and we haven't. And in fact, just to that point, when you finally get to look -- when you look at our -- the detailed reporting, you'll see that we're actually spending just a teeny bit less than we thought on integrations and you kind of get the idea. But having done all of that work and really focused on getting it done for the benefit of our customers, for the benefit of our team, etc., as we look at it and how it all unfolded, we have about $5 million in each quarter of this year, $5 million in the first, $5 million in the second.\n\nAnd again, our guidance reflects the idea that this will continue in the third and fourth that is primarily FSA and then also some COBRA revenues that we're not going to see, notwithstanding the fact that accounts, CDB accounts are basically flat to slightly up. And I could -- if someone was really interested, I could go into the details, except that -- but what I'll start by saying is simply that when you kind of get into the nuances of platform movements, there are decisions that we made to make sure we could get this done and get it done right for customers. And as we made those decisions while obviously, revenue efficiency was a material factor, we also wanted to make sure we were doing right, that we weren't leaving people in weird pricing setups or what have you. And so -- and that we were focused on delivering great service.\n\nSo that does seem to be paying off for us in terms of cross-sell and the fact that even on the CDB side, sales look very strong this year. But the way I would look at it going forward beyond this year is now we're done with this. And we told you that the WageWorks -- what we first told you the WageWorks thing would take into fiscal '23, we finished it in fiscal -- at the end of fiscal '22. It's done.\n\nAnd now what I think you should be asking of us, it's up to you in terms of what you should expect, but what you should be asking of us is that the CDB business as a whole, which is primarily made up of service fees and then some interchange and a little bit of custodial, that the CDB business as a whole contributes to the overall growth story, right, which we didn't expect it to, and in fact, it hasn't in either fiscal '21 or fiscal '22, and that was before the pandemic, which did its own damage. And so as I get into fiscal '24, that's the way I sort of look at it is the bar that we are setting is that CDB as a whole starts to contribute to growth. And I think it can. But there's still some work to do.\n\nAnd then as Tyson mentioned, while if I sort of cost, basically, cost per seat per account are basically flat, right, which is great, meaning service cost per account, that's great. We managed to take care of our teammates from an inflation perspective, get some efficiencies and so forth, we can do a little better than that. And the ways we can do a little better than that are: one, by ultimately completing the further integration that we still have left to do, which will -- it's more focused, obviously, but does have real savings in service and tech. And then secondly, by continuing to get advantages from an efficiency perspective from all of the streamlining that we've done over the last couple of years here.\n\nSo -- and then obviously enrolling the portion of -- so anyways, yeah.\n\nGlen Santangelo -- Jefferies -- Analyst\n\nYeah. I really appreciate all that detail. Thanks so much. Super helpful.\n\nI just want to ask one quick follow-up on fiscal '24. And I know you don't want to comment or give any guidance, but obviously, everybody's so focused on the rate curve. And if you look at the current rate curve and you go back and compare it to December 2019, I mean, we're conservatively up 120 to 130 basis points plus from where we were. And so I think what most people want to do is look at your three-year duration portfolio and assume you're going to replace or reinvest roughly $4 billion at these much higher rates, right, so we can do the math and assume the type of impact that will have on the overall yield curve of your portfolio.\n\nIs that logic correct? I mean -- or should we think about it any differently? And I know you don't want to get in the business of forecasting future rates or giving guidance. I'm just sort of looking at where rates are today.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nI mean I think the basic logic is correct. The only thing I would -- in terms of the potential for custodial growth, the only thing I would be cautious about is it's not a third of our current portfolio, it's a third of what our portfolio was at that time. And so though I don't -- I have to admit, I don't have the numbers sitting in front of me. I don't -- I'm not trying to guide to it.\n\nBut as you do the math, you want to look at what our cash looked like three years ago and say, well, roughly a third of that is that repriced. And that will be helpful in fiscal '24. And the -- well, I'll just stop there. That will be helpful in fiscal '24.\n\nSo I think the basic logic is right, and it's just a question from my perspective of getting right, a, what we replace that and, b, also having the right number rolling over.\n\nGlen Santangelo -- Jefferies -- Analyst\n\nGreat. Thanks for all the details.\n\nOperator\n\nThank you. Our next question comes from Stan Berenshteyn with Wells Fargo. You may proceed.\n\nStan Berenshteyn -- Wells Fargo Securities -- Analyst\n\nHi. Thanks for taking my questions. I guess not surprising to see the revenue guidance one up on variable rate exposure. I was a little surprised that EBITDA guidance was not up as much.\n\nI thought a lot of that would maybe go through to the bottom line. Is there anything offsetting EBITDA guidance for moving higher on your end?\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nI think the biggest factor is the one we've mentioned, which is that it's really back to that service revenue component. I commented in the -- and then I'll ask Tyson to elaborate since it's kind of a guidance question. But in the prepared remarks, I said that our -- I think both the quarter we delivered and the full year would -- I think in the initial draft, I used some word like spectacular and then Richard got a hold of it and said, maybe that wasn't the best thing. But that's the other factor that is really out there.\n\nAnd again, it's not really a cost problem. It's really that we have -- we're doing the work, but we made some decisions that as we wanted to get these platforms integrated, declare victory and move on and optimize for future sales that, in the short term, cost us a little bit of revenue, and that is what it is. So that's the only other factor that's out there. I guess maybe I would just say one other thing, which is as we thought about particularly as you trace this down to EBITDA and then you go down to, as Tyson commented, down to non-GAAP net income and then so forth, we are -- well, if I thought that we were under from a cost perspective, massive inflation pressure, I would say so.\n\nWe are going to do what we need to do to take care of our team and in particular, to take care of our customers during busy season. And so we were probably more detailed in the prepared remarks here than we've ever been in terms of what we've assumed about the amount we will spend at the end of the year. Now I think we've been cautious in that regard. We basically assumed, as Tyson said in the prepared remarks, that the spending increase that you will see in Q4 over Q3, and the service line is kind of give or take, the same as last year.\n\nAnd as you will recall, last year had some really unique factors. So have we -- I think that's an area where we're being cautious to give ourselves room to not be having a discussion that is like, hey, we need to serve our customers, but we need that last penny of non-GAAP EPS. So that's probably another factor that's just out there recognizing that the flip side of the sales numbers being good is we're ramping up to take care of those customers. Now I think we can ultimately do a little better than we forecast, but we want to have those contingencies, so we're never talking about trading service levels for a quarterly beat or not beat.\n\nTyson, anything on that?\n\nTyson Murdock -- Executive Vice President and Chief Financial Officer\n\nI think that's right. And the only thing I keep in mind is we're talking about that cost number just that obviously, there's more accounts even from the acquisitions and what we've added over the course of the first couple of quarters and what we will add going through there. And then I would say you can't go without saying that there's additional travel. Jon mentioned the partner conference.\n\nWe're seeing all of our teammates out in the field. We're just -- we're doing things a little bit different like everybody else. And so I've got to build in some wiggle room for us to be able to do that. And then as we hire people over the course of this year, I think there is a little bit of inflationary pressure on payroll as we do that, and then we'll have to get into next year and see how that plays out.\n\nBut that's why you don't see that fall down. I think as time grows by, you'll -- we're going to figure out how to have more and more of that fall down to the bottom line.\n\nStan Berenshteyn -- Wells Fargo Securities -- Analyst\n\nGot it. And then maybe just a quick one on member growth and your sales pipeline. On membership, obviously, it was pretty strong this quarter. Is there any change in the mix of employers that are offering high deductible health plans or maybe the mix of employees that are adopting those plans versus maybe historical trends? And can you maybe also comment on the RFPs that you're seeing? Are there any differences in what employers are requesting versus, let's say, a year or two ago?\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nSteve, do you want to take this one?\n\nSteve Neeleman -- Founder and Vice Chairman\n\nSure, as long as you can hear me. I know there's been all those technical issues. Good. Great.\n\nYeah. So yeah, thanks for the question. I think one of the things that's been a little bit different this year is that over the last 18 months is we've become much more effective in reaching individuals. And so we've seen some significant increase in the number of individual HSA holders.\n\nAnd I think it's just because a lot of people have had HSAs for a while, and we think the time is right to get out there and market to them. And we love the individual counselors we bring on because their balances are high, and they're very committed to the product. And then we are seeing, we think, really some nice traction in the sub-500 market. And I think largely, this is because we're finally getting the message out about the bundle and the fact that sometimes we think a 500 live employer is pretty small.\n\nThey're really not. I mean that's a significant employer that's fairly complex. Usually, they're understaffed when it comes to their -- the folks who are running their HR department and things like that. And so they may have three or four people that are looking after the whole group of workers.\n\nAnd so for us to come in with a complete solution that includes not just the health savings account but also these things are very important, whether it be COBRA or FSAs, these live sale accounts, I think, are meaningful for even those larger employers in kind of the SMB space. And so I think that's where we've seen some real nice traction. We continue to have rate wins in the enterprise space and in those kind of the 500 to 5,000 space, too, but those would be the ones that I think are growing the most. I mean, Jon, do you agree with that or any other color?\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nYeah. I mean this is -- one of the things that we -- I look at last open enrollment season. We, with all kinds of heroics and maybe over heroics in some cases, we managed to hold it together for our members despite all of the factors, the pandemic, omicron, etc. We had much more difficulty with our clients and our brokers.\n\nAnd they themselves have their own challenges. And what I guess I've been fairly gratified about, particularly in this second quarter versus the first is hearing very positive commentary coming from the brokers that serve the market Steve is describing about what we've been able to do as we came out of last year's busy season again, in terms of our client service and really stepped up to servicing them. And so the result -- the reason I mentioned all that is to say it kind of goes hand-in-hand with our strategy on the health plan side. The health plans talk to the brokers.\n\nThe brokers talk to the health plans. And sometimes you don't exactly know which conversation it was of yours that gotcha the sale, but it's the sum of activities that creates relative to our competition, a brand where I think there's confidence on both sides of that equation that we actually care about these people, that we've made real decisions with real trade-offs that have helped -- that are in their interest and we'll continue to do so. And I think that's something we're seeing as a notable strength that's helped us throughout this so far this year.\n\nStan Berenshteyn -- Wells Fargo Securities -- Analyst\n\nGreat. Thanks so much.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nI feel like I want to start calling analyst names who haven't asked questions yet.\n\nOperator\n\nThank you. Our next question comes from Sandy Draper with Guggenheim. You may proceed.\n\nSandy Draper -- Guggenheim Partners -- Analyst\n\nThanks very much. And Jon, I assume I was definitely going to be the next one you're going to call on.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nI mean, the truth is I don't know where you are half the time. I think you're out biking, you're like [Inaudible]. You're like Superman on a bike.\n\nSandy Draper -- Guggenheim Partners -- Analyst\n\nI'm not on a bike right now or you'll hear wind rustling. So most of my questions have actually been asked. I'll just a couple of quick ones. I just want to make sure I understand when you're talking about the service fee attrition, is it actual accounts going away? Or is it pricing pressure in that? So that's the first part.\n\nBut then also, Jon, I heard you, I think, in the prepared remarks, say based on the sales and some other things, you expect to see CDBs starting to be a growth factor. Again, I would assume that's not the back half of this year, but you're talking about maybe next year or the year out that you would expect CDBs to start to actually be a positive growth contributor. Thanks.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nThose are -- I really appreciate both of those questions because it's a great opportunity to clarify. Your first question, Sandy, was is the weakness that we've seen on CDB service fees, a function of account attrition or competitive fee pressure. And the truth is the answer is a lot of either of those things. Yeah, there's always a little bit of fee pressure out there, especially in times like these, but we've handled that pretty well.\n\nYes, of course, we saw some incremental account attrition that offset our sales. But if you look at accounts on the CDB side, extent of COBRA where you have some subsidy impacts right? They're basically flat to up across all of the CDBs, and you'll see that in the published stuff. Really, what we've got here is two factors. One is the one I don't need to belabor, that is the subsidy.\n\nBut the second factor really is as we move business, a lot of -- and parenthetically, all of our CDB migrations occurred, I won't say all, let's say, substantially all of our CDB migrations occurred in the second half of fiscal '22 sort of culminating in -- at the end of the year, right? As we moved all that business over and tried to do it in a scalable way so that we would be down to our go-forward platforms and we wouldn't be talking about WageWorks migrations anymore, right? We did have revenue that fell out primarily, and I guess I'm going to -- without suggesting that we weren't billing what we could or what have you, I'm going to call it fee efficiency. So -- and I'm going to use an example to help illustrate and Tyson will tell me when I get on that. You will, right?\n\nTyson Murdock -- Executive Vice President and Chief Financial Officer\n\nYeah.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nIt won't matter. I'll just keep skating, but you'll tell me.\n\nTyson Murdock -- Executive Vice President and Chief Financial Officer\n\nRight.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nI mean even Mott couldn't. Even the same that Darcy Mott could not. We're talking about him like he's gone. He's listening to this call and grading us but harshly, no doubt.\n\nBut in any event. An example of this point, Sandy, is we have billings for runout accounts. And as you might imagine, when you're moving accounts over at the end of the year, right? You have to make decisions like how much effort am I going to put into migrating the runout accounts and then migrating the billing for the runout accounts. Well, it's an area where, as a team, we chose to put some effort, but recognizing that it's something that once we were through the year, we would kind of be done with.\n\nAnd so we didn't put a ton of effort into that for the purpose of maximizing billings in FY '23, right? That factor will have -- by the time we're done with the full year, it will have cost us a not immaterial sum. And there are a couple of other items like that where when we moved from Platform A to Platform B, the revenue in full just didn't follow us. And so it's not really a case of fee pressure. I mean, there's -- again, there's always some, but it's not really a case of fee pressure on the CDB side or a case of a loss of volume on net of sales, it's really -- I think of it as revenue efficiency here that we have.\n\nAnd then we -- obviously, I'll make one last point, which is there are cases where in light of some of the service challenges that we and everyone in just about every business had, particularly in the first quarter, there were certainly some cases where we were willing to give some fee concessions, but you kind of get the idea. So as you look to next year, which was the second part of your question, I do think from where we are today, there are a couple of things that should help us focusing on the CDB side of the business. The first is that we won't have the negative effects of you move platforms and you do lose some accounts. So sales versus churn should be a net positive for us, whereas it's been basically a net neutral in the last couple of years here.\n\nThe second thing is that. And I think I'm going to say I feel confident in that in part because the sales activity on CDB has been pretty strong thus far this year. Looking at the pipeline, most of this stuff shows up on January 1, as you know. The second thing that we should have going for us, but this is a sort of -- we'll have to show you is from the perspective of enrollment, and this is particularly in FSAs, we have not rebounded at all from the pandemic lows.\n\nIn other words, you look at percent uptake, right? We're still at the pandemic lows, and that's not surprising because those enrollments only happen once a year, and you had people who kind of got burned during the first pandemic year. So a little bit of a bounce back there would be extremely helpful. And we're not just waiting for that to happen. Our marketing team led by Tia Padia and her education team, led by [Inaudible], a Florida native, I might add.\n\nThere are a few of us. So she's from like that Northern like forgotten coast part. So I don't know what's going on with that. But it's not quite lower Alabama, but it's not lower Alabama, if you know what I mean.\n\nBut that whole team -- that team is putting effort into education around our existing FSA members, either those who are enrolled now to reenroll for next year or those who are enrolled in the past to come back, and we'll see how that goes. But -- and then lastly, the pieces of the CDB business that have been healthy again, from the perspective of post-pandemic, HRA has been healthy. And of course, commuter, if you reset the baseline at this point, as I commented earlier, continues to grow. So I think it is -- a way to think about it, Sandy, is like at the time of when we kind of rebalance the business to have the CDB component, our promise to you was that we would grow the HSA business way faster than the CDB business, and that happened, right, both in accounts and revenue to the point where HSA is going to be well over 60% of revenue this year.\n\nAnd that will continue. But we also promised you that CDB growth would be a positive number and not just a black zero. And so if we can get to that place in fiscal '24 and beyond, then it just makes the underlying HSA story all that better. So that's something we're working very hard at.\n\nI mean, if I'm you, I'm like, well, that's great, guys deliver it, then I'll be convinced of it. But that's certainly the way I think about it myself, but I think that's entirely reasonable given where we are.\n\nSandy Draper -- Guggenheim Partners -- Analyst\n\nGot it. That's really helpful. By the way, you can just refer to that as Tom Petty Florida or Tom Petty's part of Florida.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nI don't actually that -- or we could go on.\n\nOperator\n\nThank you. Our next question comes from Sean Dodge with RBC. You may proceed.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nYup. Thanks. Jon, maybe on the last point you're making about the CDBs contributing to growth. There's, of course, a few dimensions there as you pointed out.\n\nBut -- and to better appreciate the opportunity there to help dimension that out. I guess maybe where should we start? How many multiproduct -- I guess how was multiproduct adoption changed over the last couple of years? What proportion of clients have multiple products in place where we could see meaningful upside as things like FSA use returns to sort of amount of normal fee post pandemic? How is that multiproduct adoption changed now versus where it was in 2019? And maybe where do you think it could go?\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nI think Tyson commented on this in an earlier question, and I'm going to give you an answer and then invite Steve to -- from a kind of market perspective to elaborate. But I think that the market has largely followed us, and I'm not trying to brag in that regard. I just -- it is a statement of fact to the idea that the bundle is kind of -- it's not maybe the norm in all cases, but it's getting close. And you see this in terms of the percent of new deals that get signed, etc.\n\nAnd so I guess my view is that that's the key behavioral change at the employer level. At the employee level, we still -- on the CDB side, HSA adoption is moving along fairly swimmingly, right? But we still have a ways to go to get back to pre-pandemic behavior. Whether that's expressed in terms of people enrolling in user lose health FSAs, independent care FSAs or obviously in commuter. And then COBRA itself is probably -- our business will continue to grow, but COBRA uptake, that has been for central people who actually take COBRA, which is a portion of our COBRA fees.\n\nThat piece is going to be low as long as employment markets remain tight and as long as people -- a lot of people have access to highly subsidized plans in the ACA marketplace, which they are going to have, at least for the next few years. So those are the -- so from an individual perspective, putting the COBRA point aside, I think the big picture is that we will eventually see some positive trend here. We're seeing that in commuter. Truthfully, I think we are -- in terms of accounts, we're seeing -- I mean, if you look at the FSA book, it's up year over year.\n\nright? It's just up very modestly, and that's reflective of some of the factors I talked about earlier. The big thing that kind of -- I feel like we would already be talking about this as a win. But for the fact that we made decisions that prioritize, getting these migrations done over sort of billing efficiency, fee efficiency. And so be it, we should reap the benefits of those going forward.\n\nSteve, do you want to add anything to that or --\n\nSteve Neeleman -- Founder and Vice Chairman\n\nSean, just -- great question. Just to remind you, when we first did the deal with Wedge, about 10% of their book with HSAs, and they had like 7 million accounts, right, in total. And about 10% of our book was CDBs, and we had about 4 million accounts in total. And we're just getting started on that cross-sell.\n\nObviously, we put a premium just because of the higher revenue and the kind of the sweet spot of HSA there to our business on cross-selling HSAs into the Wedge book, but we still got a lot of wood to chop when it comes to crossing CDBs back into our kind of legacy HealthEquity, but even though we don't use that language really more around our shop. And so there's just a lot of opportunity. We're just kind of getting started. And just as we're getting rolling and total happen and so it kind of sloping down.\n\nBut on our sales huddle today, Jon was on it, I was on it, a lot of huge amounts of activity and quite a bit of it is now starting to see that cross-sell into our really strong long-tenured HSA customers, things like the CDBs, LSAs, HRAs, things like that. So we're pretty excited about it.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nI mean all that having been said, I mean, HSA is going to continue to outgrow this. So I want to be clear about that, right? HSA is where is the growth driver of this business. It's just that if you kind of say, well, that's great. Now if I can just have this thing contributing a single-digit number, right, that's not a zero, right, that's black, you're in really good shape.\n\nThat's really the way to think about it.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nOK. And is that -- is this -- the bundle is the new normal, the cross-selling opportunities, is that the case across all client tiers? Or are there nuances here where large employers are maybe approaching is a little bit different than medium-sized and small-sized?\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nThe smaller the employer, the more likely you are to see it bundled [Inaudible], particularly that like not quite tiny, but that 500-person group that Steve mentioned earlier. Also, my phone/watch/everything blew up. I'm sorry, a fellow Gator Nation. Tom Petty is from Gainesville, and it's still been 13.7 billion years since the last time Utah beat Florida.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nAll right. Thanks again for the help here.\n\nOperator\n\nThank you. Our next question comes from Cindy Motz with Goldman Sachs. You may proceed.\n\nCindy Motz -- Goldman Sachs -- Analyst\n\nThanks for taking my question. I really appreciate it. So you guys have given some really good detail about the revenues and everything. But just in terms of quantifying maybe with the absolute growth rate down the road, do you think it grows at like single digits? Or is it mid- to high single digits like Devenir? And then I had a question, too, on gross profit, Tyson, just with the service gross profit, like should we expect to see that you made some good progress this quarter.\n\nLike is that going to stay in the range of like maybe 27%, 28%? And then where can it go from there? And then just lastly, with EBITDA margin. Congrats on raising the guidance on EBITDA and revenues. But just curious because it still is off from last year, where do you see it going? And obviously, it depends on the mix shift with custodial taking over, it will probably go up. But if you could give us any guidance like even at mid-30s, like where you see that going, all that would be helpful.\n\nThanks.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nWhy don't I do top line and you go from there? How does that sound?\n\nTyson Murdock -- Executive Vice President and Chief Financial Officer\n\nSounds great.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nThere was a lot there. So from a top line perspective, a way to look at it, Cindy, is that ex the COBRA subsidy, top line revenue on a year-over-year basis relative to what was a -- in other instances, still a strong Q2 last year was up double digits. We're actually up 9%, take the $10 million from COBRA and you're up -- I don't know, what is it, 12% to 15%. That sounds good.\n\nI don't think the top line is going to consistently grow -- well, let's say, we have not suggested that top line is going to grow 15% year over year out into the terminal period. But we do have -- what we have said for a while is -- and obviously, we had acquisition growth and so that helped certainly. But from my perspective, I think we have a couple of things that ultimately will help us from a top line perspective. The first is -- and I mentioned this in the prepared remarks and on an earlier question, is the health of the HSA business itself, which is, again, pushing somewhere -- lined up somewhere between 60% and 70% of total revenue this year, right? And the fact that that business itself, for us, has been growing double digits and grew double digits here.\n\nAnd we're sort of just getting started in terms of the benefits of the rate cycle in that and then also the benefits of our migration -- we use that, probably you shouldn't use that word, our offering and our members' adoption of enhanced rates. And Tyson mentioned it's kind of interesting. I'm like that's it and said, well, so we're up, what, three basis points from this time last year. Now that's pretty good considering when we started the year, that wasn't our plan, right? And a few years ago, people were like, when you get to that fiscal '23 as the bottom going to drop out of rates.\n\nSo obviously, we feel pretty good about that. But it's -- we're just getting started in terms of those benefits. So I think that's the first reason to feel the HSA business at core is the first reason to feel good about the growth opportunity. The second, I think, again, it just boils down to if the ancillary businesses can contribute a black single-digit number, that will be very helpful, and they should be able to do that.\n\nAnd if I put those two together, obviously, you're going to end up in that kind of give or take 10% range. And then lastly, I would say is -- and this is where I'll turn to Tyson, notwithstanding the fact that we want to deliver more for you from a margin perspective, and we think we can, we're generating good cash. There were questions at the end of the first quarter, if you recall, from a cash flow operation perspective, first quarter wasn't as great. Second quarter was really strong.\n\nAnd ultimately, that cash will be reinvested in the growth of the business. So that, too, that's sort of the way to look at it to the extent that we're able to fund those smaller inorganic opportunities or smaller investments in organic growth, that works out pretty good. So all of those are reasons, I think, to be fairly optimistic about the long run top line of the business. And -- but now I'll leave to Tyson to do the hard part.\n\nTyson Murdock -- Executive Vice President and Chief Financial Officer\n\nYeah. Now how do we turn it into profit? I appreciate the question the way you asked about service margins. Just to reflect on full year performance [Inaudible] I'm going to just keep on going even though our [Inaudible] is down. So the margin is very high.\n\nThe same is true with interchange. Those are contract-based costs. There's our treasury and banking ops team that's in there and a few other people, but it scales very well. So you have those as drivers and the rate, particularly as the biggest driver gross margin.\n\nBut the real work and where most of the people in our organization are focused and where the people that are in our organization where their costs are in that service cost line item. And so really garnering efficiency there when you think about trying to reduce contacts, but still have great service. When you think about the platform migrations that we've made and the technology improvements that we'll make over time, putting those efficiencies in there and actually getting them into a volume forecast that we have less people in there serving at a better rate is the way to improve that. And I think we can, we will improve that service margin over time.\n\nNow if you look at the service margin and the EBITDA margin, they're both up about 500 basis points sequentially. They kind of go together because the rest of it is kind of moving along. But I think we can still make improvement there. So watch for that.\n\nAlso the further synergies we've already talked a lot about that, but that's another thing that will come in overtime and help improve those margins. And then I go back to kind of one of our original statements, which is we're going to -- when it comes down -- we're going to try to grow EBITDA margins a little faster than revenue. So Jon talked about revenue. And when you have interest rates at the right into the scale, that's what helps us to accomplish that.\n\nAnd so now like another person had asked, I think it was Sandy, those interest rates are higher than they were back in '19. We've actually changed the way that we monetize the custodial assets when you think about enhanced rates and other things that we've done to improve the way we monetize. So not only do we have the higher rates, we're going to be -- we do it in a better way, and we've changed the structure of the business to do that. So I am optimistic about being able to improve margins and continue to have that tailwind over the course of the subsequent years here.\n\nCindy Motz -- Goldman Sachs -- Analyst\n\nGreat. That's very helpful. Thanks a lot.\n\nOperator\n\nThank you. Our next question comes from Mark Marcon with Baird. You may proceed.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nGood afternoon. Thanks for taking my questions. Just curious a little bit about the fall season coming up and what you're -- how you're thinking about that, particularly in terms of some of the initiatives around medium-sized enterprises and just the approach that you're going to take. And if there's going to be any sort of changes with some of the -- being part of the team anymore.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nSo a couple of thoughts. Thank you, Mark, for the question. But let me start with where you finish there. So as I said on the -- in the introduction and it was sincere, Ted's helped us and supported the team and its mission through a lot of hard operational stuff.\n\nAnd he's going to be extremely successful wherever he goes. And so our focus during this period is -- and we have our longtime veteran Brad Bennion, who stepped up and is serving that role on an interim basis. And Brad's been with the company longer than I have 16, 17 years, and just knows everything. And Brad's focus really is on delivering for our clients, for our members and for our team and for also our fellow team members, a really outstanding peak season, right? We internally -- Angelique Hill, who runs operations, is trying to get us to rename it growth season.\n\nIt hasn't stuck yet, at least with me. But I'm working on it with Angelique. But we think that this is -- the best thing we can do from the perspective of growing our business long term, of taking care of our teammates long term and frankly, cementing the impression that our brand has because what I see in our industry right now is a lot of people are running around, trying to do all kinds of stuff to kind of -- I don't -- it sounds a little bit raggy, I don't mean it this way, but to kind of catch up with some of what we've done, whether it's enhanced rates or being able to -- or having a bundle or whatever. And a lot of the -- it all sounds good when you're selling it.\n\nIt's harder when you have -- where the poop hits the fan is when you get to that peak season. And so we feel like where as some of our competitors, including established competitors are going to struggle there, we have the opportunity having kind of been through that to deliver a truly differentiated experience for everyone, for the brokers, etc. And so honestly, Mark, that's probably -- we try to do that every year, of course. But I think, in particular, with -- in this period, this for us is everything we're talking about, every -- we're -- I was going to say to you, we're like, for example, I'll be in Milwaukee on Wednesday talking to and listening to our teammates.\n\nWe have a couple of hundred teammates in Milwaukee and where you are and -- or where you are sometimes. And all we're going to be talking about is the baseball game. Now all we're going to be talking about is really about having an outstanding peak season for all involved. And I just think that's the best thing we can do in the near term.\n\nBeyond that, the other thing that I would read from the broader moves we're making, and you can see this if you -- anyone who observes broadly the personnel changes that we've made over the last year and we'll continue to make, this should become apparent is that we really believe that whereas the healthcare and benefits industries tend to be slower adopters of technology that we are starting to see very -- in relative terms, rapid adoption of things like API-driven workflows and the like, that really play to our advantage as a partnering organization versus a closed garden organization, kind of a walled garden. And nothing wrong with wall gardens as we've discussed in the past, but that's not our ship. And so if you look at what we're doing, we're trying to, for lack of a better term, tilt the organization to have a greater focus on taking those technologies that we now have available that our partners and clients are now more interested in deploying them more widely, and the effect of that is going to be twofold. First of all, it allows us to be a better part of threefold.\n\nIt allows us to be a better partner, it allows us to partner more deeply and sell our services and have them consumed at different places, and we've talked about that a little over the course of the year. And then lastly, it allows us to be more efficient from a servicing perspective because, for example, I look at -- we made a commitment and then I'll be done with this. We made a commitment two years ago to bring all of our live voice work onshore. We thought it was the right thing for our customers and the right thing for our country, and that was not a cheap choice to make.\n\nBut that having been said, one of the ways we're able to -- we are increasingly able to offset those costs and will be more so in the future is that you have more activity that's going on using chat, using AI, using technology to get people to the right person as opposed to a more generic person. And all that ultimately shows up in better service and then ultimately lower service costs as well. So I guess, generically, I would say a little bit of a tilt within the company toward using the technology skills that we have and our unique position as a partnering organization among the leaders in our industry to really drive that competitive advantage is what you should expect to see. So short term, peak season, longer term, a bit of a tilt toward using tech to really drive the competitive advantages we have.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nTerrific. Jon, thanks a lot for the thorough response. I appreciate it.\n\nRichard Putnam\n\nThanks, Mark.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nWednesday, Milwaukee Brewers, be there. I'll buy you sausage if I'm allowed to do that, if you're compliance people let me do that.\n\nOperator\n\nThank you. And I'm not showing any further questions at this time. I would now like to turn the call back over to Jon Kessler for any further remarks.\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nWell, an hour and 39 minutes, that may be a record. I'm not sure when we want to repeat, but with some interruptions, Thanks, everyone, for being patient with the technical difficulties that our connectivity provider had today. And I was just kidding about the other firm, the firm that sponsored this conference, they had nothing to do with it. And I don't say that just because they're supposed to buy me dinner later.\n\nBut again, thanks, everyone. We do feel like we reported a really strong quarter. We do feel, as you can hope tell here, like there's more work we can do to correct on some of these revenue efficiency issues on the CDB side and -- but we can do those things, and I was saying this was added it out earlier. I really do think we're in a position over the next few years to report spectacular results to you, and we look forward to actually showing you that.\n\nThat's it. Bye-bye. See you later.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRichard Putnam\n\nJon Kessler -- President, Chief Executive Officer & Director\n\nTyson Murdock -- Executive Vice President and Chief Financial Officer\n\nC. Gregory Peters -- Raymond James -- Analyst\n\nAllen Lutz -- Bank of America Merrill Lynch -- Analyst\n\nStephanie Davis -- SVB Leerink Partners -- Analyst\n\nDave Larsen -- BTIG -- Analyst\n\nGlen Santangelo -- Jefferies -- Analyst\n\nStan Berenshteyn -- Wells Fargo Securities -- Analyst\n\nSteve Neeleman -- Founder and Vice Chairman\n\nSandy Draper -- Guggenheim Partners -- Analyst\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nCindy Motz -- Goldman Sachs -- Analyst\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nMore HQY analysis\n\nAll earnings call transcripts"
}