{
  "companyName": "AiHuiShou International Co. Ltd.",
  "companyTicker": "RERE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/24/aihuishou-international-co-ltd-rere-q2-2022-earnin/",
  "content": "AiHuiShou International Co. Ltd. (RERE -1.36%)\nQ2 2022 Earnings Call\nAug 24, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning and good evening, ladies and gentlemen. Thank you for standing by, and welcome to ATRenew Inc. second quarter 2022 earnings conference call. [Operator instructions] Please note, today's event is being recorded.\n\nI would now like to turn the call over to the first speaker today, Mr. Jeremy Ji, director of corporate development and investor relations of the company. Please go ahead, sir.\n\nJeremy Ji -- Director of Corporate Development and Investor Relations\n\nThank you. Hello, everyone, and welcome to ATRenew's second quarter 2022 earnings conference call. Speaking first today is Kerry Chen, our founder, chairman, and CEO; and he will be followed by Rex Chen, our CFO. After that, we will open the call to questions from analysts.\n\nOur second quarter 2022 financial results were released earlier today. The earnings release and investor slides accompanying this call are available at our IR website at ir.atrenew.com. There will also be a transcript following this call for your convenience. For today's agenda, Kerry will share his thoughts of the quarterly performance and business strategy, followed by Rex, who will address the financial highlights.\n\nBoth Kerry and Rex will join the Q&A session. Let me cover safe harbor statement. Some of the information you'll hear during our discussion today will consist of forward-looking statements and I refer you to our safe harbor statements in the earnings press release. Any forward-looking statements that management makes on this call are based on assumptions as of today and that ATRenew does not take any obligation to upgrade our assumptions on these statements.\n\nAlso, this call includes discussions of certain non-GAAP financial measures. Please refer to our earnings release, which contains a reconciliation of non-GAAP measures to GAAP measures. Finally, please note that unless otherwise stated, all figures mentioned during this conference call are in RMB and all comparisons are on a year-over-year basis. I'd now like to turn the call over to Kerry for business and strategy updates.\n\nKerry Chen -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Hello, everyone, and thank you for joining us on our second quarter 2022 earnings conference call. During the second quarter, we faced unprecedented challenges to our operations in the most complex external environment since the pandemic first occurred at the beginning of 2020. First of all, let's take a look at our business segments at the city level. The core 1P reception business locations, including Shanghai and Beijing, were adversely impacted by the pandemic, especially in Shanghai as the city endured COVID control measures for two consecutive months.\n\nOur physical stores have suspended the operations for implement strict COVID prevention measures, which puts consumers off. The control measures also resulted in interruptions in door-to-door recycling and logistics. Our merchant users also had operational difficulties brought by the pandemic and the relatively weak consumer confidence in electronic products. Our employees at the Shanghai headquarter started to work from home from March 15th to June 1st.\n\nDuring this period, we proactively fulfilled our social responsibilities by ensuring our employees were supplied with daily necessities and were able to work effectively. We also took care of the mental health of our employees. As people's daily life in Shanghai returned to normal in June and the June 18th grand promotion kicked off, our 1P business got on a fast track of recovery. By successfully overcoming the multiple adversities we faced during the second quarter, we have demonstrated the overall resilience of the circular economy.\n\nAs a result, our total net revenues increased by 14.9% year on year to CNY 2.15 billion in the second quarter of 2022, exceeding the high end of our revenue GAAP guidance. The quarter-over-quarter decline in revenue was mainly attributable to the impact of the pandemic. Now let's take a more detailed look at our 1P recycling business. In April and May, the COVID control measures in Shanghai and Beijing resulted in a temporary suspension of one-third of our self-operated AHS stores, dragging the growth of our 1P business to a low point.\n\nHowever, on recycling, our 1P business rapidly recovered to the same level as last year at the beginning of June. During the first 10 days in June, GMV for preowned devices recycled by HHI Recycling in Shanghai increased by 11% compared to the same period of 2021. On distribution, we continue to lean into the retailing of our sales force premium products on Paipai Marketplace, where the GMV for the 1P B2C segment increased by 32% year over year despite the challenging environment in the second quarter. In terms of our platform business, multiple aspects of the business, including recycling activities of our merchant users, shipment to our operation facilities, pickup and ship-out activities of goods at our operation centers, safety inspection, and logistics phase challenges brought about by the COVID resurgence.\n\nIn the second quarter, we managed to achieve an increase in the overall take rate through our continued effort in keeping our merchant users happy and providing differentiated transaction support. We adjusted the role for charging logistics fees from PJT market users and optimized our platform regulations and inventory management for Paipai Marketplace. As a result, the overall take rate of our marketplaces grew slightly to 4.54% in the second quarter, representing an increase of five basis points year over year and 39 basis points sequentially. By the end of the second quarter, the number of registered merchants exceeded 330,000, representing a year-over-year growth rate of 41%.\n\nWe believe our merchant users will eventually navigate the short-term challenges brought by COVID and that they have the long-term potential for scale expansion, which will, in turn, enable us to grow our monetization capabilities. Turning to our expenses. We reacted swiftly to the quarter's challenges and managed our operating expenses prudently. However, I would like to clarify that we continue our investments in core capabilities, including 1P multi-recycling and automated inspection technology.\n\nIn the second quarter, we had some losses due to the pandemic. However, our non-GAAP operating margin has narrowed to negative 2% from negative 2.7% in the same period last year, and our non-GAAP net margin has narrowed to negative 0.6% from negative 3.2% in the same period last year. We also improved our capital management. As of the end of the second quarter, our total cash reserve was RMB 2.59 billion, an increase of CNY 170 million compared to the end of 2021, even when we spent $31.5 million to buy back our shares in the first half of 2022.\n\nOf note, cash inflow from operating activities was approximately CNY 280 million, representing a second consecutive quarter with positive operating cash flow. The improvement in monetization capabilities and operating cash flow will safeguard our sustainable development while solidifying our competitive advantages in an evolving market condition. Although the macro challenges continue, as the scale of the pre-owned consumer electronics market continues to expand against the backdrop of a stable circular economy policy outlook, consumer demand for recycling services and consumer electronic product purchases will continue to increase. As you can tell from our previous earnings conference call, ATRenew keeps a clear and consistent strategic road map we see is quite stable.\n\nIn the second half of this year, we are committed to investing in the foreign pivotal areas. First, we will continue implementing our city-level service integration strategy, solidifying our business foundations and increase the penetration rate. This quarter, we further upgraded our front-end organizational structure, dividing the domestic market into 4: Northern, Southern, Eastern, and Central markets. Furthermore, we connected some of the pilot cities with the surrounding lower-tier cities, strategically forming 43 city clusters.\n\nWe also launched our regional manager system, promoting outstanding employees from both C2B and B2B business lines, thus realizing a leap forward in talent management capacity. We found the title and reward of regional managers with the business performance, GMV revenue, and growth rate of each quarter. We also improved our talent selection process as well as our training and remuneration system. Looking back at the consolidated GMV for C2B and B2B offerings in the second quarter of 2022, 33 out of the 43 city clusters grew faster on a year-over-year basis compared with the national average, and 23 city clusters successfully outpaced the national average expansion speed of the recycling penetration rate compared with the first quarter of 2022.\n\nThese results strengthen our confidence in advancing and executing our city-level service integration strategy. Second, we will upgrade the AHS recycle rent and accelerate our pace of category expansion in terms of recycling. AHS Recycling is a high-quality brand that is scarce in the recycling industry. The brand is quite capable of expanding its service scope.\n\nMany users often ask whether they can recycle luxury goods or home appliances, etc., at our AHS stores. In the second and the third quarter, we selected over 30 stores in Shanghai and Beijing as pilot stores, most of which are located in the subcenters of the cities. We upgraded the store branding and train the store staff. Then these stores offer even premium recycling services and open up for high-value products such as luxury goods, photographic equipment, and gold.\n\nTaking luxury group as an example, consumers can now make appointments online for an in-store consultation where our staff will take pictures of the product conditions for merchant leading at the back end. If the consumer is satisfied with the final bid price, which will be our recycling price, the product will be sent to a quality inspection center through intra-city instant delivery for authenticity and quality evaluation. Once the product is verified authentic, the consumer will get a great amount of cashback instantly. If it's, counterfeit, we will return it to the consumer.\n\nWith shopping malls in Shanghai we opened in June, the number of luxury goods pilot cities stores jumped to over 20 and reflecting orders increased rapidly. From June to August, the total monthly reflecting value of luxury goods in Shanghai continued to grow at 50% sequentially. In addition, six of our pilot stores in Beijing and Tianjin collaborated with industry-leading partners to launch a photography equipment recycling business, increasing the compared monthly transaction value by RMB 300,000 per store. Now we are even confident in category expansion after testing the water.\n\nOn one hand, we see the underserved need for categories other than electronics during a period of flattening economic growth and when consumers composed of buyers. On the other hand, AHS Recycled, the brand name, is a valuable asset while not limiting the product category to mobile phones, and our nationwide AHS stores are premium consumer touch points. Through recycling more categories, we broaden our business horizon and improve both user retention and repurchases, further elevating the brand value add of AHS Recycle. We understand that there are many retail channels while good brands are scarce.\n\nRelying on our solid capabilities, we are confident in building AHS Recycling to the most popular brand. Third, as compliant refurbishment capacity ramps up, we expect further widening of the profit margin of the value chain. In April, the People's Procuratorate of Shenzhen published a compliance guidance for intellectual property rights in the electronics refurbishment industry. Under the compliance refurbishment guidelines, we provide more high-quality products to consumers through our value-added refurbishment services, further improving our margins.\n\nDuring the first half of 2022, we have performed value-added refurbishment services on around 70,000 devices. As we expand our capabilities and plenty sources of supply that are still for refurbishment, we expect to have a more exciting ramp-up in capacity starting in the second half of this year. We expect 75,000 orders, which will generate a GMV of RMB 130 million in the third quarter, each increasing by over 80% compared with the second quarter. We expect a 15% gross margin, the same as we anticipated during the previous earnings call.\n\nOverall, the operating margin of the refurbishment business is expected to be around 4% to 5%. Fourth, we will continuously deploy automation to prepare our operational capacity for post-pandemic recycling volume and consumption recovery. Due to the COVID resurgence, the automation upgrade of our Dongguan operation center got delayed. By the end of June, our Dongguan operation center completed the construction of its conveyor system, which was later connected to the storage system in late July, realizing a 50% efficiency improvement.\n\nAs an update, we now expect to land the Matrix 2.0 system by the end of the third quarter, thus completing our second automated operation center in China. Overall, we learned to stay nimble and positive from the transitory challenges. We keep being operationally vigilant and keep advancing our core capabilities. We aim at more robust and risk-resistant unit economy in the long run, along with the developing circular economy.\n\nWe are committed to getting ourselves well prepared. Looking at the second half of the year, we will strive to accelerate the recovery of our business. In particular, the growth rate of self-operated recycling in direct retail. Our 1P business maintained profitability and healthy growth in face of the unfavorable pandemic and downward consumption trends.\n\nAmid uncertainties in the future quarters, we will focus on the solid development of our 1P self-operated business. The iPhone 14 lineup will be launched at an earlier date in September. We will prepare ourselves well for a recovering business from frontline recycling and trading to quality inspection and processing as well as back office operations. Last but not least, this summer has been a scorcher across the globe, especially in North America, Europe, and Asia.\n\nShanghai has repeatedly declared red alert on extreme heat of over 40 degrees Celsius, and many parts of China have also seen record-high temperatures. Global warming and drought are increasingly severe and pressing. In June this year, ATRenew published its 2021 environmental, social, and governance report. In this annual ESG report, ATRenew adopted a life cycle analysis of preowned mobile phones and leveraged its circular footprint formula for the first time to disclose its contribution of 464,000 metric tons of greenhouse gas emission reductions through the reuse of preowned mobile phones in 2021.\n\nThis is equivalent to the annual harnessing of 2.3 million of CT forest. On average, resecting and reusing of smartphones contributes 30.4 kilograms of GHG emission reduction. Our environmental performance is even more exciting compared with the economic value we created. Even if the business fluctuates and our stocks are undervalued in the short term, we will remain steadfast because we know that we are doing the right thing and doing something that contributes to the environment.\n\nOur value accumulates over time. With that, I will hand the call over to Rex, our CFO, to go over the financials.\n\nRex Chen -- Chief Financial Officer\n\nThanks, Kerry, and hello, everyone. We are pleased to report that our second quarter revenue exceeded our previous guidance despite the macroeconomic headwinds and the dynamic operating environment caused by the COVID recurrencies. I will start by sharing some of our financial highlights before we go into a more detailed look at the numbers. Please note that on amounts are in RMB and our comparisons are on a year-over-year basis unless otherwise stated.\n\nIn the second quarter of 2022, our core teams in Shanghai headquarter and Beijing navigated a challenging operating environment mainly caused by COVID resurgence. But they managed to surpass our top line guidance provided last quarter. Total net revenues increased by 14.9% year on year to over RMB 2.1 billion. We would like to extend a heartfelt thank you to our dedicated employees who stayed strong and quickly adapted to such dynamics.\n\nIn terms of total GMV, it grow by 10.3% to RMB 8.6 billion, driven by the growth in both product sales, GMV, and online marketplace GMV, which were 15.8% and 8.5%, respectively. Starting in June, a shopping mall in Shanghai opened and logistics capacity normalized. We saw recovering GMV and sourcing rebound during the June 18th shopping festival, primarily supported by our loyal customers. In this quarter, the commission rate of our third-party marketplaces was 4.54% at the group level, remained stable compared with the same period last year, while it's reasonably increased by 39 basis points sequentially.\n\nThis increase in the overall marketplace take rate was primarily due to an optimized operational strategy of charging logistics fees from merchants users based on the established trust and user stickiness. Gross margin at a group level was 22.9% in the second quarter. Gross margin for our 1P business was 10.8% in the second quarter in response to regional operation interruption, in particular in Shanghai, the national hub of our profitable 1P business. We implemented stress cost control measures.\n\nThis helped us narrow our losses in both GAAP and GAAP measures compared with the same period last year. I will elaborate on this later. Now let's take a detailed look at the financials. In the second quarter, total revenues increased by 14.9% to RMB 2,145.7 million.\n\nNet product revenues increased by 15.6% to RMB 1,854.1 million, while net service revenues increased by 10.3% to RMB 291.6 million. Growth in net product revenues was primarily driven by an increase in the sourcing volume and the corresponding sales of preowned consumer electronics through Paipai Marketplace and the company's overseas channels. Growth in service revenues was primarily driven by the increase in transaction volume and the monetization capability of PJT Marketplace. Besides the adverse impacts from COVID control measures in Shanghai and Shenzhen, I also want to bring to your attention that we have procured parts and components in the second quarter of 2022 as we started rolling out our compliant refurbishment business.\n\nThis innovative business led to higher day sales of inventory, and we expect this business to optimize our profit profile in the future. Next turning to our operating expenses to provide greater clarity on the trends in our actual operating expenses. We will also discuss our non-GAAP operating expenses, which better reflect how the management views our results of our operations. The reconciliation of GAAP and non-GAAP results are available in our earnings releases and the corresponding Form 6-K furnished with the SEC.\n\nOperating costs and expenses decreased by 2.2% to RMB 2,327.4 million. Non-GAAP operating expenses, which exclude share-based compensation expenses and amortization of intangible assets resulting from business acquisitions, increased by 14.5% to RMB 2,201.5 million. Merchandise costs increased by 18.5% to RMB 1,653.8 million. This was in line with the growth of the 1P product sales revenue.\n\nFulfillment expenses decreased by 0.1% to RMB 275.2 million. Excluding share-based compensation expenses, which we will refer to as SBC from PR, non-GAAP fulfillment expenses increased by 14.9% to RMB 267.7 million. And the non-GAAP measures, the increases were primarily due to, first, the increases in operation center and self-operated store-related expenses, which were in line with the increasing sales of prolonged consumer electronics and the addition of 103 self-operated AH stores compared with the second quarter 2021; and the second, an increase in personnel cost in connection with the company's growing business. The non-GAAP fulfillment expenses as a percentage of total revenue remained flat at 12.5% compared with the same period last year.\n\nSelling and marketing expenses decreased by 7.2% to RMB 293.4 million, excluding SBC expenses and the amortization of intangible assets. Non-GAAP selling and marketing expenses decreased by 7.3% to RMB 198.1 million. Other non-GAAP measures, the decreases were primarily due to the decrease in sales promotion and coupon expenses as a cost control approach during the resurgence of the COVID-19 variant. Among the cost reductions, we saved RMB 33 million on Paipai's promotion expenses, which were mainly due to our shift in strategy and focus from the consignment model to 1P2C direct retailing.\n\nSo non-GAAP selling and marketing expenses as a percentage of total revenues decreased to 9.2% from 11.4% in the second quarter of 2021. General expenses decreased by 85.4% to RMB 45.2 million. Excluding SBC expenses, non-GAAP G&A expenses increased by 2.1% to RMB 28.8 million, primarily due to an increase in office-related expenses, which was in line with the company's growing business. So non-GAAP G&A expenses as a percentage of total revenues remained flat at 1.3%, compared with 1.5% in the same period last year.\n\nTechnology and content expenses decreased by 27.1% to RMB 59.7 million. Excluding SBC expenses and amortization of intangible assets, non-GAAP technology and content expenses increased by 0.6% to RMB 53 million under the GAAP measures. The increase was primarily due to the increases in operation center and automated inspection system upgrade-related expenses in connection with the company's growing business. So non-GAAP technology and content expenses as a percentage of total revenues remained flat at 2.5%, compared with 2.8% in the same period last year.\n\nAs a result our non-GAAP operating loss was RMB 42.3 million in the second quarter of 2022. Non-GAAP operating margin was negative 2%, compared with negative 2.7% in the same period last year. And once again, we had a cash inflow from operating activities during this quarter which totaled CNY 280 million. As of June 30, 2022, cash and cash requirements, short-term investments, and funds receivable from third-party payment service providers totaled RMB 2.6 billion.\n\nSo sufficient cash on hand paves the way for sustainable growth in the future. As a recap, we announced a $100 million share repurchase program on December 28, 2021, out of the management's strong confidence in the company's solid fundamentals and growth momentum. During the second quarter of 2022, we have repurchased nearly 2.9 million ADSs in the open market for a total cash consideration of $9 million. Now turning to outlook.\n\nFor the third quarter of 2022, the company currently expects its total revenues to be between CNY 2,500 million and CNY 2,550 million. The highly transmissible omicron variant posted adverse impacts on the operation of our stores and facilities as well as the transaction activities of merchants in 2022. Thus, this forecast already reflects the company's current and preliminary views of the market and operational conditions, which are subject to change. This concludes our prepared remarks for today.\n\nOperator, we are now ready to take questions.\n\nOperator\n\n[Operator instructions] Our first question will come from Bonnie Liu with China Renaissance. You may now go ahead.\n\nBonnie Liu -- China Renaissance -- Analyst\n\n[Foreign language] Thank you, management. Given the lower-than-expected new phone production this year, could you please talk about the potential impact of early iPhone 14 release on your 3Q earnings? Thanks.\n\nKerry Chen -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] This year, Apple's iPhone 14 series is expected to be launched on September 7th, which is one week earlier than iPhone 13 lineup debut last year. It's basically within our expectations. From experience, such an earlier launch could bring in an increase in 1P revenue of RMB 30 million in the third quarter. This year, we are well prepared ahead of a peak period of trading business.\n\nOn one hand, the one-stop trading order process has been upgraded and incorporated into the main interfaces of JD's mobile app. At the new product launch, users can place orders through a streamlined process as the stability of the recycling and trading order system is more stable and user-friendly. On the other hand, through SIM campaigns Interline A+ membership, which is JD's self-operated Apple product store membership, with recycling services, we lock in the recycling and trading orders of JD users. This reduces the loss of trading orders as buyers tend to separate recycling orders with new device orders when a blockbuster iPhone out of stock.\n\nOur stores are also prepared for peak season fulfillment. There are over 1,600 physical AHS stores across 241 cities in China and nearly 600 self-operated stores. The frontline teams are rather experienced at handling peak seasons after many brand promotions and shopping festivals. In general, we handle the storage system well and fulfill orders in a timely manner.\n\nOn retail business, we anticipate the new product launch could have a short-term impact on the price and demand of secondhand devices in Paipai Marketplace. We work ahead for our campaigns and closely monitor our inventory. In fact, in the second quarter, we have reevaluated and liquidated the small amount of backlog of Paipai. We keep a controllable inventory turnover of our on 1P2C business.\n\nThank you.\n\nOperator\n\nOur next question will come from Ronald Keung with Goldman Sachs. You may now go ahead.\n\nRonald Keung -- Goldman Sachs -- Analyst\n\n[Foreign language] Thank you, management. I have two questions. One is, we've seen that GMV growth has slowed. So I want to know how are we seeing the overall industry, the impact from COVID, and the weak mobile phone demand due to product cycle? And how should we think about the secondhand market and the impact to our company? Second is about the gross margin decline.\n\nWant to hear -- want to know whether it's due to some of the promotions, subsidies? Or is it a mix in the 1P, 3P business structure? Thank you.\n\nKerry Chen -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Thank you for the questions. Before the second quarter, the year-on-year growth momentum of our GMV and total revenue stayed strong at a level of over 40% for a long period of time. During the second quarter, we faced temporary pressures from the pandemic mobile phone consumption slowdown. As we mentioned during the last quarter's earnings call, the COVID control measures disrupted orders and corporation of 200 self-operated AHS stores in big cities, including Shanghai, Beijing, Tianjin, [Inaudible], and Shenzhen as well as the logistics services and order fulfillment.\n\nTake Shanghai as an example. The store performance in April and May was largely impacted by COVID. Beginning in early June, the operation started to back to normal in Shanghai. And we believe that the impact of the pandemic is transitory.\n\nIn the long term, when compared with the other consumer industries that face greater challenges from macro environmental challenges, we believe the secondhand electronic transaction service industry is a huge yet underserved market. Since the beginning of this year, the domestic market for new electronic devices has faced pressure. This has been especially true in those cities that experienced declining sales as a result of COVID resurgence and control measures. However, in the long run, we remain optimistic about the outlook for recycling and purchasing on consumer electronics.\n\nHere are a couple of reasons. First, Apple is the main brand in our service coverage,; accounting for over 40% of our GMV. Apple maintains a top-tier market position. Its market share in China's high-end smartphone market continues to increase, as has been widely publicized.\n\nSo iPhone 14 lineup is due to be launched in September, so we have a positive attitude toward our recycling and trading business. In addition, our conversation regarding recycling and innovative partnerships with Apple continues. Second, as Android brands face greater growth pressures this year, we continue to strengthen our collaboration with JD.com and other major Android brands. Launching effective marketing campaigns based on our trading solutions, thereby providing consumers with more convenient, safe, and value-for-money trading services and improving new device sales for brand partners.\n\nIn the face of macro uncertainties, our total GMV increased by 28% year on year to RMB 18 billion in the first half of 2022 from RMB 14 million in the same period of 2021. The total number of transactions was CNY 16.2 million, increased by 14.4% year on year. This indicates that the circular economy business is relatively stable compared with the downward new phone shipments in the second quarter. In the first half of 2022, GMV product sales totaled RMB 4.4 billion, representing an increase of 32.4% year over year, which was softer than the overall GMV growth.\n\nThrough some optimizations such as improved efficiency of self-operated stores and more direct retailing of premium sales force products through Paipai, our 1P business will be able to achieve a stronger growth momentum.\n\nRex Chen -- Chief Financial Officer\n\nSo I will take the second question. So overall, gross margin at a group level for the second quarter was 22.9%, a decline of 2.37 percentage points on a year-over-year basis. This was primarily due to a decrease in 1P business gross margin, which was caused by, first, an increased number of promotion campaigns on e-commerce platforms; and the second adverse impact from COVID recurrence. In detail, the gross margin for our 1P business this quarter was 10.8%.\n\nThe decline in gross margin was due to the following increases: firstly, due to the pandemic recurrence in the second quarter we did not have sufficient self-source supplies to meet consumer demand. As a result, we increased the proportion of goods sourced from industry partners in preparation for the e-commerce stocking festivals in June. Sourcing from third parties lowered our gross margin. However, this was already a temporary tactic, and we increased the proportion of our self-sourced supplies as operators return to normal operations after June.\n\nIn addition, the gross margin for the second quarter was low, also due to the marketing and sales campaigns, including our 6.18 shopping festivals which we would distribute corresponding coupons. We expect that the impact of the pandemic will gradually peel away and that we will see growth in device refurbishments and our 1P2C business. The gross margin for our MP business in the second half of 2022 is forecast to be between 13.5% to 14%. The overall take rate of our 3P business in the second quarter increased to 4.54% from 4.15% in the first quarter.\n\nSo we anticipate a steady increase of both the platform area adding more value-added services on top of the current portfolios, such as value-added compliant repair services and the supply chain financing. Thank you.\n\nOperator\n\n[Operator instructions] Our next question will come from Joyce Ju with Bank of America. You may now go ahead.\n\nJoyce Ju -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language] I will translate the question. We have seen so ATP actually launched the luxury product recycle services recently. I just want to understand like what the progress of like expansion into other categories or like nonelectronic categories, the business -- what's the business rationale behind and how we should look at those kind of category expansion impact on our company's revenue and profits? Thank you.\n\nKerry Chen -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] In the second quarter, leveraging the tiered AHS store system, we selected the number of pilot stores in Beijing and Shanghai subcenter areas. In addition to our existing consumer electronics recycling, we test into preowned luxury banks, watches, photography and video equipment, and gold recycling services. Customers can gather price codes through AHS mobile app, official website, and [Inaudible] program. The recycling process for these preowned categories is similar to that of consumer electronics.\n\nConsumers get preliminary pricing shortly afterwards answering a couple of questions regarding the model and conditions of their products. They can then make a reservation of work into one of our offline stores. So our stuff can check product conditions and confirm the recycling price. Then the product will be sent to the local infection center within an hour through instant delivery.\n\nAfter all, quality inspection efforts confirm the authenticity of the product, the recycling process is complete and customers receive their payment if the product is authentic. The whole process is simple and user-friendly as we provide face-to-face interaction at our physical stores. Based on that, we can further extend our multi-category recycling offerings to users of JD.com. Whereas traditionally, there are many pain point for luxury goods recycling, the consignment merchants tend to cut prices as the market lacks transparency.\n\nConsumers have trust issues when recycling by mail. The door-to-door recycling model has higher labor costs. AHS new innovative offers the two-store recycling plus two-station inspection model. It allows consumers to get a price estimate online, go to a nearby physical store for condition check and get authenticity verification at the local inspection station.\n\nWe provide a more user-friendly customer experience. Over 85% of the consumers who accepted our recycling price were willing to try this model. We believe that there are two factors that contribute to the core competency and the competitive mode of our multi-category recycling business. The first is the brand of AHS Recycle, which has been cultivating customers over the past 11 years so that it is now a widely recognized brand among Chinese consumers.\n\nAHS Recycle becomes consumers go-to destination. When analyzing our trial operation data, we noticed that 57% of the users who recycled their camera equipment and 41% of those who placed luxury product recycling orders online have historical consumer electronics recycling others, proving the strong consumer mind share and our ability to cross-sell. The second factor is our nationwide network of over 1,600 off-line AHS stores. This network is a valuable infrastructure for us to reach, serve and build trust with consumers.\n\nFrom a financial point of view, luxury goods recycling is an emerging business. And its market size may be slightly smaller than that of mobile phone recycling, but the value chain is even opaque yet more profitable than mobile phones, while the existing solutions are relatively poor. Multi-category reflecting mainly brings about an increase in repurchases and an increase in average revenue per user. We have an idea that we could convert mobile phone recycling orders from luxury product users and vice versa.\n\nThis idea has been verified through our pilot program at more than 30 AHS stores. 41% of those who recycled luxury products have previously sold their consumer electronics to us. These consumers have stronger perceptions toward AHS Recycle and are more willing to trust us for high-value bags and watches recycling. In terms of repurchases, 11% of first-time luxury recycling service users sold their idle consumer electronics devices to us within 30 days.\n\nAs the repurchase rate increases, the efficiency of advertising is also expected to improve. Traditionally, we rarely advertise AHS Recycle as a consumer electronics recycling brand as electronic product is a low-frequency category and is relatively local-to-store business. Today, based on the wider store coverage and more transactions brought by luxury goods and other categories, we can reevaluate the ROI of advertising. We can try to amplify our brand awareness as well as our profit covers marketing expenses.\n\nIn general, we believe the key to developing our multi-category recycling business is to leverage the trust we have built with consumers and AHS Recycle service capabilities as well as the nationwide store network. There are many choices when consumers shop online and offline, but quite a few trustworthy multi-category recycling service providers. We are excited about the innovative course of our business is taking, and we look forward to enhancing our brand's reputation as the most trusted and recognized one in the industry. Thank you.\n\nOperator\n\nAs there are no further questions at this time, I'd like to hand the conference back over to our management for closing remarks.\n\nJeremy Ji -- Director of Corporate Development and Investor Relations\n\nThank you. Thank you all again for joining us. A replay of today's call will be available on our website shortly, followed by a transcript when ready. If you have any additional questions, please feel free to follow us at ir@atrenew.com.\n\nHave a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJeremy Ji -- Director of Corporate Development and Investor Relations\n\nKerry Chen -- Co-Founder, Chairman, and Chief Executive Officer\n\nRex Chen -- Chief Financial Officer\n\nBonnie Liu -- China Renaissance -- Analyst\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nJoyce Ju -- Bank of America Merrill Lynch -- Analyst\n\nMore RERE analysis\n\nAll earnings call transcripts"
}