{
  "companyName": "Mister Car Wash, Inc.",
  "companyTicker": "MCW",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/mister-car-wash-inc-mcw-q2-2022-earnings-call-tran/",
  "content": "Mister Car Wash, Inc. (MCW 0.87%)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to Mister Car Wash's conference call to discuss financial results for the second quarter of fiscal 2022. At this time, all participants are in a listen-only mode. Later, we will conduct a question-and-answer session, and instructions will follow at that time. [Operator instructions].\n\nPlease note, this call is being recorded, and a reproduction of this call in whole or in part is not permitted without written authorization from the company. I would now like to turn the conference over to Ms. Megan Everett, senior director of communications. Please go ahead, ma'am.\n\nMegan Everett -- Senior Director, Communications\n\nThank you. Good afternoon, everyone, and thank you for joining us today for Mister Car Wash's Q2 2022 earnings call. Speaking today are chairperson and chief executive officer, John Lai; and chief financial officer, Jed Gold. After John and Jed have made their formal remarks, we will open the call to questions.\n\nBefore we begin, I do need to remind everyone that comments made today may include forward-looking statements, which are subject to significant risks and uncertainties that could cause the company's actual results to differ materially from management's current expectations. These statements speak as of today and except as may be required by law. The company does not have any obligation to update or revise such statements as circumstances change. During this call today, management will also refer to certain non-GAAP financial measures.\n\nA reconciliation between the GAAP and non-GAAP financial measures can be found in the company's earnings press release issued earlier today and posted to the investor relations section of Mister Car Wash's website at ir.mistercarwash.com. With that, I will turn the call over to John. John?\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nThanks, Megan, and good afternoon, everyone, and welcome to our Q2 earnings call. Coming into the quarter, I think there were some concerns around inflation and whether or not people might start pulling back and get in the car wash, particularly with gas prices soaring above $5 a gallon, and of course, the huge comp we were going up against. What we experienced was that demand remains solid. However, there was a little bit of softness on the retail side of our business, but that was offset by the strength of our Unlimited Wash Club program, which is 65% of our revenues, where our members remained amazingly loyal.\n\nSince our beginning, over 25 years ago, we've been through various economic cycles, and what we've seen throughout is that in good times and in tough times is the American consumer deeply values keeping their car clean and at $10 a wash or $20 for a club membership, it's affordable, convenient, and brings people joy. And to that end, we feel very fortunate to be in a space that is so resilient. For Q2, I'm happy to report that revenues increased by 14% to $225 million. Comp store sales increased 2.4%, and we opened four new greenfield locations and acquired six new stores.\n\nWe added 59,000 net new members to our Unlimited Wash Club program, and year-over-year, we're up 20%. The real headline for UWC is that we didn't see any impact to churn, which speaks to the loyalty we've engendered. However, on the retail side of our business, we did see some softness that was in line with the expectations. And like almost everyone right now, we're experiencing some inflationary pressures in labor, chemistry, and utilities.\n\nI'll let Jed go into more details in a second on the cost side of the business. So big picture with sales remaining relatively steady and with some cost pressure, we are experiencing some near-term headwinds to margins. But, and this is important, we're not slowing down on making long-term investments in people, programs and in our stores because our focus has never been about maximizing margins in the near term. We're more interested in scaling our company with a long-term view given the incredible growth opportunity in front of us.\n\nBottom line adjusted EBITDA came in at $74.5 million, just slightly below our internal expectations. To remind everyone on the line today, our five strategic focus initiatives are: number one, to expand our footprint; two, to build out our teams; three, to digitally innovate and enhance our member experience; four, to develop the next generation of wash products; and five, make a sustainable impact in the communities we serve. So let me provide you a brief update on some of these initiatives. While we've been highly acquisitive over the years, our business has shifted to become less of a consolidation play and more of an organic growth story.\n\nThe eight stores we've opened so far this year are off to a great start, and our greenfield program has materially exceeded our expectations. We're planning on adding another 20-plus stores in the back half of this year, and are even more excited about 2023. We currently have over 100 greenfield projects in our pipeline that we expect to open in the next few years. We think the addressable market is still underserved in many markets and the opportunity to densify in each market that we move into is huge.\n\nOn the product and services side, we're planning on expanding our service offerings in early 2023 with the goal of rolling out the biggest extra service offering in the history of our company. When we pioneered HotShine almost two decades ago, it completely changed the customer experience. And with this new offering, we'll continue our long history of innovation. With respect to retail pricing, we plan on leveraging our pricing power by taking some modest retail price increases in Q3.\n\nAnd I'd like to remind everybody that our approach to pricing has been rather conservative. And we've always believed that rather than just taking price and justifying it by citing rising costs, we believe it's better to earn the right to a price increase by delivering exceptional value. On the sustainability front, in early 2021, we began piloting a water reduction and efficiency program in 15 stores in Salt Lake City. In our pilot, we were able to reduce freshwater usage by 30% by reengineering certain parts of our wash process.\n\nThe plan is to leverage these results and expand the water reduction program into new regions going forward. Last but not least, I was in our Florida market recently checking in on our teams on the ground. And as you know, we've doubled our footprint in Florida in the last six months, and the teams were knee-deep in the post-acquisition integration process. Without going into too many gory details, let's just say that integration is not for the faint of heart and to do it right, requires time, money and a whole lot of effort.\n\nI was thrilled to see the progress the team has made and I'm hoping I get ask questions during our Q&A on how we've transformed the culture and lifted the lives of our new team members. On another note, Florida, like many parts of the country is experiencing some intense heat right now. Consistent with our people-first ethos, our general managers are focusing on safety and wellness, making sure everyone's properly hydrated, handing out electrolyte packets, and giving people necessary cooling breaks. We hope that everyone on the line appreciates how difficult it is to work out in the elements and the steps we're taking to make sure everyone's safe.\n\nJed, I'm now going to turn it over to you.\n\nJed Gold -- Chief Financial Officer\n\nThank you, John, and good afternoon, everyone. We had a solid second quarter. And overall, we are pleased with the results. I would refer you to our earnings release for a more fulsome review of our quarterly numbers.\n\nRather than going through every line in typical fashion, I thought I would focus my comments on a few highlights and trends to help you better understand the business and what has changed since our last earnings call. First, on the demand side of the equation. Overall, demand for our services remain relatively consistent throughout the second quarter. While we don't talk about the individual months, all three months comped positive and June was our strongest comparable store sales months during the quarter.\n\nThe UWC subscription side of the business remained very steady. In line with our expectations, we added 59,000 UWC members in the quarter and 185,000 in the first half of the year. As John indicated, we did not see a meaningful change in our churn rates, and we did not see club members trading down from the platinum package to the base package in the second quarter. On the retail side of our business, we did see a moderation in volume trends that was in line with our expectations during the second quarter.\n\nAs we have discussed in the past, it's not uncommon to see some fluctuations in our retail volumes  based on external factors such as weather, pricing, seasonality and macro events. We also see an impact to this number as retail customers trade out of retail into the UWC program. Our retail business was very strong in the second quarter last year and benefited from a number of factors that made for a very difficult comparison in this year's second quarter. Early into the third quarter, we have not seen a material change to our churn rate or makeup of our UWC subscription business, but we have seen some continued deceleration in our retail volumes that are likely a result of the broader macro environment.\n\nThis, coupled with many macroeconomic outlooks, suggesting continued degradation during the second half of 2022 caused us to take a more cautious view on UWC membership growth, comparable store sales growth and total revenue in the second half of the year. On the expense side of the equation, we continue to see modest inflationary pressure across many areas of our business. And this, along with growth, investments in public company costs put some pressure on our margins in the second quarter. As a percentage of sales, adjusted cost of labor and chemicals increased 127 basis points.\n\nAdjusted other store operating expenses increased 101 basis points and adjusted G&A expenses increased 172 basis points. Collectively, our expenses did come in a little higher than we expected in the second quarter, and we have assumed a continuation of this trend in the second half of the year. The biggest increases are coming from growth initiatives as we continue to build our internal capabilities and vertically integrate in areas where it makes the most sense. Key areas of focus right now include marketing, IT, digital, real estate, building and construction, and training and development.\n\nGiven some of these trends on both the demand and expense side, and the macro uncertainties, we think it's prudent to be a bit more cautious on our outlook for the back half of the year. And our revised outlook for the full year calls -- the full year 2022 calls for comparable store sales growth of 3% to 5%, net revenues of $860 million to $880 million and adjusted EBITDA of $268 million to $278 million. A few other things to note. First, with the rise in interest rates and the ending of our interest rate hedge in October, we estimate our interest expense will be in the area of $42 million for the full year.\n\nThis, combined with an increase in our projected weighted average shares outstanding to $329 million, gets us to a revised adjusted net income per diluted share figure of $0.36 to $0.39 for the year. Second, we completed a sale leaseback on July 15 for total aggregate proceeds of $55.2 million. The timing of the transaction means we will begin to incur additional rent expense in the third quarter. This, combined with additional sale leasebacks likely later this year, will increase our other store operating expense line in the second half and is factored into our revised outlook.\n\nThird, we have lowered our capital expenditures outlook for the full year 2022 to a range of $235 million to $285 million from a previous range of $285 million to $315 million largely as a result of timing of projects being completed and favorability in our maintenance capex. Fourth, we remain comfortable with opening -- the opening of approximately 30 new locations this year, and as John said, have more than 300 properties in various stages of development within our greenfield development pipeline. While we are not looking to provide quarterly guidance, let me provide some high-level commentary that should assist you with your modeling. We are looking to open approximately 23 stores in the second half, with the majority of these being somewhat late in the fourth quarter.\n\nWith the opening of any new greenfield store, we incur preopening costs and a number of operating expenses right out of the gate, and it takes the store a few months to ramp up from a volume and revenue standpoint. The late fourth quarter timing of new builds will put some added temporary pressure on fourth quarter margins in the form of higher expenses and lower productivity rates. The other factor to keep in mind is the incremental rent from the sale leasebacks that we did in July and will likely do later this year. As a result of these, we think fourth quarter EBITDA margin could be a couple of points below third quarter.\n\nAs we have said, the performance of our new greenfield locations has been very strong and the opening of so many stores late this year puts us in a good position for next year as these stores begin to fully ramp, and we begin to better leverage some of this year's growth investments. In closing, I would also like to add my thanks and appreciation to all our hard-working team members who are executing the business every day and helping us fulfill our mission of being America's premier car wash. With that, I'll turn it over to the operator to begin the Q&A session. Operator?\n\nOperator\n\nThank you. [Operator instructions]. And the first question will come from Randy Konik with Jefferies. Please go ahead.\n\nRandy Konik -- Jefferies -- Analyst\n\nHey, guys. How are you? I guess, Jed, for you, any added color on the retail side of the business on just how severe the kind of deceleration has been? And any types of volatility or any color kind of you're seeing that is kind of subject to certain markets or certain income levels or anything like that, that we can kind of glean from on the data? And then I guess my second question would be talking about the modest price increases or highlighting those price increases, color on how much you're thinking on those price increases? Just trying to get a sense of how that can potentially offset some of the weakness in the retail side. Thanks, guys.\n\nJed Gold -- Chief Financial Officer\n\nYes, Randy. So like we talked about on the Q1, we've seen this trend of some continued moderation on the retail side of the business. We do have some very strong comparisons versus last year. The -- our theory is that the macro environment is putting a little bit of pressure on these retail volumes in the second quarter.\n\nAnd like we've talked about before, it's not uncommon to experience some short-term fluctuations in retail volume based on weather macro conditions, seasonality price increases, UWC conversions, et cetera. It's hard to look at this and say exactly how much is truly macro-driven, but it is likely a factor along with some seasonality. A percentage of our retail customers are likely washing their vehicles slightly less often. Our UWC business, though, does continue to be very resilient.\n\nWe've not seen a material change in UWC churn or mix shift between base and platinum. Second quarter retail, it was in line with our expectations. And as you had pointed out, we have seen that further deterioration in retail volumes. Given that retail is the funnel that feeds new UWC membership growth, a decrease in retail volume typically leads to a slight slowdown in UWC member growth.\n\nOur updated guidance accounts for all of these phenomenon. And then the second part of your question there is when you look at the total sales of the business across all income demographics, we're seeing growth across all income demographics. It's not as the one demographic is being impacted more than another. When we look at performance across all vintages, even our most mature locations continue to comp positively, which to us indicates that it's not any one in particular segment or demographic, everybody loves a car wash.\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nYes. Jed, if I could just add some color to Randy's question because I think it's a good one. Randy, we've been intentionally conservative from a pricing strategy standpoint, some could argue to a fault. But oftentimes, we're the last people in market to take price, and we're OK with that.\n\nBut if you look at the most recent increase that we've taken to, again, the smaller segment, the retail segment of our business, which is 35% of revenues, it is a very incremental modest increase. We are still at now with the price increase, the market median, which is roughly $10 for an express car wash and that price point is still very affordable and accessible to all segments, the motoring public.\n\nJed Gold -- Chief Financial Officer\n\nAnd, Randy, just to quantify that a little bit, it's about 75 -- or 70% of our core stores will receive a price change. And express price will increase about $1, interior clean, about $2. This puts us in line where in some cases, we're still behind the competition. And when raising retail pricing in the past, we have seen a modest decline in retail volumes but it's offset by a modest increase in UWC membership.  So historically, we've actually seen total volumes increase as you take that retail customer that comes in approximately three times per year and you trade them into UWC, that will wash approximately three and a half times per month.\n\nHowever, this current macro environment, it does make it a little bit harder to predict, but we expect this price increase to have a low single-digit impact to our comp store sales.\n\nRandy Konik -- Jefferies -- Analyst\n\nAnd then lastly, real quick, just on the guide, the change. How are you thinking about -- what factors are you kind of implying with the trend on REIT as well as expenses and UWC penetration? Can you just give us a little color on how you think about that guidance for that -- on top line and EBITDA?\n\nJed Gold -- Chief Financial Officer\n\nYes. So the high end of the guide, Randy, the 5% reflects -- so when you look at July, is in line with where we were in Q2 overall, but it was a slight moderation from where we were in June. And essentially, that's what we've factored in to get to the 5% is basically continued with slight deterioration in the second half of the year.\n\nRandy Konik -- Jefferies -- Analyst\n\nGot it. Thanks, guys. Really helpful.\n\nOperator\n\nThe next question will come from Simeon Gutman with Morgan Stanley. Please go ahead.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nHey, everyone. Jed, one quick follow-up. I take it that you're not going to quantify the sequential deceleration in the retail business? Or you're acknowledging that there is a sequential deceleration? Or is it on par with where we -- what happened in the first quarter?\n\nJed Gold -- Chief Financial Officer\n\nYes. So, Simeon, we're not going to quantify and talk specifics around volumes on the retail volumes and disclose that. But what I will say that just to give you some guardrails as you model this is that what's reflected in the guide in the second half of the year is a slight deterioration from where we are today, and then that gets us to the high end that we guided to, the 5%.\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nYes. Simeon, I think this is a tough environment for any business to try and gauge which direction the ball is going to bounce. And in the large -- I mean, you tell me, are we in a recession? We're definitely in a high inflation environment. But what we're seeing is that our business has been relatively recession-resistant.\n\nAnd again, there hasn't been a material impact to demand.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nFair enough. And, John, I may have missed this. You said we're adding a service next year. And then I heard you mention HotShine, but that one sounded like past tense.\n\nSo I may have missed it on the call, but can you talk about the addition? And then how does it flow through either pricing or membership because it sounded exciting, but I don't know if you've said much about it.\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nI intentionally did not say much about it, given the fact that this is broadcast of the universe. So we're going to keep that under our hat. There's a black box right now with dry ice that's building out of the sides. And I'm having fun when I say that, Simeon.\n\nBut we expect this new product to be revolutionary and continue with our track record of pioneering new extra services that have true efficacy, true value and really make the cars pop. So more to come in our next call.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nOK. I guess this is just a pure follow-up to it. I don't want to say much, but it's another tactic to which you're dealing with pricing power this current environment, meaning making sure that you're -- making sure the business is going to continue to grow profitably.\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nListen, at the end of the day, our goal is to continue to add more value, to provide more choices to our customers. And if you look at some other businesses where they have a black card, for example, and they're in a more elegant way trading people up to more profitable packages, you can read between the lines, and that is going to be our vision as well. So it's not necessarily a price increase, but it's a way for us to offer a more value-added service that will have all the bells and whistles in the package.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nFair enough. Thank you. Good luck.\n\nOperator\n\nNext question will come from Simeon Siegel with BMO Capital Markets. Please go ahead.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nThanks. Hey, everyone. Good afternoon. Hope summer's gone well.\n\nSo just to stay on retail if possible. You guys mentioned macro, anything you can share in terms of perspective on competition. And just thinking through that element, like thinking through what you've learned about price elasticity of retail, I know you've been conservative on the pricing. So as we think about taking price, but recognizing the comments around the softness in retail, it'd probably be helpful to think through how you're going to test that, how you'll react to how you'll flex.\n\nAnd then just you did note the happiness with UWC, so I want to stick on that a little bit. So maybe just give us a little bit of the way you think about the interplay between retail and UWC as a top of funnel. How do you think about the normal lag for conversion and then recognizing -- was there any notable conversion learnings this quarter, anything different? I mean, you got the UWC members, do they come from anywhere specific regions, demographics. I know there's a lot in there, but I think it would be helpful.\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nSimeon, consistent with your pattern, you asked 20 questions inside of one. Let me break down all [Technical Difficulty] but just let me respond at the highest level. So over the years, every time we've held breath and our taken incremental pricing move and have been concerned about the impact of volume, we haven't seen the impact of volume. And so we're hoping that this continues to play out.\n\nAgain, we're less obsessed about the competition, and we're more focused looking inward at the value that we're delivering. And we have built a brand that is known for speed, quality, and amazing customer service. It's less about price. I actually want to change the conversation away from price because I don't think our business is that price sensitive, to be honest with you.\n\nBut they are all fair questions, and I don't know if we have the answers to any of them. We launch and then we see how people respond. We can test until the cows come home, but sometimes you can over test and test can be very easily manipulated or affected by other variables. So to that end, we know that we have room.\n\nWe -- there's no hubris here. We're taking price just to take price. Again, we're the last people at the dance to make a move, sometimes to a fault but we'll take the move given the cost pressures that we're experiencing, we're kind of left with no choice. And we're pretty optimistic that's going to be accretive.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nCool. And then, Jed, it might just be helpful to talk a little bit of how you're thinking about cash flow, debt coverage, just levers you could pull if need be.\n\nJed Gold -- Chief Financial Officer\n\nYes. So currently sitting at about three times levered. And as we look at the $42 million of forecasted interest expense, we're very comfortable with satisfying any interest expense payments that we have coming up. If push comes to shove, Simeon, right, there's some capex, some growth investments that potentially we'd pull back on.\n\nBut listen, it seems unlikely at this point. As you recall, we used the proceeds from the IPO to pay down debt and lower our overall debt levels, which puts us in a good position from an overall leverage perspective. Also, as we've talked about before, through October of this year, we're currently sitting at about 60% hedged, which helped provide some protection, at least for half of the second half against the interest expense.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nGreat. Thanks a lot, guys. Best of luck for the rest of the year.\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nThanks, Simeon.\n\nOperator\n\nThe next question will come from Michael Lasser with UBS. Please go ahead.\n\nMichael Lasser -- UBS -- Analyst\n\nGood evening. Thanks a lot for taking my question. So if you roll back the clock, John, 90 days ago, you did talk about a bit more softness in the retail business back then. And now it seems like you're indicating that it's gotten a little worse.\n\nSo the key question here is how long do you expect this to last? And to what degree could it be exacerbated by some of the price increases that you're taking? Clearly, you've contemplated that as you thought about this move, but we would love to get some thoughts on how long this retail weakness is going to last.\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nYes. I wish I had a crystal ball to answer that question with more precision, but I don't. I will look though at gas prices. And again, this last quarter, when gas soared in California, it was north of $6.\n\nNational average north of $5. But we've seen sequentially week-over-week gas prices go down, which is good. And if that trend continues, I think it's going to have a positive impact on miles driven and folks getting their cars dirtier and wanting to come in and some additional change in their pocket to be able to afford. Again, as Jed mentioned, we have that segment, it's a very small segment of our customer base that is nonmember that is relatively infrequent.\n\nAnd we think that, that segment is the one that has probably been impacted, but we hope to get them back.\n\nMichael Lasser -- UBS -- Analyst\n\nMy follow-up question is, in 2020, you had an 18.5% operating margin. Last year, you had a 26% margin. This year, it's going to be lower. Under what circumstances would your profitability continue to move down next year? And at the same time, your interest is going up and your leverage is also -- has been consistently high.\n\nSo is there a risk that you'll have some constraints in your financial flexibility either to do bolt-on and M&A or open the number of new organic locations to maintain your growth rate?\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nYes. Let me start, and Jed, you can chime in. And I'm going to sound like a broken record here, Michael, but I just want to reiterate that we've never been in margin expansion mode as a primary strategy. We've been focused on growing our top line, growing the number of units making it for the long haul, and we're going to continue to stay on that track.\n\nThese near-term cost pressures, we're hoping are temporal. We are taking some pricing to offset some of the cost pressures. We have, quite frankly, some more ages in the hole, more stuff that we could potentially leverage that we could pull should we so choose. But we're not interested in dialing back on the investment side because that would affect our long-term growth outlook, and we're more interested in what we look like five years from now than what we look like in Q3.\n\nThat said, if things got worse, we would manage through this like we have in the past, and there are some tight new things that we could do that wouldn't impact the customer experience if we needed to. And so this is a management team that's  very seasoned, very experienced and runs a very tight ship and runs a very efficient and highly productive number of units out there. And for us, the top line sometimes cures all ills. But if we needed to, we can tighten up.\n\nJed Gold -- Chief Financial Officer\n\nMichael, from an adjusted EBITDA margin perspective, as we've said before, this -- that mid-to-low 30% range. Last year, during the first half, they were exceptionally high just given the high sales and the low variable cost nature of the business. When you look at the rightsizing of the business and the investments that we're making from a public company perspective, those will start to slow down. The other piece is because of the back-end nature of the new builds this year, we'll be able to leverage those new builds and those investments that we're making to get those open.\n\nAlso, as we continue to integrate Clean Streak, as we've talked about before, typically in acquisitions, we'll actually go half a step back, but then start to leverage some of the investments that we're making in year two and year three of those investments.\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nMichael, did you mean 26%?\n\nJed Gold -- Chief Financial Officer\n\nYes. And I think you were talking operating profit margins, Michael, when we're going to adjusted EBITDA margins, 30% to 35%.\n\nMichael Lasser -- UBS -- Analyst\n\nUnderstood. Thank you very much and good luck.\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nMichael, can we talk about our four-wall EBITDA margins?\n\nMichael Lasser -- UBS -- Analyst\n\nYes. And your culture, John, please.\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nListen, I mean, I'm actually starting to reflect back on -- I mean, early in our life, I had on our whiteboard, 20% net operating margins, let's get there. And we worked like feverishly to do that. And as we continue to -- I mean this is -- the margin profile of our business is awesome. And every time we give you guys more, you want even more.\n\nAnd I guess that's the game that we're in, but I just want to focus on the long-term growth.\n\nMichael Lasser -- UBS -- Analyst\n\nUnderstood. Thank you very much.\n\nOperator\n\nThe next question will come from Elizabeth Suzuki with Bank of America. Please go ahead.\n\nElizabeth Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you. So just one on the sustainability efforts. Can you just talk about any potential cost savings that you may have seen in the pilot program related to water reduction and whether that could be a source of margin improvement if rolled out to additional markets?\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nYes. To be honest with you, the objective was not driven by economics. It was more driven about what's the right thing to do for the environment and for this one world that we live in. So we have taken water conservation very seriously from the get-go at Mister Car Wash.\n\nAnd prior to even this pilot, we were very -- are very proud of the fact that we recycle and repurpose over 30% of the freshwater that we use on a per car basis already.  And so this is just another example of our ongoing commitment to further reduce our dependence on freshwater. The reality is water is actually relatively cheap. It's roughly $0.01 a gallon. So there is a dollar savings, but I'm a little reluctant to share those specifics with you on this call because it's a pilot, and we probably need more data points before we can say unequivocally what that number looks like.\n\nElizabeth Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nUnderstood. OK. And just as you continue seeking out acquisition opportunities in Europe against PE firms and others that are trying to consolidate the industry, how do you pitch the value proposition to the owners and employees of those acquisition targets? And if you can share any stats on retention or on EBITDA lift per location after the first year or two post acquisition, that would be great.\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nYes. Let me take the question, the last piece and then go forward from there. So we have had a really strong track record of buying good businesses and then making them better over time. And so the lift to EBITDA historically has been almost close to 30%, 40% in some cases in year three.\n\nBut we're staying on soft ground because it really depends on the type of business that we're acquiring. With respect to our value proposition and what we bring to the table, is a people-centric company. For those sellers that care about their legacy and that are interested in making sure that their baby, if you will, is in good hands and their team members, most importantly, are going to be taken care of. We -- through that lens, we typically are the acquirer of choice.\n\nIn more recent times, though, it's been more about valuation than it is about who's buying them and what that means for their team. And what we've shared in the past is that we remain very disciplined with respect to not overpaying for an asset. We want to make sure that we're focused on quality, not just adding the units to our pile. And we're going to maintain that discipline.\n\nSo that means we're not going to swing at every pitch and we're going to let certain deal opportunities go. We're already starting to see some deals get that are being marketed by investment banks or brokers getting busted because valuations just gotten a little too crafty and I think the smart buyers is now starting to say this is crazy with respect to all these.\n\nJed Gold -- Chief Financial Officer\n\nAnd, Liz, one thing I would add there. I mean, one of the things, right? And so due to the unpredictable nature of the acquisitions. This is where we're really optimistic about the greenfields that we're building out, and we're very, very happy with how they're performing. They're performing above our expectations.\n\nAnd as we look at the white space ahead of us, we've got just a little over 20% market share in the approximate 70 MSAs that we're currently in. This means that we could double our footprint in our backyard without moving into any new markets, which is really a good spot to be in, coupling that with the really strong unit economics. And just one clarification to my prepared remarks is that it's 100 greenfield projects in the pipeline, not through -- not 300.\n\nElizabeth Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\n[Operator instructions]. Our next question will come from Chris O'Cull with Stifel. Please go ahead.\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nHey, good afternoon, guys. First, I wanted to clarify a comment you made, Jed. I want to make sure I heard you correctly about the comp guidance. It sounds like you're assuming a slight retail sales deceleration from July to get to the high end of the comp range, is that correct?\n\nJed Gold -- Chief Financial Officer\n\nYes, Chris. So when you look at the -- just looking at the uncertainties in the macro environment, we've modeled a wider range of outcomes. Our second half outlook for comparable store sales is in line with 3% to 4% range and achieving a 3%  to 4% comp in the second half would put us close to that 5% comp for the full year. So in line with where we were in Q2, but a slight deterioration from where we were in July.\n\nI'm sorry, in June, slight deterioration from where we were in June.\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nOK. Got you. And how did you come up with the low end of the range?\n\nJed Gold -- Chief Financial Officer\n\nYes. This is where when you -- when we look at all the uncertainty in the macro environment, we thought it was prudent to model the wider range of outcomes. It's complex, right? Where this -- one of the unique things with this business is subscription. While we didn't forecast any churn to UWC, we gave ourselves a little bit of cushion or the other variable is if we saw even continued deceleration faster than what we've modeled on the retail side.\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nOK. Now another question. John, I know the company has been investing heavily on the mobile app with payment options, I believe. But first, can you describe some of the new customer functionality that you're excited about with the app? And will there be opportunities to do more target marketing or help reduce member churn rates? And then just the timing of when you think that could be fully rolled out?\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nYes. So there's a whole host of features and functions that are going to be very beneficial to our members. But we're focused more on the engagement side than we are on the acquisition side at this juncture knowing that we've got this very large member base, close to 2 million members. And the more we can do to have them continue to wash frequently, the better.\n\nSo there will be all the basic stuff that one would expect in any dynamic app where they can register online should they so choose to or through the app, they can update their credit card, they can upgrade to a different program or switch programs. And so features like that are part and parcel with what the app is going to look like.\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nOK. Great. Thanks, guys.\n\nOperator\n\nOur next question will come from Ryan Sundby with William Blair. Please go ahead.\n\nRyan Sundby -- William Blair and Company -- Analyst\n\nHey, guys. Good aftenoon. Thanks for the question. John, I think you mentioned integration is not for the faint of heart.\n\nShould we take that to mean that the half step back that Jed talked about is more like a pull back on this time or maybe the ramp to get back out because it's longer than expected? And is that having any impact on the outlook you provided?\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nSo every business that we've acquired and we've acquired over 100 businesses company or life to date is different. And some have a more compressed time horizon, some are more projected. But we have been consistent in saying, it's not about year one EBITDA. It's about year three.\n\nAnd so taking one step back in year one, we're OK with to make the necessary changes so that we can achieve that year three growth. And for us, that's what it's all about. So material investments from a capex standpoint in technology, mechanization, chemistry, etc., are all critical from a branding and refacing. From many companies, the first thing they do is they put up a new sign, that's the last thing that we do.\n\nWe want to make sure that we improve the customer experience and really take the employees and the operating procedures and disciplines to a whole another level. And while we're doing that, we will -- we take great care in improving the culture of the store and making sure that we have a really well-trained leader that is running that store. And so the investments we're making in training and  development are significant. And so the human capital investments, we're probably most proud of, and those are the hardest, but the ones that have the most enduring value.\n\nRyan Sundby -- William Blair and Company -- Analyst\n\nGot it. And then, John, I just want to clarify my last question. As we look at the guidance for the full year, did you say that does include some degradation in churn or trade down at the lower end of guidance? And then can you talk about maybe how this has held up in the past, if you've got something to compare to here, just recognizing, I guess, the size of the program is just much different today than it was kind of last recession.\n\nJed Gold -- Chief Financial Officer\n\nYes. It's hard to point to a recessionary environment where we have a comp. When you go back to the '08, '09 recession, as we said before, it was about 15% subscription. It was largely an internal community business.\n\nSo not a great comp. I think the best comp to look at would be during the pandemic, a lot of uncertainty in the broader environment. And during that environment, we actually grew UWC by about 20%. But having said that, this is unique from that.\n\nSo from a -- we don't expect any degradation of churn. As I said in my prepared remarks, we're not seeing any degradation in churn. We've given ourselves some room just due to all the uncertainty and felt it was the prudent thing to do just given all the uncertainty in the second half of the year.\n\nRyan Sundby -- William Blair and Company -- Analyst\n\nAll right. Thanks, guys.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Mr. John Lai for any closing remarks. Please go ahead.\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nThank you, operator. We feel very fortunate to be an amazing resilient carwash space and one that brings joy to so many motorists. We see the opportunity to continue to scale Mister Car Wash and are keeping our heads down as we continue to build the company with enduring value. I'd like to thank everybody for joining the call today.\n\nAnd most importantly, I'd like to thank all of our amazing team members out there that do an amazing job. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMegan Everett -- Senior Director, Communications\n\nJohn Lai -- Chairman, President, and Chief Executive Officer\n\nJed Gold -- Chief Financial Officer\n\nRandy Konik -- Jefferies -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nElizabeth Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nRyan Sundby -- William Blair and Company -- Analyst\n\nMore MCW analysis\n\nAll earnings call transcripts"
}