{
  "companyName": "Oil-Dri Corp of America",
  "companyTicker": "ODC",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/14/oil-dri-corp-of-america-odc-q4-2022-earnings-call/",
  "content": "Oil-Dri Corp of America (ODC 0.63%)\nQ4 2022 Earnings Call\nOct 14, 2022, 11:00 a.m. ET\n\nDan Jaffee\n\nHello, everyone. Welcome to Oil-Dri's fourth quarter and fiscal '22 year-end teleconference. We are doing this virtually. So I want to introduce the group to you.\n\nSusan Kreh is on hand today. She's our CFO. Aaron Christiansen, vice president of operations; Chris Lamson, group VP of retail and wholesale; Jessica Moskowitz, VP and general manager of our consumer products division; Wade Robey, VP of agriculture and Amlan marketing; Laura Scheland, vice president of strategic partnerships and general counsel; Dave Atkinson, vice president controller; and last but not least, Leslie Garber, our manager of investor relations. And Leslie, if you would walk us through our safe harbor.\n\nLeslie Garber -- Investor Relations Manager\n\nThank you, Dan. Welcome, everyone. On today's call, comments may contain forward-looking statements regarding the company's performance in future periods. Actual results in those periods may materially differ.\n\nIn our press release and in our SEC filings, we highlight a number of important risk factors, trends and uncertainties that may affect our future performance. We ask that you review and consider those factors in evaluating the company's comments and in evaluating any investment in Oil-Dri stock. Thank you for joining us. Dan?\n\nDan Jaffee\n\nYup. Thank you. And before I turn it over to Susan for a financial review of the highlights of the quarter. I'd just like to say, you're seeing a good -- we delivered a good quarter.\n\nWe were happy with it. We still have a long way to go. Given the pandemic, the war, supply chain disruption, high inflation and everything else that's going on in the world, we felt good that we finally got our price. It's not where they need to be, but at least strong enough to return us to profitability and earnings.\n\nAs I see our gross profit trend going back four, five years, we were making 29 points, 28 points, 27 points. Well, we only made just under 19 points in the quarter. So while we clearly feel good about the income we made. Trust me, we are not done.\n\nWe still have to get the business back to where it was, and it's really in everyone's best interest, not just our shareholders and our teammates, but our customers because we need to have the financial health to continue to invest in our business. You can see almost every segment is growing rapidly. And that growth not only requires more working capital, but also a greater capital expenditure focus on our plan. So sort of a long-winded way to say we're happy that we've made a lot of progress, but we clearly recognize we're not done yet.\n\nAnd as I mentioned in the release, very hopeful, cautiously optimistic that the momentum will carry off over into the first quarter of what is fiscal '23. So I will turn it over to Susan for our financial results.\n\nSusan Kreh -- Chief Financial Officer\n\nThanks, Dan. You'll note that we put out a pretty detailed press release. So in responding to some of your prior feedback, I'm going to keep my comments really brief and leave more time for Q&A. As we exited the third quarter, we started talking about momentum that we were seeing, and we continued to see that in the -- during the fourth quarter and into the first.\n\nYou'll note our fourth quarter results, revenue of $93 million or 19% year over year. So the momentum continued. And if I dive into that just a little bit to give you an idea, about 75% of that was based on pricing, the other 25% on volume. If we talk about that a little bit by segment, in retail and wholesale, 87% of their growth during the fourth quarter on the revenue line was based on pricing, 13% on volume, whereas in B2B, it was it was more balanced.\n\nIt was 51% price, 49% volume. So we continued to achieve improved gross profit during the fourth quarter, moving that back up to 18.8%, still below our pre-pandemic levels, but definitely with the momentum moving in the right direction. And we continue to focus on restoring those margins. We continue to see price increases to cover the inflation we are experiencing on multiple fronts like many others in raw materials, in energy, transportation, labor and even other areas.\n\nThose are kind of the key highlights and the momentum we need to focus on. There was a note in there about a subsequent event. So prior to year-end, we announced that we are terminating our defined benefit pension plan. There are many details on the plan contained in Note 8 to our financial statements.\n\nBut at a high level, basically, our most recent actuarial value indicates that our plan is essentially fully funded. So as we move to terminate, we expect that there will be no material cash draws on the company and that we'll be able to pay most of the liabilities, settle most of that with assets that are in our pension. We've actually shifted those assets into a preservation mode to make sure that as we're trying to wind this pension down, we don't get hit with equity market losses. We expect that this will be terminated within the next 12 months.\n\nSo just a little highlight there on what's going on. And with that, Dan, I'll pass it back to you. \n\nDan Jaffee\n\nGreat. Thank you, Susan. Appreciate it. I appreciate those of you who got questions in, in advance.\n\nIt's allowed us to sort through them and prepare our answers. You can also submit questions if you want using the ask a question field on the webcast and click submit. So Leslie, what is our first question?\n\nLeslie Garber -- Investor Relations Manager\n\nOK. Our first question comes from Bob Smith from Center for Performance Investing. And his question is, during the last call, you referenced budgeting $40 million in revenues for fiscal '23 for Amlan. Are you currently able to reaffirm that number? If not, what has changed? Dan, do you want to take that one? \n\nDan Jaffee\n\nYes, great question. And look, as I said, even last quarter, it's very much a start-up mode and it's hit or miss. We are still cautiously optimistic that that's our number for the fiscal year. We're only two months into the fiscal year.\n\nWe have a lot of trials. We have repeat business. So I would say I'm not ready to change the number. But I'm not seeing anything that's saying we're going to blow through the number either.\n\nSo I don't know if that helps you, Bob, but we're still cautiously optimistic. We've got a bunch of trials going on, and the initial results are very positive. So that's how we feel about that.\n\nLeslie Garber -- Investor Relations Manager\n\nOK, great The next question comes from John Bair from Ascend Wealth Advisors. He said, congrats on a solid quarter and record revenues. Are you seeing any relief or flattening of raw material costs such as resins and packaging that may help improve overall margins in the next few quarters? Has there been any meaningful improvement in shipping and logistics bottlenecks? So Aaron Christiansen, our VP of operations, will answer that. But there's a second part to his question and the second part was, what is the status of share buybacks? And Susan Kreh will take over after Aaron's done. \n\nAaron Christiansen -- Vice President, Operations\n\nJohn, thanks for your question, and thank you for the acknowledgment of the quarter we had. The first element of your question, we are seeing flattening of input costs and even some signs of mild compression, notably in a number of areas of our packaging costs. Similar in the area, utilities, natural gas and diesel, which are key cost drivers for us. So it's fantastic to be in a place we absolutely have seen flattening and there's some hope and expectation that we continue to see mild compression.\n\nTo your question about freight availability and cost, I need to really split my answer up into two parts. Domestic freight and cost has absolutely improved, more in the area of availability. Domestic freight has become far more readily available as it was pre-pandemic. Export and international freight is a different story.\n\nExport freight continues to be extraordinarily expensive and unavailable, not unique to Oil-Dri. That's anticipated to continue throughout much of the year. We are trying to adapt and overcome in ways where we carry more local domestic freight to ensure we can be ready to ship when equipment is available and the same on the other end. So I hope my feedback has been beneficial. \n\nSusan Kreh -- Chief Financial Officer\n\nThanks, Aaron. And this is Susan. I'll jump in on the second part of the question on share repurchases. In order of our cash priorities, that's one of the lower ones.\n\nOur first priority is to fund our business and fund our growth opportunities. And you see our commitment to capital spending ratcheting up a little bit year over year as we fund some of these growth opportunities for Amlan and other growth initiatives. And we'll have to probably fund some working capital to support those. And in order to support some of our foreign business, Aaron mentioned, the logistics for some of those are longer and longer.\n\nAnd that requires more working capital. We also fund our dividend. And after all of those priorities are taken care of, then come share repurchases. So I'd say, at this point in time, we don't have any plan to do any, but that's always just something we evaluate on an ongoing basis. \n\nLeslie Garber -- Investor Relations Manager\n\nOK. Great. Thank you. The next question comes from Ethan Star, a private investor.\n\nThe 10-K noted there was a reduced need for trade spending because of higher demand for your cat litter. Is that reflecting consumers switching to Cat's Pride for more expensive brands? Or what other factors are causing the higher demand? Chris Lamson, will you answer that, please? \n\nChris Lamson -- Vice President, Retail and Wholesale\n\nYes. Good morning, Ethan. Thanks for the question. So really the reduction in trade that we noted in the 10-K year over year, the function of both strong demand.\n\nAnd yes, our demand is strong, especially across the more strategic segments of our business to include lightweight litter. But also the supply chain malaise that was certainly not unique to us, right? We were up against what everybody else was up against. Strong demand has continued as you see in the results, of course, volume has been tempered a little bit by the pricing in the marketplace. The category is showing a little bit of elasticity in the outcome.\n\nSo as we think about that going forward, we are starting to reinvest in trade and do it in a rational way that drives good payout for us. And candidly, we're able to see that across our competition as well. So when we look in the Nielsen, we see the other players in the cat litter category doing the same, getting back into trade promotion as the supply malaise has lifted. And specifically for us, Aaron and his team have done a fantastic job getting us back into a position where we can fully meet demand there and promote the business. \n\nLeslie Garber -- Investor Relations Manager\n\nGreat. Thank you. The next question comes from Bob Smith. As it relates to Amlan, do you feel that fiscal '23 will be the true inflection point leading to continued accelerated growth in absolute terms, if not percentage-wise?\n\nDan Jaffee\n\nYou know what love, your audio is really rough. I'll read the question. \n\nLeslie Garber -- Investor Relations Manager\n\nOK.\n\nDan Jaffee\n\nAs it relates to Amlan, do you feel that F '23 will be the true inflection point leading to continued accelerated growth in absolute terms, if not percentage-wise? We are still very, very, very bullish. I mean, we believe we have the best non-antibiotic natural solution to gut health for animals. And I guess, a way that I would love to have you embellish on my sort of 50,000 comment, but when we look around our key markets, poultry products and what they can do, it's a great fit. So Wade, why don't you handle some of that? \n\nWade Robey -- Vice President, Amlan Marketing and Product Development\n\nYeah, absolutely. Thank you, Dan. Thank you for the question. Absolutely, yeah.\n\nAs we look around the world, as Dan said, you see inside of the pandemic and other things that have been going on, obviously, over the last year. We see a continued growth in the consumption of protein by folks, by people. And that means that the animal production industries need to keep pace. Our products are very well positioned for those markets.\n\nWe not only pursue the poultry industry and swine industry kind of as a first targets of interest. We also sell into dairy and into aqua as well. So we have a broad spectrum portfolio that can service all of those industries. This year will be very important for us as we roll our products out internationally.\n\nAs you know, we've also launched a portfolio in the U.S. as well, which is one of the largest markets in the world, obviously, and a number of those species. And we're seeing great receptivity from our customers and great uptake as they see positive trial results. So we're excited about the growth prospects.\n\nThe market is a very large opportunity for Amlan, not only in the traditional markets of grain preservation or preventing mycotoxicosis, but also in antibiotic replacement as more and more customers, more and more regions of the world, removed drugs, other pharmaceuticals like antibiotics and seek to pursue natural solutions. So we're very bullish about the opportunity for Amlan and for the industry itself as a whole. \n\nDan Jaffee\n\nWade, great. We've got some specific questions that I'm going to read to stay on the line. From John Bair, geographically, widespread avian flu outbreaks in the U.S. this year has resulted in the culling of large numbers of poultry flocks but has not been widely publicized.\n\nHas this situation had a slowing or negative impact on the uptake of Amlan products within the U.S. market as blocks are reestablished? Or conversely, has this situation helped Amlan sales as those flocks are reestablished?\n\nWade Robey -- Vice President, Amlan Marketing and Product Development\n\nYeah. Thank you, John. Yeah, it's -- part of the reason it's not as widely publicized is that this is not an infrequent thing that happens. Every few years, we tend to have outbreaks of avian influenza and specifically H5N1, which is the common one we have here.\n\nIt's been very severe this past year or two. As you know, we've had about a little over $47 million birds impacted. And with avian influenza, when that happens, depopulation is really the only thing you can do and then repopulation, as you know. It's not directly impacted our sales here in the United States, but it does cause some difficulty in travel.\n\nWe -- when these sorts of situations are occurring, there's quarantine that exist. We limit travel to farms to customers. And so that has made it a little bit more challenging, but I don't believe has really significantly impeded our ability to penetrate the market. It doesn't increase our opportunity either.\n\nOur products are really not designed around the treatment or mitigation for avian influenza. So it doesn't drive our growth in that way. But the repopulation is very rapid. The United States and frankly, other regions of the world have very strong ability, very quick ability to repopulate their flocks, their herds.\n\nAnd so we're seeing that happen as the depopulation occurs. So market is pretty stable. We're actually going to see hopefully some growth in the U.S. in the coming year.\n\nSo no, it really hasn't impacted our business in a negative way.\n\nDan Jaffee\n\nGreat. Thank you, Wade. We've got a couple of questions all sort of aiming at the same thing, so I'll just synthesize them. What impact would a recession, if and when it comes in the United States, have on your business? As you know, we are very domestically focused, 90%-ish of our business occurs in the United States.\n\nMaybe I'm a little high on that, but it's definitely in the high 80s. And so -- but the good news is that our products are primarily focused on pets, food and renewables, all of which are fairly recession proof as they have been in the past. We've navigated past recessions very well. If you zero in on the pet segment, which is our largest business, the market really bifurcates.\n\nYou get the people who are going to trade down to try and save money. And then you actually get the people who go for super premiumization because they're just afraid to make a mistake. But on the value side, our brands are popularly priced, A lot of them are OPP, the opening price point, where they are. We are definitely weighted heavily toward retailers who focus on value like Walmart and the Dollar stores and so forth.\n\nAnd then we absolutely have been leaning heavily into private label really our whole existence in cat litter. But lately with the advent of lightweight litters, we have a large share of the lightweight private label business in the United States and Canada. And as people trade down, that will only accrue to our benefit. So not to say that we are unmindful of a possible recession, but we don't feel it would have a real negative impact on our business and could possibly even create some additional opportunities.\n\nSo good questions and that covers that. Let's see how about -- I'm just looking at the questions because we've got a bunch and we've got to pick one. All right. We'll go with -- can you give me a number for the total addressable market, TAM, and a more narrow -- this is relating to Amlan, by the way.\n\nAnd a more narrow, realistic manner than the broad numbers that have been bandied about and what might be a market share figure you are looking for to capture of that TAM in the next few years? Wade, do you feel comfortable covering that one?\n\nWade Robey -- Vice President, Amlan Marketing and Product Development\n\nYeah, absolutely. So when we talked about the market opportunity in the animal nutrition and health business, we've tried to be clear in that it's very, very broad. The opportunity is very large across the world. There are different levels of market opportunity in the various world areas.\n\nBut as we look at a market like grain preservation, which is kind of in the core technology area that Amlan has pursued with our cloud-based minerals. That's well over a $1 billion opportunity. Now we obviously don't -- we don't focus on the front-end crops in the field or in storage. Our products really are utilized in animal feeds to preserve the quality and flowability of that feed.\n\nBut there is a fairly significant segment there we can target. When we look at the replacement of antibiotics or the removal of other pharmaceuticals, whether it be, again, antibiotics or even anticoccidials, that's a very large market around the world. It's been bandied about that that's closer to $5 billion, $6 billion. Now that has come down a bit as people have removed antibiotics, but it's still an enormous market.\n\nThat's the market that our formulated products can target, whether that's our Varium product or our new product we've launched nutri pack and then here most recently in the anticoccidial space, our pylox product. So there's a multibillion dollar opportunity now. Are we pursuing all of that? No. We're focusing in world areas like the United States, Latin America, Asia.\n\nRight now, we're not in Europe. So some of that is not available to us, but it's still a multibillion-dollar opportunity. As we look at market share, there's a lot of players in this space. So if we conservatively look at a 8%, 10% market share in time, obviously, that would be a substantial business for Amlan and for Oil-Dri.\n\nWe hope we can grow larger than that, but that will take more additions to our portfolio and broader participation in some of these other markets we're not focusing on today. But a lot of head space, a huge opportunity for the company as we grow our portfolio and demonstrate the efficacy of our products.\n\nDan Jaffee\n\nGreat. Thank you, Wade. I'm going to ask you one more, and then I have one for Chris Lamson. This is second part of Ethan's question.\n\nWe already covered the first part primarily. But how is Amlan's participation in recent industry convention, trade shows helped drive interest in and awareness of its product?\n\nWade Robey -- Vice President, Amlan Marketing and Product Development\n\nYeah. Thank you for that, Dan. And I appreciate the question, Ethan. We've had tremendous receptivity to this point.\n\nYou all are familiar with what we did at the International Poultry Exposition last year. We had a great showing and great interest in our products and our portfolio coming out of that. Recently, we were part of the World Dairy Expo last week in Madison, Wisconsin. It's another industry sector we're targeting on the dairy side.\n\nAgain, tremendous interest. We did, I think, a dozen interviews with the media. A lot of engagement with customers. We're seeing our dairy market opportunity grow much faster than even we expected.\n\nSo it's just demonstrating the support across species for our portfolio. As we look out into the future, we'll be, again, having a prominent exposition at the International Poultry Show in January in Atlanta. That's a worldwide show for us. And then, again, VIB in Asia, in Bangkok in March, which will really supplement what we do at IPPE and really give us a global impact in the coming years.\n\nSo great job by our marketing team and really raising the brand awareness of Amlan. \n\nDan Jaffee\n\nGreat. Thank you. Here's a consumer question. Jessica, maybe you'll take it first, and Chris, you can add some color to it.\n\nA couple of questions around the same thing, which is basically, what can we do to grow the private label lightweight share in the United States? And I'll add using Canada as a beta site. We kind of know how high is up there. So Jessica, maybe you talk a little bit about what's going on in Canada and then what the share is in the U.S. and then what things we can do to help close the gap.\n\nJessica Moskowitz -- Vice President and General Manager, Consumer Products Division\n\nThanks, Dan. Yes, so we've seen a great case study in Canada where lightweight has significantly taken over the market and continues to gain share of the overall Canadian market. We view that as a significant opportunity where our share within the U.S. is closer to 18% to 20%, the lightweight overall share of the market.\n\nAnd we view a couple of things in terms of being able to really close that gap to Dan's point. As Dan likes to say, who wouldn't switch to lightweight? If price were -- if price value were equal and quality were equal, what consumer wouldn't want to switch to lightweight cat litter. Just given that key pain point of having to lift a heavy jug of cat litter to and from the store as well as in your home and upstairs. So we view the key opportunity here as really being able to lessen than that quality gap, which we continue to work on and continue to improve the quality of our lightweight cat litters as well as to continue to offer our lightweight litter at a value, which being vertically integrated allows us to do.\n\nSo we see a huge opportunity not only to increase the overall penetration of lightweight cat litter, but also to continue to improve quality and improve that price value relationship so that we can continue to bring even more consumers into the franchise. \n\nDan Jaffee\n\nFantastic. Chris, anything to add?\n\nChris Lamson -- Vice President, Retail and Wholesale\n\nThanks. Great answer, Jessica. On Jessica's part, the only thing I'd add maybe a little bit more tactically and near in and I won't name names. We have a case study recently where we had a retailer that from a per use perspective, was pricing their private label lightweight, higher than their private label heavyweight.\n\nOur sales team did a fantastic job analytically showing that customer that the economic of lightweight were so much stronger when you take into account the fact that you can get significantly more product on the truck. So we showed them that story kind of crawled into their financials as best we could and long behold, they've now line priced them on a per use basis and the lightweight business there -- its private level lightweight business is growing faster than ever. So I think Jessica referred to value, it all comes down to value, right? She talked about product. There's price value on the shelf and we're looking to -- while we don't control that, influence it.\n\nAnd that case study is a good example, I think.\n\nDan Jaffee\n\nYeah, great. And I would add, sometimes it's better to be lucky than good. And we're both on this one because the global trend and then the specific trend in the United States toward ESG is only growing and that genie is not going back in the bottle. And if the whole United States converted to lightweight, you can reduce the carbon footprint by about 40%, which is huge.\n\nAnd I know using the liquid detergent switch to concentrate, which I've referenced before in the past, that's what gave us the idea for lightweight. They took water out of the formula, so that they weren't shipping water all over the place when the consumers have plenty of water in their house, and they were able to reduce the carbon footprint by about two-thirds. And once Walmart saw that it was here to stay and working, they actually force the retailers to convert. They basically just said we're going concentrate it and the you have 12 months to reformulate or you're going to be off our shelves and -- because we're getting behind this.\n\nAnd I would love it if Walmart or somebody else jumps in and says the same thing with lightweight. Hey look, it's clearly here to stay. There's no excuse for shipping all this weight. And by the way, the heavyweight all comes out of the Northwest.\n\nSo you're talking about the primary market for cat litter or the Northeast, the Southeast, and there's no sodium bentonite east of Wyoming pretty much. And so our plants are strategically located. And I think if you factored in the freight, you would probably even get a greater than 40% carbon footprint reduction. So anyway, we're very bullish on lightweight.\n\nWe believe it's a perfect alignment of what's good for Oil-Dri. It's also good for the retailer. It's also good for the consumer, and it's also good for the environment. So everybody wins.\n\nWe're out of time. I want to thank everybody. I do like this format. We're able to answer more questions, stay more focused and we will be back at you for the first quarter of fiscal '23.\n\nAnd let's keep our fingers and toes crossed that the momentum we showed you in the fourth quarter carries over into the new year. Thank you very much. Be safe. Take care.\n\nDuration: 0 minutes\n\nDan Jaffee\n\nLeslie Garber -- Investor Relations Manager\n\nSusan Kreh -- Chief Financial Officer\n\nAaron Christiansen -- Vice President, Operations\n\nChris Lamson -- Vice President, Retail and Wholesale\n\nWade Robey -- Vice President, Amlan Marketing and Product Development\n\nJessica Moskowitz -- Vice President and General Manager, Consumer Products Division\n\nMore ODC analysis\n\nAll earnings call transcripts"
}