{
  "companyName": "SmileDirectClub, Inc.",
  "companyTicker": "SDC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/smiledirectclub-inc-sdc-q3-2022-earnings-call-tran/",
  "content": "SmileDirectClub, Inc. (SDC -1.65%)\nQ3 2022 Earnings Call\nNov 08, 2022, 8:00 a.m. ET\n\nOperator\n\nGreetings, and welcome to the SmileDirectClub third-quarter 2022 earnings call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation. And once you require operator assistance, just --\n\nJonathan Fleetwood -- Director, Investor Relations\n\nLet me remind you that this conference call includes forward-looking statements. For additional information on SmileDirectClub, please refer to the company's SEC filings, including the risk factors described therein. You should not rely on our forward-looking statements as predictions of future events. All forward-looking statements that we make on this call are based on assumptions and beliefs as of today.\n\nI refer you to our Q3 2022 earnings presentation for a description of certain forward-looking statements. We undertake no obligation to update such information, except as required by applicable law. In this conference call, we will also have a discussion of certain non-GAAP financial measures, including adjusted EBITDA and free cash flow. Information required by Regulation G of the Exchange Act, with respect to such non-GAAP financial measures, is included in the presentation slides for this call, which can be obtained on our website.\n\nWe also refer you to this presentation for a reconciliation of certain non-GAAP financial measures to the appropriate gap measures. I'm joined on the call today by Chief Executive Officer and Chairman David Katzman and Chief Financial Officer Troy Crawford. Let me now turn the call over to David.\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nThanks, Jonathan. And good morning, everyone. Thank you for joining us today. I want to start off by congratulating the entire SDC team for staying focused and delivering on both our key strategic initiatives, as well as financial results, which are in line with the updated full-year outlook that we provided on last quarter's call.\n\nIn spite of the macroeconomic challenges that we are all facing, our team has remained tirelessly focused on delivering on our mission and knock several wins throughout the quarter that further our progress toward democratizing access to a smile each and every person loves by making it affordable and convenient for everyone. In line with our overarching theme of delivering transformative innovations to market through rigorous financial discipline, I am pleased to report that our cost-cutting initiatives from Q1 have paid off during the last quarter, and we were able to improve year-over-year adjusted EBITDA by 24 million and free cash flow by 29 million, in spite of a 31 million drop in revenue from Q3 of last year. Further, we'll go into the details and how we were able to achieve these results during the quarter. And I do want to thank the team again for their tireless efforts during the past three quarters to further optimize our business operations.\n\nWith the leverage in our operating model, these results reflect a much more efficient organization that is better positioned to achieve profitability with modest top-line growth. During the quarter, the team has also made significant progress in our future growth initiatives, and I'm pleased to announce that we are on track for a fourth-quarter test market launch of our innovative, patented SmileMaker platform featuring our mobile 3D scanning technology. This exciting solution combines many technology developments, including the functionality that digitally capture images with a mobile device and submit to our enhanced AI engine in order to develop an automated draft treatment plan. This will allow our customers to buy their aligners immediately after seeing both their new smile and how long it will take to straighten their teeth.\n\nAs we discussed in our last call, this will shorten the buying cycle from days or weeks to minutes and provide our customers with a great experience. A small change of only 25 basis points increase in website sales conversions, from our historical 50-basis-point site conversion rate, could drive an incremental 200 million in revenue and up to 160 million in EBITDA. Many developments and initial learnings from the SmileMaker platform launch will factor into our SDC Plus offering, which is our elevated service model that we have now officially branded as SmileDirectClub Care+. Our team's current focus is on a successful SmileMaker platform launch and to leverage our learnings and our Care+ launch into four test markets that are now targeted for early Q1 2023.\n\nWe are extremely excited for this pilot, and the increased interest we've seen from professionals in the quarter builds an even stronger foundation for a successful Care+ launch in the first quarter of next year. The breadth of our developments in this quarter is not limited to just the SmileMaker platform and our Care+ solutions. We also rolled out our Gen 2 retainer manufacturing technology that improves both retainer comfort and drives manufacturing and cost efficiencies. Which Gen 2 retainer manufacturing, we can now produce twice as many retainers with approximately the same headcount.\n\nAs a refresher, our Gen 2 aligner manufacturing produces twice as many aligners, with approximately one-third the headcount that was needed in Gen 1. Our retail offerings are also gaining greater share of the consumer's bathroom countertop. We released our new countertop flosser, which offers another premium convenient-smile solution for customers available both from our online store and leading retail locations nationwide. As we work to continuously expand our reach, it is imperative that we continue to win the hearts and minds of the dental community.\n\nAnd during the quarter, we were able to further solidify our credibility within the dental industry through membership in the Dental Trade Alliance. This builds upon our existing memberships, partnerships, and affiliations within the dental community, including influential organizations such as the American Academy of Clear Aligners, the American Association of Dental Boards, the National Dental Association and Women in DSO. I also want to recognize our customer care team for the relentless efforts to provide our customers with the level of service and support they've come to expect from our brand. As we have discussed in our previous calls, our contact center team was able to overcome some temporary challenges in the first quarter of 2022 and quickly get back to industry-leading service levels, which are reflected in our updated third-quarter NPS scores.\n\nOur third-party NPS score increased four points to 41 in our third quarter, providing further evidence that we are making progress toward becoming the aligner brand of choice and delivering a superior customer experience. Finally, I'm pleased to welcome Azmat Ali to the team as vice president of product. Azmat brings a wealth of experience to us from his roles at Lyft, Logitech, and HP, where he led product marketing innovation, and incubation initiatives, which will be instrumental in executing our strategies to bring innovative solutions to the market. Azmat's role is critical to our strategic direction of expanding our reach through our focused portfolio of transformative innovations.\n\nWhile the platform we have built was initially tailored to the needs of the DTC channel, we recognize that fully unlocking the value of our business and truly expanding our reach requires looking at how the strategic assets we have built can be leveraged across the industry to serve more customers globally. We have built a robust manufacturing and innovative treatment planning infrastructure utilizing next-generation technologies. We recognize the potential value of these assets have for outside parties who have approached us to discuss partnership opportunities for wholesale and/or white label aligner products. We're proud to be the largest U.S.A.-based aligner manufacturer with our headquarters here in Tennessee and with one of the largest 3D printing fleets in North America.\n\nWe believe unlocking the potential for these partnerships is strong and additive to our current focus on building the future of technology-driven orthodontia. Combining our innovative solutions and available production capacity, along with our growing credibility in the dental market, places us in a great position with additional options to further monetize our collection of business assets. And we'll share more on this progress in the coming months. In addition to the introduction of our patented SmileMaker platform expanding the reach of our solutions, we have continued to make progress in our Care+ pilot, which allows us to effectively compete in the broader addressable market, both in terms of teens and higher-income demographics.\n\nOur $3,900 Care+ solution that provides additional in-person doctor access in addition to our robust virtual platform will leverage our growing Partner Network to meet the demands of the more traditional orthodontic customers, higher-income households and parents of teens that desire added access to in-person dental professionals for their treatment journey. We recently held an event in our ADL facility in Nashville with some influential dental professionals and received overwhelming positive feedback on the Care+ solution, including strong interest in the compelling value proposition offered to our Partner Network doctors. The incremental $1,850 from our standard offering provides additional economics for the added level of service and share time offered by the partner practice. In addition to the economics of the Care+ solution, dental leaders have also expressed enthusiasm for the unique turnkey orthodontics as a service nature of the solution, which requires no incremental investment for equipment, minimal product training, and zero liability.\n\nFrom an operations perspective, doctors appreciate the ability to supplement our telehealth platform in the customer's overall clear aligner treatment experience, while also adding a teeth-straightening solution at a competitive price across their customer base. As I mentioned earlier, the launch of this pilot is on track for early Q1. Alongside Care+ is the continuing investment we're making in our Partner Network program, which is currently the primary channel through which our customers will be able to receive our Care+ offering. As we continue to optimize and scale our Partner Network program, our Care+ offering will be available to a broader audience, both in terms of geographies and the demographics.\n\nWe ended the quarter with 950 active locations, which is a meaningful increase of 260 locations from the second-quarter footprint. While our team is focused on productivity within our existing partners, this increase in locations illustrates that the seasoning of our sales force and announcement of our Care+ solution has generated strong interest in our Partner Network. We have a growing pipeline for practitioners that we anticipate will continue to drive growth of our network and increase the breadth of our Care+ offering across an expanded addressable market. Our team has worked hard over the last eight years to bring our innovative technologies to the market, allowing customers to begin their journey to a healthy smile through multiple channels that have evolved from our historical direct-to-consumer model.\n\nOur SmileShops resonate with customers that want to start with an in-person retail location with the next step, allowing customers to begin their small journey from their own handheld device to our SmileMaker platform. In addition, customers that wish to begin and have access to an in-person doctor can leverage our Care+ offering through our Partner Network locations. All these channels are supported by our telehealth platform that provides 24/7 access to dental professionals, ensuring results and maintaining access to a high quality of care. We have built an integrated, pure play clear aligner business that participates in all areas of the value chain in the growing market of consumers searching for teeth-straightening solutions.\n\nWe are fully invested and committed to seeing SDC reach its full potential. With over 500 million globally that need and can afford our clear aligner solutions, we have a tremendous opportunity to grow our business. To date, we've been able to help more than 1.8 million customers get the smile they love while saving them over $5 billion. The investments that we have made to develop our product portfolio and build strong brand awareness puts us in a great position to capitalize on this large market opportunity.\n\nWe recently added an entire innovation section on our Investor Relations website that provides additional details regarding our innovation strategy and product portfolio, including a five-minute video presented by just a few of our incredible team members that are bringing our innovations to the market. I encourage you to review these new materials on our website for more information regarding our strategic pillars and how we are driving our company forward. And now, I'll turn the call over to Troy, who will provide more detail on our Q3 financial results and full-year outlook. Troy.\n\nTroy Crawford -- Chief Financial Officer\n\nThank you, David. I will jump right to the results for the quarter. Please be sure to review our supplemental materials posted to our Investor website, which provides additional details on everything I will cover. Revenue for the third quarter was 107 million, which is a decrease of 15% sequentially and 23% on a year-over-year basis.\n\nThis was primarily driven by a worsening of the macroeconomic conditions and increasing inflation, which has been particularly difficult for our core customer. We shipped approximately 52,000 initial aligners in the quarter, down 16% sequentially and an ASP of $1,902. Our ASP decrease of $15 over the second quarter was primarily driven by FX conversion rates and some promotional activity in the third quarter. Our year-over-year revenue results are largely reflective of what we have seen play out in the economy over the last 12 months.\n\nProviding some details on the other revenue items, implicit price concessions were 10% of gross aligner revenue, in line with the second quarter. We continue to see no significant deterioration in the quality of our receivables portfolio. Any fluctuation in the quarterly IPC percentage is impacted by the overall level of revenue recorded in the period, as well as the rebalancing of reserves. As we've mentioned in prior quarters, we maintain separate reserves for IPC and cancellations.\n\nWe analyze and regularly rebalance those reserves based on current information. While our third-quarter revenue was impacted by the continued macro headwinds affecting our customers, our restructuring plan implemented in January is driving meaningful improvements in our cost structure and free cash flow. Much like we saw in our Q2 results, despite a $31 million year-over-year decline in revenue from the third quarter of 2021, we improved EBITDA by 24 million and improved free cash flow by 29 million. These improvements in EBITDA and free cash flow showed the discipline and financial rigor that we have put in place since the beginning of the year in the face of a very difficult macroeconomic environment.\n\nReserves and other adjustments, which include impression kit revenue, refunds, and sales tax came in at 10% of gross aligner revenue, compared to 8% in the second quarter. Financing revenue, which is interest associated with our SmilePay program, came in at approximately 8 million, which is a decrease of 1 million from Q2 and down approximately 3 million year over year due to the lower accounts receivable balance. Other revenue and adjustments, which include net revenue related to retainers, whitening, and other ancillary products, came in at 18 million or 17% of total third-quarter revenue. Now turning to SmilePay, in Q3, the share of initial aligner purchases financed through our SmilePay program came in at approximately 60%, which is in line with historical levels.\n\nOur SmilePay program is an important component to drive affordability with our customer base. And overall, the program has continued to perform well with our delinquency rates in Q3, consistent with prior quarters. The fact that we keep a credit card on file and have a low monthly payment gives us the confidence that SmilePay will continue to perform well. Turning to results on the cost side of the business, gross margin for the quarter was 70%, which was a 288-basis-point decrease from the second quarter.\n\nThe lower margin rate was impacted by an inventory write down of 1.1 million related to our retail business. Normalizing for this one-time item yields a 71% gross margin in the quarter. The continued strength of our margin rate, despite the decline in aligner shipments, showcases the significant leverage we have built in our business from our productivity enhancements, along with other cost-control initiatives. Our team continues to focus on efficiencies through cost controls and programs such as the Gen 2 retainer line to drive solid margins across the business, and we'll see significant improvement as the top line returns to growth and we get the added benefit from operating leverage.\n\nMarketing and selling expenses came in at 58 million, or 55% of net revenue, in the quarter, compared to 57% of net revenue in the second quarter. The sequential decrease as a percent of revenue was primarily a result of a continued focus by our teams on driving increased marketing efficiency across platforms. As a reminder, our typical seasonal trends include an uptick in the fourth quarter and marketing and selling costs to support promotions during the holiday season and capture sales driven by new year, new you demand in the first quarter. So, we do anticipate a sequential increase in marketing and selling as a percent of revenue during Q4, but we are remaining focused on maintaining continued efficiency improvements on a year-over-year basis.\n\nA key focus for 2022 is seeking to find efficiency in our spend. We've been experimenting more with pulsing spend with targeted dark weeks versus having an always-on strategy in our top-of-funnel channels, such as TV, which allows us to take advantage of our approximate 60%-aided awareness and optimize our marketing spend. It is important to keep in mind that digital marketing is a highly fluid process that requires daily discipline of spend analysis, assessment, and reallocation. With a targeted focus on efficiency and quality leads, we are continuing to calibrate spend across a diversified platform base, optimize continuously throughout the period to achieve the right balance of high-funnel leads and bottom-funnel aligner sales.\n\nOn SmileShops,  we had 117 permanent locations as of quarter end and held 116 pop-up events over the course of the quarter for a total of 233 location sites with a net decrease of one shop location from the second quarter. As we increase customer access to our solutions through both the scaling of our partner network channel and the upcoming launch of our SmileMaker platform, we anticipate a reduction in the number of pop-up events hosted in future quarters. We will continue to monitor our strategies to expand our reach that supports incremental demand without cannibalizing sales from existing channels. We now have over 950 North America Partner Network locations that are active or pending training, increasing our footprint by 260 practices from Q2.\n\nWhile the Partner Network team has been focused on optimizing productivity and preparing for our Care+ solution launch with existing practices, we're also seeing positive momentum from interested providers due to the seasoning of our existing sales team and interest from our announcement in the second quarter of our upcoming Care+ offering. Our growing Partner Network footprint will not only scale our operations for our current submission trajectory but will also serve as a key channel when we begin offering our Care+ premium service offerings to the market in 2023. General and administrative expenses were 76 million in Q3, compared to 72 million in the second quarter. The sequential increase from the second quarter was primarily driven by higher one-time legal and consulting costs.\n\nExcluding stock-based compensation and depreciation and amortization costs, G&A expense decreased 10 million compared to the prior year as a result of the cost savings initiatives taken back in January. Other expenses include interest expense of 5.4 million, of which 4.1 million is related to our new secured debt facility issued in April, and 1 million is related to deferred loan costs associated with the convert we issued in 2021. Additionally, one-time costs related to lease abandonment, impairment, and other store and restructuring costs was 3.4 million, consisting primarily of costs related to our January restructuring actions, including costs associated with severance and retention, as well as store and facility closure costs related to our international operations. We also incurred 1.3 million and other expenses, primarily related to the impact of unrealized foreign currency translation adjustments.\n\nAll the above produced adjusted EBITDA of negative 30 million in the third quarter, which is a $24 million improvement over the third quarter of 2021, despite a $31 million decrease in revenue. Our third-quarter net loss was 70 million, compared to Q3 2021 net loss of 89 million. Breaking out adjusted EBITDA regionally, the U.S. and Canada came in at negative 22 million, and rest-of-world adjusted EBITDA was negative 8 million.\n\nMoving to the balance sheet, we ended the third quarter with 120 million in cash and cash equivalents, 202 million in net accounts receivable, and 66 million drawn on our new $255 million debt facility with HPS. Cash from operations for the third quarter was negative 24 million, while cash spent on investing for the quarter was negative 11 million. Free cash flow for the third quarter, defined as cash from operations less cash from investing, was negative 35 million, which is a $1 million improvement over the second quarter of 2022 and a $29 million improvement over the third quarter of 2021. With our Q3 results in line with our Q2 updated guidance and with only two months remaining until year end, we are tightening and, in some cases, raising the midpoint of our full-year 2022 guidance range.\n\nWe are increasing the bottom end of our revenue range based on the solid Q3 performance and the continued traction that we are seeing with customers as we progress in the fourth quarter. We're also pushing through some of the positive EBITDA impacts we have seen from our cost-savings initiatives that drove our Q3 results. For full year 2022, we now expect to deliver revenue between 470 million and 500 million, gross margin between 70.5% and 71.5%, adjusted EBITDA between negative 155 million and negative 135 million, capex between 55 million to 60 million, and our one-time costs from our reorganization action in January remains the same between 20 million and 25 million. Our year-end cash balance for the range of 110 to 130 million, which includes an estimated 60 million to 70 million of financing, primarily coming from utilization of the existing HPS facility.\n\nWe continue to maintain focus on our cost structure and executing on plans to drive additional efficiency to offset the impact of this challenging macroeconomic environment. Those efforts are driving meaningful results to the bottom line, evidenced by our improved year-over-year EBITDA and cash flow results. We are excited about the future of our company with the pending launches of our new SmileMaker platform and Care+ solution. These innovations are just the beginning of what's to come from SmileDirectClub and stem from our robust innovation portfolio.\n\nWe are leveraging the proprietary end-to-end business models that we have built to lead the industry on many fronts. Thanks to the investments we have made in our vertical integration, we are well positioned to participate across an increasing number of channels in the clear aligner category and ultimately drive growth in the future. With that, I would like to turn the call back over to David for some closing remarks.\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nThanks, Troy. I'm pleased with the financial results that we delivered this quarter and look forward to our upcoming launch of our SmileMaker platform in the fourth quarter and the release of our Care+ offering in early 2023. We will continue to update the market with additional insights regarding these initiatives, along with any of our other exciting innovations and achievements of key milestones. Finally, we are targeting an Investor Day in late March 2023, which we will host in our Smile lab facilities in Nashville to provide comprehensive insights regarding our company from our business leaders, along with tours of our manufacturing facility.\n\nThank you to everyone for joining today. With that, I'll turn the call back over to the operator for Q&A.\n\nOperator\n\nThank you. We will now be conducting a question-and-answer session. [Operator instructions] One moment, please, while we poll for your questions. Our first questions come from the line of Robbie Marcus with J.P.\n\nMorgan. Please proceed with your questions.\n\nLilia-Celine Breton Lozada -- JPMorgan Chase and Company -- Analyst\n\nHi. This is actually Lilia on for Robbie. Thanks so much for taking the question. Maybe a start, I know it might be a little bit early, but there's, obviously, a lot of moving pieces in terms of macro and all these new product updates you have planned.\n\nSo, are there any early thoughts you can share on 2023 in terms of how you're thinking about these dynamics and how that should affect top- and bottom-line growth next year?\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nYeah, I can take that one. Lily, we're really not going to give guidance on this call for 2023. You know, the two big initiatives aren't even in the marketplace yet, SmileMaker platform and our SDC Care+. We did revise our guidance from last quarter, increasing the bottom range.\n\nAnd what we're seeing is, from our core business, we're seeing some market efficiencies that the team has done a really nice job, both the analytics team and the marketing team, as far as data modeling in this very challenging environment. You know, we're now in the fourth quarter of this high-inflation period, and it took some time. But we finally are seeing some breakthroughs in the modeling of targeting the right consumer in this challenged market. And that's how -- that's how you have to look at it.\n\nYou know, the demand is still down. We've seen it from competitors. We've seen, you know, any kind of discretionary spending. But what we've been able to do through a lot of good data work, data science -- scientists and our analytics team, is to figure out and target the right customer who is buying in this environment.\n\nAnd that's what we saw, and that's why we revised our guidance. So, I can give you guidance for the end of the year. It's very favorable. We're very excited about it.\n\nBut as far as 2023 and how some of these new initiatives are going to affect that, we plan on doing that at our next quarterly call.\n\nLilia-Celine Breton Lozada -- JPMorgan Chase and Company -- Analyst\n\nGot it. And just to follow up on that, can you talk a little bit about on how these macro trends have affected you in the U.S. versus internationally and how we think -- how we should be thinking about growth by geography moving forward? And what does it take for you to get back to that previous strategy of more aggressive international expansion? Is it improvements in the macro? Is it competition? So, any part of that would be helpful. Thanks.\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nYes. Overall, we're seeing the same effect in all countries. We're in six countries right now, the same high inflationary period. It's not unique to one country.\n\nIt's not worse, is not better. It's pretty much universal. The good news is that what we've seen through this -- this targeting in our marketing initiative in -- in this quarter is it -- it has been spread out among all countries. So, it's not unique to the U.S.\n\nthat we found this -- this marketing efficiency. We're seeing it in all countries. So, that's good news as far as the ability to make our marketing dollars work harder. But, you know, Troy, I don't know if you want to add anything there, but as far as, you know, the macros and international growth, we're not focused on international growth right now.\n\nWe've got our six countries. We want to get these two initiatives launched and work out all the bugs and get efficiencies from -- from both the SmileMaker platform and SDC Plus. And once those are in the market, fully baked into the market, we can then look again at some international growth. It should be a little bit easier with SmileMaker because of how we've shortened the funnel and the need to start with a kit or at a SmileShop.\n\nSo, as we look back at those countries -- and I think that's, you know, outer years as -- once we get all of these new initiatives into the marketplace, it should be less costly and a little bit easier to get back on the international expansion.\n\nTroy Crawford -- Chief Financial Officer\n\nI would just say, just overall from a U.S. versus international perspective, we're -- we're still running in that 85%/15% split, with international being about 15%. But that's been pretty consistent throughout the year once we made the changes coming out of '21.\n\nLilia-Celine Breton Lozada -- JPMorgan Chase and Company -- Analyst\n\nGot it. That's helpful. Thank you.\n\nOperator\n\nThank you. And our next questions come from the line of Michael Ryskin with Bank of America. Please proceed with your questions.\n\nUnknown speaker\n\nHi, thanks. You have Peter on for Mike here. Can you kind of just discuss the step up and burn implied for fourth quarter? Is that just primarily driven from the new [Inaudible] marketing spend direction? Just wanted to confirm that. Any color would be helpful.\n\nTroy Crawford -- Chief Financial Officer\n\nYou're talking about the quarter over quarter?\n\nUnknown speaker\n\nYes. Yes.\n\nTroy Crawford -- Chief Financial Officer\n\nYeah, it was just slightly up. And I think it's just the results of the individual month. Our G&A expense was up a little bit on legal costs, but we were up -- we were able to offset most of the -- most of the increase of that by other cost savings and things of that nature. So, I think in Q4, you know, if you back into what our guidance is for the full year, you can kind of see what that cash burn looks like.\n\nOne of the things that we talked about was that marketing spend will go up a little bit in Q4, getting ready kind of for the new year, new you. We expect obviously volume to be up in Q1 from Q4. So, a little bit of spend in Q4 related to marketing, which -- which drives a little bit of the -- of the cash burn. But I think, when we look at this year versus last year, you could see significant improvement in both our EBITDA and free cash flow despite the -- despite the decline in sales.\n\nUnknown speaker\n\nOK. Thank you. That was helpful. And then just any sort of framework or color you can provide on how we should be thinking about contribution from some of the initiatives like Care+ next year.\n\nTroy Crawford -- Chief Financial Officer\n\nSo, overall, for Q4, we really haven't baked anything in for the new initiatives. I would say, you know, we've got an international launch related to the SmileMaker platform. Probably not a lot of benefit there just because, you know, it's a smaller country. And as we launch in the U.S., it'll be, you know, mid to late in the -- in Q4 and, therefore, probably won't have a big impact on Q4 as well.\n\nWe really expect that to be driving our 2023 guidance is the results of that based on, you know, conversion rate improvement and things of that nature.\n\nUnknown speaker\n\nOK, great. Thanks.\n\nOperator\n\nThank you. Our next questions come from the line of Jon Block with Stifel. Please proceed with your questions.\n\nUnknown speaker\n\nHi, guys. This is Tom on for John. Thanks for the questions. If I can start on the long-term plan or the LRP, and apologies if I missed this.\n\nBut are those targets still intact? I don't know if I saw that in the slides. And then, maybe as a tack-on to that, do you still feel confident in generating positive EBITDA in '23 and positive free cash flow in '24? I think those were, you know, on prior calls, maybe the -- the targets, but any color there just on the -- the the long-term targets?\n\nTroy Crawford -- Chief Financial Officer\n\nI'll just answer the first part of your question. We didn't address the long-range plan in our revised guidance in Q2. I'd say its long range is exactly how it's --how it's listed. So, I think, as we come out of 2022, that's definitely going to impact and guide what we'll do for '23 as far as -- as far as guidance goes.\n\n2022 will definitely be the jumping off point, and '23 will be very dependent on how these initiatives go. So, the SmileMaker platform launch in Q4, and then, in Q1, we'll have the launch of SDC Plus as well. So, both of those things will be very impactful for '23. More innovation in the pipeline as well, I think, will also help -- help impact those results, and cost control initiatives will be in place as well.\n\nSo, I think what you can think about for '23 and the '23 guidance is that however we end up guiding on sales, we'll -- we'll look for leverage in the operating model and, certainly, have a cost structure that fits that revenue structure.\n\nUnknown speaker\n\nOK, got it. So, just TBD on -- on some of those positive EBITDA targets, it sounds like?\n\nTroy Crawford -- Chief Financial Officer\n\nThat's right. I mean, if you think about those things, they have very high flow through to the bottom line. So, we really want to get some idea of how those initiatives launch before we give adjustments to our long-range guidance.\n\nUnknown speaker\n\nGot it. That's helpful. And then, if I can pivot to competition, you know, you had one key player somewhat recently exited the DTC market. I guess, what are you seeing out there from some of the other DTC competitors, maybe around things like pricing and promotional strategies? And then, just as a tack-on to that, you know, you guys took some price this year.\n\nCan that be a lever next year in -- in 2023? Would love your thoughts there. Thanks, guys.\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nYeah, I can take that one. As far as DTC competitors, like you said, Candid exited the DTC market. The really only one known competitor that's [Inaudible] And we really don't see a lot from them. You know, they're not vertically integrated like we are.\n\nThey don't have treatment planning software. They don't manufacture. They don't have the captive finance. A lot of the innovations and technologies that we built -- they're really, you know, a go-to-market kit company, no shops.\n\nAnd we just haven't seen a lot of them recently. I'm not really sure what the plans are by [Inaudible] since they acquired them, but I'm sure we're going to hear on their upcoming earnings call. Yeah, we really think we have a very unique offering. We've got this fully vertically integrated telehealth platform.\n\nWe're now bolting on a new service offering where we can have our -- our customers starting a local GP office. And the combination of two is very powerful. As far as the price increase, that is on the table. We'll see where the -- the macro goes in 2023, another $100 price increase will get us about 4.5%.\n\nIf we went up to 2,150, we're still the low, you know -- low-price leader with the model that we're -- that we go to market with. And we were effective at keeping the monthly $89 for our SmilePay customers at the same rate. We just added on two extra months. We can do the same thing here if we wanted to go 28 months at $89 a month.\n\nSo, it -- it is a possibility. We really want to see. The biggest driver is going to be the SmileMaker platform as it gets into the market. And, you know, we've said before, on a 25 basis conversion improvement, you know, you're looking at 200 million at 80% plus margins on the aligner product.\n\nMost of that flows all the way through. So, very effective cash flow EBITDA. And so, we're going to know shortly how that does in the market, and that'll -- that'll answer a lot of the questions that you're -- you're looking for here on can we get the positive EBITDA in '23, can we get the cash flow by '24 or even sooner possibly depending on the conversion curves with SmileMaker. And then, do we need to take a price increase, or can we hold price based on the conversions we see with some of these initiatives.\n\nUnknown speaker\n\nVery helpful. Thanks, Dave.\n\nOperator\n\nThank you. [Operator instructions] Our next questions come from the line of Laura Champine with Loop Capital Markets. Please proceed with your question.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nHi. Thanks for taking my question. I noted that it looks like other revenue as a percentage of total has increased sequentially from 14% to 28%. Is that the right math, and what's driving that?\n\nTroy Crawford -- Chief Financial Officer\n\nPart of that is certainly the retail business. We had a spike in retail a couple of quarters ago. I think that flowed through a little bit, but that's really the majority of it. Retainer revenue in there as well, and we've seen nice flow through on retainers just as our overall customer base has increased.\n\nSo, I think, yeah, you're -- you're on the right track there.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nGot it. So, mostly to the oral care line that's -- that's working. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJonathan Fleetwood -- Director, Investor Relations\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nTroy Crawford -- Chief Financial Officer\n\nLilia-Celine Breton Lozada -- JPMorgan Chase and Company -- Analyst\n\nUnknown speaker\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nMore SDC analysis\n\nAll earnings call transcripts"
}