{
  "companyName": "Root, Inc.",
  "companyTicker": "ROOT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/root-inc-root-q2-2022-earnings-call-transcript/",
  "content": "Root, Inc. (ROOT)\nQ2 2022 Earnings Call\nAug 09, 2022, 9:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, good morning. My name is Abby, and I will be your conference operator today. At this time, I would like to welcome everyone to the Root Incorporated second quarter 2022 earnings conference call. [Operator instructions] And I will now turn the conference over to Christine Patrick.\n\nYou may begin.\n\nChristine Patrick -- Vice President, Investor Relations\n\nGood morning, and thank you for joining us today. Root is hosting this call to discuss its second quarter 2022 earnings results. Participating on today's call are Alex Timm, co-founder and CEO; and Rob Bateman, chief financial officer. During the question-and-answer portion of the call, our presenters will be joined by Dan Rosenthal, chief revenue and operating officer; Matt Bonakdarpour, chief technology officer; and Frank Palmer, chief insurance officer.\n\nLast evening, Root issued a shareholder letter announcing its financial results. While this call will reflect items discussed within that document, for more complete information about our financial performance, we also encourage you to read our second quarter 2022 Form 10-Q which was filed with the Securities and Exchange Commission last evening. Before we begin, I want to remind you that matters discussed on today's call will include forward-looking statements related to our operating performance, financial goals, and business outlook, which are based on management's current beliefs and assumptions. Please note that these forward-looking statements reflect our opinions as of the date of this call, and we undertake no obligation to revise this information as a result of new developments that may occur.\n\nForward-looking statements are subject to various risks, uncertainties, and other factors that could cause our actual results to differ materially from those expected and described today. In addition, we are subject to a number of risks that may significantly impact our business and financial results. For a more detailed description of our risk factors, please review our Form 10-K for the year ended December 31st, 2021, where you will see a discussion of factors that could cause the company's actual results to differ materially from these statements as well as our shareholder letter and second quarter 2022 Form 10-Q released last evening. A replay of this conference call will be available on our website under the Investor Relations section.\n\nI would also like to remind you that during the call, we will discuss some non-GAAP measures in talking about Root's performance. You can find the reconciliation of those historical measures to the nearest comparable GAAP measures in our shareholder letter released last evening and our Form 10-Q filing with the SEC, which are posted on our website at ir.joinroot.com. I would now like to turn the call over to Alex Timm, Root's co-founder and chief executive officer.\n\nAlex Timm -- Co-Founder and Chief Executive Officer\n\nThank you, Christine. We continue to execute on our playbook of raising rates, tightening underwriting, and managing cash as we respond to a prolonged difficulties with the supply chain inflation. Despite this challenging environment, the proactive steps we are taking have resulted in further improvements to our financials. Through our tech stack and rating engine, year to date, we have been able to implement 35 rate filings with an average increase of 28%, while filing revised insurance contracts in 23 states to tighten underwriting rules and reduce premium leakage.\n\nOn a year-over-year basis, we have significantly reduced cash burn and improved our gross accident period loss ratio by five points, adjusted EBITDA 59%, and non-loss and LAE expenses by 57%. We focused on deepening our competitive advantage through continued investment in technology. We have shipped our fully integrated product, Carvana Insurance built with Root, which is showing improved attach rates in its early days. We believe that being able to offer an instant quote at the point of vehicle sale creates a product that works better for consumers and it's something that our technology platform can uniquely provide.\n\nThough the current focus of our embedded channel is on our exclusive partnership with Carvana, our technology and embedded capabilities have driven discussions with additional prospective partners. We have also recently launched our digital agency. This allows Root to service customers that are not best suited for our particular insurance offering. It is a capital-light revenue stream that allows our partners to access our technology and distribution capabilities.\n\nWhile still early in development, we are excited to expand this offering in the future. We are constantly refining our models and the process around their development. This quarter, we made enhancements to the post-deployment review of our countrywide pricing model. This enhancement identifies segments that would benefit from pricing adjustments earlier informing necessary model improvements to be made even more quickly.\n\nWe are also working on the next generation of our UBI pricing model, which leverages our growing data set. We believe this will lead to more accurate pricing, the ability to simplify and speed future model development and reduce test drive days required for a UBI-based rate. Looking ahead, we're going to continue to execute on pricing and underwriting improvements through the back half of 2022. Along with our continued focus on expanding and deepening our embedded product experience, we expect to continue to drive improvements in our financial results while further building differentiated access to customers.\n\nI'll now turn the call over to Rob to discuss our operating results in more detail.\n\nRob Bateman -- Chief Financial Officer\n\nThanks, Alex. Results for the second quarter of 2022 reflected our continued focus on strengthening underwriting performance and developing our industry-leading embedded offering. Our full GAAP financial results are disclosed in the shareholder letter we published yesterday evening, but I want to focus on a few key highlights. On the top-line, gross written premium declined 21% year over year to $140 million.\n\nOur gross earned premium decreased 6% year over year to $171 million. The top line decline reflects higher rates and stricter underwriting in underperforming geographies and customer segments along with substantially reduced marketing spend. These actions have caused new business ratings to decrease with renewals making up 75% of gross earned premium this quarter as we focus on profitability. Gross accident period loss ratio was 85% for the second quarter, a five-point improvement versus the second quarter of 2021.\n\nOur early response to higher severity and the ability to implement rate changes quickly along with a higher weight of renewal premium have driven consistent year-over-year improvement. We expect to continue to raise rates and take underwriting actions to improve bottom line results. We remain focused on lowering expenses across the company to further reduce operating losses. During the second quarter, operational changes resulted in a 57% reduction in non-loss and LAE expenses compared with the second quarter of 2021.\n\nOperating loss was $81 million, a 53% improvement over prior year. Adjusted EBITDA, a KPI we introduced last quarter to give a clearer view of the underlying performance of our business, excluding certain non-cash items, improved 59%. We are conserving capital as we drive toward profitable unit economics. We ended the second quarter with $696 million of unencumbered capital compared with roughly $736 million at the end of the first quarter.\n\nOur operating cash consumption has dropped over 54% when compared with the first half of 2021. Turning to our outlook. We continue to expect our results to reflect the actions we are taking as we navigate through this challenging environment. We expect gross written premium to reflect significant year-over-year declines in the second half of 2022 and meaningful improvement in our operating losses.\n\nWe expect the magnitude of both measures to accelerate when compared with the first half of 2022 as we remain focused on improving operating results through strong underwriting and rate actions as well as prudent capital management. We are making progress against the goals we set out a year ago, and we are not finished. Our focus is clear, strengthening our underwriting foundation and conserve capital while utilizing our technology advantage to build out our embedded product. We appreciate your continued support.\n\nWith that, we look forward to your questions.\n\nOperator\n\n[Operator instructions] We will take our first question from Elyse Greenspan with Wells Fargo. Your line is open.\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nHey. Thanks. Good morning. My first question was following up on just the outlook, right? You said significant decline in the back half.\n\nI know you compare that to the first half of the year. But what about if you compare it to the Q2, are you expecting premium and policy decline in the back half to be in line, I guess, with the pretty sharp declines we saw in the second quarter?\n\nRob Bateman -- Chief Financial Officer\n\nHi, Elyse. This is Rob. Yes, that would be right. We'd say if you look at the back half of the year, I'd say it's going to look more like Q2 than Q1.\n\nWe do expect that if you look at it year over year from the second half of this year compared to the second half of last year, that will be above that 25% decline in both gross written premium and operating loss that we had talked about earlier.\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nAnd then what's your view here? Like how are you thinking about severity and frequency over the balance of the year? Do you think trends especially on severity, are expecting them to continue to remain elevated?\n\nRob Bateman -- Chief Financial Officer\n\nYeah. At least I'll give you the actual that we had. So our severity was 6% and our frequency is 1%. And I'll turn it over to Frank to give you a sense of what we're looking at for the back half of the year and our loss ratio picks.\n\nFrank Palmer -- Chief Insurance Officer\n\nSure. Good morning. I'd say that we are expecting that expenses and costs for frequency and severity will remain elevated, but I think the trends will be probably slower through the second half of this year compared to last year. So we don't expect to see used car prices, for example, going down.\n\nWe don't expect to see the same amount of acceleration that we saw last year.\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nOK. And then one last one with marketing spend that obviously has continued to come down and your expectations be that I guess that would remain more muted, at least to the rest of this year, perhaps into 2023 as well.\n\nRob Bateman -- Chief Financial Officer\n\nThanks for the question, Elyse. Right now, we are entirely still focused on protecting the business. And for us, what that means is staying really laser-focused on profitability. And so getting our loss ratio to the point where we feel that growth is prudent, and we expect to stay in that position at least through the back half of this year.\n\nWe also, though, in terms of growth and spend, we also believe and we continue to see growth in Carvana through our new product, where we're even further integrated with the purchase flow, and we do expect to see continued growth in that channel.\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nRob Bateman -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nWe will take our next question from Michael Phillips with Morgan Stanley. Your line is open.\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nThanks. Good morning. First question is on the gross accident period loss ratio this quarter, 85%, down five points from a year ago. I guess I'm a little surprised by that only because of the comments on your severity, 6% seems low to me.\n\nI always expect some going to be a little bit higher than that. But given it was 6% there frequencies only up 1% and you've taken a lot of rate. Why not more improvement in the loss ratio?\n\nRob Bateman -- Chief Financial Officer\n\nI think first, what I'd say on that is we have taken a lot of rate, but a lot of that has not earned in yet. And so I believe that we have -- we acted very quickly. And we have taken a lot of that rate and a lot of those actions are behind us. But I think we're still in the early stages of seeing that rate earn through the book.\n\nI'll turn it over to Frank, who can talk a little bit about the numbers.\n\nFrank Palmer -- Chief Insurance Officer\n\nYeah. I'd say additionally when you look at Quarter 2 versus Quarter 2 and you think about last year, we saw exceeding trends both in Quarter 3 and in quarter 4. So last year, the loss ratio actually got worse Quarter 2 to Quarter 3 and Quarter 3 to Quarter 4. So when you look at that, the 89% versus the 85, we actually were up higher than the 89% around 94% later in the year.\n\nSo I think we've actually come down a lot in being able to mitigate some of those trends in the back half of the last year.\n\nAlex Timm -- Co-Founder and Chief Executive Officer\n\nYeah. And just to put some numbers to it, Mike, just to give you a sense. Just keep in mind on that severity, that's six points. That's the all-in severity.\n\nSo that's BI and the material damages coverage. So you're going to see it higher on the material damage coverages. But just to give you a sense on the rate, we've taken 28 points year to date, but we've only -- we only had about six points of that earning in the second quarter. So if you look at our rate filings, they're really -- they were really concentrated in the back half of the second quarter.\n\nSo we still have quite a bit of rate to earn in over the course of the year.\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nOK. Thank you. That makes sense. I guess I was a little surprised by your quoted new premium volume that came from Carvana was about a third.\n\nI'm surprised that I expect that to be a little bit more than a third, given the focus on that channel? I know you're slowing down things, but I still thought that would be a higher proportion of new business. Any reason why that was so low or it shouldn't have been surprised.\n\nDan Rosenthal -- Chief Revenue and Operating Officer\n\nHey, Mike. It's Dan. Thanks for the question. I don't know that I think for us, we don't necessarily have a target for -- in terms of what Carvana's new business is going to be as a percentage of our overall new business.\n\nFor us, what we're excited about is the fact that we launched the fully embedded product, bringing it down from 24 screens to three screens is monumental. And I just want to take a moment to call that out, tremendous effort by the Carvana and routines, nights, weekends, and the like. to move from a soft launch of a product last October to putting that fully embedded product in market in July is really, really monumental. And so now we think from here, we have the ability to ramp up Carvana and do it the right way, Alex, used the word prudent earlier.\n\nI think for us, it's really about excitement around the channel. This is a really good partner for us to launch the embedded channel with. We see the attach rate continuing to improve, and we see a good quality customer coming through this. 80% of our Carvana customers have prior insurance.\n\nIt's a newer car, higher coverage levels because of the auto financing that's in place in many cases and the early signs and retention are positive. So for us, it really is, let's focus on growing that channel the right way. Let's focus on the scaling that embedded product to other partners, which we're in active discussions on. And that's going to be our focus on embedded for the back half of the year.\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nOK. Thanks, Dan. One more for me, if I could hear. I got a tone, I guess, from the letter and some of your opening comments of kind of thinking about or pursuing other revenue channels.\n\nSo you mentioned even Dan, you just mentioned other prospective partners maybe besides Carvana. So excluding that and excluding the digital agency that you have mentioned there, excluding those two things, are there other things that you're thinking about that would be a different revenue source for you guys besides the traditional insurance with Carvana and other partnerships besides the digital agency?\n\nAlex Timm -- Co-Founder and Chief Executive Officer\n\nThanks, Mike. We -- on the digital agency, we continue to -- we just launched that capability. We're live in three states now, and we do expect to continue to expand that offering and to bring more partners onto that platform. We think it's a really unique offering because it allows us to basically leverage our technology, which is what we are good at, and pair that with lots of different insurance offerings.\n\nAnd as we continue to scale that, we do expect that to be a more meaningful portion long-term of our revenue. And I'll turn it over to Dan, who can talk a bit about some of the additional partnerships we're considering.\n\nDan Rosenthal -- Chief Revenue and Operating Officer\n\nYeah, Mike. First would be, we're focused on what we think we are good at, the experience that we've built up, the data that we've built up in personal auto. And we think we have a long way to go in terms of the opportunity. Certainly, what we have accomplished with Carvana has been transformational for our business and people are taking notice.\n\nAnd so we do see the opportunity to build out the embedded vertical with other partners. For us, it's about two things. Number one, stay focused on Carvana. There is still tremendous opportunity in front of us in the road map to enhance the customer experience, enhance the attach rate and drive the Carvana product forward.\n\nAnd then the good news is we believe we can scale that product and take many aspects of it into other areas and approach customers at a more meaningful point for them to buy insurance as opposed to traditional marketing. And so that is something that, for us, we think, offers better customer acquisition, profile, a better customer profile and we want to continue. From there, I think it's fair to say that the industry has taken notice of the rate filings that we have put in place, the success that Rob talked about earlier, the quick and decisive actions. And we have had different carriers reach out interested in how we're accomplishing some of that.\n\nSo we don't have any news to report on that front. But just frankly, good recognition that what we're doing in personal auto is gaining attention. People are seeing our technology working faster, and we think that will offer opportunities for us to solidify the foundation and grow the business in the future.\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nOK. Thank you, guys. Appreciate it.\n\nOperator\n\nWe will take our next question from Matt Carletti with JMP Securities. Your line is open.\n\nMatt Carletti -- JMP Securities -- Analyst\n\nGood morning.\n\nAlex Timm -- Co-Founder and Chief Executive Officer\n\nMorning.\n\nMatt Carletti -- JMP Securities -- Analyst\n\nDan, I had a couple of follow-ups on some of the comments you had there on Carvana. I guess first one is, I apologize for maybe getting ahead of myself here. But as you think about whether it's Carvana or any other potential partner, just how do you think about how much is too much? If we think about -- you talked about that channel ramping, that partnership ramping and it's 1/3 of new business coming in. If we fast forward down the road, do you guys have a mindset around just concentration with any individual partner and how you might want to potentially manage that?\n\nDan Rosenthal -- Chief Revenue and Operating Officer\n\nGood morning, Matt, and thanks for the question. Yes, this is clearly the embedded channel and the embedded opportunity and it starts with Carvana, but it will not be exclusively Carvana for us as we go forward. And I think diversification is really important. That said, we are seeing a diverse group of customers come through the Carvana channel, and it's a really attractive group of customers thus far.\n\nSo we are excited to continue. And I think our future on the embedded front is going to go in two directions. One is there is a lot more opportunity with Carvana on the road map, leveraging the reconditioning centers, the last mile delivery capabilities that Carvana has throughout the United States to just provide a highly differentiated consumer experience from Carvana insurance built with route. And we're excited to come back with Carvana in the quarters ahead and talk about some of that opportunity on the product road map.\n\nSo real, real customer benefits and opportunities coming in the future with Carvana. And then second, we've learned so much. I can't emphasize enough how open a partnership that this has been with Carvana. You're putting together two digitally native companies focused on the consumer experience and really changing the consumer experience in insurance and a lot of that learning, a lot of the sharing back and forth can be leveraged with other partners.\n\nAnd so the ability to understand the consumer, understand what the consumer wants to see in the personal auto insurance buying experience is information that we can leverage elsewhere. So I think there is going to be opportunity for us to extend the platform and stay tuned on that front. We're excited to come back to the market as we have future announcements to make.\n\nMatt Carletti -- JMP Securities -- Analyst\n\nGreat. So then just a Carvana follow-up just, Dan, you mentioned kind of just really attractive kind of customer profiles coming in through that partnership in that channel. Are there anything you can see -- I know it's early days, but anything you can see in loss ratios or just kind of whether it's frequencies or severities of accidents and similar cohorts that have come through other channels that kind of give you a little more color on that. I'm just curious because if I -- if I recall correctly, the Carvana channel is largely kind of not employing telematics correct? And so I'm just trying to get a feel for kind of the rest of the book that has your telematics technology in it versus Carvana, which I believe at this point, largely doesn't.\n\nMatt Bonakdarpour -- Chief Technology Officer\n\nThat's right. To date, we haven't yet leveraged telematics in the Carvana space. This Matt Bonakdarpour, by the way. And so Dan mentioned some of the early indicators that we saw as it pertains to customer demographics.\n\nWe are seeing a more preferred customer based on prior insurance history in the light vehicle age compared to the route direct book. But even when controlling for those demographics, we also see better-than-expected early indicators of both retention and loss ratio. It's still early days, but when we control for the customer demographics in the Carvana channel, and we compare across the Root direct channel versus Carvana, we're seeing better-than-expected retention and loss ratio. This is very encouraging.\n\nIt's a leading indicator, but we're keeping a close eye on it.\n\nMatt Carletti -- JMP Securities -- Analyst\n\nGreat. Very helpful. Thank you.\n\nOperator\n\n[Operator instructions] We will take our next question from Josh Siegler with Cantor. Your line is open.\n\nJosh Siegler -- Cantor Fitzgerald -- Analyst\n\nHi. Good morning. Thank you for taking my question. Notably, the gap between loss ratios for new and renewal business in season states narrowed this quarter.\n\nIs this a reflection of your improved pricing models in telematics in season states?\n\nAlex Timm -- Co-Founder and Chief Executive Officer\n\nHi. This is Alex. When we look at the new versus renew loss ratios. I think one of the things is we will -- you should expect to see a lot of the new pricing actually hit the new business earlier where there are things like rate capping in place, for example, for renewals.\n\nAnd so you will tend to see that new business loss ratio be a bit more of a leading indicator. But I'm going to turn it over to Frank to talk a little bit more about the particulars.\n\nFrank Palmer -- Chief Insurance Officer\n\nYeah. That's right, both on the earning in, but also on the underwriting, a lot of the underwriting actions that we take hit new business first and won't pertain as much to the renewals.\n\nJosh Siegler -- Cantor Fitzgerald -- Analyst\n\nGreat. Thank you. And then in your letter, you mentioned that the 2Q loss ratio sequential pickup was driven by a mix of seasonality and inflationary pressure. Can you help quantify how much of that was in each bucket?\n\nRob Bateman -- Chief Financial Officer\n\nYou're talking about the seasonality from Q1 to Q2?\n\nJosh Siegler -- Cantor Fitzgerald -- Analyst\n\nYep, correct.\n\nRob Bateman -- Chief Financial Officer\n\nYep. So we saw that both in our results and in industry results. And so I think it's hard to kind of tease that apart the seasonality apart with the amount of rate that's earning in.\n\nJosh Siegler -- Cantor Fitzgerald -- Analyst\n\nOK. Thank you.\n\nOperator\n\nWe will take our next question from Francois Macheras with Evercore. Your line is open.\n\nFrancois Macheras -- Evercore ISI -- Analyst\n\nGood morning. This year, cash flow used in operating activities has trended in the $50 million to $55 million per quarter. Is this a good run rate for us to think about going forward?\n\nRob Bateman -- Chief Financial Officer\n\nThis is Rob. Just to -- so you talked about the first part of the year. If I look at the second part of the year, I would expect that to improve as we are completely focused on protecting the business, strengthening the foundation of the company. We're doing everything we need to do to preserve cash.\n\nSo if you look at last year, we shut down our marketing spend in the second quarter. We've been taking rate over the last part of last year and all of this year. We had an expense reduction action in the first part of this year. We do expect for the back half of the year, our operating losses to be substantially better than -- substantially lower than they were in the second part of last year.\n\nSo we would expect in the back half of this year for that the cash burn to be about the same as the first two quarters of this year, but maybe on a little accelerated basis.\n\nFrancois Macheras -- Evercore ISI -- Analyst\n\nGot it. Thank you. And then could you just elaborate on the adverse 0.5 million [Inaudible] you took during the quarter?\n\nRob Bateman -- Chief Financial Officer\n\nYes. There was, I think, some small unfavorable development in the reserves. And what that was largely driven by was a bit of an uptick in the severity on our PD and collision. And so we did see some reserve deterioration, but it was not material.\n\nIt's not something that we believe is signs of weaknesses in our reserves. We still feel very confident in our booking.\n\nFrancois Macheras -- Evercore ISI -- Analyst\n\nGreat. Thank you.\n\nOperator\n\n[Operator instructions] And we will take our next question from Tommy McJoynt with KBW. Your line is open.\n\nTommy McJoynt -- Keefe, Bruyette and Woods -- Analyst\n\nHey. Good morning, guys. Thanks for taking my questions. Going back to your answer to Matt's question on the loss performance of Carvana relative to customers where you applied telematics as part of the underwriting process prior to coating and binding.\n\nDoes that surprise you that the performance there has been better? I would have thought there would have been maybe a difference there where the telematics would have actually played a larger impact?\n\nDan Rosenthal -- Chief Revenue and Operating Officer\n\nSo I think the telematics certainly has a large impact, and we know it's one of the most predictive variables in our rating system and in our direct business. And time and time again, we have seen that that technology is very differentiated in that our ability to segment risk using mobile sensor data, we do believe is world class. However, on Carvana, the interesting point there is it's actually a little bit of a different phenomenon, we believe, where consumers are buying that insurance for ease, not necessarily for price. So you're not getting the same shopping dynamics.\n\nObviously, you get a lot of favorability on the loss ratio, too, in terms of things like fraud, where if I just purchased a vehicle, I know that there's no pre-existing damage to that vehicle. So we are seeing a lot of sort of favorable selection where we're seeing reduced sort of moral hazards to in that channel. And I think that that's what you see driving maybe the benefit there. And the other thing I'll say is we expect the loss ratios to continue to materially improve.\n\nAnd even through this quarter, quarter to date, we are continuing to see our loss ratio materially improve across both Carvana and our direct business.\n\nTommy McJoynt -- Keefe, Bruyette and Woods -- Analyst\n\nYeah. Those are a couple of good points. And then switching over, in the past, you've talked about a high percentage of the workflow for rating changes being somewhat automated. Could you give us a little more detail on which parts of the process are automated? And is that process kind of what you're thinking of monetizing perhaps to other carriers to the industry that are inquiring as to how you're able to take all the rate that you have?\n\nMatt Bonakdarpour -- Chief Technology Officer\n\nYeah. Thanks. This is Matt. We have invested a considerable amount of effort in our pricing platform that allows us to do the end-to-end research process from identifying new rating variables all the way through creating rate filing exhibits for the regulators in an automated fashion with very little software engineering input required.\n\nSo that way we've developed it is from a platform perspective to allow the users of the platform, the customers, being the data scientists, the actuaries and the state managers to basically create competerations or select from drop-down menus exactly how they want to test different pricing elements, get the exhibits, compare them to our incumbent models and automatically generate rate filing visits to send over to the regulator, so each of those components have become automated over time. Really, the only time we need an engineer to support a new rate filing is if we have a completely new data source that we have never used before. We have to create a connection to the third-party vendor ingest that data. And then from there, we use the platform like everywhere else.\n\nDan alluded to this before, but that platform has allowed us to act more quickly, and it's caught the attention of those in the industry. And so we have had active conversations about that platform and others. But we do believe that it's this investment in our technology that has allowed us to not only identify the trends but act more quickly on them.\n\nDan Rosenthal -- Chief Revenue and Operating Officer\n\nYes. I might just add there that as we think about the over 30 rate increases that we've taken this year, over two-thirds of them have been complete rate plan upgrades, not just base rate increases. So there's a lot of companies that can just raise rates 5%, 7%, 8% fairly quickly. But it's much harder throughout the industry.\n\nIt takes much longer to be able to update all of your factors. And so we've been able to -- that automation that Matt was describing is across the board. So we've been able to completely upgrade the rate plans in most of our states this year.\n\nTommy McJoynt -- Keefe, Bruyette and Woods -- Analyst\n\nThat's a good explanation. Thanks, guys.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChristine Patrick -- Vice President, Investor Relations\n\nAlex Timm -- Co-Founder and Chief Executive Officer\n\nRob Bateman -- Chief Financial Officer\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nFrank Palmer -- Chief Insurance Officer\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nDan Rosenthal -- Chief Revenue and Operating Officer\n\nMatt Carletti -- JMP Securities -- Analyst\n\nMatt Bonakdarpour -- Chief Technology Officer\n\nJosh Siegler -- Cantor Fitzgerald -- Analyst\n\nFrancois Macheras -- Evercore ISI -- Analyst\n\nTommy McJoynt -- Keefe, Bruyette and Woods -- Analyst\n\nMore ROOT analysis\n\nAll earnings call transcripts"
}