{
  "companyName": "Dollar General",
  "companyTicker": "DG",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/25/dollar-general-dg-q2-2022-earnings-call-transcript/",
  "content": "Dollar General (DG -0.49%)\nQ2 2022 Earnings Call\nAug 25, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning. My name is Robert, and I will be your conference operator today. At this time, I'd like to welcome everyone to Dollar General's second quarter 2022 earnings conference call. Today is Thursday, August 25, 2022.\n\n[Operator instructions] This call is being recorded. [Operator instructions] Now I'd like to turn the conference over to your host, Mr. Donny Lau, vice president of investor relations and corporate strategy. Mr.\n\nLau, you may begin the conference.\n\nDonny Lau -- Vice President, Investor Relations\n\nThank you, and good morning, everyone. On the call with me today are Todd Vasos, our CEO; Jeff Owen, our COO; and John Garratt, our CFO. Our earnings release issued today can be found on our website at investor.dollargeneral.com under News & Events.Let me caution you that today's comments include forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. Such a statements about our financial guidance, strategy, initiatives, plans, goals, priorities, opportunities, investments, expectations or beliefs about future matters and other statements that are not limited to historical fact.\n\nThese statements are subject to risks and uncertainties that could cause actual results to differ materially from our expectations and projections. These factors include, but are not limited to, those identified in our earnings release issued this morning under Risk Factors in our 2021 Form 10-K filed on March 18, 2022, and any later filed periodic report and in the comments that are made on this call. You should not unduly rely on forward-looking statements, which speak only as of today's date. Dollar General disclaims any obligation to update or revise any information discussed in this call, unless required by law.\n\nAt the end of our prepared remarks, we will open the call up for your questions. [Operator instructions] Now it is my pleasure to turn the call over to Todd.\n\nTodd Vasos -- Chief Executive Officer\n\nThank you, Donny, and welcome to everyone joining our call. We are pleased with our second quarter results, and I want to thank our associates for delivering another quarter of strong performance and for their dedication to serving our customers, communities, and each other. The quarter was highlighted by comp sales growth of 4.6%, a slight increase in customer traffic, accelerated growth in market share of highly consumable product sales, including in both dollars and units, and double-digit growth in diluted EPS. Our Q2 performance was led by stronger-than-expected sales in our consumable category.\n\nThis increase was partially offset by a decline in our combined non-consumable categories, which we believe reflects the evolving consumer demand during a period of inflation and economic uncertainty. During the quarter, and from a position of strength, we made targeted investments in both incremental labor hours and wages to further enhance the customer experience and build on our sales momentum. We believe these investments contributed to an improvement in our overall in-stock position and our strong sales results. And despite challenges from rising product cost inflation and ongoing supply chain pressures, our teams remain focused on controlling what we can control while continuing to deliver value for our customers, which we believe is seen even more important in the current environment.\n\nTo that end, we remain committed to offering products at the $1 or less price point, and we're pleased with the strong performance of this program during Q2, especially in the latter part of the quarter. Importantly, we continue to feel very good about our price position relative to competitors and other classes of trade. And with more than 18,500 stores located within five miles about 75% of the U.S. population, we believe we are well-positioned to navigate the current environment while continuing to support our customers through our unique combination of value and convenience.\n\nLooking ahead, we remain focused on advancing our operating priorities and strategic initiatives as we look to strengthen our competitive position while further distancing and differentiating Dollar General from the rest of the retail landscape. Now let me recap some of the additional financial results for the second quarter. Net sales increased 9% to $9.4 billion, compared to net sales of $8.7 billion in Q2 of 2021. From a monthly cadence perspective, comp sales were lowest but positive in May, with July being our strongest month of performance, and I'm pleased with the momentum we see so far in Q3.\n\nIn fact, as a result of our first-half outperformance and strong start to Q3, as well as our expectations for the remainder of the year, we are increasing our sales outlook for fiscal 2022, which John will discuss in more detail shortly. Our Q2 results included an increase in average basket size, largely driven by inflation, as we would expect, during a more challenging economic environment. Average units per basket were down, while, as I mentioned earlier, customer traffic increased slightly. As the quarter progressed, we saw additional signs of our core customers shopping more intentionally and closer to need, as well as an increase in trade-down activity.\n\nFor example, during Q2, customers appeared to be making trade-offs of some of their food choices, contributing to an increase in private brand penetration within our consumables business. We also saw growth in the number of higher-income households shopping with us, which we believe reflects more consumers choosing Dollar General as they seek value. Collectively, we view our Q2 results as further validation that our strategic actions, which have transformed this company in recent years, positions us well for continued success while supporting long-term shareholder value creation. We continue to operate in one of the most attractive sectors in retail.\n\nAnd given our strong competitive position, further enhanced by our robust portfolio of short- and long-term initiatives, I have never felt better about the underlying business model or our future growth potential. With that said, I'd like to take this opportunity to congratulate Jeff Owen, who will officially take over as CEO in November. No one understands and embodies our culture more than Jeff, and his contributions to our strategic direction over the years have been instrumental to our success. I've had the pleasure of working with Jeff for many years, and I'm confident he is the best and most capable person to lead the next phase of growth here at Dollar General.\n\nAnd finally, while Jeff will speak more to this later, I also want to congratulate John Garratt on his well-deserved promotion to president and CFO. With that, I will now turn the call over to John.\n\nJohn Garratt -- Chief Financial Officer\n\nThank you, Todd, and good morning, everyone. First, let me take a moment to thank Todd for his tremendous leadership and passion for our customers, our culture and this company. He has been a wonderful mentor and friend, and we wish him all the very best as he prepares to begin this new chapter. And let me also add my congratulations to Jeff, who I have known and worked closely with for several years.\n\nHe is a highly respected leader throughout the organization, and we look forward to his leadership in the years ahead. Given Todd has taken you through a few highlights of the quarter, let me now take you through some of its important financial details. Unless we specifically note otherwise, all comparisons are year over year. All references to EPS refer to diluted earnings per share and all years noted refer to the corresponding fiscal year.\n\nAs Todd already discussed sales, I will start with gross profit. For Q2, gross profit as a percentage of sales was 32.3%, an increase of 69 basis points. This increase was primarily attributable to higher inventory markups, partially offset by a higher LIFO provision, a greater proportion of sales coming from our consumables category, as well as increases in markdowns, transportation costs, distribution costs, and damages. Of note, product cost inflation was greater than anticipated, resulting in a LIFO provision of approximately $144 million during the quarter.\n\nSG&A as a percentage of sales was 22.6%, an increase of 82 basis points. This increase was driven by expenses that were greater as a percentage of sales, the most significant of which were retail labor, repairs and maintenance, utilities and payroll taxes. Moving down the income statement. Operating profit for the second quarter increased 7.5% to $913 million.\n\nAs a percentage of sales, operating profit was 9.7%, a decrease of 13 basis points. Our effective tax rate for the quarter was 22.1% and compares to 21.4% in the second quarter last year. Finally, as Todd noted, EPS for the second quarter increased 10.8% to $2.98. Turning now to our balance sheet and cash flow, which remains strong and provide us the financial flexibility to continue investing for the long term, while delivering significant returns to shareholders.\n\nMerchandise inventories were $6.9 billion at the end of the second quarter, an increase of 31.4% overall and 25.1% on a per store basis. Similar to Q1, this increase primarily reflects the impact of product cost inflation, as well as a greater mix of higher-value products, particularly in the home and seasonal categories, as a result of the continued rollout of our nonconsumables initiative. And importantly, we continue to believe the quality of our inventory is in good shape. As Todd noted, we're also pleased with the improvements we saw in our in-stock levels during the quarter and expect continued improvement as we move through 2022, underscoring our optimism that we are well-positioned to better serve our customers in the back half of the year.\n\nYear to date through Q2, the business generated cash flows from operations totaling $948 million, a decrease of 28%. Total capital expenditures for the first half were $659 million and included our planned investments in new stores, remodels and relocations, distribution and transportation projects, and spending related to our strategic initiatives. During the quarter, we repurchased 1.5 million shares of our common stock for $349 million and paid a quarterly dividend of $0.55 per common share outstanding for a total payout of $124 million. At the end of Q2, the remaining share repurchase authorization was $1 billion.\n\nWe announced today that our board has increased this authorization by $2 billion. Our capital allocation priorities continue to serve us well and remain unchanged. Our first priority is investing in high-return growth opportunities, including new store expansion and our strategic initiatives. We also remain committed to returning significant cash to shareholders through anticipated share repurchases and quarterly dividend payments, all while maintaining our current investment-grade credit rating and managing to a leverage ratio of approximately three times adjusted debt to EBITDAR.\n\nMoving to an update on our financial outlook for fiscal 2022. We continue to experience uncertainties with respect to product cost inflation, supply chain dynamics, the evolution of consumer spending throughout the year, and most recently, new store opening delays, which Jeff will discuss in more detail. Despite these challenges, we are confident in the business, and as Todd mentioned, we are increasing our sales outlook for 2022. For the full year, we now expect the following: net sales growth of approximately 11%, including an estimated benefit of approximately 2 percentage points from the 53rd week and same-store sales growth of approximately 4% to 4.5%.\n\nAdditionally, we are reiterating the remainder of our financial guidance for 2022, which includes EPS growth of approximately 12% to 14%, including an estimated benefit of approximately 4 percentage points from the 53rd week, share repurchases of approximately $2.75 billion, and capital spending in the range of $1.4 billion to $1.5 billion. Our EPS outlook also now assumes an effective tax rate in the range of 22% to 22.5%. Let me now provide some additional context as it relates to our outlook. In terms of the quarterly cadence, we anticipate comp sales to be fairly consistent between Q3 and Q4, but EPS growth to be much higher in the fourth quarter, which includes the anticipated benefit from the 53rd week.\n\nIn addition, we expect share repurchases in Q3 to be slightly higher than the Q2 amount before increasing more substantially in Q4, partially as a result of the extra week in our fourth quarter. Finally, as a result of an increase in interest rates and additional borrowings, we expect interest expense will be higher in the second half of the year. Turning now to gross margin for 2022. We expect to continue realizing benefits from our initiatives, including DG Fresh and NCI, throughout the year.\n\nIn addition, we are optimistic that distribution and transportation efficiencies, including continued expansion of our private fleet, will drive additional benefits despite anticipated and continued cost pressures in the near term. Offsetting some of these benefits is an expected continuation of sales mix pressure, as well as sales outperformance, as our sales outperformance has been predominantly driven by growth in our consumables category, which generally has a lower gross profit rate than other product categories. With regards to SG&A, we expect continued investments in our strategic initiatives as we further their rollouts. However, in aggregate, we continue to expect they will positively contribute to operating profit and margin in 2022 as we expect the benefits to gross margin from our initiatives will more than offset the associated SG&A expense.\n\nWe also continue to pursue efficiencies and savings through our Save to Serve program, including Fast Track, and we believe these savings in 2022 will continue to offset a portion of expected wage inflation. Finally, and consistent with Q2, our outlook includes continued investments to further enhance the customer experience, including incremental labor hours and wages, to drive continued improvement in overall in-stock levels and customer service. In summary, we are proud of our team's hard work and commitment to execution, which has resulted in our strong second quarter results. As always, we continue to be disciplined in how we manage expenses and capital with the goal of delivering consistent, strong financial performance, while strategically investing for the long term.\n\nWe remain confident in our business model and our ongoing financial priorities to drive profitable same-store sales growth, healthy new store returns, strong free cash flow, and long-term shareholder value. With that, I will turn the call over to Jeff.\n\nJeff Owen -- Chief Operating Officer\n\nThank you, John. Let me take a moment to express my appreciation for all Todd has done for this company throughout his 14-year career. He's led us through a transformational period and has positioned us extremely well for the future. On behalf of the entire Dollar General team, we want to sincerely thank him for the impact he has made on our business.\n\nI am fortunate to have been able to learn from him, and I look forward to his ongoing counsel. And as Todd noted, we are excited to announce that John has been promoted to president while continuing to serve as CFO. John has made many significant contributions to Dollar General during his time leading our finance and corporate strategy teams, and I look forward to his continued leadership and partnership as he steps into this new role. Finally, let me also say how humbled and privileged I am by the opportunity to serve this great team as the next CEO of Dollar General.\n\nI couldn't be more excited about our future and all that we can accomplish together. Now let me take the next few minutes to update you on our operating priorities and strategic initiatives as we continue to create opportunities for meaningful growth. Our first operating priority is driving profitable sales growth. We continue to make progress executing against our robust portfolio of initiatives.\n\nLet me take you through some of the recent highlights. Starting with our nonconsumable initiative, or NCI, which was available in nearly 15,000 stores at the end of the second quarter. We continue to be very pleased with the strong sales and margin performance we are seeing across our NCI store base. This treasure hunt offering continues to resonate with value-seeking customers as approximately 80% of the assortment is priced at $5 or less.\n\nWe expect to realize ongoing sales and margin benefits from NCI in 2022 and are on track to complete the rollout across nearly the entire chain by the end of the year. Moving to our pOpshelf store concept, which further builds on our success and learnings with NCI. As a reminder, pOpshelf aims to engage customers by offering a fun, affordable and differentiated treasure hunt experience delivered through continually refreshed merchandise, a differentiated in-store experience and exceptional value with the vast majority of our items priced at $5 or less. During the quarter, we opened 14 new pOpshelf locations, bringing the total number of stores to 80, located within eight states.\n\nAdditionally, we opened seven new store-within-a-store concept during the second quarter. This brings the total number of Dollar General market stores, which incorporates a smaller footprint pOpshelf store to a total of 32 at the end of the quarter. We plan to nearly triple the pOpshelf store count this year, and now expect to open a total of 15 store-within-a-store concepts, which would bring us to about 150 stand-alone pOpshelf locations and approximately 40 store-within-a-store concepts by year end. Over the long term, we anticipate year one annualized sales volumes for these stores to be between $1.7 million and $2 million per store and expect the average gross margin rate to exceed 40%.\n\nOverall, we continue to be pleased with the results of this unique and differentiated concept, and we are excited about our goal of approximately 1,000 pOpshelf locations by year-end 2025. Turning now to DG Fresh, which is a strategic, multiphase shift to self-distribution of frozen and refrigerated goods, along with a focus on driving continued sales growth in these areas. As a reminder, we completed the initial rollout of DG Fresh across the entire chain in 2021 and are now delivering to nearly 19,000 stores from 12 facilities. The initial objective of DG Fresh was to reduce product cost on our frozen and refrigerated items, and we continue to be very pleased with the savings we are seeing.\n\nAnother important goal of DG Fresh is to increase sales in frozen and refrigerated categories. We are also pleased with the performance on this front, including enhanced product offerings in stores and strong performance from our perishables department, which had our strongest rate of comp sales growth during the first half of the year. Looking ahead, we expect to realize additional benefits from DG Fresh as we continue to optimize our network, further leverage our scale, deliver an even wider product selection and build on our multiyear track record of growth in cooler doors and associated sales. And while produce was not included in our initial rollout, we continue to believe that DG Fresh provides a potential path forward to expanding our produce offering to more than 10,000 stores over time.\n\nNotably, at the end of Q2, we offered produce in more than 2,700 stores, with plans to expand this offering to a total of more than 3,000 stores by the end of 2022. Finally, as I previously mentioned, DG Fresh has also extended the reach of our cooler expansion program. During Q2, we added over 17,000 cooler doors across our store base, and we are on track to install more than 65,000 cooler doors in 2022. Importantly, despite the meaningful improvements we have made to date as a result of DG Fresh, we believe we still have significant opportunity to drive additional returns with this initiative in the years ahead.\n\nTurning now to an update on our health initiative, branded as DG Wellbeing. The initial focus of this project is an expanded health offering, which consists of approximately 30% more feet of selling space and up to 400 additional items as compared to our standard offering. This offering was available in approximately 2,700 stores at the end of Q2, and we are on track to expand to a total of more than 4,000 stores by the end of 2022. During the quarter, we announced the establishment of a new Healthcare Advisory Panel, which recently convened its first quarterly meeting.\n\nThe panel is composed of highly regarded healthcare industry subject matter experts who will serve as thought partners to our team, including advising on how best to invest resources to better serve our customers in the health and wellness space. Looking ahead, our plans include further expansion of our health offering, with the goal of increasing access to basic healthcare products and ultimately services over time, particularly in rural America. In addition to the gross margin benefits associated with the initiatives I just discussed, we continue to pursue other opportunities to enhance gross margin, including improvements in private brand sales, global sourcing, supply chain efficiencies, and shrink reduction. To that end, we recently announced plans to significantly increase our supply chain capacity by building three new distribution centers in North Little Rock, Arkansas; Aurora, Colorado; and Salem, Oregon.\n\nEach facility will be approximately 1 million square feet and supported, in part, by our growing private fleet. We expect to begin construction on the Arkansas and Oregon facilities this fall, with both of which will be combo traditional and fresh distribution centers. We have already begun construction on the Colorado facility, which will be a traditional dry goods distribution center. We are excited about these new projects, which we expect will add more than 1,000 new jobs supporting our ongoing store growth and drive additional efficiencies in our supply chain.\n\nOur second priority is capturing growth opportunities. Our proven high-return, low-risk real estate model has served us well for many years and continues to be a core strength of our business. In the second quarter, we completed a total of 790 real estate projects, including 227 new stores, 533 remodels, and 30 relocations. For 2022, we are updating our real estate plans to reflect adjustments made, primarily in response to ongoing delays related to permitting and the receipt of construction materials associated with the new store openings.\n\nFor 2022, we now plan to execute in the range of 2,930 to 2,980 real estate projects in total, including 1,010 to 1,060 new stores, approximately 1,795 remodels, and about 125 store relocations. We continue to expect approximately 80% of our new Dollar General stores in 2022 to be in our larger 8,500 square foot store format, which allows us for an even greater assortment as we look to serve our customers with products they want and need. Importantly, we continue to be very pleased with the unit economics of this larger format, highlighted by increased sales productivity, and we continue to target returns in the range of 20% to 22%. In addition to our planned Dollar General and pOpshelf growth in 2022, we are very excited about our plans to expand internationally, and we continue to make good progress toward our goal of opening our first stores in Mexico by the end of 2022.\n\nI am pleased to announce that these stores will be branded under the name The Super Dollar General, which resonated well with customer focus groups and connotes the idea of a local general store focused on serving customers with products they want and need most. In addition, the initial stores will be located in underserved communities in Northern Mexico as we look to initially leverage our brand awareness, while extending our value and convenience proposition to a customer base that is similar to our core customer in the United States. Overall, our real estate pipeline remains robust. And with more U.S.\n\nbrick-and-mortar stores than any retailer, we are excited about our ability to capture significant growth opportunities in the years ahead. Next, our digital initiative, which is an important complement to our physical footprint as we continue to deploy and leverage technology to further enhance convenience and access for customers. Our efforts remain centered around creating a digital front porch to our stores as we look to create deeper and more meaningful connections with our customers. We ended Q2 with nearly 4.5 million monthly active users on the digital app and expect this number to grow as we look to further enhance our digital offerings.\n\nOur partnership with DoorDash continues to resonate with both new and existing customers as we look to extend the value offering of Dollar General, combined with the convenience of same-day delivery and an hour or less. This offering was available in more than 13,300 stores at the end of Q2, and we continue to be very pleased with the results, including sales above our initial expectations for the first half of the year. In addition, we are also excited about the continued growth of our DG Media Network. We are seeing significant interest in participation from CPG companies and brands who are seeking to connect with the more than 80 million unique customer profiles, especially our rural customers, who represent about 30% of the country and allude the reach of other retail media networks.\n\nAs a result, we are enabling advertisers to both digitally and physically build awareness and drive purchase consideration, while positioning Dollar General as a retailer of choice for customers seeking many of America's most trusted brands. After establishing the foundation over the last few years, we are beginning to meaningfully grow this business, as we expand the program and enhance the value proposition for both our customers and brand partners, while increasing the overall net financial benefit for the business. Overall, our strategy consists of building a digital ecosystem specifically tailored to provide our customers with an even more convenient, frictionless and personalized shopping experience, and we are pleased with the growing engagement we are seeing across our digital properties. Our third operating priority is to leverage and reinforce our position as a low-cost operator.\n\nWe have a clear and defined process to control spending, which continues to govern our disciplined approach to spending decisions. This zero-based budgeting approach, internally branded as Save to Serve, keeps the customer at the center of all we do, while reinforcing our cost control mindset. Our Fast Track initiative is a great example of this approach, where our current goals include increasing labor productivity in our stores and enhancing customer convenience. The first phase of Fast Track consisted of both rolltainer and case pack optimization, which has led to the more efficient stocking of our stores.\n\nThe second component of Fast Track is self-checkout, which provides customers with another flexible and convenient checkout solution, while also driving greater efficiencies for our store associates. Self-checkout was available in approximately 10,000 stores at the end of Q2, and we continue to be pleased with our results, including strong customer adoption rates. We are also excited about our pilot in select stores, which provides customers the option to utilize self-checkout in all lanes, but also choose a staffed register preferred. We believe this full self-checkout option could further enhance our convenience proposition, while enabling store teams to dedicate even more time to serving customers.\n\nWe plan to ultimately test this layout in about 200 stores by the end of this year. Looking ahead, we are on track to expand our self-checkout offering to a total of up to 11,000 stores by the end of the year as we look to further extend our position as an innovative retail and small box discount retail. Moving forward, the next phase of Fast Track consists of increasing our utilization of emerging technology and data strategies, which includes putting new digital tools in the hands of our field leaders. When combined with our data-driven inventory management, we believe these efforts will drive greater efficiencies for our retail leaders and their teams.\n\nOur efforts to reduce costs have also benefited from our growing private fleet, which consisted of more than 1,100 tractors at the end of Q2. As a reminder, we are focused on significantly expanding our private fleet in 2022 as we plan to more than double the number of tractors from 2021, which we expect will account for approximately 40% of our outbound transportation fleet by the end of the year. Our underlying principles are to keep the business simple, but move quickly to capture growth opportunities, while controlling expenses and always seeking to be a low-cost operator. Our fourth operating priority is investing in our diverse teams through development, empowerment and inclusion.\n\nAs a growing retailer, we continue to create new jobs and opportunities for personal and professional development, and ultimately, career advancement. To that end, we are very pleased with our DG Discover Hiring event in Q2, which exceeded our goal for new hires while adding significant talent to our teams in the field, distribution centers, and private fleet. With regards to development, our internal promotion pipeline remains robust as evidenced by internal placement rates of more than 75% at or above the lead sales associate position. Additionally, approximately 15% of our private fleet began their careers with us in either a store or distribution center.\n\nWe also continue to be pleased with our turnover rates, staffing levels and applicant flow, further validating our belief that we are taking the right actions to attract and retain talent. Ultimately, we believe that the opportunity to start and develop a career with a growing and purpose-driven company is a unique competitive advantage and remains our greatest currency in attracting and retaining talent. We also held our annual leadership meeting earlier this month in Nashville, providing an important collaboration and development experience for more than 1,500 leaders of our company. This event is a high point for me every year, and I am always inspired by the incredible talent of our people and humbled by the way they live out their personal purpose, while fulfilling our mission to serve others.\n\nIn closing, I am proud of the team's strong performance as we continue to make great progress against our operating priorities and strategic initiatives, while creating meaningful value for our shareholders. I want to thank our approximately 173,000 employees for their work every day to make a difference in the lives of our customers, especially at times like this when they need us the most. I am excited about all that we will accomplish together in the second half of 2022 and beyond. With that, operator, we would now like to open the lines for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Rupesh Parikh with Oppenheimer. Please proceed with your question.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGood morning. So first, Todd, congrats on all the success over the years. And Jeff and John, congrats on your well-deserved promotions.\n\nJohn Garratt -- Chief Financial Officer\n\nThank you.\n\nJeff Owen -- Chief Operating Officer\n\nThank you.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nSo I was hoping to first touch just on your price position. So how do you feel about your pricing position today in light of some of the competitive actions that are taking place right now and are expected to happen going forward?\n\nTodd Vasos -- Chief Executive Officer\n\nYeah. Rupesh, this is Todd. I'll take that one. We feel great about our price position.\n\nI just want to remind everybody, well over a year ago, we took a very aggressive price stance, as you may recall me talking about over the last 18 months or so. And it positions us so well in the pandemic and now exiting the pandemic time frame. And we feel great about where we are on prices against all classes of trade, and of course, against even our chief competitors, we're in really good shape. And obviously, as we continue to move forward with this environment, we'll continue to look at how we service our customer.\n\nThe fabulous thing is we're in a great position, and our customers are really showing through our increase in trips that we saw for the quarter that they rely on our everyday low price here at Dollar General always first before anything else.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGreat. And then my one follow-up question, maybe for John. So there was pretty significant deleverage on more than 4% comp. So anything unusual to happen in Q2 that doesn't repeat for the back half of the year? And then just any more color in terms of how to think about SG&A for the back half.\n\nThank you.\n\nJohn Garratt -- Chief Financial Officer\n\nThanks, Rupesh. As you look at SG&A, nothing unusual there. One thing we had talked about was from a position of strength and given the sales outperformance and momentum that we were going to be making targeted proactive investments to build on that momentum, to help drive sales, as well as an enhanced customer experience. So really, it was consistent with that.\n\nThe most notable one was adding some labor hours to help further improve our in-stock levels, as well as that customer service. We really like what we're seeing there. Also, to a lesser extent, we did make targeted investments in wages in the physical box itself. But I would say more normal course proactive actions to drive the business.\n\nWe also did see some inflation on utilities and did have some higher-than-normal R&M expenses associated with the weather. But I think when you look at just overall operating margin, we feel really good about what we're doing. We feel great about the gross margin expansion. A lot of the investments we make in SG&A really drives that gross margin expansion, which was up 69 basis for the quarter, and importantly, 1.5 points above where we were three years ago.\n\nSo we really like to look at operating profit overall because, as we said before, the geography and the leverage changes a little bit as we spend a little bit on SG&A to drive more on gross margin as you look at the implied guidance with the sales and the strong bottom-line guide for the year, that implies operating margin expansion over the back half. So we feel well-positioned that we're making the right trade-offs and investments to drive that sales growth.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question is from Matthew Boss with J.P. Morgan. Please proceed with your question.\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nThanks, and congrats on another great quarter, guys.\n\nJohn Garratt -- Chief Financial Officer\n\nThank you.\n\nJeff Owen -- Chief Operating Officer\n\nThank you.\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nSo first, could you just speak to the top-line acceleration that you're seeing despite the tougher backdrop for low-income households that, I think, broadly, we're seeing. How best to think about the inflection back to positive traffic that you saw this quarter? And what are you seeing from retention of new customers that you've recently acquired?\n\nTodd Vasos -- Chief Executive Officer\n\nYeah, Matt. Thanks for the question. Yeah, I would tell you that, as expected, the customer is reacting just like we thought she would. And that is she's shopping closer to need.\n\nShe's being very intentional in her shopping patterns, as well as her shopping while she's inside the four walls of the Dollar General store. It is a little bit more skewed to need based, which we thought would also occur. But the great thing is what we're seeing is that if we do have the right product out there, which we do, on the discretionary side, she's shopping that as well. As an example, our harvest in Halloween is off to a fabulous start, well over what we expected.\n\nSo again, you got to have the right items at the right value, and that's what Dollar General is all about as you know. With that more intentional shopping, we also see her buying more private brands. So our private brand sales have continued to increase quarter over quarter, as well as year over year. And so we're seeing that.\n\nAnd then the all-important $1 price point. By the way, the $1 price point was one of, if not, the fastest-growing subcategory we had here at Dollar General in Q2. And we're seeing that it is so much more important for her today than ever before to be able to feed her family toward the end of the month. So we're definitely leaning in both in private brand and the $1 price point.\n\nYou may remember, I mentioned a couple of quarters ago, that we anticipated this, so we started to bring in more of this type of product, as well as our merchants under Emily Taylor and her group to really highlight that in off-shelf displays, end caps and that has been ongoing. And we'll continue to press forward on that as we move to the back half of the year because, again, we believe that $1 price point will be very, very important. And then lastly, just like we thought, again, trips being up, so she's coming more often, but spending less on each trip. And again, that's a reversal to what we saw there in the pandemic.\n\nSo she's really coming back to where we suspected she would. But the great thing about Dollar General is our price is fabulous. Our price position, as I mentioned earlier, couldn't be better, and she's showing it within those trips that she's bringing to Dollar General. So more to come as we move through the back half of this year and into '23.\n\nBut I would tell you, I've never felt better about our positioning as we are here to help that customer through probably the toughest time she's seen in quite a while.\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nThat's great. And then maybe, John, on gross margin. How best to think about the components in the back half if we're thinking about mark on LIFO or mix? And then just larger picture, holding the earnings guide today despite the better sales outlook, so is this solely the targeted investments that you cited that's holding back incremental model flow through?\n\nJohn Garratt -- Chief Financial Officer\n\nSure. I'll start with gross margin. We didn't give specific guidance on gross margin. But to give you some color around the puts and the takes, we do expect to continue to see mixed pressure over the course of the remainder of the year as sales outperformance exceeds -- on consumables, exceeds nonconsumables, as everybody is seeing.\n\nAnd we also do expect to see ongoing supply chain pressures, including higher fuel costs, as well as increased product cost inflation. So we expect that to continue. But I would tell you, on the transportation side and supply chain in general, we are seeing moderation there, and we do get an easier lap in the back half as we lap pretty substantial and growing supply chain inflation last year. And we're doing a lot of good things to help mitigate that.\n\nAs Jeff mentioned in the prepared comments, doubling the size of the private fleet, really has a meaningful impact on that where we save about 20% on a per driver basis there. The other thing we called out was markdowns, but I would tell you, with the markdowns, that's really a function of normalization. We were lapping unusually low clearance markdowns and promotional markdowns last year. If you look at where we're at now, still well below pre-pandemic levels, but that lap will continue to be a bit of a pressure to us.\n\nBut as we look at the back half of the year, in addition to the easing inflationary pressures, particularly on the supply chain and some other areas and the actions we're taking, we're continuing to see growing benefits from our strategic initiatives, which go after the top line and the bottom line, other actions to help mitigate that. And as I mentioned previously, when you look at operating margin overall, it suggests expansion in the back half given all the actions we're taking. So -- and as we look ahead, I think we're very well-positioned to continue to expand our gross margin over the long term. Todd talked about being in a great spot on price position.\n\nAnd again, as a limited SKU operator with our growth in size, I think it really positions us well in this environment to serve that customer very well. Be sharp on price, but to continue to expand our margins over the long term. And in terms of the question around why not raise EPS guidance, I would say that, first, very pleased based on the strength of the first half of the year and the anticipated results in the back half to raise the sales guidance, and pleased to reiterate the strong EPS guidance, while others have had to lower it in this challenging environment. We see the business fundamentals is very strong.\n\nIt positions us very well to continue to be double-digit EPS growers over the long term, which we were at 10.8% this quarter. But there are some near-term headwinds. We mentioned the ongoing mix pressure. The overperformance in sales has been on the consumables side, which has lower margins.\n\nAnd while we do expect some moderation in inflation in the near term, it remains pressured with elevated supply chain costs, fuel costs and product cost inflation, of course, the LIFO charge, which continues throughout the year as that's spread over the year. Also another piece which you mentioned is the SG&A investment, which I talked about. I wouldn't say that's the only driver, the primary driver. But that is a driver to that.\n\nBut again, we like what we're seeing there in terms of the investment in labor hours to help drive a better customer experience, to help drive sales and we are investing, as I mentioned, a little bit in targeted investments in wages in the box itself. And then the other thing we called out was interest. Interest will be higher in the back half of the year given higher interest rates and higher borrowings. So a number of near-term tailwinds, but we feel really good to be able to maintain that guidance, continue to see ourselves as double-digit EPS growers over the long term.\n\nAnd there's a lot of year left but feel good about the guidance we've provided.\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nCongrats again. Best of luck.\n\nOperator\n\nOur next question is from Simeon Gutman with Morgan Stanley. Please proceed with your question.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nHey, good morning, everyone. Probing a bit on the sales guidance for the back half, I recognize that the one-year comp is guided to accelerate. If we look at the three-year stack, it looks like Q2 accelerated quite a bit and that the second half actually doesn't imply much of an acceleration. So curious given the trade down and, I guess, where the customer is going, seems to benefit you right now.\n\nAny assumptions, other than conservatism, that you're thinking about in terms of sales for the second half?\n\nJohn Garratt -- Chief Financial Officer\n\nYeah. As you look at sales in the second half, I mean, when you do the squeeze on that that's quite healthy sales, not only on a three-year basis, but as you look at the one-year basis. To your point, we did see accelerating comps, we saw accelerating comps throughout the quarter. So we feel really good about the momentum of the business going in.\n\nWe feel really good about the new customers and basket size growth that we've been able to retain coming out of the pandemic. And we are starting to see signs of more customer trade down, that's contemplated in the guidance. I wouldn't say we have a significant impact from that built into the guidance. But based on what we're seeing, that is contemplated in there.\n\nWe're seeing a bigger impact, as big as ever impact from our real estate with the strong performance of remodels and new units, which are exceeding our pro forma, and the initiatives are delivering. So we feel really good about where we're at, the momentum of the business, the fundamentals, and I think the guidance reflects that, as well as a little bit in there contemplated around that trade down.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nAnd maybe the follow-up, just honing on the gross margin a bit. Q2 was quite good and at a structurally higher level. Can you talk about the sustainability of this? And if there was some -- maybe some puts in and takes, but it feels like we're run rating at a higher level, and not thinking about guidance into '23, but are the drivers actually accelerating? You mentioned some relief on input costs. Are the drivers accelerating such that this is only going to build from here?\n\nJohn Garratt -- Chief Financial Officer\n\nYeah. Again, I don't want to get too specific around gross margin guidance. But again, as you do the squeeze in the back half, it implies healthy, positive operating margin expansion and gross margin. We feel good about where we're at here in terms of sustainability over the long term to drive that.\n\nThe biggest driver when you look, again, you go back to pre-pandemic levels where we're up 1.5 points in this quarter. It's the initiative is a huge piece of that. The ongoing benefit of DG Fresh and NCI, as we optimize and scale those, that's the gift that keeps on giving other things around the DG Media Network, just while promotional activity was a little bit higher versus pandemic where there was none. We remain very targeted in that and are doing a great job minimizing the clearance activity.\n\nSo I think as you think the fundamental drivers of the initiatives, as you think about the other levers we've talked about, the efficiencies we're driving in supply chain, including the private fleet and the other levers we've talked about. And we do see spots where the inflation is starting to moderate, particularly around carrier rates ocean freight, we're seeing moderation there. It remains to be seen what happens to inflation overall with vendors, but we'd expect over time that growth, that pace of increases to start to moderate as well. And again, as you get to the back half of the year, we're lapping pretty substantial increasing supply chain inflationary laps.\n\nAnd so as we see some moderation and get easing laps, that will help as well. And that's all contemplated in the guide.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nGreat. Thanks. Good luck. Congratulations.\n\nJohn Garratt -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question is from Michael Lasser with UBS. Please proceed with your question.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning. Thanks a lot for taking my questions. Todd, Jeff and John, congratulations on all your new endeavors. My first question is the success of Dollar General over many years has been driven by not only a superior execution and formal strategy, but also some of its competitors in the small-box value retail space being on a long journey to try and find their way.\n\nAnd now there could be some changes in the competitive environment. We're seeing Family Dollar make price investments, it could be the perception that you're making investments in store hours, store labor as another way to beef up in the event that you are now going to face a stronger competitor, so the net result of all this could mean that the profit rate, the operating profit rate in small box retail has peaked as now two competitors that are going to be stronger and well-positioned, are fighting a little bit harder against each other. Why or why not is that the case?\n\nTodd Vasos -- Chief Executive Officer\n\nI'll start it out, Michael. I would tell you that obviously, you're zeroing in on our chief competitor there. So I'll just say this that it's been not only a long journey for them, I would say it's been even tougher than that. We've heard over the last seven years that they're getting traction and they're doing this and doing that, and we're still talking about that.\n\nSo I think we're still talking about it. What we are here to do, as you know us pretty well, Michael, is controlling what we can control and forging ahead on our initiatives. We have left our chief competitor completely in the dust that will take years, years to catch up. And I would also tell you that we feel very, very strongly that peak margins haven't yet been obtained and that we have a lot of room to grow.\n\nYou've heard from John, not only short term but long term. Our initiatives alone are driving a tremendous amount of that growth and that confidence. And I would tell you that Jeff and the team, as we go forward, have got a lot of initiatives in the hopper that we haven't even talked about yet that are percolating. So we're looking out as we promised everyone six years ago, when we started the strategic journey that we've been on, that we would look out 5 to 10 years down the road and around the corner.\n\nAnd I think you've seen from us that we've done that. And I think you've seen the fruits of that as we continue to roll out these initiatives. And to your point, have some of the best execution in the retail industry against initiatives. Lastly, being here for 14 years and thinking back to the last time we had the recession, and we had the customer that was really strained, the one thing that Dollar General had is that we had already fixed a lot of the basic railroad by the time we really hit stride in late '09 and '10.\n\nI would hate to be trying to fix the railroad right now. It would be like one of the toughest times to do it. And so I would like to just point out that we're in such a great position that as we continue to move forward, we believe we'll be able to capitalize on that trade down that we're already seeing. And that trade down is coming from income levels that are upwards of $100,000 which we really are encouraged in seeing a younger consumer, a little bit more affluent, and again, very digitally and tech savvy.\n\nMichael Lasser -- UBS -- Analyst\n\nGot it. Super helpful. My follow-up question is on the outlook for this trade down. Your comp in the quarter was obviously well above your algorithm, you're guiding conservatively for the back half of the year seemingly so.\n\nYou have a lot of inventory. Why wouldn't this above algorithm comp continue well into next year, assuming that the macro environment stays where it is, and if it gets a little worse that trade-down benefit will be even greater?\n\nTodd Vasos -- Chief Executive Officer\n\nYeah. So I would tell you that I will first start and just say that we feel that that trade down will continue to come in and benefit us. As it relates to the inventory levels, we couldn't be happier with where we sit today on inventory. We did all the right things early on, Michael, as you would imagine, coming from a Dollar General.\n\nWe were well ahead of any inventory issues that may pop up unlike some of our competitors out there. We canceled orders as early as December because we saw where the customer was headed. We actually have canceled orders not only into Q2, but into the back half of the year. And all of our guidance is contemplated on that.\n\nSo we feel very strong. The quality of our inventory couldn't be better. And as we move forward, we believe that will benefit us as we move into the back half of this year and into next year.\n\nMichael Lasser -- UBS -- Analyst\n\nThank you so much, and good luck.\n\nOperator\n\nOur next question is from Kate McShane with Goldman Sachs. Please proceed with your question.\n\nKatharine McShane -- Goldman Sachs -- Analyst\n\nHi. Thanks. Good morning. I just wanted to go back on the trade down commentary.\n\nIf there are certain categories being sought out by the higher-end consumer. And what categories are you seeing heavier trade down to with regards to private label? And then just as a follow-up, with the higher-end consumer coming into the store now, how long do they traditionally stick around and how might you be trying to keep them as more permanent customers?\n\nTodd Vasos -- Chief Executive Officer\n\nYeah. Those are great questions. I would tell you, what we're seeing on that higher-end consumer is that she does shop a more holistic part of the store. And I made mention on the harvest and Halloween as an example, very discretionary, but doing extremely well.\n\nAnd some of that comes from that trade down, right? Because that consumer does have a little bit more money to spend. And as you think about how sticky that customer is, well, dial the clock back just a bit to the pandemic and now coming out of the pandemic, we've retained a lot more of those customers than we thought we would. So we're very happy on that retention. So we know that they're sticky because, again, that consumer -- was that consumer making -- the majority of them making that 50 to 75 range.\n\nSo this one extends up to 100. But again, the experience is very, very similar to those, for those consumers when they come in. So we believe that that will be sticky as well. So when you think about our market share in just discretionary items.\n\nI also want to point out that that was positive as well for the quarter. So we're picking up share even in a very tough environment on the discretionary side. And then lastly, your other question was around what type of items are we seeing as well. Even from our core customer, trading down -- trade down doesn't always mean just trading down from other retailers.\n\nIt also is trading down when you get inside the box, and our core customer has been buying more private brands, that $1 price point, very, very important to her. If you think about things that have accelerated greatly over the last quarter, if you think of basic proteins that our core customer needs, so what we've seen is 15% to 20% increases over the last couple of quarters in canned meat, seafood, dry pasta, soups, rice and beans. So those core proteins, eggs, all those things that the consumer needs to feed her family but can do it at a much-reduced price. So we're seeing that trade down effect as well, and we're in great position to take advantage of that, both from our everyday low retail price stance, as well as our supply chain, is much more healthier there than we were last year at this time.\n\nKatharine McShane -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is from John Heinbockel with Guggenheim Partners. Please proceed with your question.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nHey, guys, congratulations. Todd, I wonder if you can talk to, you referenced this strategic journey, which is one of the most significant things I think you brought in. Where are we on that in terms of the pipeline of things? Well, first of all, I think you're looking out, right, two or three years with that effort. Where is the pipeline versus where it's been historically, right? Is it fuller? And then where do you think -- you're not going to talk specifics, but when you think about kind of functional areas, right, merchandising, marketing, where do you think there's the most fertile ground, right, to use those strategic ideas to further the DG brand?\n\nTodd Vasos -- Chief Executive Officer\n\nYeah. Let me start, and I'm going to turn it over to Jeff as well. But I would tell you that, John, we feel great about those strategic initiatives. And to your point, not only a couple of years out, but 5 and 10 years out is the look.\n\nAnd if you look at the majority of them, there -- for instance, NCI, as an example, while we're close to the end of that rollout journey, the next phase of that that optimization phase, is just starting. I would tell you, we're probably in the fifth inning in NCI. We're in the late fourth inning in the fresh piece of the business, with produce being a big unlock yet to come as an example. And then we're just starting the journey.\n\nWe're just getting up to the plate to use the analogy in both Mexico and in our health initiative. And as I mentioned earlier, we've got others we haven't even talked about ready to push into the pipeline. And Jeff, you may want to jump in just briefly.\n\nJeff Owen -- Chief Operating Officer\n\nYeah. I would tell you, John, thank you for the question. And I think, we've never been more excited about the future. And to Todd's point earlier, it's not two to three years out.\n\nI mean, one of the things you got to think about is our, first of all, our pipeline for growth. I mean, that 17,000 additional opportunities, 13,000 general stores, 3,000 pOpshelf stores and 1,000 DGX. So first and foremost, our pipeline is extremely robust, and we're very pleased with this larger store format that we've been rolling out. 80% of our stores this year will be in that larger store format, and we're seeing the sales per square foot perform extremely well.\n\nSo we're very pleased at how our new store performance is beating our pro forma expectations. And John, you've followed us for quite some time. We have pretty high expectations for our new store growth program. But as you think to the future also, you got to think about digital as well.\n\nI mean, our digital strategy and our acceleration there is serving us tremendously well. I mean, when you think about over 80 million profiles that we're able to connect with our CPG firms and our brand partners, and we believe we can expand that beyond traditional CPG and brand partners because we have a unique customer, almost 30% of the United States population in rural America, that's really hard to reach. And with our customer profiles, we're able to really connect multiple partners with that unique Dollar General customer that no one knows better than we do. But as you think down the road, Mexico, we're excited to open stores, and we said this before, we wouldn't be going to Mexico if we didn't think it was a huge opportunity.\n\nAnd then when you think about health, health is one of these where we're -- we just had our first meeting with our advisory panel. It was incredible. And you're going to hear a lot more about health here in the near term and in the future with our Chief Medical Officer, Albert Wu, his strategy and the way we're going to be able to provide access for a customer that's being underserved right now. So when you think down the road, it's extremely bright.\n\nAnd I would tell you, your comment about our teams, where do we have fertile ground? We have the best team in retail. And so when you look at every aspect of this Dollar General team, it's the unique and secret sauce of our success. And our culture has never been stronger. Our teams are energized to continue to move forward.\n\nSo I think you can tell from my excitement, Todd's excitement, John's, that we see tremendous opportunity in the future. And I can't wait to update you guys in the near future on where we're going.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Corey Tarlowe with Jefferies. Please proceed with your question.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nHi. Good morning. Thanks for taking my questions, and congrats to Todd on a successful career with Dollar General and to Jeff and John for your new elevated roles. So first, there was an announcement intra-quarter about the three DC openings out west.\n\nAre we to read into that that there are perhaps the more incremental store opportunity ahead lies in the regions where those new DCs are, in fact, being built out west in the U.S.?\n\nJeff Owen -- Chief Operating Officer\n\nCorey, thank you for the question, and thank you for the well wishes. One of the things we do so well here at Dollar General is we anticipate and look down the road. And we like to think we look around the corner real well, too. So that's exactly what this is.\n\nOur distribution strategy is in lockstep, as I mentioned just a minute ago. We have 17,000 additional opportunities, and that's across the entire U.S. And so we're very pleased at our ability to expand our distribution network because what it's going to do for us is it's going to continue to allow us to serve our stores better, make it more efficient, be able to pull cost out of the system and enable us to continue to grow. And as you can tell, we have significant growth prospects in the future.\n\nAnd that's all this is, is being able to make sure that our distribution is in line with our store opening plans, and those two teams work very, very well together to plan accordingly.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nGreat. And then just a follow-up for John. How are you thinking about your expectations for freight expenses throughout the back half of this year within the overall margin guidance that you've given?\n\nJohn Garratt -- Chief Financial Officer\n\nYeah. As we touched on earlier, we do see improving conditions there. You're seeing additional supply capacity come online. You're seeing, obviously, demand drop as folks cut orders.\n\nAnd so when you look at both ocean freight and you look at domestic carrier rates, we're seeing those rates come down. And again, actions we're taking like with the private fleet is helping mitigate that as well. And we're coming up on a time where you're lapping increasing supply chain costs as you went from Q3 into Q4 last year. So I think net-net, we're doing a great job mitigating it.\n\nAnd I think that will, over time, switch to a tailwind as we see that moderate.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nGreat. Thank you very much, and best of luck.\n\nOperator\n\nWe have reached the end of the question-and-answer session. I would now like to turn the call back over to Todd Vasos for closing comments.\n\nTodd Vasos -- Chief Executive Officer\n\nYes. Thank you for all the questions, and thanks for your interest in Dollar General. And I do appreciate all the well wishes that you extended. Serving with this team has been the highlight of my professional career, and it's been a blessing and a privilege to serve our customers, associates, shareholders, and communities over the past seven-plus years as the CEO of Dollar General.\n\nI'm extremely proud of the progress we've made together and look forward to working with Jeff and the team in an advisory and consulting capacity going forward, as well as continue to serve on the board. I believe we have the best team in retail, our mission and culture are stronger than ever, and we are extremely well-positioned to capitalize on the enormous growth opportunities we see ahead. Again, thank you for listening, and I hope you have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDonny Lau -- Vice President, Investor Relations\n\nTodd Vasos -- Chief Executive Officer\n\nJohn Garratt -- Chief Financial Officer\n\nJeff Owen -- Chief Operating Officer\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nKatharine McShane -- Goldman Sachs -- Analyst\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nMore DG analysis\n\nAll earnings call transcripts"
}