{
  "companyName": "Ferroglobe PLC",
  "companyTicker": "GSM",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/ferroglobe-plc-gsm-q2-2022-earnings-call-transcrip/",
  "content": "Ferroglobe PLC (GSM 1.32%)\nQ2 2022 Earnings Call\nAug 16, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen, and welcome to Ferroglobe's second quarter 2022 earnings call. [Operator instructions] Later, we will conduct the question and answer session and instructions will be given at that time. As a reminder, this conference call is being recorded. I would now like to turn the call over to Gaurav Mehta, Ferroglobe president of North America, and executive vice president of corporate strategies, technology, and investor relations.\n\nYou may begin.\n\nGaurav Mehta -- Executive Vice President of Corporate Strategy, Technology, and Investor Relations\n\nGood morning, everyone, and thank you for joining Ferroglobe's second quarter 2022 conference call. Joining me today are Marco Levi, our chief executive officer; Beatriz Garcia-Cos, our chief financial officer; and Benoist Ollivier, our chief technology and innovation officer. Before we get started with some prepared remarks, I'm going to read a brief statement. Please turn to Slide 2.\n\nAt this time, statements made by management during this conference call that are forward-looking are based on current expectations. Risk factors that could cause actual results to differ materially from those forward-looking statements can be found in Ferroglobes' most recent SEC filings and the exhibits to those filings, which are available on our web page www.ferroglobe.com. In addition, this discussion includes references to EBITDA, adjusted EBITDA, adjusted gross debt, net debt, and adjusted diluted earnings per share, which are non-IFRS measures. Reconciliation of these non-IFRS measures may be found in our most recent SEC filings.\n\nAt this time, I would like to turn the call over to our CEO, Marco Levi. Slide 4, please.\n\nMarco Levi -- Chief Executive Officer\n\nGood morning, or good afternoon, everyone. Today I am really thrilled to present our second quarter results, which set the new company record in terms of our quarterly revenues, adjusted EBITDA, margins, profitability, and net debt level. In fact, the second quarter marks the sixth consecutive quarter dating back to Q4 2020, where we have consistently improved our performance in areas such as sales and adjusted EBIDTA. Please keep in mind that adjusted EBITDA was negative in 2019 when this management team took over.\n\nI am extremely proud that we have been able to deliver adjusted EBITDA improvement in nine out of the last ten quarters, despite challenges posed by COVID, the energy crisis, and most recently the Russia and Ukraine conflict. The stellar quarterly results are a collection of the strong performance across our portfolio of products coupled with the ongoing focus on cost reduction, improved operational flexibility, and quicker response to capitalize on market opportunities. We have been pretty clear on our priorities and I am pleased that we're delivering on all fronts. In fact, we are excited to be over delivering in some areas.\n\nFor example, we continue to uncover new pockets of value during our Investor Day. A few weeks back, we announced our revised target of $225 million over [Inaudible] benefit from the various transformation areas. Specific to the second quarter, our revenues increased 18% to $841 million, and we achieved adjusted EBITDA of $303 million, an increase of 26% over the prior year quarter. Our adjusted EBITDA margin further improved by 234 basis points to 36%.\n\nAnd our earnings per share on a fully diluted basis was positive $0.98, a 23% increase over $0.80 per diluted share we delivered last quarter. Moreover, we continue to improve our cash generation. As a result, our net debt at June 30 was $194 million, the lowest in the company's story. With the acceleration in cash generation, we repurchased some of our senior notes during the quarter, and subsequently closed on the redemption of our 9% super senior notes in July.\n\nOverall, our business continues to perform well across the portfolio. We are vigilant that the macro environment continues to remain uncertain with high inflation and the continued energy crisis posing inherent headwinds. We expect to generate solid cash flows into the second half of the year despite these lingering headwinds. Before we we move on, I want to highlight the positive developments relating to our energy costs, specifically in France.\n\nWhile we have fixed energy prices in France this year, in May, we received notification from our energy provider that the French government decided to increase the relative portion of RN, which lowers our realized cost of energy, and we received a net benefit of approximately $31 million this quarter. Approximately $20 million of this impact was realized in our PNL this quarter with the remaining amount being capitalized as inventory, which would be realized later in the year. To be clear, this is not a one off benefit. We anticipate a comparable adjustment to our energy cost in France for the second half of the year as well.\n\nAdditionally, our fixed price contract in France provides some insulation from the current drought and potentially other factors. In the event there is a shortage of power, we also benefit from our unique ability to quickly modulate production, and redirect power back to the grid at an attractive rate, albeit reducing output. Moving to Slide 5, please. Let's talk about silicon.\n\nOur silicon metal business had another strong quarter on the back of solid supply demand fundamentals. The index pricing in the U.S., Europe dropped during the quarter of bite by different level. The U.S. index [Inaudible] through May before seeing a decline in June.\n\nNonetheless, the U.S. ended Q2 with pricing above $8,700 per ton and that's flat since. In Europe, the index actually increased until early June, reaching 4,800 euros per ton before ending the quarter just over 4,000 euros per ton. Overall, we remain encouraged with the pricing environment and need to put these pricing levels into perspective relative to historical levels.\n\nAfter hitting unprecedented levels at the end of 2021, the pace of decline this year has been much lower than what was initially expected by CRU, which is positive for our results. Furthermore, given our exposure to index based pricing, we are getting the benefit of higher realized prices. In other words, the higher pricing average in Q2 will positively impact us during the first quarter. Our shipments increase to approximately 63,000 tons during the quarter.\n\nThis was in part attributable to strong demand, as well as the restart of the second furnace at the Selma facility during the quarter. In terms of end market demand, the chemicals that continues to be the strongest across our core geographies, the aluminum sector continues to face headwinds from higher energy prices in Europe, as well as continued supply chain disruption adversely impacting auto demand. Initially, we were hopeful for some recovery on the automotive side during the back half of the year. Given the continued uncertainty around energy and the current macro picture riddled with higher interest rates, we are not factoring in any further recovery in the [Inaudible] market for this year.\n\nI will come back to some interesting developments on the photovoltaic later in today's presentation. Overall, we saw a significant improvement in the contribution from silicon metal. Silicon metal revenues increased 13.7% with adjusted EBITDA increased by 15.5%. Margins for this part of the business improved further,reaching 49.2% in Q2.\n\nOn the cost side, we benefited from the decrease in energy cost in France as detailed on this slide. While our average realized cost of energy in Spain improved quarter-over-quarter, the volatility continues. Just last week, the energy price were back above $300 per megawatt hour. We are seeing companies along the entire value chain approach the back half of the year with more caution.\n\nWhile there are pockets of demand correction, we are seeing the supply demand tension holding supporting favorable pricing levels. Once again, most of our sales for this part of the business are in this based, and will benefit from the strong Q2 pricing momentum. Slide 6, please. Let's talk about Silicon-Based Alloys.\n\nThe Silicon-Based Alloys product category was the stronger performer during the quarter. Our sales grew 11.5%, while adjusted EBITDA for this product category grew 23.9% during the quarter, resulting in adjusted EBITDA margins of 41.1%. Sales volumes were flat quarter-over-quarter, but we did realize the 11.3% pricing improvement, which was primarily the result of the Russia-Ukraine conflict. Demand for our Silicon-Based Alloys was strong across the U.S., Europe, and South Africa during the quarter.\n\nIn fact, we could have probably sold higher volumes. But with Spain operating at minimal load, our total shipments were flat quarter-over-quarter. Looking into the back half of the year, we think our customers would be purchasing with greater caution as their capacity, particularly in Europe, is being curtailed. Overall, we will continue to drive our strategy to orient this portfolio of products to our higher margin specialty products, and toward higher price positive growth.\n\nMoving to Slide 7, please. Let's talk about Manganese Alloys now. This part of our portfolio has been impacted by the conflict, as Ukraine is a major supplier of Manganese Alloys into Europe. As we enter the second quarter, we quickly picked up on the uncertainty that was present given the conflict, and we quickly ramped up production to capitalize on the situation.\n\nDuring the quarter we had a 29% increase in shipments to approximately 97,000 tons. Likewise, we continue to get some pricing appreciation with the average realized price increasing 3.2% during Q2. Overall, our sales increased 33%, while adjusted EBITDA grew 61.4% to $32.9 million. Margin expanded by 300 basis points to 17.1%.\n\nLooking ahead, we expect volumes to revert back toward recent historical levels. Many steel customers certainly voiced caution during their recently quarterly calls. This sentiment coupled with continued higher energy prices and other input costs, puts us in a more prudent state, and we will manage the asset portfolio responsibly. Overall, a strong performance by all three product categories.\n\nNow, I would like to turn the call to Gaurav Mehta, due to connectivity issues, with our CFO, Beatriz Garcia-Cos.\n\nGaurav Mehta -- Executive Vice President of Corporate Strategy, Technology, and Investor Relations\n\nThank you, Marco, and good morning.\n\nBeatriz Garcia-Cos -- Chief Financial Officer\n\nGood afternoon. I think I can talk. Can you hear me?\n\nGaurav Mehta -- Executive Vice President of Corporate Strategy, Technology, and Investor Relations\n\nYes, please. Go ahead, Beatrice.\n\nBeatriz Garcia-Cos -- Chief Financial Officer\n\nYeah. OK. Thank you very much. I sure out the connection.\n\nThank you, Marco, and good morning, or good afternoon all. Please turn to the income statement on the Slide 9. During the quarter, our top line grew by 80% to a record $841 million, driven by strong revenue across all our product categories. Silica metal and manganese based alloys experienced volume growth over the first quarter, while a stronger pricing in silicone-based and manganese-based alloys contributes to higher revenues.\n\nCost management has been a priority, and during the quarter we continue to drive cost improvement despite high inflationary pressures and higher energy cost in Spain. As a result, our cost of sales improved to 44% from 48% in Q1. Operationally, the plans run well during the quarter with minimal disruptions. Keep in mind that we are constantly reprioritizing our CapEx spend this year, and so far this appears to be working quite well.\n\nAfter reporting, record adjusted EBITDA margin of 33.7% in Q1. Our Q2 adjusted EBITDA margin improved further to the 36.1% up to the 134 basis points over the prior record quarter. Our diluted earnings per share increased to 0.98 in Q2, up 23% over the 0.8 reported in Q1. Next slide, please.\n\nOur adjusted EBITDA increased by $62 million during the quarter to $303 million. The largest driver of these was the growth in volumes contributing approximately to $50 million and to a lesser extent, they drove many pricing in some product areas, which contribute $13.4 million. On the cost side, we face inflationary pressures across a number of key inputs such as electrode, paste, and coal. That said, we were able to offset more of the paste increases with the positive energy adjustments in France, which did back approximately $30 million in Q2.\n\nAs I mentioned earlier, we will continue to benefit from this project through the second half of 2022. During Q2, the overall impact of energy prices in the Spain was positive $5.7 million quarter-over-quarter basis as our [Inaudible] realize cost of energy in Spain improve by approximately 15%. We continue to face a lot of volatility in energy prices in the Spain into the current quarter. Slide 11, please.\n\n[Inaudible] in Q2 drove a significant increase in our cash balance to $307 million up to $131 million from the prior quarter. With improvement in our cash balance, our net debt was $194 million at quarter end, which implies a net leverage ratio of 0.16. Our gross debt balance was $500 million at quarter end, which remains relatively high compared to our $200 million. That's significant, deleveraging of gross debt remains a priority for us.\n\nThe value of our assets totaled $1.9 million, out of which the book value of equity was $637 million. We have set a target for working capital as a percentage of sales at 21%. During the second quarter, we were slightly below this level at 20.4%. Slide 12, please.\n\nWe ended Q2 with an all time high cash balance at $307 million, it will layer in our new undrawn ABL, the liquidity was over $400 million at quarter end. Our net debt was also at the lowest point in company history at $194 million. The gross debt amount $500 million reflects the $90 million of open market repurchase of our 9.75 senior notes in the quarter, but does not reflect the successful redemption of the $60 million of 9% super senior notes which occur only in July. Next Slide, please.\n\nDuring Q2, we generated record operating cash flow of $165 million, a significant jump from $66 million in Q1. It's also the third consecutive quarter of positive operating cash flow. Our strong operating cash flow was driven by robust earnings, partially offset with a cash consumption for working capital of $91 million, which is meaningfully lower than the $168 million cash consumption for working capital in Q1. During the quarter, the actual cash impact of our CapEx spent was $13.7 million, up from $9.1 million in Q1.\n\nThe actual CapEx spent for the first half total approximately $31 million, with the cash [Inaudible] being $23 million. We are maintaining our CapEx target for the year at $75 million. Please keep in mind that the timing of the actual cash flow impact of the CapEx spent may differ from the balance sheet impact. In the second quarter, our debt cash flow was $136 million, in free cash flow total $151 million.\n\nGoing forward, we are focused on keeping our working capital around the 21% of sales level.Slide 14, please. In addition to the record financial results, we successfully executed a number of initiatives aimed at strengthening our balance sheet. For some time, we discussed having back an asset based revolver, which was part of our capital structure prior to the 2021 refinancing. On June 30, we announced a new 100 million facility, which will assess our liquidity by leveraging our [Inaudible] and inventory in North America.\n\nNew facility was on drawn at closing, a burst and attractive rate base, and so far, less a spread of 150 to 175 basis points. In addition to the deleverage of debt, we also seek to lower our cost of capital and this is an initial step. In terms of a deleveraging, with [Inaudible] approximately $90 million of face value of the 9.3 75 senior notes in the open market, during the month of June at an average price of 101. And subsequent to quarter-end, we successfully redeem the entire $60 million of our 9% super senior notes in July.\n\nFor the supporting our priorities in terms of gross debt reduction, as we generate strong cash flows and lower our quantum of debt and cost of capital, decreased profile of our companies, improving. In fact, this credit agency upgrade the corporate family rating to be three in June, and upgraded the 9.3 75 senior notes due in 2025 to be three in August. This is a testament to the work we are doing at the execution of our plan. Overall, the momentum continues to build.\n\nWe're proud of our achievement and feel the company is in a great position to thrive. At this time, I'll turn the call back over Marco for a few updates, [Inaudible] corporate updates.\n\nMarco Levi -- Chief Executive Officer\n\nThank you, Beatriz. Now turning to Slide 16, please. As you have just heard, there is a lot to be excited about as you see the trajectory of our financial performance. Beyond the record, the results we have also made some tremendous advancements in other areas, some of which I would like to highlight.\n\nDuring our recent Investor Day, we stressed the significance of our transformation plan in terms of the value creation, but also with regards to the capabilities we are developing. As we have now past the 18 month mark in these crucial phase of this plan, we are advancing at a faster pace than anticipated. But more importantly, we are identifying new pockets of value throughout the organization. As a result, we revise our run rate target to $225 million, up from the initial target of $180 million by 2024.\n\nWe have also discussed our inaugural ESG report on recent calls, and I am proud to announce that report has been published last month. If you have not already seen it, please visit our corporate website and look at the sustainability for the full report. Ferroglobe is 100% committed to ESG, and this is an important milestone in the journey for our company. I would like to thank our organization for their dedication in this critical area, and continued art work as we transition from the planning to execution phase to reach our targets.\n\nOn the product innovation side, we are moving forward each day, recognizing the criticality of silicon mater for energy transition. We recently announced the milestone of industrial production of up to 99.995% purity Silicon at our plant in [Inaudible] The nominal capacity is 1500 tons per year. This is based on a proprietary technology which is very cost effective and environmentally friendly, as it doesn't use any chemical steam, it has a very high processing yield. We also commissioned and started up the first micro metric milling facility in our Ferroglobe innovation center in Spain [Inaudible].\n\nYear of the nominal capacity is 300 tons per year, and we designed it to offer maximum flexibility while ensuring high purity levels in order to tailor solutions for our customers. These volumes are not big, but keep in mind that the economics on these volumes are much higher. More importantly, the momentum is building with more customers expressing interest, so we will continue to increase volumes steadily. Our goal is to continue to grow our capacity in agreement with our customers in all our high end markets.\n\nFurthermore, on the energy transition story, we are seeing that the energy crisis has a new focus on the photovoltaic industry, and we think these trends presented tremendous opportunity for Ferroglobe. Given the growing interest by government to explore an end-to-end local solar value chain, we sign and MRU with a long standing customer REC silicon. Through the MRU, we are committing our U.S. assets base to produce high-purity silicon metal tp REC aimed at jointly establishing a low carbon traceable West based solar supply chain. Now, we recognize that there are many factors at play here, especially as it relates to new government policies.\n\nBut the fact that these types of topics are on top of government agendas is very promising for the future demand of our core products. Once again, a tremendous amount of things going on that causes us to get excited about the future. I have said from the beginning that this was going to be a slow, and steady journey focused on transformation, value recovery, and value creation. Today, record earnings should be viewed as firm validation in our team and our plan.\n\nOur outperformance is not only due to market conditions, but the actions that we have been driving for nearly two years now. There is a lot more work to be done and we remain committed to reaching our goals while navigating a period of uncertainty as macro picture evolves. At this time, I'll ask the operator to please open the line for questions.\n\nOperator\n\nThank you. [Inaudible] And your first question today comes from Martin Englert from Seaport Research Partners. Please go ahead. Your line is open.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nHello. Good afternoon, everyone. Can you provide any update regarding power contracts in Spain and then for France as well into next year? And will France continue to benefit from the government program in 2023 as it is in the second half?\n\nMarco Levi -- Chief Executive Officer\n\nOK. Then let me start from France and then our new COO, Benjamin Crespy, probably can elaborate a little bit more. As you know, Martin, we have a contract in France on energy that runs through 2022. In this contract, there are two components.\n\nOne is fixed and the other one is a variable market component. And what happens is that at the end of May 2022, the French government decided to increase the fixed part call RM from 100 to 120 terawatt for 2022, in order to reduce the exposure to the spot market for residential in an intensive industry. And as a result, we have received $29.5 million benefits, million euros benefit in France. Like I mentioned in my report.\n\nPost 2022, we have entered in a new two year contract with the local supplier based on the same two components. This contract will allow us to leverage our flexibility to minimize our exposure to spot market and give them visibility on the evolving energy cost. I have to underline that today the relative waiting for 2022 to 2025, between fixed and variable has not been finalized yet. Benjamin, anything else you want to add on that?\n\nBenjamin Crespy -- Chief Operating Officer\n\nI think you covered it pretty well, Marco.\n\nMarco Levi -- Chief Executive Officer\n\nOK. Martin, are you satisfied about France?\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nYeah. So it sounds like there is going to be a renewed contract in place post 2022. No visibility if the government is going to extend or how those relative waiting between 16 variables will shake out just yet. Is that correct?\n\nMarco Levi -- Chief Executive Officer\n\nCorrect.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nGot it. And how are things progressing in Spain?\n\nMarco Levi -- Chief Executive Officer\n\nYeah. In Spain is a little bit more complicated. Not that France is easy. But in Spain, first of all, I mentioned that we had a lower cost of energy in the second quarter.\n\nThis is why we run our assets in Spain at a decent rate. In the second quarter, I thought we had a cost of $209 per megawatt hour versus dilemma 52 in the first quarter. What happened in the second quarter is also that the Spanish government took some measures to cap the gas price between 40 and 50 level. But these measures have not been effective, meaning that they have slightly reduced our cost of energy.\n\nBut the cost of energy yesterday was above 300 euros per megawatt in Spain. And this tells me that the measures that have been taken have not been effective.We are still working hard on having PPA as of January to 2023, we have thermal sheets on the table which are under negotiation, but we have not finalized any negotiation yet for PPA Spain.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nOK. Thank you for all the detail on that. And maybe taking a step back, and looking across the cost per ton on the segments here. Yes.\n\nWhat are the expectations for a sequential change as to the degree that you have visibility in  3Q versus 2Q?\n\nMarco Levi -- Chief Executive Officer\n\nYeah, you're right. To the degree of visibility, I would say always with the flat quarter-over-quarter, both manganese and silicon-based alloys overall, while silicon we will have a cost increase between 3% and 5%.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nOK. Thank you for that detail there. Given the spot prices have been declining somewhat across the metals basket, there is some partial delay get to the given the lagging contracts. But any updated thoughts on the ASP across the business is Q-on-Q here in the 3Q?\n\nMarco Levi -- Chief Executive Officer\n\nYeah, I of course, it is true that the pricing overall is coming down across the portfolio. But I have to say It's going down at a much lower base than what we expected. I would say all across our portfolio also, because we were coming from extraordinary price levels at the end of 2021. Being specific by product, if you look at silicon metal, the market today is very liquid, especially in North America.\n\nBut the index is holding in the U.S. while in Europe the prices have started eroding. But then I would say they have sort of stabilized, and in China, which is always a reference. Yesterday, we got the news that prices were going substantially up due to some lack of capacity in some of the Chinese regions.\n\nSo I will say volatility is the rule of the game, but we are still counting on silicon prices which are profitable. Switching to Ferro silicon or silicon alloys during the quarter prices increase mainly due to the impact of Russia and Ukraine conflict. I must say that we didn't see too much of an effect in the U.S., we expected some lack of shortage of Ferro silicon in U.S. from Russia that's not occurred in in Q2.\n\nPrice overall in Europe is under pressure, mainly due to Chinese increased Chinese exports due to the slowdown in China. We have seen all across the portfolio an increase of export and Chinese products. Concerning manganese alloys, there have been two key factors some pricing. One, of course, the war, we reduce exports outside of Ukraine.\n\nBut then the market has become very attractive during the quarter for the Indian producers where penetrated the European market at a level that has never been seen before. We have a negative impact, a substantial negative impact going on pricing. At the same time, the cost is going down because manganese or is significantly going down.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nOK. So some modest headwinds, I think, that weren't wholly unexpected given how high some of the prices were. But the price is still a substantial bulk of the business that was based on 2Q lagging index spot prices that all kind of carry over into the 3Q order.\n\nMarco Levi -- Chief Executive Officer\n\nYeah, I forgot to underline this, but this is well known that we have these index prices. So whatever you see for Q2 gets applied in Q3.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nOK. That's very helpful. Thank you. Maybe one last one, if I could.\n\nOn working capital, which has been managed well within the targets. But looking at 3Q and this more broadly over the back half of the year due anticipatory release, what can you say about a potential mega capital release there?\n\nMarco Levi -- Chief Executive Officer\n\nYeah, we expect the release of working capital in Q3, which is going to be a key contributor to our estimated positive cash flow in Q3.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nOK. Thank you for all that, and congratulations on navigating the environment, the good results and the progress de-risking the balance sheet.\n\nMarco Levi -- Chief Executive Officer\n\nThank you, Martin.\n\nOperator\n\nThank you. We will now go to our next question. Please stand by. And your next question comes the line of Brian DiRubbio from Baird.\n\nPlease go ahead. Your line is open.\n\nBrian DiRubbio -- Robert W. Baird and Company -- Analyst\n\nGood afternoon, Marco, and Beatriz.\n\nMarco Levi -- Chief Executive Officer\n\nGood afternoon, Brian.\n\nBrian DiRubbio -- Robert W. Baird and Company -- Analyst\n\nTwo questions for you. First, Beatriz, on the goal of reducing debt to $200 million gross, obviously, the secondly notes are callable today, but at a high price. So my question is what is your sense of timing on achieving that goal?\n\nBeatriz Garcia-Cos -- Chief Financial Officer\n\nYeah, I think this quarter there [Inaudible] to working toward this goal. Brian, so we we did a couple of things here. Firstly, we reputation deal with the $90 million of the senior notes, and on the other side we subsequent payment with repurchase or redeem defaulted a super senior right. So you will see the data, you have not seen data on Q2, but you will see data on Q3.\n\nIt's true that we'll redeem the full super senior. So you will see the data, you have not seen data on Q2, but you will see data on Q3. It's true, that there is a journey to get there from the $500 million to the $200 million. And what we plan to do is see [Inaudible] one side, we want to be continuously  watching what we can do it terms of reputation senior notes the 9.75 in one side we are allowed to do that, and in the other side, you saw that our credit rating has been upgraded to maybe in June and then in [Inaudible] in our senior notes.\n\nSo we are expecting opportunities what is the best moment for us to tap into the market. So it all depends on what could be the depth, the market opportunities. But these are very, very important for us. The resolution of the most important.\n\nBrian DiRubbio -- Robert W. Baird and Company -- Analyst\n\nUnderstood that, that's helpful. And then I don't think you've ever disclosed this, but given some of the concerns just regarding European manufacturer costs and I understand you're getting some relief on the energy side, but can you either qualitatively or quantitatively split or provide a split between the profitability from North America versus Europe?\n\nBeatriz Garcia-Cos -- Chief Financial Officer\n\nYeah. You want to take that one, Marco?\n\nMarco Levi -- Chief Executive Officer\n\nWell, we do not look at the business in this way. And we do not report data split by geography.\n\nBrian DiRubbio -- Robert W. Baird and Company -- Analyst\n\nUnderstood. Appreciate the color. Thank you.\n\nMarco Levi -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] And your next question comes from the line of Thomas Murphy, Odeon Capital Group. Please go ahead. Your line is open.\n\nThomas Murphy -- Odeon Capital Group -- Analyst\n\nThank you. My my question was asked by Brian, and was answered. So it was around the timing of getting to that $200 million gross debt number. So as I say, that's been answered.\n\nSo thank you.\n\nMarco Levi -- Chief Executive Officer\n\nThank you, anyway, Thomas.\n\nThomas Murphy -- Odeon Capital Group -- Analyst\n\nGreat quarter, by the way. Great quarter.\n\nMarco Levi -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. We will now take our next question, and the question comes from Gregory Bennett -- apologies, from MS. If you just bear with me one second, your line will be open shortly. Gregory, you are now open.\n\nGregory Bennett -- Morgan Stanley -- Analyst\n\nGood afternoon. I'm new to your company, but I listen to your investor presentation. The reserve, like, you had exponential growth for the use of silicon, and I think that was reflected in the United States and Spain. But how long of a reserve like do you have? Are you going to need to acquire additional reserves in the future?\n\nMarco Levi -- Chief Executive Officer\n\nThis is an excellent question. You refer to [Inaudible] reserves. We have very good the reserves in Spain. We have very healthy reserves in South Africa.\n\nWe are looking for new reserves in North America.\n\nGregory Bennett -- Morgan Stanley -- Analyst\n\nSo are there assets for sale or is this something that you would do like a greenfield site?\n\nMarco Levi -- Chief Executive Officer\n\nWe are exploring both options.\n\nGregory Bennett -- Morgan Stanley -- Analyst\n\nOK. You mentioned in your Investor Day and I think the previous call about South Africa and about possibly bringing that online, but that you wanted long term contracts or commitments. I don't think you said anything about it today. What's the status of that today?\n\nMarco Levi -- Chief Executive Officer\n\nWell, I would keep the surprise for the next quarter. Now, if the situation is the following the project is proceeding, like we have to start up the plans. We keep our commitment to go to the board at the end of September with our recommendation to restart the plan in terms of timing and the amount of furnaces that we're going to start.\n\nGregory Bennett -- Morgan Stanley -- Analyst\n\nOK. NOL net loss carry forward it said something in your slide that he would eliminate. How much? Is the NOL in Europe? Or is it in the United States or both? And how much of NOL do you have the use going forward for building cash?\n\nMarco Levi -- Chief Executive Officer\n\nYeah, I pass this question to Beatriz.\n\nBeatriz Garcia-Cos -- Chief Financial Officer\n\nYes. Thank you, Marco. Now, it's true that we have a good stock of NOL, also the main ones are in France and in Spain. And we have a negligible amount to use in the U.S., if this answer your question.\n\nOf course that easier said the limitations on the application of the NOL in terms of timing and quantum. But we feel confident that we could use that most of them.\n\nGregory Bennett -- Morgan Stanley -- Analyst\n\nAnd you would use those. Is that something that you project might be used over the next five years or ten years or so?\n\nBeatriz Garcia-Cos -- Chief Financial Officer\n\nOn the next two year.\n\nGregory Bennett -- Morgan Stanley -- Analyst\n\nOver the next two years you would address all the NOL.\n\nBeatriz Garcia-Cos -- Chief Financial Officer\n\nRight, and the bulk would be in 2022.\n\nGregory Bennett -- Morgan Stanley -- Analyst\n\nOK. For your debt reduction, is it prohibitive for you to call these, I guess, what's the trigger for the board calling in the nine and 3/8 versus open. I don't -- you can't do open market purchases because the market's rallied and the bonds.\n\nBeatriz Garcia-Cos -- Chief Financial Officer\n\nIt is very difficult to hear you, but I will try to answer it. So we have a two tranches of bonds. There's two procedures that we just recently repurchase. Right.\n\nAnd the reason why we did that is because we have the option to buy at par before October 22. The 9.75 is the second day, the other tranches of bonds. It goes what we call by option, but we have the possibility to the open repurchase in the open market to a certain limit of the total quantum of debt. And this is what we have been doing, and we will continue to do and to watch it, depending, of course, on the cash levels and on the pricing.\n\nIf this answer your question.\n\nGregory Bennett -- Morgan Stanley -- Analyst\n\nYes. Thank you. The legislation that President Biden is going to sign, I think today and there's parts in there, I think when you mentioned your transaction at solar, can you describe how that may benefit you or does this benefit your end user, and that does stimulate demand for more silicon in the United States.\n\nGaurav Mehta -- Executive Vice President of Corporate Strategy, Technology, and Investor Relations\n\nSorry. Your question was around the new legislation. Certainly, we certainly feel that it would be helpful. And I think just to echo some of what Marco was alluding to toward the end of the presentation.\n\nThere's a number of different initiatives, I think, I guess, at various stages. And I think a lot of it does center around the megatrends that we've been highlighting around energy transition, which is obviously solar a lot of the work that may help ultimately with mobility and flows back into the work we're doing in battery. So in general, I think a lot of this legislation is as promising for our customer base and on-market.\n\nGregory Bennett -- Morgan Stanley -- Analyst\n\nOK. Thank you very much. Thank you for your patience taking my questions.\n\nMarco Levi -- Chief Executive Officer\n\nWe'll take one more participant, please.\n\nOperator\n\nThank you. We will now take our final question. Please stand by. And your final question comes from the line of Michael Lam from Jemekk Capital Management.\n\nPlease go ahead. Your line is open.\n\nMichael Lam -- Jemekk Capital Management -- Analyst\n\nYes. Good morning. There have been following very recently called and Enova, which is developing very high percentage silicon content anodes for lithium ion batteries. It's obviously a tremendous amount of excitement because we launched initial commercial products that are mostly on smartwatches.\n\nIs that a customer of yourself in terms of your technology SIMB and products? And second question is, I don't know of anybody else besides your company, given that you are the largest by far the third China that's actually developing this type of technology SIMB. So the two part question, and are they a customer and B, who else is doing what you're trying to do on the technology side.\n\nMarco Levi -- Chief Executive Officer\n\nBenoist, this is your territory, you want to take?\n\nBenoist Ollivier -- Chief Technology and Innovation Officer\n\nYes. So, yes, we know Enova, and Enova is using a silicon rich channel, but using crystal aggressively and [Inaudible] silicon. So they are using single mono crystals of [Inaudible] silicon. So we are not supplying them till the contract with them.\n\nThis being said, given the emergence of genomics is just reflective of the increased importance of silicon in the energy world of lithium ion batteries. And we can see an emerging and increasing trends in demand and full for silicon in the batteries. So we're pretty confident that silicon will play a very, very important role as an energy material in the battery world. To answer your second question, there's a lot of companies actually trying to put in units in either as a blend in the anode or even working on silicon rich anodes, where I could give a long list of names where we are supplying some of them ,when we are collaborating with others.\n\nBut clearly the the usage of silicon in the end, it's either a silicon carbon composite or silicon which is booming. And it is due to [Technical difficulties].\n\nMichael Lam -- Jemekk Capital Management -- Analyst\n\nThe second question would be, is there any other silicon metal materials companies like yourselves that are supplying this type of silicon? How is your competition in this kind of high technology area of silicon metal?\n\nBenoist Ollivier -- Chief Technology and Innovation Officer\n\nThere's rather a limited number of companies able to deliver high-purity like chronic silicon like we're doing that. So what we can see in this limited number will also be restricted by the seen the market of interest only showing the silicon supply in the big markets outside China, which are the U.S. and Europe. So our own geographical footprint is clearly a massive advantage of low carbon footprint is also massive advantage.\n\nMichael Lam -- Jemekk Capital Management -- Analyst\n\nOK. Thank you. Thanks for that.\n\nOperator\n\nThank you. I will now hand the call back to Marco for final comments.\n\nMarco Levi -- Chief Executive Officer\n\nThank you, Sharon. This concludes our second quarter earnings call. Once again, we're excited about the record quarterly results we have reported today. We have a company that is in its best condition since its formation, and we've exciting prospects for the future.\n\nOur goal is to continue to build on the success. We remain focused on growing our profitability and generating cash to help meet our goals. Thanks again for your participation and support.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGaurav Mehta -- Executive Vice President of Corporate Strategy, Technology, and Investor Relations\n\nMarco Levi -- Chief Executive Officer\n\nBeatriz Garcia-Cos -- Chief Financial Officer\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nBenjamin Crespy -- Chief Operating Officer\n\nBrian DiRubbio -- Robert W. Baird and Company -- Analyst\n\nThomas Murphy -- Odeon Capital Group -- Analyst\n\nGregory Bennett -- Morgan Stanley -- Analyst\n\nMichael Lam -- Jemekk Capital Management -- Analyst\n\nBenoist Ollivier -- Chief Technology and Innovation Officer\n\nMore GSM analysis\n\nAll earnings call transcripts"
}