{
  "companyName": "BJ's Wholesale Club Holdings, Inc.",
  "companyTicker": "BJ",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/18/bjs-wholesale-club-holdings-inc-bj-q2-2022-earning/",
  "content": "BJ's Wholesale Club Holdings, Inc. (BJ 0.30%)\nQ2 2022 Earnings Call\nAug 18, 2022, 8:30 a.m. ET\n\nOperator\n\nHello, everyone, and welcome to BJ's Wholesale Club Holdings, Inc.'s second quarter 2022 earnings conference call. My name is Davie, and I'll be coordinating your call today. [Operator instructions] I'll now pass the call over to your host, Cathy Park. Cathy, please go ahead.\n\nCathy Park -- Vice President, Investor Relations\n\nGood morning, and thank you for joining BJ's Wholesale Club's second quarter fiscal 2022 earnings conference call. On the call today are Bob Eddy, president and chief executive officer; Laura Felice, chief financial officer; and Bill Werner, executive vice president, strategy and development. Please remember that during this call, we may make forward-looking statements within the meaning of the federal securities laws. These statements are based on our current expectations and involve risks and uncertainties that could cause actual results to differ materially from our expectations described on this call.\n\nPlease see the Risk Factors section of our most recent Form Form 10-K and 10-Q filed with the SEC for a description of those risks and uncertainties. Finally, please note that on today's call, we'll refer to certain non-GAAP financial measures that we believe will provide useful information for investors. The presentation of this information is not intended to be considered in isolation or as a substitute for the financial information presented in accordance with GAAP. Please refer to today's press release posted on our Investor Relations website for a reconciliation of these non-GAAP financial measures to the most comparable measures prepared in accordance with GAAP.\n\nWith that, I'll turn the call over to Bob.\n\nBob Eddy -- President and Chief Executive Officer\n\nGood morning. Thank you for joining us today. In the second quarter, we produced strong results in a marketplace influenced by inflation, waning government stimulus, and high gas prices. Investments we've made to transform this company and our relentless focus on executing our long-term initiatives have put us in a place to capitalize on current trends and deliver it with this strong performance.\n\nOur member base is growing in both size and quality. We're improving our merchandising to deliver more value. We're advancing our digital business, offering more convenience and optionality for our members. We are expanding our footprint into new and existing markets with success.\n\nWe have built a great team to further advance these initiatives and our business model is made for the current consumer environment where value is king. We are well placed to take share by doing what we do best, delivering great value to our members. Comp sales in the second quarter were up 7.6% ex gas. Adjusted EBITDA grew 24% to a record $274 million, and adjusted EPS grew 29% to surpass the $1 mark for the first time in the history of company at $1.06.\n\nOur second quarter comp was driven by significant gains in traffic and market share, led by our grocery and perishable categories, and our general merchandise and services comp improved both year over year and sequentially. Finally, another strong gas quarter contributed nicely to our profits. Our fuel business is one of the most visible ways in which members can see their savings and a great way for us to drive foot traffic. With average U.S.\n\ngas prices in the second quarter running about 45% higher than last year, the value that we offer has resulted in robust growth comp gallons as members relied on BJ's to save at the pump. Our comp gas gallons were up 18% in the second quarter versus an overall market with negative comp gallons. On a two-year stack, our comp gallons were up over 40% versus an overall market that was up only slightly. To put our gas gallons into context, the average C-store sells approximately 1.5 million to 2 million gallons per year.\n\nOur stations exceed that volume meaningfully and nearly a quarter of our stations are on track this year to selling four to five times as much as that average C-store. These trends are an important measure of our relevance with our members. In addition, falling input costs mid-quarter led to higher-than-normal profit per gallon driven by the natural lag effect in retail pricing. This dynamic, combined with our gallon growth, resulted in a very strong gas business for us in the second quarter.\n\nWe continue to deliver on our strategic priorities, which are growing and retaining members, bringing significant value to our members, improving convenience with digital, and expanding our footprint. These priorities are key to driving long-term sustainable growth in our business. Let me touch briefly on each. Our business starts with membership, and it continues to be the strongest that I've seen in my history with the company.\n\nIn the second quarter, growth in our member count was impressive at 6% year over year. This was led by a combination of strong renewal rates and membership acquisition helped by our growing success in digital acquisition. Our digitally acquired member penetration grew by 1,000 basis points year over year in the second quarter. Our first year and tenured renewal rates are improving over last year's levels, and we continue to believe that we will report new all-time high results in these rates at year-end.\n\nSpeaking of all-time highs, easy renewal enrollment hit a record of over 77% this quarter, up three points over last year. We made progress on improving the quality of our members as well. Higher tier membership penetration grew yet again to 37%, up four points year over year, helped by increasing adoption rates for our co-branded credit card. I'm sure that that the fact members are able to save an extra $0.10 on gas has something to do with that.\n\nHigher-tier members are more valuable given their higher spending and greater loyalty. Therefore, as the penetration of these members increases, the quality our membership improves meaningfully. These efforts led to fee income growth of 11% in the second quarter with our average MFI dollars per member still running above $60. The current inflationary trend continues to influence purchasing behavior.\n\nDuring the second quarter, we were pleased to see year-over-year and sequential spend per-member growth across all of our income cohorts. The majority of our merchandise comps were driven by a nice uptick in trips, led our higher-end income cohorts and this remains a bright spot for us. Our members are increasingly relying on us to fulfill their shopping needs. Units were up significantly in our grocery businesses, highlighting the increasing value that we provide our members.\n\nAgain, not only were these better results year over year but also against first quarter performance. Our strong membership base is a testament to our success in delivering real value to our members. With waning government aid and elevated levels of inflation impacting virtually every aspect of consumer spending today, households across the U.S. are being forced to do more with less.\n\nIn these challenging times, we remain steadfast in helping our members save money every day on their purchases. In fact, based on our internal analysis, our pricing positions against our core competitors improved in the second quarter as we invested to showcase value, especially in key items. Take our full-service deli as an example, which is always a great value for our members. Over the course of the year, we have seen competition raised prices in this area.\n\nAnd our savings have grown to approximately $2.50 per pound on average. That means a member shopping us weekly and buying a pound of Turkey and a pound of cheese will save about $260 a year just on these two items alone. That savings equates to almost five times our base membership fee. We strive to meet the everyday shopping needs of our members and exceed their expectations by offering the optimal assortment of products and services at unbeatable prices.\n\nOur own brands help us achieve this goal. In the second quarter, own brand penetration improved by 200 basis points year over year to 25%. In fact, our own brands comp sales in the second quarter outpaced the market, most notably in sundries. We've made significant progress on our own brand penetration to date, and I know that there is a lot more room for growth here.\n\nAt our IPO four years ago, we highlighted our goal to grow own brands to 25% of sales. Now that we've hit that mark, we believe that a longer-term aspirational goal of over 30% is achievable, and we will continue to add talent and resources to accomplish this goal. On the digital front, we are generating robust growth across our digital channels, anchored by buy online pick up in club and curbside. Through the pandemic, our members have significantly altered the way they engage with us.\n\nToday, more than half of our members engage with us digitally, and this compares to approximately 25% pre-pandemic. This is important because digitally engaged members typically have higher average baskets and shop with us more frequently, which increases the likelihood for membership renewal. Thanks to our successful expansion of omnichannel offerings, the member shopping experience is more convenient than ever. We see potential for even more digitally enabled growth in the coming years as we further enhance our capabilities, deepen loyalty through targeted personalization and unlock opportunities in retail media.\n\nFinally, we remain on track with our expansion plans and continue to expect 11 new club openings in the fiscal year. From 2016 to 2020, we opened 10 clubs in aggregate, and now we expect to do that every year. Our decision to accelerate our new club opening pace stems from the performance of new clubs over the past handful of years, both in existing and new markets. In existing markets, sales at these new clubs are running well above our initial expectations.\n\nFurther, we are seeing the impact of the network effect of membership coming to life, where members who have signed up with these new clubs are increasingly shopping not only at the new clubs but the other BJ's clubs in area as well. As a result, our overall return on investment is running substantially ahead of our plans. In new markets, we continue to execute on our membership acquisition and new member experience to drive lifetime value in our new clubs. Clubs opened in new markets over the past 12 months already have total membership enrollment and higher tier penetration in line with the chain average.\n\nThis performance gives us confidence as we continue our expansion into Columbus, Indianapolis, and Nashville in the coming months. Before I hand it over to Laura to delve into the numbers, I'd like to take a few minutes discuss our current outlook. At the halfway point of the year, I'm pleased with the trajectory of the business. As I reflect on how we're trending versus our expectations at the beginning of the year, we have certainly seen higher sales, traffic, and market share.\n\nThat has been balanced by investments and margin rates to help maintain our value prop. Significant gains in gasoline profitability have allowed us to spend into the beat and make these important investments. Our business model is clearly resonating with our members old and new, perhaps more now than ever. And I believe that delivering value to our members will drive loyalty, market share, and long-term growth.\n\nI'm grateful to our team members who remain true to this core principle as they serve our members every day. To team members who are listening in today, thank you for your hard work. We are a much stronger company today with a clear path for sustainable long-term growth and value creation, and I'm very excited about our future. I will now turn it over to Laura to provide more details on our results and outlook for the rest of the year.\n\nLaura Felice -- Chief Financial Officer\n\nThank you, Bob. Before I begin, I'd like to echo Bob's gratitude for our team members across our clubs, club support center, and distribution centers, including the 850 new team members that are fresh distribution centers who officially joined us in May. The success of our company is a result team members' hard work. Now let's discuss our results.\n\nNet sales in the second quarter were $5 billion, a 22% increase over the prior year. Merchandise comp sales, which exclude sales of gasoline, increased by 7.6%. And for the second consecutive quarter, were predominantly driven by traffic growth. Inflation contributed approximately nine points to our comp as we continue to pass on a large portion of growing input costs, while strategically investing in our key value items and maintaining our key competitive pricing positions.\n\nOur two-year stack was up 4%, reflecting a three-year stack of up 28%. Comps in our grocery, perishables, and sundries division grew by 8% in the second quarter and a 5% on a two-year stack, and 29% on a three-year stack. We grew market share in the second quarter, led by grocery and perishables as members increasingly shopped with us for household essentials at lower unit prices. Our general merchandise and services division comp grew by 4% in the second quarter and up and up 2% 24% on a two-year and three-year stack respectively, as discretionary spend continues to normalize toward a new higher base from the past two years.\n\nDigitally enabled sales in the second quarter grew 47% year-over-year and over 350% on a three-year stack. Approximately 80% of our digitally enabled sales are fulfilled by our clubs with services like BOPIC and same-day delivery. We gained share in our gasoline business as consumers felt the pressure of higher gas prices relative to last year. In the second quarter, our comp gas gallons grew by approximately 18%, significantly outpacing the broader market, which saw a negative same-store volume.\n\nOur strong gallon growth, combined with greater than historical gas margins, resulted in profits that once again meaningfully outperformed our internal plan. Membership fee income, or MFI, grew by 11% to $99 million in the second quarter and continues to underscore the progress we have made improving our business. We are pleased with our membership trends, including higher tier penetration, easy renewal, and first year tenured renewal rates. Moving on to gross margins.\n\nExcluding the gasoline business, our merchandise gross margin rate decreased by 50 basis points, primarily due to growing supply chain costs and inflation, which we highlighted in our last call. Furthermore, as our competitors intensified promotional activity and efforts to address excess inventory. We took markdowns across our general merchandise business, which further pressured our second quarter margins. Let me touch briefly on inventory.\n\nWe ended the second quarter with $343 million more inventory on our balance sheet than last year. As a reminder, we closed on the acquisition of our perishable distribution centers on May 2nd, and these operations are now fully consolidated in our financial statements beginning in the second quarter. It is important to note that this includes inventory of about $90 million. This inventory was not on our books in the prior year quarter as prior to the acquisition, we did not take possession of it until it arrived at our clubs.\n\nExcluding the impact of the acquired inventory, our baseline year-over-year increase was approximately $250 million. About 50% was related to new cloud growth and other strategic actions we've taken to better position our business, such as improving in-stock levels over last year. About 40% was attributable to cost inflation. The remaining 10% was related to general merchandise, and we are pleased with the progress we've made in the second quarter.\n\nAs we sit here today, we are confident in our ability to work through the remaining general merchandise inventory and our team has worked to right size inbound inventory of of merchandise ahead the holiday season. SG&A expenses for the quarter were $651 million, the year-over-year increase was primarily attributable to the increased labor costs associated with the wage investment we made last year, as well as acquisition, integration, and operating expenses related to the acquisition of our perishable distribution centers. Our second quarter adjusted EBITDA grew by 24% to $274 million, reflecting our sales growth and outpaced gas profits. We incurred approximately $4 million of onetime costs related to the acquisition of our perishable distribution centers.\n\nThese costs were adjusted for in our adjusted EBITDA metric. Adjusted net income for the second quarter was $144 million or $1.06 per share and reflected a 29% year-over-year growth on a per-share basis. The onetime costs related to the acquisition of our perishable distribution centers have been adjusted for in this metric as well as onetime noncash write-off of fees related to our ABL credit facility that we refinanced during the quarter. Turning to our capital structure.\n\nIn the second quarter, we closed our new five-year $1.2 billion credit facility, which we upsized from $1 billion. This new facility together with our robust free cash flow, of which we generated approximately $300 million in the second quarter provides us with the financial and strategic flexibility as we continue to grow the business. We ended the second quarter with less than a turn of net leverage, which remained unchanged from the first quarter despite having partially funded the acquisition of our perishable distribution facilities with debt. As we allocate our capital going forward, priority remains growing our business.\n\nInvestments to support membership, digital, and real estate growth plans will be funded by these cash flows and enabled by our strong balance sheet. We also believe that share repurchases are a good use of excess capital and expect to continue buying back shares opportunistically. At the end of the second quarter, we had $413 million remaining under our $500 million buyback authorization. Let me now touch on our current outlook for the year.\n\nWe are seeing sustained strength in our grocery business, and we believe we can continue gaining market share because of our intense focus on value. We are also operating in a rapidly evolving marketplace where high inflation is still impacting many aspects of our business. We're working to stay ahead of shifting consumer behavior and have proven our ability to work through these challenges effectively and remain laser-focused on execution. Starting at the top of the P&L for fiscal 2022, we now expect comparable club sales ex-gas to increase in the 4% to 5% range.\n\nAs we reflected on several consecutive quarters of significant year-over-year growth in our gas business, we have updated our approach on gas and now account for low teen comp gallon growth in the back half of the year. This is predicated on our assumption that we will continue to gain outsized volume share despite moderating retail gas prices. We have also slightly increased our profit per gallon assumption to capture sustained benefit in the third quarter. We expect ongoing but slightly easing merchandise margin pressure throughout the back half of the year, driven by continued investments in price and growth in freight costs offset by a better position in general merchandise.\n\nSaid more directly, we expect the year-over-year change in our merchandise margin rate to remain negative in the third and fourth quarters but improved sequentially as we progress through the rest of the year. We continue to expect pressure on interest expense throughout the back half of the year, driven by current rate environment as compared to our initial plan. Taking all of this into consideration and after rolling our upside forward, we now expect full year EPS to be in the range of $3.50 to $3.60, up from our original expectation of approximately $3.25. Before turning it back to Bob, I'd like to reiterate our confidence in the strength of our business and the transformation that we have made.\n\nAs a result of improvements we've made in membership, footprint expansion, and digital, further amplified by the structural advantages of our warehouse club model, we believe we are positioned to deliver a better growth profile than prior to the pandemic longer term. With that, I'll turn it back to Bob for closing remarks.\n\nBob Eddy -- President and Chief Executive Officer\n\nThanks, Laura. Before we close out our prepared remarks, I'd like to leave you with some final thoughts. We know that when prices rise, the outlook is uncertain and times get tough, members deepen their trust in BJ's in search for great value. We've worked hard over the years to build a stronger and more resilient company in pursuit of driving membership lifetime value.\n\nHere are just some examples of how far we've come. Our membership base has grown roughly 25% since our IPO. Higher tier membership penetration is 37%, up from around 21% at our IPO. Own brands penetration is trending up 600 basis points from our IPO.\n\nAn easy renewal penetration is at 77%, which compares to 39% at our IPO. We've made significant progress in strengthening our business, and I believe we are well-positioned today to help our members stretch their dollars. We will remain focused on solidifying the long-term prospects of our business by executing on our strategic initiatives, and above all, prioritizing value in everything we do. With that, I'll now turn it back over to the operator to take your questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question is from Peter Benedict from Baird. Peter, your line is open. Please go ahead.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nThanks, guys. Good morning. A couple of questions. First one, just around the new member sign-ups.\n\nCurious -- any color on the complexion there, income, demographics, those types of things? How do they look relative to kind of your current base. And on the MFI growth, do you think that can sustain double-digit pace over the back half of the year? That's my first question.\n\nBob Eddy -- President and Chief Executive Officer\n\nHey, Pete. Good morning. Thanks for your question, and thanks, everybody for their time and their support this morning. You're right on one of the key issues.\n\nThis is a quarter about traffic gains and market share gains, but most of all is about the continuing strength in our membership base. We continue to grow the size and the quality of the membership base, as we talked about in our prepared remarks. We've done a nice job growing through new means to us, meaning digital acquisition. And have done just a continuing stellar job renewing members and improving the higher tiers and easy renewal as we talked about.\n\nWe're seeing new member gains across our portfolio in new clubs and in existing from a demographic perspective, I would say they are largely consistent with our core membership. Those that come in digitally traditionally have been a shade younger, as you would expect, but not meaningfully different. And we're seeing new members come in from across the economic spectrum as well, even as you do see some pressure on the lower side of the economic spectrum, given the waning government stimulus, those folks need to save money more than the average, and we're certainly seeing a lot of folks on the higher end that come in as well as they search for value. As we think about growth, I do think we are bullish on that continuing going forward.\n\nCertainly, our model here is resonating out there in the market. It has been resonating for years in good times and bad times. But certainly, the value that we provide every day where you can save 25% or more off of your groceries, it was certainly built for inflationary times like these. So we do think we can keep up the growth -- as you know, we grew bodies by 6% year over year this quarter.\n\nWe grew sequentially as well over last quarter. And the mix of our members has been going up over time. So the dollars per member is still running at sort of all-time high levels around $60. And we would anticipate growing both bodies and dollars nicely in the back half.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nOK. That's helpful, Bob. Thank you. And then just on thinking about maybe the grocery comp at 8%.\n\nI mean you talked about 9% inflation. You talked about units being up in certain areas. Can you talk about maybe items per transaction mix, trade down? Kind of just help us square up all that -- all those numbers. Thanks so much.\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah, no doubt. Certainly, grocery led the way inside of our box this quarter, not surprisingly given what's going on in the market. But we had strong performance across our portfolio, including in general merchandise and sundries, which improved sequentially and year over year as well. The grocery business is very, very strong.\n\nIt is comp positive, positive, traffic positive, unit which is important given the inflation. And I don't see that phenomenon going away anytime soon. It roots back to value, right? Our members and consumers, in general, are on a huge hunt for value at this point given the inflation, our merchant team has been able to be very effective in managing inflation and managing our margin rates in the face of that inflation. And they operate with a simple principle that we need to always provide the most value that we can provide our members.\n\nAnd that's what you're seeing come through our grocery business at this point, driving traffic, driving unit member shopping frequency as well. And as you know, that's the key to membership for us it is the No. 1 predictor of renewal of membership. Many times we get people in the box.\n\nSo grocery has been very strong for us this quarter, and I see that continuing in the back half.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nOK. Thanks, Bob. And if I could sneak one more in. You mentioned some digital opportunities.\n\nI think you said in retail media, it sounds like maybe a longer-term opportunity, but just curious if you could expand on that, what you're thinking on that front.\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah, of course. We've been growing our digital presence nicely out in the market. We talked about our digitally enabled sales up significantly in the year-over-year period as well as in the three-year stack, that was above 50% that's really of the key ways we can grow this company is taking the value that we provide everyday and layering on convenience. Everyone knows that the value has always been a hallmark of the wholesale club industry, but it hasn't always been as convenient as we want.\n\nAnd digital helps us solve that problem. If we can give people dollars back and time, both sources of huge value, we should absolutely be doing that, and that should help us win long term. As we grow that business, the data that we capture, obviously, has a lot of value. And our competitors are, frankly, a little bit ahead of where we are from a retail media perspective, given their digital businesses are a bit ahead of ours, but we are making meaningful gains in share there, and this will be a great place to invest going forward.\n\nWe have great data. We have great ability now that we've built our digital properties to monetize that data. And although it's relatively new for us now, it should be a growing piece of our business going forward.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nTerrific. Thanks so much.\n\nOperator\n\nThank you. [Operator instructions] Our next question is from Edward Kelly from Wells Fargo. Edward, your line is open. Please go ahead.\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nYeah. Hi. Good morning, everyone. Nice quarter.\n\nFirst question, just on comps. Can you just provide a bit more color on your expectation in the back half? I mean the comparison looks easier in Q4 than in Q3. And I guess as part of this, last holiday was a little bit of a disappointment in general merchandise, and end of this doesn't get fixed overnight. But just how are you approaching that opportunity year, particularly given that the marketplace is uncertain, certainly in that category?\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah, sure. Thanks for the question. It's a very good one. I guess I would start off by saying we are much more bullish on our back half prospects than we were at the beginning of the year.\n\nYou point out an important distinction between the quarters. Q3 last year will be our toughest lap this year. We had a stellar performance in Q3 and a couple of of sort unusual items in there. One was a big pull forward in sundries business into Q3 from Q4.\n\nAnd the other one was that was our peak from a government stimulus perspective in the third quarter. So if you remember, at the the beginning of year, we talked about Q3 being negative comp this year, we no longer think that. We think it will be positive. I would tell you, a positive low single, so 1%, 2% comp, something in that neighborhood.\n\nAnd then Q4, you're right on it again, general merchandise business was not something we were proud of last quarter. Last fourth quarter, we have, as you know, been allocating tons of time and energy, and talent to improving that business. It's a long build. As you know, a lot of those categories are long lead time categories.\n\nBut we've made nice gains so far. We do think we will be meaningfully ahead of third quarter comps in the fourth quarter. So where we might be plus 1% or 2% in the third quarter, we should be plus 4% or 5%, I would hope in the fourth quarter. And that's a bit of easier lap, but it's also our confidence in what we're doing to grow the general merchandise business.\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nGreat. And just a quick follow-up. On the gross margin, you started out this year, I think, expecting sort of a flattish margin, and there's been a number of unusual things that have been impacting you. Is there any reason to think, though, that you don't get this margin back eventually?\n\nBob Eddy -- President and Chief Executive Officer\n\nWell, look, I think the long-term story has always been our margins when you get them to be apples to apples with club competitors are a little bit tangling to do. And that math is a little bit tangled to do, and you have to estimate it a little bit. But we figured it was somewhere around one point of margin growth to be had over time when you think about our ability to buy better as we grow our push into own brands and the margin that, that provides. And our push into services as well, which tends to be a bit more margin dense.\n\nThose story points are still around. You saw some of it this quarter with the great owned branch penetration growth and our continued investments there should drive that going forward. We continue to do our best to buy better. It's a tough market to buy in these days and manage inflation raise your margins if given the choice between margins and value, we are always going to pick value, we will continue to invest as much as possible because value drives our business.\n\nIt drives membership. But I do think over the long term, there is still some margin to go get. Certainly, in this quarter, there were some extraneous events with increasing supply chain costs and general merchandise markdowns that should hopefully not recur in the future. But I think the long-term story of margin growth is still alive.\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nGreat. Thank you.\n\nBob Eddy -- President and Chief Executive Officer\n\nSure. Thanks, Ed.\n\nOperator\n\nThank you. Our next question is from Robbie Ohmes from Bank of America. Robbie, your line is open. Please go ahead.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nHey. Good morning. Great quarter. I had actually two follow-up questions.\n\nJust one kind of quickly, and thanks for giving the comp guidance for the back half. Is the inflation assumption the back half, plus 9% roughly? And any other color you can give us on the food inflation outlook would be really helpful. And the other question, I'll just give it to upfront. Bob, maybe historically, if you have -- and I don't think there's been a lot of inflation in this high, but when -- like when gas inflation comes back down, say, rapidly, what happens to the membership trends historically, this sort of gaining a members kind of drop off? Maybe remind us the pattern there.\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah. Robbie, thanks for those questions. So it's difficult to predict what's going to happen from an inflation perspective. I tend to think it's not going to slow down based on what we see from and hear from our supplier partners.\n\nWe tend to hear things like they've only passed through a portion of the overall inflation that they've seen in their cost base in the last couple of years. I do think you've seen some of the key commodities out there start to roll over. That may slow down the rate of inflation a little bit or at least cause them to think twice about passing even more on. But based on what I see today, I don't see it slowing down.\n\nWe've baked that into our comp assumptions. We baked the fact that member search for value is driving tremendous traffic gains into our assumptions for the back half as well. As we talked about in the prepared remarks, the majority of our second quarter comp was driven by traffic that we're sort of forecasting continuing. I still think it's going to be sticky from an inflation perspective for a while.\n\nYour question on gas is a great one. I think there are certainly -- there is more of a relevance factor. The higher gas prices go. And I'll tell you in the beginning of the year, in first quarter, we were seeing higher comp gallon gains than in the second quarter, and some of that is the fall in gas prices in the second quarter.\n\nHowever, our ship gains have not slowed down. And when you think about the traffic gains in our core business, you think about the market share gains in our core business, you think about the relevance that gas provides even though the cost of a gallon of gas is a bit lower today than it was in March, let's say. It's still very much elevated over prior years. And people are overall searching for value.\n\nHistorically, when costs have gone down, gas gallons have gone down, but the shopping behavior of folks and the membership behavior of folks is sticky. They become habituated to get into our parking lots, get into our stores. And that's what we run the gasoline business for. We don't run it to make a ton of money, even though it's very profitable this quarter.\n\nWe run it because it has the best value perception of anything out there that I've seen. And we try and run it that way every day. Our forecast for Q3 is bullish from a gallons perspective. And we've -- as Laura talked about in the prepared remarks, we updated our guess as to the profitability of the gasoline business in the third quarter.\n\nWe're view that it probably starts to go back up again in cost in the fourth quarter based on what we know today. Obviously, given the dynamics with Iran and the possible Russian oil embargo and the SPR releases going away. That could all change. But my guess is it goes back up a little bit.\n\nThat may challenge our profitability, but it will definitely help our value perception and our traffic, and our membership.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Really helpful. Thanks so much.\n\nBob Eddy -- President and Chief Executive Officer\n\nHave a good day.\n\nOperator\n\nThank you. Our next question is from Kate McShane Goldman Sachs. Kate, please go ahead. Your line is open.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nHi. Good morning. Thanks for taking our question. Our question is centered around inventory.\n\nWe wondered if you could maybe tell us where general merchandise inventory is still too high, what categories. And from an in-stock perspective, is there any place where you might want more inventory -- and then within that, the promotional environment you've mentioned is still relatively competitive. How are you thinking about promotions around holiday specifically?\n\nLaura Felice -- Chief Financial Officer\n\nHey, Kate. It's Laura. Thanks for your question. Look, as I -- as we look at our general merchandise inventory, I think we -- what you should take away is that we feel really good where we're positioned right now in our overall inventory levels, including Jan-March.\n\nYou asked about promotional environment. I think we have seen continued pressure. We saw it in the second quarter. I don't think it will ease from an overall promotional cadence as some of our competitors have looked to clear out excess inventory and have reduced pricing.\n\nWe, in turn, reduced pricing as well in some categories to stay competitive and make sure we're offering value to our members. So I think that will continue in the short term, but what you should take away is that we feel really good about where we're positioned as we head into the back half.\n\nBob Eddy -- President and Chief Executive Officer\n\nMaybe I'll pile on Kate. I thought this was really a quarter to be proud of our logistics teams and our merchandising teams. Given what's going on in the market, the historic levels of markdowns and order cancellations and things that we're seeing from our competitors to manage to the results that we saw in the second quarter, and be on plan from a margin perspective was truly feat. Very, very proud of the team for getting to that answer.\n\nAnd as Laura said, we feel good about where we are. We're -- it continues to be a dynamic marketplace. And so we will continue to work very hard to make sure our orders are rightsized, and we are as nimble as possible in the back half. But we manage Q2 very, very effectively.\n\nYour question on promotions is a good one. Certainly, we saw a lot of promotions and markdowns and things in the market in the second quarter. My guess is that continues. I think everybody has been pretty blunt about the fact that there's still some inventory to work through we are no different in that aspect.\n\nWe still have a little bit too much general merchandise inventory. It is by no means as concerning some of the other things out in market given the size of our general merchandise business for one and given how our teams have managed the inventory more effectively. But I do think it's still going to be a little bit of a robust promotional environment. And we'll do our best to stay on it.\n\nFor the holiday, we're planning for largely the same types of promotions that we've done in the past, and we will obviously alter the scope and the depth of those promotions as we see what's going on in the market.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question is from Chuck Grom from Gordon Haskett. Chuck, your line is open. Please go ahead.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nThank you. Great quarter. Can you talk about the improvement in the general merchandise business a little bit more? What's driving that? It's certainly impressive given the deteriorating backdrop today.\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah. Thanks, Chuck. As you know, GM is one of the places we have been working very hard on to improve. It's an underpenetrated part of our business.\n\nIt's a very important part of the value proposition that we should drive for our members. And obviously, you've been around the club business a long time. It's a very important part of the treasure hunt of coming to a club as well. We have a lot of ways to improve it.\n\nIt should be much bigger, hopefully, a few years from now than it is today, but a lot of it is long lead time. So we started at -- really at the bottom from our perspective, trying to get the best general merchandise team the best processes, the best procedures to run that business. We've made huge gains from a talent perspective both getting internal stars into the right roles as well as recruiting external folks to come in and help. And I couldn't be more pleased with the state of the talent at this point.\n\nWe'll continue to build from there. And as we get these people in the right places, they're out in the market sourcing more and better inventory. And as we work that into our plans and our business, hopefully, it will resonate. This should be a big part of our business.\n\nI think you'll see sort of initial peaks at some of that stuff in the back half. It really won't start to resonate until next year, definitely by the back half of next year as we get into key categories there. But you take apparel or you take seasonal, you take electronics, all of those should be much bigger businesses than we have today. And it starts with talent.\n\nAnd then we let them get to work and do the right things in terms of picking the right items and most importantly, providing tremendous value to our members as we go forward. So lots to do, proud of where we've gotten so far in that transformation, but we've got to keep it going.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK. Great. Thank you. And then when you take a step back from the near term, given your success, particularly on traffic and membership over the past couple of years, maybe even a little bit longer than that.\n\nHow are you thinking about the long-term earnings all go? And can you remind us about club growth for the next couple of years and I guess, longer term, where you see the potential club base going to?\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah. Maybe I'll farm that question out. So start with the overriding statement that we see great potential to have a much stronger long-term economic algorithm. And we've sort of forecasted that to you all in the past.\n\nI'll let Laura cover that part of it, and then maybe I'll ask Bill to talk about our real estate plans for the next couple of years because those are very, very exciting as well.\n\nLaura Felice -- Chief Financial Officer\n\nYeah. Look, I think our long-term goal is kind of as we've communicated it, we continue to see the strength of our membership growth that we've realized over the first half, and we think that will continue in the long term. And the strength of our overall business, combined with the growth of our unit base.\n\nBill Werner -- Executive Vice President, Strategy and Development\n\nYeah. Chuck, it's Bill. Then on the new club side, we'll do 11 this year. We'll open up three here in the third quarter.\n\nWe'll open up five in the fourth quarter. And then as we look forward, we continue to target 4% 5% unit growth going forward. So I would say that at this point, we have a pretty good visibility into the plans for calendar '23. And the stuff we're working on now is stuff for calendar '24 and '25.\n\nSo as we look out for the next couple of years, we think that 4% to 5% unit growth rate is sustainable.\n\nBob Eddy -- President and Chief Executive Officer\n\nAnd as we said in the prepared remarks, Chuck, this is one of the big hallmarks of our transformation, right? From 2016 to 2020, we opened 10 clubs cumulatively, and now we're doing more than that in a year, and considering the fact that we can go forward with that type of pace is a huge change for our business. I should provide a comp tailwind as we go and obviously provides bigger scale that impacts purchasing and efficiency going forward too. So a huge marker of our progress in this company.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nExactly. Congrats. Thank you.\n\nThanks, Chuck.\n\nOperator\n\nThank you. Our next question is from Krisztina Katai from Deutsche Bank. Krisztina, please go ahead. Your line is open.\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nHi. Thank you so much and congrats on a good quarter. Just wanted to talk about some of the bifurcation that you mentioned in your customer base three months ago when we talked. I think one of your large peers talked about some changes within their customer base.\n\nSo can you maybe talk about what are you seeing from your members as we look at the low end versus the high end, are you seeing still some of the same changes that you saw three months ago? Or has essentially the gas price pullback over the last two months has resulted in a healthier low-end consumer?\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah. Good morning, Krisztina. Thanks for your question. We are still seeing some of the things that we talked about in the first quarter where lower numbers in the lower end of the economic spectrum, we're seeing a little bit of a pullback there really not in their traffic so much, but in their overall shopping given they have less government aid dollars than they had in the past.\n\nThey are still coming to see us in good amounts. Their traffic is fine. That's really -- that's really what we're after. Obviously, as I talked about earlier, No.\n\n1 predictor of membership renewal is frequency. And those folks are shopping us in nice ways. The rest of the cohorts are all shopping us more often buying when they're with us, spend is up across the economic cohorts. So -- you're seeing a little bit of the same stuff that you saw in the first quarter.\n\nYour point on gas is a good one. We haven't seen a tremendous divergence in the income cohorts and their purchases of gasoline. And as gasoline has descended, we haven't really seen any meaningful difference against when it was over $4. I would expect this to continue where you see the lower-end consumer react to having less dollars in their pocket.\n\nI would expect the higher-end consumers to continue to search for value as well. We're a great destination for them. We're a one-stop shop. And they have more dollars in their pocket, even though they might not feel like do at this point.\n\nSo as I said in my remarks, in a market where value is king, we're a great place to come shop, and I would expect continued momentum going forward.\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nGreat. Thank you for that color. And -- just secondly, as it relates to the outlook for the back half or especially the fourth quarter, there's still a lot of retailers that are having to promote their general merchandise business to rightsize inventories. And I know that you are much smaller in that business, but are you at all worried that maybe some of the consumer spending might be getting pulled forward and that would essentially leave some of those dollars that are not going to be spent in the fourth quarter.\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah. Look, I think to me, it speaks back to the value point, right? In our own business, and I'll confine my comments to our own business, what we saw in Q2. When we had a product that wasn't moving as fast as we want, and we put a mark down on it, it moves. And so that speaks more to value to me than pull forward or anything else.\n\nI spoke to -- spoke to me just from a price perspective. If you had the right item and you put the right price on it, people still will take some money out of their wallet. And that item home. The inventory balances out in the market are absolutely still high.\n\nMy guess is that as we get into the winter months, summer seasonal goods will be hard to move at any price. And so I would suspect that those things will be carried over the next year or salvage rather than sold. And the comments we've read from our competitors are all about bringing in new fresh inventory for the holiday. And hopefully, the market kind of resets from that standpoint.\n\nSo we are -- we're not anticipating huge markdown headwinds as we go forward into the back half. We factored certainly some of them into our guidance that Laura talked about. But nothing meaningful. We will obviously react to the market as it goes.\n\nIt's a dynamic place. People are figuring out their own problems. And as I keep talking about, value is the only thing we care about in these markets and providing -- our members expect that from us. It's our responsibility given to them if the market changes in a way that challenges the margins, we will always choose to invest in value, as we try to take a long-term focus and try and build long-term lifetime value of membership.\n\nBut as we sit here today, we don't see any huge headwinds in the back half.\n\nLaura Felice -- Chief Financial Officer\n\nYeah. I think I'd just add that, to an important point to think about is the traffic gains that we've continued to realize -- And as those members continue to shop us, to seek the value that Bob talked about, their behavior is changing and they're coming into our boxes and shopping us online. So couple that with everything Bob said, I think we feel -- continue to feel good about our inventory positions, and we'll see kind of what the market conditions bring in the back half.\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nThat's great. Thank you so much and best of luck.\n\nBob Eddy -- President and Chief Executive Officer\n\nThanks, Krisztina.\n\nOperator\n\nThank you. Our next question is from Michael Baker from D.A. Davidson. Michael, your line is open.\n\nPlease go ahead.\n\nMichael Baker -- D.A. Davidson -- Analyst\n\nThanks, guys. A couple of follow-ups. First, on the gas business, can you remind us how -- what's the metric on percent of customers who fill up of the tank could then come into the club and maybe another way to sort of get the same ideas, can you tell us your comps in clubs that don't have gas stations versus the ones that do? I know most of them do now, but I think that would be interesting to hear. Thanks.\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah. Mike, thanks for the question. As you point out, we've been investing in our gas business over the past few years. And right now, a little less than two-thirds of our clubs have a gas station.\n\nWe continue to open many of them. One of the things -- that's one thing Bill didn't talk about as we opened 11 clubs this year. We'll open close to that number of gas stations as well. And so we're aiming toward getting to maybe three-quarters of our clubs to have gasoline.\n\nIt would be hard to put them in some of our metro New York locations, for instance. As we've talked about, gas is a huge driver of value perception, particularly as the cost of a gallon of gas goes up. And this is that type of market, right? So we've seen tremendous gains in market share across our business, but most particularly in our gasoline business, right, with gallons up 40% on a two-year stack and 18% up this last quarter. We have more and more people in our parking lots every day.\n\nHistorically, about a third of our members have shopped inside the club when they come to us and bought gasoline. That has decreased a little bit here in this six-month year-to-date period. As you would expect, as we gain more and more share, people are in just to buy gas a little bit rather than being in the store every day as well. And our continuing push into the Co-brand Mastercard product where our members get $0.10 off a gallon every day.\n\nWhen people sign up for that, we effectively get all of their gas purchases for the year as well. And that drives tremendous value to those members. But obviously, they don't need to be in our -- they might be in our parking lots three times a week, but they don't need to be in our building three times a week. I guess I would say our non gas clubs.\n\nThose closes that do not have a gas station. We're also very positive from a traffic perspective as well. And so Well, there is typically a slight difference between gas clubs and non gas clubs. It's not really meaningful at all.\n\nThe thing that is meaningful over the long term is those clubs that have a gas station have better membership results, particularly renewal. And that drives our desire to continue to add gas stations over the long term, as we've talked about, we're in the lifetime value business. We're in the membership business. And anything we can do to drive those two things is something worth investing in, so we'll continue to do that.\n\nMichael Baker -- D.A. Davidson -- Analyst\n\nMakes sense. Thanks. I know it's about 9:30, but real quick. No one's asked yet, so I'll ask it pace of comps throughout the quarter by month and maybe even early targets, I guess we have your third quarter outlook, but just wondering about the pace through the quarter.\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah. I would tell you it wasn't all that different. Certainly, you got to look at it from a stack basis. If you look at the individual monthly comps, you'd see a bit of a difference, nothing huge, but on a stack basis, not that much at all.\n\nWe saw the same type of underlying context in each month of the quarter with very strong traffic and ticket growth as well. The concentration and unit positivity of grocery and perishables and the improvement in GM and services was consistent through the quarter as well. So very pleased with that as we head into the third quarter.\n\nMichael Baker -- D.A. Davidson -- Analyst\n\nAll right. Thanks. Appreciate the color.\n\nBob Eddy -- President and Chief Executive Officer\n\nNo doubt. Thanks, Mike.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCathy Park -- Vice President, Investor Relations\n\nBob Eddy -- President and Chief Executive Officer\n\nLaura Felice -- Chief Financial Officer\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nKate McShane -- Goldman Sachs -- Analyst\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nBill Werner -- Executive Vice President, Strategy and Development\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nMichael Baker -- D.A. Davidson -- Analyst\n\nMore BJ analysis\n\nAll earnings call transcripts"
}