{
  "companyName": "Thermo Fisher Scientific",
  "companyTicker": "TMO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/thermo-fisher-scientific-tmo-q3-2022-earnings-call/",
  "content": "Thermo Fisher Scientific (TMO -1.14%)\nQ3 2022 Earnings Call\nOct 26, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen, and welcome to the Thermo Fisher Scientific 2022 third quarter conference call. [Operator instructions] I would like to introduce our moderator for the call, Mr. Rafael Tejada, vice president, investor relations. Mr.\n\nTejada, you may begin the call.\n\nRafael Tejada -- Vice President, Investor Relations\n\nGood morning and thank you for joining us. On the call with me today is Marc Casper, our chairman, president and chief executive officer, and Stephen Williamson, senior vice president and chief financial officer. Please note this call is being webcast live and will be archived on the Investors section of our website, thermofisher.com, under the heading news and events until November 11, 2022. A copy of the press release of our third quarter 2022 earnings is available in the investors section of our website under the heading Financials.\n\nSo before we begin, let me briefly cover our safe harbor statement. Various remarks that we may make about the company's future expectations, plans and prospects constitute forward-looking statements for purposes of the safe harbor provisions under the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by these forward-looking statements as a result of various important factors, including those discussed in the company's most recent annual report on Form 10-K and subsequent quarterly reports on Form 10-Q, which are on file with the SEC and available in the Investors section of our website under the heading Financials, SEC Filings. While we may elect to update forward-looking statements at some point in the future, we specifically disclaim any obligation to do so even if our estimates change.\n\nTherefore, you should not rely on these forward-looking statements as representing our views as of any date subsequent to today. Also during this call, we will be referring to certain financial measures not prepared in accordance with generally accepted accounting principles, or GAAP. A reconciliation of these non-GAAP financial measures to the most directly comparable GAAP measures is available in the press release of our third quarter 2022 earnings and also in the Investors section of our website under the heading Financials. So with that, I'll now turn over the call to Marc.\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nThanks, Raf. Good morning, everyone, and thanks for joining us today for our third quarter call. As you saw in our press release, we had another excellent quarter. We delivered outstanding financial performance.\n\nOur core business is performing incredibly well and demonstrating broad-based strength, and this is allowing us to raise our guidance once again for the full year. As I reflect on our performance during the quarter and on a year-to-date basis, I'm very proud of our team's great execution, effectively navigating dynamic times and continuing to drive market share gains. Our ongoing success is driven by our proven growth strategy and our PPI Business System, and I'll talk about that more later. So let me recap the Q3 financials.\n\nOur revenue in the quarter was $10.68 billion. Our adjusted operating income was $2.37 billion, and we delivered another quarter of strong adjusted EPS performance, achieving $5.08 per share. Turning to our end markets. As we saw in the second quarter, we had a continuation of strong performance in Q3.\n\nThis was driven by good market conditions and outstanding execution from our global team, resulting in meaningful share gain. Let me now give you some additional color. Starting with pharma and biotech, we delivered outstanding performance with growth in the mid-teens. We saw excellent growth across the businesses serving these customers, highlighted by our bioproduction and pharma services businesses.\n\nOur differentiated customer value proposition is resonating with our customers and helping to further elevate our trusted partner status. In academic and government, we grew in the mid-single digits in the quarter. We saw strong growth in our biosciences and electron microscopy businesses. Turning to industrial and applied.\n\nWe grew in the high teens for the quarter. We have broad-based strength across all of our analytical instrument businesses serving these customers. And finally, in diagnostics and healthcare. As expected, our revenue was approximately 30% lower than the prior year quarter.\n\nIn this end market, we delivered good core business growth, led by our microbiology and transplant diagnostics businesses. So now let me turn to our growth strategy, which has enabled another quarter of excellent performance. The investments we've made over the past few years are fueling growth and generating strong returns. As a reminder, our strategy consists of three pillars, developing high-impact innovative new products, leveraging our scale in the high-growth and emerging markets and delivering a unique value proposition to our customers.\n\nLet me start with innovation. Our focus on high-impact innovation enables our customers to address some of the world's greatest challenges. We further strengthened our position in Q3, and I'd like to give you just a few highlights. During the quarter, we advanced our industry-leading Thermo Scientific Orbitrap portfolio, launching the Orbitrap Ascend Tribrid mass spectrometer during the International Mass Spectrometry Conference.\n\nThis instrument provides faster, more sensitive sample analysis for proteomics and metabolomics research and insights into clinically relevant biomarkers implicated in cancer. In electron microscopy, we introduced the Thermo Scientific Arctis Cryo-Plasma Focused Ion Beam, an automated microscope that streamlines cryo-electron tomography. This instrument will help provide more insights into how proteins and other molecules operate within cells, enabling breakthroughs in treatment for infectious diseases and neurodegenerative disorders. We also continue to advance our clinical next-gen sequencing portfolio to help our customers better understand, diagnose and treat cancer.\n\nWe recently launched the Oncomine Dx Express Test and Oncomine Reporter Dx software, a precision medicine offering which detects genomic abnormalities in tumor samples and helps match cancer patients with approved therapies and clinical trials. These products recently received CE-IVD certification and are designed to run on our Ion Torrent Genexus Next-Generation Sequencing System, allowing doctors to use NGS technology to improve care by bringing the power of precision medicine closer to patients. Another key pillar of our growth strategy is our customer value proposition. It's all about leveraging the incredible capabilities we have across our company and delivering them in a way that enables our customers to achieve their own goals for innovation and productivity.\n\nAnd that makes it rational for them to do more business with us. The accelerated investments we've made over the past couple of years are driving growth. This is particularly true for our pharma and biotech customers, where we continue to build on our trusted partner status as we bring our new capacity and capabilities online to meet the strong demand for our products and services. Let me share a couple of examples.\n\nDuring the quarter, we opened a purification technologies facility in Chelmsford, Massachusetts. This site will manufacture resin beads used in the production of biologics. As you know, we have a rapidly growing purification business, which is highly valued by our customers. This new facility will ensure we can meet their increasing demand.\n\nWe also continue to strengthen our global pharma services network, adding viral vector manufacturing capabilities in Plainville, Massachusetts. I joined the opening of this facility, and it was a terrific event. We had significant attendance from our customers, and we were able to showcase the various ways in which our team can support their cell and gene therapy programs. The facility also utilizes and showcases our industry-leading single-use bioprocessing technologies and analytical instruments, which demonstrates to our pharma and biotech customers the uniqueness of our capabilities and how they can best utilize in bringing new medicines to market.\n\nSo these are just a couple of examples that demonstrate how we're continuing to build our trusted partner status and further strengthen our unique customer value proposition. Our pharma biotech customers are capitalizing on this, which also includes PPD, our clinical research business. I'll cover that later in my remarks. Before turning to an update on capital deployment, I thought I'd briefly reflect on the impact of our growth strategy in 2022.\n\nAs you know, the actions we've taken over the last few years have allowed us to meaningfully accelerate our organic growth and position us to continue our long-term industry-leading performance. The product launches this year have been truly outstanding, and the pipeline, it looks fantastic. The new capabilities that we have invested in have meaningfully strengthened our unique customer value proposition, and our customers are continuing to expand their relationship with us. All of this is enabling us to deliver industry-leading core growth.\n\nLet me give you a brief update on capital deployment. We continue to successfully execute our disciplined capital deployment strategy, which is a combination of strategic M&A and returning capital to our shareholders. The acquisition of PPD is a great example of how our capital deployment strategy is creating customer and shareholder value. The business is performing incredibly well, delivering high teens core revenue growth in the quarter.\n\nThe combination of a great business and a smooth integration is driving excellent financial performance. In addition, our customers are excited by the capabilities we have to support their clinical trial needs, and that is translating into meaningful revenue synergies for an even brighter future. All of this is enabling us to drive short- and long-term returns on the acquisition that are well ahead of the deal model. Let me spend a moment on our PPI Business System, which helps us continually improve the customer experience, quality, productivity in our company overall.\n\nThe goal of PPI is to find a better way every day. This is an essential element of our company culture. In dynamic times, we really see the strength of our PPI Business System. As you know, it was applied with incredible impact to allow us to lead the response to the pandemic.\n\nAnd today, it's applied to solve supply chain challenges, increase efficiency and helps our teams find better ways to offset inflation. It also enhances our ability to unlock the value creation in our acquisitions. Our experienced management team, along with the benefit of our scale and our PPI Business System, uniquely position the company to successfully navigate through whatever macroeconomic conditions come our way. So overall, it was another fantastic quarter, thanks to great execution by our teams, the strength of our proven growth strategy and the power of our PPI Business System.\n\nTurning to our progress on our environmental, social and governance priorities. During the quarter, we continued to make great progress on our goal to reduce our carbon footprint, announcing an agreement with Enel North America to purchase wind power renewable electricity equal to half of our U.S. electricity needs. This agreement will significantly advance our ambitious emissions reduction strategy.\n\nI'm also very pleased that we have achieved our 2020 commitment to hire 500 graduates from the historically black colleges and universities, supporting our commitment to diversity and inclusion and increasing our positive social impact. So another strong quarter in progressing our ESG priorities. Now, I'd like to review our updated 2022 guidance at a high level, and then Steve will take you through the details. We are raising our full year guidance.\n\nWe're increasing our revenue guidance by $650 million to $43.8 billion, which would result in 12% reported revenue growth over 2021. And we're raising our 2022 adjusted EPS guidance by $0.08 to $23.01 per share. The higher outlook primarily reflects the strength of our core business and a modest impact of additional COVID-19 testing. These are more than offsetting the increased foreign exchange headwinds and demonstrate how well we're operating with speed at scale to enable our customer success.\n\nIn addition, our guidance reflects the decision to help our colleagues with the temporary impact of inflation, and we'll be making a onetime payment of approximately one week's additional salary to nonexecutive colleagues. So to summarize our key takeaways in the third quarter, our outstanding results in Q3 and year-to-date reflect our team's excellent execution, the benefits of our proven growth strategy and the positive impact of our PPI Business System. Our business is performing very well, and markets continue to be strong. We're gaining market share.\n\nWe're seeing the benefits of our accelerated investments in innovative new products and enhanced capabilities and capacity. In addition, our clinical research business has delivered excellent results, and customers are valuing the benefit of our expanded offering. And our experienced management team, the benefits of our scale and our PPI Business System uniquely position us to continue to navigate the dynamic times we're living in. All of this has enabled us to raise our outlook for 2022 again and further solidify our incredibly bright future.\n\nWith that, I'll now hand the call over to our CFO, Stephen Williamson. Stephen?\n\nStephen Williamson -- Senior Vice President and Chief Financial Officer\n\nThanks, Marc, and good morning, everyone. We delivered another excellent quarter in Q3. This includes 14% core organic revenue growth from $5.08 of adjusted earnings per share. Revenue in Q3 was approximately $800 million higher than we'd incorporated in our previous 2022 guidance, with just over $600 million driven by another quarter of extremely strong core organic growth, just over $200 million from additional COVID-19 testing revenue, partially offset by a small additional headwind from FX.\n\nSo continue strengthening the core once again broad-based across businesses and end markets. In terms of adjusted EPS, our PPI Business System enabled us to generate very strong pull-through on the revenue beat. And after accruing $0.18 of additional compensation in the quarter to help our colleagues with the temporary impacts of inflation, we delivered $0.36 of adjusted EPS higher than included in our previous guidance. So Q3 was another quarter of excellent financial performance.\n\nLet me now provide you with some more details. Beginning with our earnings results. And as I mentioned, we delivered $5.08 of adjusted EPS in Q3. GAAP EPS in the quarter was $3.79.\n\nOn the top line in Q3, we delivered 14% core organic revenue growth and $440 million of testing revenue. Reported revenue grew 14% year over year. The components of our Q3 reported revenue increase included 1% lower organic revenue, a 20% contribution from acquisitions and a headwind of 5% from foreign exchange. Turning to our organic revenue performance by geography.\n\nThe organic growth rates by region are skewed by the COVID-19 testing revenue in the current and prior year. In Q3, North America grew in the low single digits. Europe declined 10%. Asia Pacific grew in the low single digits with China growing high single digits, and rest of the world declined high single digits.\n\nWith respect to our operational performance, adjusted operating income in the quarter decreased 15% and adjusted operating margin was 22.2%, 760 basis points lower than Q3 last year. In the quarter, we achieved strong price realization to effectively address inflation while also driving strong productivity. This is more than offset by lower testing volumes, continued strategic investments and the expected impact of incorporating PPD into our financials. The company's adjusted gross margin in the quarter came in at 41.7%, 970 basis points lower than Q3 last year.\n\nFor the third quarter, the change in gross margin was due to the same drivers as those for our adjusted operating margin. After factoring in the decision we took to accrue the additional colleague compensation that I mentioned earlier, both adjusted operating margin and adjusted gross margin came in as we had anticipated in our prior guidance. Moving on to the details of the P&L. Adjusted SG&A in the quarter was 16.2% of revenue, a decrease of 170 basis points versus Q3 2021.\n\nTotal R&D expense was approximately $350 million in Q3, and R&D as a percent of our manufacturing revenue in Q3 was 6.7%. Looking at results below the line for the quarter. Our net interest expense was $106 million. Our adjusted tax rate in the quarter was 11.8%.\n\nThis was 240 basis points lower than Q3 last year. The Q3 rate was 75 basis points lower than we assumed in the quarter in the prior guide due to the timing of discrete tax planning items between Q3 and Q4, with no net change for the year overall. Average diluted shares were 395 million in Q3, approximately 2 million lower year over year, driven by share repurchases, net of option dilution. Turning to cash flow on the balance sheet.\n\nYear-to-date cash flow from continuing operations was $5.7 billion, and free cash flow was $4 billion. Our capacity and capability investments continue to progress well, and the year-to-date net capital expenditures were $1.7 billion. We returned $118 million to shareholders through dividends in the quarter. This reflects the 15% dividend increase we announced in February.\n\nWe ended the quarter with approximately $2.9 billion in cash and $29.2 billion of total debt. Our leverage ratio at the end of the quarter was 2.3 times gross debt to adjusted EBITDA and 2.1 times on a net debt basis. Concluding my comments on our total company performance. Adjusted ROIC was 15.2%, reflecting the strong returns on investment that we're generating across the company.\n\nNow, to provide some color on the performance of our four business segments. Let me start with a couple of framing comments. The scale and margin profile of our COVID-19 testing revenue varies by segment. And the testing revenue was significantly higher than the prior year quarter but does skew some of the reported segment margins.\n\nAs I mentioned earlier, we're executing strong pricing realization across all segments to address higher inflation. And we outlined at the beginning of the year, we're referring to the acquired PPD business as our clinical research business, and that resides in the laboratory products and biopharma services segment. So moving on to the segment details, starting with life sciences solutions. Q3 reported revenue in this segment declined 20%, and organic revenue was 17% lower than the prior year quarter.\n\nIn Q3, we delivered very strong growth in our bioproduction business. This was more than offset by the moderation in testing revenue in the segment versus the prior year quarter. Q3 adjusted operating income in life sciences solutions decreased 43%. And adjusted operating margin was 35.1%, down 14 percentage points year over year.\n\nIn the quarter, we delivered good productivity, which was more than offset by unfavorable volume mix and the strategic investments that we're making across the segment. In the analytical instruments segment, reported revenue increased 10% in Q3, and organic growth was 16%. The strong growth in this segment this quarter was broad-based, led by chromatography and mass spectrometry and electron microscopy businesses. Q3 adjusted operating income in this segment increased 47%, and adjusted operating margin was 23.8%, up 600 basis points year over year.\n\nDuring the quarter, we delivered strong volume pull-through, favorable business mix and strong productivity. This was partially offset by strategic investments. Turning to specialty diagnostics. In Q3, reported revenue declined 22%, and organic revenue was 19% lower than the prior year quarter.\n\nIn Q3, we saw a strong underlying growth in our transplant diagnostics and microbiology businesses. This is offset by lower COVID-19 testing revenue versus the year-ago quarter. Q3 adjusted operating income decreased 29% in the quarter, and adjusted operating margin was 21%, down 210 basis points year over year. During the quarter, we delivered positive business mix and good productivity, which is more than offset by the impact of lower testing volumes.\n\nFinally, in laboratory products and Biopharma Services segment. In Q3, reported revenue increased 60%. Organic growth was 12%, and the impact of acquisitions was 53%. During Q3, we had strong growth in the pharma services business, as well as the research and safety market channel.\n\nPPD, our clinical research business, is performing very well. And during the quarter, we delivered high teens core organic growth and contributed $1.82 billion of revenue to the segment. Q3 adjusted operating income in the segment increased 89%, and adjusted operating margin was 13%, which is 200 basis points higher than Q3 2021. In the quarter, we drove favorable business mix, good productivity and also saw the benefit from acquisitions.\n\nThis was partially offset by strategic investments. Let me now turn to our updated 2022 guidance. As Marc outlined, we're raising our full year revenue guidance by $650 million to $43.8 billion. This includes a raise in the core organic growth outlook for the year from 11% to 12%.\n\nAnd on the bottom line, we're raising our adjusted EPS guidance for 2022 by $0.08 to $23.01 per share. The increase in the revenue guidance is driven by three elements, an increase of just over $600 million in the outlook for the core business, an increase of just over $200 million for COVID-19 testing revenue and a $200 million decrease to reflect the recent changes in FX rates. From a core organic revenue perspective, the strength of our performance is enabling us to raise our full year core organic revenue growth outlook from 11% to 12%, and there's no change in the assumptions for core organic revenue growth in the fourth quarter. Turning to COVID-19 testing revenue.\n\nWe now expect $2.8 billion of testing revenue for the year, which includes the assumption of an endemic run rate level of $100 million per quarter in Q4. Our Q4 testing assumption has not changed from our previous guidance. In terms of adjusted EPS, the $0.08 raise for the year consists of $0.54 of operational beat in Q3, partially offset by the decision to pay $180 million or $0.36 of additional onetime colleague compensation. And half of this is accrued in Q3, and the remainder will be in Q4.\n\nThe full year guidance change also incorporates $0.10 lower EPS in Q4 for the additional FX headwind in the quarter and the revised phasing of our tax rate. All of this is enabling us to raise the 2022 adjusted EPS guidance by $0.08, from $22.93 to $23.01, further improving a very strong outlook for the year. From a margin standpoint, we now expect the full year 2022 adjusted operating margin to be 24.9%. To help you with your modeling, I think it's worth spending a moment on the impact of the inflationary environment on the company's financial profile.\n\nDuring the year, we've been very effective in passing on higher price to offset higher-than-normal inflation. This results in no net impact on our adjusted operating income dollars as we're effectively offsetting the added inflation, but it does affect the calculation of margins because of the revenue base being higher. The impact on margins for the full year from this dynamic is about 60 basis points, but again, no net impact on adjusted operating income or adjusted EPS. So now let me provide you with some additional details on the updated 2022 guidance.\n\nPPD, our clinical research business, is expected to deliver $6.8 billion of revenue in 2022, which represents 14% core organic revenue growth on a full year basis for this business. We now expect the business to contribute $2.03 to adjusted EPS in the year, up $0.03 from our prior guidance. In terms of FX, we've incorporated current rates into our guidance, and we now expect FX to be a year-over-year headwind of $1.46 billion on revenue or 3.7%. The FX headwind on adjusted EPS in 2022 is now expected to be $0.77 for the full year or 3.1%.\n\nShould FX rates stay the same as they are right now, we estimate the impact on FX in 2023 would be a year-over-year headwind of approximately $1 billion on revenue and $0.75 on adjusted EPS. Our guidance now assumes net interest expense of approximately $440 million in 2022. We continue to assume an adjusted income tax rate of 13.2% in 2022, which includes a 13.6% tax rate in Q4. We now expect net capital expenditures of approximately $2.3 billion to $2.5 billion.\n\nFor free cash flow, we see $7 billion at the high end of the range of outcomes for the year. The actual free cash flow will depend on the year-end level of working capital. Our guidance still assumes $2.5 billion of capital deployment, which is the $2 billion of share buybacks that we completed in January and $475 million of capital returned to shareholders through dividends. Our guidance also continues to assume that full year average diluted share count will be between 394 million and 395 million shares.\n\nAnd to conclude, we delivered another excellent quarter in Q3. We're in a great position to achieve our 2022 goals. With that, I'll turn the call back over to Raf.\n\nRafael Tejada -- Vice President, Investor Relations\n\nThank you, Stephen. Operator, we're ready for the Q&A portion of the call.\n\nOperator\n\n[Operator instructions] Our first question today comes from Jack Meehan with Nephron Research. Jack, please go ahead.\n\nJack Meehan -- Nephron Research -- Analyst\n\nThank you. Good morning. So the big debate of the last week has been bioprocessing ordering and stocking trends. Marc, I was curious if you've seen any normalization of ordering patterns from your customers.\n\nThe quarterly growth, obviously strong, but how do you handicap the risk we could have an air pocket as COVID gets handed off to the quarter?\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nJack, thanks for the question. So probably best to start one level up, and then I'll get to the details of it, right? When I think about pharma and biotech more broadly, right, it's our largest end market, represents about 60% of our business. Performing incredibly well, right? Mid-teens growth this quarter, mid-teens growth year-to-date. And that growth number actually doesn't include PPD, right, which is actually growing, in the quarter grew faster, right? So very strong, it's broad-based.\n\nCustomer demand continues to be strong across the portfolio. All our businesses are performing very nicely. The long-term trends look very positive. And when I think back and I think -- because we live in a moment, if you go back the last five years, it actually averaged for this whole segment mid-teens growth, right? So it's not this year or this quarter, it's really been a long-term trend long before COVID, right? So very, very strong.\n\nNow, so what's going on in bioproduction, right? There's obviously been a lot of commentary over the last week on the topic. And as a reminder, we have a leading presence to cell culture media, single-use technologies and actually, quite a rapidly growing purification business. In aggregate, it's less than 10% of our total revenue. It's an awesome business, right? They performed very well in the quarter.\n\nIt grew faster than the pharma and biotech average. The dynamics are very good, and we're very well positioned to deliver great growth going forward in serving that customer base.\n\nJack Meehan -- Nephron Research -- Analyst\n\nGreat. And then, if you'll humor me, it's that time of year, everyone is thinking about 2023. So you sound very confident about your ability to outperform the market. But of course, the question is, how do you feel like the market is going to grow? So if you could just talk about how you're feeling about the healthy end markets.\n\nAnd any color you care to share around where you think you could land versus the 7% to 9% CAGR you've laid out through 2025.\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nWhat I would say is if I think about where we are and think about the third quarter, right, it was a terrific quarter. If you look at the strength, right, that we had in terms of our core growth, it's really broad-based, right? And you look at it and you say, all right, pharma and biotech, that grew in the mid-teens. Industrial and applied, that grew in the high teens. Academic and government grew in the mid-single digits.\n\nAnd the core in healthcare and diagnostics, which is the indicator of what's going on in that end market, that actually was a mid-single-digit growth as well. So it's really very strong. So I like where we are at the nine months. And in terms of exactly how we'll be in '23, we'll obviously talk about that in January in terms of what the outlook is.\n\nBut certainly, at this point in the year, our end markets are strong, and our company's performance has been exceptional.\n\nJack Meehan -- Nephron Research -- Analyst\n\nAppreciate it. Thank you.\n\nOperator\n\nThank you for your question. Our next question comes from Derik De Bruin with Bank of America. Derik, please go ahead.\n\nDerik De Bruin -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good morning.\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nGood morning, Derik.\n\nDerik De Bruin -- Bank of America Merrill Lynch -- Analyst\n\nSo to follow up on Jack's question just because I'm getting yelled at by investors. Can we talk a little bit more about the -- just some of the impressions on '23? I think particularly, there's a focus on margins given how -- sort of given how FX trends are going. I mean, it looks like, what, about a 4% FX to the top line next year and $0.75 on the bottom line. So is that -- sort of should we think about if you're thinking about that 7% to 9%, maybe something in the 3%, 4% organic range all-in next year given the FX headwinds? And then just sort of talk a little bit more about like the margin setup for next year.\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nSo I'll start, and I'm sure Stephen will chime in as well. So obviously, at a high level, we'll get into this in January, right? Why do we do January is we'll have the benefit of two things, which is where was the exact finish to the year, what's our jumping-off point? And second, what is the most close-in view of the macro environment, right? So we'll see how that plays out in January. But -- so if I go through the components, right, obviously, the company is performing at an incredibly strong level. So that's very encouraging.\n\nFX, as Stephen outlined, it will be a headwind. That could change obviously. But right now, we gave you that number so that you can at least update the models to reflect what current FX range -- rates are. And that's about $1 billion of revenue headwind and about $0.75 of adjusted EPS.\n\nThe second one that I think is important, and it's an assumption, which is we're assuming in the fourth quarter that we're at an endemic level of COVID-19 testing. So that's $100 million of revenue in the quarter. And if that plays out in that way, then I think that's a reasonable assumption per quarter for next year. So you're going to have the view on the COVID runoff down to the endemic rate on testing.\n\nAnd from the rest of the perspective, the business is in really good shape. And Stephen, you can comment on margins or anything else that I might have missed.\n\nStephen Williamson -- Senior Vice President and Chief Financial Officer\n\nYes. So Derik, we look forward to giving you full details in three months' time in terms of the Q4 call. But think about margin profile, there are different elements of the revenue, and think about how we model it in the long-term model for the company. 50 basis points of expansion on core essentially equates to about 30% pull-through on the margin profile and the revenue dollars increasing from a core standpoint.\n\nThe FX headwind that we outlined on the call, that's also roughly a 30% margin pull-through. And on testing, it's a very profitable element of our business. And we factor in appropriately addressing the variable costs and the nonrepeat of some of the colleague compensation onetime that we did this year. That pull-through on testing is -- no, just note that 10% margin higher than the core.\n\nSo that will help you with the modeling in terms around your own assumptions around the organic growth and testing and FX. And as I said, that's all incorporated in the long-term model. And then, on the call, I called out that 60 basis points impact from the added impact of added inflation and what we're doing on pricing and managing the company well to offset the impacts of the added inflation, as more revenue to the company and negate the impact of the additional inflation. So no net impact on operating income dollars.\n\nSo when I think about all of that wrapped up for our long-term financial model we gave you back in May, we're on track to achieve or exceed the adjusted EPS target we put out there. We're managing very well through the dynamic times. Look forward to giving more details in '23 on the next call.\n\nDerik De Bruin -- Bank of America Merrill Lynch -- Analyst\n\nGot it. OK. I'm still getting a bunch of questions from investors, but we'll follow up with it. But two other questions just on this one.\n\nI guess are you still seeing like for like the $1.5 billion in COVID vaccines for this year? And just obviously some of the semiconductor companies have been hitting their capex numbers or cutting their capex numbers. Does that have any sort of like impact on sort of like your view on FEI and the analytical instrument outlook?\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nYes. So Derik, in terms of vaccines and therapies, as a reminder, we said we would expect to do in our core revenue about $1.5 billion this year. We did just under $400 million in Q3. That brings the year-to-date to $1.3 billion and on track to achieve or exceed the $1.5 billion.\n\nSo I feel good about that. As a reminder, on electron microscopy, it's not correlated to the capex spend. It's correlated to R&D and new nodes. And that business is performing incredibly well in terms of growth, with bookings, all of the different metrics really doing incredibly well.\n\nThank you, Derik.\n\nOperator\n\nOur next question comes from Patrick Donnelly with Citi. Please go ahead. Your line is open.\n\nPatrick Donnelly -- Citi -- Analyst\n\nHey, guys. Thanks for the questions.  Marc, maybe one just kind of following up on that stocking piece. I know you've previously talked about Thermo, you guys are involved in a lot of the purchasing decisions of customers, have employees in the room. And you had previously seen some repurposing of the vaccine orders for other trial work as expected.\n\nSo just, I guess, wondering specifically on the bioprocessing side, kind of what your visibility is there? What you are seeing on stocking, and at times you said, if anything, maybe the inventory is actually running lean because you guys were capacity constrained. So I'm just wondering kind of an update on that front.\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nYes. So Patrick, thanks for the question and a follow-up on that. So if I think about inventory, right, and I read some of the Q&A that happened last week. And somehow that translated into our own share price, which is a little bit of a head-scratcher to me.\n\nIf you think about inventory levels, right, I guess I always start at the high level. Three of our businesses, which are a large portion of the company, literally have nothing to do with inventory at all, right, which is pharma services, our clinical research business and our analytical instrument business has nothing to do with inventory. So I think it's important to remember that. The second, when you get down to the businesses that do have inventory levels, some of which we hold, some of which our customers hold, we do have really good visibility into it.\n\nAnd we help our customers appropriately manage those levels of inventory. I feel good about the position that we're in, all right? And for the couple of customers that might have COVID-related things, I'm sure that they purchased a bit more because they had a high range of demand volatility that they were managing. But in terms of our bioproduction business, it grew well faster than pharma and biotech. The outlook is really strong, and I feel very well positioned going forward.\n\nPatrick Donnelly -- Citi -- Analyst\n\nOK. That's helpful. And then, Stephen, I know you talked a little bit about the pricing dynamic kind of offsetting the inflation this year. It's obviously been a higher number, as you all know.\n\nHow are you thinking about the '23 piece on pricing? Again, what's the expectation internally from Thermo on the inflation side? How are you going to kind of play the pricing side? Are you going to continue to raise as much? Is there a level where you kind of pull back a little bit and kind of value the customer relationships more? Maybe just talk through, again, the pricing piece. I know it's a little bit delicate with how high the inflation side is. So be curious how you guys are thinking about that into next year.\n\nStephen Williamson -- Senior Vice President and Chief Financial Officer\n\nYes. So I'll have a better view on inflation three months' time, but we're effectively managing the dynamics now and expect to effectively manage them going forward. And this is not about pricing just if you can in an inflation environment, it's pricing appropriately given the inflation dynamics and then bringing our customers along with us on that journey. So I feel good about our ability to manage the dynamic going forward should the inflation levels remain at the high, elevated level.\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nAnd Patrick, the only thing I would add to that is when you think about how we describe the approach, right, we're not marking it up, right? We are driving substantial productivity. We're passing through an appropriate level of pricing to reflect real cost increase, and we're helping our customers through this period of time. And that's how we thought about it. And we think that's the right thing given the importance of Thermo Fisher to our customers.\n\nAnd we'll do an appropriate level of pricing based on the environment in '23 as we get into it.\n\nPatrick Donnelly -- Citi -- Analyst\n\nGreat. Thank you, guys.\n\nOperator\n\nOur next question comes from Vijay Kumar with Evercore ISI. Please go ahead, Vijay.\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nHey, guys. Thanks for taking my question and congrats on a solid top line this morning. Marc, one on fiscal '23 again. I know the guidance; the formal guidance is in January.\n\nBut I guess the question is, the 7% to 9% LRP that Thermo issued at the Analyst Day, that's a CAGR. But there's been some nervousness that perhaps '23 could be below that range. I mean, the macro is the macro. But ex macro in industrial, is there any sensitivity around these major drivers that would cause the big deviation from the LRP range for '23 that we should be thinking about? Again, I'm not asking for formal guidance, but any variables, qualitative comments we should be looking at?\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nSo Vijay, thanks for the question. So when I think about how do we think about growth, right, the 7% to 9% and if you take the long-term model, right? So I'm not commenting on '23. I don't make a comment there. But that's industry-leading, right? I think folks forget that.\n\nThat number is higher than anybody else has committed to in the industry. So I feel great about that. And of course, we're the biggest company, so which makes it super cool, right, in terms of what that says about share gain, right? So I think that sometimes is forgotten. We're not constraining ourselves to 7% to 9%, right? We're growing 12% this year, right? And the measure that we actually use is are we doing a good job, right? I mean the 7% to 9% is assuming 4% to 6% market growth over the long period.\n\nThe market growth is a little better than that. I feel great about our 12% performance. When we sit here at the end of 2022, what we do know is that our business will have been larger as a starting off point than what we assumed in the long-term model. So right there, we've had more core growth that will offset some of the transition from vaccines and therapies that move into the other parts of core.\n\nSo we're super well positioned. And we'll figure out, is 7% to 9% the right number? That's kind of our default unless something is radically different as a starting point to a year. And obviously, if the conditions are super robust, it could be higher than that. If we're in a gale-force recession, it could be lower than that, right? But I think at this point in the year, the long term is we're doing better on the top line.\n\nWe're right on track on EPS, and we're incredibly well positioned into 2023, and we'll figure it out. And I don't think we're going to surprise anybody, right? We'll all look at the macro and say, yes, those numbers make a ton of sense based on what the environment is as we sit here in January. And once again, we'll be ambitious, and we'll deliver great performance.\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nThat's helpful, Marc. Maybe one for Stephen here. On the impact from additional comp, and I understand there is some flow-through in Q4. Stephen, when you think about '23, are you planning for any comp, incremental comp expenses to offset inflation for employees? Is that something that we should be considering?\n\nStephen Williamson -- Senior Vice President and Chief Financial Officer\n\nNo. I think the dynamics that I outlined earlier on regarding going to pull-through, the assumption there is that don't repeat. We'll figure out what the current situation is during the year and make the right calls and manage the company appropriately. But when I think about that pull-through on the testing, that includes the non-repeat on those actions as well.\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nThanks, guys.\n\nOperator\n\nOur next question comes from Dan Brennan with Cowen. Please go ahead, Dan. Your line is open.\n\nDan Brennan -- Cowen and Company -- Analyst\n\nGreat. Thank you. Thanks for taking my question. Marc, don't want to jinx or jet, so I'm going to refrain from making any comments or claims here.\n\nMaybe Marc and Steve, could you just walk us around the globe and your key end markets? I mean just speak to what extent you're seeing any impacts from the weakening global economy. And if nothing really manifest in Q3, which doesn't look like it has, are there any lead indicators like orders funnels, anything of that nature that might reflect some softening? Just -- and then kind of connected to that, the fourth quarter guide does reflect a notable slowing on a stock comp basis. And so, I'm wondering if that's just conservatism or if that does incorporate some maybe risk from global macro.\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nSo in terms of the macroeconomic environment, beyond the inflationary impacts which we had explained, actually, our end markets have been very strong. As you know, I gave you the cut by the four kind of customer sets. Actually geographically, no particular pattern that jumps out as a concern. When you look at Europe, the core growth actually was 10% growth.\n\nSo Europe was actually strong. And it makes sense because you have a large pharma and biotech proportion of that. So that was good. And our assumption is that in China, which will have a very good year and a good quarter, it's probably slightly lower than the long-term historical view.\n\nAnd that's mostly the COVID policies there. So we're always looking for is there something lurking, but right now, things remain strong. Fourth quarter, it's the same assumptions that we've been using all year, which is we haven't been adjusting our forward-looking quarters. We basically took the original quarters.\n\nAnd as we delivered a strong quarter, we raised the full year based on what we delivered and have kept the convention for the upcoming quarters the same as we had done in the past. That implies growth in line with the long-term organic outlook for the business. And obviously, we'll deliver the strongest possible growth that we can. We'll just see how the quarter plays out.\n\nDan Brennan -- Cowen and Company -- Analyst\n\nGreat. And then, maybe just as a follow-up, just on instruments. Instrument demand at Thermo across the group has been kind of very strong for a period of time. AI had another good quarter.\n\nJust wondering kind of what you're seeing on that front, and kind of what do you think about as you look ahead. While I'm not guiding for '23, kind of is the instrument underlying strength sustainable? Just any color macro-wise and company-specific initiatives.\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nYes, thanks for the question. And the instruments business is performing really well, continuing the trend. It's great to have the growth rates that we delivered in terms of mid-teens organic growth in the quarter and which is terrific. Bookings were very strong.\n\nSo the outlook remains very good. Very impressed with how our chromatography and mass spectrometry business did. It's our fastest-growing business in the quarter, and great growth in electron microscopy and really good performance in chemical analysis. So actually, the business strength is widespread and broad-based.\n\nSo it looks very good as we're finishing up the year.\n\nOperator\n\nOur next question comes from Rachel Vatnsdal with J.P. Morgan. Please go ahead, Rachel.\n\nRachel Vatnsdal -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks for taking the question. So first up, on the manufacturing side, you've had a few peers that have had some quality concerns in recent quarters around that sterile fill and finish market. So can you just walk us through how that business performed for you in 3Q? And then do you think this really opens up any opportunity for share gains moving forward?\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nSo Rachel, thanks for the question. When I think about our pharma services business, it was one of the highlights for performance in the quarter. It's been a good growth driver for the company. Customers are driving toward more outsourcing.\n\nThe smaller companies have less manufacturing and development capabilities in-house. So the secular trends here are fantastic, and we have an industry-leading position. We've been investing in new capabilities, strengthening quality systems, capacity, infrastructure, all of those things to position it well. And it's our job to do great work every day for our customers and focus on doing that really well.\n\nAnd that's what we're focused on, and it's important that we do it. And we want to grow at a reasonable rate and just make sure that we're doing great work every day for our customers.\n\nRachel Vatnsdal -- JPMorgan Chase and Company -- Analyst\n\nAnd then as a follow-up to Dan's question, just wanted to dig a little bit deeper into Europe. So you mentioned that that region was down 10% in the quarter, but you flagged that it was also impacted by that COVID testing comp. So can you walk us through how much of that 10% decline was due to FX and COVID roll-off? And then are you seeing any shift in demand within that region just given the macro uncertainty there?\n\nStephen Williamson -- Senior Vice President and Chief Financial Officer\n\nYes. So in terms of the core growth in Europe, it's about 10%, so that's excluding FX, that's excluding the testing side of things as well. So good strong growth across the region. And as Marc said, a good concentration of pharma and biotech in the region, which is a strong growth business for us.\n\nSo yes, around about 10% in Europe.\n\nRafael Tejada -- Vice President, Investor Relations\n\nThanks, Rachel.\n\nOperator\n\nOur next question comes from Dan Arias with Stifel. Please go ahead, Dan.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nGood morning. Thanks. Marc, on the bioproduction capacity expansion that you've been working on, the $600 million plus that you outlined there as a build-out, I'm just wondering, as we head toward December, if you might be able to sort of give a refreshed view on just how much of that will be -- or do you think will be open to start the year versus what might be slated for '23? And then how you're feeling about filling out that capacity just given what we're seeing in terms of end market demand and activity there?\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nYes. So Dan, thanks for the question. So as a reminder, back in early 2021, we outlined our goals for expanding our capacity to meet the really strong long-term growth trends in our pharma services and our bioproduction businesses. And really, what we did is we looked at our five-year road map of what we were planning to bring forward, and we pulled some of those things forward.\n\nAnd in bioproduction, we made three specific investment decisions, some expansion of our single-use technology network. We opened a facility, a second facility in Utah. We opened up a facility in Tennessee. Both of those are operational.\n\nWe expanded our Grand Island, New York cell culture media facility. That's also largely complete. And we just opened our purification facility in Massachusetts, which is our second purification facility. So we're largely complete with the investments in bioproduction.\n\nBut we're not operating at full capacity of that. We're not operating full shift seven days a week in the new facilities. We're rather going through the thoughtful ramp-up. And that will continue to ramp up through 2023 and even into 2024 to bring it to kind of more of the full utilization rate.\n\nWe feel very good about the demand environment. So that capacity is bringing lead times back to more normal pre-pandemic levels, which is terrific. And that will position us really well for share gain. When I think about purification, which I think is worth a moment on, we were literally capacity constrained.\n\nWe had demand that was so strong that we weren't able to bring on a lot of new business over the last few months. And it's great to have transferred it online because that allow us to continue to support the growth of new molecules in our customers. So that's a quick recap on that.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nOK. Helpful. And then, just maybe on PPD, it sounds like things continue to go well there. And to the point of a couple of guys here, there's naturally a focus on 2023.\n\nYou will have a tough comp there, actually like two years of tough comps there. So anything that you might be able to add on just how you see PPD growth tracking going forward?\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nYes. So our clinical research business, right, it serves an attractive end market within pharma and biotech, again, similar in a way to our pharma services business, more of the innovations coming from the smaller companies. That really lends well to partnering with a clinical research organization. Our business is growing at a very high level.\n\nAs Stephen highlighted, we're expecting 14% growth assumed in our guidance for the year, which is very strong. And what I'm really excited about is the reaction from customers. I've seen quite a few customers in the third quarter and really had the opportunity to discuss what we're doing in clinical research services. And feedback is exciting.\n\nOur revenue synergies are very strong. They don't show up in the revenue to date, they show up in the authorizations for the future. And which is why I was able to really highlight that the business is not only ahead of the short-term deal model, but the projection is it will be well ahead over the long-term deal model. And we're excited about the momentum we'll carry with that business going into 2023.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nOperator, we have time for one more question.\n\nOperator\n\nThank you. Our final question today comes from Tejas Savant with Morgan Stanley. Please go ahead, Tejas, your line is open.\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nThank you.  Marc and Steven, good morning. One follow-up from me on Europe, Marc. I mean, energy costs are clearly in focus here heading into the winter. Can you just help us dimension your cost on the energy side as a percent of your regional sales? And any kind of like resiliency plans that you've put in place? And then as a quick follow-up there, any color on research funding trends in Europe, particularly as government priorities might be shifting here a little bit?\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nYes. So one of the powers of our PPI Business System and the benefits of our scale is to be able to navigate the supply chain challenges that have existed in the world. And I would put energy availability as a potential challenge in Europe as we get into the winter. So we went site by site and looked at what is the source of energy and made appropriate adjustments.\n\nSo a number of sites, we moved off of natural gas or there was a situation where the government said that we're going to be supplied. It's different scenarios depending on which country, what site, what purpose. So I feel like we're well positioned to navigate that environment. In terms of research funding, it seems good.\n\nI mean, obviously, the next level of European funding is being considered this month and at least what the public discussion is positive about the funding environment there. In terms of energy costs --\n\nStephen Williamson -- Senior Vice President and Chief Financial Officer\n\nYes, in terms of the energy cost, this is not material. What's material is make sure you're managing the ability to stay open the supply chain and looking into your customers. So I think that's where we're spending our time and effort, and we switch the energy type. And it's about staying open and meeting that for the customers to support them through this.\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nGot it. And just one quick follow-up on PPD, if I may. One of your CRO peers, Marc, just mentioned investigator staff shortages at some sites, causing trial delays, not broad-based but in some cases. Just curious what you're seeing in terms of labor market tightness there.\n\nAnd do you expect sort of wage inflation specific to PPD to be a factor we should be thinking about into next year as well?\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nBusiness performed great. We obviously had 18% growth in the quarter, 14% growth outlook for the year. The way wage inflation works in that business is it gets passed through in the normal course pricing in the contract so that you could have a quarter or something lag. But effectively, if there's unusual wage inflation that this gets passed through to the customer base.\n\nSo I don't see any particular significant challenge there. So let me wrap it up here. As you heard this morning, another excellent quarter. We're on track to deliver an outstanding year, and that's going to set us up for a very bright future.\n\nAnd as always, thanks for your ongoing support of Thermo Fisher Scientific. We look forward to updating you on our progress as we turn into 2023. Thanks, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRafael Tejada -- Vice President, Investor Relations\n\nMarc Casper -- Chairman, President, and Chief Executive Officer\n\nStephen Williamson -- Senior Vice President and Chief Financial Officer\n\nJack Meehan -- Nephron Research -- Analyst\n\nDerik De Bruin -- Bank of America Merrill Lynch -- Analyst\n\nPatrick Donnelly -- Citi -- Analyst\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nDan Brennan -- Cowen and Company -- Analyst\n\nRachel Vatnsdal -- JPMorgan Chase and Company -- Analyst\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nMore TMO analysis\n\nAll earnings call transcripts"
}