{
  "companyName": "XPO Logistics",
  "companyTicker": "XPO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/31/xpo-logistics-xpo-q3-2022-earnings-call-transcript/",
  "content": "XPO Logistics (XPO -3.48%)\nQ3 2022 Earnings Call\nOct 31, 2022, 8:30 a.m. ET\n\nOperator\n\nWelcome to the XPO Q3 2022 earnings conference call and webcast. My name is Rob, and I will be your operator for today's call. [Operator instructions] Before the call begins, let me read a brief statement on behalf of the company regarding forward-looking statements and the use of non-GAAP financial measures. During this call, the company will make certain forward-looking statements within the meaning of applicable securities laws, which, by their nature, involve a number of risks, uncertainties and other factors that could cause actual results to differ materially from those projected in the forward-looking statements.\n\nA discussion of factors that could cause actual results to differ materially is contained in the company's SEC filings, as well as in its earnings release. The forward-looking statements in the company's earnings release are made on this call are made only as of today, and the company has no obligation to update any of these forward-looking statements, except to the extent required by law. During this call, the company also may refer to certain non-GAAP financial measures as defined under applicable SEC rules. Reconciliations of such non-GAAP financial measures to the most comparable GAAP measures are contained in the company's earnings release and the related financial tables or on its website.\n\nYou can find a copy of the company's earnings release which contains additional important information regarding forward-looking statements and non-GAAP financial measures in the investor section on the company's website. I will now turn the call over to Brad Jacobs. Mr. Jacobs, you may begin.\n\nBrad Jacobs -- Chairman and Chief Executive Officer\n\nGood morning, everybody, and happy Halloween. Thanks for joining our earnings call. With me today in Greenwich are Mario Harik and Drew Wilkerson, our two incoming CEOs of XPO and RXO; and Ravi Tulsyan, our CFO of XPO. We'll be joined during a Q&A by XPO's chief strategy officer, Matt Fassler.\n\nAnd from RXO, we have Jared Weisfeld, chief strategy officer; and Jamie Harris, chief financial officer. This morning, we reported another strong quarter with over $3 billion of revenue and record third quarter operating income, up year over year by 65%. Notably, we generated $142 million of free cash flow, while more than doubling the historical gross capex we invested in our North American LTL network. Under Mario's leadership, our plan for LTL 2.0 is gaining momentum.\n\nThis morning, we reported third quarter records for LTL revenue and adjusted EBITDA. And one of the most telling LTL metrics is our accelerating year-over-year tonnage trend, which improved every month through the quarter and inflected positive in September. Our third quarter tonnage outperformed typical seasonality, which is the opposite of what we're hearing in the industry. Importantly, our tonnage remained strong in October, and we expect positive year-over-year tonnage for the fourth quarter.\n\nWe're getting more freight from customers for two good reasons. One is the investments we've been making in capacity, and the other is our improved quality of service. Our truck brokerage business under Drew's leadership continued to outperform in the third quarter. The team grew volume year over year by an impressive 9%.\n\nWe also delivered a very strong gross profit margin of 19%. I'm pleased that both companies will be strongly positioned for growth when RXO spins off tomorrow. We've been working toward separating our asset-based and asset-light businesses since we announced our strategic plan in March, and this is a watershed moment for XPO shareholders. The final piece of the plan is the divestiture of our European business.\n\nWe will not be providing any updates on that sales process today. Before I close, I want to thank Ravi for his many contributions to XPO's success over the last six years. Ravi was instrumental to our GXO spin last year, and he's led our finance organization through the current spin process and the sale of intermodal. We wish Ravi the very best, and we're pleased that he'll assist in the transition to Carl Anderson, our incoming CFO, who joins us next week.\n\nI look forward to working with Mario and Drew in my roles as executive chairman of XPO and non-executive chairman of our ROX. And now, Ravi will cover the quarter. Ravi?\n\nRavi Tulsyan -- Chief Financial Officer\n\nThank you, Brad. And good morning, everyone. Today, I will discuss our third quarter results and our balance sheet and liquidity. In the third quarter, we generated revenue of just over $3 billion.\n\nExcluding the impact of the intermodal business, which was sold in March, revenue increased 3% year over year. Currency had a negative impact on our reported revenue of $86 million or 3%. We grew adjusted EBITDA to $352 million, reflecting strong earnings growth across the businesses. The year-over-year increase in adjusted EBITDA was 15%, or an increase of 25% excluding intermodal and gain from real estate sales.\n\nFX negatively impacted EBTIDA by $8 million in the quarter. Our adjusted EBITDA margin was a third quarter record of 11.6%, representing a year-over-year improvement of 220 basis points. The firm pricing environment continued this quarter and helped offset inflationary pressures. Our European business also continued its strong performance with organic revenue growth of 6.8%, which was driven by both volume growth and price.\n\nOur corporate costs for the third quarter, excluding one-time expenses, was down year over year by 37%. This reflects continued rationalization of our corporate cost structure in preparation for the upcoming spin-off of RXO. Our interest expense for the quarter was $35 million compared to $53 million in the year-ago period. The effective tax rate for the adjusted EPS for the quarter was 23%.\n\nOur adjusted earnings per diluted share was $1.45, which was up from $0.94 a year ago or an increase of 54%. This increase was primarily driven by higher adjusted EBITDA and lower interest expense. We generated $265 million of cash flow from continuing operations, spent $127 million on growth capex, and received $4 million of proceeds from asset sales. Gross capex was up $50 million year over year, primarily allocated to investments in our LTL network capacity.\n\nOur free cash flow was $142 million. This includes $53 million of cash outflows related to transaction costs that were not included in our free cash flow guidance. Excluding these transaction costs, our free cash flow was $195 million for the quarter. Moving on to the balance sheet, we ended the quarter with $544 million of cash.\n\nThis cash, combined with available borrowing capacity under committed borrowing facilities, gave us over $1.5 billion of liquidity at quarter end. We had no borrowings outstanding under our ABL facility, and our net leverage at quarter end was 1.7 times adjusted EBITDA. RXO will dividend the net proceeds to XPO, which XPO will then use to pay down debt. Lastly, on a personal note, I am very thankful to XPO and Brad for the opportunity to be part of this leadership team and the incredible transformation we have achieved over the last few years.\n\nBoth companies are well-positioned to continue on the growth path. And I wish both Jamie Harris and Carl Anderson success in the new roles. I will now turn things over to Mario.\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nThanks, Ravi. And good morning, everyone. As you saw from our earnings report, we achieved the second straight quarter of tangible results from our growth strategy, which we call LTL 2.0. Our investments and capacity and the momentum we have with service quality are accelerating our top and bottom lines.\n\nWe reported revenue of $1.2 billion and adjusted EBITDA of $258 million, which, excluding real estate gains, was 19% higher than a year ago. Both our revenue and adjusted EBITDA are third quarter records. And we continue to expect to deliver at least $1 billion of adjusted EBITDA this year based on no more than $50 million of real estate gains in the fourth quarter. As Brad mentioned, we steadily improved our tonnage through the quarter, outpacing typical seasonality.\n\nA key inflection point came in September when we flipped tonnage positive year over year. Our tonnage trends continue to surpass typical seasonality in October. I am pleased that our results are strengthening relative to our peers. Our operating ratio in the quarter was 85%, and our adjusted operating ratio was 82.8%.\n\nThat's a year-over-year improvement of 160 basis points. The full year target we put out with our preliminary third quarter results is for 50 to 100 basis points of adjusted operating ratio improvement year over year. We expect at least 120 basis points of year-over-year improvement in Q4. In the third quarter, we improved yield by 7%, and we continue to see rational industry pricing.\n\nNow, I want to double click on LTL 2.0 and talk about what's driving our results. We focus on two critical areas to drive long-term performance. The first is providing world-class service to our customers, and the second is investing in capacity ahead of demand. Our objectives are to gain market share, optimize pricing, and improve operational efficiency.\n\nIt starts with our investment in capacity. Our LTL capex spend this year will end up at 9% to 10% of revenue, which is about double our historical capex budget. In August, we opened a new terminal in New Jersey to manage volume flowing through the Northeast Corridor. This replaced a smaller terminal and added 24 new doors to our network.\n\nThis expansion, in addition to the other five terminals we have opened over the last year, puts us at 369 doors against our target of 900 net new doors open by year end 2023. On the trailer side, our ability to manufacture our all trailers at scale is unique in the industry. Our trailer production rate is the highest that's ever been. We added a second production line in the first quarter.\n\nAnd we will be adding a third line in the fourth quarter. We are tracking to expand our linehaul trailer fleet by more than 10% by year end 2022. Our goal is to increase trailer production by another 50% next year, which would allow us to further expand with our linehaul and our pickup and delivery fleet. On the tractor side, we are working with the OEMs to bring on more trucks in 2023.\n\nAnd for our drivers, we have expanded our training footprint to what we believe is the largest in the industry, with 130 driver school locations. This is another company-specific advantage, and we expect to train 1,700 drivers this year. In 2023 and for at least the next several years, our plan calls for capex at 8% to 12% of revenue to expand our capacity, so we can say yes to customers more often. The other two goals of the plan, optimizing pricing and improving operational efficiency, are a function of our people and our technology delivering great service.\n\nDamage frequency is one of the metrics customers care most about. In September, we delivered our best damage frequency since 2016 and improved again in October. We improved damage frequency year over year in the third quarter by 58%, and the numbers are up and to the right, with 76% improvement in September and 86% in October. That didn't happen in a vacuum.\n\nWe changed our incentive comp to focus on reducing damages and improving shipping quality, all the way down to the supervisor level. We also launched a program at our terminal called Gladiator to recognize quality loading. If the quality target is exceeded, the entire team at that terminal is rewarded. And we launched new technology in the field that allows us to raise the 30,000 trailers we load each day.\n\nWe can now pinpoint trailers that fall short of our quality loading standards and identify which supervisors and dockworkers need more coaching. These are just some of the internal initiatives that are energizing the team to elevate our customer service metrics. And the impact has been dramatic. Another important investment we are making is in our sales force.\n\nWe are taking a layered approach to sales with teams dedicated to strategic accounts, national accounts, and also the base of 24,000 smaller accounts that are our bread and butter. All three customer segments have a role in growing the business. In the third quarter, we onboarded some major accounts with the potential to become top 10 customers for us. The feedback we hear from these customers is that they are pleased with their onboarding experience and with the service we provide them.\n\nThere is direct correlation between our success in winning this business and the fact that we are willing to invest in capacity and service to back up our promises. This is where our technology comes in as well. I spent a lot of time in the field talking to our managers and also our team members on the frontline. We have equipped them with new tools to make them more successful, and we put in strong feedback loops to capture their inputs.\n\nThe result has been really exciting. At the most recent employee survey we conducted last month, which includes our dockworkers and drivers, we saw the highest engagement and highest job satisfaction since we acquired Con-way in 2015. What we are doing now is building off that culture so that our entire team has the voice and how we get to world class. So, in summary, we are investing in every lever of growth, including network capacity, quality of service, and the satisfaction of our team to deliver that service.\n\nThis is LTL 2.0, and we believe that this plan focused solely on North American LTL can move us to the top of the industry at a pace that outperforms our peers over time. Now, I hand it over to Drew to cover truck brokerage on RXO. Drew?\n\nDrew Wilkerson -- President of North American Transportation\n\nThanks, Mario. I'd like to thank Brad and the entire XPO team. It's been an absolute privilege to work with this top-tier group over the past decade. North American transportation, soon to be RXO, had another strong quarter.\n\nWe continue to harness our massive capacity and cutting-edge technology to grow volume, expand gross profit margin, and drive adoption of our proprietary brokerage platform. I will start by discussing some key metrics from the quarter, and then talk about our strong position heading into tomorrow's launch of RXO. In the third quarter, we delivered more loads than in any other quarter in our history. Our volume was up year over year by 9%.\n\nOur September average loads per day, was also an all-time record, and this was not an anomaly. Over the last three years, we grew volume at a 15% CAGR, and we grew gross profit dollars at a 35% CAGR. Our consistent outperformance proves that we can take share in any market. And importantly, our growth is profitable.\n\nOur gross profit margin was a strong 19%, up year over year by nearly 500 basis points. And our year-over-year gross profit dollars were up 31%. In the third quarter, we generated operating income of $52 million and adjusted EBITDA of $78 million. Our technology is the engine behind our financial outperformance.\n\nOver the last decade, we built this platform from scratch. And now, our strategic investments are continuing to drive adoption among customers and carriers. Another 10,000 carriers have registered on RXO Connect. And our mobile app has been downloaded 850,000 times.\n\nThat's up 53% year over year, and 75% of carriers returned to the platform within one week. Carriers love how easy it is to use our technology, which gives them access to an enormous amount of volume from the largest shippers in the world. They also love our strong carrier rewards program. In the third quarter, we created and covered 81% of truck brokerage loads digitally.\n\nWhile we anticipate a muted peak season, we are still seeing very strong contractual bid activity, and we expect year-over-year load growth in the quarter. In the fourth quarter, we expect to generate adjusted EBITDA as similar to the third quarter, excluding incremental corporate cost as a stand-alone company. With robust data powering our business and a team with deep understanding of the transportation sector, we are poised to outperform regardless of the fluctuating market conditions. The spin-off of RXO marks a new chapter, but some things will remain the same.\n\nFor example, our commitment to rapid growth and strong profitability. We operate in a $750 billion industry, led by a $400 billion for-hire truckload market, with $88 billion in brokerage alone. We are an industry leader, yet we only have about 4% share of this growing and underpenetrated market, which gives us an enormous opportunity for growth. Brokers are taking share from asset-based carriers, and we are leading the charge.\n\nOur customers and carriers are excited about the added value we can provide as a stand-alone company focused solely on our asset-light services. The RXO brand stands for massive capacity and cutting-edge technology, and we have the right people to leverage both advantages. We expect to continue to take share and outperform for our employees, customers, carriers, and our shareholders. That concludes our prepared remarks.\n\nI will now turn it over to the operator for Q&A.\n\nOperator\n\n[Operator instructions] Our first question today comes from Ravi Shanker with Morgan Stanley. Please proceed with your questions.\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nThanks. Good morning, everyone. Mario, a couple of questions for you. The accelerating relative tonnage in LTL kind of you went through some of the kind of service changes you have made that kind of help you with that.\n\nBut do you see that as -- are you taking share from your peers? Or is it more of you being exposed to kind of in a better part of the market and kind of taking more advantage of that?\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nSee, we are driving taking market share overall. So, Ravi, when you look at the investments we have made in capacity first. So, by adding terminals in markets where we were short on capacity, we were able to gain more business from customers in those markets. As an example, we opened up a terminal in Atlanta six months ago.\n\nAnd in the month of September, we have seen tonnage in the Atlanta market go up 38% on a year-on-year basis. We are also investing in more fleet and more drivers as well. And the sales force is very energized with the improvement in both the service product, as well as the investments we are making in our sales force. So, we had record business wins in the second quarter and the third quarter record pipeline.\n\nAnd we are on a very, very strong trend of winning business and winning market share. Now, sequentially, when we are -- Q3 was better than typical seasonality when compared to Q2, and we flipped to positive tonnage in the month of September. And we also continue to see that in the month of October, where we came in better than typical seasonality. And we expect tonnage to be up on a year-on-year basis for the fourth quarter as well.\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nGot it. And maybe as a follow-up to that, kind of can you also unpack the 3Q to 4Q walk, especially on the OR? And maybe any puts and takes that we need to keep in mind as we think about that versus seasonality? Thank you.\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nYeah, sure thing. So, I mentioned tonnage obviously going up, going -- in the fourth quarter. On the yield side, we -- the pricing backdrop remains good, but we expect our yield to be up low- to mid single-digits in the fourth quarter, which is driven in partly by tough comp and lapping the GRI that we won't take till early next year this year. But generally, the momentum is strong on both tonnage and yield from that perspective.\n\nOn the OR side, it's at least 120 basis points of OR improvement in the fourth quarter. And obviously, as we execute through the rest of the quarter here, our goal is to succeed that as well.\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nGreat. And congrats to each one of you for the carriers so far and the carriers to come. So, thanks for all the time over the years.\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nThanks, Ravi.\n\nOperator\n\nOur next question comes from the line of Scott Group with Wolfe Research. Please proceed with your question.\n\nScott Group -- Wolfe Research -- Analyst\n\nHey, thanks. Good morning. I just want to clarify. The fourth quarter OR guidance, I think it's the worst sequential 3Q to 4Q we have seen in the model.\n\nSo, is this just -- is the incremental tonnage coming on at lower yields or margins? And then, any thoughts on what that means for next year's OR? And then, Drew, I just want to clarify. When you said similar EBITDA, I think, for the RXO, when are we going to get the pro forma RXO numbers for Q3? I just want to -- we haven't seen those.\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nScott, I will start first on the LTL side. So, as we said, at least 120 basis points for the fourth quarter. Now, that OR degradation is slightly higher than typical seasonality from the third to the fourth quarter. And that's driven predominantly by cost pressure associated with persistent inflation that -- we expected that to abate more in the back half of the year.\n\nThat's specifically coming from wages is the first category. Generally, our labor is up mid single digits, in part to be able to accommodate the additional demand and tonnage we are getting. And also we are seeing higher inflation in some other cost categories, including maintenance and parts to keep our fleet up to date. And also, some of our facilities expenses are higher due to inflation as well.\n\nDrew Wilkerson -- President of North American Transportation\n\nScott, this is Drew. You will get historicals through June next week. And I believe December 1st is the day for Q3.\n\nScott Group -- Wolfe Research -- Analyst\n\nOK. Yes, if there is any way to get it, the sooner the better, I think, for all of us trying to build models for RXO. Thank you.\n\nDrew Wilkerson -- President of North American Transportation\n\nUnderstood. Thanks, Scott.\n\nOperator\n\nOur next question is from the line of Chris Wetherbee with Citigroup. Please proceed with your question.\n\nChris Wetherbee -- Citi -- Analyst\n\nHey, thanks. Good morning. Maybe I wanted to ask Mario to comment on sort of the strategy in the LTL business. So, growing tonnage in an environment where we are actually seeing maybe decelerating tonnage at some of your competitors, I wanted to get a sense of whether you feel like there are going to ultimately be trade-offs in yield for tonnage in the quarter, over the course of the next couple of quarters, particularly for in a more challenging macro environment.\n\nAnd then, I know you mentioned there is some incremental door capacity coming online, which can help sort of boost that. But how do you think about the competitive environment and maybe how that influences yields in 2023? And maybe sort of just following up on that comment around how you think the operating ratio may sort of trend out as you think about the next several quarters and into '23.\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nSure thing, Chris. So, first, starting with the overall strategy, so our strategy is focused on keeping to improve our service product to our customers and delivering best-in-class service, as well as investing in capacity in areas and markets where we have a need for that capacity based on what we are hearing from our customers and the demand that we are seeing from our customers. And that, in turn, is leading to us gaining market share through investments in the sales force that we are doing and going and gaining new business. This includes, for example, incentivizing our salespeople to onboard new business, including new logos, as we grow the business moving forward.\n\nIn terms of yield dynamic, I mean, obviously, yield has always been a very strong in our industry. This is mainly driven by the fact that, if you look over the long time period, there is less capacity in the LTL than there was 10 years ago. And we continue to see that play out. So, in a softer market, if the market gets softer, we would see yield be in the low single-digit territory.\n\nAnd in a strong market, we'd see that be in the high single-digit, low double-digit territory, and we expect that to play out next year depending on what happens with the macroeconomic conditions. And then, finally, for us, one of the set of company-specific initiatives is around operational cost reduction or overall operational excellence. And that's a combination of using our technology to keep on refining our linehaul pickup and delivery and dock costs, as well as insourcing third-party linehaul to our own assets. Today, third-party linehaul is roughly 10% to 11% of our revenue.\n\nAnd when you think about in-sourcing, we save 30% to 40% per mile. So, we can see that also obviously being a tailwind for us from a cost perspective, not only next year, but over the years to come. For 2023, obviously, we will talk more about 2023 as we report next quarter depending on what we're seeing in the market. But we're modeling for different scenarios depending on what the macro is doing.\n\nChris Wetherbee -- Citi -- Analyst\n\nOK. And just to clarify, so you think tonnage growth is possible with maintenance of yield growth being -- still being positive, so you can keep the two of those positives together?\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nThat's correct, Chris.\n\nChris Wetherbee -- Citi -- Analyst\n\nThank you. Appreciate it.\n\nOperator\n\nThe next question is from the line of Allison Poliniak with Wells Fargo. Please proceed with your question.\n\nAllison Poliniak -- Wells Fargo Securities -- Analyst\n\nHi, good morning. Just wanted to take Chris' question a little further. So, the pricing dynamic and the algorithms that you guys and the analytics that you're pushing forward, how do -- I know you've mentioned low single digit. But do you think that's pricing, you know, above sort of the market at this point? Is that giving you the capability or the better cost management? Just any thoughts there.\n\nAnd then, Drew, any color on how we should think about the contract versus spot/mix as you exit 2022 at this point? Thanks.\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nAllison, I'll start first with the yield question. So, again, for the fourth quarter, we expect yield to be up low to mid single digits, which is in line with the difficult seasonality when you play out Q3 going into Q4. Now, keep in mind that in the fourth quarter of last year, we had a tough comp with yields having been up 11% on a year-on-year basis. We also, last year, if you recall in the month of November, we took an early GRI, which we typically take early in the year as opposed to in the month of November.\n\nSo, we're going to be lapping the GRI. And in terms of new customers versus existing customers, there is a bit of a mix impact, specifically on length of haul that also would be a bit of a drag on yield. But generally, we continue to see a very rational pricing environment. Our contracts in yields, for example, in the first quarter were still up high single digits.\n\nSo, we -- again, we see a rational environment, but this is what the trend looks like as we head into Q4.\n\nDrew Wilkerson -- President of North American Transportation\n\nAnd, Allison, the contract for spot for brokerage was at 73%, again, contract; and 27% on the spot. That's exactly where we wanted to be during this market. It allowed us to operate at strong margins, continuing to take market share and do it profitably. And as we head into next year, we're in a strong bid cycle right now.\n\nBids are up significantly on a year-over-year basis right now.\n\nAllison Poliniak -- Wells Fargo Securities -- Analyst\n\nPerfect. Thanks.\n\nOperator\n\nThe next question is from the line of Tom Wadewitz with UBS. Please proceed with your question.\n\nTom Wadewitz -- UBS -- Analyst\n\nYeah. Good morning. Drew, had a couple for you. I wanted to see if you could just offer some thoughts on how we ought to think about revenue per load when we look at like fourth quarter and gross margin percent.\n\nAre you thinking that it will be kind of stable sequentially? Or do you expect further pressure in the market and some pressure on those metrics? And then, I guess, if I look, you know, beyond fourth quarter, as the truckload market's weaker as contract rates come down, does that drive pressure on your gross margin eventually? I know there is, you know, the transition where it's favorable. But maybe just how you think about gross margin in brokerage out a couple of quarters as well. Thank you.\n\nDrew Wilkerson -- President of North American Transportation\n\nYeah. Thanks, Tom. So, I'd start with we expect to grow volume on a year-over-year basis and in the fourth quarter, and we expect it to operate at strong margins. We were at 19% this quarter.\n\nIt could be a hair behind that as we're into Q4. We've got volume tailwinds. To your point on gross margin per load, you could see that come down. But right now, we're operating in line with our three-year average and ahead of our five-year average.\n\nSo, it doesn't matter what happens in the market. There is a lot of unknowns in 2023. We're confident that we will outperform the market as a whole next year.\n\nTom Wadewitz -- UBS -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThe next question comes from the line of Jordan Alliger with Goldman Sachs. Please proceed with your question.\n\nJordan Alliger -- Goldman Sachs -- Analyst\n\nYeah. Hi, good morning. I'm sort of curious, I know it may be early for 2023 guidance per se, but maybe sort of big picture. Can you talk to a little bit -- two things.\n\nOne, your thoughts on RXO EBITDA, will it be growth next year? And then, secondarily, on LTL operating ratio, you know the long-term targets, but do you expect improvement in 2023? Thanks.\n\nDrew Wilkerson -- President of North American Transportation\n\nYeah. Jordan, as I just said to Tom, there is a lot of unknowns as we head into 2023. We're in a very strong bid cycle right now. Bids are up significantly for us year over year.\n\nCustomers are coming back to us. We're growing with our existing customer base, and we're also growing with new customers coming in. So, I'm confident that we will go out and take market share for 2023, but don't want to go much beyond that.\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nYeah. For the XPO side on the LTL side, I mean, obviously, we will talk more about 2023 as we get closer to the beginning of the year. But generally, we are modeling for different scenarios. In one scenario, if the macro does get softer and that impacts the volumes, obviously, we're not immune to the macro, although we're planning on outperforming in terms of gaining market share.\n\nBut that said, obviously, we would flex our variable costs where, today, 75% of our cost is variable in price to volume. And we also have a few potential tailwinds from a P&L perspective, which includes insourcing our third-party linehaul miles after. And the fact that we have higher exposure to purchase transportation, that would be a good guy in a softer environment with truckload rates coming down. That's kind of how we look at the year overall.\n\nBut obviously, our intent is to continue to gain market share, but we're modeling for different scenarios.\n\nJordan Alliger -- Goldman Sachs -- Analyst\n\nOK. Thanks.\n\nOperator\n\nThank you. Our next question is from the line of Ken Hoexter with Bank of America. Please proceed with your question.\n\nKen Hoexter -- Bank of America Merrill Lynch -- Analyst\n\nHey, great. Good morning. And good luck with the spin process. Maybe, Mario, if we could just kind of follow-up on that last kind of debate and Scott's earlier questions about the OR.\n\nYou know, you're talking about inflationary costs rising. You're pushing out your GRI, which you had last year in November to the beginning of the year. You're talking about the worst OR improvement in the fourth quarter, I guess, on a sequential basis, you mentioned. Is there anything you can do, given the environment to move some of those costs quicker? Is there potential that you benefit, as you mentioned, on purchased transportation maybe faster, given those rates are coming down? I'm just trying to wonder what you can do, self-help maybe even faster, given the environment and the exposure you just talked about on those few items.\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nThe purchase transportation is definitely one of those areas, Ken. Because when you look at purchase transportation, today, contractual rates are still up on a year-on-year basis, although they obviously moderated significantly from where they were earlier in the year. In a continued soft market, we would see the contractual rates continue to come down, which obviously would be a tailwind for us from a PT perspective. Similarly, for insourcing third-party linehaul miles, we're cutting schedules.\n\nSo, if the volume is more challenged going to 2023, then, obviously, that's an area we can move on faster with cutting schedules as well. And we are also accelerating some of our rollouts on the technology side in terms of how we run our docks, our pickup-and-delivery operation, and our linehaul operation to improve operational efficiencies in those areas as well. That will help becoming tailwinds in 2023 if there is a softer environment from a tonnage standpoint.\n\nKen Hoexter -- Bank of America Merrill Lynch -- Analyst\n\nAnd I guess just my follow-up would then be on the -- will you adjust the timing of the rollout in capex on the doors? And maybe you could talk a bit about -- each of you, the corporate costs. What scale should we target for each of the groups going, you know, forward into the fourth quarter and next year?\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nYes. I'll start with the capital deployments. So, we are not planning on slowing down our capital deployments. We think about the capital we invest in the business as being a long-term investment that goes through the cycle.\n\nSo, it doesn't matter what the markets are doing on the short-term. These will give us capacity whenever the markets go back up again, being able to handle that capacity. This includes on-the-door side, a lot of the projects we've done so far. We've opened up six terminals.\n\nAnd we are predominantly opening up a new terminal versus a lot of the projects that we're going through now are expansion projects for existing terminals. So, we have a half a dozen or so projects that are already underway in the Dallas market, Houston, Salt Lake, Atlanta, and a few other markets as well where we are expanding the terminal base. In terms of fleet, we do need, obviously, the fleet for two reasons. One, as we insource third-party linehaul, we're going to deploy some of that capex for both trucks and trailers to be able to move some of these miles onto our own assets, as well as position the fleet where we can bring the fleet age down, which would help with maintenance expenses as well.\n\nSo, we continue to expect to deploy that capex through the cycle here as we head into 2023.\n\nDrew Wilkerson -- President of North American Transportation\n\nAnd then, Ken, you asked about the incremental cost that will come over to RXO. It's around $45 million on an annual basis that will be incremental to us of corporate costs.\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nAnd for the XPO, it would be roughly the unallocated corporate cost for LTL or roughly around 80 million.\n\nKen Hoexter -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThe next question comes from the line of Jon Chappell with Evercore ISI. Please proceed with your question.\n\nJon Chappell -- Evercore ISI -- Analyst\n\nThank you. Good morning. Mario, simple one for me. You're talking about the positive trends in tonnage.\n\nI was hoping you could break that down for us. Where were you in July on a year-over-year basis? Where were you in September, if that was the inflection point in term positive? It is October 31st. So, I understand you have a day left. But maybe give us a sense to where October is as well.\n\nJust as you talk about doing better than the peers in the positive direction, help us put a magnitude on that.\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nYeah. You got it. When you look at the third quarter, so we've improved every month in the quarter and then flipping positive in the month of September. And the quarter as a whole and the monthly trend was better than typical seasonality in terms of sequential volume improvements.\n\nAnd that continued in the month of October, where we're seeing strong volume trends as well that both outpaced typical seasonality and with positive tonnage for the full month as well.\n\nJon Chappell -- Evercore ISI -- Analyst\n\nI understand that. Is there any way you can give a number? Was July down four? August was down one, and September was up two, and October is up three? I mean, if there is any quantitative way to kind of manage, you know, that positive direction.\n\nMatt Fassler -- Chief Strategy Officer\n\nJohn, it's Matt. July was the softest month in the quarter. August, obviously better than that, closer to the quarterly average. September, obviously much, much better.\n\nAnd October, to your point, one day left. It was a good month for us. And, again, outpaced typical seasonality for the quarter, for the month of September, and for the month of October as well.\n\nJon Chappell -- Evercore ISI -- Analyst\n\nOK. Thanks, Matt. Thanks, Mario.\n\nMatt Fassler -- Chief Strategy Officer\n\nYou got it.\n\nOperator\n\nThe next question comes from the line of Brandon Oglenski with Barclays. Please proceed with your question.\n\nBrandon Oglenski -- Barclays -- Analyst\n\nHey, good morning, everyone. And thanks for taking my question. So, Drew, just a couple of points for you. I think you mentioned that you're going through a bid cycle right now.\n\nPricing is actually coming in positive. Was that a comment on contract rates? And should we be thinking that double-digit volume is attainable here in the near term, like 4Q and looking into next year?\n\nDrew Wilkerson -- President of North American Transportation\n\nYeah. Brandon, I don't think that I said that pricing on contract was positive in the bid cycle. You know, pricing is slightly down of what we're seeing on contract. Spot is down more than that.\n\nAnd on double-digit volume growth, you know, going forward, we expect that we can do that over the long run, but don't look for it on a quarter-by-quarter basis for where we're at. We're confident that there is a -- we will outperform the market in 2023 and beyond. And we're confident in the five-year guide that we've put out there that has a midpoint of $500 million of EBITDA, roughly 70% growth from where we are today.\n\nBrandon Oglenski -- Barclays -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question is from the line of Scott Schneeberger with Oppenheimer. Please proceed with your question.\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nThanks. Good morning. Mario, could you touch upon -- I think you mentioned three new -- and clarify if that's accurate or not, new customers in the third quarter that could become top 10 customers. Could you just touch upon how that may be impacting metrics for the next few quarters? And any additional commentary on developments in the sales force and strategy there with regard to our customers? Thanks.\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nYeah. On the -- on large customers we onboarded -- so, we onboarded several large customers in the third quarter that has the potential to become top 10 customers. And it's a combination of both industrial, the large industrials, as well as the large retail as well that we onboarded through the quarter. Now, what we're doing differently from a sales perspective, one is that we expanded our sales force since the beginning of the year.\n\nWe have roughly around 7% more salespeople in our sales force. We also established a new strategic account selling team, which is focused on the largest 200 to 250 strategic accounts across North America, where we split that team between RXO and XPO at the beginning of the year, where these strategic centers are now -- a portion of the strategic centers are focused on our LTL business. And that's paying dividends. In the second quarter, we had record business wins.\n\nIn the third quarter, we had another quarter of record business wins. Our pipeline is the highest it's been, and we're trending in the right direction. We've also incentivized our salespeople to get new logos and expand business with existing logos, and that's also paying dividends as well. And when we pass forward to the years to come with our investments in capacity where we are getting capacity ahead of demand, as well as the focus on keep on improving service significantly over time as well.\n\nAll of these would lead to more wins as we head over the years to come in our five-year plan.\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nGreat, thanks. And for a follow-up, just Brad or someone, if you can provide an update on how the European business is performing trend you're seeing in the macro and how that's holding up. Thanks.\n\nRavi Tulsyan -- Chief Financial Officer\n\nHi. This is Ravi here. So, our European business, you know, it continues to perform very well. Last quarter, we had a very strong organic revenue growth of 6.8%, which was driven by both volume and price.\n\nFor the full year, our business is performing exactly in line with our expectation. And the macros are definitely getting tough. But we continue to outperform the macro and are able to price in the inflation.\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nGreat. Thanks, Ravi. Thanks, everyone.\n\nRavi Tulsyan -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThe next question is from the line of Brian Ossenbeck with JPMorgan. Please proceed with your question.\n\nBrian Ossenbeck -- JPMorgan Chase and Company -- Analyst\n\nHey, good morning. I want to come back to Drew first. You can maybe clarify the comment about the strongest -- strong bid cycle. Was that more on a volume perspective? Because it does sound like it --\n\nDrew Wilkerson -- President of North American Transportation\n\nThat's the volume number of bids that we're seeing, Brian. So, the number of bids that we are participating is up significantly. That's existing customers, but it's also new customers who are coming to us for the first time as well.\n\nBrian Ossenbeck -- JPMorgan Chase and Company -- Analyst\n\nOK. Got it. And I'd love to hear your thoughts on just where you think the floor isn't coming for spot rates as well. But a second one for Mario.\n\nThere is some concern about the market share wins, the divergence in trends from a tonnage perspective, and just the level of competition in LTL. So, maybe you can put some context around that. How much of a different service has mattered? And what are the clean trends trending toward for the quarter? Where are the year over year? And, perhaps, where do you want them to be? Is that a significant driver of some of these wins you're getting? Because I think what we're hearing is there is more concern about this competition and how that would affect yields in the industry that's typically been, you know, known for having good pricing power discipline.\n\nDrew Wilkerson -- President of North American Transportation\n\nBrian, I'll kick it off with your question on the spot and then turn it over to Mario. As far as calling the floor on spots, we're not going to call the floor on spot rates, just like we didn't call the peak on spot rates over the last couple of years. I will tell you that our data is showing us, over the last few weeks, that rates have leveled off.\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nYes. And, Brian, on your question on the service. So, definitely service has been a great trend for us with dramatic improvement over the course of the last year. I mean, I mentioned in my opening remarks our damage frequency, which is a measure of when we deliver skids to our customer, what's the -- how many of them are effectively damaged.\n\nAnd it's the best it's been since 2016, where, for the full quarter, it improved by 58%. For the month of October, it improved by 76% -- September, 76%, and October by 86% on a year-on-year basis. And we've implemented many programs to delight our customers in how we service them. And we're hearing that feedback from the customers, which helps with, obviously, onboarding more business.\n\nOur customer satisfaction, we do weekly surveys with our customers. It's at record highs in the third quarter. And that's going to allow us to onboard more and more customers over time. In terms of gaining market share, a lot of that goes back to, obviously, the improvement in service but, at the same time, the investments in capacity, where we're being able to say yes more often to customers in markets where we are adding that additional capacity as well.\n\nOn the yield side, yield continues to be rational when I look at our contracts renewals even through what is a softer macro. We're continuing to see strong contract renewals associated with that. And, you know, again, in the softer macro, you would see yield come down a bit, but you would still see the positive territory. And then, obviously, in a strong macro, you would see yield be in that high single-digit territory.\n\nSo, we continue to expect rational pricing in our industry over the years to come.\n\nBrian Ossenbeck -- JPMorgan Chase and Company -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Jason Seidl with Cowen. Please proceed with your question.\n\nJason Seidl -- Cowen and Company -- Analyst\n\nThanks, operator. Thank you, gentlemen, for taking my question. Mario, I wanted to stick on yields a bit. Would you say that the yields for the recent contract wins in 3Q were above your cost inflation? And then, what's the level of confidence getting yield above cost inflation in this bigger-than-average bid season that you've been talking about?\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nYeah. We are seeing -- going into the fourth quarter, when we think about cost inflation, remains persistent higher than what we expected it to be, which is putting pressure on the overall margins, which is what we discussed earlier. However, for the new wins, obviously, yield is also a factor of mix as well. So, some of the new wins -- and it's a combination, all of them are obviously profitable above cost and all of them operate really well.\n\nBut at the same time, they could have some mix change associated with them depending on the customers. But generally, it's in the ballpark of where our overall mix is. We're seeing some pressure on length of haul, where some of these shipments are shorter in nature with some of these wins. But that's about the only dynamic that we're seeing is different than our existing mix.\n\nBut yields are up sequentially going from Q3 to Q4, and they are in line with typical seasonality as well.\n\nJason Seidl -- Cowen and Company -- Analyst\n\nOK. That's great color. A follow-up here for Doug. Doug, you know, there are some questions about the overall market.\n\nAnd spot, I know you answered some of that. But can you talk a little bit about your carrier base and what you're seeing in terms of attrition? Has it been higher than normal over the last quarter?\n\nDrew Wilkerson -- President of North American Transportation\n\nYes. Thanks. This is Drew. When you look at what we're seeing on the overall from our carriers, we grew our carrier count at RXO Connect by 10,000 carriers for the quarter.\n\nSo, we're continuing to see carriers who want to come back and do business with us. It's easy to hop on to our platform and book a load, negotiate, do that with no human interaction. There is a great rewards program that they have got access to. And you can see that our registered carriers in RXO Connect year over year are up 48%.\n\nOur weekly carrier usage is up 60%. And Drive RXO has been downloaded 850,000 times. So, there is a lot of momentum for carriers to continue to come over and do business with RXO. We have got the volume they need and an operating system that they love to use.\n\nJason Seidl -- Cowen and Company -- Analyst\n\nAppreciate it, gentlemen.\n\nOperator\n\nOur next question comes from the line of Jeff Kauffman with Vertical Research. Please proceed with your question.\n\nJeff Kauffman -- Vertical Research Partners -- Analyst\n\nThank you very much. Question for Mario. Mario, the fleet age on the LTL side is kind of bumped up from about 5.1 years to 5.9. So, almost a full year higher than it was two years ago.\n\nWith this capex spend that you're going to have, when do you expect that fleet age to get back down toward five? Where do you want that fleet age to be in? And can you quantify some of the savings, whether it's maintenance costs, whether it's fuel efficiency, that you might generate from some of this capex spend over the next couple of years?\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nYeah, you got it, Jeff. So, first, on the fleet age side, typically, in LTL, we want to be between four to six years of age on our fleet. Obviously, usually, the younger the truck, we put them on our linehaul network to gain the benefit of fuel efficiency associated with that. And the older it gets, we put it in the city.\n\nNow the fleet age, with COVID, due to the constraints that we have seen with the OEMs, have caused the fleet age to go up with less -- with getting less trucks effectively. Now going -- this year, we're going to get slightly less trucks than where we expected to be. But generally, it's trending in the right direction. Now, for 2023, we do want to add a significantly higher number of trucks.\n\nAnd we're working with the OEMs to get our allocations locked in for 2023 and see where we get there. Now, there is -- that is a OEM or still capacity constraints, but obviously, the softness in the truckload market could be a potential tailwind as we head into 2023. Now, for us, remember, capex for this year is going to be nearly doubled what it has been historically. And for next year, we expect that to even go slightly higher than where we are this year.\n\nAnd in terms of the benefits we get from a younger fleet age, as you said, maintenance is a component of that. I mean you can estimate anywhere between low double digit up to 20%, 25% reduction in maintenance costs as we pull back the fleet age where we want it to be. And similarly, on the fuel MPG, that is the benefit you get from the younger trucks as well. So, we're -- again, we're working every lever for 2023 to get more trucks and pull that aged fleet back for the full year.\n\nJeff Kauffman -- Vertical Research Partners -- Analyst\n\nSo, just to follow up on the answer, is the goal to get the fleet age back toward five? And how long do you think that would take?\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nIt will -- and so, that's the goal, to even potentially get it sub-five as well. But it will depend on what the OEMs do for next year in 2023. Now, we see, again, the availability of truck easing as we head into 2024. I personally meet with all of the heads of the OEMs, including with my team as well.\n\nAnd what we're hearing from them is that they are seeing signs that 2023 could improve. But at the same time, we won't know until we get closer to the beginning of the year. And then, we will go from there to assess how many trucks we can get in 2023. But that would be the case.\n\nBut we see it easing up further in 2024 to be able to get more of these trucks and then pull the fleet age back.\n\nJeff Kauffman -- Vertical Research Partners -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our last question comes from Todd Fowler with KeyBanc. Please proceed with your question.\n\nTodd Fowler -- KeyBanc Capital Markets -- Analyst\n\nHey, great. Thanks, and good morning. So, Mario, I'm not sure if you, you know, have any information that shows with the improvement in the service metrics. Is your sense that your pricing -- your core pricing is maybe below that of peers? And so, do you have an opportunity to move yields up maybe stronger than where the industry is going forward? Or do you think you're relatively kind of in line with where the industry is? And then, secondly, I think you addressed this a little bit, but weight per shipment came down in the quarter.\n\nThat probably had some positive impact on yields. It sounds like that that's something maybe with some of the mix changes that we should expect going forward?\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nYes. So, first, I'll address the second half of the question, then come back to the first one. So, when we look at the third quarter, there were two dynamics. So, weight per shipment held a bit in terms of the weight per shipment coming down, impacting yield positively.\n\nHowever, length of haul also went down. It's predominantly a mix change where, last year, we saw more shipments outbound California, for example. And these are typically longer length of haul type shipments that impacted our length of haul coming down, which has a direct correlation to yield as well. So, on a net-net basis, that was a slight drag on yield as opposed to a benefit for yield.\n\nGoing back to your question on our price versus peers, our price is competitive versus some peers. And it's behind other peers. And we do believe that, with the continuous improvements are in service and getting -- our goal is to be best in class when it comes to our service metrics. And that would help with us accelerating our yield improvement as well.\n\nTodd Fowler -- KeyBanc Capital Markets -- Analyst\n\nOK. Thanks for the time. Congratulations, Drew. Congratulations, Mario.\n\nDrew Wilkerson -- President of North American Transportation\n\nThank you.\n\nOperator\n\nThank you. We have reached the end of our question-and-answer session. I'll hand the floor back to management for closing remarks.\n\nBrad Jacobs -- Chairman and Chief Executive Officer\n\nThank you, operator. So, it's been an amazing journey. It's been an amazing decade. I feel lucky.\n\nI feel privileged and very gratified. I want to thank the shareholders, particularly those who have bought the shares when it was a fraction of where it is now and stuck with it and held onto it and made a lot of money. And thank you very much for your support. And I also want to thank the hundreds of thousands of team members who created -- well, now, as of tomorrow, will be three great companies.\n\nAnd I want to especially thank Mario and Drew for your commitment to bring the companies to a new level and achieve even greater heights than we've accomplished over the last decade and to prove our supporters right and our detractors wrong. Thanks, everyone. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrad Jacobs -- Chairman and Chief Executive Officer\n\nRavi Tulsyan -- Chief Financial Officer\n\nMario Harik -- Chief Investments Officer and President of LTL\n\nDrew Wilkerson -- President of North American Transportation\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nScott Group -- Wolfe Research -- Analyst\n\nChris Wetherbee -- Citi -- Analyst\n\nAllison Poliniak -- Wells Fargo Securities -- Analyst\n\nTom Wadewitz -- UBS -- Analyst\n\nJordan Alliger -- Goldman Sachs -- Analyst\n\nKen Hoexter -- Bank of America Merrill Lynch -- Analyst\n\nJon Chappell -- Evercore ISI -- Analyst\n\nMatt Fassler -- Chief Strategy Officer\n\nBrandon Oglenski -- Barclays -- Analyst\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nBrian Ossenbeck -- JPMorgan Chase and Company -- Analyst\n\nJason Seidl -- Cowen and Company -- Analyst\n\nJeff Kauffman -- Vertical Research Partners -- Analyst\n\nTodd Fowler -- KeyBanc Capital Markets -- Analyst\n\nMore XPO analysis\n\nAll earnings call transcripts"
}