{
  "companyName": "General Electric",
  "companyTicker": "GE",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/general-electric-ge-q3-2022-earnings-call-transcri/",
  "content": "General Electric (GE 0.05%)\nQ3 2022 Earnings Call\nOct 25, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, ladies and gentlemen. And welcome to the General Electric third quarter 2022 earnings conference call. [Operator instructions] I would now like to turn the program over to your host for today's conference, Steve Winoker, vice president of investor relations. Please proceed.\n\nSteve Winoker -- Vice President, Investor Relations\n\nThanks, Denise. And welcome to GE's third quarter 2022 earnings call. I am joined, as usual, by chairman and CEO, Larry Culp; and CFO, Carolina Dybeck Happe. GE Healthcare CEO, Pete Arduini, is also here with us to share insights on pre-spin progress and performance.\n\nKeep in mind that some of the statements we're making are forward-looking and based on our best view of the world and our businesses as we see them today. As described in our SEC filings and on our website, those elements may change as the world changes. And with that, I'll hand the call over to Larry.\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nSteve, thank you. And good morning, everyone. We're building broad-based momentum, and GE delivered solid third quarter results with aerospace leading the way. Within GE Vernova, power remains on track to grow this year, and we took significant actions this quarter to reset renewable energy for future profitability.\n\nAnd external catalysts, like the recent U.S. climate legislation and the European energy crisis, are increasing investment in new decarbonization technologies, helping position this business for longer-term profitable growth. Our plan spins are on track, with GE Healthcare ready to launch in January and GE Vernova in early 2024. GE Healthcare is in the homestretch now.\n\nI'm particularly proud of what they've accomplished, navigating COVID, bringing in a new CEO and CFO, and now preparing to operate as an independent global leader in precision health. Pete Arduini is with us today to give you a full update. Now, a moment on GE Aerospace. I'm really excited to be leading this exceptional franchise, especially during this unprecedented industry ramp.\n\nWe have a tremendously talented team, a highly differentiated product and technology portfolio in leading positions in attractive commercial and military sectors. And we have leaders that nicely balance unparalleled experience and fresh perspective and is nearly half or new to their roles in the last year. Our high-caliber team includes Russell Stokes leading our commercial engine business; Amy Gowder, who runs our military business; and Rahul Ghai, who recently joined as CFO. In that same vein, I'd like to recognize Shane Wright, who's retiring after 34 years of service.\n\nHis many contributions across GE and GE Aerospace have been invaluable and help build a world-class business and team. Shane, thank you. The opportunity and the imperative to embrace Lean more deeply, both within our four walls and with our partners, suppliers, and customers, has really stood out to me over the last several months. We've been taking a harder look at our operating rhythms, moving toward a more frequent weekly and monthly cadence for each of our P&Ls.\n\nThis has helped us manage the business in real time and deliver, better, faster, and more efficiently in what is clearly a dynamic environment. The process capability improvements are real. Taking last quarter's example, the additional 20% of existing engineers that we reprioritized to support delivery. Through daily management, they're helping solve problems closer to the point of impact faster, and that's improving engine deliveries.\n\nEngine output was up double digits sequentially with LEAP units up over 50% sequentially. A credit to the entire team, especially those in our supply chain organization. However, the post-pandemic recovery requires continued sequential improvements for the foreseeable future, which are Lean efforts will help us deliver. We have a similar story in services, where internal shop visits grew 10% sequentially and more than 30% year over year.\n\nLean helps us reduce cycle time, improve turnaround time, and generate capacity for more. In addition to strengthening our operating rhythms to meet this extraordinary industry demand, we updated our strategic plan last month with an eye toward how we continue to shape the future of flight for years to come. The quality of our technology and product roads, coupled with the energy and collaboration in the room, have me even more excited about what this business will become when it's a stand-alone aerospace leader. First things first, of course, with respect to the post-COVID ramp, but this is a business with an exceptional future.\n\nTurning to total company results on Slide 3. Orders declined 7%, driven by tough composite renewables against prior year megadeals in our offshore wind. Excluding renewables, orders were up 8% and positive across all segments. Revenue was up 7% with particular strength in services, up 20.\n\nLooking at the segments, aerospace and healthcare were both up double digits as the market recovery continued, and our pricing and delivery actions took hold. This was offset by power, down mid-single digits; and renewables down 10%, largely due to lower U.S. volumes resulting from the PTC lapse and our heightened new business selectivity. Collectively, supply chain and macro pressures adversely affected revenue by about 4 percentage points in the quarter, easing slightly again.\n\nAdjusted operating margin declined 190 basis points. Strength at aerospace volume and price was more than offset by renewables, which included about $500 million of higher warranty and related reserves tied to fleet performance, which we will address shortly. Excluding this impact, margin expanded by 80 basis points. Healthcare improved sequentially, and power declined year over year due largely to planned service outage seasonality.\n\nAdjusted EPS was down. Excluding the $0.40 renewables reserve, EPS was $0.75. Free cash flow was $1.2 billion, largely driven by strong adjusted earnings. We've continue to build inventory as we prepare for the fourth quarter ramp and continue to work through ongoing supply chain challenges.\n\nAll in all, I'm pleased with how the GE team has continued to navigate a tough operating environment. And for the year, we're maintaining our prior outlook for revenue, trending toward the low end of our high single-digit growth range. We now expect 125 to 150 basis points of operating margin expansion and $2.40 to $2.80 for EPS. This is primarily driven by the higher warranty and related reserves that renewables this quarter.\n\nAnd aligned with the color we shared in the second quarter, we're expecting free cash flow this year of about $4.5 billion. Turning to GE Vernova, power is a stable cash generator. As gas utilization rose, our ongoing focus on services at steam take route with continued turnaround progress at power conversion and innovation at nuclear. Now, more on renewables, where we've all been disappointed with our year-to-date performance.\n\nOur proven leadership with Scott Strazik and his team at the helm is leveraging the lessons from their power playbook to transform renewables fundamentals. Let me break down on how we're going to improve performance there. Recall, we look at this in three parts: onshore wind, offshore wind, and grid. I'll take those in reverse order.\n\nGrid is a $3 billion business, which will be the first to profitability. Market demand and automation in hardware remains strong this year. We expect double-digit orders growth and, thanks to our cost efforts, significant margin expansion, along with profitability here in the fourth quarter, setting up 2023 as a profitable year for grid. At Offshore, we're transitioning from a new product investment into a business with roughly $1 billion of revenue and growing.\n\nThe roughly 80 turbines we installed in commission for EDF recently were on schedule. We're now shifting to the 7-gigawatt Haliade-X backlog, knowing our initial 200 deliveries will be challenging financially in an inflationary environment. But as we move to the next tranche of projects and reduce cost, we expect to approach profitability in Offshore in the mid-20s. Finally, onshore is a $9 billion revenue business, more than 60% of the segment today and most of the operating loss.\n\nThis is the battleground. Overall for renewables, we expect to achieve profitability in 2024. We quickly innovated in the fast-growing onshore wind industry, introducing larger turbines to provide leading performance and competitive project economics for customers. Since 2017, we've added over 40 gigawatts to the grid, increasing megawatt hours per turbine significantly.\n\nHowever, like much of the industry, such rapid innovation strains manufacturing and the broader supply chain. It takes time to stabilize production and quality on these new products, which, in turn, pressures fleet availability. We need to industrialize faster to counteract these dynamics, and we are. First, we're drastically simplifying and standardizing too many variants into what we call workhorse products, so we and our suppliers can implement more repeatable manufacturing processes.\n\nThis enhances product quality and reduces cost. In our existing fleet, deploying corrective measures, enhancements, and monitor repair programs to deliver high 90s availability consistently. We expect to implement the corrective measures associated with these warranty and related reserves over the next couple of years. With fleet availability, our true north will continue to be a leader and deliver for our customers.\n\nSecond, as we've talked about in the past, we're being more selective about where we play, going after fewer markets where we have the right product and service capabilities, and can execute profitably, including focusing more on equipment-only projects. We're also seeing improvement in both orders and sales pricing. Third, we're reducing fixed costs. We're decreasing global headcount in onshore wind by about 20% and, more broadly, delayering at renewable energy.\n\nAcross GE Vernova, we're expecting about $500 million of annualized savings from a $600 million restructuring program we plan to implement over the next few years. Reflecting on the broader market, when we spoke just 90 days ago, the prospect of significant U.S. climate legislation this year was unlikely. Recent months have been game changing.\n\nThe Inflation Reduction Act provides much needed certainty and stability for us and our customers, especially in onshore wind. The bill's $370 billion in tax credits over the next decade align tightly with GE's decarbonization technologies. Additionally, the Infrastructure and Investment Jobs Act provides at least $75 billion for investment in grid, nuclear, and breakthrough technologies. In Europe, we're seeing more urgency and pragmatism to reduce emissions and make energy more resilient.\n\nTake the new European taxonomy, which reinforces the important role of gas and nuclear, alongside renewables. As Europe looks to swiftly address energy security concerns, customers want to engage GE's full technology roadmap, including wind, gas fuel plants, and grid. While these external catalysts won't factor into our results overnight, they improve the demand and economic profile for our businesses remarkably. To that end, we see a robust future in contrast to the current orders trough.\n\nAltogether, we're at a significant inflection point for onshore and renewables overall. While we expect renewables to achieve profitability in 2024, about a year later than planned previously, we remain very excited about GE Vernova's future. With that, let me hand it over to Carolina.\n\nCarolina Happe -- Chief Financial Officer\n\nThanks, Larry. Turning to Slide 5, I'll share the insights from the quarter on an organic basis. When orders were down 7%, revenue was up high single digits, with double-digit growth in aerospace and healthcare. Equipment declined 6% with continued U.S.\n\nonshore volume pressure and a largely planned decrease at power. On a sequential basis, revenue increased more than 0.5 billion as we're making progress on our second-half ramp. Services was a bright spot, with orders and revenue up double digits and growth across all segments. Aerospace led the way with orders up 28% and revenue up 33%, as market demand remained strong.\n\nRecall services represent half of our revenue and an even larger percentage of our backlog. Overall adjusted margin contracted 190 basis points. This was largely driven by the renewables reserves, which impacted margin by 270 basis points, meaning if we exclude this, margin would have expanded 80 basis points. Our actions are taking hold, and we are seeing early signs of supply chain easing.\n\nVolume together with price contributed almost 300 basis points of margin expansion, offsetting headwinds from inflation and logistics costs. Aerospace was a major contributor, up 280 basis points with strength in services. Adjusted EPS was down $0.18. Excluding the renewables reserves, it would have been up $0.22.\n\nContinuing EPS was negative, primarily driven by an insurance transaction which I'll cover momentarily and increased separation costs as expected. Regarding our update to the margin and EPS outlook, we are now including additional pressure from the elevated warranty and related reserves at renewables. About half of this charge is incremental to our prior view. We also expect to offset healthcare pressure, largely due to inflation and investments with strength in the other businesses.\n\nMoving to cash. We generated free cash flow of 1.2 billion. Strong adjusted earnings contributed to this. Working capital again had a very limited impact on free cash flow despite high single digit growth this quarter.\n\nLooking at the dynamics, first, receivable, the use of cash. Our teams were focused on collecting the accounts receivable from second quarter, improving year-over-year DSO by two days. But deliveries continued to occur later in the quarter, resulting in high quarter-end receivable balance. Inventory was also a use of cash.\n\nThis is typical as we build for significant fourth quarter volume, leading to inventory and accounts payable growth. Progress was a source, mainly due to the timing of down payments. Contract assets was also a source. Continued strength in aerospace and gas power utilization drove billings.\n\nAD&A was positive 300 million. Given the year-to-date impact and our fourth quarter estimate aligned with the current airframe or aircraft delivery schedules, we now expect AD&A flow to be about zero. Year to date, free cash flow is approximately 500 million. In the fourth quarter, we expect higher collections, given the large receivables balance and reduced inventory due to the strong quarterly deliveries.\n\nSo, in line with typical seasonality and our operational efforts, fourth quarter cash flow will be significantly higher. And we expect free cash flow of about 4.5 billion for the year. This is aligned with the color we shared last quarter. Now, a moment on corporate.\n\nAdjusted costs were down over 50% year over year. This was primarily driven by lower EHS and other costs and progress in functions and operations. For the year, we expect corporate costs of less than 700 million, which includes a few hundred million of variability, primarily from interest rates and FX dynamics. As we prepare for the planned spin of GE Healthcare, we're looking at our corporate costs to ensure what remains is sized appropriately.\n\nTherefore, we plan to take restructuring actions to reflect today's reduced feed for corporate-led activity and footprint. The program is expected to deliver roughly 450 million in annualized cost out over the next few years. That's about 700 million of expense, the majority in the fourth quarter. As usual, we further derisked our portfolio by terminating several reinsurance contracts.\n\nThis reduces counterparty risk and improves administration, settling our receivable from the reinsurer in exchange for 2.5 billion of assets that we can deploy in our current divestment strategy. Given the assets' need to be transferred at fair market value and the current rate environment, this was an after-tax charge of roughly 300 million. We expect to recoup this over time as the assets mature. While excluded from our adjusted results, insurance net income was roughly 250 million loss and, without the charge, was approximately positive 80 million.\n\nThis quarter, we also completed our annual LRT. As expected, this resulted in a positive margin with no impact to earnings, at least for the third consecutive year. In discontinued operations, we recorded charges of about 100 million in our run-off Polish BPH mortgage portfolio, primarily driven by unfavorable results for banks in ongoing litigation with borrowers. This brings total litigation reserves related to this matter to approximately 1.1 billion.\n\nNow, turning to our businesses. Aerospace. Aerospace delivered a very strong quarter. Orders growth of 6% was driven by services, while equipment orders were down against a tough comp, especially in military.\n\nRevenue was up 25%, led by substantial growth in commercial services, up 47%. This was driven by internal shop visit growth, strong spare parts sales through our external MRO, and favorable price. Commercial engine revenue also grew significantly on higher shipments, both year over year and sequentially. Lead shipments improved, up over 100 units sequentially, and we're starting to see better flow through our factories.\n\nMilitary revenue was down year over year, driven by lower shipments and engine mix. However, tangible improvements on T700s helped drive a sequential increase in engine units. Segment margin expanded 280 basis points, driven by commercial services growth and favorable price costs. This more than offset negative mix from higher commercial engine shipments and increased growth investments.\n\nBased on strong year-to-date performance and continued improvement in services, we expect full year aerospace margins to be heightened with greater than 20% top-line growth. Overall, aerospace's strong market growth and business fundamentals reinforced a significant long-term opportunity here. Turning to renewable, orders were down 40%. Recall, we had record orders last year due to offshore, where the project-driven profile remains uneven, making this a difficult comparison.\n\nImportantly, services, excluding real power, grew double digits, and all grid product lines grew. Revenue declined 10%. Over 2/3 was driven by lower U.S. volume and onshore from the PTC lapse and our heightened new business selectivity.\n\nThis more than offset services growth of 40% and better pricing across many businesses. Segment margin declined significantly year over year, primarily driven by the warranty and related reserves at onshore. The remainder of the decline was driven by lower U.S. volume at onshore and net inflation pressure in all businesses.\n\nExcluding onshore, though, all businesses improved reported profitability year over year. When we previously included about half of this elevated reserve in our full year expectations, the incremental impact this quarter is pressured versus our prior view. We now expect an annual loss of about 2 billion. The irony is a significant catalyst, medium to long term.\n\nHowever, near term, customers continue to defer investments into the future, impacting orders and associated cash. While 2022 have been disappointing, the actions we're taking, combined with the external catalysts we've discussed, puts us on a much stronger footing as we head into 2023. Moving to power. As expected, we're managing through a lower CSA outage year, typical third quarter seasonality, and second half timing dynamics for some equipment deliveries and CSA outages pushed to the fourth quarter.\n\nLooking at the market. Global gas generation and GE utilization grew mid single digits year to date, with strength in Europe and in the U.S. While we continue to monitor gas prices and availability, gas remains a fuel of choice on dispatch curves globally to meet growing electricity demand. In the third quarter, orders were up 20%.\n\nThis was driven by HA and aeroderivative units at gas and services growth in all businesses. Importantly, our team continues to prioritize disciplined underwriting and project selectivity as we build our installed base pipeline. And as we've said, equipment orders remained uneven quarter to quarter. Revenue declined 5%, primarily driven by gas equipment at steam, where we continue to exit our new build coal business.\n\nWe shipped two fewer HAs and two fewer aero units year over year. Meanwhile, services grew 6%, driven by gas, by price, and transactional services growth offset the lower expected CSA outage volume. Segment margin declined 100 basis points. This was mainly due to lower CSA outages and unfavorable equipment mix at gas.\n\nTogether, more than offsetting the price escalation. At steam, margins continued to improve, driven by selectivity and the associated cost out. Looking at the fourth quarter, we continue to expect significant sequential and year-over-year growth in equipment and services. This sets power up to deliver its outlook of low single-digit revenue growth and margin expansion.\n\nAnd power remains on track for earnings growth and cash generation this year and next. Now, I'm happy to welcome Pete, who will cover GE Healthcare.\n\nPete Arduini -- Chief Executive Officer, GE Healthcare\n\nThanks, Carolina. It's a pleasure to join you and Larry on the last earnings call before GE Healthcare's planned spin, which is on track for the first week of January. Our team has made excellent progress preparing GE Healthcare for its future as an independent public company. We achieved several milestones in recent months, including establishing our board of directors with deep healthcare expertise, diverse leadership, and financial experience.\n\nI look forward to working with them as we hit the ground running together at GE Healthcare's next chapter of growth and value creation. Another key step in the process was our public Form 10 filing. This important disclosure details our historical and pro forma financials for GE Healthcare at both the segment and total company level. We also disclosed our planned capital structure.\n\nWe expect our go-forward financial policy will incorporate a strong investment-grade rating for the company. And while we expect to prioritize deleveraging near term, we believe our solid financial position provides us significant flexibility to continue to invest in the business. We'll share more on our strategy at our December 8 investor day with the senior leadership team. And I look forward to meeting with many of you and discussing our vision as we work to drive better outcomes for patients and productivities for customers in the years ahead.\n\nMoving to our performance. Overall, GE Healthcare delivered a strong quarter with sequential improvement. Top-line growth across the business reflects the tireless work of our teams and partners to address supply chain constraints and improve product fulfillment. Market demand and backlog conversion remained positive despite inflationary and supply challenges that continue to impact the industry.\n\nWe're speaking with our customers regularly and watching their behavior closely. They have been impacted by higher costs, particularly around labor. This makes the imaging and ultrasound products we provide more important than ever based on their ability to deliver increased productivity for providers. Looking at customer trends, global public spending in healthcare is solid, particularly in Europe and Asia.\n\nIn the U.S., customers are taking a more cautious approach as they monitor the economic environment. Overall, continued patient demand is leading providers to invest in products and services that increase productivity and reduce operating costs, an important dynamic as healthcare systems modernize post-pandemic and prepare for increased demand longer term. That said, we're keeping a keen eye on provider performance and procedures which continue to improve sequentially. Looking at the quarter, orders increased 4% year over year with sequential growth.\n\nService is strong, up low double digits. Equipment was negative due to a reclassification of certain upgrades from equipment to services, plus a tough comp year over year. Organic revenue was up 10% year over year with sequential growth. Equipment and services were both low double digits year over year, and imaging and ultrasound were bright spots.\n\nCurrency negatively impacted reported results by five points. Near term, we're focused on commercial execution improvements and NPI launches. Notably, GE Healthcare recently topped the FDA's list of authorized artificial intelligence and machine learning-enabled medical devices. Our commitment to innovation continues with quarterly R&D spend, up double digits year over year, helping us accelerate our long-term growth plans.\n\nSegment margins declined to 15.4% year over year due to ongoing supply and inflation impacts. Sequential margins have improved since the first quarter, driven by higher volume, price, and a continued focus on reducing costs. We've now delivered two consecutive quarters of positive price and orders price, which also remained positive. We've been offsetting supply constraints by embedding Lean throughout our business.\n\nOne way we monitor supply dynamics is through red flags, identifying lines of risk of a shortage, if not replenished within 10 days. And these have declined nearly 40% since last quarter. We've also broadened our supply base and requalified and redesigned over 7,000 parts, driving positive results. While challenging, we expect supply chain pressures to improve for the remainder of '22 and into '23.\n\nWith the spin approaching, we thought it would be helpful to provide some color on GE Healthcare's cash performance. Keeping in mind our customer needs, we worked with suppliers to stock up on critical inventory year to date and continue to manage inventory in an inflationary environment. In total, our quarterly free cash flow grew slightly year over year and sequentially. Our actions, we are confident that we can meet fourth quarter customer demand.\n\nFor the full year, we still expect mid single-digit revenue growth. At the same time, higher inflation, currency, and investments are impacting operating profit, which we now expect to be 2.6 billion or more. And we expect free cash flow in a range of 2.1 billion to 2.3 billion based on the higher inventory build to meet demand in the fourth quarter and into 2023. In closing, our team is highly energized as we approach this new chapter.\n\nWe're confident that the planned spin will unlock significant shareholder value, enabling us to prioritize R&D investment, grow faster, and operate -- and optimize our operating model. And so with that, Larry, I'll hand it back over to you.\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nPete, thank you. I share your excitement. I think we're going to have some fun. I'd like to close on Slide 12.\n\nGE continued to build momentum in the third quarter. Aerospace delivered a very strong quarter. Renewables is taking action to reset for profitable growth. Power remains on track for stable earnings and cash.\n\nAnd healthcare, as Pete just outlined, Improved performance. Lean and decentralization are the big key enablers of this momentum, driving safety, quality delivery, and cost improvements, which serve as the foundation of all we do at GE. And these improvements are sustainable. Take my 2021 Kaizen Week team at Lynn.\n\nOne year later, the team has enhanced our closed loop machining process on the T700 midframe. Now, while there's always more to do, this process is delivering close to 100% first-time yields compared to about 60% previously. Really Lean sticks, and we're scaling it across lines, sites, and businesses. And with the Lean foundation, GE continues to lead with innovation.\n\nIn aerospace, we completed testing on our second XA100 adaptive cycle engine, partnering with the U.S. Air Force. It's an innovative engine that pairs power with efficiency. Healthcare made further progress in the home care space, expanding its Alivecor relationship and announcing a new collaboration with AMC Health to enable remote patient monitoring, and power is secured in order for Kindle Energy to provide age-class power generation equipment.\n\nThis will help support Louisiana's ongoing energy transition, initially fueled by natural gas with the ability to use up to 50% hydrogen by volume. It's clear our businesses are creating a smarter and more efficient future of flight, driving decarbonization through the energy transition and enabling precision healthcare. And we're set to unleash their full potential through our plans to launch three independent investment-grade industry leaders, starting with GE Healthcare in just two short months. Steve, with that, let's go to questions.\n\nSteve Winoker -- Vice President, Investor Relations\n\nThanks, Larry. Before we open the line, I'd ask everyone in the queue to consider your fellow analysts again and ask just one question so we can get to as many people as possible on this busy earnings day. Denise, can you please open the line?\n\nOperator\n\n[Operator instructions] The first question comes from Nigel Coe from Wolfe Research. Please go ahead.\n\nNigel Coe -- Wolfe Research -- Analyst\n\nOh, thanks. Good morning, everyone.\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nGood morning, Nigel.\n\nCarolina Happe -- Chief Financial Officer\n\nGood morning, Nigel.\n\nPete Arduini -- Chief Executive Officer, GE Healthcare\n\nGood morning.\n\nNigel Coe -- Wolfe Research -- Analyst\n\nGood morning. So, I'll keep to one question. On renewables, I just want to confirm the charge in the quarter if that's sufficient to cover the entire scope of the work that needs to be done. And my real question is, on the disruption charges you've laid out, is that sufficient to return the business to break even or better with stable markets? Or do we need the U.S.\n\nonshore market to recover to get back to profitability?\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nNigel, let me let me take that in order. I think what we have laid out today, what we've been working on all year really puts us in a position for onshore wind to be profitable in 2024. That's not the end state, but it's an important waypoint for us given recent performance, obviously. The charge that we're taking here, the 500 million, is geared toward resolving the fleet availability issues that we've touched on.\n\nI think that gives us ample room to tend to what we need to deal with and move forward from there. That not only helps us with fleet availability, but the other design and manufacturing improvements we referenced. In addition to the restructuring are what really set us up to be more profitable and to be flat out profitable in 2024. So, next year will be another year, where we probably have parentheses around the upper profit numbers.\n\nBut then we get to where we need to be in '24. And we'll move on from there. We really aren't expecting in the short term, Carolina touched on this, meaningful help from the IRA. In fact, we're going to -- we've seen some business move from '22 to '23 as a result of customers taking a pause, waiting for the incentives that they'll enjoy in all likelihood next year in a way that they couldn't access this year.\n\nBut we've never had more clarity. We've never had, I think, better visibility about U.S. government support for onshore wind than we do now for the rest of the decade. But none of the operating actions that we've highlighted here are relying on that legislation.\n\nRemember, we didn't think that was going to happen when we talked to you in late July. Right? That was a pleasant third quarter surprise. So, everything we've been doing operationally is geared toward a lower level of volume profitability in that context. But the Inflation Reduction Act just, I think, improves the prospects for this business for a decade meaningfully.\n\nSteve Winoker -- Vice President, Investor Relations\n\nThanks. Next question.\n\nOperator\n\nThank you. The next question comes from Anthony Petrone from Mizuho Group. Please go ahead.\n\nAnthony Petrone -- Mizuho Securities -- Analyst\n\nThanks, and congratulations to the team on getting close to the first spin with GE Healthcare. So, this question will be for Pete and Helmut on the call. Pete, just as we head into spin here, we've had a number of companies in the medical device space report already, as well as several large hospital customers. And I think I would classify the environment right now as highly mixed and still a lot of variables out there, certainly, as it relates to 2023.\n\nSpecifically, last week, we had two large hospital operators elect to not issue guidance. On the flip side, some of the medical device companies have actually posted slightly better procedures. Turning to the GE Healthcare business, sequentially, it actually looks like orders improve a bit. So, with that as context, maybe just your background as the company speaks to its hospital customers.\n\nAnd maybe just a very early view on your high-level thoughts on 2023. Thanks a lot, and congratulations to the team again.\n\nPete Arduini -- Chief Executive Officer, GE Healthcare\n\nAnthony, thanks for the question. Yeah, look, to your point, as I mentioned in the prepared comments, actually, in Q3, you know, we see a positive global growth market backlog price improving. But we are watching this evolving environment, particularly in the U.S. The public markets outside of the U.S.\n\nand EMEA and Asia, particularly China, there's actually a reason out of stimulus money or post-COVID investment that's going in to increase growth. But, you know, we see that patient demand from some of the different reports that's out on the street, both from MedTech, as well as other providers, to be showing incremental growth. Obviously, there's been some increases in cost of labor, but that seems to be subsiding. And so, I'm out pretty regularly speaking with customers.\n\nAnd we still see a reasonable amount of pent-up demand within the system. I think we all realize that year over year, '21 to '20, it's actually a tough comp. It was a pretty big recovery in procedures, as well as equipment growth. And so, we're still seeing if you look at, you know, a two-year stack, we're still seeing double-digit growth versus 2019.\n\nSo, keeping a sharp eye on it for sure. Look, relative to '23, you know, we'll obviously talk a lot more about our strategy on December 8, and then we'll plan to talk about our guidance in our normal time period, so at the end of the Q4 announcement. Thanks again for your question.\n\nSteve Winoker -- Vice President, Investor Relations\n\nThanks. Next question, please.\n\nOperator\n\nThank you. The next question comes from Andy Kaplowitz from Citigroup. Please go ahead.\n\nAndy Kaplowitz -- Citi -- Analyst\n\nHey, good morning, everyone.\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nGood morning, Andy.\n\nCarolina Happe -- Chief Financial Officer\n\nGood morning, Andy.\n\nPete Arduini -- Chief Executive Officer, GE Healthcare\n\nGood morning, Andy.\n\nAndy Kaplowitz -- Citi -- Analyst\n\nThe cash in Q3 was higher than your own expectations coming in. But you mentioned that your plan to take, I think, $1 billion plus additional restructuring between corporate and Vernova, the majority of the corporate restructuring in Q4. So, how do we think about the rightsizing of your businesses in the context of cash. I know you've clearly said you need to assess what your cash generation would look like versus that old 7 billion-plus guidance for '23? But could you give us more color into the puts and takes of how to think about cash going to '23 versus the 4.5 this year?\n\nCarolina Happe -- Chief Financial Officer\n\nOK. So, to be sure I understood the question, so, you were talking about how we get to the cash in 2023? OK. So, we've talked about the different businesses and where we are. Just to comment on the restructuring.\n\nSo, the restructuring that we take this year, you are right that cash will impact 2023 and probably also 2024. But that said, with where we are now, we have strong momentum going into 2023. And we have talked about us expecting a significant improvement of both profit and cash for 2023. And that still holds.\n\nIf you look at it, business by business, aerospace is clearly on a big rebound from COVID and an unprecedented ramp, which will continue into next year. We have Healthcare. Pete just mentioned that still strong orders and executing on the backlog. So, that will continue to go into 2023 as well.\n\nOn renewables, as we take -- the charge is one thing, but we will also expect to start to see the impact from both the improved availability on our products, as well as the cost out that we mentioned earlier today. You'll start to see that improvement. And then, for power, I would say we expect services to continue to grow; steam, continue to improve; grid being profitable. And you put all of that together.\n\nAnd I would add to that also the working capital opportunity with reducing inventory and ARs. Put all of that together, and you're going to see that strong improvement in 2023.\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nAnd, Andy, I think our current intent, now that we have just come out of our strat plan cycle and are heading into budgets here over the next several weeks is to effectively do what we've, I think, done the last several years and provide that forward-looking outlook cash and everything else at that fourth quarter earnings in January.\n\nSteve Winoker -- Vice President, Investor Relations\n\nGreat. Denise, next question.\n\nOperator\n\nThank you. The next question comes from Brendan Luecke from AllianceBernstein. Please go ahead.\n\nBrendan Luecke -- AllianceBernstein -- Analyst\n\nGood morning, all. Thanks for taking my question. I just wanted to touch base real quickly on the rightsizing for the onshore wind business. How should we be thinking about longer-term competitive implications of having smaller business here? Are you setting yourself up for a scaled disadvantage down the road?\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nBrendan, I'm sorry. Could you ask the last part of that again, please?\n\nBrendan Luecke -- AllianceBernstein -- Analyst\n\nIs there a risk of GE onshore being at a disadvantage from a scale perspective down the road?\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nBrendan, I don't think so whatsoever. I think that, in many respects, one could argue that it has been the pursuit of scale that has led us in part to our current underperformance. We have led the last several years, as you know, well here in North America. In the U.S., it's a market where we've got a home field advantage.\n\nIt tends to be one of the better geographies in the entire onshore wind space. And I think all you are really seeing us do, with respect to the restructuring, the selectivity efforts, and the change in our product roadmaps, is to really make sure that we are in a position to lead through this orders trough, particularly in North America, but come out of it not only with better products, better value propositions, better cost structures, but ultimately better performance as we move forward here, both for our customers and investors. I don't think that anything that we're doing here does anything to undermine our competitiveness. I would argue, it will enhance our competitiveness, particularly at a time when I think many customers are looking forward here when the IRA kicks in.\n\nAnd we're going to go quickly from a trough period to a time of scarcity, where it won't be about one upmanship or specsmanship. It will really be about reliability. We're going to lead in that fashion. We can be better than we are today.\n\nAnd I know that's what Scott and the rest of the onshore wind team are committed to. It may mean that we don't play in as many markets as we have historically. I think that will be a good thing because we have no intention of being all things to all people in any of our businesses. That's particularly important in onshore wind.\n\nI think it's part of what you see in Scott and team do effectively in running what we refer to as the power playbook as they transform that business. And that's certainly going to be an important part of the program in onshore wind and, frankly, more broadly across renewables. But it's particularly acute, given the relative size of the operating loss today in onshore.\n\nSteve Winoker -- Vice President, Investor Relations\n\nDenise, next question.\n\nOperator\n\nThank you. The next question comes from Jeff Sprague from Vertical Research. Please go ahead.\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nThank you. Good morning, everyone.\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nHey, Jeff.\n\nCarolina Happe -- Chief Financial Officer\n\nGood morning, Jeff.\n\nPete Arduini -- Chief Executive Officer, GE Healthcare\n\nHey. Good morning.\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nHey. Maybe just a little bit more color on aero. Just, you know, a couple of things jumping out to me here today. I think, originally, we started the year thinking AD&A would be a, you know, kind of a billion-ish headwind.\n\nAnd we're at zero now for the year. And then, also, just looking at the aftermarket, right, I don't expect you to speak to your competitors necessarily, but, you know, Collins and Pratt posted 23% to 25% aftermarket growth here. You know, your spares number is up 52. So, I wonder if you could just address both of those.\n\nYou know, what -- how we should expect AF&A to maybe track into 2023, and if there was anything kind of unusual in timing, particularly in the spares business.\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nJeff. Maybe I'll take the latter, and I'll let Carolina speak to the former. But I think you're exactly right in terms of what we're seeing in aerospace, right? I mean, overall revenue is up 25%. The business just is facing welcome after the COVID drought, incredible levels of demand.\n\nWe know we're going to continue to see that in the fourth quarter and in '23. I think from an aftermarket perspective specifically, we've got a number of things that really helped us not only from a volume and frankly from a margin and cash performance this quarter. In the aftermarket, shop visits were up year over year and sequentially. The scope within those shop visits was more robust.\n\nWe saw favorable mix with respect to our parts business as well, really, I think, as we and our partners in service to the airlines are trying to keep the current fleet in the air as much as we possibly can. So, a little bit of the tempering with respect to the fourth quarter margins is that we see some of that mix moving the other way. It'll still be, I think, a more than respectable second half. But we benefited a little bit in the third quarter.\n\nWe will probably give up some of that in the fourth. But that said, I think the operating mindset that we have is really to continue to drive shorter turnaround times, higher on-time delivery, and really do all that we can to help the airlines meet what has been clearly a quite robust demand on the part of the flying public. And having been with a number of these customers recently, not only the airline leadership but a number of others in the travel and leisure hospitality spaces, they're excited about the end-of-the-year outlook here and going into '23. So, we want to be part of the solution in that regard, and we're obviously well positioned to do just that.\n\nCarolina, AD&A?\n\nCarolina Happe -- Chief Financial Officer\n\nYeah, so, Jeff, on AD&A, you're right. When you referenced the 1 billion of headwind year over year, that's comparing '21 to '22. So, in '21 we were 0.5 billion positive, and we were expecting to be about 0.5 billion negative in 2022. The way it has panned out is that in the third quarter, we had about 300 of positive flow, which gets us year to date negative.\n\nBut if we put the full year 2022 now, our latest expectation is that we would be flat in year flow. If you then look into 2023, we do expect the airframes to continue to deliver aircraft from inventory. So, that will be then a headwind for us with the outflows. But we also expect the engine deliveries from us to provide some -- I would say some offset to that number.\n\nAnd exactly where that lands, we'll talk to you more about when we guide for next year.\n\nSteve Winoker -- Vice President, Investor Relations\n\nDenise, next question.\n\nOperator\n\nThank you. The next question comes from Nicole Platt from Deutsche Bank. Please go ahead.\n\nNicole DeBlase -- Deutsche Bank -- Analyst\n\nYeah, thanks. Good morning, guys.\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nGood morning, Nicole.\n\nCarolina Happe -- Chief Financial Officer\n\nGood morning, Nicole.\n\nPete Arduini -- Chief Executive Officer, GE Healthcare\n\nGood morning.\n\nNicole DeBlase -- Deutsche Bank -- Analyst\n\nJust on the Vernova spin, now that you guys are kind of expecting renewables to still have parentheses around the profit number in 2023, does that change at all the potential timing of the spin, just thinking about the rating agencies and how you guys want the investment grade rated in all of the business? Would it benefit that business to start to see positive profitability before the spin actually is consummated? Thank you.\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nNicole, we're, again, very much on track, not only with the healthcare spin, with Pete and team here early in the new year. But Vernova in early '24, just as we laid out last November. I think you're spot on. We aspire to have all three businesses be investment grade as we move forward with the plan.\n\nAnd that framework, that commitment, very much intact, which is why I'm excited about both what we're doing operationally in terms of controlling the controllable. We've touched on that a couple of times relative to our product strategy, the fleet availability effort with the charge today, and, obviously, the restructuring. That coupled with the legislative support that we're seeing here in the U.S. and clearly the enhanced concerns around the energy trilemma, particularly energy security in Europe, I think bode very well for renewables and all of GE Vernova.\n\nRight? We do a lot of things. And I think increasingly, as we talk to customers, particularly in this environment, our strategy, our breadth to help them navigate sustainability objectives, security, let alone affordability concerns, couldn't be more timely. So, I think we feel good about those things within our control, which the print were otherwise. But I think it's very much an investment in the trajectory of this business, which, again, will be a an investment grade business.\n\nSo, very much on track.\n\nSteve Winoker -- Vice President, Investor Relations\n\nDenise, next question.\n\nOperator\n\nThank you. Next question comes from Steve Tusa from J.P. Morgan. Please go ahead.\n\nSteve Tusa -- JPMorgan Chase and Company -- Analyst\n\nHi. Good morning.\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nGood morning.\n\nPete Arduini -- Chief Executive Officer, GE Healthcare\n\nGood morning.\n\nCarolina Happe -- Chief Financial Officer\n\nGood morning, Steve.\n\nSteve Tusa -- JPMorgan Chase and Company -- Analyst\n\nSo, Carolina, you were out in mid-September talking about cash that was close to break even. I mean, what was the swing factor in the last couple of weeks of the quarter? And then, just a quick one on healthcare. What are you guys planning on doing with the proceeds or the stock that you're keeping on your balance sheet after the spin? Thanks.\n\nCarolina Happe -- Chief Financial Officer\n\nThanks, Steve. So, yes, if I compare to where we were in Laguna, first of all, I'd like to say that I'm really proud of how the teams came together and performed to deliver this 1.2 billion of free cash flow in the quarter. And I would say, overall, the dynamics did play out as we've talked about them. The receivables were pressured, and we did see the monthly billings being higher than we would have wanted, pushing collections to the following quarter.\n\nAnd we also had elevated material purchases to de-risk the fourth quarter delivery. And you see that on the inventory. What was better than anticipated, a couple of things. We saw stronger aerospace performance, higher earnings.\n\nAnd then, you know, it's going to be about services, so better services and especially on the spare parts side. Then, we also saw even stronger utilization both on air engines and gas turbines. And that drove higher billings and higher collections. And you can see that in contract assets.\n\nWe're also working to have more rigor on receivable daily management. And we actually managed to collect more than we thought. So, we reduced it so by two days year over year, which was better than we thought across the businesses. And then, finally, on AD&A, aircraft deliveries pushed relative to the forecast, which really -- well, that's a positive impact for us on our numbers.\n\nSo, overall, that's what got us to 1.2 billion of free cash flow. And that's also part of what gives us confidence in reiterating the guide of 4.5 billion of free cash flow for the full year. Your second question was on the healthcare proceeds. So, yes, we've talked about that, Steve, we would keep that part of healthcare.\n\nBut it's too early to tell what we're going to do with that. We are -- you know, we have a capital allocation framework and the capital allocation structure. So, in due time, we'll come back to that and share more.\n\nSteve Winoker -- Vice President, Investor Relations\n\nOK, Denise. Next question, please.\n\nOperator\n\nThank you. The next question comes from Andrew Obin from Bank of America. Please go ahead.\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nHi, guys. Good morning. So, you had a disclosure that, in third quarter, you agreed to terminate substantially all long-term care insurance exposure, previously ceded to single reinsurance company. Right? So, 300 million after-tax charge in the third quarter.\n\nSo, I guess the question is, are you guys cleaning up things? You know, does this make it easier to do a transaction on long-term care down the road? Are these things connected? Thanks.\n\nCarolina Happe -- Chief Financial Officer\n\nHi, Andrew. Thanks for asking. So, to start with, I would say this transaction is really a good example of how we continue to work to reduce risk. So, we're bringing back 2.5 billion of assets that were previously held by a third party.\n\nAnd instead, we will invest that. I would say, everything that reduces risks and makes this a stronger book is a positive and keeps our optionality broader for the future.\n\nSteve Winoker -- Vice President, Investor Relations\n\nThanks. Next question.\n\nOperator\n\nThank you. The next question comes from Joseph Ritchie from Goldman Sachs. Please go ahead.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nThanks. Good morning, everyone.\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nHey, Joe.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nMy question is for Peter. And so, I really want to try to understand the path for normalizing free cash flow in the healthcare business because it seems like you're running about, you know, 1.4 billion behind this year as of the middle of the year. Things only improved a little bit sequentially in the third quarter. So, maybe just talk about that path, you know, beyond 2022.\n\nPete Arduini -- Chief Executive Officer, GE Healthcare\n\nHey, Joe. Thanks for the question. As I mentioned in the comment, I mean, we made a conscious decision with the mid-single digit growth that we see here in the second half and really going into next year to index on taking on sourcing and stocking the right level of critical parts. And as you've heard in other areas within healthcare and other parts of the business, you know, certain areas, such as chips and other areas, sometimes you just can't account on a consistent flow.\n\nAnd in our case, where there might be a couple of thousand components that come into an MRI, you know, the shortage of one or two pieces could let that big chunk of equipment actually not get transferred. And so, that's part of what we've laid out. We actually have a very strong backlog and commitment from customer orders well out into '23. And so, I think what we're seeing now is we're going to continue to see that moving through.\n\nObviously, we had -- as we mentioned, we actually had quarter-over-quarter improvement. I believe, sequentially, we were -- free cash flow grew about 450 million and year over year in the upper 20s. But I think you're going to see more of that accelerated into Q4 into the next year. But the majority of it is really liquidating it here with the commitments that we have and as the supply chain improves, which we are seeing quarter over quarter.\n\nSteve Winoker -- Vice President, Investor Relations\n\nDenise, let's try to get in two more questions. A quick one first from, I think -- can you go next?\n\nOperator\n\nThank you. The next question comes from Julian Riccio from Barclays. Please go ahead.\n\nJulian Mitchell -- Barclays -- Analyst\n\nThanks very much for squeezing me in. So, yes, I'll try and be quick per Steve's comment. It's really on Vernova. You know, just any color around the cash flow this year and where that will look in '24.\n\nAnd then, on that EBIT guide, I think minus $2 billion Carolina had mentioned for this year going to zero plus in 2024. A big -- what are the big swings? I think there's $500 million of cost out. There's maybe $700 million, $800 million of warranty coming back. How does that balance split? Any color at all? You know, volume, price cost, FX, any help on that?\n\nCarolina Happe -- Chief Financial Officer\n\nSo, Julian, well, you mentioned a couple of the most important ones to start with. So, as we're working through -- the restructuring is one piece of it. But also the sort of the workforce and the industrialization will help improve the product and also how we install the product. So, you put all of that together, you will see improved profitability.\n\nAnd of course, you won't see the recurring -- you won't say the charges that we take this year going forward. So, we do see some cash pressure in, I would say, 2022. But for 2023, if you think about it, you have grid positive, and you have a significant improvement on the onshore wind side. You have, I would say, the continued decentralization and restructuring actions there.\n\nSo, you put all of that together, you will see a significant improvement in 2023 and that moving on then into 2024. And in 2024, basically, the restructuring is completed. You'll see the full benefits, and we expect to see a big IRA demand volume coming through. Some of them probably end 2023, but the majority of that coming in 2024.\n\nAnd now with those -- with the new orders to get progress payments as well. So, that's how you step sort of through '22, '23 to '24 on profit and also on cash.\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nAnd I think, clearly, Julian, we're feeling the other side of that in the absence of a healthy order book with the PTC lapse all the more, given some of the postponement that we've seen here of late relative to business we anticipated this year. But I think Carolina has got it right. We'll be in a more normal environment in terms of the order book and the attendant flows. I also think some of the product rationalization that we've hit on will help us from a working capital perspective as well, right, with the -- just the variance in the extreme customization that we've fallen to in a couple of areas.\n\nThere's no way that hasn't had us carrying more inventory then we aspire to carry in this business. So, a lot that we can do. But again, I think the template that you've seen over the last several years at power is a pretty good road map here for what we are working on and what you'll see more clearly in the financials in that business in the next several years.\n\nSteve Winoker -- Vice President, Investor Relations\n\nGreat. Denise, last question, please.\n\nOperator\n\nThe next question comes from Deane Dray from RBC. Please go ahead.\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nThank you. Good morning, everyone. Thanks for squeezing me in.\n\nPete Arduini -- Chief Executive Officer, GE Healthcare\n\nHey, Deane.\n\nCarolina Happe -- Chief Financial Officer\n\nHi, Deane.\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nGood morning, Deane.\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nLarry, could you give us an update on the '23 planning cycle? You said the strat plans have been done, you're in the budgeting process. What's the macro you're assuming? I know that's -- it's pretty fluid here. And how would you describe the recession playbook for GE? I know you got 30 platforms, it's not cookie cutter. But any color there in terms of the resilience of the portfolio would be helpful.\n\nThanks.\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nDeane, you're exactly right. We've just been through a couple of weeks with Vernova, in fact, just given the breadth of the portfolio. Timely, obviously, in the wake of not only what's happened in Ukraine and turn Europe, but also the IRA. We recently did the same with the aerospace team.\n\nI think I referenced that in the prepared remarks. We actually ran through the healthcare strat plan earlier in our calendar that is normal simply to make sure we have that as a front-end load to all the subsequent work that Pete and the team have done in part the Form 10 that just came public. I would say, overall, from a process perspective, really quite pleased in all three instances as to how far we've come over the last several years, frankly, just sharpening up our strategic intentions around those critical questions. You've heard me ask a lot over the years, what game are we playing and how do we win.\n\nI think that as we look at the macro, Deane, we don't have a unique house view here as to how things are going to play out. I think like others, we're concerned just around the host of issues that are out there. But that said, at aerospace, we have tremendous demand. Again, the customers I speak to on a regular basis are quite bullish about their outlook.\n\nThey need us to continue to support them, and we intend to do that. I'm sure you'll hear later this week from our airframer customers and the ramps that are underway in new plane production. We want to do the same with them. So, we're not unmindful of the macro at Aerospace, but we've got a lot of activity to work through and perhaps a little bit of a secular exemption to some of the near-term economic uncertainty.\n\nPete, I think, spoke well to healthcare. But here, again, post-COVID, in addition to the backlog work down that we will pursue, I think, healthcare modernization -- Pete mentioned China, I think we're going to see the same thing here in the U.S. Europe, also a priority. I think that bodes well, particularly for how we play in precision health.\n\nAnd then, again, given the support here in the U.S. around the inflation Reduction Act, primarily for wind and grid, but to a degree, gas, but also this more pragmatic approach to the trilemma, I think, is going to really help both renewables and power as we move forward. And that's not a '23 dynamic. So, again, I don't want to suggest that any of our businesses are insulated or immune from the broader economic context.\n\nBut I do think we've got specific secular drivers in addition to so much that is within our control to work through it. And that's what we're going to do. We're going to control the controllable, stay true to the Lean agenda, and put forward the best fourth quarter and the best 2023 we possibly can.\n\nSteve Winoker -- Vice President, Investor Relations\n\nGreat. Larry, any final comment?\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nSteve, thank you. Just to close here. The team -- the GE team delivered, again, in the third quarter, led by aerospace, a very strong quarter. The spins are on track, starting with Healthcare in early January.\n\nAs Steve mentioned, before then, we hope to see many of you at our GE Healthcare investor day on the 8th of December. And we do appreciate your time today, your interest in GE, your investment in our company. And we stand by, Steve, Carolina, and the rest of the IR team to help as you consider GE and GE Healthcare in your investment processes.\n\nSteve Winoker -- Vice President, Investor Relations\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSteve Winoker -- Vice President, Investor Relations\n\nLarry Culp -- Chairman and Chief Executive Officer\n\nCarolina Happe -- Chief Financial Officer\n\nPete Arduini -- Chief Executive Officer, GE Healthcare\n\nNigel Coe -- Wolfe Research -- Analyst\n\nAnthony Petrone -- Mizuho Securities -- Analyst\n\nAndy Kaplowitz -- Citi -- Analyst\n\nBrendan Luecke -- AllianceBernstein -- Analyst\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nNicole DeBlase -- Deutsche Bank -- Analyst\n\nSteve Tusa -- JPMorgan Chase and Company -- Analyst\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nJulian Mitchell -- Barclays -- Analyst\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nMore GE analysis\n\nAll earnings call transcripts"
}