{
  "companyName": "Athersys",
  "companyTicker": "ATHX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/athersys-athx-q2-2022-earnings-call-transcript/",
  "content": "Athersys (ATHX 9.09%)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nThank you for standing by, and welcome to the FSC Inc. second quarter 2020 results conference call. [Operator instructions] I will now hand today's call over to Ellen Gurley, manager of corporate communications and investor relations. Please go ahead.\n\nEllen Gurley -- Manager of Corporate Communications and Investor Relations\n\nGood afternoon, and welcome to Athersys' second quarter 2022 results and business update conference call. Please note that any remarks that management may make about future expectations, plans and prospects constitute forward-looking statements for purposes of the safe harbor provision under the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by the forward-looking statements as a result of various factors, including those discussed in our Forms 10-Q, 10-K and other SEC filings. We anticipate that subsequent events and developments may cause our outlook to change.\n\nWhile we may elect to update these forward-looking statements at some point in the future, we specifically disclaim any obligation to do so. All risks and uncertainties are detailed in and are qualified by the cautionary statements contained in Athersys' press releases and SEC filings. Also, this conference call contains time-sensitive information that is accurate only as of the date of the live broadcast, today, August 11, 2022. Athersys undertakes no obligation to revise or update any forward-looking statements to reflect events or circumstances after the date of this conference call, except as required by law.\n\nWith that, I would like to turn the call over to Dan Camardo, chief executive officer of Athersys. Dan, please go ahead.\n\nDan Camardo -- Chief Executive Officer\n\nThank you, Ellen, and welcome, everyone, to Athersys' second quarter 2022 business update [Audio gap] today are Maia Hansen, our chief operating officer; Kasey Rosado, our interim chief financial officer; and Dr. Robert Mays, our head of regenerative medicine and neuroscience programs. And let me start by saying I'm very proud of the hard work demonstrated by the entire Athersys team to help transform the company following our recent restructuring. We believe that MultiStem has incredible potential and significant market opportunity in treating patients that suffer an ischemic stroke and potentially several other serious diseases.\n\nUnder the transformed Athersys, we are much more focused. We're more judicious than we are driven. As such, I'm confident in this team's ability to capture that opportunity and deliver value back to our shareholders. While Athersys faced various challenges during the second quarter, our restructuring provides a road map for success that involves a heightened clinical focus on MASTERS-2, operational expense reduction and derisking development for MultiStem.\n\nWe have already embarked on the first two, but to move forward, we need to raise capital. We have been evaluating various financing options and continue to pursue potential partnerships that would provide non-dilutive funding and potentially complementary capabilities in regulatory clinical operations, commercial and manufacturing. On our call today, I'll share a new vision for Athersys and provide a transparent picture of the decisions we've made over the last two months to put us in a position to succeed. Our long-term vision is global, but our journey to get there will be closely measured and focused.\n\nI strongly believe that unlocking the full potential of MultiStem as a platform is best achieved through a collaborative strategy that builds upon the groundwork of research and clinical data across a growing number of indications. MultiStem's unique profile as a cell therapy and proven potential is at the core of everything we do and guides the strategy we've implemented since restructuring the business earlier in the quarter. In terms of today's call, first, I'd like to provide an overview of reprioritized clinical programs, starting with our primary focus on MASTERS-2, our pivotal Phase 3 clinical study in ischemic stroke. Second, I'll review how the restructuring process results in a leaner, more agile Athersys and how it provides a road map for deploying our wealth of preclinical data to heighten MultiStem's potential that could drive new opportunities through our business development strategy that delivers derisked accretive shareholder value.\n\nAnd third, I'll provide an update on our company's financial position and capital strategy. We'll then conclude with a question-and-answer session that will include questions we received during our annual shareholder meeting back on July 28. Let me start with our active clinical trials. Our clinical focus is now on MASTERS-2, our ongoing pivotal Phase 3 trial in ischemic stroke.\n\nAs you may recall, MASTERS-2 is a randomized, double-blind, placebo-controlled clinical trial enrolling up to 300 patients across leading stroke centers in the U.S. and internationally. I'm happy to report that enrollment has picked up in the last two quarters. This is encouraging momentum that's being driven primarily from news of the TREASURE study results in Japan, increased levels of engagement with participating stroke centers and the addition of new trial sites that we've been activating since the beginning of the year, such as in Australia, Taiwan and key stroke centers across Europe.\n\nWe have increased our engagement with our sites, and we are working to better understand and address barriers that some sites have encountered with patient enrollment, cell lab, collaboration and staff training. In addition, we are happy to announce the contract manufacturer we've been working with has completed production of all investigational products necessary to complete MASTERS-2 under the current clinical protocol. We are currently in the process of discussing the release of remaining products with our contract manufacturer. And while we are encouraged by this progress, we also want to be more transparent on the expected completion window for enrollment.\n\nPreviously, we stated that Q1 2023 was our target for full enrollment. We are no longer focused on that date for a few reasons. First, we are being extremely prudent with our operational expenses and cost structure, which requires us to take a more measured approach to adding new sites and stroke center engagements. Second, we're in the process of analyzing the recent TREASURE data to determine whether we should make any changes to the protocol of MASTERS-2 in trial design and enhance the probability of success.\n\nImportantly, any potential changes we are contemplating will not affect patients already enrolled in MASTERS-2. And once our analyses have been completed, we may engage in dialogue with regulators, if necessary. And lastly, our long-term goal is to achieve a successful trial outcome with MultiStem, and we are currently in a critical window of time to consider revising protocols, especially with the complete treasure data set in hand. These decisions aren't made hastily, so we're taking time now to conduct a deeper analysis.\n\nWe look forward to providing more accurate time lines as we conclude these analyses and consider potential trial modifications with regulatory agencies. As we reprioritize our efforts on MASTERS-2, let me address our work in acute respiratory distress syndrome, or ARDS. Based on the significance of the condition and our prior work with MUST-ARDS trial, there was interest in partnering with BARDA on a Phase 2/3 trial in response to COVID or other pathogen-induced ARDS. However, given our financial situation and prioritized focus on ischemic stroke, we plan to suspend enrollment prior to administering the new bioreactor-produced product until we can strengthen development plans through a partnership or alternative funding source.\n\nThis was a difficult decision because of the results we observed with MUST-ARDS trial and significant unmet medical need associated with ours, but it was a necessary choice to prioritize spending. Since we completed the initial cohort of administering MultiStem factory product that was focused on safety and dosing, suspending the trial at this point made sense since the next cohort was moving to administration of MultiStem product produced using the bioreactor process. As we explore alternative options to restart this trial, we will provide timely updates. Finally, turning to our trauma program, I'd like to share an enrollment update on the MATRICS-1 study, which is a Phase 2 study with the University of Texas Health Science Center at Houston, one of the busiest Level 1 pharma centers in the United States.\n\nMATRICS-1 is evaluating MultiStem for the early treatment and prevention of complications after severe traumatic injury. The first cohort of the study utilizes MultiStem produced from our cell factory process, and that -- and the first cohort was completed successfully focused on demonstrating safety. The second cohort has started with the new bioreactor-produced product, and I'm happy to report we have successfully started to enroll patients with the MultiStem bioreactor product. The dosing used in this trial is similar to dosing used in our ischemic stroke trial, which is 1.2 billion cells delivered in a single dose intravenously.\n\nWe believe MultiStem holds great potential to benefit accident victims, battlefield casualties, and others suffering from traumatic injury by improving recovery, survival, and quality of life. As a reminder, this trial is funded by grants, enabling the partnership with UT Health and clinical development to proceed at a minimal cost to Athersys. As we advance MultiStem, we're making fundamental changes to how we run the business, including how we set business strategy, define and execute on priorities and engage with investors and partners. We're being clear eyed on what really matters for success, making sound decisions and communicating transparently while operating with a bias that favors action.\n\nWhile it was a very tough decision to reduce our headcount by 70%, we have completed this process in the U.S. that have notified impacted ReGenesys employees in Belgium in accordance with local requirements. We also took significant steps to reshape our leadership team and board of directors in order to be more focused, agile, and effective. We're taking this opportunity to reshape our culture, bring in select skills, and create new ways for high-potential leaders to step into new roles.\n\nWe have engaged in current consulting group and welcomes Kasey Rosado as the company's interim chief financial officer. Kasey has more than 18 years of financial, operational, and leadership experience while specializing in financial and operational turnarounds. Kasey has proven to be an ideal fit for our situation and has already made significant contributions to our transformation in just two short weeks. Now since I joined after six months ago, learning more about MultiStem's unique and compelling properties, my conviction has become even stronger on the potential we have with MultiStem.\n\nWhat attracted me most Athersys was the extensive preclinical and clinical research the company has completed to support MultiStem as a platform. Specifically, our multipotent adult progenitor cells, or MAPC, therapy provides us with a highly attractive platform with significant growth potential across different inflammatory diseases, as well as neurological and immune disorders. As part of our transformation efforts, we undertook a comprehensive review of preclinical and clinical research completed to date to identify the highest-priority indications: for example, where we may achieve a best-in-class profile and where we believe we can effectively address significant unmet medical needs. On Monday, August 29, Dr.\n\nRobert Mays and Dr. Sarah Busch will be hosting a comprehensive webinar on our preclinical and clinical research titled Rebalancing the Immune System: the MultiStem Cellular Platform for Treating Disease and Injury. We encourage everyone to register for the webcast using the link in our August 8 news release. Although our primary focus is on completing the MASTERS-2 trial, MultiStem's versatility remains an attractive platform for potential partners at all stages of development, and our research review aims to shine a brighter spotlight on those potential opportunities.\n\nNow earlier this week, we announced the results of a radiation countermeasure study conducted by the Armed Forces Radiobiology Research Institute, which is a research institute within the Department of Defense, and this research is a great example of MultiStem's platform potential. That study showed IV administration of MultiStem provided benefits in an animal model of acute radiation syndrome, or ARS. The results demonstrated increased survival in treated animals, resulted in higher body waste in surviving animals and positive trends in recovery of the hematopoietic system, representing another positive step in a broader development strategy to address severe critical care injuries and diseases. In addition to working with the Armed Forces Radiobiology team, we've also completed pilot work on ARS and collaborated with the National Institute of Allergy and Infectious Diseases over the past several years, with an initial focus on hematopoietic stem cell transplant in graft versus host disease, or GvHD.\n\nThis exploratory work included a completed clinical study demonstrating that MultiStem treatment has the potential to improve survival and utrophin platelet recovery in reduced GvHD and stem cell transplant patients. This is just one example of how we are committed to exploring potential clinical indication for MultiStem where our therapies may achieve a best-in-class profile to help patients that suffer from serious diseases with few effective and safe treatment options. Beyond ARS and GvHD, of the many indications we've done preclinical research, there is compelling data suggesting that MultiStem could play a role in treating Alzheimer's disease, multiple sclerosis, epilepsy, Parkinson's disease, spinal cord injury, hypoxia, and ischemia. We are continuing to seek strategic partnership opportunities that deliver the most shareholder value through advancing our MultiStem platform and that  offers the potential to provide non-dilutive funding.\n\nThe focus of our business development conversations is twofold: first, regional licensing opportunities on ischemic stroke and other indications; and second, pursuing a longer-term global partnership. We continue to collaborate with our current partner, Healios, in Japan and have been taking steps to strengthen our relationship as both companies recognize the significant opportunity MultiStem has in helping patients. As such, we continue to support Healios with their ongoing discussions with Japanese regulators, and as progress in our decisions are made regarding their ARDS and stroke trials, we will communicate the details. As I've mentioned, we have completed production through our third-party manufacturer for sufficient clinical products to support our current trials.\n\nWe are in discussions with our contract manufacturer to release the remaining cell factory clinical product needed to complete MASTERS-2. We've also produced enough bioreactor clinical product to support the MATRICS-1 trial and any additional Phase 1 or 2 trials should we decide to pursue them independently or with a partner. Because we have sufficient supply for our current clinical priorities and in light of our commitment to be prudent with resources, we have suspended further MultiStem manufacturing with our contract manufacturer. We continue to be highly encouraged by the progress made to date and longer-term potential for commercial manufacturing based on our proprietary technologies that are patent-protected, more efficient and scalable.\n\nOur unique manufacturing processes have required substantial investment over the years, leading to significant intellectual property and valuable trade secrets that we feel put us in a position of industry leadership. We'll be sharing more information about our unique scaling and production processes going forward at industry conferences and in trade shows. We're also taking other actions to reduce or eliminate manufacturing-related costs such as consolidating our real estate footprint. We have engaged an agency to sublet or find alternative options for our 214,000-square-foot stow facility, which can be used as a distribution center for laboratories or manufacturers.\n\nNow before I turn to financial results, I'd like to summarize the key changes in our management approach. First, we substantially reduced our cost structure across multiple aspects of the company, making us more attractive to both financial and strategic investors. We've committed to reshaping the executive leadership team with the best possible talent, bringing experience in therapeutics and platform technologies from development through -- to commercial. Second, we are prioritizing our clinical focus on MASTERS-2 while suspending less strategic work that utilizes precious resources and distract us from our top priority.\n\nThird, we are pursuing a business development strategy focused on securing a regional license partner for ischemic stroke as well as a larger global partnership for other MultiStem indications. These partnerships will bring non-dilutive funding and the complementary capabilities across our clinical, regulatory, commercial, and manufacturing functions. And fourth, we're focused on transparency and communicating our priorities, goals, and progress and expect to be held accountable for performance. We're going to be upfront about choices and decisions with our partners and investors.\n\nNow through the restructuring process, we've come out much lease, but we require capital to continue operating, and we're looking at multiple opportunities. We are actively expanding our options to raise capital and are looking at thoughtful, equity-driven approaches in parallel with our pursuit of non-dilutive options, all with an eye on shareholder value and our strategic business. Now let me turn to our financial results. Revenues for the second quarter were negative $1.5 million related to our performance obligation to Healios compared with no revenues in the second quarter of 2021.\n\nResearch and development expenses increased to $20.9 million for the second quarter of 2022 from $17.7 million for the same period in 2021 due primarily to higher-development manufacturing and restructuring costs. General and administrative expenses were $5.2 million for the second quarter of 2022, up from $4.2 million for the comparable period in 2021. Our cash balance at the end of June was $13.4 million, and accounts payable was $23.8 million. In less than two months, we've made substantial progress in reducing our operating burn rate while working with suppliers on payables and other obligations.\n\nBut as stated previously, we will need to raise cash to support ongoing operations. I want to thank you for your attention. And with that overview, I'm now going to answer several questions that we received during the annual shareholder meeting conducted back on July 28. One of the questions we received was related to MASTERS-2 trial.\n\nWe received numerous questions on the progress of the trial, how we're moving forward in relation to TREASURE potential trial design changes. I'd like to ask Dr. Mays is to provide some additional color on how this study has been progressing.\n\nRobert Mays -- Head of Regenerative Medicine and Neuroscience Programs\n\nYeah. Thanks, Dan. I appreciate it, and I appreciate everybody for calling in. As Dan mentioned earlier, the MASTERS-2 file is our primary clinical priority.\n\nAnd we continue to be excited about the positive response from the medical community, all of our principal investigators in the MASTERS-2 trial following the release of the TREASURE study readout and the subsequent key opinion leaders, stroke neurology panel that we hosted, that ingenerated a lot of excitement throughout our principal investigators and the trial sites. And I've been participating and continue to participate in grand rounds at several of the sites. They've asked me to come out to continue the momentum at the clinical sites as a function of the enthusiasm. And as a matter of fact, one of the clinical sites that has enrolled a lot of patients hosted a MASTERS-2 best practices call where over 40 participants across the MASTERS-2 investigator network called in to learn how to enroll as many patients as possible based on the success of the site that hosted the call.\n\nWe continue to expand the network of active trial sites, including key stroke centers in multiple geographies throughout the world, including Germany, the United Kingdom, Taiwan and Australia. And as we bring more sites on, we have the increased enthusiasm, we recognize we've doubled the average number of patients enrolled on a monthly basis in 2022 compared to the other years the trial has been opened. And we've also enrolled more subjects in the second quarter of 2022 than during any other quarter that the trial has been running. So we see the momentum.\n\nWe see the enthusiasm. And right now, our focus in the clinical ops team is to continue to drive that enthusiasm at all clinical sites. Dan also mentioned, we're in the process of analyzing the TREASURE data and working with our team of statisticians and the scientists here to look at the TREASURE data, go back to the MASTERS-1 data and evaluate whether we should make any changes to the MASTERS-2 trial design to enhance the probability of success. So again, I just want to state that there's a significant opportunity for patients here.\n\nAnd what we want to do is we want to make sure that if we have a powerful therapeutic like MultiStem for treatment of a serious unmet medical need like stroke, we want to ensure that we're running a trial that is set up for long-term success and eventual regulatory approval. So after we're done doing our analysis, we may engage the regulators with protocol amendments that we believe would help us reach this endpoint. And finally, I just want to comment about there's been a lot of people that have asked questions relating to when can we share the full TREASURE data set. And the way this happens when you're a publicly traded company is you have to count on the academic researchers, the academic neurologists in this case, to present the data at a scientific meeting and at which point then there is a follow-up where you have a publication that is published in a medical journal.\n\nSo Healios has recently announced that they will be giving or presenting a more complete data set at the World Stroke Conference in Singapore in late October. And so that will be the next time, I believe, will be a full data dump. Just as a side, we've been asked to present at that conference as well, so we'll see what happens here in October. So I believe that will be all for me right now.\n\nThanks, Dan.\n\nDan Camardo -- Chief Executive Officer\n\nThank you, Robert. Appreciate that. We received another question on the restructuring and financing plans. Can you provide more detail on Athersys' near-term financing strategy? What avenues of capital raising are you considering? And how long does the current cash runway takes us? So this has obviously been something that we've been talking about and have now disclosed our cash balance.\n\nWe've been focusing most of our efforts on evaluating the different capital-raising options that would be most attractive to our situation, while at the same time, working hard on reducing our expenses. And that has been kind of the balance that we've been walking. Obviously, we wanted to get to this point of our second quarter earnings disclosure. And so all of those options we feel are still in front of us, and we'll be looking to try to address our cash balance to get us out at least through the near term.\n\nOne of the things that I'm looking at is timing and potential for other options of non-dilutive funding. So it has been a bit of a balancing act before taking any action. But rest assured that we are considering every avenue to address our lower cash balance. And keep in mind that Aspire terminated the equity line that we had in place back in July, I believe it was.\n\nAnd so you'll be looking at more traditional capital raising options in the near future. And let me also to invite Kasey Rosado to comment since we specifically went out and found somebody to step in in an interim CFO overall, and Kasey has been a much needed and an appreciated member of the leadership team in the two weeks that she's been onboard. Kasey?\n\nKasey Rosado -- Interim Chief Financial Officer\n\nThank you, Dan. As Dan just mentioned, it's been just a little over a week since joining the team, so I'm still trying to get my arms around everything. But what I can say is that the organization has quickly implemented their restructuring plan and the initiatives that are kind that they launched in June, and that we are evaluating every operating cost out there, making sure that we are being -- really looking at everything with a keen eye. And as part of that, we have been in communications with our suppliers that are key to our success as we look forward into our business.\n\nSo as Dan also described, it's a part of that, it's essential that we explore all our financing options that are going to be available to us. So thank you. It's been nice, wonderful getting to know the team and shareholders, and I look forward to working with you guys.\n\nDan Camardo -- Chief Executive Officer\n\nThank you, Kasey. Let me answer a third question around following the financial strategy. If funding were to be secured this quarter, do you expect to resume the suspended MACOVIA trial for manufacturing of additional MultiStem products? Would the company focus on restarting programs or finding new avenues for building that value? So first of all, on MACOVIA, we feel like we made an appropriate decision based upon where the MACOVIA trial was. And we'll be looking for partners to advance that trial into the next phase or next cohort, whether that's through a partnership or exploring what type of partnership we might be able to achieve with the government or any other potential financial options.\n\nBut without that funding, right now, it's not something that we would be putting money behind because our focus will be on MASTERS-2 for ischemic stroke. As it relates to manufacturing, this is probably one of the most meaningful changes to our business that we've made. And I will say we're extremely happy with the partnerships that we have with our third-party contract manufacturer. They've been excellent to work with.\n\nWe've been successful together at producing MultiStem in the cell factory process, as well as now a bioreactor process that is 4x40 liter, which is the clinical product that was approved by the FDA to be used in the MACOVIA trial, as well as the MATRICS trial. So we have been very pleased with the relationship that we have with our third-party manufacturer. And for that reason, it does not make sense for us to invest at this point in our own manufacturing capabilities. And that's one of the reasons that we announced the process of looking for a sublet of the Stow facility because that is an expensive -- to build out toward a commercial level of production is an expensive journey, and we would not want to do that until we had either secured long-term financing or found a global strategic partner.\n\nSo hopefully, that's clear as a change for Athersys going forward. And I think on some of the other programs, our position will be not necessarily funding it ourselves. But as we've stated that we'll be looking for partnerships, particularly in some of the other disease areas that Dr. Mays and Dr.\n\nBusch are going to be reviewing on August 28. So hopefully, that answers the question related to MACOVIA manufacturing and the potential to restart other programs. So one last question that we received and then we can open it up to our analysts for Q&A. I did get several questions about reaching out to Dan Gilbert, who is the owner of the Cleveland Cavaliers.\n\nAnd we understand Mr. Gilbert had a stroke and is recovering from stroke. And we have made attempts to reach out to him, and we'll continue to try to make contact with him. As of tonight, we have not spoken and we have not made contact, but it is something that we are looking to try to reach out, talk to Mr.\n\nGilbert and see what opportunities there might be to either have him involved in what we're doing for ischemic stroke at with Athersys or even just to understand his story and the challenges that he's been overcoming since he suffered a stroke. So I wanted to answer that question as well. OK. So I want to thank, really, all shareholders that submitted those questions during our annual shareholder meeting.\n\nAnd now, I'll turn the call back to our operator for additional Q&A.\n\nOperator\n\n[Operator instructions] Your first question is from the line of Greg Harrison with Bank of America.\n\nMay Kate Davis -- Bank of America Merrill Lynch -- Analyst\n\nGood afternoon, this is Mary Kate on for Greg. Thanks for taking our questions. Maybe when deciding on how to prioritize resources, what necessarily tip the scales in favor of stroke, which is the primary endpoint in two studies versus ARDS where there are two positive studies?\n\nDan Camardo -- Chief Executive Officer\n\nThank you. I appreciate the question. What I would tell you is that we feel like we have significant data on stroke, right, between MATRICS-1, between TREASURE, the size of the trials and really the totality of the data, which is what we've been trying to communicate since the TREASURE data results were announced. And it did not meet its primary endpoint of X1 outcome at 90 days.\n\nHowever, there is significant data that we feel demonstrates MultiStem's benefit compared to placebo or a series of other measures that were all prespecified and would be very valuable for stroke patients. And so that's really one of the main reasons why we've decided that focusing on MASTERS-2 as a Phase 3 trial. And based on where we were in our progress with MASTERS-2, as well as on MACOVIA, for instance, there was just a natural suspension point that made sense before we transition into the newer bioreactor products. So hopefully, that makes sense.\n\nAnd trust me, these are difficult decisions. We would like to be supporting a lot of trials for MultiStem and difference diseases. But I think that's one of the biggest changes that we're making is we're really going to be smart with how we're using our resources, and these are the type of decisions that we have made.\n\nMay Kate Davis -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nDan Camardo -- Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nAt this time, there are no further questions. I will now hand the call back over to the presenters for any closing remarks.\n\nDan Camardo -- Chief Executive Officer\n\nOK. Thank you very much for those questions and the ones we received from the shareholder meeting. I trust you share our enthusiasm for the future of of Athersys, the MultiStem platform and our road map for success, which is a bit different than maybe what was happening prior to the last two months. We look forward to speaking with everyone again on August 29 for our research review webinar, and again, when we report third quarter results.\n\nAnd as we continue to execute on our plan, we will obviously keep everyone informed of our progress. I want to thank everyone for their loyal support of Athersys as we've gone through these changes. I feel we're heading in the right direction. We have some immediate challenges in front of us as we try to square up our balance sheet and look to conduct some type of financing or identify partners.\n\nBut we are working hard, and we will share progress as we achieve our goals. So thank you very much for listening to the call, and I hope everyone has a nice evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEllen Gurley -- Manager of Corporate Communications and Investor Relations\n\nDan Camardo -- Chief Executive Officer\n\nRobert Mays -- Head of Regenerative Medicine and Neuroscience Programs\n\nKasey Rosado -- Interim Chief Financial Officer\n\nMay Kate Davis -- Bank of America Merrill Lynch -- Analyst\n\nMore ATHX analysis\n\nAll earnings call transcripts"
}