{
  "companyName": "Take-Two Interactive",
  "companyTicker": "TTWO",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/take-two-interactive-ttwo-q1-2023-earnings-call-tr/",
  "content": "Take-Two Interactive (TTWO 2.75%)\nQ1 2023 Earnings Call\nAug 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to Take-Two's first quarter fiscal year 2023 conference call. [Operator instructions] As a reminder, this conference is being recorded. I would now like to turn the conference over to your host, Nicole Shevins, senior vice president of investor relations and corporate communications.\n\nNicole Shevins -- Senior Vice President of Investor Relations and Corporate Communications\n\nGood afternoon. Thank you for joining our conference call to discuss our results for the first quarter of fiscal year 2023 ended June 30, 2022. Today's call will be led by Strauss Zelnick, Take-Two's chairman and chief executive officer; Karl Slatoff, our president; and Lainie Goldstein, our chief financial officer. We will be available to answer your questions during the Q&A session following our prepared remarks.\n\nBefore we begin, I'd like to remind everyone that statements made during this call that are not historical facts are considered forward-looking statements under federal securities laws. These forward-looking statements are based on the beliefs of our management, as well as assumptions made by and information currently available to us. We have no obligation to update these forward-looking statements. Actual operating results may vary significantly from these forward-looking statements based on a variety of factors.\n\nThese important factors are described in our filings with the SEC, including the company's most recent annual report on Form 10-K and quarterly report on Form 10-Q, including the risks summarized in the section entitled Risk Factors. I'd also like to note that, unless otherwise stated, all numbers we will be discussing today are GAAP, and all comparisons are year over year. Additional details regarding our actual results and outlook are contained in our press release, including the items that our management uses internally to adjust our GAAP financial results in order to evaluate our operating performance. Our press release also contains a reconciliation of any non-GAAP financial measure to the most comparable GAAP measure.\n\nIn addition, we have posted to our website a slide deck that visually presents our results and financial outlook. Our press release and filings with the SEC may be obtained from our website at take2games.com. And now, I'll turn the call over to Strauss.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nThanks, Nicole. Good afternoon, and thank you for joining us today. I'm pleased to report that fiscal 2023 is off to a great start, highlighted by first quarter net bookings of $1 billion. Our performance demonstrates the quality of our games and our ability to engage audiences across the globe, despite the impacts of various macroeconomic and geopolitical factors.\n\nThis has been a milestone period in the history of our company, as we closed our combination with Zynga. This transaction firmly establishes Take-Two's position as one of the largest pure-play interactive entertainment companies in the world. We are home to the industry's top creative talent, and we own and control an exceptional, diverse portfolio of intellectual properties encompassing all key platforms and genres. We are exceedingly optimistic about the long-term growth potential for the mobile industry, as well as our ability to create greater shareholder value, as a combined entity.\n\nOver the past few months, we have made significant progress in our integration efforts. Zynga, which is being run by the label's President, Frank Gibeau, established its ongoing leadership structure. Alongside Frank, we are fortunate to have numerous, proven senior executives who will be instrumental in overseeing Zynga's day-to-day operations and taking our combined mobile business to the next level of success. The integration of our corporate functions and systems has been tracking well, and we are pleased that our day-one plans were executed seamlessly, with no disruptions to our business operations or player communities.\n\nWhile it's still early, we are confident that we can realize $100 million of annual cost synergies within two years post-close and we are exploring additional areas of efficiencies. Our creative teams are in active discussions about potential projects, and we remain committed to delivering over $500 million of annual net bookings opportunities over time. There are several meaningful drivers in mobile that we believe our teams can begin to activate this fiscal year, including implementing new bold beats, driven by new content and other live-service enhancements; user acquisition optimization; creating a centralized library for development technologies and tools; enhancing the monetization of in-game advertising; and continuing to invest in our adtech platform with Chartboost. Over the intermediate and long term, our vision is to introduce mobile games for some of our most popular and proven intellectual properties that have the potential to be greatly additive to our financial profile.\n\nWe have observed positive signs that some mobile players are looking for more sophisticated and immersive content, and we look forward to participating in this trend that should continue for the foreseeable future. We also see a tremendous opportunity to establish a more meaningful presence in key mobile-first emerging markets. Turning to our first quarter results, on a pre-combination basis, our net bookings of $731 million were within our previously stated outlook range, led by the outperformance of NBA 2K22 and WWE 2K22. Zynga's offerings complemented our results significantly for the period.\n\nNBA 2K22 continued to dominate as the industry's leading basketball game, with sell-in of over 12 million units to date, exceeding the series' sell-in from the prior year. During the first quarter, engagement with the title remained strong, with average games played per user increasing 16% year over year. In addition, NBA 2K22 Arcade Edition remains the No. 1 game on Apple Arcade since its launch in October 2021, and downloads of NBA 2K Mobile remained robust, driven by the Courtside Pass updates and content surrounding the NBA Playoffs and Finals.\n\nOur partnership with the NBA remains incredibly strong and we look forward to the launch of NBA 2K23 in September. Throughout the first quarter, 2K and Visual Concepts released a series of DLC packs to support WWE 2K22, which brought even more fan-favorite superstars into the ring for what has been hailed by critics and consumers alike as our best WWE offering in the series. Engagement with the title has been outstanding, with more than 330 million in-game matches played and over 8.5 million hours of WWE 2K22 content viewed on Twitch. We greatly value our partnership with the WWE and are thrilled about the long-term opportunity to grow the franchise further together.\n\nRockstar Games capitalized on the momentum from last quarter's releases of Grand Theft Auto V for PlayStation 5 and Xbox series X/S, Grand Theft Auto Online stand-alone, and the launch of GTA+, as the experience continues to captivate players. Latest generation console players of Grand Theft Auto Online grew over 40% this quarter and are monetizing at a rate 36% higher than players on the previous generation. GTA+, the premium membership available exclusively on those consoles, has seen consistent growth since launch. The GTA Online community remains strong, and its audience size is operating at a new normal that is 49% higher than the pre-pandemic first quarter of fiscal 2020.\n\nSales of Grand Theft Auto V also remained strong, and to date, the title has sold-in nearly 170 million units. With development of the next entry in the Grand Theft Auto series well underway, the Rockstar Games team is determined to once again set creative benchmarks for the series, our industry, and for all entertainment, just as the label has done with every one of their frontline releases. We were pleased with the performance of Red Dead Redemption 2, which continues to expand its audience and, to date, has sold-in more than 45 million units worldwide. Tiny Tina's Wonderlands exceeded our expectations and continued to sustain healthy player engagement, due in part to its robust post-launch content, which will continue throughout the fiscal year.\n\nThe title has resonated with core fans and new audiences, with nearly 40% of players having never before played a Borderlands title. Additionally, Tiny Tina's Wonderlands launched on Steam in June alongside its previously released DLC offerings. Also in June, 2K and Supermassive Games launched The Quarry, an all-new horror narrative game, where every choice, big or small, shapes your story and determines who lives to tell the tale. The title launched to strong reviews, with NPR declaring it \"this summer's best horror game,\" and Variety calling it \"every horror fan's dream video game.\" And, Private Division released Void Riders, the first expansion for their critically acclaimed skateboarding action title, OlliOlli World, from Roll 7.\n\nThe expansion earned an 87 on OpenCritic, which was even higher than the base game's excellent review scores. Private Division will share more details regarding the game's second expansion later this year. Recurrent consumer spending rose 48% and accounted for 73% of net bookings. This was significantly above our prior guidance due to the inclusion of Zynga for part of the quarter, which was not included previously, as well as outperformance from our core portfolio.\n\nDuring the period, Zynga continued to experience strength in player engagement and retention, and we believe that we are maintaining our healthy market share on a global basis. Additionally, we delivered significant growth in advertising net bookings, which was offset by some pressure on in-app purchases due to current macroeconomic conditions and seasonality. Some key highlights of our mobile offerings during the quarter include: Harry Potter: Puzzles & Spells featured an in-game event to celebrate the cinematic release of \"Fantastic Beasts: The Secrets of Dumbledore.\" Empires & Puzzles introduced the game's fifth season, Dynasty of Dunes. Zynga Poker released the Omaha update, giving players a new way to enjoy the popular game.\n\nWords With Friends introduced Clubs, a new feature that expands the game's social experience by offering shared spaces that players can enjoy together. Rollic launched 11 games in the quarter and Colors Runners! reached the No. 1 top free downloaded games position in the U.S. App Store in June.\n\nTurning to our outlook, we now expect to deliver net bookings of $5.8 billion to $5.9 billion, which includes Zynga for part of the year. Our pipeline for the year continues to look very strong, and we are excited to expand significantly our mobile presence with a best-in-class platform. Our new forecast also takes into account some movement in our release slate for the year, foreign currency pressures, and macroeconomic uncertainty. Lainie will provide more details shortly.\n\nLooking ahead, our long-term vision is clearer than ever, and we believe that our combination with Zynga will enable us to capitalize better on the evolving dynamics of the interactive entertainment industry. As we deliver our expansive, diverse pipeline and pursue the vast opportunities that we have identified through our combination with Zynga, we see a path to engage even greater audiences around the world, grow our scale, and enhance our margins. I will now turn the call over to Karl.\n\nKarl Slatoff -- President\n\nThanks, Strauss. I'd like to begin by thanking our teams for a great start to the year, driven by their tireless passion, creativity, and commitment to deliver the best entertainment experiences in the world. I'll now discuss our recent releases. On July 7, 2K and Supermassive Games launched an update to the popular horror experience, The Quarry, which introduced several new features, including Wolfpack, a new online multiplayer mode where the host can invite other players to help shape the story as a collaborative group.\n\nIn addition, all six episodes of the Bizarre Yet Bonafide podcast featured in The Quarry are now available in-game and in their entirety. The podcast, which was previously available only on select streaming platforms, follows two fictional paranormal investigators as they delve into the troubling secrets of The Quarry. On July 19th, 2K and Visual Concepts released the fifth and final DLC pack for WWE 2K22, entitled \"The Whole Dam Pack.\" The update features pop-culture icon Machine Gun Kelly, social media megastar Logan Paul, and high-flying, hard-hitting WWE Hall of Famer Rob Van Dam, alongside franchise debuts from LA Knight, Xia Li, Commander Azeez, and Sarray. We are very proud to have delivered such a stellar WWE offering this year and to support the title with our fans' most beloved superstars.\n\nOn July 26th, Rockstar Games continued to grow and evolve the world of Grand Theft Auto Online across all platforms with the launch of The Criminal Enterprises, a sweeping update bringing new business prospects for Criminal Careers, plus new, elaborate Contact Missions, auto showrooms to test drive and purchase vehicles, and many other upgrades rolling out all summer long. The update also delivers highly requested experience improvements, as well as increased payouts across a range of gameplay, offering players more choices and freedom as they climb their way up the criminal ranks. We remain incredibly excited about our pipeline for fiscal 2023 and beyond. On August 16th, Private Division and Roll7 will release Rollerdrome, a brand-new third-person, single-player shooter.\n\nThis stylish, high-octane game combines adrenaline-fueled skate stunts with intense combat in a retro-futuristic world. The title will be available on Steam and for PlayStation Plus members for an introductory price just under $20, after which it will retail for $29.99. Additionally, PlayStation Plus Premium members will be able to play a free trial of the game when it launches. On September 9th, 2K and Visual Concepts will launch NBA 2K23, the next offering from our industry-leading NBA series.\n\nPhoenix Suns' shooting guard, three-time NBA All-Star, and 2021-22 Kia All-NBA First Team selection, Devin Booker, is featured on this year's Standard Edition and cross-gen Digital Deluxe Edition. The Iconic Michael Jordan appears on the cover of the NBA 2K23 Michael Jordan Edition and the brand-new NBA 2K23 Championship Edition, which retails for $149.99 and delivers incredible value by including a 12-month subscription to the NBA League Pass for the first time. In the U.S. and Canada, players can purchase the WNBA Edition as a GameStop exclusive, featuring Phoenix Mercury superstar Diana Taurasi, along with Seattle Storm legend Sue Bird.\n\n2K has partnered with Every Kid Sports to support greater representation of females in basketball with a $100,000 donation that will enable girls across the U.S. to participate in youth sports. 2K will reveal more details of NBA 2K23 in the coming weeks. We have made the decision to move back the launch timing of Marvel's Midnight Suns to ensure the teams at Firaxis Games and 2K deliver the best possible experience for our fans.\n\nThe title will launch later this fiscal year on Windows PC, Xbox Series X|S, and PlayStation 5. The Xbox One, PlayStation 4, and Nintendo Switch versions will follow at a later date. During the fourth quarter, Private Division and Intercept games will launch Kerbal Space Program 2 on PC. The game's dedicated community can look forward to more information about the game and its new features from the title's ongoing gameplay reveal video series.\n\n2K's teams at Visual Concepts and HB Studios remain hard at work on their upcoming launches of WWE 2K23 and PGA TOUR 2K23. 2K will have more to share on these annual sports offerings shortly. Zynga has a handful of games that are currently in soft launch, with more on the horizon, and we expect some of these titles will begin launching worldwide in our next fiscal year. This includes Star Wars Hunters, which is continuing to regularly roll out new content updates and features as it progresses through to a more mature phase of soft launch in strategic territories.\n\nAt the same time, Rollic will continue to release a high volume of mobile titles as it has done previously. Turning to eSports, the NBA 2K League Championships tip off will take place in Indianapolis at the Pavilion at Pan Am, with 3v3 play August 17th through the 20th, and 5v5 play August 24th through the 27th. We remain excited about the continued success and growth of the NBA 2K League. In closing, we believe that our company today is the strongest and most diverse it has ever been.\n\nWith approximately 11,000 of the industry's best and brightest talent, the most exciting and commercially successful portfolio of owned intellectual property, and the ability to deliver deeply captivating and engaging entertainment experiences on any platform anywhere in the world, we believe that we are well-positioned to deliver long-term value for our shareholders. I'll now turn the call over to Lainie.\n\nLainie Goldstein -- Chief Financial Officer\n\nThanks, Karl, and good afternoon, everyone. Today, I'll discuss the key highlights from our first quarter before reviewing our financial outlook for the fiscal year 2023 and second quarter. Please note that our first quarter results include Zynga's financial performance for 39 days of the quarter, which impacts the comparability of our results relative to last year, as well as to our prior guidance, which did not include the contribution from Zynga. Also, any references to Take-Two's pre-combination results are referring to our financial performance, excluding the acquired Zynga business.\n\nAdditional details regarding our actual results and outlook are contained in our press release. As Strauss mentioned, this was a momentous quarter for our organization as we closed our transaction with Zynga and made significant progress on our integration efforts. Our teams created detailed plans to realize at least $100 million of annual cost synergies and we continue to expect approximately $50 million to be achieved within the first twelve months post-close. The largest opportunities include reducing duplicative corporate overhead and contracts, consolidating systems, rationalizing our real estate footprint, and leveraging Zynga's marketing functions across our other mobile titles.\n\nWe are also exploring additional areas of efficiencies. At the same time, we delivered strong first quarter results, driven by net bookings of $1 billion. On a pre-combination basis, our net bookings were $731 million, which grew 3% compared to last year and was within our guidance range of $700 million to $750 million. The movement in foreign currency exchange rates negatively impacted our net bookings by approximately 1%.\n\nWe were also pleased with Zynga's contribution for part of the quarter. With consumers today navigating various macroeconomic and geopolitical factors, we believe that our financial performance truly demonstrates the resiliency of our business model, driven by the incredible quality of our games and the significant value that our interactive entertainment experiences provide our players. During the period, recurrent consumer spending rose 48% and accounted for 73% of net bookings. This was significantly above our prior guidance due to the inclusion of Zynga for part of the quarter, as well as the outperformance of our pre-combination portfolio, led by NBA 2K22, Tiny Tina's Wonderlands, and Top Eleven.\n\nDigitally delivered net bookings increased 41% and accounted for 95% of the total. During the quarter, 77% of console game sales were delivered digitally, up from 73% last year. GAAP net revenue increased 36% to $1.1 billion, and cost of revenue increased 32% to $436 million, which included a $20 million impairment charge related to our decision not to proceed with further development of a title from an unannounced new franchise. Operating expenses increased by 125% to $704 million, primarily driven by the addition of Zynga and a full quarter of Nordeus, business acquisition costs and higher personnel and marketing expenses.\n\nAnd our GAAP net loss was $104 million, or $0.76 per share, which was largely impacted by $117 million of amortization of acquired intangibles and $165 million of business acquisition costs. Our GAAP net loss benefited from a reversal of expense of approximately $48 million related to forfeitures of previously granted stock awards. In the first quarter last year, our GAAP net income was $152 million, or $1.30. Our management tax rate for the period was 18% as compared to 16% in the prior year as a result of our combination with Zynga.\n\nOn a pre-combination basis, our management results, excluding the impacts of the Zynga transaction, exceeded the high end of our guidance range by $0.06, despite the impairment charge taken during the quarter and the higher tax rate. We ended the quarter with over $1.3 billion of cash and short-term Investments and $3.3 billion of debt. Turning to our guidance, I'll begin with our full fiscal year expectations. As Strauss mentioned, we are initiating new guidance that includes our combination with Zynga for approximately 10 months of our fiscal year.\n\nWe now expect to deliver net bookings of $5.8 billion to $5.9 billion. Our assumptions take into consideration some shifts in our pipeline for the year, as well as movement in foreign exchange rates and the uncertain macroeconomic backdrop. The largest contributors to net bookings are expected to be NBA 2K, Grand Theft Auto Online and Grand Theft Auto V, Empires & Puzzles, Rollic's hyper casual mobile portfolio, Toon Blast, and Red Dead Redemption 2 and Red Dead Online. We expect the net bookings breakdown from our labels to be 45% Zynga, which includes our former T2 mobile titles, 37%, 2K; 17%, Rockstar Games; and 1%, Private Division.\n\nWe forecast our geographic net bookings split to be about 60%, United States; and 40%, international. We now expect recurrent consumer spending to grow by approximately 110% and represent 77% of total net bookings. Our digitally delivered net bookings are expected to grow by approximately 80% and represent 96% of net bookings. Our forecast assumes that 74% of console game sales will be delivered-digitally, up from 68% last year.\n\nWe expect to generate more than $700 million in non-GAAP adjusted unrestricted operating cash flow, and we expect to deploy approximately $135 million for capital expenditures. We expect GAAP net revenue to range from $5.73 billion to $5.83 billion and cost of revenue to range from $2.74 billion to $2.79 billion, which includes approximately $700 million of amortization of acquired intangibles. Total operating expenses are expected to range from $3.37 billion to $3.38 billion as compared to $1.5 billion last year. This increase reflects the inclusion of Zynga; business acquisition costs; and higher personnel, marketing, and IT expenses, which is slightly offset by our anticipated cost synergies for the year.\n\nAnd we expect a GAAP net loss ranging from $398 million to $438 million, or $2.50 to $2.75 per share, which assumes a basic share count of 159.2 million shares. We expect our management tax rate to be 18% throughout the year. Now, moving to our guidance for the fiscal second quarter. We project net bookings to range from $1.5 billion to $1.55 billion, compared to $985 million in the second quarter last year.\n\nThe largest contributors to net bookings are expected to be NBA 2K, Grand Theft Auto Online and Grand Theft Auto V, Empires and Puzzles, Rollic's hyper casual mobile portfolio, and Toon Blast. We project recurrent consumer spending to grow approximately 85% and digitally delivered net bookings to increase approximately 70%. Our forecast assumes that 73% of console game sales will be delivered digitally, up from 65% last year. We expect GAAP net revenue to range from $1.37 billion to $1.42 billion and cost of revenue to range from $700 million to $719 million, which includes approximately $200 million of amortization of acquired intangibles.\n\nOperating expenses are expected to range from $849 million to $859 million. At the midpoint, this represents a 125% increase over last year. This increase reflects the inclusion of Zynga and business acquisition costs, as well as higher marketing and personnel expenses, which we believe will be slightly offset by the realization of some of our anticipated cost synergies. And GAAP net loss is expected to range from $144 million to $160 million or $0.86 to $0.96 per share, which assumes a basic share count of 166.4 million shares.\n\nIn closing, we had a great start to the year, and we believe that our combination with Zynga will enhance our positioning as one of the top interactive entertainment companies in the world. As our teams continue to leverage the core competencies from Zynga's publishing platform, we believe that we will be able to engage our player base more deeply, add new dimensions to our existing portfolio, and deliver significant long-term growth and margin expansion for our shareholders. Thank you. I'll now turn the call back to Strauss.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nThanks, Lainie and Karl. On behalf of our entire management team, I'd like to thank our colleagues for delivering an excellent start to the year. And to our shareholders, I want to express our appreciation for your continued support. We'll now take your questions.\n\nOperator?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Eric Handler with MKM Partners. Please proceed with your question.\n\nEric Handler -- MKM Partners -- Analyst\n\nGood evening, and thanks for the question. Two questions. First, Lainie, I wonder if you could sort of size the changes in guidance in terms of how we might have been thinking about Marvel's Midnight Sun versus what's changed with FX and macro.\n\nLainie Goldstein -- Chief Financial Officer\n\nSo for the difference in the pre-combination business, we had some shifts in the pipeline for the year. And then there was a movement in the foreign exchange rates. And then there's also the uncertain macroeconomic backdrop. So I would say that the shifts in our pipeline were the most meaningful to our numbers.\n\nSo I would say we had some titles that moved within the year. And that was Marvel Midnight Sun's and then there was an unannounced title that moved out of the year as well. So I would say definitely the pipeline changes that were the most -- to the change in the guidance.\n\nEric Handler -- MKM Partners -- Analyst\n\nGreat. Thank you. And then, Strauss, I wondered if you could talk a little bit about the state of the mobile industry right now. There has been a little bit of headwinds with growth for the industry in this year.\n\nAnd wondering as you look at Zynga's portfolio and combining it with your portfolio, how fast can you integrate sort of the ad network? Are things changing relative to what you were thinking maybe at the time the acquisition closed or maybe even when you first made the acquisition?\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nThanks, Eric. There's a lot there. We are seeing some softness in the mobile market. The good news is, I think we're doing better than most, if not all.\n\nAnd I think we're seeing an offsetting increase in our market share. I think the reason we're seeing probably a bit more softness in mobile than in console is in console to participate you have to buy. And in mobile, by definition, you're in a free-to-play environment. You can play without paying if you are feeling the pinch of inflation, specifically with regard to nondiscretionary expenditures like fuel and food, you could imagine that if you're playing the game, you might choose to spend a bit less or spend a bit less frequently.\n\nThat said, we think Zynga's highly diverse portfolio of terrific games is a meaningful offset. And as I said, I think we're outperforming the market. That's our belief. We're also seeing growth in advertising revenues.\n\nAnd because I think we under-index in advertising, that's an opportunity that will be offsetting to the broader market, even if we see ongoing softness. But as you know, we always call it the way we see it. And what we're seeing is overall some softness in the marketplace. When you have 50% of big bank economists saying we think we might be in a recession in the next quarter or two, my attitude is the market believes we're in a recession right now.\n\nAnd as a consumer-facing company, we are seeing some softness. With regard to the integration, I'm not sure you asked about how it's going, but it's going really well. And we expect to meet or exceed our cost synergy expectations, both in terms of magnitude and timing. And more importantly, we fit really well together culturally.\n\nAnd I think all of us at Zynga and now all of us at Take-Two are very excited about the combination of the way things are going and how well the teams do fit together. And we had a sense of that during the diligence period, but it's always nice to know post closing that that's the case. And I think you alluded to whether we can sort of create one broader integrated platform. As you know, Take-Two Mobile Games has been folded into the Zynga division, which is operated by Frank Gibeau and his team highly independently, and one of their key priorities is to create an integrated platform that will bring the best out in all of our games.\n\nSo enhance our acquisition and enhance our conversion, enhance our retention, enhance our lifetime value, and also enhance, as I said, our advertising revenue. Zynga has a proprietary adtech platform, driven by their Chartboost division. And we're excited about what that can bring to Zynga and also bring to all of Take-Two.\n\nOperator\n\nOur next question comes from Matthew Thornton with Truist Securities. Please proceed with your question.\n\nMatthew Thornton -- Truist Securities -- Analyst\n\nHey, good afternoon. Thanks for the question. Maybe two, if I could. First one, Lainie, I've been wondering if you'd be able to give us what the RCS percentage of bookings was for legacy Take-Two for the quarter.\n\nI think it was 73% total with Zynga. I'm curious kind of what that number was without the quarter. And then just secondly, Strauss, any movement in the out-year pipeline if we think about how things are progressing and developing. I guess what's your general sense about progress maybe when we last talked three months ago, that would be helpful.\n\nThank you.\n\nLainie Goldstein -- Chief Financial Officer\n\nIn terms of the RCS for the pre-combination, we're not really breaking that out anymore. We're really looking at the business overall as one business. But I can tell you that we did outperform NBA 2K 22, Tiny Tina's Wonderland and top 11 versus our guidance for the quarter. So those three titles did better than we had expected.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nAnd in terms of the pipeline, yes, as Lainie mentioned, we did have a number of titles that have effect that has been shifting around that affected our pipeline and some of our results for fiscal '23. Generally speaking, we obviously don't take these shifts lightly. We have seen them before. The most important thing for us is always to put up the best game we possibly can because that's what builds franchise value and ultimately, that's what drives the success of our organization.\n\nSo it's worth the wait. Typically, that is the best economic decision that we can make. And I would say that I'd characterize the pipeline shifts as well these things do move around and you may have -- that may affect a specific year. It does -- hasn't really changed at all our overall perspective on the growth in the intermediate and long term.\n\nOperator\n\nOur next question comes from Matthew Cost with Morgan Stanley. Please proceed with your question.\n\nMatthew Cost -- Morgan Stanley -- Analyst\n\nHi, everyone. Thanks for taking the questions. I have two. So I guess just kind of following up on the Chartboost point.\n\nI think you mentioned in the prepared remarks and then just now in the Q&A about leveraging those marketing capabilities inside Zynga across other titles. I guess what are you envisioning that looks like? And is that something that can be used to promote titles or cross-promote titles on PC and console in addition to mobile? And then just on the commentary, I think, in the press release about the $500 million of synergies now that you kind of have your hands dirty, you've gotten under the hood with Zynga, do you have a sense of how long it will take to establish feasibility and start working through those projects to get a sense of how long they might take? Is it a five-year process to get those done? What might that timing look like? Thank you.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nThanks. Look, I think to the extent that Zynga succeeds in building a robust adtech platform, then it will affect all of our live services businesses, not just Zynga's live services businesses. And we're really optimistic about that. To be clear, we haven't baked any of that into our cost synergy expectations.\n\nAnd as you know, we've not included our revenue synergy expectations in our forward-looking projections. So that's all upside if we're able to achieve that. But I feel very good about the exercise. And yes, we'll cross over to the entire company's live services offerings.\n\nIn terms of the timing for new projects, very hard to call that now. There's a lot of excitement internally. We're working on a lot of interesting potential ideas. And certainly, the development for mobile is much quicker than it is for console.\n\n-- but it would be premature to state in a particular time. And of course, all product announcements do come from our labels.\n\nOperator\n\nOur next question comes from Mario Lu with Barclays. Please proceed with your question.\n\nMario Lu -- Barclays -- Analyst\n\nGreat. Thanks for taking the questions. Great. The first one is just a follow-up on the full year guidance, the updated one with Zynga.\n\nI was hoping if you could help kind of clarify what items are kind of moved around within the Zynga side. I know that Star Wars: Hunters got pushed back. It sounds like macro weakness deepened a little bit. So any other color you can provide in terms of the Zynga side would be great.\n\nLainie Goldstein -- Chief Financial Officer\n\nSure. There were some movements in their pipeline. There were some changes in the FX rate. The Russia sales were removed from their financials.\n\nAnd then also, there was some overall ad market that the ad market has experienced some pressure. So those are most of the changes that we saw in our numbers over the last few months.\n\nMario Lu -- Barclays -- Analyst\n\nOK. And then a follow-up on the recurring consumer spending. I just wanted to make sure for mobile advertising revenue, that's all included, right, in RCS? Or is that categorized somewhere else?\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nYes. It is, indeed.\n\nOperator\n\nOur next question comes from Doug Creutz with Cowen. Please proceed with your question.\n\nDoug Creutz -- Cowen and Company -- Analyst\n\nYeah. First, I was just wondering if you're willing to share what Zynga's pro forma rev would have been for the entire quarter. And then secondly, Google is implementing some advertising formatting changes. And there's been some speculation that this could negatively impact the hyper casual ad business.\n\nJust wondering what your take is on that. Do you see any risk there -- you think you can manage through? Thanks.\n\nLainie Goldstein -- Chief Financial Officer\n\nSo we're going to manage their business as one combined entity. So therefore, we're not going to break out the Zynga piece for the quarter. So it's not been our practice to break out our results for the -- with our prior acquisitions. So we're not going to do that here as well.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nAnd with regard to a change in ad formats with Google, I don't have a point of view yet about how that may or may not affect us. I would say we're not concerned at the moment.\n\nDoug Creutz -- Cowen and Company -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question comes from Omar Dessouky with Bank of America. Please proceed with your question.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nTwo questions. So just a little bit of clarification on the business plan for Chartboost specifically. Could you clarify whether you're intending to turn that into a third-party broker advertising network that cross promotes third-party games on third-party ad inventory similar to companies like ironSource, AppLovin, or Unity. Or it's more of an internal advertising technology tool? That's my first question.\n\nKarl Slatoff -- President\n\nSo in terms of Chartboost, Chartboost does actually deals third parties today. We certainly haven't announced any changes. But that is one area that we're very excited about. Look, the bigger the business is, the more valuable the platform is going to be.\n\nIt's going to be certainly valuable from a tech perspective internally. But we think it's a great product and whether or not it's got great growth prospects to the third-party market remains to be seen, but that's certainly something that we're -- that is under consideration.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nThank you very much. And then the second question is with regards to the mobile game market and specifically the Zynga assets. If you think about what your outlook for the growth in the expense base was in January when you announced the acquisition versus what you're guiding today, is it about the same? Is it significantly lower given that in the first half, the mobile video game market seems to have not performed terribly well?\n\nLainie Goldstein -- Chief Financial Officer\n\nIn terms of the changes in the -- in our guidance, it's -- when we're looking at our opex, there's an increase in terms of our expenses from Zynga, but then also in terms of against our guidance. We have some lower marketing and some lower headcount expenses due to less new hires due to timing. So that's the big changes between our operating expenses between this guidance and last guidance.\n\nKarl Slatoff -- President\n\nAnd on the revenue side, there are -- obviously, there are some things that happen in the short term that Lainie and Strauss have always spoken about that can affect what our expectations are, where they are today in the short run versus where they were in January. But overall, our mid- to long-term prospects, growth prospects for the business have not changed. We're still very excited about the prospects.\n\nOperator\n\nOur next question comes from Martin Yang with Oppenheimer. Please proceed with your question.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nHi. Thank you for taking my question. My first question is on your investments into the development resources in the future. Can you maybe talk about your plan for mobile or for Zynga, particularly versus rest of more PC and console facing part of Take-Two in terms of headcount increase or any other support infrastructure you have in plan after integration?\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nI think the good news is that we have a very robust team now. We have 11,000 colleagues around the world. And we have the ability to pursue a very ambitious program of development and publishing. And at the same time, we're a growth business, and we expect to continue to grow.\n\nSo we don't have expectations that we will significantly increase our headcount anytime soon. At the same time, assuming we grow in the way we expect to, and we have an expectation to grow very significantly in the next three years, I assume we will increase our development headcount somewhat.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nThank you. One more question, if I may. Can you maybe give us more details on the pipeline shift in Take-Two? Are there more conventional reasons like the game is not ready? Or is there any macro factors play into that decision in terms of you feel that market isn't ready for the game, you want to wait until the broader consumer spending environment becomes more friendly to the games released?\n\nKarl Slatoff -- President\n\nYeah. I mean, it really is simply that the game is -- to the extent that we're moving games -- shifting later, which is when we have pipeline shifts, that's typically the case. We typically don't move games up. But that is really based on where the game is in development.\n\nWe would not hold a game that's ready to release based on any overall economic trend or something going on in the market. Potentially, we would maybe move a game a week or two, depending on -- for marketing windows. But generally speaking, when the game is ready, that's when we release it.\n\nOperator\n\nOur next question comes from Brian Fitzgerald with Wells Fargo. Please proceed with your question.\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nHi. A couple of quick ones. Maybe rifting on that macro theme. For a long time, we've accepted the narrative that gaming spend is really resilient in a recession because of the low cost per hour of entertainment.\n\nBut at the same time, the model has shifted toward digital and RCS. Strauss, you hit upon mobile consumer discretionary, mobile advertising. How resilient do you think overall RCS consumer, PC would be if we came into more of a macro environment? It seems that would be a little more resilient than free-to-play type of models on the mobile side. And then a quick follow-up, kind of an odd question.\n\nDoes your PGA Tour business, is it seeing any impact from the Live Tour and the noise around that? Thanks.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nSo on your first point, I've been asked about the potential impact of the recession on our business since I started with these conference calls some 15 years ago. And over and over again, I said I don't believe the entertainment business is recession proof or even necessarily recession resistant. And I think we're seeing now the decline in consumer spending and increase in inflation will have an impact on the industry. You've seen it from our report today and from our competitors' reports as well.\n\nI think conceptually, the impact is probably greater on free-to-play for the reasons that I said earlier in the call, that you can play those titles without spending money. And you may just decide to spend less frequently or less in aggregate. With regard to the console experience, you have to buy the game to play. And so I think if you want the title, you're going to buy it.\n\nAnd as you point out, it's a very good value for consumers. And on your second point, no, we haven't seen any impact on our ongoing sales or engagement with PGA Tour based on, as you put it, the noise around this new offering.\n\nOperator\n\nOur next question comes from Matti Littunen with Bernstein. Please proceed with your question.\n\nMatti Littunen -- Bernstein -- Analyst\n\nHello. Good evening. A question on IDFA. Now you pointed out your outperformance on mobile.\n\nNow I was just wondering if the Chartboost stacked at Zynga would have helped you perhaps navigate some of the headwinds that some of your mobile peers have pointed out in regard to IDFA. So could that user acquisition advantage maybe help there with the outperformance? And then just to check on that macro pressure on the business. Are there any interesting geographic trends in terms of differences, for example, between the U.S. market and elsewhere, as you look at those macro headwinds you're seeing so far this year? Thank you.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nLook, the change in IDFA is the new reality. And we've been operating within that new reality for some time. I do think that our massive consumer database gives us a benefit in that we have all kinds of in-house proprietary information that will help us with our marketing. I do think that the adtech platform that Zynga has and is building further, including Chartboost, will help us, as I said earlier, do even better.\n\nI don't -- I'm really not concerned about this post-IDFA world. And in terms of the macro trends, no, the world tends to kind of move in lockstep on an economic basis. So we don't see any particular geographic changes that meaningfully influence our company.\n\nOperator\n\nOur next question comes from Eric Sheridan with Goldman Sachs. Please proceed with your question.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks for allowing me to ask a question. Maybe I'll ask a big-picture one. Strauss, we're coming up on the beginning of the third year of this console cycle at the end of this year. Any thoughts about what you've seen from new console adoption and what it's meant for overall gaming habits among your users? And how do you think longer term about aligning some of your more interesting content until we get much deeper into the penetration curve because this console cycle has been very different because of elements around the supply chain dynamic.\n\nThanks so much.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nI think you nailed it. It's hard to call what's going on because it would normally be early three years in, but it has been because of the incredible supply constraints. What we have seen though is when people are buying new consoles, they're highly engaged. So the users, for example, of GTA 5 who are on NuGen are much more engaged than prior gen users.\n\nNow that may simply be because they have new machines, and they're excited about them. But it may also be, and it wouldn't surprise me if this were the case, that because the new consoles offer a better experience, it's a more engaging experience. And that historically has been the case, that our business has grown coincident with the growth and exploitation of increasingly robust technology. And I would expect that to continue for some time to come.\n\nOperator\n\nOur next question is from Mike Hickey with the Benchmark Company. Please proceed with your question.\n\nMike Hickey -- The Benchmark Company -- Analyst\n\nThanks, Strauss and Lainie. Congrats on the quarter, guys, and congrats on your acquisition, pretty exciting. Two questions for me. First one on your new mobile games from existing IP.\n\nAre we -- are you sort of thinking casual spin-offs here like a Red Dead Poker or GTA Casino? Are you thinking more core mobile game releases off your IP? If it is core, do you feel like you have the resources now that you've added Zynga just to make kind of core mobile games? Or would you need to be in a position to hire or create new teams or partner? That's sort of the first question. And the second question on Gen Z and Gen Alpha. Besides being very useful when you think about your biggest IP and where you've had the most last year over the decades, curious what you think your biggest opportunities and challenges are for sort of this emerging new generation of gamers.Thanks, guys.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nSo thanks, Mike, for your comments and your question. With regard to the creation of new mobile titles based on legacy Take-Two IP, it remains to be seen what those expressions will look like. It will be driven by the passion and the talent of the teams. And to your question regarding whether Zynga has the ability to do that development in-house, I think the answer is unquestionably they do.\n\nZynga has many number of talented studios all around the world. That distinguishes Zynga from virtually all other mobile developers and publishers. And it's one of the things that we found most exciting about the company now the label. In terms of the next generation of gamers, I mean, the evidence is that they play more.\n\nThey're more engaged and they play more. And that makes sense because what was new technology 15 years ago, to them, is just part of the landscape. They've grown up and it's like fish in water. People -- kids start playing with smartphones as early as they can play with blocks.\n\nSo I have to believe that interactive entertainment will continue to grow disproportionately to the rest of the audiovisual entertainment businesses. There's ongoing evidence that is and will remain the fastest-growing segment within the entertainment industry. And I think this next generation will just put a finer and finer point on that. In terms of what we have to give them to engage them, that that is still the same, which is the highest quality entertainment experience that is available on the face of the earth, and that's our job, that's our mission and that's what drives us all every day.\n\nOperator\n\nOur next question is from Drew Crum with Stifel. Please proceed with your question.\n\nDrew Crum -- Stifel Financial Corp. -- Analyst\n\nOK. Thanks. Hey, guys. Good afternoon.\n\nMaybe for Strauss or Karl. Guys, are you seeing any changes with the development cycle? And specifically, has COVID in any way elongated the time it takes to complete a game? And is that something that could put the development pipeline at risk? And then separately, guys, what is the company's plan around debt reduction for fiscal '23? Thanks.\n\nKarl Slatoff -- President\n\nSo in terms of development cycles, I think development cycles are ever changing. And obviously, it varies game by game. The games are getting bigger. They're getting more complicated.\n\nThere's new technology out there that we can avail ourselves to. So -- and all of that's a learning process. And that learning curve is often very steep. And -- but I would say there's nothing specific about the changing development cycles that we haven't seen before.\n\nIt's just that the games are bigger and they're more complicated and there's more to do. And that's actually what makes our business so exciting.\n\nLainie Goldstein -- Chief Financial Officer\n\nIn terms of debt reduction, we have a strong cash flow. The business will be generating a lot of cash this year. We look at paying down as much debt it makes sense to at the end of the year. But at the same time, we look at acquisition opportunities as well.\n\nSo if there's something that makes sense for us to buy during the year, we would also look to do that. So I'd love to see what it looks like at the end of the year based on what the needs are during the rest of the year.\n\nOperator\n\nOur next question is from David Karnovsky with J.P. Morgan. Please proceed with your question.\n\nDavid Karnovsky -- J.P. Morgan -- Analyst\n\nHi. Thank you. Just following up on mobile advertising at Zynga. I think you mentioned you were up year over year.\n\nGiven the overall mobile environment is seeing macro pressure, just wondering how you kind of reconcile that with the advertising gains? Is that about market share? And then I wanted to see if you could just speak to the decision to delay the full launch of Star Wars: Hunters beyond its initial time line? And is that game still slated for a cross-platform just because the platform is listed as TBA in the release? Thanks.\n\nKarl Slatoff -- President\n\nSo in terms of the advertising business, yes, the overall advertising market, generally speaking, has experienced year-over-year declines due to adtech consolidation and the lower spend on digital advertising. Our advertising revenues have -- the growth has decelerated from the last quarter, but they grew notably versus last year. And we believe we outperformed the industry trends. We expect this trend to improve over the course of the year with natural seasonality and optimizations we're making in our network mix and pricing.\n\nSo what was the second question? Yes, in terms of Star Wars: Hunters release, it really is just a matter of making sure that the game is delivered at the highest possible quality, and we have not changed anything around platforms.\n\nOperator\n\nOur next question is from Andrew Marok with Raymond James. Please proceed with your question.\n\nAndrew Marok -- Raymond James -- Analyst\n\nThanks for taking my question. Two for me, please. Given the Criminal enterprises in the last few GTA Online expansions have been received pretty well, how should we be thinking about the GTA Online content pipeline or philosophy as development on the next premium GTA ramps and resources are reallocated? And then second, could softness in the ad market create opportunities for lower-cost marketing or changed marketing strategies ahead of some of your frontline releases? Thank you.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nThank you. The Rockstar Games has been supplying ongoing content updates for Grand Theft Auto Online since its release in 2013. The most recent one was well received, and they continue to put out terrific content. Any announcements about upcoming properties do come from the labels.\n\nSo we don't tend to talk about them here. And a great question about advertising cost. I think it's a fair one, which is if you're seeing softness in the market, does that mean you can market your titles more cheaply going forward? And the answer is we might see some minor adjustment in the cost profile. But at the end of the day, we spend a lot to support our console -- big console launches.\n\nAnd I don't think that softness in the ad market would probably have a material impact on that.\n\nOperator\n\nOur next question is from Clay Griffin with MoffettNathanson. Please proceed with your question.\n\nClay Griffin -- MoffettNathanson LLC -- Analyst\n\nHi. Good evening. Notwithstanding the impact of the higher ASP on the Championship Edition of 2K, I'm just wondering if you're seeing any material change in mix as we head into this kind of preorder window? I guess in light of some of the softness in free-play mobile. I guess the question back, do you have any flexibility to maybe go a bit more aggressively with bundled virtual currency in the preorder window?\n\nKarl Slatoff -- President\n\nYeah. I think -- I don't know that there's anything specifically in the market that would change our philosophy on how we package our product. I think we always are trying new models and new pricing practices to try to optimize the situation. But I don't really see a market-driven specific opportunity arising.\n\nBut you'll see us experimenting all the time.\n\nClay Griffin -- MoffettNathanson LLC -- Analyst\n\nAnd no real change in mix versus last year, normalizing for this championship position?\n\nKarl Slatoff -- President\n\nThere'll be some mix -- changes in mix, but we haven't really talked about it at this point.\n\nClay Griffin -- MoffettNathanson LLC -- Analyst\n\nOK. Thanks.\n\nOperator\n\nWe have reached the end of the question-and-answer session. I'd like to turn the call back over to Strauss Zelnick for closing comments.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nWe'd just like to thank you, all, for joining us. We're really proud of how the company is performing. Our combination with Zynga is off to a terrific start culturally, financially, strategically, and creatively. And I want to reiterate my appreciation to our colleagues all around the world.\n\nWe'll be talking to all of them tomorrow in our various town hall meetings. These results are thanks to their hard, dedicated, and creative work. Thank you, all.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNicole Shevins -- Senior Vice President of Investor Relations and Corporate Communications\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nKarl Slatoff -- President\n\nLainie Goldstein -- Chief Financial Officer\n\nEric Handler -- MKM Partners -- Analyst\n\nMatthew Thornton -- Truist Securities -- Analyst\n\nMatthew Cost -- Morgan Stanley -- Analyst\n\nMario Lu -- Barclays -- Analyst\n\nDoug Creutz -- Cowen and Company -- Analyst\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nMatti Littunen -- Bernstein -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nMike Hickey -- The Benchmark Company -- Analyst\n\nDrew Crum -- Stifel Financial Corp. -- Analyst\n\nDavid Karnovsky -- J.P. Morgan -- Analyst\n\nAndrew Marok -- Raymond James -- Analyst\n\nClay Griffin -- MoffettNathanson LLC -- Analyst\n\nMore TTWO analysis\n\nAll earnings call transcripts"
}