{
  "companyName": "Smart Sand, Inc.",
  "companyTicker": "SND",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/smart-sand-inc-snd-q2-2022-earnings-call-transcrip/",
  "content": "Smart Sand, Inc. (SND 2.87%)\nQ2 2022 Earnings Call\nAug 10, 2022, 10:00 a.m. ET\n\nOperator\n\nHello. Thank you for standing by, and welcome to the second quarter smart Sand Inc. earnings conference call. [Operator instructions] Please be advised that today's conference may be recorded.\n\nI would now like to hand the conference over to your speaker today, Josh Jayne, director of finance and treasurer. Please go ahead.\n\nJosh Jayne -- Director of Finance and Treasurer\n\nGood morning, and thank you for joining us for Smart Sand's second quarter 2022 earnings call. On the call today, we have Chuck Young, founder and chief executive officer; Lee Beckelman, chief financial officer; and John Young, chief operating officer. Before we begin, I would like to remind all participants that our comments made today will include forward-looking statements, which are subject to certain risks and uncertainties that could cause actual results or events to materially differ from those anticipated. For a complete discussion of such risks and uncertainties, please refer to the company's press release and our documents on file with the SEC.\n\nSmart Sand disclaims any intention or obligation to update or revise any financial projections or forward-looking statements whether because of new information, future events or otherwise. This conference call contains time-sensitive information, and is accurate only as of the live broadcast today, August 10, 2022. Additionally, we may refer to the non-GAAP financial measures of contribution margin, EBITDA, adjusted EBITDA and free cash flow during this call. We believe that these measures, when used in combination with our GAAP results, provide us and our investors with useful information to better understand our business.\n\nPlease refer to our most recent press release or our public filings for our reconciliations of contribution margin to gross profit, EBITDA and adjusted EBITDA to net income and free cash flow to cash flow provided by operating activities. I would now like to turn the call over to our CEO, Chuck Young.\n\nChuck Young -- Founder and Chief Executive Officer\n\nThanks, Josh, and good morning. We delivered a great second quarter with sales volume of 1.2 million tons and a return to positive adjusted EBITDA. Second quarter volumes are up 40% quarter over quarter, and 1.2 million tons sold represent the most frack sand we have ever sold in a single quarter. Given strong commodity prices and our ability to continue to deliver sand to multiple basins across the U.S., we are confident we will sell record volumes in 2022.\n\nOur second quarter results reflected continued improved pricing in our business. Pricing remains strong, and we expect prices to remain at these levels for the foreseeable future. We have been able to overcome increased costs caused by the shortages of labor and inflation in the second quarter by increasing our sales volume and pricing. We are focused on being the best-in-class in terms of our cost structure at our operating facilities, and we'll continue to look for ways to reduce our cost and maximize our profitability.\n\nWe are very pleased with the results we have seen at our unit train capable transloading terminal in Waynesburg, Pennsylvania. Tons shipped through the terminal were up 26% from the first quarter, and we expect volumes to grow in the third quarter. We also saw substantial volume growth during the second quarter through our Van Hook terminal where volumes more than doubled sequentially. As we have said many times in the past, we believe that bulk commodities belong on rail, and the sustainable logistics must include terminals close to our customers' drilling activity.\n\nOur mine to wellsite rail terminal and last mile approach provides our customers a safer, cost-efficient and more reliable supply chain. We continue to see an acceleration in our Industrial Products division. We doubled our time sold for the first quarter and expect volumes to grow each quarter for the balance of the year. We continue to add new customers and brought us the product offerings we can provide.\n\nWe are expanding our services and capabilities with blending and packaging as well as adding finer grade products in the second half of this year. We believe this sets us up for a very strong growth in 2023 and beyond. Utilization of SmartSystems remains at an all-time high for the company. We saw utilization increase during the second quarter, and we're receiving increased momentum as we start to penetrate the market with our SmartPath technology.\n\nBy using our SmartPath, our customers can reduce the number of trucks needed to deliver sand to the wellsite by more than 30% versus our customers' equipment, providing our customers with substantial cost savings for sand delivered to the wellhead. Additionally, by taking trucks off the road, we benefited our communities by reducing accidents, carbon emission, noise and dust. ESG goals are important to Smart Sand and its customers, and SmartSystems helped achieve these goals by improving efficiency and reducing impact. Our balance sheet remains strong.\n\nToday, we have approximately $5 million in cash on our balance sheet and approximately $18 million in liquidity. We will continue to remain disciplined with capital spending while pursuing projects that will generate long-term value. We are excited about our future for a number of reasons. Our balance sheet remains in great shape, and we have the assets in place to generate free cash flow over time during an up cycle.\n\nWith mines situated on four Class 1 railroads and access to all Class 1 railroads, we have the logistics in place to more efficiently deliver sand to our customers wherever they are operating. The sand market remains tight, which will allow us to generate strong financial results in the third quarter and beyond. Having operated SmartPath successfully for more than a year, we look forward to expanding its deployment in the field, and increasing our last mile market share. Industrial Product Solutions continues to grow rapidly, diversifying our business with strong margins that will provide diversification to our earnings profile.\n\nAs always, we will continue to keep our eye on the future, and we'll always keep our employees and shareholders' interest in mind in everything we do. And with that, I'll turn the call over to our CFO, Lee Beckelman.\n\nLee Beckelman -- Chief Financial Officer\n\nThanks, Chuck. Now I'll go through some of the highlights of the second quarter compared to our first quarter results. Starting with sales volume. We sold 1,196,000 tons in the second quarter 2022, a 40% increase from the first quarter 2022 volumes of 852,000.\n\nVolumes exceeded our guidance of a 25% increase as we saw strength across multiple basins and a tight market throughout the quarter. Total revenues for the second quarter of 2022 were $68.7 million compared to $41.6 million in the first quarter 2022. Sand revenues were $67.1 million, up 75% sequentially due to both higher volumes and improved pricing. We did not recognize any shortfall revenue in the second quarter.\n\nOur cost of sales for the quarter were $59.7 million compared to $43.6 million last quarter. Production costs were up sequentially due to increased excavation costs and higher utility costs driven by increased natural gas prices and higher freight expenses due to higher in-basin sales in the quarter. Total operating expenses were $7.6 million compared to $7.9 million last quarter. The decrease was primarily a result of lower SG&A expenses.\n\nFor the second quarter of 2022, the company had a net loss of $90,000 or $0.00 per basic and diluted share compared to a net loss of $5.9 million or a negative $0.14 per basic and diluted share for the first quarter of 2022. For the second quarter of 2022, contribution margin was $15.3 million and adjusted EBITDA was $9.2 million compared to first quarter contribution margin of $4.3 million and negative adjusted EBITDA of $1.9 million. For the second quarter, contribution margin per ton was $12.75 per ton compared to $4.99 per ton last quarter. For the second quarter of 2022, we had negative $3.7 million in free cash flow due to a negative $2.3 million in operating cash flows and $1.4 million of capital expenditures.\n\nOperating cash flow was significantly impacted by an increase in working capital due to the increased sales activity in the second quarter. Not only did we sell more tons in the second quarter, but we also sold more tons in basin where we are paying the freight cost, and which negatively impacts us in the short term from a cash flow timing perspective. We expect the impact of working capital changes on our operating cash flow to moderate in the second half of the year. As a result of the working capital timing issues mentioned previously, we drew on our revolver in the second quarter, and ended second quarter 2022 with $3 million outstanding on our facility.\n\nWe also had $1 million outstanding in letters of credit. Since the end of the second quarter, we have drawn an additional $3 million on our facility, and today, we have availability under the revolver of approximately $13 million. We paid down $1.8 million against our notes payables and equipment financings in the second quarter. Our current cash balance is approximately $5 million.\n\nBetween cash and our availability on our facilities, we currently have approximately $18 million in available liquidity. In terms of guidance for the third quarter, we currently expect sales volumes to be in the range between 1 million tons and 1.2 million tons. While market fundamentals remain strong, the timing of activity of some of our customers has shifted, leading to lower potential sales in the third quarter. Activity remains strong, and we still expect volumes to be up significantly from first quarter levels.\n\nWhile we expect slightly lower sales volumes in the third quarter, pricing fundamentals remain positive, and we currently expect contribution margin per ton to improve 5% to 10%, if we can maintain current pricing levels throughout the third quarter. We had previously discussed achieving low to mid-double-digit contribution margin per ton results across our business at some point in 2022. We achieved that goal in the second quarter. We believe on a contribution margin per ton basis, we will remain in the double-digit contribution margin per ton range in the third quarter.\n\nThe continued strong pricing environment combined with another strong quarter of sales should lead to strong financial results in the third quarter. Further, our working capital buildup should moderate in the second half of this year, which should help our free cash flow. We spent $1.4 million in capital expenditures in the second quarter, and have spent $11.7 million in the first six months of the year. We currently expect capital expenditures for the year to be in the $20 million to $25 million range, excluding any additional acquisitions, but the additional capital over the remainder of 2022 currently planned to be spent on planned efficiency projects at Oakdale and Utica and investments to support our growing IPS business.This concludes our prepared comments, and we will now open the call for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Stephen Gengaro with Stifel. You may proceed.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nThank you. Good morning, gentlemen. So a couple of things for me, if you don't mind. The first was, when we think about what some of the pressure pumpers are doing with more integration at the wellsite.\n\nHow do you -- are there any changes to your strategy? And any -- how does this impact your business? Or does it not just based on the overall size of the addressable market? Just curious what you're seeing there.\n\nJohn Young -- Chief Operating Officer\n\nWell, one of the things we're certainly seeing, Stephen, is that I think that many of our customers, particularly on the E&P side, would be pumping more if there were fleets available, right? So there's definitely a little bit of need there, I think, on that side. From our perspective, we continue to look at making it easier for customers to buy from us, and that includes delivering sand at the wellhead through our last mile equipment. And we found that there's been quite a bit of interest in that with our systems versus some of the other ones that are out there. And so we continue to kind of look at that and really try to get those systems out there.\n\nWe've had a really good success on deploying most of our equipment in this kind of first and second quarter of this year. So we're pretty excited about that. And both pressure pumpers and E&Ps are interested in that.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nGreat. And you mentioned the strong sand fundamentals. Based on what we've seen, it doesn't feel like there's a whole lot of incremental capacity coming on stream. I mean that's obviously been one of the concerns that we have generally had, but it seems like there's been discipline on additions of capacity that should help keep the market tight.\n\nWhat are you guys seeing as far as frack sand supply and demand and potential new capacity, and how that impacts your expectations going forward?\n\nChuck Young -- Founder and Chief Executive Officer\n\nYeah. So I think there's -- we separate two spaces. And John, you can pick up after I start this. But on the Northern White side, we don't see a lot of fine mesh sand capacity out there, available capacity.\n\nAnd we think that, that's a story that's not really out there. A lot of these [ 2040 ] mines just can't do what they need to do for the marketplace demand today.\n\nJohn Young -- Chief Operating Officer\n\nYeah. And so one of the things we've seen as we tour our area of influence up there in the Northern White space is many of these mines that did exist years ago, they've been picked apart, picked over. A lot of the equipment has moved elsewhere. So Northern White appears to have a pretty good runway here.\n\nOne of the things that's interesting in this market is we're dealing with strong commodity price, both on nat gas and oil. And we haven't seen that necessarily before. And so our natural gas markets where we deliver sand to, again, fine mesh sand in the Northeast. Those are very strong.\n\nOur oil markets in the Bakken and out into the Powder River and DJ those are strong also. So it's one of these things where I don't anticipate a huge amount of Northern White capacity to come on, but we anticipate that the demand for Northern White is going to continue to be strong, particularly on the finer mesh sands.\n\nChuck Young -- Founder and Chief Executive Officer\n\nYeah. And kind of an example of that, Steve, would be during the downturn, we bought a few mines, two of which we have shut down. And when we look at the economics around those mines, and they're just not the same as our fine sand mines.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nGreat. And just one final one for me. We have heard more and more about E&P's concern about frack equipment in 2023, and even frack sand in 2023 a bit. Are you seeing any discussions that extend out further than normal based on customer needs?\n\nJohn Young -- Chief Operating Officer\n\nWell, there's certainly concern from our customer base on sustainability of frack sand supply and reliability of frack sand supply. And so certainly, we're not talking about -- we decided not to talk about any of the conversations we've had with regard to contracting on this call. But there is a good amount of interest in that and definite concern as folks are looking further out. And it's not just pressure pumping, it's not just frack sand, it's last mile equipment and all that kind of stuff.\n\nAnd so it looks positive. Assuming that commodity price stays high, oil and natural gas pay high, we think there's a good long runway here.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nOK, great. Thank you.\n\nOperator\n\nThank you. [Operator instructions] And I'm not showing any further questions at this time. I would now like to turn the call back over to Chuck Young for any closing comments.\n\nChuck Young -- Founder and Chief Executive Officer\n\nThanks for joining us for our second quarter call. We look forward to speaking with you again in November.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJosh Jayne -- Director of Finance and Treasurer\n\nChuck Young -- Founder and Chief Executive Officer\n\nLee Beckelman -- Chief Financial Officer\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nJohn Young -- Chief Operating Officer\n\nMore SND analysis\n\nAll earnings call transcripts"
}