{
  "companyName": "Sprinklr, Inc.",
  "companyTicker": "CXM",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/09/sprinklr-inc-cxm-q2-2023-earnings-call-transcript/",
  "content": "Sprinklr, Inc. (CXM 4.08%)\nQ2 2023 Earnings Call\nSep 08, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to Sprinklr's second quarter fiscal 2023 earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your first speaker today, Mr. Eric Scro, VP finance for introductory remarks.\n\nPlease go ahead, Eric.\n\nEric Scro -- Senior Vice President, Finance\n\nThank you, Alex, and welcome, everyone, to Sprinklr's second quarter fiscal year 2023 results financial call. Joining us today are Ragy Thomas, Sprinklr's founder and CEO, and Manish Sarin, chief financial officer. We issued our earnings release a short time ago, filed the related Form 8-K with the SEC, and we've made them available on the investor relations section of our website, along with the supplementary investor presentation. Please note that on today's call, management will refer to certain non-GAAP financial measures.\n\nWhile the company believes these non-GAAP financial measures provide useful information for investors, the presentation of this information is not intended to be considered in isolation or as a substitute for the financial information presented in accordance with GAAP. You are directed to our press release and supplementary investor presentation for a reconciliation of such measures to GAAP. In addition, during today's call, we'll be making forward-looking statements about the business and about the financial results of Sprinklr that involve many assumptions, risks and uncertainties, including our guidance for the third fiscal quarter of 2023 and full fiscal year 2023, and our actual results might differ materially. Any forward-looking statements that we make on this call are based on our beliefs and assumptions as of today, and we disclaim any obligation to update them.\n\nFor more details on the risks associated with these forward-looking statements, please refer to our filings with the SEC also posted on our website. With that, let me turn it over to Ragy.\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nThank you, Eric, and hello, everyone. Thank you for joining us today as we share the financial results of our second quarter and FY '23. I'll get us started with a few highlights, including what I'm hearing from customers and some of our key wins. Manish will then share details of our financial results.\n\nBut before I jump into the results of the quarter, I'd like to take a moment to share that Luca Lazzaron, our chief revenue officer, has made the decision to step down from his position at Sprinklr after a tremendous five years of building and growth. When Luca joined Sprinklr back in 2017, I had asked him for a full year commitment to bring structure, process and discipline to scaling our sales operations. He achieved that and so much more, hiring great talent and preparing us for the IPO last year. I want to thank Luca personally for giving us that extra year.\n\nAnd for all his contributions, we wish him the very best. Luca will be succeeded by Paul Ohls who has actively been serving as our EVP of worldwide sales and success. Luca recruited Paul to join four years ago and has been preparing him for this role. Paul is an important member of our global leadership team with experience in enterprise software sales, including a lot in customer experience space.\n\nI speak on behalf of my entire leadership team when I say that we are very confident in Paul's ability to step into the CRO role and help take Sprinklr's growth to the next level. Paul will officially transition to his new role on October 1, and Luca will stay on as an advisor until the end of the calendar year. Turning now to the quarter. I'm very pleased to report that Q2 was another strong quarter that exceeded guidance.\n\nQ2 total revenue grew 27% year over year to $150.6 million, and subscription revenue grew 29% year over year to $133.1 million. And with our commitment to operational efficiency, we generated $1.4 million in free cash flow for the quarter. And as Manish will walk you through shortly, we have significantly reduced our non-GAAP operating loss for the year due to prudent financial management and greater operational discipline companywide. We continue to believe that Sprinklr is still at the early stages of a very long-term durable growth opportunity as we capitalize on our leadership position in the unified customer experience management category.\n\nOver the course of the second quarter, I had the pleasure to visit with over 90 of our customers in North America, Europe and Australia. These face-to-face interactions provide so much clarity on what our customers are trying to achieve and how important our platform has become to their business. And personally, these are very energizing for me as I get to see the results of the work that some of these biggest brands in the world are doing -- getting by deploying Sprinklr's unified platform in their customer-facing functions. One of the consistent themes I'm hearing is how companies are seeking to better understand the needs of their customers in real time, especially in this radically changing environment and Sprinklr is helping them not only to do this, but also to translate that understanding into better experiences across all customer-facing functions.\n\nWith Sprinklr companies have a single platform to unify their teams to reach, engage and listen to customers in over 30 digital channels in a collaborative, secure and compliant way. This has never been more relevant. In terms of our second quarter operating rhythm, the sales cycle was marginally elongated versus previous quarters. While the current demand continues to be robust, as we outlooked last quarter, we remain watchful of the macro environment changes and its potential impacts on our business.\n\nIn a more uncertain macro environment, companies strive to do more with less. The proliferation of social messaging and digital channels through the years has created point solution chaos for the world's largest enterprises. This is not sustainable. Our customers are looking for ways to consolidate the fragmented digital tech stack full of point solutions, generate efficiencies and gain better visibility into their customers' journey.\n\nWe're seeing a majority of our customers consolidate point solutions across customer-facing functions and eliminate some vendors altogether. In fact, we benefited from exactly that in the quarter. We had a global pharmaceutical company, a global technology conglomerate and a leading security company, all either consolidate or significantly reduce the point solution spend and still increase revenue, decrease costs and mitigate risk by using Sprinklr and our unified platform. We believe that Sprinklr is a strategic platform investment that's helping our customers, and we're pleased with our position and our ability to deliver this meaningful and tangible ROI.\n\nDuring the second quarter, we continued to add new customers, as well as expand with existing customers, world-class brands like Amgen, Banco Santander, Heineken, and Zscaler are some of the many companies that selected or are expanding with Sprinklr. As you know, customers don't start with unified CXM, but we believe that they will essentially end up there. I'd now like to provide you with some brief examples of use cases and customer wins from the quarter across our four product suites. But before I do, I'd like to point out that all four of our suites, our care, our marketing, our research, and our social and engagement suite are at scale and are growing.\n\nLet me start with Sprinklr Modern Care. This past quarter, the world's largest cosmetics company, L'Oréal, expanded its partnership with Sprinklr, we're now helping to power a digital transformation that will enable their 35-plus brands globally to support beauty advisors in their one-on-one engagement with consumers to deliver more relevant, personalized and transformational experiences at scale whatever -- wherever their customers are on digital. Let me share another story. This one about our Modern Research suite.\n\nOne of Sprinklr's first customers, as many of you know, is Microsoft, and they continue to expand with Sprinklr steadily. In Q2 alone, Sprinklr pulled in nearly 2.2 billion public mentions of the brand and its products through our digital listening product and delivered intelligent insights that now informs marketing and development decisions across their entire company. Microsoft's voice of customer innovation actually is helping Sprinklr as well to continuously evolve and enhance our platform. Moving to our social engagement and sales suite.\n\nIn Q2, the multinational banking and financial services company, Standard Chartered, renewed its partnership with Sprinklr as the company continues its mission to make online banking simpler and faster for customers across 59 markets, it's leveraging Sprinklr to listen to and engage with customers on digital and social channels with the goal of digitizing 70% of the conversations and converting that engagement into sales. Through the help of Sprinklr's AI, Standard Chartered has been able to achieve a 90% first response within 10 minutes and resolved 93% of their cases on their various social channels. And lastly, and excitingly, one of the world's largest pharmaceutical and biotech companies, Roche recently expanded its partnership with Sprinklr to include our modern marketing and advertising suite as the company moves closer to his vision of One Roche. It will soon have consolidated more than 30 different point solutions in social, customer service, research and now marketing onto one enterprise front office platform, which is Sprinklr.\n\nThis enables more transparent and effortless collaboration from global to local teams and affiliates and increases efficiency by reducing the number of tools used and ensuring that everyone operates from a single source of truth for content and customer context. As Roche began to establish a global digital center of excellence, our partnership will ensure that the company can reduce cost, protect its brand's reputation and drive other business outcomes. All of these stories are made possible by our incredible engineering team, who continue to make great strides to differentiate the platform each and every day. Product innovation and core technology development, as you know, is at the heart of who we are.\n\nAnd this quarter alone, we launched over 500 new platform features and enhancements across our four suites focused on innovation and enhanced usability. Whether it's to better track agent performance in real time in customer service, enhanced voice capabilities or shortened time to insights, just to name a few, we continue to build an AI-powered unified platform that serves teams in care, research, marketing and social. Customers need a unifying operating system across their digital edge, which is where all the interactions are happening today. It's where the customer experiences a brand.\n\nIt's where a customer gives feedback and ask questions. It's where sales opportunities to grow your company exists. It's where your biggest risk as well. The Sprinklr unified platform is being architected from the ground up for large global brands to manage and optimize their digital edge.\n\nWe innovate and grow with our customers and partners, and we will continue to provide them a path to manage the next generation of customer-facing functions. With that, let me turn the call over to Manish. Manish?\n\nManish Sarin -- Chief Financial Officer\n\nThank you, Ragy, and good afternoon, everyone. As you heard from Ragy, we delivered another strong quarter across the board and are pleased with our ability to once again exceed expectations across all key financial metrics. In spite of a challenging macro environment, our ability to deliver strong results demonstrates the long-term tailwinds for our business, from our customers transforming their digital edge, the breadth of our product offering and how the value of our unified CXM platform is resonating with customers. For the second quarter, total revenue was $150.6 million, up 27% year over year or $3.1 million above the midpoint of our guidance range.\n\nThis was driven by subscription revenue of $133.1 million, which grew 29% year over year and was $2.6 million above the midpoint of our guidance range. Much of this overperformance was driven by an exceptional renewal rate and renewals occurring much earlier in the quarter allowing for additional revenue during the quarter. To follow up on Ragy's remarks, we have seen sales cycles lengthened marginally during the quarter with additional scrutiny on new customer spend. However, to be clear, the quantum of new business that we booked during the quarter was in line with our forecast, except it was more back-end loaded than what we had modeled.\n\nI'm also happy to report that our subscription revenue-based net dollar expansion rate in the second quarter was 125%. This metric continues to expand for the fifth straight quarter and demonstrates our ability to upsell and cross-sell our extensive product set to our installed base of mid and large enterprise customers. As mentioned earlier, our renewal rate in Q2 was the highest we have seen over the last two years, putting us in great company with other elite enterprise software companies. We believe this high renewal rate, coupled with the expansions in our installed customer base is a testament to how important Sprinklr is to our customers' daily workflows.\n\nThis should also provide sufficient and ongoing evidence that Sprinklr's position in the front office software suite remains resilient even in a recessionary environment. And we now have 98 customers contributing $1 million or more in subscription revenue over the preceding 12 months, which is a 32% increase year over year. This momentum speaks to the strategic value that our platform creates for the world's largest and most valuable brands. As a reminder, we calculate this customer count using $1 million in recognized revenue from these customers on a trailing 12-month basis as opposed to ARR.\n\nTurning to gross margins for the second quarter. On a non-GAAP basis, our subscription gross margin increased to 81.2% as we continue to drive efficiencies in our cloud operations leading to a total non-GAAP gross margin of 73%, a record for us here at Sprinklr. Our professional services non-GAAP gross margin came in at approximately 9%, consistent with the prior quarter and our expectations. In terms of our operating expenses, we continue to invest in growing our business, but we are committed to doing it more efficiently.\n\nDuring the second quarter, total non-GAAP operating expenses increased 23% year over year to $115 million, representing 76% of revenues which was down from 78% of revenues during the same period last year. As we indicated on the last few earnings calls, the rate of expense growth would begin to decline, and that is exactly what happened here in Q2. In fact, the absolute level of total non-GAAP operating expenses in Q2 was similar to total non-GAAP operating expenses in Q1. We continue to derive operating leverage from sales and marketing and G&A, both decreasing by 130 basis points and 90 basis points year over year, respectively.\n\nAs you may recall, on the last few earnings calls, we had said that the investments we made in the second half of FY '22, and early here in FY '23 were partly the result of catch-up investments from prior years due to the unknown impact of COVID at that time. That level of catch-up investment has concluded, and we estimate the magnitude of year-over-year increases in non-GAAP operating expenses to further moderate in the coming quarters. Non-GAAP operating loss was $4.9 million or $0.03 per share on a non-GAAP net loss basis. Recall, our previously announced guidance range was an operating loss of $11 million to $13 million or $0.05 to $0.06 non-GAAP net loss per share.\n\nThis is important to highlight for two main reasons. Firstly, the top line beat of $3.1 million at the midpoint dropped entirely to the bottom line, and we generated additional expense savings demonstrating our ability to run an efficient operation as we further scale the business. Secondly, non-GAAP operating losses continued their downward trajectory over the last few quarters, highlighting our focus on operating discipline across the business. As we have indicated since the IPO, we believe the market for unified CXM is expansive and investing in the platform is the best way to maximize the opportunity and drive long-term value for our stockholders.\n\nWe continue to hire at a measured pace in key areas that we believe will drive future growth. We closely monitor the returns we get on these investments. And if those returns don't meet our expectations, we will pare back our level of incremental investment accordingly. To that end, I'm pleased to report that in terms of free cash flow, we generated positive $1.4 million in free cash flow during the second quarter compared to a burn of $10.6 million in the same period last year.\n\nFree cash flow generation in Q2 was driven by strong billings growth posted in the first half of the year coupled with ongoing operational improvements we are making throughout our business. Given the seasonality and low duration of our billings, we estimate that free cash flow will be negative on a full year basis for FY '23. However, we remain committed to getting to a free cash flow breakeven level during FY '24 as indicated on our previous earnings calls. We ended the quarter with a healthy balance sheet, including $541 million in cash and investments, putting us in excellent shape to continue investing in strategic initiatives that will drive growth with an eye toward profitability.\n\nCalculated billings for the second quarter were $150.1 million, which was an increase of 22% year over year. The dynamics of our billing trends, as outlined on the last two earnings calls, notably, the seasonality we experienced with Q4 being the highest billing quarter and our overall billing cadence having a duration less than 12 months remain in place. And just as a quick reminder, our Q3 billings has historically been the lowest quarter for us given the quieter summer months in Europe and the general timing of our renewals. And as noted previously and reported here in Q2, we expect the delta between revenue growth and billings growth to continue to hold with billings growth lagging revenue growth by approximately five percentage points assuming all else stays the same.\n\nAs of the end of Q2, total remaining performance obligations, or RPO, which represents revenue from committed customer contracts that has not yet been recognized was $607.3 million, up 33% compared to the same period last year, while current RPO was $429.2 million, up 29% year over year. Both metrics attest to the durability of our business. We continue to believe that subscription revenue and RPO growth are the best metrics to evaluate the underlying health of our business. Our billings can fluctuate significantly relative to revenue based on the timing of invoicing, cadence of renewals and the duration of customer contracts.\n\nMoving now to our Q3 and full year FY '23 guidance and business outlook. I had alluded to this during the last earnings call, and it is probably worth repeating here that we face tougher comparisons for the remainder of this year given the strong growth we demonstrated over the last three quarters of FY '22. We also recognize that macroeconomic and geopolitical issues are currently impacting businesses, and there is additional scrutiny on new spend. Starting with Q3 FY '23, we expect total revenue to be in the range of $155 million to $157 million, representing 23% growth year over year at the midpoint.\n\nWithin this, we expect subscription revenue to be in the range of $137 million to $139 million, representing 26% growth year over year at the midpoint. We expect non-GAAP operating income to range from an operating loss of $1 million to an operating profit of $1 million and a non-GAAP net loss per share of $0.01 to $0.02, assuming 263 million weighted-average shares outstanding. For the full year FY '23, we are raising and tightening both our subscription and total revenue outlook for the year. We now expect subscription revenue to be in the range of $543 million to $547 million, representing 27% growth year over year at the midpoint.\n\nWith this updated FY '23 guide, the entire $2.6 million in Q2 beat for subscription revenue has flowed through for the full fiscal year. We expect total revenue to be in the range of $616 million to $620 million, representing 26% growth year over year at the midpoint. This implies the midpoint of Q4 revenue is $166.4 million or 23% growth year over year. Note that the midpoint of FY '23 total revenue has moved up by the full amount of the Q2 beat of $3.1 million.\n\nIn addition, the low end has also moved up by more than the Q2 beat and the range now has been tightened as we move through the balance of FY '23. For the full year FY '23, we are now expecting non-GAAP operating loss to be in the range of $8 million to $12 million, equating to a non-GAAP net loss per share of $0.06 to $0.08, assuming 261 million weighted-average shares outstanding. This equates to $5 million in operating profit for Q4 at the midpoint. Note that the beat at the midpoint for Q2 non-GAAP operating loss was $7 million but we are now comfortable improving the full year operating loss by an additional $22 million for a total full year improvement of $29 million at the midpoint.\n\nThis is the result of our continued focus on operating discipline, specifically go-to-market efficiencies and better allocation of resources. You will recall that we have been focusing on productivity across the company and are now beginning to see the fruits of our efforts. As a quick reminder in deriving the net loss per share for modeling purposes, a $9.5 million total tax provision for full year FY '23 needs to be added to the non-GAAP operating loss range just provided. We booked a $4.6 million tax provision in total for Q1 and Q2.\n\nWe estimate the tax provision to be approximately $2.6 million here in Q3 with the remaining tax provision to come in Q4. FX is very topical given the macro environment, so I want to address it here. FX does not have a material impact on our financials because even though we have approximately 40% of our business outside the U.S., the vast majority of our billings are in U.S. dollars.\n\nLastly, I would like to thank all our employees for delivering a strong Q2 in the midst of an uncertain macro environment and volatility in the financial market, I'm grateful for the confidence that our customers have placed in us and the dedication of our employees. We remain focused on building a track record of successful execution and operating discipline across the business. And with that, let's open it up for questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Tyler Radke with Citi. Please proceed with your question.\n\nTyler Radke -- Citi -- Analyst\n\nThank you for taking the question.  I wanted to ask you just around the overall deal environment you're seeing. Obviously, a nice set of results in outlook as well. But I guess, specifically, are you factoring in the environment getting worse for the second half? And then just help us understand what you're seeing on pipeline, too. We've seen some of your peers like salesforce.com, talk about maybe some pipeline generation issues in the back half of the year.\n\nJust curious what you're seeing on the pipeline side as well.\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nAll right. Thank you, Tyler. Like I said in my prepared remarks, we are seeing incremental scrutiny in deals. Our deals are in the enterprise world are larger.\n\nAnd we're seeing another set of eyes as CFO is spending an extra day looking through it. And we did see that our deals were a little more back-end loaded in the quarter than they traditionally are. However, we're seeing demand continuing to be consistent and robust. What do I mean by that? Businesses want to save money when things are uncertain and things get tougher.\n\nSo we help them increase revenue, reduce costs and help manage risk better by processing external data, give them visibility into what customers like in they don't like. So we're seeing demand strong, but deals are going through more reviews. And while we did not see that in last quarter affecting our numbers, and we have to be cautious and watchful of the macroeconomic changes in the next two quarters.\n\nTyler Radke -- Citi -- Analyst\n\nThat's helpful. And maybe if I could just ask about the competitive landscape. Obviously, you have an environment where the funding for private companies is not nearly as robust as in prior years. And then, you also have what seems like an appetite from larger customers to consolidate solutions.\n\nSo I'm just curious if you've noticed any uptick in win rates? Or do you think some of those competitive factors are helping drive your results here?\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nTyler, we didn't see anything pronounced and different in the last quarter, but our entire value prop is that we go into an enterprise with one unified platform with four product suites for customer-facing function and 33 products. In one of our typical larger deployments, we usually take out somewhere between five- and 25-point solutions around the world when we are done with our deployment in the first 12 to 18 months. So we're continuing to benefit from that because that's our value proposition. Unification is a value proposition.\n\nBut to answer your question directly, we didn't see the funding dry up play into our deal dynamics, at least not in the last quarter.\n\nTyler Radke -- Citi -- Analyst\n\nGreat. Thanks for the color.\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nAbsolutely.\n\nOperator\n\nOur next question comes from the line of Michael Turrin with Wells Fargo. Please proceed with your question.\n\nMichael Berg -- Wells Fargo Securities -- Analyst\n\nHi there. You got Michael Berg on for Michael Turrin. Congrats on a great quarter. Apologies if this was answered on your script, but can you talk us through where you're getting your margin improvement and how we can think about the margin improvement as you look into not only the second half of this year, but moving into fiscal '24 and beyond?\n\nManish Sarin -- Chief Financial Officer\n\nMichael, this is Manish. So we're getting operational improvements across the board. So you would have seen our gross margins tick up. So as I said in my prepared remarks, 73% gross margin was the highest we've seen here.\n\nOn the subscription side, we were at 81.2%. And again, a lot of this is just methodical looking at where we can nip and tuck. We've always said, once we hit scale, we'd be able to improve our subscription gross margins which what we did. And then, on the operating expense side, I've said this in the last two earnings calls, that we will look to get more efficient as we scale the business.\n\nAnd our view always was ever since we went public, that once we hit a 25% plus or minus growth rate, we would start focusing more and more on marginal productivity of every individual that we have in the business. And we've been doing that all the way from looking at non-people costs. These could be real estate, these could be other investments, including how we are onboarding employees and how we have now focused more on making them more productive versus just keeping up a very high rate of employee addition into the business. So I think all of these things in the aggregate is what you're seeing now drop to the bottom line, and we've been speaking to that over the last couple of quarters, and now we're seeing the benefits of that.\n\nMichael Berg -- Wells Fargo Securities -- Analyst\n\nAnd a quick follow-up. Anything to point to -- this is probably just due to a lot of low numbers, but you saw a nice -- little uptick in the adds of $1 million customers. Anything to point to in particular, whether it's just the deals getting pulled forward or the strength to your product breadth and depth, just curious on that front as well.\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nMichael, that's fairly consistent, I think, with the evolution and the maturity of the market. And we're seeing a gradual but very noticeable uptick in companies wanting to buy into the vision and the strategy at the outset because if you know when we IPO-ed our story. And if you look at our past, the story has been, we come from the social media management world, and most company sources of social media management product, and they got started that way and they expanded out. We're beginning to see an awareness in the marketplace of the need for the third platform, the one that complements the other two biggies in the front office space is very pronounced.\n\nAnd we're seeing customers entertaining the notion of buying into the platform approach from the get-go or much faster than they did traditionally.\n\nMichael Berg -- Wells Fargo Securities -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you. Our next question comes from the line of Raimo Lenschow with Barclays. Please proceed with your question.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nThank you. I've got two, if possible. Ragy, can you talk -- if you think about the changes in sales leadership, that's kind of where I got most of the questions from. Obviously, five years is a good time, but it does look like momentum is increasing, etc., like why that's down now, what changed now.\n\nAnd are we expecting any changes as a result of that? That would be my first one, and then I have one follow-up.\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nRaimo, you answered the question yourself. five years is a long time for someone because I convinced Luca who has partly retired and was consulting and doing stuff. I told him we needed four years to get this team set up. Look at the fact that he -- we're promoting somebody he hired and he groomed.\n\nI don't know what else I can point to. And look, we made the decision to go public with the team that built the company because they knew everything about everything. And could provide continuity in this transition. What you're seeing us is a normal growing up of a company that's scaling up and grow and grow in the way it should.\n\nSo Luca is a friend of family, a personal friend of mine is going to be an advisor and continuing to work with us.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nYeah. OK. Perfect. That's really helpful.\n\nAnd then, the follow-on question was a --\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nWell, sorry, I just want to also add that. And Paul Ohls, who is being groomed and hired by Luca has been running worldwide sales for us already. So if you just look back and look at how we've been transitioning it, this is, I think, the smoothest anybody could have done.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nYeah. Yeah. Yeah. OK.\n\nPerfect. That's super helpful. And then, the follow-up was, as we go into more volatile times, it's good to see that you guys haven't seen that much. Have you kind of changed anything in terms of sales approach that you kind of are looking for higher pipeline coverage.\n\nObviously, in tougher times, people look more at consolidating vendors, which should play into your favor. Like what changes have you taken to kind of prepare yourself for what's going on here?\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nAgain, you know that we think we're on the right side of history through these transitions as painful as they are. And I hate even saying that the way I did. But I think the trend toward consolidating, getting the big platforms to work with each other, is the one way, right. So we're definitely benefiting from that.\n\nAnd we're continuing to see companies wanting to do strategic deals. And so, we're not -- all of that is pointing in the right direction for us. What did we change in our sales approach? Not really anything except the fact that as we go through and scale, we're maturing the process. I've always said to you that our go-to-market approach will have to continue to evolve because our pedigree is in selling to large global companies with the direct sales.\n\nSo Arun, our CMO, started a few months ago. And so, you're going to see -- you continue to -- you will see our marketing and our sales evolve and evolve together from a demand gen top down. You will see our partnership and the things that we're going to do in building out. We've got a great alliances program, how do we build that out.\n\nThese are things that as companies mature into the $1 billion range of ARR, they have to do. And we're a little bit late than I'd like, but we're going to catch up.\n\nOperator\n\nThank you. Our next question comes from the line of Arjun Bhatia with William Blair. Please proceed with your question.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nThank you for taking my questions. Ragy, one for you maybe. Obviously, there's a lot of focus on how the macro might unfold and what that means for your business. But I'm curious, as you look at your product portfolio, right, you have these four big suites.\n\nDo you anticipate the increased uncertainty that's out there changing demand for specific products, right, as customers focus on different areas of investment. Does care become a more important area of investment and then marketing advertising, maybe less so. Just curious how you see that playing out.\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nIt's a very good question, Arjun, and thank you, for that. Look, I think our entire value prop is that the platform is unified, built from the ground up on one code base with workspaces and workflow and teams a whole bunch of things, which we think are very unique in the entire enterprise front office software space. So for us, the question is not which product is slowing and which product is growing. To understand that I want you to understand the two things we're doing.\n\nWe are creating next-generation AI-based truly omnichannel customer-facing capabilities, whether that's in care or whether that's in marketing, OK. So when you use our care suite, we're displacing probably five to 15 solutions point solutions in that. And we're doing the same thing in marketing. So we continue to benefit in -- across our product suites.\n\nNow we've been public in the fact that we see care as a great opportunity, and that's a strategic priority for two reasons. First reason, we see this contact center refreshes begin to spike. The contact center space is really very -- it's been around for 40-plus years. So people are trying to figure out how to consolidate data centers and how to move to the cloud.\n\nAnd when you're disrupting and you've taken apart what's been working for you, you're always looking at not just how do I catch up but what's coming next and people are buying into this vision. Remember, a couple of quarters, we talked about this large Asian bank that went live with our voice capability. And I'm pleased to report today that they've actually gone live in multiple sites. And boy, they're seeing some really good results.\n\nAnd you have to really take this apart to understand the power of this transformation. With our solution, you can start on the phone, press one, press two, go through your IVR, get you a human being. And when you get another call, you have to hang up and you pick that conversation back up in email, we can preserve state and context within the channel across channels. If you chat with us, like you see in many other solutions, the chat doesn't end and restart when you come back.\n\nWe have persistent context as preserved. It comes from the omnichannel architecture. So our first suite of customers is a customer in the Middle East that has 2,000 stores -- that has franchise American brands and have 2,000 stores in different countries. For the first time after going live, they hardwired their contact center to the restaurant.\n\nSo you sit there in a Pizza Hut at the table and you have a problem in your tweeting you're not expecting anybody to kind of -- you're thinking you're talking to a 1-800 operator. They now have the ability across channels, across languages using AI to route that, understand the intent to route that to the store and have the manager come out and help. So these are -- like I always think our educated investors are our best investors, I would encourage everyone on the call to talk to customers. We're not talking about let's remove two or three-point solutions.\n\nWe're getting pumped up thinking about what we're doing here.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nThat's really interesting and very helpful. Thanks, Ragy. And then, just a follow-up for Manish, if I can. If I look at just your margin guidance and given the current quarter results, it seems like you actually had a quarter-over-quarter sequential decline in total sales and marketing spend.\n\nAs we look out for the remainder of the year and possibly into 2024, fiscal '24 as well, where do you anticipate the biggest portion of leverage to come from over the next four to six quarters?\n\nManish Sarin -- Chief Financial Officer\n\nYeah. So that's a great question. I think for FY '24 official guidance, you'll have to wait for the December earnings call. You might get some prelim guidance at that time.\n\nBut I think your observation is astute. I did call out even in the prepared remarks that the biggest area of leverage we would see is in sales and marketing. And again, this just goes back to marginal productivity. So some of that will taper down.\n\nWe're obviously looking to generate a very healthy level of growth, but do it in a manner which balances both growth, as well as what drowns to the bottom line. So you're going to see that ARC continue for the remainder of this year. On the bottom line, we are obviously alluding to a $5 million operating profit here in Q4. And I don't think it would be a stretch to assume that as you look at FY '24, you would see that continue as to exact numbers, we will talk through that in December.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nGot it. Very helpful. Thank you. Yeah, that's very helpful.\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Michael Turits with KeyBanc. Please proceed with your question.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\n So first of all, congrats on the quarter, probably obvious reasons, tough environment, great performance, really nice to see. But I'd love to keep going. So I love to keep going in the sales and marketing and tied margin direction. I'm just trying to understand not just quantitatively that you're going to see more efficiency productivity.\n\nBut what's happening in terms of go-to-market, in terms of focus on direct sales. Where you're coming back from relative to the catch up? Any changes that might be taking place, maybe some efficiencies that come out of the light offerings what is really enabling that change in productivity at a very concrete level right now?\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nLet me kick it off and maybe Manish can add details. Michael, in our earlier years as we're building the platform, our primary focus in growth was added capacity. And I think what we've done, and we have to add capacity because ramping takes a while, right, as you know, in our space, in enterprise software sales across the board. So having done that, what we've done is we've built enough capacity and then now we're focused on productivity.\n\nAnd so, that's what you will start seeing. And I think it will take us a few more quarters to get that capacity and productivity focus weighted right, and then we'll be able to kind of give you a long term where it should be. But there's no reason for you to think that we would be anywhere less than best-in-class in the long run.\n\nManish Sarin -- Chief Financial Officer\n\nYeah. And to sort of add to what Ragy was saying, Michael, it's nothing more complicated than it takes a certain amount of time for reps to ramp up. And I think historically, in a low interest rate environment, there certainly wasn't any real need for companies to start focusing on what's the marginal productivity of a rep? How do we make sure it gets to a certain threshold. And there was sort of all the reason to go keep adding the capacity because the whole aim was to generate a much higher growth rate.\n\nAnd our view is, look, we want to get to a very healthy growth number that we believe we can sustain over a long period of time. And in terms of adding additional capacity, we want to be extra thoughtful. We'd rather focus our energies on enabling the existing teams in place, getting them to be more productive, adding more resources around enablement, adding more resources around getting them more leads, more pipeline, more productive back again to that phrase than sort of adding additional capacity at the margin. And we're sort of getting a lot more methodical about it than we were before.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nGreat. That's helpful.\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nDoes that give you more color?\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nYeah, that's helpful. And then, just sort of a clarification. Manish, it was interesting. You said that the renewal -- you have strong renewal rates and the renewal came earlier in the quarter driving revenues, but new business in the quarter was more back-end loaded.\n\nSo why is that that new business was more back end, but renewals earlier.\n\nManish Sarin -- Chief Financial Officer\n\nYeah. So that's a good question. And I wanted to call it out because I wanted sort of investors to dissect the revenue composition and understand why there was overperformance in the quarter. So as Ragy and I both said in the prepared remarks, there is extra level of scrutiny on the new spend.\n\nI mean, damn these CFOs, but that's what they do. And so, we saw our last week of the quarter was tremendous. We did book the amount of business that we were looking to book, but it all sort of came together in the last week or so. Now every quarter is different in terms of the cadence of renewals.\n\nAnd Q2 was one of those quarters where a lot of our big customers were slated for renewal much earlier in the quarter. So when we build our financial models, we're not down to the individual customer, and there's a certain puristics we used to figure out where things would land. And given that we generate a lot of our new business in terms of upselling to existing accounts, given those renewals were much earlier in the quarter, a lot of the upsells into the accounts -- into those accounts happened in the first or second month. So we picked up additional month or two of revenue, but a lot of the nonrenewal business from new accounts happened in the last week of the quarter.\n\nSo if you net the whole thing out, that's the $3 million in overperformance compared to the midpoint you see for the quarter. So I wanted to lay all of this bear so people understood how the sausage is made. Does that make sense?\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nLet me add one other perspective. We used to be -- our fiscal year used to be calendar year. So there's an accumulated book of business that as we switch to January 31 year-end, that book of business kind of renews early, right, early in the quarter. So there's some historical context to how sometimes renewals are in line with where we see the new business expansions.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nThanks very much, guys. Congrats again.\n\nOperator\n\nOur next question comes from the line of Elizabeth Porter with Morgan Stanley. Please proceed with your question.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nGreat. Thanks so much. I wanted to ask on the NRR. It was really impressive to continue to see that performance, especially in light of hearing other companies talk about a more challenging environment.\n\nSo could you unpack some of the improvement in the NRR between gross sell, cross-sell and upsell? And how should we think about the continuation of trend through the rest of the year? And did that renewal business that you just highlighted? Is that any sort of onetime impact NRR we should think of?\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nYeah. Our primary focus has been Elizabeth, upsells and growth within existing accounts. Let me explain the strategy behind it. And then, Manish can add more color.\n\nWe know we are attempting to do too much, 33 products for a company that's 13 years old and most of it was built organically pretty much pull of it. And so, we know we're attempting to do too much. We know we're changing a very, very big and powerful vision. So it was, and it has always been very important for us to focus on a segment and make sure that they are getting very measurable, tangible value from this bigger investments they're making in us as a platform.\n\nSo that was the strategy behind going to the very top, biggest companies. If we can solve the biggest and the most complicated use cases and situations and show ROI, we think it's much easier to simplify, make itself service and all that. It's admittedly a different strategy than many other companies, but that's what we chose to do. So our customers -- our larger customers have always been buying more and more of Sprinklr and that's been a path to grow.\n\nHaving said that, we are now at a point after 13 years, where the core capabilities of the platform has been built out and is super visible and is super clean and customers are happy and they're buying more. And so, it is time for us now to start putting a lot more emphasis on new logos. And you will see us in the next, I'd say, two to four quarters, slowly but surely increase our investment in new logos.\n\nManish Sarin -- Chief Financial Officer\n\nYeah. And just to add to that. So I think as we've alluded to earlier, we don't have an internal NRR or net dollar retention target. Given that we tend to start with one product suite, and then over time, as Ragy was saying, customers do eventually end up at the unified CXM platform.\n\nSo we've historically become fairly adapt at trying to sell multiple product suites to those accounts. You obviously see that in the 98 customers with more than $1 million in subscription revenue over the last 12 months. The other thing I just wanted to make sure was clear the NRR metric for us, it is a trailing 12 month on a recognized revenue basis, not ARR. So sometimes that does confuse people.\n\nAnd back to the earlier comments I made around growth retention we're obviously best-in-class. So there is a number of these things that are coming together. And as Ragy was saying, that was one of our underlying premise that we can bring bigger accounts to our full product suite and platform over time and we're obviously transitioning more and more to adding new logos into the mix now.\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nAnd again, we're not going to give out too much more, but we now have multiple customers that pay us over $10 million in ARR. So that's where we're going with this. And we will emphasize our new logo motion going forward, but we're very comfortable with where we are.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nGot it. And then, just as a quick follow-up. Last quarter, you introduced Arun as the new CMO, any early learnings or initiatives as it relates to the go-to-market motion following his addition.\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nWe're excited about Arun being here. He has already made such a big difference. Now obviously, he had to start by putting together his team. And so, it's very, very early for me to declare anything.\n\nBut directionally, I think we're doing some of the fundamental things. And I know companies one-fifth our size have done better. So we're behind the eight ball on it, and we will catch up, Elizabeth. But you should expect more and better in the next, I'd say, two to three quarters.\n\nOperator\n\nThank you. Our next question comes from the line of Pinjalim Bora with J.P. Morgan. Please proceed with your question.\n\nPinjalim Bora -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thank you for taking the questions, and congrats on the quarter guys. Ragy, you talked about in one of the answers, I think the contact center refreshes are spiking. You added voice capabilities recently, I believe.\n\nIs that helping you on the CCaaS side, is that acting as a tailwind to that modern care business, how are you approaching that market? And is the competitive dynamics changing for real because of that?\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nSure. We expect that to be, and we're not yet benefiting from it. So just know that the CCaaS space is a very ambitious venture of ours. We've invested a lot of time and energy into it.\n\nWe think at this point, we have a very competitive product. We've had multiple companies score us high, very high, even compared to very seasoned vendors on technical capabilities. But as you know, that's not how the market works. We have to kind of get a few implementations under our belt, and we have to then get into the analyst waves and be known as a CCaaS vendor.\n\nSo we're kind of in the early stages of that as well. We are expecting that to be a significant opportunity for us, and we are continuing to prioritize it.\n\nPinjalim Bora -- JPMorgan Chase and Company -- Analyst\n\nGot it. And one for Manish. When I look at the deferred revenue and RPO, it seems like deferred revenue in the balance sheet had a sequential drawdown, but RPO grew nicely sequentially on a dollar basis. Is there anything to call out between those two dynamics? Is it just because of the back-end loaded nature of the quarter that some deals might have got booked but not billed, anything more color you can provide?\n\nManish Sarin -- Chief Financial Officer\n\nYeah. So that's a great observation, Pinjalim. If you look back over the last six to eight quarters, you see that our deferred revenue actually doesn't have much of a trend line, unfortunately. And a lot of this is, like you alluded to, we book all the business that we get, and this quarter was particularly back-end loaded.\n\nSo billings, some of it takes time, and that obviously doesn't get into the deferred number. So you're correct there. And obviously, as I was saying earlier, our billings, given the mishmash of monthly quarterly, semiannually, annually, the billings trend line isn't as clear cut as one would like. And that's part of the reason we've always focused investors on look at subscription revenue and its growth, as well as RPO and its growth as the key driving factors in the business.\n\nDoes that make sense?\n\nPinjalim Bora -- JPMorgan Chase and Company -- Analyst\n\nYeah, absolutely. Thank you.\n\nOperator\n\nThank you. Our final question comes from the line of Parker Lane with Stifel. Please proceed with your question.\n\nParker Lane -- Stifel Financial Corp. -- Analyst\n\nYeah. Hey, guys, thanks for taking the question and congrats on the quarter. I'll just keep it one of the interested time. Looking at EMEA and other, it looks like it grew a touch lower than the Americas business during the quarter.\n\nI know you said FX isn't really a big consideration in your business. Anything to call out in international markets from a demand environment or sales cycle perspective relative to the Americas?\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nParker, the short answer is no. We're not seeing any macroeconomic changes affect our geographic distribution tends to be -- it's pretty consistent with what it was. And any change that we're seeing is just attributed to -- can be attributed to operations and leadership and the changes we are making internally.\n\nParker Lane -- Stifel Financial Corp. -- Analyst\n\nUnderstood. Appreciate the call. Thanks.\n\nOperator\n\nThank you. Ladies and gentlemen, we have reached the end of the question-and-answer session. I will now turn the call back over to Ragy Thomas for closing remarks.\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nThank you, Alex, and thank you all for joining us today. I'd like to thank our employees, partners and most of all, our customers for their business and their continued trust in us as we develop this category. We look forward to updating you all again soon as in -- as we continue our exciting journey and building this category, whose rights we know is inevitable. Thank you all and talk to you again soon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEric Scro -- Senior Vice President, Finance\n\nRagy Thomas -- Chairman and Chief Executive Officer\n\nManish Sarin -- Chief Financial Officer\n\nTyler Radke -- Citi -- Analyst\n\nMichael Berg -- Wells Fargo Securities -- Analyst\n\nRaimo Lenschow -- Barclays -- Analyst\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nPinjalim Bora -- JPMorgan Chase and Company -- Analyst\n\nParker Lane -- Stifel Financial Corp. -- Analyst\n\nMore CXM analysis\n\nAll earnings call transcripts"
}