{
  "companyName": "Smartsheet",
  "companyTicker": "SMAR",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/smartsheet-smar-q2-2023-earnings-call-transcript/",
  "content": "Smartsheet (SMAR -1.33%)\nQ2 2023 Earnings Call\nSep 01, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon. My name is Emma, and I will be your conference operator today. At this time, I would like to welcome everyone to the Smartsheet second quarter 2023 earnings conference call. [Operator instructions] Thank you.\n\nAaron Turner, head of investor relations. You may begin your conference.\n\nAaron Turner -- Head of Investor Relations\n\nThank you, Emma. Good afternoon, and welcome everyone to Smartsheet's second quarter of fiscal year 2023 earnings call. We will be discussing the results announced in our press release issued after the market closed today. With me today are Smartsheet's CEO, Mark Mader; and our CFO, Pete Godbole.\n\nToday's call is being webcast and will also be available for replay on our Investor Relations website at investors.smartsheet.com. There is a slide presentation that accompanies Pete's prepared remarks, which can be viewed in the Events section of our Investor Relations website. During this call, we will make forward-looking statements within the meaning of the federal securities laws. We have based these forward-looking statements largely on our current expectations and projections about future events and financial trends.\n\nThese forward-looking statements are subject to a number of risks and other factors including, but not limited to, those described in our SEC filings available on our Investor Relations website and on the SEC website at www.sec.gov. Although, we believe that the expectations reflected in the forward-looking statements are reasonable, our actual results may differ materially and adversely. All forward-looking statements made during this call are based on information available to us as of today and we do not assume any obligation to update these statements as a result of new information or future events except as required by law. In addition to the U.S.\n\nGAAP financials, we will discuss certain non-GAAP financial measures. A reconciliation to the most directly comparable U.S. GAAP measures is available in the presentation that accompanies this call, which can also be found on our Investor Relations website. With that, let me turn the call over to Mark.\n\nMark Mader -- Chief Executive Officer\n\nThank you, Aaron, and welcome everyone to our second quarter earnings call for fiscal year 2023. Q2 was another strong quarter for Smartsheet. Revenue in the quarter grew 42% to $186.7 million and billings grew 44% to $205.6 million. As enterprises across the globe continue to deploy Smartsheet at scale to solve their mission critical workflows.\n\nIn Q2, 62 customers expanded their Smartsheet investment by over $100,000 and 201 expanded by over $50,000. We also added three more customers to the $1 million ARR tier and now have 36 customers over this ARR threshold. We ended Q2 with ARR surpassing $736 million and now have over 11.1 million Smartsheet users. Q2 was another great quarter for our new business motion, with new business bookings setting another quarterly record.\n\nWe saw new wins at companies such as payment process REPAY, UnitedHealth Services Hospitals, Bloomberg Industry Group, IMAX, Midwest Vision Partners, the broadcast management platform Operative, Logic Consulting and Affinity Health Partners. However, we are not immune to the changing macroeconomic condition. In the month of July, we started to see macro impacts on our business, including longer sales cycles, some deal compression and additional approval layers. These impacts resulted in lower expansion rates.\n\nAdditionally, our previous guidance assumed a ramp time for sales reps we hired at the beginning of the year to be consistent with what we'd experienced in the past. However, this ramp time has been slower than we anticipated. We're investing a new enablement tools and training to improve productivity. Given these factors, we're taking a thoughtful approach to guidance and are electing to low our full-year billings and revenue guidance with the assumption that the current macro environment persists.\n\nWhile Pete will provide more details about how the changing macroeconomies impacting our financials for the remainder of the year, I want to update you on the status of our key growth drivers, namely our portfolio of capabilities products, our success in the enterprise and Brandfolder. Our portfolio of Smartsheet premium add-ons that we refer to as capabilities continues to drive deep attachment within our customer base and further differentiate Smartsheet from the rest of the CWM category. Whether these capabilities are bundled in an advanced package or purchased individually, they power our customers' most important workflows. From Data Shuttle, which lets users act on data across multiple systems to control center that lets users build and operate a system of work across hundreds to thousands of projects or workflows to our Brandfolder digital asset management platform.\n\nOur portfolio of capabilities lets customers connect to a range of workloads unmatched in the collaborative work management space. These differentiated offerings give our customers the keys to unlock massive value within their organizations. An example of this is InfoBlox, a leader in next-generation DNS management and security, that has increased its Smartsheet usage by close to 4x since 2019. As more teams and departments at InfoBlox adopted Smartsheet, they began to see opportunities to create more integrated centralized workflows using premium capabilities.\n\nOver time, they deployed Data Shuttle to set up a sync between their CRM and Smartsheet plus advanced reporting capabilities that help summarize their data and enable faster and more important decision making. In Q2, InfoBlox upgraded to advance to access the full value of Smartsheet's premium capabilities and they plan to implement a scalable, automated and secure OKR solution using control center and Dynamic View. We're seeing more large customers deploy advanced to access multiple capabilities such as Data Shuttle, Control Center, DataMesh, and Bridge for complex workloads that need to integrate with other systems in their organization. For example, the technology and consulting provider NV5 implemented Control Center to automate the creation of their primary customer engagement templates to save time and achieve consistency while still allowing for changes over time.\n\nThey are also using Work Apps and Dynamic View to create custom views for field teams that only show them the information that is relevant for their role, helping ensure data security at scale. And revenue from capabilities continues to grow rapidly and now accounts for 28% of our subscription revenue compared with 22% in Q2 of last year. Advanced, which package's various capabilities was included in 300 deals in the first half of this fiscal year, including those with biopharmaceutical company, [Inaudible] crown roofing and waterproofing and Elligo Health Research. The growth potential for capabilities remains very strong.\n\nThrough Q2, only around 7,000 of our more than hundred thousand customers had deployed at least one capability. Those customers are realizing significant ROI on their Smartsheet deployments and are expanding at a rapid pace. This value realization naturally gets the attention of senior executives who are increasingly involved in the decision-making process. This value-based enterprise go-to-market motion has demonstrated an increase in executive leaders selecting Smartsheet as their CWM platform of choice.\n\nI'd like to highlight a few Fortune 100 companies where that's happening. In Q2, a Fortune 100 entertainment company expanded its Smartsheet investment by over $700,000 taking their total ARR to over $3 million. With this expansion, they migrated to the next tier of connected users for their advanced goal deployment. This company has doubled the number of paid licensed users over the past year, adding roughly 3,000 enterprise licensed users and has now tens of thousands of connected users and that number is expected to increase further as Smartsheet is now the central component in the company's effort to consolidate the work management solutions it uses.\n\nAn executive in their IT department suggested that other CWM platform used in the organization will be retired in favor of Smartsheet. A Fortune 50 pharmaceutical company more than doubled its ARR to almost $1 million, as its teams rely on Smartsheet to help them manage their spin-off of one of its divisions and will continue to use Smartsheet in the resulting two companies. Most important, the company's expected ROI of its Smartsheet deployment is $3 million in just year one. We also won an RFP at a Fortune 50 food and beverage company to become their global standard for collaborative work management.\n\nWhile this company is a low six-figure customer today, this RFP win sets the table for rapid growth over the next few years. RFPs are still rare for our business, but this shows that in a rational head-to-head comparison, Smartsheet 1, thanks to our years of investing in our platform to delivering extensibility, scalability, and security at businesses demand. One more example, I'd like to share from Q2 is a Fortune 10 technology company that expanded by over $1.7 million in Q2, accelerating our growth within this organization to a total of $7.6 million in ARR. Last year, we became a globally approved CWM platform for the company.\n\nThis approval has helped fuel significant adoption of Smartsheet across several dozen large departments. Previously, I've emphasized the importance of our Brandfolder digital asset management platform as key to cementing our leadership in the CWM space. Naturally, we've spent a lot of time understanding how to optimize workflow management for marketers. One of our insights is that marketers need to distribute content across more channels at higher velocity while ensuring brand consistency.\n\nMarketing teams are being asked to do more and more with fewer resources. To meet customers' expanded content distribution needs, we've acquired the leading brand management templating and creative automation platform Outfit. Outfit will turbocharge Brandfolders' content distribution capabilities, making us a leader in the content automation and management space. We're looking forward to introducing Outfit and the many other exciting new Smartsheet features and capabilities to thousands of users that are engaged 2022 customer conference taking place September 19 through 22 in person for the first time since 2019.\n\nIn closing, the new economic reality organizations are facing has impacted a portion of our business. Yet we remain confident in our abilities to deliver long term, durable growth and profitability. This confidence is due to our position in the market, our differentiated suite of capabilities and our market leading presence in the largest companies in the world. We're carefully managing our resources to drive improved margins and we remain on track to achieve breakeven free cash flow by end of this fiscal year.\n\nAnd now, I'll turn it over to Pete. Pete?\n\nPete Godbole -- Chief Financial Officer\n\nThank you, Mark, and good afternoon, everyone. As Mark mentioned, Q2 was a strong quarter that reflected durable growth, a product set that powers how work gets done in the largest enterprises around the world and a resulting business model that shows sustained progress to profitable growth. We saw this in 40%-plus revenue and billings growth, dollar-based net retention rate greater than 130% and gross churn that is at a record low of less than 4%. In July, we began to see macro-related headwinds in the form of elongating sales cycles, procurement policy changes, fuel compression and lower pipeline growth rates.\n\nThis trend has continued into August. We have incorporated those macro headwinds into our updated full-year guidance and I will provide additional details toward the end of my prepared remarks. Regarding the composition of our customer base, approximately 50% of our ARR now comes from enterprises with over 2,000 employees, with only a quarter coming from SMBs. Our ARR also remains very diversified with only 13% coming from our largest vertical.\n\nAs Mark mentioned, we recently acquired Outfit to enhance our Brandfolder offering. We expect the revenue and billings contribution from Outfit to be around $1 million each for the rest of the fiscal year. I will now go through our financial results for the second quarter. Unless otherwise stated, all references to our expenses and operating results are on a non-GAAP basis and are reconciled to our GAAP results in the earnings release and presentation that was posted before the call.\n\nSecond quarter revenue came in at $186.7 million, up 42% year over year. Subscription revenue was $173.5 million representing year-over-year growth of 43%. Services revenue was $13.2 million representing year-over-year growth of 24%. Turning to billings.\n\nSecond quarter billings came in at $205.6 million representing year-over-year growth of 44%, approximately 91% of our subscription billings were annual with 4% monthly. Quarterly and semi-annual represented approximately 4% of the total. Multi-year billings represented approximately 1% of total billings. Moving on to our reported metrics.\n\nThe number of customers at ARR over $50,000 grew 48% year over year to 2,738 and the number of customers with AR% over $100,000 grew 63% year over year to 1,220. These customer segments now represent 58% and 44% respectively of total ARR. The percentage of our ARR coming from customers with ARR over $5,000 is now 88%. Next, our domain average ACV grew 28% year-over-year to $7,557.\n\nAs a reminder, we continue to experience healthy growth of new customers. New customers typically begin their Smartsheet journey at smaller dollar values than our overall average ACV. These initial lands put some pressure on our domain average ACV growth rate in the near term, but provide a healthy base for expansion in the future. We ended the quarter with a dollar-based net retention rate of 131%.\n\nThe full churn rate dropped further and is now below 4%. Given the current macro environment, we see a scenario that would cause our overall dollar-based net retention rate to be in the mid to high 120s by the end of the year. Now turning back to the financials. Our total gross margin was 82%.\n\nOur Q2 subscription gross margin was 87%. We continue to expect our gross margin for FY '23 to remain above 80%. Overall, operating loss in the quarter was negative $16.1 million or minus 9% of revenue, which represents a five percentage point sequential margin improvement. The margin improvement was a result of cost-saving initiatives we discussed last quarter, which included moderation of our hiring plan and cost rationalization.\n\nAdditionally, we led a significant portion of our revenue outperformance dropped to the bottom line, demonstrating the operating leverage inherent in our business model. Free cash flow for the quarter was positive $7.1 million, bringing our free cash flow total in the first half to negative $2 million. Looking ahead in Q3, we have three large cash outflows that are unique to the quarter related to our engaged customer conference, one extra payroll run-in the quarter and a semiannual contractual payment related to a cloud provider. Given these outflows, we expect our Q3 free cash flow to be negative $20 million.\n\nNow let me move on to guidance. As we mentioned previously, toward the end of July, we saw macro-related headwinds begin to emerge. These headwinds continued in August and have impacted our sales productivity and ramp time for our newer sales reps. Given these trends and our preference for prudence, we are taking a thoughtful approach to our full-year guidance and electing to guide under the assumption that the macro pressures continue through the end of the year.\n\nFor the third quarter of FY '23, we expect revenue to be in the range of $193 million to $194 million and non-GAAP operating loss to be in the range of $21 million to $19 million. As a reminder, in Q3, we will host our first in-person customer conference in three years, which we believe will result in incremental expenses of around $5 million on our sales and marketing line. We expect non-GAAP net loss per share to be between $0.16 and $0.15 based on weighted average shares outstanding of $130.5 million. For the full fiscal year '23, billings are expected to be in the range of $870 million to $880 million representing growth of 32% to 33%.\n\nWe expect our revenue to be $750 million to $755 million representing growth of 36% to 37%. We expect services to be 7% of total revenue. We are improving our non-GAAP operating loss to be in the range of $75 million to $65 million and non-GAAP net loss per share to be between $0.56 and $0.49 for the year based on approximately $125 million weighted average shares outstanding. This improvement in our profitability is due to cost reductions and efficiencies identified in non-revenue generating areas of our business combined with a more measured investment posture we articulated earlier this year and a careful evaluation of our expenses and policies.\n\nWe are maintaining our free cash flow guidance for the year of breakeven. To conclude, Smartsheet is a system of work able to scale for the largest most demanding businesses in the world. With ARR approaching three-quarters of $1 billion and revenue growth in the high 30s, I believe our value proposition positions us to deliver long-term durable growth, with improving margins and outsized cash flows. Now, let me turn it back to the operator for questions.\n\nOperator?\n\nOperator\n\n[Operator instructions] Your first question today comes from the line of John DiFucci with Guggenheim Partners. Your line is now open.\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nThank you. I have a question for Mark and then a follow-up for Pete. Mark, your commentary about the strength of the quarter, did that sort of agrees with our calculations anyway for new business in the period. I realize there were some things that you're seeing in the macro environment and makes sense to me to be as you and Pete both said more prudent regarding your outlook.\n\nBut just a clarification on the ramp time for new reps. Is the time required growing simply because of the macro backdrop or has the job gotten more difficult as you build out your platform. I mean, I think about Smartsheet years ago, when I first became acquainted with you, and it's a -- Smartsheet, the application is just -- it's a much more sophisticated -- it's still easy to use, but it's a more sophisticated and complex application. And I'm just wondering if that job has just gotten more sophisticated, the requirements for the sales job?\n\nMark Mader -- Chief Executive Officer\n\nI think the requirements have, John, but I've also seen the support mechanisms we have around enablement and the tooling dramatically improved from the early days. So I think with that larger surface of the offering and more value we can deliver, I think we have put good support structures in place for that. So I would point to macro as being the largest impact. And when you look at bringing in many new sales reps at the beginning of the year where they're being assigned existing accounts, most of our bookings motion is expansion.\n\nThose new reps are going to talk to existing customers. And I think that relationship between the new rep who's trying to articulate value to an experienced customer. I think during these times, there's a more pronounced effect that comes from it, but we're supporting our reps. We're investing in new tooling.\n\nAnd I think it's going to result in capacity that we get to carry next year as well. So I think there will be a pay-off.\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nOK. Good. And so it's good to hear, you're not going to give them an out to say it's a harder job, that's great. Pete, listen, this looks like to us anyway a really strong quarter and a big uptick from last quarter, at least from the way we look at it.\n\nAnd again, I get the prudent guidance here. But I'm just wondering, when you gave the guidance, are you assuming the macro backdrop just sort stays as it is, or that it continues to soften through the rest of the year?\n\nPete Godbole -- Chief Financial Officer\n\nSo our assumption John is that the backdrop -- economic backdrop stays fairly consistent and slightly weakens as we go through the year.\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nOK. Great. Thanks. That makes a lot of sense to me.\n\nOK. Thanks a lot, guys.\n\nMark Mader -- Chief Executive Officer\n\nThanks, John.\n\nOperator\n\nYour next question comes from the line of Terry Tillman with Truist Securities. Your line is now open.\n\nUnknown speaker -- Truist Securities -- Analyst\n\nGreat. Thanks so much for taking the question. This is Robert [Inaudible] for Terry. My first question relates to macro positioning.\n\nI'm curious how does the playbook change if at all for continuing to drive new logo strength amid a tougher macro environment? And what are some of the assumptions for new logo adds implied in the current guide? And then I have one follow-up. Thank you.\n\nMark Mader -- Chief Executive Officer\n\nSo our assumption, as you looked at -- your question was on looking at sort of where we're seeing the macro changes and our environment. I think we've seen it across the board. We've seen it in all segments of our business. And what I would say is that it's not in any particular vertical, it's spread across all elements of it and that's what we've assumed in our forward-looking guide.\n\nWe've extended what we saw in July and August all the way through the year.\n\nPete Godbole -- Chief Financial Officer\n\nAnd on the new logos, we continue to see with quite a low entry point in terms of dollars, both the volume and the velocity has remained. And as I speak to peers and other SaaS businesses, it's what many of us are seeing. It's what we're seeing on the -- more critical eye coming to the larger expansion opportunities or maybe the additional layers of approval coming into play. But on the sub couple of thousand dollars new business logo, those are still flowing quite well.\n\nUnknown speaker -- Truist Securities -- Analyst\n\nOK. Great. Thank you. And then as a follow-up, nice to see some impressive benefits stats on Brandfolder out at Forrester last week.\n\nHow much Brandfolder's ROI proposition been resonating with customers, both for those who have adopted this solution and for folks who haven't? And how might that evolve with the addition about that? Thank you.\n\nMark Mader -- Chief Executive Officer\n\nWell, the addition of Outfit is an interesting one because it's a response to what we're hearing from some of our larger enterprise opportunities where they have larger teams who have larger production needs. And that need for content automation really ties out to the enterprise opportunity. So I think it's a really strong -- it's a very favorable impact to Brandfolder's ROI statement. But even in mid-sized companies, I think there's still a lot of learning in the market right now about graduating from simply having your digital assets available to you to be able to tag them, distribute them, measure the usage of them.\n\nAnd when people take the time to read that ROI, they can hear from a rep, we're seeing very positive response. We're still in that early phase of getting Brandfolder ramped on all of our reps. So that co-selling motion between our Brandfolder team and our mainline reps, that's something which we would expect to continue to strengthen throughout the year.\n\nUnknown speaker -- Truist Securities -- Analyst\n\nThat's great. Thanks so much.\n\nMark Mader -- Chief Executive Officer\n\nYeah.\n\nOperator\n\nYour next question comes from the line of Michael Turrin with Wells Fargo. Your line is now open.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nHey. Great. Thanks. Appreciate you taking the questions.\n\nFirst is just kind of a higher-level question. It ties into some of what you're saying and it's consistent of what we're hearing more broadly across software, just signs of elongation, more scrutiny and sales cycles and deal decisions. I'm just wondering if you're finding tangible stats around ROI or efficiency gains or just how well equipped your sales team is to raise their hand in position as these conversations just kind of just continue to layer on across software?\n\nMark Mader -- Chief Executive Officer\n\nYeah. I think the -- especially when we're introducing our premium capabilities, those capabilities are either advanced, which is a package of them or the one-off capabilities. I think those lend themselves most strongly to an ROI statement. And when people can move from qualitative to quantitative measures, the confidence goes way up in the sales cycle.\n\nI think what we're looking to do is, how do you get more of those capabilities exposed to more people earlier? So part of what we're doing on the engineering side over the next year is figuring out how we can get more of that portfolio exposed to people on a self-directed basis as opposed to a human-assisted sales basis. So I think it will be very interesting to see next year how that more self-directed digital motion can open up more of the portfolio. But when you talk about things like control center and data shuttle and content automation lifecycle, It is grounded in doing more things letting the system, do more things in an automated way that can tie up directly to a human being or set up human beings not needing to be as involved. And that's where people feel very confident in the formula.\n\nAnd so my aspiration is how do we get more of those capabilities driven into the median buyer as opposed to 7,000 of our more than one hundred thousand customers.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nThat's super helpful. I think you've already gotten some questions just around the metrics on Q4 look strong. You're talking about low churn and the expansion rates holding in relatively well. In terms of what you're guiding for, just is it fair to assume that more of those impacts show up on the net new side of your business? And I know there's generally a 4Q heavier billings dynamics.\n\nSo just anything you can add around visibility you have into the existing base there given some of the uncertainty you're seeing?\n\nPete Godbole -- Chief Financial Officer\n\nYeah, Michael. If you look at the change in our billings guidance, which is the key part of the conversation, it is all in the existing expansion business and it's really net expansion side of it where this is playing out. And if you sort of break it down into a few categories, you'd say of the total change, 1% of it probably comes from FX, 1% of it is almost tied to Europe and the economic weakness we're seeing in Europe. And of the balance of the numbers, there's probably 2%of it tied to just taking this large class of sales reps and getting them to the median level of productivity for our experienced reps.\n\nAnd then the rest of it is in the macro changes out there. Hopefully, that gives you the color you're looking for.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nAppreciate you quantifying, I like that. Very helpful. Thanks.\n\nOperator\n\nYour next question comes from the line of Brent Thill with Jefferies. Your line is now open.\n\nBrent Thill -- Jefferies -- Analyst\n\nPete, just on the margin, how are you thinking about the environment we're in, and the expenses that you're carrying going forward. Are you still holding your plan for quarter reps and the investments that you had planned in early year? Are you tapping their brakes a bit there as well to tighten up that approach?\n\nPete Godbole -- Chief Financial Officer\n\nBrent, I think what we're focused on is driving operational efficiencies in what I call the non-revenue generating growth that we've got, we've moderated our hiring plan, focusing on ancillary and support roles that aren't core to revenue generating sort of activities, if you will. We've also taken the approach of what I call hiring in different locations and really focusing on things which every expense dollar is important and taking the approach of, we'll review every dollar and find efficiencies there. As it relates to the sales rep and the quota class, we feel really good about the capacity we're carrying in and it's going to set us up really well not just for this year, but the way we think of FY '24 and how that appears. Now it will make changes to our sales capacity based on sort of management adjustments as we onboard reps, but that's the plan.\n\nBrent Thill -- Jefferies -- Analyst\n\nOK. And then just a quick follow-up. When you guys talk about some of the pressure you're seeing, is it more seat based? Are you seeing more in seats or this upsell to higher value inside the install base? What are you seeing there?\n\nMark Mader -- Chief Executive Officer\n\nI think we're seeing it in two forms. I think we're seeing it, I would describe it in terms of customers who are earlier in the journey are seeing more of it, so that could be a seat-based expansion or their ability to buy capabilities and packages, you're seeing some of that. But I think you're not seeing it as much and customers who are way down the journey with us. And have seen the full value and there, I would say expanding at rates which were consistent with what we planned.\n\nBrent Thill -- Jefferies -- Analyst\n\nThanks.\n\nOperator\n\nYour next question comes from the line of George Iwanyc with Oppenheimer. Your line is now open.\n\nGeorge Iwanyc -- Oppenheimer and Company -- Analyst\n\nThank you for taking my question. So maybe following up on sales investment priorities that you just talked about, Pete. Can you give us some perspective on the R&D priorities and how you're looking at the near-term investment that you're prioritizing now?\n\nPete Godbole -- Chief Financial Officer\n\nYeah. Thought of R&D is, we hired a large class of our R&D kind of capacity we needed early in the year and we continue to build that through Q2 and sort of very targeted areas we knew we needed to grow in. So that's been the playbook. We're going to be looking at opportunistic hiring in R&D as we go through the year, but we're certainly not sort of indexed to the same level of hiring we had in the first half.\n\nGeorge Iwanyc -- Oppenheimer and Company -- Analyst\n\nOK. And maybe, Mark, I've following up on that, can you give us a sense like you talked about the self-service investment? Are there other areas either from an M&A perspective or a roadmap that you're really focused on?\n\nMark Mader -- Chief Executive Officer\n\nYeah. As we head into Engage, we're going to be announcing a number of things in late September. And they really go across the entire portfolio from enterprise control and governance capabilities to scale capabilities in our control center line to experiential things that impact every new collaborator and every new person who signs up for our service. Yeah, I think one of the things -- one of the benefits we get from operating at scale is that we don't have to make choices at the expense of one of those important areas.\n\nSo I really feel good about the investment balance we've achieved and we have not had to eliminate focus from any one of those important pains.\n\nGeorge Iwanyc -- Oppenheimer and Company -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Rishi Jaluria with RBC. Your line is now open.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nWonderful. Thanks so much for taking my questions. Maybe first, I wanted to start just doubling down a little bit on Brandfolder and Outfit. It does feel like you're maybe and please tell me, if I'm wrong on this interpretation, it does feel like you are kind of doubling down on the marketing used case.\n\nI know this is a horizontal platform. There's virtually unlimited used cases. But can you maybe talk a little bit about the feedback that you had been getting from customers and prospects that led to kind this motion to go deeper on the marketing side? And then I have a follow-up.\n\nMark Mader -- Chief Executive Officer\n\nYeah. I think when you could identify a pattern of requests especially within the enterprise-class buyer. It's a huge gift when you see a pattern emerge, in terms of what multiple people want. And this notion of being able to store and classify and distribute content, everyone gets that.\n\nI would say the importance of not just being able to create a template, which is here's my digital asset, I need to overlay some content on it, but saying, I need to do that at scale because I'm running a campaign with 30 different assets that needs to be created. If you don't have that, you're basically telling someone build it manually, do 300 assets and what content automation does for you, it says define your frame, have your content which will live in a Smartsheet and then merge that and you can eliminate a lot of manual load within your design team. Like that is a really easily understood concept. What we're seeing within Brandfolder is that the resonance of digital assets is starting to expand beyond marketers.\n\nSo when you have people within health, within construction, within tech, all came off from it. I think it's still early, but we are definitely seeing signs of relevance outside of the marketing function. But I think the content we're -- as we talk about quantifying value, the absence of this content automation, I think, puts you back in the foresee into sort of a manual discussion, which is really counter to our thesis. So I think it's a really nice complement to what our brand promise has been.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nWonderful. That's really helpful. And then look, I appreciate all the commentary around expense control, obviously, the prudent thing to do in this environment. But maybe one that I'd like to drill down a little bit more on is a stock comp, right? It definitely continues to get elevated, right? SBC is now about 25% of revenue.\n\nYou're tracking close to 4% annual dilution. I know it's obviously a messy way to analyze it. But maybe taking a step back, can you talk a little bit about your philosophy around stock comp and any kind of longer term or medium-term plans you may have to kind of get stock comp down over time? Thank you.\n\nPete Godbole -- Chief Financial Officer\n\nSo, Rishi, this is Pete. Your question on stock comp, let's talk about the texture of how stock comp is created. You're generally carrying a cohort of multi-years of grants, which all they're into sort of annual compensation levels, they become a part of the stock grant calculation. We're extremely mindful in controlling and managing this expense.\n\nAnd it starts with how we think of stock and how we think about leveraging it. So we haven't taken the approach of what I call regreening our entire population. We've taken a very thoughtful approach of saying, we're going to focus on selective number of hires coming into the business, granting them stock on what we consider as a reasonable basis and really managing that the total stock grants first and then driving that into compensation expense and ensuring that we have outcomes that are acceptable to us. So that's been a part of a deliberate effort, Mark, myself, and the management team have gone through.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nAll right. That's really helpful. Thank you, Pete. Thank you, Mark.\n\nMark Mader -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Scott Berg with Needham. Your line is now open.\n\nScott Berg -- Needham and Company -- Analyst\n\nHi, everyone. Thanks for taking my questions. I guess on the pivot just a little bit and talk about Outfit a little bit more. Obviously, small purchase price here.\n\nYou're not obviously buying customers here, you're getting product on this. Help us understand a little bit more of the fit with Brandfolder and from a pricing product perspective, is this something that can really drive ARPU in a significant way over time as you develop the product as you want or is this more of a maybe a smaller add-ons that just helps create maybe some modest differentiation from the rest of the competitor set?\n\nMark Mader -- Chief Executive Officer\n\nI think first, Scott, it would -- I really see it as an opportunity to improve our win rates with Brandfolder. So I think that's the primary benefit. There is evidence within their customer portfolio that large organizations have signed significant value to this. Now that is an emerging set of evidence, but we see at scale some of those -- some of their customers being multiples of size of the average revenue that a Brandfolder customer would have stand-alone.\n\nSo we will integrate it. We do see it as an add on for which we will charge as opposed to having it be a freebie. The degree to which that will manifest itself in a meaningful adjustment to our revenue early days. But I absolutely see this as a buy-up opportunity for customers because there's such value associated with it.\n\nScott Berg -- Needham and Company -- Analyst\n\nGot it. Helpful. And then following up on Pete's comments earlier about sales rep hiring this year and most of the -- I guess not necessarily cost reductions, but delayed hiring is in non-kind of sales or revenue-generating positions here going forward and the rest of the half is -- should we take that kind of the same way around the rest of the sales kind of ecosystem within the company outside of just the quota bearing sales reps?\n\nPete Godbole -- Chief Financial Officer\n\nYeah. I think we've taken the approach of the quota-carrying field carriers, there's many of them in those roles. We're generally leaving that capacity sort of as the capacity we want to deal with and help us for '24. But there's support roles in sales are a part of like our moderated hiring plan.\n\nIn terms of infrastructure roles that support sales systems, those that consider more in the box of what I call the rest of the folks who support the sales organization.\n\nScott Berg -- Needham and Company -- Analyst\n\nGot it. Very helpful. Thanks again.\n\nOperator\n\nYour next question comes from the line of Jacob Roberge with William Blair. Your line is now open.\n\nJake Roberge -- William Blair -- Analyst\n\nHey, guys. Thanks for taking my questions. I was just wondering if you could talk more about the demand that you're seeing in some of those newer products like Work Apps or Data Shuttle and Brandfolder? And have any of these been more or less prioritized given the uncertain macro environment and some of headwinds that you'd experienced over the last month?\n\nMark Mader -- Chief Executive Officer\n\nYeah. I would say the ones that are really resonating are the ones, but there's such a clear economic return on the decision, so Data Shuttle is a great example. Do you want to be manually managing ingress, egress of data in your system or do you want to put it on rails and hit to go button. I mean it's a super simple value prop.\n\nSo that one is probably the highest velocity, simplest to describe. I would say on the Control Center one, where it's analogous to Data Shuttle in the sense that do you want to have a program and replicate it manually and do all of the portfolio management hand the mouth or do you want to put it on rails and control center have it do it for you? Those are concepts which are landing really well. I would say on the Brandfolder side, the degree to which a company has big distribution needs, the degree to which it has content automation needs, the degree to which it has a templating need, that drives the degree to which there's a strong ROI case for Brandfolder. If it's simply a -- I'd like to store my assets in a more digital -- more beautiful digital way, that's not really carrying the data fully.\n\nSo we're really mindful of understanding what that need is from the customer before we make that ROI promise. But again, back to those the Data Shuttles are Control Centers and the Brandfolders, the ability for us to get our reps in a position where they can present that value is really, really landing well with folks right now.\n\nPete Godbole -- Chief Financial Officer\n\nAnd one of the second part of your question was what's changing in the demand environment. So we've seen people really appreciate the impact of our premium apps called capabilities that really help us. We are happy, we want to sell people the package because it's easier for them to consume and it helps them long term. But we're open in this environment and we're seeing customers elect in cases to buy them out of the car because that's the way they want to consume them.\n\nSo we have the flexibility in our model to do both and we're going to take the total addressable market in the way customers want to sort of use it.\n\nJake Roberge -- William Blair -- Analyst\n\nGreat. Thanks. That's really helpful. And then could I just double click on some of the sales headwinds that you're experiencing? Is it really just a macro and training issue or are there any territorial or quota restructurings that you plan to complete over the balance of the year?\n\nPete Godbole -- Chief Financial Officer\n\nSo I think the headwinds we described were three part. There was an elongated set of sales cycles we were seeing. We're talking about seeing some deal compression. And then there was an additional level of approval layers that were being introduced into the process.\n\nSo those are the what I call macro elements that we were seeing across everything we were sort of experiencing in our entire base, if you will. The second part of your question was, what was additional is, we had taken sort of a very large class, introduced that into the field and what we found is that there was more ramp time needed to get these folks to be productive. Not -- they're productive today, but they could be more productive relative to our experience trips. And that's the effort we're driving with single-minded focus to get through.\n\nJake Roberge -- William Blair -- Analyst\n\nSounds great. Thanks for taking my questions.\n\nOperator\n\nYour next question comes from the line of Keith Bachman with BMO. Your line is now open.\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nYes. Thank you. I have a couple really focused on margins and I want to kind of build on the previous question on SBC. If I look at the -- your operating loss is improving pursuant to your new guidance, yet even if I kind of look at Q4, it's still guessing a little bit here, but negative 5% kind of operating margins.\n\nAnd the broader question I want to start with is, as we reflect on our models here, how do we get to improve profitability? What's the key attribute because you're your average ACV is still pretty small relative to your client base $700,000. And so your sales and marketing is certainly high relative to most software companies. So the question is, how do you improve your reach and grow your ACV, but at the same time I think satisfy investors that in fact you can improve your margins, not only improve but start to generate non-GAAP operating profit dollars, but if you just -- is it simply scale, but how do you solve that sales and marketing riddle and really reach the operating profitability?\n\nMark Mader -- Chief Executive Officer\n\nDespite, Keith your question has two components to it and I'll speak to both. I think the first thing we're seeing in our business is our largest customers are driving the greatest profitability for us. So as we get bigger, just the natural migration of the model to a larger percentage of our business coming from these larger customers as an inherent lift in profitability. The second part of that is, when you think of like introducing newer products like Brandfolder.\n\nWhat we do is we leverage our mainstream sales force in what we call our prime core prime model where we're not adding pro rata sales and marketing dollars, we're leveraging an existing base to farm demand and using that as a uplift to our margin profile. So think of those as the two drivers, which would you think as drivers as examples in the sales and marketing efficiency camp. And then there are things which we achieve at scale. The larger we get, the more we get to use location, geographic hiring, efficiency and automation which we get to build in.\n\nWe've taken a single-minded focus in doing that effectively and efficiently. And between those elements, we have a story we've built out for this year, but we don't expect it to stop here. We expect it to continue into future years as well.\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nOK. Yes, I think investors like to understand what the roadmap looks like, but I assume we'll find out your guidance in a few quarters on 2023 -- or FY '24, excuse me. But you led into my second question is really how do you think about M&A and if you -- are there parameters that you think about in terms of willingness to do deals that might positively or candidly negatively impact your operating margin trajectory? Are there any boundaries that you would not do a deal in terms of the margin impact. If you could just talk a little bit more about the philosophy on M&A as it relates to the impact of margins?\n\nMark Mader -- Chief Executive Officer\n\nTo give a signal that we've used in the past has historically always been where customers and enterprise buyers are telling us that there is a demand and there is a clear established signal. And why that's important is because you're establishing that into where you can eke out a return in terms of top line sales dollars and growth. So we are looking at adjacencies, which fit that profile. That's the first thing we've done.\n\nEven with the most recent acquisition of Outfit, it really helps our Brandfolder sales perspective in future fiscal years that's what we've indexed on. So you asked me about the boundary conditions, we're being extremely thoughtful about returns that acquisitions give us and that's been the metric we've been using. What's the dilution impact it has? What's the accretion I expect in the top line? And how am I trading against those?\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nRight. OK. Well, congratulations to result given the backdrop seemed pretty solid. So congratulations.\n\nThat's it for me. Many, thanks.\n\nMark Mader -- Chief Executive Officer\n\nThanks, Keith.\n\nOperator\n\nYour next question comes from the line of Pinjalim Bora with J.P. Morgan. Your line is now open.\n\nPinjalim Bora -- J.P. Morgan -- Analyst\n\nGreat. Thank you for taking the questions. I want to go back to the elongated sales cycles comment. Could you give us maybe more texture around if it was more enterprise/smaller mid-market business driven, was there any difference between the various geos? And was the elongation largely turn around larger size deals versus smaller?\n\nMark Mader -- Chief Executive Officer\n\nSo when we looked at it, there was a general elongation of sales cycle, but I think it was more pronounced in the enterprise because you think of a sophisticated buyer that looks at every deal and the mechanisms they have to react to things before their fully trends in their business, we saw that. So that's kind of what we would represent as being elongating sales cycles by segment or tier.\n\nPinjalim Bora -- J.P. Morgan -- Analyst\n\nI see. Understood. OK. And the other question, I guess, when I'm looking at the billings guidance, I did this math pretty quickly, but seems like the second half flow is about 10 points versus the first half and seems like the slowdown was more pronounced during 2020 when you had to take the billings guidance off the table at that time.\n\nMaybe compare the two environments. What are you hearing -- what you are hearing from customers are seeing in the deals now versus what was in the that July -- April to July timeframe last in 2020?\n\nPete Godbole -- Chief Financial Officer\n\nYeah. I think the -- what we're seeing is the conditions that we saw in 2020 were quite new people, right? There were set of variables that many people had faced before. So I would say there was, while there is some lack of certainty on what -- how the conditions are improving or worsening. I would say we're dealing with slightly more recognized set of variables that we did in 2020.\n\nWhat's changed for us internally was different than 2020 is we had a different set of inputs we were dealing with. So this year, we brought on the largest class in company's history in the first half. We didn't do that in 2020. So how we're reacting is fundamentally to a different set conditions.\n\nIn terms of what the buyers are going through where the commonality does sit is they're asking for what's the value? What has changed a little bit this go around if not only what's the value, what's the return, but I would say there's more focus now on how quickly can you get that return to me? So I'd say the time horizon around the return on the investment is probably being more pronounced than it was in 2020.\n\nPinjalim Bora -- J.P. Morgan -- Analyst\n\nUnderstood. Thank you.\n\nOperator\n\nYour next question comes from the line of Steve Enders with Citi. Your line is now open.\n\nSteve Enders -- Citi -- Analyst\n\nHi. Great. Thanks for taking the question. I guess I'd ask a little bit more on some of the go-to-market aspects of the business.\n\nI think you mentioned that you thought there was more you could do on the sales enablement side to try and -- to try and turn things around. But how you're going to feel about the levers that you could potentially pull in some of the different marketing strategies to put in place to try and drive better penetration expansion rates and accounts?\n\nPete Godbole -- Chief Financial Officer\n\nI think one of the things that's a really welcome change is, in past years, our engaged conference has been a big driver in terms of customer education, understanding the possibilities and also spending time with our most valuable teams in person to develop account plans. It's the first time we're doing it three years. Registration for an in-person event is going well. That will be an event where we have thousands of people in Seattle.\n\nSo we have some of our largest teams, our largest customers already signed up where you have teams of people showing up representing those companies. So that's a really positive variable. I would say other things that we're doing is improving our product marketing and how we cross-sell and cross-introduce the portfolio that we know is single-digit penetrated today. So a big product marketing push in the second half is around developing new materials not just for enablement, but also to educate customers at the right time on what they could be doing with Smartsheet.\n\nAnd I think part of that is through -- we brought on a new CMO at the end of last year. Andrew and his team are hitting stride, they're developing new things, they're new product marketing team members and I expect that to start benefiting us in the second half. So we have some changing variables that should be positive as we exit this year and head into next.\n\nSteve Enders -- Citi -- Analyst\n\nOK. That's helpful. And then I guess kind of beyond the marketing area and what you're doing for Brandfolder there, I guess how do you think about other verticals or other core used cases, you could go after and really kind of simplify the solutions that kind of more tailor hit for some specific areas?\n\nPete Godbole -- Chief Financial Officer\n\nYeah. We're doing work right now on identifying commonality around use cases within our largest customers. So we just presented to our board this last week the approach we're taking on how to have a more recommendation based set of use cases that we can introduce to our sales team so there's commonality in the core value prop, not so much just like PPM and marketing, but like more specific granular functional used cases in certain industries where we've been very successful. So that is something which is very much in flight right now.\n\nI think the -- in terms of how our customers are responding to use cases, I would say, we continue to see requests for more sophisticated capabilities. I'll give you an example. For years, we sold the ability to manage projects at scale. And when we talk about applying resource to them, which we do very well, we have given people the ability to track resource allocation across their work, great.\n\nThe largest companies in the world are also saying, help me understand the forecasting of that. Don't tell me how I'm assigned, but what type of capacity do I have looking forward across the skill sets I have. There's a whole set of capabilities in project portfolio management and the management and utilization of resources that is being developed today, which is going to be coming out in the coming quarters. So we're extending the depth of some of these capabilities as opposed to saying what are other simple things we can do in adjacent spaces.\n\nSo I think the differentiation in our category, the winner long term will not simply be a very broad-based set of capabilities that are simple, but have very, very discrete differentiating enterprise capabilities that are deeply understood and in demand. So as we build our portfolio, it's not about just broadening, but deepening. And so far, we've seen those capabilities work really well.\n\nSteve Enders -- Citi -- Analyst\n\nPerfect. Thanks for taking the questions.\n\nPete Godbole -- Chief Financial Officer\n\nYeah.\n\nOperator\n\nYour next question comes from the line of Josh Baer with Morgan Stanley. Your line is now open.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nGreat. Thanks for the question. I think with billings linearity, I'd assume weighted toward the end of the quarter. Just wondering why the macro impacts that surfaced in July didn't have a more significant impact versus the 44% billings growth and billings outperformance in the quarter?\n\nMark Mader -- Chief Executive Officer\n\nThe impact that we saw in July was partway through July. So you saw some impact of it. And frankly, without that impact, we had an even bigger quarter in how the quarter would have played out in billings. So that's the trend we saw.\n\nAnd I think we saw that trend play out or extend itself far as we went into August as well and which became the basis of our guide.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nOK. That makes sense. So would you say May and June were sort of in line with your expectations or like kind of thinking month by month were those actually extra strong?\n\nMark Mader -- Chief Executive Officer\n\nNo. I think month by month, they were fairly consistent with what we would have expected and what we'd historically seen. So there was no -- nothing unusual about May or June.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nYour next question comes from the line of Andy DeGasperi with Berenberg. Your line is now open.\n\nAndy DeGasperi -- Berenberg Bank -- Analyst\n\nThanks for taking my question. I guess, I mean first just a follow-up on the employee side. I mean, as employment -- employee retention been an issue since the realignment particularly on the quota carrying side or have you not seen any changes?\n\nPete Godbole -- Chief Financial Officer\n\nWe have not seen a meaningful change in attrition rates.\n\nAndy DeGasperi -- Berenberg Bank -- Analyst\n\nGreat. And then secondly, just on the -- given the change in market conditions, I just wondered if you've seen an improved competitive environment, particularly from the smaller CWM players or has that been unchanged as well?\n\nPete Godbole -- Chief Financial Officer\n\nWe don't -- there's not a lot of head to head. As I said, when we have those -- like those rare but notable RFPs, we're talking single-digits in a quarter, right. So it's difficult to say what the others are experiencing. Again, most of our deals are not contested.\n\nMost of our businesses grounded in expansion where they're really committed to Smartsheet already. So it's difficult to say what they're saying. I think what we're benefiting from is where a lot of our demand comes from the usage of our product where we're not overly reliant on the new marketing mechanism, like advertising mechanisms. We are seeing through our analysis that there's been a little bit of a raise in cost of people having to battle it out for the next new dollar and that's something that we fortunately don't have to participate in heavily.\n\nAndy DeGasperi -- Berenberg Bank -- Analyst\n\nUnderstood. Thank you.\n\nOperator\n\nYour last question today comes from the line of Robert Simmons with D.A. Davidson. Your line is now open.\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nHey. Thanks for taking our questions. First to clarify one thing on the headwinds that you're experiencing. Are you seeing increased client point downgrades or user contraction of clients or is it really just on the economic expansion side of things?\n\nMark Mader -- Chief Executive Officer\n\nRobert, we're seeing it entirely on the net expansion side. Our churn remains at a record low level and I shared that our churn rate is now below 4%. So it's all on the net expansion side that we're seeing in these headwinds.\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nGot it. Great. And then have you built in any revenue benefits this year from holding engagement in-person or would that be upside to numbers?\n\nMark Mader -- Chief Executive Officer\n\nSo we built in some level of what I call, what we would expect a modest amount of an improvement in our close rate based on what we are experiencing with Engage in September, but we haven't built in a big upside.\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nGot it. That makes sense. Thank you very much.\n\nMark Mader -- Chief Executive Officer\n\nYou're welcome, Rob.\n\nOperator\n\nThis concludes today's Q&A. I now turn the call back over to Aaron Turner.\n\nAaron Turner -- Head of Investor Relations\n\nGreat. Thank you so much and thank you all for joining us today. We will speak with you again next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAaron Turner -- Head of Investor Relations\n\nMark Mader -- Chief Executive Officer\n\nPete Godbole -- Chief Financial Officer\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nUnknown speaker -- Truist Securities -- Analyst\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nGeorge Iwanyc -- Oppenheimer and Company -- Analyst\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nScott Berg -- Needham and Company -- Analyst\n\nJake Roberge -- William Blair -- Analyst\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nPinjalim Bora -- J.P. Morgan -- Analyst\n\nSteve Enders -- Citi -- Analyst\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nAndy DeGasperi -- Berenberg Bank -- Analyst\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nMore SMAR analysis\n\nAll earnings call transcripts"
}