{
  "companyName": "Turtle Beach",
  "companyTicker": "HEAR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/turtle-beach-hear-q2-2022-earnings-call-transcript/",
  "content": "Turtle Beach (HEAR 2.87%)\nQ2 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to the Turtle Beach second quarter 2022 conference call. My name is Abigail and I will be your operator for today's call. At this time, all participants are in a listen-only mode. Later we will conduct a question-and-answer session.\n\n[Operator instructions] Delivering today's prepared remarks are Chairman and Chief Executive Officer Juergen Stark, and Chief Financial Officer John Hanson. Following the prepared remarks, the management team will open up the call for any questions. As a reminder, this conference call is being recorded. I will now turn the call over to Alex Thompson.\n\nAlex, you may begin.\n\nAlex Thompson -- Investor Relations\n\nThanks, Abigail. On today's call, we will be referring to the press release filed this afternoon that details the company's second quarter 2022 results, which can be downloaded from the investor relations page at corp.turtlebeach.com, where you'll also find the latest earnings presentation that supplements information discussed on today's call. Finally, a recording of the call will be available on the investors section of the company's website later today. Please be aware that some of the comments made during this call may include forward-looking statements within the meaning of the federal securities laws.\n\nStatements about the company's beliefs and expectations containing words such as may, will, could, believe, expect, anticipate, and similar expressions constitute forward-looking statements. These statements involve risks and uncertainties regarding the company's operations and future results that could cause Turtle Beach Corporation's results to differ materially from management's current expectations. While the company believes that its expectations are based upon reasonable assumptions, numerous factors may affect actual results and may cause results to differ materially. So, the company encourages you to review the safe harbor statements and risk factors contained in today's press release and in its filings with Securities and Exchange Commission, including, without limitation, its annual report on Form 10-K and other periodic reports, which identify specific risk factors that also may cause actual results or events to differ materially from those described in our forward-looking statements.\n\nThe company does not undertake to publicly update or revise any forward-looking statements after this conference call. The company also notes that on this call, they will be discussing non-GAAP financial information. The company is providing that information as a supplement to information prepared in accordance with the accounting principles generally accepted in the United States, or GAAP. You can find a reconciliation of these metrics to the company's reported GAAP results in the reconciliation tables provided in today's earnings release and presentation.\n\nAnd now, I'll turn the call over to Juergen Stark, the company's chairman and chief executive officer. Juergen?\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nGood afternoon, everyone, and thank you for joining us. In the second quarter, we continue to launch and announce innovative, new products; maintain our leadership in console gaming headsets, and further advance our diversified product portfolio. While we executed on the business functions within our control, like many other consumer products companies, our second quarter results were impacted by the difficult macroeconomic conditions which have slowed discretionary spending across gaming and many other categories. The slump in consumer spending also caused retailers to reduce purchases above and beyond the drops in demand for gaming gear and more than we expected.\n\nIn addition, high gaming accessory inventories have led to increased promotional activities as retailers and competitors look to bring down inventory levels. In this challenging environment, we delivered net revenue of 41.3 million and an adjusted EBITDA loss of 12.7 million for our second quarter 2022. As a reminder, we had a near record second quarter of 2021 given the extraordinarily strong gaming market fueled by the pandemic and stimulus checks, recall too that high freight costs despite recent reductions continue to flow through the P&L as we sell through inventory that incurred those costs. According to NPD, most major gaming categories of spend experienced declines.\n\nU.S. retail sales in our core category console headsets were down over 30% in Q2. PC gaming accessories fared a bit better, but we're also down over 20%. Major European countries were down even more than the U.S.\n\nlikely as a result of the strong dollar incrementally impacting consumers in Europe. As we have in the past, we quickly recognize the swings in demand in our markets and took concrete steps to navigate these higher-than-expected headwinds. As part of our mitigation efforts, we implemented hiring constraints several months ago and completed select reductions in our workforce. We have also taken actions to reduce other costs where possible in our continuing our diligent focus on managing expenses.\n\nRecurring Q2 opex is down seven 10% from last year's Q2, and we expect these actions to reduce second half opex by around 5 million. Of course, we are continuing to invest into great new products and portfolio expansion that has enabled our sustained leadership in console headsets and generated significant new revenues over the past years consistent with our long-term growth strategy. We believe we are poised to come out of the market downturn even stronger; and although the challenging macroeconomic environment may continue for some time, we are confident that the gaming market will rebound; and when it does, we are likely to see pent-up demand and retail restocking that will create a period of stronger-than-normal growth. We then expect to see a resumption of the growth rates that have made gaming one of the best retail consumer markets for many years.\n\nI thought one NPD gaming analysts put it very well noting that 'in the short term, these factors mean declines uncertainty and turbulence, but in the long term, the growth prospects in the video game industry remain as strong as they have ever been.\" Gaming has historically performed well in turbulent economic conditions and gaming fundamentals remain strong. Millions of consumers have become gamers in the past two years. In fact, according to Newzoo, the number of new gamers added globally from 2019 to 202 totals nearly 400 million, which is staggering. To that end, June research from Bank of America shows 26% of consumers surveyed have added gaming as a new hobby since the pandemic, and 60% have increased their engagement in gaming over the past year.\n\nSteam is showing a 12% increase in concurrent users for July year over year. Newzoo is forecasting a 5% increase in gamers for 2022 and continued growth in global gamers to over 3.5 billion by 2025, up 16% from 2021. Interestingly, a recent Newzoo survey of active console gamers showed an increase in intent to purchase a headset in the next six months from 46% last year to 51% this year. Historical trends would indicate that console headsets have an upgrade and replacement pattern that has been reliable which should result in pent-up demand when consumer sentiment turns positively.\n\nAccordingly, we believe that the current decline in consumer demand for gaming accessories is temporary and will eventually rebound based on those continued strong underlying fundamentals. The retail inventory reductions that currently exacerbate the impact of the demand downturn do exactly the opposite when demand swings up, and freight costs have already started coming down. So those margin benefits will flow into the P&L in future quarters. So, while we are focused on managing through the current environment, we continue to execute on our strategy to position us well for the future.\n\nWe believe this is working well, and we'll be in a good place when the market recovers. Looking at the console gaming headset market, we continue to lead the category by far as the No. 1 U.S. console gaming headset manufacturer for 12 years running.\n\nIn the U.S. per NPD, three of the top five best-selling Xbox headsets, and five of the top 10 best-selling PlayStation headsets by dollars in the first half of 2022 were Turtle Beach headsets. We continue to produce the best and broadest line of console gaming headsets in the category which is reflected by our clear leadership. We launched new models of our premium wireless gaming headset series with the multiplatform Stealth 700 Gen 2 MAX for Xbox, which IGN recently named the best Xbox series XNS, aiming headset in their latest best gaming headsets 2022 story.\n\nOur new line of wireless console headsets has captured significant share at the premium 150 to 199 price tier, which contributed to a nice jump in share in June for us overall. We have additional new console headsets coming soon, including at premium price points. Our ROCCAT line of PC gaming accessories also continues to expand. The new Burst Pro Air Wireless PC gaming mouse is a symmetrical wireless, lightweight, and visually stunning mouse.\n\nT-3 recently gave this mouse a Platinum Award, calling it masterful gaming mouse. In addition, ROCCAT announced the Kone XP, the stellar wireless version of the recently released Kone XP. The wired version of this mouse was released earlier this year, was praised by games radar for its incredibly comfortable design. The expanded ROCCAT portfolio also saw a nice increase in sell-through recently, including a very positive impact from our new inline display at Best Buy.\n\nThe interactive display at Best Buy is a very exciting step in the development of our ROCCAT brand and portfolio. We're also excited on our lineup of gamepad controllers. We announced in our launching the all-new design for Xbox Turtle Beach REACT-R Controller, plus a new Arctic Camo colorway for the Recon controller. The REACT-R Controller is an even more affordable, high-quality controller with controls for game and chat volume balance, mic mute, and Turtle Beach's exclusive Superhuman Hearing sound setting for a competitive advantage.\n\nThe portfolio of controllers will continue to expand in the back half of the year, including mobile and cloud controllers, as well as exciting additions in our flight simulation category later this year, and in 2023. Our category expansion efforts continue to go well. Nonconsole headset revenues were 25% of our revenues for Q2 and continue to steadily increase as we expand our presence in PC gaming accessories, console controllers, and simulation products. We also proudly launched our Play with Purpose program, which advances our ESG initiatives and sets goals that are and will continue to be a core part of Turtle Beach business.\n\nLastly, before I turn it over to John to discuss the financials, I'd like to briefly comment on the strategic alternatives process that we announced in May. I would refer you to the press release we issued today for additional details. But to summarize, the strategic committee of the board with its financial advisor Bank of America ran a fulsome process, which included outreach to a large number of potential strategic and financial buyers, and received indications of interest to acquire the company from multiple parties. Not surprisingly, the uncertainty caused by the current macroeconomic conditions resulted in even those parties determining not to proceed further.\n\nTherefore, the strategic committee has determined to conclude the proactive outreach to potential buyers. Nevertheless, the strategic committee will continue to evaluate strategic opportunities consistent with the strategic committee's charter. Now, over to John to cover the financials in more detail. John?\n\nJohn Hanson -- Chief Financial Officer\n\nThanks, Juergen, and good afternoon, everyone. For the second quarter, we reported net revenue of 41.3 million compared to a near record 78.6 million in the year-ago period, where strong demand for the company's products were driven by stay-at-home orders, government stimulus payments, and a strong gaming accessories market in 2021. As Juergen mentioned, our Q2 2022 results reflect the challenging macroeconomic environment that we and others are facing. Gross margin in the second quarter was 19.1% compared to 36.5% in the year-ago period, due to the higher-than-normal promotional levels, business mix, higher freight cost, volume-driven fixed cost deleveraging, and higher warehouse costs to ensure product supply.\n\nSpecifically, high freight costs some late 2021 and early 2022 continue to roll to the P&L until those inventories are sold through. As Juergen mentioned, freight costs have already started coming down which will benefit the P&L later this year and into 2023. Operating expenses in the second quarter were 29.3 million, compared to 28.3 million in the year-ago period, including 6.8 million of nonrecurring costs, which are primarily proxy contests and related costs which the company is continuing to incur. Excluding these costs, operating expenses were reduced by roughly 17% year over year.\n\nExcluding nonrecurring items, we expect operating expenses for the full year 2022 to be lower by over 10% year over year due to the actions we've taken to lower costs. As Juergen mentioned, our second quarter adjusted EBITDA loss was 12.1 million compared to adjusted EBITDA of 5 million in the year-ago period. The year-over-year variance is primarily driven by the items I've covered above. Adjusted net loss for the second quarter of 2022 was 12.7 million or $0.77 per diluted share, compared to adjusted net income of 2.6 million or $0.14 per diluted share in the year-ago period.\n\nWe expect our effective tax rate for the full year to be approximately 25%. Now turning to the balance sheet at June 30, 2022, we had 10.9 million of cash and 15.7 million of borrowings outstanding on our revolving credit line. Inventories at June 30, 2022, were 120.7 million, compared to 81.9 million a year ago. The higher inventory balance is a reflection of lower-than-expected consumer demand and retail channel inventory levels, higher in-transit inventory due to longer ocean shipping times, and the company's prioritization to maintain product availability amid global supply chain and logistical challenges.\n\nWe do expect to convert a significant portion of this inventory into cash over the next two to three quarters. Now, I'll turn the call back over to Juergen for some additional comments. Juergen?\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nThanks, John. Given our belief that the current gaming market weakness is driven by consumer sentiment amid strong underlying gaming fundamentals, it's difficult to predict when this will turn around. Assuming the gaming market remains muted through 2022, we expect our full year revenues to be in the range of 250 million to 275 million. A soft market is likely to require continued higher promotional activity across our markets.\n\nThat, combined with high freight costs, as well as lower operating leverage, has put our expected gross margins in the mid-20s and will result in an expected EBITDA loss of 5 million to 15 million. As I've discussed, we believe the market conditions are temporary, exacerbated by retailer inventory actions that will reverse when demand swings up and high freight costs that are now trending down. Therefore, we see a better second half including year over year in Q4 driven by our expanded product portfolio, and we expect rapid improvement including growth and a return to profitability in 2023. Our key focus and highest priority is to execute well through these difficult consumer economic conditions.\n\nWe are confident the strong underlying fundamentals that have made gaming such a great market are intact and will drive an upturn in the market once consumer sentiment on discretionary spending normalizes. So, while we are diligently managing spend, given the current environment, including the proactive cost reduction actions I've discussed, we are continuing to execute on a clearly defined plan to leverage the strong gain trends in gaming market and capitalize on the opportunities ahead. We remain confident that the gaming sector remains the market to be in with a total addressable market of over 195 billion this year that is expected to reach north of 225 billion in 2025. Our diverse portfolio and proven strong consumer demand for our products have expanded our markets by over 7 billion and positioned us well for future success.\n\nOur long-term strategy remains the same. First, continue to lead the console gaming headset market where we have maintained market share of 40% or more for in the U.S. for 12 consecutive years. This success is driven by great products, valuable and patented innovations of go-to brand, and strong execution.\n\nI'm very excited about our new premium wireless models with the Xbox models taking share at premium price points and the PlayStation models on the way. Second, continue to expand in our PC gaming portfolio of headsets, keyboards, and mice; and grow our share in that 3.6 billion PC accessories market. We launched several stunning additions to the ROCCAT product portfolio and have additional exciting new products coming this year. And we are encouraged by the results we are seeing with our new Best Buy interactive display.\n\nThird, drive continued growth in the gamepad controller, gaming simulation accessories, and microphone categories that we entered in 2021. We just expanded our controller line and have cloud and mobile gaming controllers coming in addition to several additions to our flight simulation portfolio. These products further expand the markets we serve and will fully leverage the core competencies of the company. And fourth, we continue to identify and selectively evaluate other growth opportunities.\n\nOur business expansion across product categories in geographies is performing well, and we continue to look for organic growth and acquisition opportunities to expand our addressable markets and drive growth in line with our 10% to 20% long-term annual growth target. Our successful efforts to maintain our strong leadership in console headsets while significantly expanding our product portfolio and the market segments, we generate revenues and have positioned us very well for the future, both in terms of participating with the long-term tailwinds in gaming and also continuing to grow revenues and earnings over time. I again want to extend my thanks to the entire Turtle Beach team. Their diligent focus, execution, and ingenuity drives us ahead.\n\nThank you to the collective Turtle Beach team. With that, let's turn to our Q&A sticking to the quarter and business.\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] Please stand by while we compile the Q&A roster. And our first question comes from the line of Mark Argento with Lake Street Capital Markets.\n\nMark Argento -- Lake Street Capital Markets -- Analyst\n\nYou guys are thinking about kind of gross margins. You know, typically, we've seen when you transition from current-gen to next-gen consoles. There's been some, you know, you have some pricing, some sales, some promotional activity that typically weighs on gross margins. Given that we're kind of not in transition, but just highly inventory environment, what type of promotional activity do you guys anticipate seeing during the next holiday period? And how should we think about that relative to your gross margin guidance?\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nSure. So, we -- to reiterate, we expect gross margins this year to be in the mid-20s. That's reflective of higher-than-normal promotional activity which we expect to see in the second half. Competitors have been very, very promotional.\n\nAnd we've been a bit more conservative. But we do plan, for reasons of protecting our market position, to lean in a bit more in the second half. Plus, high freight costs that I mentioned are coming down over time. That impact on gross margins is significant, by the way.\n\nBut the rates have come down, and as the lower rates as that inventory starts to sell through, that'll benefit the gross margins later this year and going into 2020. And then obviously, this year is impacted by lower operating leverage with the lower revenues per quarter.\n\nMark Argento -- Lake Street Capital Markets -- Analyst\n\nOK. It's helpful. Then just shifting on kind of FX impact. I mean, you know, what are you guys' thoughts on the amount of FX impact we should anticipate seeing here? I know it's hard to quantify this given it's a moving target.\n\nBut on a relative, you know, call it a constant-currency basis, how does that impact your thoughts on revenue guidance?\n\nJohn Hanson -- Chief Financial Officer\n\nYeah, so thanks, Mark. Hey, it's John. It's been pretty minimal impact on us. Significant portion of our business is in U.S.\n\ndollars today. So, it's not had the type of impact as it has on others, roughly several millions.\n\nMark Argento -- Lake Street Capital Markets -- Analyst\n\nGreat. That's good to hear that as much impact as you would expect. And then just pivoting in terms of the, I think, you mentioned 25% of sales came from nonconsole headsets in the quarter. You know, what -- you know, were you thinking about long-term goal there? I know, it's obviously you want to grow that the PC business, but in a year like this, when consoles might be a little more constrained, you know, how much more aggressive are you going to be on the PC side of the house? Thanks.\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nSure. And maybe one other comment on gross margins. You know, this year they're reflective of the current environment. We do expect a rapid recovery and look to return to our target mid-30s gross margins over time.\n\nOn the non-console headset revenues, as I mentioned, you know, that we ended last year at around 20%. Year to date and Q2, by the way, have been around 25%. We expect to be over 30 by Q4. And Q4, in our guidance, actually reflects growth in revenues in Q4, mostly driven by the expansion in nonconsole headset categories, with also some supplemental good performance in the wireless headsets in Q4.\n\nSo, in terms of a long-term target, you know, our goal is to continue to expand the diversification of the business, and we would look for the 30% plus that will end the year went to continue to increase over time. Not just driven by PC, by the way, but controllers flight simulation, ultimately other simulation categories and other new categories over time.\n\nMark Argento -- Lake Street Capital Markets -- Analyst\n\nThanks, guys.\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nThanks, Mark.\n\nJohn Hanson -- Chief Financial Officer\n\nThanks, Mark.\n\nOperator\n\nThank you. Our next question comes from line of Jack Vander Aarde with Maxim Group. Your line is open.\n\nJack Vander Aarde -- Maxim Group -- Analyst\n\nGreat. Appreciate the update, guys. Hope you can hear me OK. Thanks for taking my questions.\n\nJuergen, maybe just quick question, kind of a follow-up on the nonconsole aspects of the business. You know, 25% of the second quarter revenue, which is essentially 10 million of sales. Just to be clear, I imagine this kind of -- it makes sense prior 100-million-plus target of nonconsole sales, you know, tough to get to this year. One, is that true? And then also, how much has been the guidance revision was for the year was related to nonconsole versus console sales?\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nSure, Jack, nice to have you on. So the nonconsole headset, the 100 million, given the surrounding market conditions, will -- you know, we won't have a shot at hitting that. The consumer sentiment that's down right now is really affecting everything across the board. So, while the nonconsole headset business continues to contribute nicely and increases as a percent of our revenue, as I mentioned, you know, realistic target for this year is probably closer to 75% to 80%.\n\nSorry, 75 million to 80 million.\n\nJack Vander Aarde -- Maxim Group -- Analyst\n\nSeventy-five million to 80 million. OK. Understood. That's helpful and it's good to hear actually.\n\nAnd then just maybe a follow-up to one of your comments in your prepared remarks. I think you mentioned -- and maybe it's from NPD data, but console headsets as a whole for the market, sales were down, I think you said 30%. Was that on a month basis? Or is that a year-to-date basis? Because then it -- you know I guess that relative to that, it sounds like you guys put up good numbers also to declining market. Just a challenging market.\n\nIs that true?\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nYeah. The 30% for console is for Q2 U.S. NPD; and PC accessories, gaming accessories, as I mentioned, did a little bit better at down around 20% for Q2.\n\nJack Vander Aarde -- Maxim Group -- Analyst\n\nOK. Got you. OK. I'll hop back in the queue.\n\nThat's it for me. Thank you.\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nOK. Thanks, Jack.\n\nOperator\n\nThank you. Our next question comes from a line of Franco Granda with D.A. Davidson. Your line is open.\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nHi, good afternoon, everyone. Thanks for taking a couple of questions here. So really just wanted to first ask a sort of big picture question. Seems like the market is moving toward peripherals and components that could be used across platforms: you know, mobile, console, and PC.\n\nWhat is your view on what releasing hardware with multiplatform support could do to the overall TAM over time?\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nThat's a great question, Franco. And you said due to the overall TAM over time?\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nThat's correct.\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nRight. It's a great question actually. And the wireless headsets we launched are multiplatform. There is clearly a growing segment of consumers that are playing on PC and consoles and many, by the way, that are playing on multiple consoles.\n\nSo, the multiplatform focus has driven both the updates and upgrades to our wireless models, as well as frankly, the strategy we started in 2019, the [Technical difficulty] category because PC headsets are being used on console and vice versa now, and to be successful in PC headsets, you really need the keyboards and mice alongside that for the ecosystem. So, you know, we think the TAM overall will continue to grow. As I mentioned, Newzoo are the forecasting that we utilize and they can continue to expect strong growth in the global gaming markets over time, and we think that will play true for the individual TAMs, as well as collectively.\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nOK. That makes sense. And then kind of touching back on the topic of defending market share. You spoke about ramping up promotional activity in the second half.\n\nCan you speak to what that'll look like in terms of, you know, discounted ASPs versus increased marketing efforts to your conventional channels?\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nYou know, it's across the board, Franco. And it contrasts with periods like 2018 and 2020, you know, when the market suddenly goes up, there are multiple benefits that accrue through to the P&L and kind of disproportionately to EBITDA for everybody in the category. One of those is lower-than-normal promotional levels. That means less sales, but it also means not buying shippers at the front of stores and doing things that you would normally do because you are -- demand is going through the roof and you might even be supply constrained in those boom periods.\n\nWell, in a period like this year, where competitors and retailers have high inventories, you know, everybody has been active and running promotions in all forms; discounting, as well as, again paying for additional shippers and promotional activity with retailers. And we've participated as well, but we've tended to be a bit more conservative. And going into the second half, as has been now fully reflected in both the revenue guidance range and the gross margins which get impacted by the promotional level, that those -- our guidance there reflects us, you know, competing more actively in what we believe will be above normal promotional environment for the rest of the year.\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nAll right, Thanks, Juergen, for the time.\n\nOperator\n\nThank you. [Operator instructions] We have no further questions at this time. Now, I'll turn the call back over to Juergen Stark for closing comments. Juergen.\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nThank you. We look forward to speaking with our investors and analysts again following Q3. We appreciate your interest in the company and your support as fellow shareholders. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAlex Thompson -- Investor Relations\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nJohn Hanson -- Chief Financial Officer\n\nMark Argento -- Lake Street Capital Markets -- Analyst\n\nJack Vander Aarde -- Maxim Group -- Analyst\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nMore HEAR analysis\n\nAll earnings call transcripts"
}