{
  "companyName": "Honda Motor",
  "companyTicker": "HMC",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/honda-motor-hmc-q1-2023-earnings-call-transcript/",
  "content": "Honda Motor (HMC -0.17%)\nQ1 2023 Earnings Call\nAug 10, 2022, 2:00 a.m. ET\n\nNoriko Okamoto\n\n[Foreign language] I thank you very much for taking time out of your busy schedule to attend our briefing today. We would now like to start Honda Motor Company Limited's financial results briefing for the first quarter of fiscal year to March 2023. First of all, allow me to introduce the attendees today. Mr.\n\nKohei Takeuchi, director, executive vice president, and representative executive officer, good to see you. Mr. Eiji Fujimura, operating executive and the head of accounting and finance supervisory unit, thank you. Good to see you.\n\nThen Mr. Takeuchi will first present the overview of the first quarter financial results and the forecast for fiscal year to March 2023. Then, Mr. Fujimura will present the details.\n\nOver to you, Mr. Takeuchi.\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\n[Foreign language] First of all, we would like to express our deepest gratitude to our loyal customers around the world and all stakeholders who are supporting Honda. Thank you very much indeed. Currently, we have a number of customers waiting for the delivery of our vehicles. We will do our utmost to deliver products to our customers as soon as possible.\n\nWe hope to gain your understanding. I'd now like to explain our fiscal year '23, our first quarter financial results and FY '23 financial forecast. First, FY '23 first quarter financial results. Automobile production and unit sales, despite semiconductor supply shortage and Shanghai lockdown, bringing down unit sales from the same quarter last year in mainly China and North America, they were in line with the previous forecast.\n\nOperating profit was down from the same quarter last year. However, despite drop in automobile unit sales and soaring raw material costs, motorcycle unit sales were up, and companywide efforts were made to improve profit, resulting in operating margin equivalent to that of the same period last year. Next, FY '23 financial forecast. The outlook remains uncertain due to semiconductor supply shortage and inflation.\n\nHonda's group unit sales plan for FY '23 remains unchanged from the previous forecasts. But given the profit increase effect of the currency rate and forecasted cost increase due to inflation, we have revised upward our sales revenue and operating profit forecast. At today's board meeting, a decision was made to acquire own shares up to 100 billion yen. Honda will continue to accelerate efforts to enhance corporate value and promote electrification and other new growth initiatives.\n\nNext, I will explain our main market automobile sales. Despite the effect of new model launches, such as a Step WGN in Japan and HR-V in the United States, shortage of chips and the Shanghai lockdown effect resulted in unit sales lower than the same quarter last fiscal year in the respective markets. In the United States, there was solid demand. Sales were down from the same period last year because, last year, dealers had inventory to sell.\n\nFY' 23 sales forecasts remain unchanged. Though we expect demand to stay strong, outlook remains uncertain due to semiconductor supply shortage and resurgence of COVID-19. Honda will actively launch new models to the market, such as CR-V and Z-RV so as to boost sales. Next, motorcycle business.\n\nDue to semiconductor shortage, unit sales dropped from the same period last year in some countries. But unit sales increased significantly in our largest market, India. And overall, we exited the same period last year. Regarding FY' 23 sales, taking into account semiconductor shortage, we decided to stick to the previous forecast.\n\nHowever, by replacing some models on sale, utilizing alternative parts, we will aim to further increase unit sales. Next FY '23 three months results summary consolidated. Despite drop in unit sales and due to semiconductor supply shortage and Shanghai lockdown, combined with rising raw material costs due to price cost impacts and reduction in incentives and currency effects, operating profit was 222.2 billion yen. Profit for the period was 149.2 billion yen due to decrease in Chinese investment profits under the equity method.\n\nUnit sales and income statements are as shown. Next is the FY '23 consolidated financial forecasts. In the forecast announced last time, despite uncertainty attributable to semiconductor supply shortage and COVID-19 resurges, given the currency and inflation impact and cost increase, we revised upward operating profit to 830 billion yen. The assumed US dollar-yen currency rate in the first half is 130 yen; second half, 120 yen; annually, 125 yen.\n\nThe forecast profit for the period remains unchanged from the previous forecast at 710 billion yen. Unit sales and income statement are as shown. Next, FY '23 annual dividend is 120 yen, unchanged from the last announcement. At today's board meeting, a resolution was adopted to acquire our own shares.\n\nIn order to improve efficiency of capital structure, implement flexible capital strategy, Honda acquired its own shares. Total amount of shares to be acquired will be maximum 100 billion yen. Next, Mr. Fujimura, operating executive and head of accounting and finance supervisory unit, will explain the details of the results and forecast.\n\nEiji Fujimura -- Head of Accounting and Finance Supervisory Unit\n\n[Foreign language] OK. Allow me to start the explanation. To begin, Honda Group's unit sales for first quarter of fiscal year to March 2023. In motorcycle operations, unit sales to a year and year, in particular in Asia, and it came to 4,251,000 units.\n\nAutomobile came to 815,000 units, mainly due to declines in China and North America. In power products, volume came to 1,546,000 units, mainly due to a decline in North America. Next, I'd like to explain the factor analysis of pre-tax profit for Quarter 1 compared to the same period last year. Pretax profit was 237.4 billion yen, which was lower by 73.9 billion yen compared to the first quarter last year.\n\nOperating income was 222.2 billion yen, which was lower by 20.9 billion yen on the year. To give you a breakdown of the substantive decline of our 85.1 billion yen, net of the currency impact, impact in sales came to -- though there were reduction in incentives, decline in automobile sales volume and other factors led to a decline of 89.4 billion yen. Selling price and cost factors. While there was impact from surging material prices, we strove to raise our selling prices and to reduce costs.\n\nWe reached an increase in profit by a 14.4 billion yen. Expenses due to increase mainly in quality-related expenditures. This gave us a negative impact of 12.0 billion yen. Next, to explain sales revenues and operating income by business segment.\n\nFor motorcycles, operating income was 97.8 billion yen. Automobile income was 83 -- sorry, 38.2 billion yen. Operating income from financial services was 78.8 billion yen. The sum of the automobile businesses operating income and that associated with automobile sales, including financial services, is estimated to be 113.9 billion yen.\n\nNext, for power products business and other businesses, operating profit came to 7.3 billion yen. Of this amount, the operating loss from aircraft and aircraft engine was 3.8 billion yen. Next, I will explain the cash flow. Free cash flow of the operating entities for fiscal year.\n\nFor the first quarter of our fiscal year 2023 came to minus 149.3 billion yen. And the end-of-term balance of net cash came to 2,310.1 billion yen. Next, I'd like to talk about the consolidated financial forecast for the FY ending in 2023. Firstly, speaking of Honda Group's unit sales, we are keeping the previous forecasts unchanged.\n\nSo, the forecast in motorcycle is 18,560,000 units; in automobiles, 4.2 million units; and in power products, 5,665,000 units. And next, I'd like to explain the factor analysis of pre-tax profit compared to the actual results from last fiscal year. Pretax profit is forecast at 1,040 billion yen, down by 30.1 billion yen from the previous year's results. Operating income is forecast at 830.0 billion yen, down by 41.2 billion yen from the previous year's results.\n\nI will explain the substance of decline of 207.2 billion yen net of currency effects. Impact from sales is positive 169.8 billion yen due to increase in motorcycle automobile sales volume. Selling price and cost impact is negative 146.0 billion yen due to the impact of sourcing material prices. Expenses impact is expected to be negative 148.0 billion yen due to increase of quality-related expenses and selling expenses.\n\nNext, the changes compared to our previous forecast are positive 5.0 billion yen for pre-tax profit and positive of 20.0 billion yen for operating income. The decline of 60.0 billion yen net of the currency effects is because the impact from inflation has been taken into account. Lastly, compared to previous forecast, forex impact has been incorporated in the forecast for capital expenditure depreciation and R&D expenditure for full year to March 2023. This completes my presentation.\n\nThank you very much for your attention.\n\nNoriko Okamoto\n\n[Foreign language] Thank you very much for your attention. Then we'd like to move on to the Q&A session. As informed in advance, we will like to take questions via Zoom. And due to the time restrictions, we'd like to limit it to two questions per speaker, please.\n\nSo, we ask for your cooperation. Then if you have any question, please let us know by raise-hand button. Thank you. The first question from Nikkei.\n\nThe first question from Nick. Mr. Tanabe, please. Ms.\n\nTanabe, excuse me.\n\nShizuka Tanabe -- Nikkei -- Analyst\n\n[Foreign language] This is Tanabe from Nikkei speaking. About my first question about the semiconductor situation. In the first quarter, there was a Shanghai lockdown. And there was this impact, and there was a reduction in production volume.\n\nBut currently, the Shanghai lockdown. how much of the effect is still with you now? And about the shortage of semiconductor supply, when about do you think that this can be resolved? And also, if you are seeing some improvements and what initiatives that Honda is taking is resulting in these good results.\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\n[Foreign language] Thank you very much. Well, about your question, about the Shanghai impact and also the impact of the semiconductor supply shortage. Allow me to try to explain to you what the situation is. The lockdown in China, yes, in April, I think you've already seen the numbers, but the Shanghai lockdown, when compared to the same quarter last year, and we have seen a significant negative number.\n\nThat is true. But when we made our forecast announcement for automobile group sales, it was 4.2 million units. And we had factored in the prolonged Shanghai lockdown. So, compared to our plan, we think that things were within the scope of our assumption.\n\nSo, please understand that this is a case. And in fact, the Shanghai lockdown has almost been totally lifted in June, July compared to the same period, or same month the previous year, there were positive numbers. And therefore I think things have normalized. That is how we understand this.\n\nAnd in the second half, we want to work hard to recover. Now, about the semiconductors. Currently, as you have seen in the newspapers and others, other industries like computers and cellphones. And those sectors, there is some excess supply.\n\nAnd we think that semiconductors will become available. But when it comes to the automobile industry, that is not the impression that we are getting. For the time being, we think that we will continue to see a shortage. This is the current understanding.\n\nThere are different types of semiconductors, and there are different types that we have to manage. The semiconductors depending on the type. And we will continue to allocate based on what is available. Now, when about do you think that we can resolve this? We think that until the end of this fiscal year, we'll continue to see the impact of this semiconductor shortage.\n\nSo, until the end of this fiscal year, we need to handle the situation and take into consideration that there will continue to be this shortage. We want to make every effort to deliver our products to our customers as soon as possible. Now, how are we going to recover this shortage, as we said earlier, with our suppliers, we are negotiating one on one. Have them hold inventory where possible, and also try to develop alternative parts.\n\nAnd also, depending on the type, I think that we have to sense and do risk management depending on the different types of semiconductors. And therefore, if some of the suppliers, including the price, we are doing a long-term contract so as to secure the necessary supply of semiconductors. But as I've explained, we are continuing to see this situation of shortage. That is all.\n\nThank you.\n\nNoriko Okamoto\n\n[Foreign language] Thank you very much, Ms. Tanabe. The next question -- I'd like to move on to the next question. From Asahi newspaper, Mr.\n\nKameyama, please.\n\nKeiji Kameyama -- Journalist\n\n[Foreign language] OK. This is Kameyama from Asahi newspaper. Hope you can hear me.\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\n[Foreign language] Yes.\n\nKeiji Kameyama -- Journalist\n\n[Foreign language] I have two questions. The first one is, in the presentation earlier, you talked about -- it looks like you've raised some of the selling prices. So, I would like to know specifically what prices you raised and which region. And that I believe other companies are trying to raise prices as well.\n\nBut I guess the transferring the raw material prices hikes, I think that is becoming an issue. So, I would just like to know if you are considering that kind of a transfer. So, that's what I'd like to know. That was my first question.\n\nSecond question concerning production. So, from April to June, you said you were on plan. You are to plan. But compared to the previous year, when would you say you will be recovering compared to year on year? So, starting this this term, or do you think your recover income from third quarter? What would you say?\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\n[Foreign language] OK. Thank you. About the selling price, let me answer that one. So, going back to the previous year -- previous fiscal year, to two previous years ago, we have started seeing impact from 270 billion yen -- from two years ago to the previous year.\n\nAnd then we did have some -- in fact, including inflation as well. And then the transportation and labor would raise, we were thinking 290 billion yen raises expected. So, plus we have a 60 billion yen in addition. So, in raw prices and then the cost inflation, everything included.\n\nWe have accounted for those. And then from two years ago to last year, we have made the efforts to reduce cost. And as Mr. Kameyama mentioned, we raised prices.\n\nThat was the biggest area in Americas, in the USA. So, we have been recovering that. For this year, actually. From previous year to this year, we do have -- we cannot absorb the cost increase of 300 billion each year.\n\nBut we do have -- we have launched -- we have a new model, '20 model, year 23 model was launched in there. So, we would somehow hope to manage absorbing those costs. I guess you must be interested in Japan. In Japan, we have the competitors.\n\nWe need to monitor the situation, how it plays out with others. We will consider raising prices if there's an opportunity. Next question. You are -- production.\n\nSo, we said that 4.2 million units at the beginning of the fiscal year. And then, you know, this was still -- so, well the first quarter, we had the impact from the Shanghai lockdown. So, it was like 0.8 million. And then we -- if we would raise both stages and then get better per quarter.\n\nBut this quarter -- sorry, the first quarter, we have to struggle with the semiconductor supply. So, we are short by about 20,000 units or so compared to the original plan. So, we can catch up with this. We can cover this up with the second quarter.\n\nAnd then we should be able to recover this in the second and the third quarter so that we should be able to build up. So, we should reach 1 million in a quarter so that we can reach 4.2 total. So, we will go gradually and then try to reach 4.2 million that was forecasted at the very beginning of the term. Thank you.\n\nNoriko Okamoto\n\n[Foreign language] Thank you very much, Mr. Kameyama. Next question. Yomiuri Shimbun.\n\nMr. Nakamura, please.\n\nUnknown speaker\n\n[Foreign language] Nakamura from Yomiuri Shimbun newspaper. Can you hear me?\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\n[Foreign language] Yes.\n\nUnknown speaker\n\n[Foreign language] Thank you. I have two questions about the Shanghai lockdown impact. To the extent that you can disclose, what components have been impacted? And if you're seeing some improvements, which component are you seeing improvement in? The second question, the raw material costs are continuing to rise. But what kind of components do you see a significant impact of the raw material price increase?\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\n[Foreign language] Well about the lockdown impact, which component was mostly impacted? Well, it's very difficult for me to specify any specific components because we have in Wuhan and Guangzhou factories, and there are many of the suppliers in the Shanghai area. And many of the manufactures we're producing in Shanghai are being -- the components and subcomponents, they have all seen a reduction in production. And this is the impact of the Shanghai lockdown. And in June -- July, compared to the previous month, and thanks to the lifting of the lockdown, these numbers have improved, and they're in the positive.\n\nSo, I think that, overall, in China factories, because they are located in these locations, our suppliers have been impacted by the lockdown. So, please understand that that is the case. And about the raw material price increase rather than any specific component. And from the past two fiscal years, the precious metal, those that have been used for catalyzers, these precious materials -- metals, these are the ones that have been impacted.\n\nAnd from last fiscal to this fiscal year -- well, from last year. In the fourth quarter of last fiscal year in North America, steel prices, because of the revision in January, we've seen a decrease of 150%. And so, that was three months for last fiscal year and 12 months for this fiscal year. And I think that this is the area that we're seeing a major impact.\n\nOther raw materials, likewise, we are seeing the impact not just around materials but due to inflation. There are increases in prices overall. But the precious grade metals, I think, compared to the past, the increase is less. And it's more or less plateaued, but it's not going down to the extent that it's having a positive impact on the profit.\n\nSo, from last fiscal to this fiscal year, I think the biggest impact is steel prices in North America. That was the biggest from last fiscal year to this fiscal year. Thank you.\n\nNoriko Okamoto\n\n[Foreign language] Thank you very much, Mr. Nakamura. The next questions are from Toyo Keizai, Mr. Yokoyama, please, from Weekly Toyo Keizai.\n\nCan you hear us, Mr. Yokoyama?\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\n[Foreign language] Yes. Yes, we can hear your voice.\n\nUnknown speaker\n\n[Foreign language] OK. I have two questions as well. My first question is you announced this sales of Honda Lock to MinebeaMitsumi. So, could you let me know the background why -- what's your aim or to background to it? And then related to that, among your subsidiaries and related companies, I guess you do have some internal combustion-related suppliers.\n\nBut are you considering some support to them while you shift to electrification? And then my second question also relates to suppliers. So, I believe we heard about the -- well, there's a lot of cost pressure to the suppliers. Are you thinking of any support? If you have any specific plans for that, please let us know.\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\n[Foreign language] OK. First, about Honda Lock, sales of Honda Lock, this will be from MinebeaMitsumi. So, originally this company Honda Lock, the supplier, this is not -- is ready-to-lock. So, keys, door mirror, those parts manufacturer rather than internal combustion-related.\n\nBut MinebeaMitsumi, they are not a dedicated automotive supplier. But they wanted to utilize our technological advantages of a Honda group so they feel that they will be able to expand their business horizon. So, that is why they approached us. So, we started discussing.\n\nSo, it's nothing to do with the internal combustion suppliers at all. So, for those suppliers related to internal combustion systems, I will -- we will like to discuss individually. We will be discussing. So, we would like to see what technological expertise each supplier has and what can be utilized for EV.\n\nSo, that's something up to the individual discussions. About the price reduction, the supplier, so another manufacturer said that they are not going to try to pressure to reduce costs of suppliers. But to us, suppliers our business partners which help us in delivering good products to our customers, of course, the raw prices that the supplier needs to buy, the prices are going up. And then logistical costs is going up.\n\nFor example, for the -- in the States, the inflation is pushing up the labor costs as well. So, of course, they would need -- we need to work together to enhance the efficiency and reduce costs due to competition. But we still will need to discuss individually with the suppliers trying to take actions as appropriate and necessary with individual suppliers. That is our approach.\n\nSo, in considering will -- we cannot really -- I cannot really say how much that will be or anything like that. But we would like to -- so, we are saying 60 -- we are estimating cost increase that we mentioned earlier. Thank you very much, Mr. Yokoyama.\n\nNoriko Okamoto\n\n[Foreign language] Next question. Automotive News. Mr. Hans Greimel, please.\n\nHans Greimel -- Journalist\n\n[Foreign language] May I speak in English?\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\n[Foreign language] Yes.\n\nHans Greimel -- Journalist\n\nThank you for taking my question. This is Hans Greimel from Automotive News. I'm wondering if you could give us an outlook for the recession possibilities in the United States, what the the economic forecast is for a possible recession in the United States, and what Honda is doing for counter-measures there. Also, can you give us more details about the price increases in the United States? How sensitive is the market there to price increases? And is this something that you expect to keep doing further into the rest of the fiscal year and into the possibly future next year as well?\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\n[Foreign language] First question about the possibility of recession in the United States and how we tried to deal with that. As Hans has mentioned, the United States -- it was 9.1% inflation rate last month. And the interest rates, .75 increases continuing and by the Fed. And also, in order to curb inflation, the interest rates are continuing to increase and eventually in North America.\n\nI think that this will have an impact on the economy in North America. So, we're keeping an eye on the developments. But so far, looking at our automotive sales, with the dealers, I think we have an inventory of 20,000, which is very low inventory. It is preorders of customers constantly.\n\nWell, in the past, the customers would -- we would look at the inventory and tried to take orders. But in Japan, we take orders and try to look into whether we can sell and have the customers buy and deliver the cars later -- at a later date. So, I think that currently we have a large back order. And we have to supply to our customers the products as soon as possible.\n\nThis is the current situation. And therefore, with a recession month and taking immediate measures, we have to focus on delivering our cars and vehicles to our customers. Now, if there were to be a recession, recently, due to the pandemic, we have seen a large dip in the unit sales, but we have been generating profit. And so, I think that we have become more efficient in terms of fixed cost, etc., and we have to keep an eye on the possibility of recession.\n\nAnd if necessary, we'll try to further reduce fixed costs. About this sales price -- the selling price, for the past two fiscal years, we have been doing a number of measures. But for North America, this fiscal year, rather than increasing the prices, our normal prices, we will increase it to the rate of inflation. But it's not the case we are going to increase it by 9% in 2023 model year.\n\nI think our most competitive CR-V, Accord, and also Pilot we'll see a model change. And therefore, with the equipment, we will increase the value of our products. And in line with the value that is being offered, we think that we can increase the price. So, we will continue to seek for that possibility.\n\nWe will try to deliver quality good products to our customers and have our customers recognize the value of our products and accept price increase. That is all. Thank you.\n\nNoriko Okamoto\n\n[Foreign language] Thank you very much, Mr. Greimel. Going on to the next question. From [Inaudible], Mr.\n\nYamane, please.\n\nUnknown speaker\n\n[Foreign language] My name is Yamane from [Inaudible].\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\n[Foreign language] Yes, we can hear you.\n\nUnknown speaker\n\n[Foreign language] One question for you. The decline in the first quarter. You talked about the decline in equity in China due to equity method. So, I would like to know about it.\n\nEiji Fujimura -- Head of Accounting and Finance Supervisory Unit\n\n[Foreign language] OK. OK. For the first quarter, the equity method, the interest, I'd like to answer that one. I believe you see this waterfall graph.\n\nWe have this opportunity, 3.3 billion yen decline. This was this portion. The biggest portion came from China. But as I mentioned, as we have announced already the other day, we will have to be selective for EV.\n\nSo, what we will do in China for the Acura business, we will discontinue the Acura business. That's what we have incorporated. So, we have some losses from there. So, it's temporary, and also complaints.\n\nAnd also we have some domestic subsidiaries. We recently we had some -- due to the share prices, the equity method, we had some impairment losses due to the -- this is only the some of the domestic subsidiaries. And then also the pension system was changed. And then there were some losses in accounting.\n\nSo, those are the parts of the 33.3 of the -- half of that is coming from those factors. And then the remaining half. Is coming from the business operations. From the first quarter, the volume unit sales saw impact in China, as well as in Japan as well.\n\nSo, this is of the same range as the operating income. OK. Thank you very much, Mr. Yamane.\n\nNoriko Okamoto\n\n[Foreign language] Next question. Nikkan Jidosha Shimbun, Mr. [Inaudible] please.\n\nUnknown speaker\n\n[Foreign language] Can you hear me? Yes, please.\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\n[Foreign language] Yes, please.\n\nUnknown speaker\n\n[Foreign language] Nikkan Jidosha Shimbun. [Inaudible] is my name. Well, I have one question. Well, the semiconductor shortage and others say that the delivery date has been delayed.\n\nBut what measures is Honda trying to take to make up for this delay?\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\n[Foreign language] Well, as for the measures, well, we are very keen to deliver our vehicles to our customers as soon as possible. But depending on the model type, there are cases in which we have to keep our customers waiting for a long period of time. And in some cases, we had to suspend acceptance of orders. It's been resumed.\n\nBut we are trying to avoid causing inconvenience to our customers. As I've explained, this is serious shortage of semiconductor supply. We are trying to resolve this. And so to the suppliers which are supplying us with semiconductors, we are talking with them.\n\nAnd so, every -- on a weekly basis and a monthly basis, we come up with a production plan. And we are working hard to deliver our vehicles to our customers as soon as possible. But as earlier said, until the end of this fiscal year, we think that the shortage of semiconductors, especially automotive semiconductors, will continue. And so, we have to look at which models can be delivered at an early date in which markets and especially for those customers who are waiting long, we are trying to resolve this situation as soon as possible and understand that we are causing inconvenience to our customers.\n\nWe want to apologize, but we hope that people will understand the situation that we are currently placed in. Thank you.\n\nNoriko Okamoto\n\n[Foreign language] Thank you very much, Mr. [Inaudible]. The next questions are coming from Reuters, Mr. Sugiyama.\n\nSatoshi Sugiyama -- Thomson Reuters -- Analyst\n\n[Foreign language] OK, this is Sugiyama from Reuters. Yes, we can hear you. We have two questions. The first question is about the semiconductor related one.\n\nAnd earlier, with the -- I think there was a risk with the restrictions on the Taiwan Strait. I guess there's a focus about it that the military practices by China. So, I believe for a stable procurement of semiconductors, are you going to stay -- assume that there could be some incidents in Taiwan so that they will try to reduce the procurement percentage, if from Taiwan or from China? Are you doing anything to ensure stable supply? That's one question. And the second question, in the States, a senator came up with a law to reduce inflation.\n\nAnd then they said that the they came up with a tax -- they made stringent the qualification for the EV, the incentive sorry, EV incentive factory. And then -- so, even for the -- this may become a hinder adoption of the electrical EV. So, we'd like to hear what you have about that.\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\n[Foreign language] OK, geopolitical risk about Taiwan, well, it is true that semiconductor is -- is already concentrated in Taiwan. Outside Taiwan, this would be China and then the States. But in we are -- there are some semiconductor factories, new ones built in Japan, but they are still taking some time. So, we need to continue trying to do a dual sourcing, but it's true that other locations are different.\n\nBut we need to do design changes and also keep a higher level of inventory. So, those aren't really specific, maybe you might say that. But we will continue to take those actions and think of all the further actions. For the -- it is true.\n\nThis geopolitical risk is difficult. But with [Inaudible] as well, we are consulting every party we can in engaging all the whole automotive industry and then are considering options for the future. That's what I can tell you at this point in time. About the Senate -- the States, the Inflation Act to curb inflation.\n\nSo, it's difficult to say what our view is. The current model may not be eligible. But we want to aim for carbon neutrality, so we would like to utilize our technology that we have, EV and FSEV, those are the technologies available. So, we would like to be able to launch EV, electric vehicle.\n\nAnd that's because -- before the factory becomes eligible for a tax credit. But we need to be able to come up with the vehicles in terms of tanks to wheel. So, we will focus our efforts -- all our efforts in trying to from -- first come up with the being able to launch a vehicle that will help in this carbon neutrality. Thank you.\n\nNoriko Okamoto\n\n[Foreign language] Thank you, Mr. Sugiyama. And next question will be the last question. [Inaudible] please.\n\nUnknown speaker\n\n[Foreign language] [Inaudible] Thank you very much. I have just one question here about the fiscal year outlook, a forecast you've revised. The operating profit has increased, and the net profit remains unchanged. What is the logic of this upward revision and retaining the net profit?\n\nEiji Fujimura -- Head of Accounting and Finance Supervisory Unit\n\n[Foreign language] Thank you very much for that question. Well, about the FY '23 focused and the relationship between net profit and operating profit. As for the operating profit target, Takeuchi has explained that we are taking into account the currency of 130 yen and 120 yen in the first and second half. And so, it's a plus and 20 billion yen for the operating profit.\n\nAs the first quarter for the equity method and the related companies in Japan, there was the impairment of this geos in Japan and therefore the equity profit and method profit has been reduced and also the operating profit. As it increases, there will be more corporate tax to be paid. So, we have to factor in this negative. And therefore, the 20 billion and also so 15 -- 10 billion has been offset as a result of this.\n\nAnd that is the reason why we have retained the net profit as originally planned.\n\nNoriko Okamoto\n\n[Foreign language] With this, we would like to end today's briefing. And as for the materials that have been used, they will be posted on our website for you to refer to. Thank you very much for your viewing.\n\nDuration: 0 minutes\n\nNoriko Okamoto\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\nEiji Fujimura -- Head of Accounting and Finance Supervisory Unit\n\nShizuka Tanabe -- Nikkei -- Analyst\n\nKeiji Kameyama -- Journalist\n\nUnknown speaker\n\nHans Greimel -- Journalist\n\nSatoshi Sugiyama -- Thomson Reuters -- Analyst\n\nMore HMC analysis\n\nAll earnings call transcripts"
}