{
  "companyName": "Warby Parker Inc.",
  "companyTicker": "WRBY",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/warby-parker-inc-wrby-q2-2022-earnings-call-transc/",
  "content": "Warby Parker Inc. (WRBY -1.89%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:00 a.m. ET\n\nOperator\n\nThank you, and good morning, everyone. Here with me today are Neil Blumenthal and Dave Gilboa, our co-founders and co-CEOs; alongside Steve Miller, senior vice president and chief financial officer. Before we begin, we have a couple of reminders. Our earnings release and slide presentation are available on our website at investors.warbyparker.com.\n\nDuring this call and in our presentation, we will be making comments of a forward-looking nature. Actual results may differ materially from those expressed or implied as a result of various risks and uncertainties. For more information about some of these risks, please review the company's SEC filings, including the section titled Risk Factors in the company's latest annual report on Form 10-K. These forward-looking statements are based on information as of August 11, 2022, and we assume no obligation to publicly update or revise our forward-looking statements.\n\nAdditionally, we will be discussing certain non-GAAP financial measures. These non-GAAP financial measures are in addition to and not a substitute for measures of financial performance prepared in accordance with U.S. GAAP. A reconciliation of these items to the nearest U.S.\n\nGAAP measure can be found in this morning's press release and our slide deck available on our IR website. And with that, I'll pass it over to Dave to kick us off.\n\nDave Gilboa -- Co-Founder and Co-Chief Executive Officer\n\nWelcome, and thank you all for joining this morning. To start, we'd like to thank team Warby for their continued commitment to creating exceptional products and customer experiences that help people see. In Q2, we brought our corporate teams back to the office, and it's been overwhelmingly positive to collaborate in person after two-plus years of remote work. Q2 was another quarter where Warby Parker delighted customers, gained market share and made strong progress against our core strategic growth initiatives.\n\nWe delivered net revenue of $149.6 million, in line with our guidance range and generated $5.9 million in adjusted EBITDA ahead of our guidance. But it was also a quarter where the normally steady and predictable shopping behavior in our category continued to deviate from historical trends. During our last earnings call in mid-May, we discussed the impact of omicron on our business, which resulted in lost sales and a decline in retail productivity below 80% of 2019 levels in early Q1 before a steady recovery reached approximately 90% retail productivity levels in April. This positive trend extended into mid-May at the time of our last call which led us to share optimism about a continued recovery like we had seen after previous COVID waves.\n\nHowever, starting in the back half of May, we began to see a deterioration in retail productivity as well as headwinds for overall eyeglasses demand. We believe this weakness in demand is industrywide driven by lingering pandemic effects, inflation and shifts in how consumers are spending their money in time. While we are not immune from these macro factors, we remain confident that our brands, value proposition and delivery model continue to resonate with consumers. Our customers are spending more with us than ever, with average revenue per customer reaching a new high of $254 in Q2.\n\nOur repeat purchasing trends are as strong as ever with four-year sales retention rates of 100% and our most recent 12-month customer cohorts from the first half of 2021, having the highest repurchase rate we have ever seen. When people try Warby Parker, they love the experience and want to come back. Those happy customers also drive order amount, and we ended Q2 with a best-in-class Net Promoter Score of 81. These positive customer trends notwithstanding, when we began to observe demand weakening, we quickly moved to rationalize our expense base to enable margin improvement as we scale.\n\nThese actions are reflective of our commitment to sustainable growth and are expected to enable us to see more leverage from our fixed expense base in the back half of 2022 and beyond. We reduced expenses in several areas of our business, including making the difficult decision to restructure and streamline our corporate team, which resulted in the elimination of 63 roles, roughly 15% of our corporate headcount. As mentioned in our last earnings call, we have also adjusted our marketing spend as a percentage of revenue. As a reminder, our marketing spend as a percentage of revenue increased during 2020 and 2021 due to deliberate investments to support our e-commerce business when our stores were closed or when we were limiting traffic into them.\n\nIn Q2, we brought marketing as a percentage of revenue to 13.8%, which is more in line with pre-pandemic levels. Now that our ratio of orders placed in stores relative to those placed online has returned to pre-pandemic levels. Our stores not only enable us to offer great experiences for our customers and showcase our brands, they also serve as highly efficient customer acquisition tools. Between 2021 and 2022, we'll have opened 75 new stores, which will allow us to scale our customer base and top line without as much marketing support.\n\nAs a result, marketing spend increased just 1% year over year in Q2 compared to our top-line growth of 13.7%. Our customer acquisition costs came down over 25% relative to Q1, enabling us to acquire customers more efficiently. And in Q2, these CACs were at the lowest level we've seen since early 2020. Steve will speak to these changes and other G&A cuts in more detail shortly.\n\nMany of these changes are not reflected in our Q2 results. Therefore, we expect second-half adjusted EBITDA margins to be meaningfully higher than the first half, positioning us to accelerate adjusted EBITDA expansion in 2023. Flexibility is one of our competitive strengths, both in how we serve customers across our omnichannel model and in the agility and speed with which we operate. It is why we were able to continuously serve customers and grow in 2020 when others in our industry have to temporarily pause operations and the total U.S.\n\neyewear market declined 15%. As we operate through this current period of volatility with rapid shifts in consumer behavior, we believe our flexible model will enable us to fare better than others in our category and result in continued share gain. This inherent flexibility is also what enables us to adjust our operating costs quickly. Given the deteriorating macro environment, we are taking a more conservative view into the rest of 2022, which is reflected in our rest of year guidance.\n\nWe continue to believe in the resilience of the optical industry and expect these headwinds to be temporary, but we are no longer counting on optimism or demand recovery until we see it materialize. We are intensely focused on what is in our control, delivering products and experiences that customers love. And by doing so, off a smaller expense base, we expect to drive meaningful adjusted EBITDA increases even in the face of less consumer demand. We expect that these adjusted EBITDA improvements will begin to be realized in the back half of 2022, and we are committed to driving further margin expansion in 2023 and beyond.\n\nAnd with that, I'll turn it over to Neil to walk through our primary growth drivers, which will enable us to continue to scale and expand market share in the months and years ahead.\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nThanks, Dave. While we navigate the current lower growth environment with an even greater commitment to margin expansion, we plan to continue to strategically invest in four key growth initiatives. First, we're continuing to scale our omnichannel experience in open stores. In Q2, we opened 9 new stores and remain on track to open 40 stores by year end.\n\nDespite continuing to operate in an environment with lower retail traffic, our stores are generating $2.1 million in revenue on average on an annualized basis with four-wall margins in line with our historical target of 35%. This performance is consistent across our fleet, including a cohort of stores opened in 2021. These newer stores, on average, continue to remain on track to pay back within our target of 20 months. Second, we continue to expand our core glasses business.\n\nWe consistently design and introduce glasses that our customers love whether it's our Everywhere Series collection, which is our first collection priced at $175; or our new anti-fatigue lens, which customers can add to any optical frame for an additional $100. progressive also continued to grow as a percent to total. As a reminder, progressive are our highest price point and highest gross margin category. So as progressive penetration increases, we expect to drive top-line growth and gross margin expansion.\n\nGiven these and other initiatives, we continue to see ASP and AOV rise without impacting customer demand. Third, we're building our contact business. Contacts continue to scale, growing more than 100% year over year from 3% of our business in Q2 2021 to 7% in Q2 2022. As a reminder, contact lenses typically account for 15% to 20% of the sales of an optical retailer.\n\nIn our contact business fuels other areas of our business, 30% of contact customers who are new to the brand and up buying glasses from us. These customers also tend to spend more than our glasses-only customers. Fourth, we're investing in our eye exam business. We continue to hire and retain incredibly talented optometrists.\n\nWe ended the quarter offering exams in more than 70% of our retail stores and remain on track to provide eye exams in more than 150 stores by year end. In Q2, we completed our annual goal of converting 40 stores to our PC model, which gives us greater control over the customer experience and enables us to recognize the exam revenue. Not only are we expanding our in-person comprehensive eye exam capacity, but our telehealth offering continues to grow. In Q2, the number of prescriptions requested through our virtual vision test app increased more than 100% year over year.\n\nThese four strategic initiatives are in line with our philosophy around long-term sustainable growth and are consistently supported by consumer research. Our surveys show that the biggest barriers to purchase from Warby Parker include not having a store nearby, not being able to get an eye exam, and not being viewed as a place that serves all of their vision care needs. While our growth this year has trended lower than our long-term targets, we remain confident in the recovery of our category and in our ability to continue to gain market share in any type of economic climate. For example, during the pandemic from 2019 to 2021, we grew revenue 46%, while the overall optical market grew sales 5%.\n\nWe offer products and services people need to see, and we believe we offer unparalleled value and a superior customer experience relative to others in our industry. When demand reaccelerates across our industry, we believe we will be well positioned to differentially benefit and future growth of our newly reset expense base is expected to result in meaningful incremental margins. And now I'll pass it over to Steve.\n\nSteve Miller -- Senior Vice President and Chief Financial Officer\n\nThanks, Neil and Dave. Good morning, everyone. Ahead of getting into detail for the quarter, I wanted to mention that we are pleased that our second quarter top-line performance was in line with our expectations, and adjusted EBITDA was slightly ahead, especially as the market environment became increasingly challenging. As Neil and Dave noted, we have adopted a more conservative view on the remainder of the year to reflect the current macroeconomic conditions and recent trends in our business.\n\nI'll outline the specifics of our new outlook after reviewing second-quarter results. Starting with revenue. The second quarter of 2022 came in at $149.6 million, up 13.7% versus the second quarter of 2021 and just below the midpoint of our guidance of about 13% to 15%. On a three-year CAGR basis versus the second quarter of 2019, revenue increased 19.1%.\n\nWe finished the quarter with 2.26 million active customers, an increase of 9% versus the same period a year ago, and our average revenue per customer increased 8% year over year to $25. This continued scaling in average revenue per customer reflects our ability to provide more value to our customers as we evolve from a glasses-only company into one that sells eye exams, contacts, and eyeglasses. As a reminder, both active customers and average revenue per customer are measured on a trailing 12-month basis. Our growth in top line and average revenue per customer for the quarter was driven by a number of factors, including a consistent replenishment cycle of our core prescription glasses offering as well as continued progress in growing our contact lens business, which is up 400 basis points compared with Q2 2021 still only represented 7% of our business in Q2 2022.\n\nWe also saw continued scaling of our progressive lens product, which reached nearly 22% of total prescription glasses sold in Q2 2022, yet still well below the market average of 45%. Within our e-commerce business, we continue to see healthy growth on a three-year CAGR basis in the mid-20s with Q2 e-commerce revenue up 24% on a three-year basis versus Q2 2019. From a business mix perspective, for the second quarter, e-commerce represented 39% of our overall business versus 44% in Q2 '21 and 34% in Q2 '19. As it relates to retail store performance, when we last spoke in May, we noted that we saw retail productivity rise to approximately 90% in April, which was a roughly 10-point improvement from the start of the year.\n\nWe were encouraged by the increase we had observed since the start of the year and shared our expectations for continued scaling of retail productivity the rest of the year. Starting in the third week of May, retail productivity decelerated modestly, which continued through the end of June, where it has stabilized at roughly 80%. We believe that the slowdown in retail productivity coincides with and is primarily driven by a range of factors, including a pullback in consumer spend on durable goods and secondarily, a pullback in marketing spend as we focus on profitability. Despite the lower retail productivity percentage, the unit economics of our stores remained strong.\n\nAs of Q2 2022, we had 141 stores opened for 12 months or more. These stores generated on average on an annualized basis, $2.1 million in revenue and four-wall margins in line with our target of 35%. We have achieved these results by driving increased conversion rates in AOV in store and through managing team schedules to match lower top line. And this strong performance is consistent across our store fleet.\n\nOur 2020 stores have paid back within 20 months and 24 of our 35 stores opened in 2021 have paid back with the remaining 11 on track for similar payback. Despite the decline in retail productivity in the back half of May and into June, we were still able to deliver revenue results that were within our guidance of up 13% to 15% for the quarter. Moving on to gross margin. As we have done on each call before we dive in, I would like to remind everyone that our gross margin is fully loaded and accounts for a range of costs, including frames, lenses, optical labs, customer shipping, optometrist salaries, store rent and the depreciation of store build-outs.\n\nOur gross margin also includes stock-based compensation expense for our optometrists and optical lab employees. As a general note, we've been pleased with the stability we've seen in the input costs of our products as we have thoughtfully managed expenses throughout our supply chain, including frames, lenses, and shipping costs. For comparability, I will be speaking to gross margin, excluding stock-based compensation. Adjusted gross margin in Q2 2022 came in at 57.9% compared to 59.3% in Q2 2021.\n\nThe primary driver of the decrease in gross margin was the continued growth in contact lenses from 3% to 7% year over year as a percentage of our total business. Expanding our contact offering is a core part of scaling our holistic vision care offering and a key driver of increasing average revenue per customer. While contact lenses have a lower gross margin percent versus our other product offerings, they are accretive to gross margin dollars given their higher purchase frequency and subscription-like purchase cycle. Next, we saw year-over-year deleveraging gross margin in two areas, which are the more fixed portion of our cost of goods.\n\nThese fixed elements of our COGS stack, our retail occupancy and optometrist salaries, which generally remain the same regardless of revenue. We added 33 net new stores over the course of the last 12 months going from 145 stores as of June 30, 2021, to 178 stores as of June 30, 2022, or an increase in our store base of 23% year over year, which naturally leads to an increase in store rent and depreciation from store build-outs. This 23% increase in store count compares to total revenue growth of 14% over the same period. We also saw a downward pressure on gross margin year over year from an increase in overall optometry salaries as we hired optometrists for our new stores and significantly expanded the rollout of our Professional Corporation, or PC model.\n\nAs of the end of Q2 2022, we operated with 87 stores where we engage directly with an optometrist and therefore, recognize both revenue from exams and optometrist salaries. These 87 stores compared to 37 stores at the end of Q2 2021, all of which at the time were direct employment models as we did not start our PC model rollout until Q4 2021. The majority of our 40 PC model stores are ones where we are converting an existing store with an independent doctor relationship to the PC model. And therefore, we had already been recognizing a significant portion of product conversion sales at our stores from the independent doctor.\n\nAs we convert these stores to the PC model, we expect near-term margin headwind given the gross margins on the exam service alone are lower than our glasses and contacts gross margins. With that said, we expect the PC model will benefit us in the long term as it gives us greater control over the customer experience enables us to recognize exam revenue and results in higher conversion rates from eye exam to product purchase. Offsetting the items mentioned was the continued mix shift of optical lab fulfillment completed at our in-house facilities in New York and Nevada. In Q2 2022, we continue to increase the percentage of orders fulfilled through our in-house labs, which has many benefits, including higher NPS and lower refund rates, faster turnaround time and improved gross margin overall.\n\nAs we continue to scale our Las Vegas lab, which we expect to reach scale in the back half of 2022, we expect to see more cost efficiencies that we believe will translate to improved gross margin. Lastly, we saw a benefit to gross margin from the expansion of our higher-margin progressive business, which, as we mentioned, has increased from 20% of our prescription business in Q2 last year to 22% in Q2 this year. Next, I would like to talk about SG&A expenses. Adjusted SG&A, which excludes stock-based compensation in the second quarter came in at $88.5 million or 59.2% of revenue.\n\nThis compares to Q2 2021 adjusted SG&A of $72.4 million or 55% of revenue, an increase of approximately 420 basis points of revenue year over year. In terms of year-over-year dollar growth, adjusted SG&A was up 22% compared to Q2 2021. On a sequential basis, Q2 adjusted SG&A is down approximately $8 million versus Q1 and a reduction of 360 basis points of revenue on a sequential basis. In H1, adjusted SG&A represented 61% of revenue.\n\nAs we'll talk about shortly in the guidance section, we're planning for H2 SG&A as a percent of revenue to be in the mid-50s on a percentage basis of revenue. As a reminder, SG&A for our business includes three main components: salary expense for our headquarters, customer experience and retail employees, marketing spend, including our Home Try-On program and general corporate overhead expenses. Most of our improvement in adjusted EBITDA will come from these areas, which I'll walk through in more detail. The primary driver of the increase in adjusted SG&A as a percentage of revenue year over year was related to an increase in corporate overhead expenses, which increased faster than revenue.\n\nThis increase was largely concentrated in two main areas: public company costs and investments in our technology infrastructure. On public company costs, we noted in Q1, these represented approximately 1.65% of Q1 revenue or approximately $2.5 million in the quarter. In Q2, we incurred approximately the same level of costs related to operating as a public company, which we did not incur a year ago. We expect public company costs will continue to provide deleverage year over year until Q4 of this year where we will compare to a period a year ago when we were a public company.\n\nOn technology spend and investments, we continue to invest in a number of key company initiatives to enhance both internal systems as well as customer-facing platforms. Salary expense within our SG&A category includes wages and benefits for our headquarters, customer experience retail employees. As a reminder, salary expense for our eye doctors and optical lab employees are all included in our cost of sales. We plan to continue to optimize retail salary expense as a percent of revenue as we schedule time for our retail and customer service teams and anticipate seeing consistency in these expenses throughout the remainder of this year.\n\nAs we'll talk about in the guidance section and to align our cost structure with the current environment, we moved forward with a reduction in force of 63 people or approximately 15% of our full-time corporate team. As it relates to marketing spend, we've highlighted previously that we maintained a highly flexible model with the only committed spend largely around linear TV during competitive periods. As we discussed last quarter, we've made and expect to continue to make significant changes to marketing spend levels as needed. Q2 marketing spend as a percent of revenue came in at 13.8% versus 15.6% in Q2 of 2021.\n\nAlmost a full two-point decline in line with our targets to see marketing spend as a percent of revenue stabilized in the low teens by year end. On a sequential basis, we've reduced marketing spend by almost seven points from Q1 to Q2 of this year. For the second quarter of 2022, we generated adjusted EBITDA of $5.9 million, representing an adjusted EBITDA margin of 4%, which was just above the high end of our guidance range of low single-digit margin. Despite the challenges presented in the quarter, we're pleased to still be able to generate increasingly positive adjusted EBITDA and to deliver profitability on an adjusted EBITDA basis in line with the range of our guidance.\n\nWe finished the quarter with a strong balance sheet, reflecting $212 million in cash and cash equivalents which will continue to deploy deliberately to support our growth and operations. We plan to see our cash balance remain near $200 million for the year as we manage spend across the business. Shifting to guidance and outlook for next quarter and the full year. We are revising top and bottom line targets in light of the challenges facing the optical industry and the U.S.\n\neconomy and our business. I'll first talk through the changes in our top line guidance, and then we'll talk through adjustments we have made and will continue to make to ensure continued incremental adjusted EBITDA in the second half of this year that we believe will set us up for continued adjusted EBITDA margin expansion in 2023. I'll talk through changes on both a full-year basis and to highlight the differences we anticipate to see between H1 and H2 of this year. On a full-year basis, I'll also be making comparisons to the high end of guidance provided earlier this year versus the high end of guidance we're providing today.\n\nOur prior top line annual guidance for revenue reflected growth of 20% to 22% over 2021 and a range of $650 million to $660 million. We're taking full-year guidance for revenue growth down to 8% to 10% year over year and a range of $584 million to $595 million. I'll walk through the differences in top line to bridge the prior guide to the current guide. We continue to project top line two main ways that we've discussed.\n\nThe first is based on active customers and average revenue per customer. The second is based on store count, store productivity and e-commerce growth. I'll talk about both and how they have changed. For the 22% case, we projected to see our store productivity return to 100% of pre-pandemic levels by Q4.\n\nIn mid-May, when we reported our Q1 results, we continue to see a bounce back of our retail business. As a reminder, our retail productivity has returned to 90% in early December of last year and dropped back to 80% of productivity by March due to omicron and then recovered to approaching 90% productivity in mid-May. We reflected that continued recovery in retail productivity, which has not occurred, but instead has leveled off at roughly 80% in July. We're now projecting retail productivity consistent with recent trends at 80%.\n\nWe were also seeing our three-year e-commerce CAGR consistent in the mid-20s. And with our pullback in marketing spend, combined with general softness in the category, are revising our three-year e-commerce CAGR targets to 21%. Our plans for store count remain unchanged. We still plan to open 40 new stores, finishing the year with 201.\n\nUnit economics for our stores remained strong despite the decline in revenue. While we historically haven't provided specific guidance on active customer and average revenue customer growth, given today's revision, we want to share some additional details on our view for these two metrics. We were projecting active customer growth of roughly 15% year over year and an increase in average revenue per customer of 7% year over year. Given the trends we are seeing in the business now, we're projecting a similar level of average revenue per customer growth of 6% and are reducing our projections for active customer growth to 3%.\n\nThis implies that we anticipate that the total active customers for the business will increase from $2.2 million in 2021 to $2.27 million an increase of approximately 70,000 customers year over year. This compares to our prior estimate of 2.5 million customers or an increase of approximately 330,000 active customers for the full year. We're still projecting a full-year average revenue per customer of $262, and we are on track to achieve that. We've seen continued strong revenue retention from existing customers as we show in our earnings slide or 26% over the first 12 months for our cohort that purchased from us in the first half of 2021.\n\nNew customer growth has been impacted the most by some of the trends we've discussed, amplified by a pullback in marketing spend. We previously guided toward a gross margin of 58% to 60% on an annual basis with some fluctuations by quarter given shifts in product mix. Our original guidance assumes full-year gross margin of 58% to 59%. We're now expecting gross margin closer to 57% for the full year.\n\nWe have seen continued faster-than-anticipated growth in our contact lens business, which we view as a positive. As contact lenses have lower margins, this will continue to have a delevering effect on gross margin. Roughly 40% of our COGS are fixed in nature, the majority of which are made up of store rent and eye doctor salaries. In an environment with slowing top line these investments in our store fleet and optometry will continue to have a delevering effect on margins in the medium term as exam offerings ramp, store and e-com growth returned to higher levels and as we scale high-margin products like progressive.\n\nWe're modeling the effects to gross margin of approximately 1.5 to 1.7 points of deleverage from the items above, taking gross margin from 58% in H1, closer to 56% in H2. Next, we will talk about the changes made to the deployment of spend and managing our cost structure. SG&A adjusted for stock comp expense came in at 58.4% of our spend in 2021. We previously projected 2022 full-year SG&A as a percent of revenue to be up to 200 basis points lower, driven by leverage in marketing spend and corporate overhead.\n\nWe now expect adjusted SG&A to be roughly in line with 2021 at 58%, which is primarily driven by lower revenue as we believe adjusted SG&A dollar spend will be lower than our previous expectations. Adjusted SG&A in H1 came in at 61% of revenue with Q2 at 59.2% of revenue. We're now projecting adjusted SG&A for the back half of the year in the mid-50s as a percent of revenue. To manage costs in the current environment, we have moved forward with a number of actions.\n\nWe have brought down marketing spend as a percent of revenue. Marketing spend in H1 came in at 17% of revenue, and we plan for this to be closer to 12% to 13% of revenue in H2. This equates to a reduction in marketing spend of roughly $12 million versus our prior plan, most of which is reflected in the second half of the year. We have also reduced our corporate cost structure to be more in line with lower top line.\n\nWe anticipate that these cost savings will continue to ramp throughout the remainder of this year and into next year. These initiatives include reducing corporate headcount by 15% and taking a closer look at all the dollars we spend with vendors to either pull back on spend or negotiate better economics where possible. We believe these cost reductions will set us up for continued adjusted EBITDA profitability next year. In aggregate, these cost reduction initiatives are expected to lead to savings of $8 million to $9 million this year and $15 million to $18 million next year.\n\nWe previously guided to adjusted EBITDA margin improvement of 100 to 200 basis points versus our 2021 adjusted EBITDA of 4.6% with a range of $38 million to $44 million based on our prior top-line guidance. We are now guiding to adjusted EBITDA for the full year of $22 million to $26 million or 3.8% to 4.4% adjusted EBITDA margins. This includes the impact of an estimated $15 million in lost revenue at the start of the year from omicron, which we believe would have had a $7.5 million positive impact to EBITDA in Q1. For the first half of the year, we generated adjusted EBITDA of $6.7 million and adjusted EBITDA margin of 2.2%.\n\nIn Q2, we were pleased to see a sequential step-up in adjusted EBITDA margin to 4% of revenue. At the high end of our range, we're projecting adjusted EBITDA of roughly $19.5 million in the second half of the year, reflecting H2 margin of 6.7%. This implies a 450 basis point improvement in adjusted EBITDA from H1 to H2 on revenue that is roughly $10 million lower than H1. It's important to understand that the pattern of adjusted EBITDA this year will look different from previous years.\n\nHistorically, we have seen adjusted EBITDA strong in Q1 with positivity continuing in Q2 and Q3 and then a decline as we ramp spend for Q4 and defer sales we generate from Q4 into the following year. This year, in H2, we plan for an average adjusted EBITDA margin of 6.5%. We expect this margin to be a little higher in Q3 and a little lower in Q4. The core cost savings initiatives that we have enacted are expected to drive our ability to generate incremental profitability, both in H2 and in 2023.\n\nWith respect to the third quarter, we're guiding to net revenue of $143 million to $146 million or revenue growth of 4.1% to 6.3% and adjusted EBITDA of $7.9 million to $9.5 million, representing adjusted EBITDA margin of approximately 5.5% to 6.5%. Finally, with respect to our outlook for 2022, we are forecasting stock-based compensation as a percentage of net revenue to be in the mid-teens compared with 20% in 2021 and stock-based compensation for both years is above our long-term forecast of low single digits starting in 2024 as a result of RSU expense associated with our direct listing and multiyear equity grants to our co-CEOs in 2021. The majority of which is performance-based and invest based on stock price targets from $47.75 to $103.46. Thank you for joining us this morning.\n\nAs we've discussed today, we're focused on what is in our control, while executing on our mission to provide vision for all, and by doing so of a smaller expense base moving forward, we expect to drive significant adjusted EBITDA improvements even in the face of macroeconomic and industry headwinds. We look forward to keeping you updated along the way. With that, we'll open up the line for Q&A.\n\nOperator\n\n[Operator instructions] Our first question comes from Oliver Chen of Cowen.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nRegarding store productivity, how much of that may be attributable to lower marketing spend? And how are you thinking about marketing spend and pulling back and how that's impacting your traffic. I would also love your thoughts on demand reacceleration and key factors there. The category is very durable, but we're just curious about what do you think happened this time? And what do you look forward to in terms of key variables to see the acceleration in the future?\n\nSteve Miller -- Senior Vice President and Chief Financial Officer\n\nFirst, thanks for your question, Oliver. We'll start with the demand question. And when we look at data from the Vision Council, for example, when they surveyed glasses customers, have they purchased in the last six months, we've seen that significantly depressed since the onset of the pandemic. And that has sort of not improved.\n\nOne of the things that was different with the omicron surge was the timing of it right during FSA season in the beginning of the year when we see lots of folks get eye exam. So we think that that sort of impaired glasses purchasing through the first half of the year. And when we conduct surveys, we actually found some differences between younger customers and older customers and motivations for getting eye exams and what drives that behavior. So for example, younger customers convenience is incredibly important older customers eye health is more important.\n\nAnd frankly, it's been very inconvenient to get an eye exam during -- throughout the pandemic, but in particular, in the first half of this year because of omicron, a lot of optometric practices and optical shops experienced temporary closures or doctors called out as they were sick that happened across every industry and every workplace. Also, we've heard anecdotally that some optical shops and optometric practices have permanently closed during the pandemic, and that there were some early retirements of optometrists. So we believe that there were folks that would have normally gotten exams that haven't, that didn't necessarily buy glasses. Well, to your point, this is a durable category.\n\nAnd people aren't going to go long periods without getting eye exams and buying glasses, certainly not our customer that has a median household income over $100,000, and we've seen durability in our contact lens business as contact lenses, are disposable product that needs to be replenished. So we expect that to continue to be quite durable.\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nYes. Thanks, Oliver. And then with regard to your first question around store productivity and how much of that is impacted by marketing spend in general, we tend to see that our e-commerce business is more highly correlated with marketing spend and performance marketing dollars, and that's why we elevated our marketing spend as a percentage of revenue in 2020 and 2021 when a higher portion of our sales were being generated from e-com. And now that our mix shift is -- it looks more like it did in 2019 in terms of where orders are being placed in stores versus online.\n\nWe do have confidence that our stores serve as billboards and don't need as much marketing support. And so while we believe a portion of the demand slowdown we've seen could certainly be attributable to us pulling back on marketing. We really did so in response to kind of softening demand, lower foot traffic that started before that pull back.\n\nSteve Miller -- Senior Vice President and Chief Financial Officer\n\nSure. I was just going to say, Oliver, just to contextualize the magnitude of the spend, we talked about spending roughly 17% and of marketing as a percent of revenue in H1, 20% and dropping to 13.8%. The target really for the back half of the year is getting to that 12% level that we were at pre-pandemic. So we are normalizing back to a level that we observed pre-pandemic that we think matches the business mix.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nAnd, Steve, as a follow-up on occupancy and optical salary, what should we know about the revenue growth to leverage those items in terms of how we should model that and the gross margin?\n\nSteve Miller -- Senior Vice President and Chief Financial Officer\n\nYes. For sure. Good question. So the color that we've given is roughly 40% of our COGS stack is fixed, and that fixed component is really made up of three pieces: the majority of which you just mentioned there's store occupancy, which is store rent, the depreciation of store build-outs, there's optometric costs.\n\nAnd then there are the costs of our two optical labs, which we embed in cost of goods as well. Most of those costs come from optometrist salaries and store rent. As we think about scaling our optometric business, we have 50 more stores this quarter versus last quarter where we have an employer like relationship with VOD, we either employ directly or through our PC model. We're happy with the pace of growth that we're seeing in our eye exam business, eye exams still represent 2% to 3% of our overall business.\n\nBut from a dollar perspective, that amount is up over 50% year over year. It takes time to ramp an eye exam practice, and we've got a number of new both employed and PC, eye doctors coming online. So while we anticipate this will continue to provide a deleverage from a gross margin perspective. In the near term, in the long term, it will set us up to do two things.\n\nOne is to tap into the $6.5 billion eye exam market and the second is to better serve our customers. What we've observed is a higher conversion rate from stores where we employed an eye doctor customers than making a product purchase. And we've also seen an increased mix of products at those stores like progressive and anti-fatigue lenses where input from an eye doctor is tremendously helpful to a customer's purchase decision.\n\nOperator\n\nOur next question comes from Mark Altschwager of Baird.\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nNeil, maybe just following up on your comments a moment ago on the drivers to the more depressed conditions this year. I mean it does sound like some perhaps some temporary factors related to the pandemic and consumer behavior, not necessarily lower spending power, lower intention to spend. So just curious there if you think that sets up some pent-up demand at some point or maybe this is just reflective of the consumer pulling back a little bit more. And then, Steve, I think you said you expect adjusted EBITDA profitability next year.\n\nwould you expect adjusted EBITDA growth and margin expansion? Or just maybe any more thoughts on how we should be thinking about the medium-term kind of growth and margin algorithm relative to the prior targets you've outlined?\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nSure. Thanks. This is Neil. I'll take the first part of the question.\n\nYes. What I think we've seen over the course of the first half of the year is that the beginning definitely had sort of depressed eye exams and behavior a lot due to omicron and pandemic, but toward the back half of the first half of the year, we believe that some of the inflationary pressures and other sort of dips in consumer spending did impact the category. So when we spoke to you all last in mid-May, the trend was looking quite positive. April, we had 90% retail productivity compared to 2019.\n\nThe first half of May was continuing that trend. And then we saw sort of dips. So we don't know how long this period will last. As we look at guidance for the rest of the year, the high end of the range, 10% assumes consistent retail productivity at 80%.\n\nThe low end of the range of full-year growth assumes 75% retail productivity, so a deterioration. And at this point, we felt that it was prudent to sort of look at our current trend and then look at if there continues to be a deterioration in the macro environment.\n\nDave Gilboa -- Co-Founder and Co-Chief Executive Officer\n\nAnd what we've always known and what has become quite clear this year is that a portion of customer behavior and spending in this category is due to necessity and is acute in nature, but a portion is also discretionary from a temporal perspective, and we're seeing some of those discretionary purchases being delayed but we do remain confident that at some point, that demand will begin to flow back through the system. As Neil mentioned, we're really being conservative in our assumptions around when we might see that. And we're not counting on that pent-up demand to show up in our forecast.\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nAnd, Mark, on your question as it relates to adjusted EBITDA margin profitability, I'll first talk a little bit about H1 versus H2 and then can provide a little bit of color as to how we're thinking about setting ourselves up for further incremental profitability. Next year, we'll provide more color and guidance on that at a future time. But in the context of adjusted EBITDA margin, as a reminder, we generated 2.2% adjusted EBITDA margins in the first half of this year, roughly 4% in Q2 and 0.5% or so in Q1. We are projecting 6.7% in adjusted EBITDA margin in the second half of the year.\n\nAnd that's really driven by a few factors, which we've talked about. One is a reduction in expenditures within SG&A. We've talked about the difficult decision we made to reduce headcount by 15%. And then we've taken a thorough look across our cost structure to understand what are more permanent changes we can make to our G&A spend in terms of renegotiating contracts with vendors, pulling back on consulting spend, adjusting policies related to T&E, taking a look at virtually every line that's embedded within SG&A.\n\nAnd those changes equate to roughly $8 million to $9 million in spend this year and roughly $15 million to $17 million in expenditures next year. So we have a high degree of confidence in the numbers that we put out there for H2. In terms of our incremental profitability algorithm, what we have talked about historically is adding 100 to 200 basis points of adjusted EBITDA margin improvement each year until we hit a 20% long-term target of 20% plus. If you take a look at the high end of our EBITDA guide, which is $19.5 million in H2 and assume what that average is across the quarters, it's roughly a 6.5% adjusted EBITDA margin in both quarters, there will be some variation.\n\nAnd so we are still refining our model, and we'll provide more transparency later in the year, but we would think about that 6.5% as the baseline off of which we're adding 100 to 200 basis points of profitability into 2013. And we feel like we're set up to do that based on the changes and adjustments we've made to the business.\n\nOperator\n\nOur next question comes from Edward Yruma of Piper Sandler.\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nFirst, just a quick modeling question. the lower bounds of the revenue increase guidance, does that imply that the efficiency go below that 80% level you've observed? Or kind of help me understand the upper and lower bounds there. And then just as a bigger picture question, as you've seen, right, some of the softer productivity trend, how does that impact your view on kind of '23 and '24 from a store perspective? Are there tweaks you can make to the store footprint or size to maybe give you a higher-level efficiency out of the gate?\n\nSteve Miller -- Senior Vice President and Chief Financial Officer\n\nSure. I'll address the first part of the question. In terms of the lower range of our guidance, which is up 8% for the full year and implies back half growth of roughly 4% year over year per quarter. That assumes a decline in store productivity from 80%, which is where we are today, down to 75%.\n\nAnd so we baked in a full five-point decline. And on the second part of the question, I'll hand that over to Neil.\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nWe continue to believe that it makes sense to open up stores and it's a good use of capital. Our stores irrespective of the cohort, right, the stores that we've been opening up recently, for example, continue to pay back within 20 months. So even at a depressed retail productivity. So 80% of 2019 levels is $2.1 million per store.\n\nWe're still achieving our historical target of 35% four-wall margins, so over $730,000 per store. We anticipate that we'll be able to grow that revenue per store over time. Given the macro environment, we don't know when that will be. But even at these levels, we believe that the store performance is strong, and we're going to continue to open up lots of stores going forward.\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nMaybe one other quick follow-up, if I may. You guys gave some great color on the gross margin impact of contacts and PC. I wanted to understand the other side of the coin. I know you've highlighted the opportunity in progressive.\n\nI know you even called out here that they were higher margin. how much of a lift was progressive to the business in the quarter and how much is baked in, in the back half?\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nSure. The color we've given as it relates to progressive is that they are certainly our highest gross margin product and a category where we continue to be significantly underpenetrated versus the rest of the market. So progressive for us in Q2 represented roughly 22% of our product mix up almost two points from Q2 of last year. In terms of the puts and takes in gross margin, we haven't broken out the specific gross margin percent impact from progressive beyond giving the color that we're underpenetrated and they are our highest margin products in terms of the deleverage that we've seen as it relates to the two categories that we've talked about a lot, contact lenses and the fixed portion of our COGS stack being occupancy and eye doctors.\n\nIt's split roughly evenly between the two, and we've certainly seen an offset through selling higher-margin products like progressive. So that has certainly been a nice point of leverage to offset some of the margin deleverage.\n\nOperator\n\nNext question comes from Brooke Roach of Goldman Sachs.\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nCan you talk to the recent demand trends that you're seeing in your stores business with a little bit more detail, any split that you can provide between ticket traffic results that you're seeing in suburban versus urban locations? And then maybe as a follow-up, can you help us understand what store metrics are embedded in your second half outlook, given the increased benefits that you have from the PC model conversion, additional optometrists in the stores and higher price point collections and progressive that should be driving increased store mix?\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nSure. Thanks for asking the thoughtful question, Brooke. We'll talk a little bit about some of the differences that we're seeing from a productivity perspective across our store fleet. What we've talked about previously is productivity levels of urban versus suburban stores.\n\nAnd in the quarter, we saw a roughly 10-point spread in productivity between those two main types of stores of roughly 10 points of urban stores, 73-ish percent and suburban stores, 83% to 84%, and that's consistent with what we've described on prior calls where we've seen the spread anywhere from 7 to 10 points. So that is certainly one dimension that we talked about. Our suburban stores continue to have a higher productivity than our urban stores. We also have a newer suburban fleet as we got our start opening stores in urban areas in the early days.\n\nWe are still seeing traffic more depressed to urban areas, driven by a number of macro factors, whether it's people having relocated to the suburbs or people spending less time in densely urban populated areas in office buildings. In terms of what we've seen store specific in regards to ticket and traffic, while we have seen lower traffic than we would like, certainly lower than the productivity number of 80% that we've published. We have seen an increase in two factors. One is an increase in conversion rate and a continued increase in AOV, which ends up bridging the gap we're seeing between traffic levels, which we haven't necessarily reported on other than indicating they're appreciably lower than our 80% productivity lever, but we're bridging that with higher conversion, given there's more intentional traffic and a higher AOV as customers are buying progressive and buying eye exams, contacts and glasses together.\n\nDave Gilboa -- Co-Founder and Co-Chief Executive Officer\n\nYes. And I would just also note that with the addition of eye doctors and the conversion to PC doctors, we have seen strong benefit. It's still early days in a number of those stores. But even within the first 30 days, we tend to see an increase in traffic, conversion, AOV, and sales.\n\nAnd so we -- while we're taking a cautious outlook, we do believe that these investments will benefit us both in the near term and will enable us to create a better experience for our customers and drive longer-term sales and profitability.\n\nOperator\n\nOur next question comes from Paul Lejuez of Citi.\n\nUnknown speaker\n\nThis is Brian on for Paul. I wanted to dig in a little bit on active customers per store and thank you for providing that guidance. It's very helpful. But that indicates that active customers per store is about 18%.\n\nSo I was wondering if you could maybe parse that out a little bit, what you're seeing there. Is it broad-based? Are your legacy stores performing similarly to new stores and new stores ramping a little bit slower? And then as you think about that going forward, should you -- do you think that active customers should kind of grow in line with average store growth?\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nYes, for sure. I'll talk about some of the metrics that we continue to see at our stores in a few different ways. The first is just to reiterate that for the 141 stores that have been opened 12 months or more, this is a metric we talk about a lot Our four-wall target margins are in line with the 35% target that we've consistently maintained over the years. In addition, our stores payback in 20 months or less.\n\nAnd we called out some of the activity we've seen from our most recent cohorts of new stores in 2020 and 2021, where all the stores we opened in 2020, 10 of them have paid back and 24 of the 35 we opened last year have paid back with the rest on track for that 20-month payback. As we think about active customers for the business, it's active customers, really which we blend across both our e-commerce channel and our stores. And so active customers we're up roughly 9% and revenue per customer up 8%, and that's a blend across both channels. We don't split that out and report on it separately and we'll continue to provide those as metrics just to help for modeling purposes, where we've certainly seen a lot of strength is in returning customers, both online and to stores.\n\nWe included an updated view on our revenue retention, which is a slide in our earnings back that we posted to our website, which shows that for the cohort of customers that purchased the first half of 2021, we've retained 26% of their revenue in Q2 this year, which is actually the highest we've observed at this point in time from any of our cohorts that have purchased across our business. So we'll continue to provide transparency as it relates to active customers, active customer growth, average revenue per customer and average revenue per customer growth. We'll do that in the aggregate as opposed to at the channel level.\n\nOperator\n\nOur final question comes from Mark Mahaney of Evercore.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nTwo questions, please. In the slides, you talk about this relatively low brand awareness that you still have. It's roughly 15%. Just talk about long term, your thoughts.\n\nJust remind us what the trend has been like what was that brand awareness a year or two ago, maybe pandemic? And then where would you like it to go? And how do you get it higher? And then the second thing I want to ask is just, Steve, you just mentioned that cohort data. It was a wonderful disclosure. The one outlier in that cohort data is that class of 2019 on a 12-month basis or on a 24-month basis, I can't tell whether that's -- well, it's a little odd. So just any thoughts on what happened? What was wrong with those people? I'm joking.\n\nBut if you look at that cohort, why do they stick out in terms of their retention rate?\n\nSteve Miller -- Senior Vice President and Chief Financial Officer\n\nYes. So first, I can address the second question. That was really due to the pandemic effect in 2020 when most people were not thinking about getting exams or buying glasses. We have seen a rebound, as you can see in our most recent cohorts.\n\nAnd so that's really kind of specific more depressed numbers that you see are really specific to coincide with 2020 activity.\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nAnd on the awareness front, we continue to see awareness tick upward. Our marketing activities as well as store growth. We anticipate we'll continue to raise awareness significantly. I also believe that the new categories that we're expanding into at a meaningful rate, contacts and eye exams enable us to be perceived as a holistic vision care company and a one-stop shop and just leads to even further word of mouth.\n\nA lot of our growth over the last 12 years is driven by word of mouth because our customers recognize the exceptional value and the great experiences that they have. And we expect that to continue going forward. Thank you. All we want to thank you all for your questions today and spending time with us.\n\nThis remains a challenging macro environment, but we're grateful for the leadership team and the entirety of Warby Parker that works tirelessly to make customers happy every single day. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDave Gilboa -- Co-Founder and Co-Chief Executive Officer\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nSteve Miller -- Senior Vice President and Chief Financial Officer\n\nOliver Chen -- Cowen and Company -- Analyst\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nUnknown speaker\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nMore WRBY analysis\n\nAll earnings call transcripts"
}