{
  "companyName": "Li Auto Inc.",
  "companyTicker": "LI",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/li-auto-inc-li-q2-2022-earnings-call-transcript/",
  "content": "Li Auto Inc. (LI 4.67%)\nQ2 2022 Earnings Call\nAug 15, 2022, 8:00 a.m. ET\n\nOperator\n\nHello, ladies and gentlemen. Thank you for standing by for Li Auto's second quarter 2022 earnings conference call. [Operator instructions] Today's conference call is being recorded. I will now turn the call over to your host, Janet Zhang, investor relations director of Li Auto.\n\nPlease go ahead, Janet.\n\nJanet Zhang -- Director, Investor Relations\n\nThank you, Jason. Good evening, and good morning, everyone. Welcome to Li Auto's second quarter 2022 earnings conference call. The company's financial and operating results were published in the press release earlier today and are posted on the company's IR website.\n\nOn today's call, we have our president, Mr. Kevin Yanan Shen; and our CFO, Mr. Johnny Tie Li, to begin with prepared remarks. Our founder and CEO, Mr.\n\nXiang Li, will join for the Q&A discussion. Before I continue, please be reminded that today's discussion will contain Forward-Looking Statements made under the Safe Harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. Forward-Looking Statements involve inherent risks and uncertainties.\n\nAs such, the company's actual results may be materially different from the views expressed today. Further information regarding risks and uncertainties is included in certain filings of the company with U.S. Securities and Exchange Commission and the Hong Kong stock exchange. The company does not assume any obligation to update any Forward-Looking Statements, except as required under applicable law.\n\nPlease also note that Li Auto's earnings press release and this conference call include discussions of unaudited GAAP financial information as well as unaudited non-GAAP financial measures. Please refer to Li Auto's disclosure document on the IR section of our website which contains a reconciliation of the unaudited non-GAAP measures to comparable GAAP measures. With that, I will now turn the call over to our president. Please go ahead, Kevin.\n\nKevin Yanan Shen -- President\n\nThank you, Janet. Hello, everyone, and thank you for joining our call today. I will review the key highlights of the second quarter and discuss our flagship mark SUV Li L9 which has received highly positive feedback from family users for its best-in-class combination of drivability, safety, comfort, and intelligence. We witnessed continued consumer adoption of EVs in the second quarter.\n\nChina's retail sales of new energy passenger vehicles surpassed 1.17 million during this quarter, more than doubled year over year according to the China Passenger Car Association with penetration rates climbing to 27.1% from 21.8% in the first quarter. We believe it will continue to rise, supported by more AEV model launches, continuous iterations of smart features, and the increasing user preference for clean mobility. We remain focused on offering state-of-the-art products to our family users. Despite the challenges posed by the COVID-19 resurgence across cities national light from March to May we delivered 28,687 vehicles during the second quarter, representing a 63.2% year-over-year increase.\n\nThese strong delivery results contributed to 73.3% year-over-year increase in total revenues, which totaled RMB 8.73 billion. Our deliveries in July reached 10,422, up 21.3% year over year. On August 1st, we proudly rolled the 200,000 Li ONE off the production line at our Changzhou manufacturing base. It took us just 986-days to reach this production milestone.\n\nOnce again, setting a record speed among China's emerging EV manufacturers following our historic speed in reaching the 100,000 unit mark. Li ONE is also the first domestic branded premium model priced above RMB 300,000 to achieve this production milestone. Moving to our supply chain, the COVID-19 resurgence severely affected the auto supply chain in the second quarter. Currently, there are remaining disruption and difficulties.\n\nBut they moderated as the pandemic became more campaigned. Although we are cautiously optimistic that our supply chain will normalize in the second half of the year. We should highlight that potential volatility remain and require us to constantly stay on high alert, especially given the ongoing pandemic. As we navigate the continuous unpredictability, we are focused on reinforcing our supply chain system, strengthening our partnership with parts suppliers to tackle parts shortage and the cost inflation and at the same time redoubled our emphasize on auto parts quality control.\n\nNow moving to profitability in the second quarter, we continue to see that the power of our product, our execution consistency, and our operational resilience enable us to mitigate the cost inflation that we have been experiencing along with the rest of the industry. As a result, our second quarter gross margin remained relatively solid at 21.5%, up 2.6% year over year as we remain devoted to R&D and network extension to fuel our future growth. Our operating expense increased by 91.9% year over year. Meanwhile, we continued to optimize our cost structure and manage our cash flow effectively.\n\nDespite the pandemic's impact, we achieved another quarter of positive operating cash flow of RMB 1.13 billion and free cash flow of RMB 451.7 million. As part of our efforts to accelerate growth and accommodate additional user demand with new model launches, we continue to expand our direct sales and servicing network. As of July 31st, we had 259 retail stores covering 118 cities as well as 311 services center and the Li Auto authorized body and paint shops are printing in 226 cities. While the pace of our sales network expansion have been challenged by the COVID-19 resurgence, we will strive to further extend our reach to users by upgrading our existing stores.\n\nIn order to optimize charging experience for our users, we also rolled out the charging map function in our Li Auto application are August 17th. The map covers over 30,000 charging stations and the 300,000 charging posts in 31 provinces and over 300 cities. From the six main charging station operators including State Grid and [Inaudible] and others, providing convenient energy replenishment options for our users. On June 21st, we unveiled Li L9 our flagship smart SUV.\n\nReflecting our intense focus on family users, we developed Li L9 to create a Mobile Home, Create Happiness. Thanks to our relentless R&D efforts and outstanding product definition capabilities. Li L9 boosts cutting-edge premium features to provide outstanding handling and automates comfort and safety. Every Li L9 comes standard with our flagship full stack self-developed autonomous driving system.\n\nLi AD Max is enhanced the functionality bolstered by upgraded perception and vehicle control capability was highly recognized by users in the test drives. As the first volume production vehicle with redundancy design, applied to its powertrain, steering system, braking system, and the power supply system for the computing platform. It offers enhanced reliability and safety. Supported by a computing platform composed of two Qualcomm Snapdragon automotive grade 8155 chips, and our enhanced deep learning-based multimode interactive technology.\n\nLi L9 provides a smart interior space featuring five-screen three-dimensional interactions for family members for all ages. We have received the positive feedback along with very strong order intake for the LI L9, particularly from our target family users. We will commence delivery of Li L9 by the end of August. While we forge ahead with our new model launches.\n\nWe also continue to pursue optimization for our existing product. In June, we released the OTA 3.1 update for the Li ONE taking the Li ONE user experience to the next level. This update feature a highly anticipated remote vehicle control function, allowing users to move the vehicle forward and backward in a straight line through our mobile application. This remote capability greatly increases users' convenience and improve their ability to park in narrow spaces.\n\nThe update also include an audio equalizer function, and the further optimization of our fully self-developed OTA function with enhanced accuracy for recommended length change, and the ramp entry or exit. Furthermore, we are steadily working on our plan of launching high-power charging BEV model next year. We are also working on deploying our HPC network to support our HPC BEV. Li L9 will be the first model in the industry to adopt the video orient platform to deliver advanced autonomous driving features, including NOA function, showcasing our strong R&D capability with high efficiency.\n\nOur self-developed autonomous driving algorithm have won much public recognition internationally. For example, we ranked the first in the 2021 New Thing's 3D vision detection and tracking tasks, and also won first place in the ICCV 2021 Workshop Interpret Challenging. We also have the largest number of autonomous driving users in China as of July 31st this year. Users with access to an OTA function exceeded 130,000.\n\nThe technology knowledge and insights accumulated through Li ONE gives us the advantage by helping us enhance our R&D efficiency during the Li L9 development process, refined products and further optimize the safety and performance of autonomous driving. In summary, we will continue to create happiness and the value for our family users by honing our existing products and expanding our model lineup, while enhancing our brand recognition for family users. We will also execute on our technology roadmap to solidify our lead in EREVs and advanced our HPC BEV development. With that, I would like to turn it over to our CFO, Johnny, for a closer look at our financial performance.\n\nPlease go ahead.\n\nJohnny Tie Li -- Chief Financial Officer\n\nThank you, Kevin. Hello, everyone. I will now go over some of our financial results for the second quarter of 2022. To be mindful of the length of this call, I will address our financial highlights here and encourage you to refer to our earnings press release, which is posted online for additional details.\n\nTotal revenues in the second quarter of 2022 were RMB 8.73 billion or USD 1.3 billion representing an increase of 73.3% from RMB 5.04 billion in the second quarter of last year. This included RMB 84.8 billion or USD 1.27 billion of vehicle sales in the second quarter of 2022 representing an increase of 73% from RMB 4.9 billion in the second quarter of 2021. The year-over-year increase in vehicle sales was mainly attributable to the increase in vehicle deliveries in the second quarter of this year. On a quarter-over-quarter basis, affected by supply shortage due to the COVID-19 in the second quarter of 2022 total revenues and the vehicle sales decreased by 8.7% and 8.9%, respectively.\n\nRevenues from other sales and services were RMB 249 million, or USD 37.2 million in the second quarter of 2022, representing an increase of 83.6% from RMB 135.7 million in the second quarter of 2021 and a decrease of 1.7% from RMB 253.4 million in the first quarter of 2022. The increase in revenue from other sales and services over the second quarter of 2021 was mainly attributable to the increased sales of charging stores, accessories and services in-line based higher accumulated vehicle sales. Cost of sales in the second quarter of 2022 was RMB 6.85 billing, or USD 1.02 billion, representing an increase of 67.7% year over year, and a decrease of 7.4% quarter over quarter. Gross profit in the second quarter of 2022 was RMB 1.88 billion of USD 280.4 million representing an increase of 97.1% year over year, and a decrease of 13.2% quarter over quarter.\n\nVehicle margin in the second quarter was 21.2%, compared with 18.7% in the second quarter of last year, and 22.4% in the first quarter of 2022. The increase in vehicle margin over the second quarter of 2021 was primarily driven by a higher average selling price attributable to the increase of vehicle deliveries of 2021 Li ONE since its release in May 2021. Gross margin in the second quarter of 2022 was 21.5%, compared with 18.9% in the second quarter of last year, and 22.6% in the first quarter of 2022. Operating expenses in the second quarter of 2022 were RMB 2.86 billion, or USD 436.5 million representing an increase of 91.9% year over year, and the increase of 10.9% quarter over quarter.\n\nResearch and development expenses in the second quarter of 2022 were RMB 1.53 billion, or USD 228.7 million, representing an increase of 134.4% year over year, and an increase of 11.5% quarter over quarter. The increase in R&D expenses over the second quarter of 2021. And the first quarter of 2022 was primarily driven by increased employee compensation as a result of our growing number of R&D staff, as well as increased expenses associated with new models to be introduced in the future. Selling, general and administrative expenses in the second quarter of 2022 for RMB 1.33 billion of USD 197.8 million, representing an increase of 58.6% year over year and the increase of 10.2% quarter over quarter.\n\nThe increase in selling, general and administrative expenses over the second quarter of 2021. And the first quarter of 2022 was primarily driven by increased employee compensation as a result of our growing number of tasks, as well as increased rental expenses associated with the expansion of the company's sales network. Losses from operations was RMB 978.5, meaning of USD 146.1 million in the second quarter of 2022, representing an increase of 82.6% year over year, and an increase of 136.9% quarter over quarter. Net loss was RMB 641 million, or USD 95.7 million in the second quarter of 2022.\n\nRepresenting an increase of 172.2% year over year, and compared with RMB 10.9 million net loss in the first quarter of 2022. Turning to our balance sheet and cash flow, our cash and cash equivalents restricted cash time deposits, and short-term investments totaled RMB 53.65 bidding or USD 8.01 billion as of June 30, 2022. Operating cash flow in the second quarter of 2022 was RMB 1.13 billion or USD 168.6 million. Free cash flow was RMB 441.7 million or USD 67.4 million in the second quarter of 2022.\n\nNow for our business outlook for third quarter of 2022, the company's deliveries to be between 27,000 to 29,000 vehicles representing an increase of 7.5% to 15.5% from the third quarter of 2021. The company also expects the third-quarter total revenues to be between RMB 8.96 billion and RMB 9.56 billion, or USD 1.34 billion, and USD 1.43 billion, representing an increase of 15.3% to 22.9% from the third quarter of 2021. This business outlook reflects the company's current and preliminary view on the business situation and the market condition which is subject to change. I will now turn the call over to our operator and start a Q&A session.\n\nThank you.\n\nOperator\n\n[Operator instructions] Our first question comes from Fei Fang from Goldman Sachs. Please go ahead.\n\nFei Fang -- Goldman Sachs -- Analyst\n\nGreat. Yes. Thanks for taking my question. Now the second quarter performance was impressive despite COVID and L9 has outstanding traction for its price point.\n\nSo congratulations on those, they were well done. My question is about your guidance. So the third quarter is in question for the 27,000 to 29,000 unit guidance that you provided, can you break it out by Li ONE and L9 and also as you ramp the production off the high ASP L9 but will gross margin improve? So that is the first question. My second question is about L9's retail traction.\n\nSo the company disclosed the early August that L9 has received 30,000 confirm orders. So just wonder if we can have a refreshed discussion in terms of this latest retail trend feedback, especially competition with the other new energy SUVs and MPVs that some of your EVPs have put in the market. [Foreign language]\n\nKevin Yanan Shen -- President\n\nAlright. Well, Fei, this is Kevin. Thank you for the question. So your first question.\n\nFor the guideline, actually, we still stick to our previous projects and that for September, we are going to ship more than 10,000 L9. And for your second question, for gross margin L9 will be higher, increased high-end product. Your second question about the traction right now, although, last month, we already kind of received almost the 30K order of L9. Today in the past two weeks, we still see a strong demand coming for L9.\n\nFei Fang -- Goldman Sachs -- Analyst\n\nOK. Got it. So part of my second question was to perhaps Kevin. If you can comment on sort of L9 in the context of this competition with other SUVs and MPVs that some of your competitors have put in the market.\n\nBut as far as BYD and so on and so forth. Are you seeing competitive threat from them that sort of cause you to change your strategy or introduce more marketing incentives in front of customers?\n\nKevin Yanan Shen -- President\n\nYes. In fact, the L9 has a very unique product positioning, actually, in this price band with this kind of size and smart features. We don't see there are any products that have kind of a product proposition close to our L9. Right now, it is more about how much we can convert our customer to place order on our L9, when they have the budget between RMB 400K to RMB 500K.\n\nFei Fang -- Goldman Sachs -- Analyst\n\nOK. That is helpful. Thank you.\n\nOperator\n\n[Operator instructions] And our next question comes from Tim Hsiao from Morgan Stanley. Please go ahead.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\n[Foreign language] So my first question, just wanted to follow up on the quarter guidance, because I think third-quarter volume guidance of 27,000 to 29,000 -- conservative. So considering the launch of L9 and improving supply dynamic. Should we attribute the conservative sell valid to the transition of Li ONE only or as the production ramp up of L9 is there any expectation or if there is any other reason we should take into consideration. So just simply due to the hiccup for Li ONE, how long do we should we expect this kind of impact will last? And my second question is about the sales mix of EREV, the plug-in hybrid and BEV next year.\n\nHow should we think about the mix in 2023 and could you provide some updates regarding the numbers of new models? If the mix of the BEV is going to increase substantially next year, should we concern about potential dilution to our margin or could that hurt our cash flow? So those are my two questions. Thank you.\n\nKevin Yanan Shen -- President\n\nYes. Tim this is Kevin. Thank you for your question. About the first question, in fact the -- when we give out this guidance, of course, we have seen some slowdown of the Li ONE order intake.\n\nI think primarily the issue right now is that when we have the new product into our retail stores, a lot of attention has been attracted by the new product, rather than the old product, actually, we are working with our sales team to regain the attention from our potential customers for Li ONE. So on the other hand, about the potential launch of the new product, actually, the only comment I can give right now is that it will coming soon and will come sooner than the expectation. Yes, that is the only comment I can give. And about the new product and model, BEV model we are going to launch -- we plan to launch next year.\n\nIn fact, as you can expect that for any new model we launch into the market we have intention to increase the revenue also to improve our cash flow, improve our profitability. So, therefore, with the new BEV model in our plan, we plan reasonable profitability of cost so it won't hurt our cash flow, it won't hurt our gross margin next year.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\nThat is perfect. Thank you very much, Kevin.\n\nOperator\n\nYour next question comes from Bin Wang from Credit Suisse. Please go ahead.\n\nBin Wang -- Credit Suisse -- Analyst\n\n[Foreign language] Basically, I got one question about Li ONE because investor told me like three things. Number one, the hierarchy in the U.S. working class has been reduced to two to three weeks. Secondly, now from this month, Li ONE offer around RMB 7,000 kind of promotion for insurance.\n\nNumber three, [Inaudible] which will be the next generation and Li ONE we are launching in November this year. Can you confirm these three things from investors? Thank you\n\nKevin Yanan Shen -- President\n\nThank you for your question. First of all about the week in time, actually the week in time right now is of course shorter than last month. As I already explained that the order intake is slower right now so therefore we can turn over the delivery faster. And about the RMB 7,000 kind of a promotion.\n\nActually, you got the information very updated that we kind of released this policy just this Sunday. About the new product you are asking about, I think the same answer, I already provided that it will come soon and the sooner than our expectation.\n\nBin Wang -- Credit Suisse -- Analyst\n\nOK. Thank you. Thanks so much.\n\nOperator\n\nThe next question comes from Paul Gong from UBS. Please go ahead.\n\nPaul Gong -- UBS -- Analyst\n\n[Foreign language] So just translate my two questions. The first question is regarding the cannibalization of L9 versus Li ONE. How much of the recent weakness of the Li ONE orders is due to the cannibalization of the new model and how much of it do you think yes is due to the weakening macro environment as well as the weakening demand for the cars in general? My second question is regarding the features. So the key highlights of the BEV, I think management previously mentioned that the BEVs and EREV, they should be -- based on different models, they have different features.\n\nAnd can you give us a little bit of color? How shall we think about the uniqueness or the attractiveness of your BEV view of such a crowded markets in the BEV market already?\n\nKevin Yanan Shen -- President\n\nPaul, this is Kevin. I will take your first question and Xiang Li will address the second question. The first question, the thing is that before we putting the car, L9 into our retail stores before people start to test drive it actually a we see no change of the order intake pattern of the Li ONE. But it is to a certain extent days, to our surprise that when we have the customer coming into the stores, to test drive some of the customer our original plan was to test drive Li ONE, but when they see L9 and when they after the test drive to L9.\n\nWe see especially the customer with enough budget, we see a lot of them converted to our L9 customer. So right now, as I just say explained that that is why one of the reason why we also have some more promotion plans for Li ONE, yes. And I think but on the other hand, we still have a confidence that Li ONE is still a very competitive product, because if we compare it with the existing products other than L9 other products are in the same price band RMB 300k to RMB 400k price then Li ONE is a still one of the most competitive product in the market.\n\nXiang Li -- Founder and Chief Executive Officer\n\n[Foreign language] So maybe two angles, that differentiation. The first one is around charging. In fact, we already have a prototype running right now that can charge 400 kilometers of range in 10 minutes. And the goal here is very similar to range extender vehicle, which is to replace all internal combustion engine vehicle for customers and have no anxiety in terms of range.\n\nOur data shows that among our L9 customers, 80% of them have home charging, and 100% of them have stable charging, either at home or in the office. So home charging are often charging is really not the key here. The key challenge is to enable customers to travel freely within key economic zones within China. For example, the Yangtze River Delta region, the Beijing Tangent region, Wuhan and big mega city areas we will support with high power charging so that customers can drive long distances, but no driving with no range anxiety, even if they are driving electric vehicles.\n\nSo the second advantage when it comes to electric vehicles is space, because of the engineering possibility enabled by electric vehicles and new architectures and new body types. We can provide a lot more space in our electric vehicles compared to range extender vehicles with the same footprint.\n\nPaul Gong -- UBS -- Analyst\n\n[Foreign language] If the airline cannibalization of Li ONE is higher than expected or how much of the capacity said and we prepare for L9?\n\nXiang Li -- Founder and Chief Executive Officer\n\nYes. The capacity is 15,000 for L9.\n\nPaul Gong -- UBS -- Analyst\n\nThank you very much.\n\nXiang Li -- Founder and Chief Executive Officer\n\nThank you. [Foreign language]\n\nOperator\n\nThe next question comes from Ming Lee from Bank of America. Please go ahead.\n\nMing Lee -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language] My first question is regarding the gross margin trend and also the battery cause a trend for second half of this year. [Foreign language] And the second question is regarding the competitive landscape. Recently, we also see idle brand, volume sales has grown steadily. And besides that, how do we expect the newly L8? It is a product competitiveness versus the current Li ONE? Thank you.\n\nKevin Yanan Shen -- President\n\nYes. This is Kevin. Thank you for the question. The first question is about the battery cost.\n\nActually, as we all know that the in the recent months that the raw material for battery has come down a little bit, but we would expect that for the coming months this year, the raw material cost will again fluctuate a lot. So therefore for the gross margin outlook it is a lot of time are based on the best cost. Therefore I can only comment down the battery cost will be kind of a half fluctuation. And for the new products that competitiveness, I will ask Li Xiang to comment.\n\nXiang Li -- Founder and Chief Executive Officer\n\n[Foreign language] So right now around L8 I can share two things. One is that it will be delivered released much sooner than many people expecting are expecting. And the second thing is that the period from release to delivery will be shorter than L9. And when L8 is available, I think that would be a good time to compare the product competitiveness with newly released competitors and we have full confidence that we will dominate all these products with our L8.\n\nMing Lee -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nThe next question comes from Xu Yingbo from CITIC. Please go ahead.\n\nXu Yingbo -- Citic Group -- Analyst\n\n[Foreign language] I have two questions. So first question is about EREV product with our midterm competitiveness strategy for your EREV product? And the second question is about money raising. Could you please talk a little bit more about ATM and further capital reserve project? Thank you.\n\nXiang Li -- Founder and Chief Executive Officer\n\n[Foreign language] So talking about Range Extended Vehicles if you are looking over the next five years, we still believe that our REV is the best solution for SUVs period. I will give you one example if you are looking at BYD, there are two main products above RMB 200,000. There is a Hong sedan, and there is Tang SUV. So in terms of Hong, which is a sedan, the REV sells much better than DMI which is the hybrid vehicle.\n\nBut for Tang, the case is exactly the opposite DMI sells better than REV. And the reason for that is when people buy cars in the RMB 200,000, RMB 300,000 range, when they buy an SUV, they have a very clear expectation that they want to go on longer trips, especially post-COVID. So our EV still the best solution up until today for SUV that solves range anxiety. So under that consumption within our biggest goal is to solve the efficiency challenge.\n\nAnd if you look at L9, there is many top media that have tested the L9. Our energy consumption levels filled leading in its class. Even with low SoC, the fuel consumption is only around 60% of much smaller internal combustion engine vehicles and it is much better than well many claim to the competitors, which are much smaller SUVs. Because at the end of the day, REV is as an EV is not an internal combustion engine, adding a battery to it.\n\nSo that is the key difference between PHEVs and our range-extended electric vehicles. There shouldn't be any discussion of which one is more advanced or which one is more backwards. For the users range extender vehicles is an EV that happens to have an internal combustion engine or we call range extender, whereas PHEV is really more of an internal combustion engine vehicle with a battery. I will give you another example.\n\nChrysler, which is a very established company with very capable technical skills, and their latest vehicle FL03 is an REV rather than PHEV. Despite the fact that -- has all the PHEV technologies in the world, but they still build in our REV as their most advanced solution. Because at the end of the day again, REV is really an electric vehicle. So the second question about the cash flow and ATM offering.\n\nI think first the Auto has very healthy operating cash flow and free cash flow, which can fuel our business I recall that. But in the long run we are the very clear we are still at the current state of art industry in 10 years to 15 years. So we still want to use that active market to secure more cash to further fund the company's development, especially in the R&D and also the new model R&D site. For the ATM offering I think we bid on this year saw our market condition.\n\nAs I just mentioned, we still want to secure more cash from the equity offerings. So we chose the ATM to do this. As most of the ATM offerings, we need to stop before we publish our earnings release. So hopefully we can finish this it can offer in the coming market?\n\nXu Yingbo -- Citic Group -- Analyst\n\nThank you.\n\nOperator\n\nThe next question comes from Jiong Shao from Barclays. Please go ahead.\n\nJiong Shao -- Barclays -- Analyst\n\n[Foreign language] I have two questions. First question is about for the new BEV cars. Are those new cars still going to be family oriented SUVs or something else? The second question is really about the guidance for the second half operating expenses. Thank you.\n\nKevin Yanan Shen -- President\n\nSo I have a short answer for the first question. In terms of the body type for electric vehicle, I still want to keep it confidential before it is released, because it is very unique design.\n\nXiang Li -- Founder and Chief Executive Officer\n\nAnd now those were added to Allegiant we still serve our family customers with our EVs and for the operating expenses. I think we have a very clear roadmap on our product and our goal for this next year sales target. So we will keep going to events on the R&D side and also on the network expansion to better serve our family customers.\n\nJiong Shao -- Barclays -- Analyst\n\nThank you.\n\nOperator\n\nAs we are reaching the end of her conference call, I would like to turn the call back over to the company for closing remarks. Ms. Janet Zhang, please go ahead.\n\nJanet Zhang -- Director, Investor Relations\n\nThank you once again for joining with us today. If you do have any further questions, please feel free to contact Li Auto's investor relations team. And that is all for today. Thank you.\n\nDuration: 0 minutes\n\nJanet Zhang -- Director, Investor Relations\n\nKevin Yanan Shen -- President\n\nJohnny Tie Li -- Chief Financial Officer\n\nFei Fang -- Goldman Sachs -- Analyst\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\nBin Wang -- Credit Suisse -- Analyst\n\nPaul Gong -- UBS -- Analyst\n\nXiang Li -- Founder and Chief Executive Officer\n\nMing Lee -- Bank of America Merrill Lynch -- Analyst\n\nXu Yingbo -- Citic Group -- Analyst\n\nJiong Shao -- Barclays -- Analyst\n\nMore LI analysis\n\nAll earnings call transcripts"
}