{
  "companyName": "Sirius XM Holdings Inc.",
  "companyTicker": "SIRI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/sirius-xm-holdings-inc-siri-q3-2022-earnings-call/",
  "content": "Sirius XM Holdings Inc. (SIRI 0.34%)\nQ3 2022 Earnings Call\nNov 01, 2022, 8:00 a.m. ET\n\nHooper Stevens\n\nThank you, and good morning, everyone. Welcome to SiriusXM's third quarter 2022 earnings conference call. Today, we will have prepared remarks from Jennifer Witz, our chief executive officer; and Sean Sullivan, our chief financial officer. Scott Greenstein, our president and chief content officer, will join Jennifer and Sean to take your questions.\n\nI would like to remind everyone that certain statements made during the call might be forward-looking statements as the term is defined in the Private Securities Litigation Reform Act of 1995. These and all forward-looking statements are based upon management's current beliefs and expectations and necessarily depend upon assumptions, data, or methods that may be incorrect or imprecise. Such forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially. For more information about those risks and uncertainties, please view SiriusXM's SEC filings and today's earnings release.\n\nWe advise listeners to not rely unduly on forward-looking statements and disclaim any intent or obligation to update them. As we begin, I would like to remind our listeners that today's call will include discussions about both actual results and adjusted results. All discussions of adjusted operating results exclude the effects of stock-based compensation. With that, I'll hand the call over to Jennifer.\n\nJennifer Witz -- Chief Executive Officer\n\nThanks, Hooper, and good morning, everyone. Thank you for joining us today. In the third quarter, we delivered solid results as we continue to drive growth and focus on a disciplined approach to cost management across our organization. While near-term objectives remain top of mind, we are focused on the strategy and investments that will drive long-term value for our stockholders, including continuous improvements in the differentiated listening experiences that our customers love.\n\nSelf-pay net adds were 187,000 in the third quarter as we sustained a record low churn of 1.5%, and total revenue grew 4% versus the prior-year period, while advertising revenue remained relatively flat as macroeconomic factors resulted in a deceleration in ad spending late in the quarter. Our subscriber growth, despite continued automotive supply chain constraints, is a testament to the loyalty of our listeners, the value of our content, and our highly resilient subscription business model. As such, we are pleased to reaffirm our full year financial guidance, although headwinds in the advertising environment will continue to add some degree of uncertainty in achieving 2022 guidance. As we move into the fourth quarter, we remain focused on maintaining our momentum with steady work to expand relationships with OEM and deliver an incredible content slate, new listener experiences, and exciting product and technology enhancements.\n\nOur products and content remain extremely attractive to vehicle buyers and automakers. Our new and used vehicle penetration rates continue to remain strong at 83% and 53%, respectively, and our enabled fleet reached 150 million vehicles in September. We completed several extensions of our agreements with automakers in the third quarter, including Subaru and Stellantis. In addition, our 360L platform launched in the popular 2023 Nissan Ultimate, and we should exit this year with 360L installations, up approximately 500 basis points as a percentage of new SiriusXM-enabled vehicles compared to the end of 2021.\n\nWe are also pleased with the progress we have seen with EV start-ups. In the coming months, SiriusXM will be available for the first time in Lucid's full lineup of electric vehicles. Announced yesterday, all Lucid customers will receive an over-the-air update in the coming months, launching a free beta version of SiriusXM. When the full SiriusXM experience debuted later in 2023, customers will move into our standard trial subscription funnel.\n\nWhile initial volumes will be relatively small, the Lucid beta provides an exciting opportunity to test enhanced capabilities and new solutions to drive forward the in-vehicle audio entertainment experience. This past year, our focus on opening new distribution channels has led to continuous broadening of our acquisition funnel, particularly on the streaming side of our business, which continues to see strong performance and is expected to be the majority of our subscriber growth this year. While our streaming business is still at an early stage, we are investing in building out the experience and our capabilities in anticipation that it will become a much more significant part of our subscriber mix in the near future, even as auto sales rebound over time. Streaming also remains an important part of our value proposition for our in-car subscribers.\n\nWe are also expanding beyond our historical demographics, identifying growth segments that comprise an additional quarter of the U.S. population. These growth segments are younger, more diverse, and willing to pay for multiple streams of audio entertainment. We have found that many additional consumers find the premium music and non-music content that only SiriusXM offers attractive and we are working to scale in these segments.\n\nTo help showcase our offering, this past quarter, we launched the second installment of our national ad campaign, the Home of SiriusXM, highlighting several content categories such as comedy, sports, lifestyle podcasts, and multiple music genres. The new spots feature talent, including Conan O'Brien, 2 Chainz, and Alacare, showcasing the diversity of content on SiriusXM that appeals to a multigenerational audience. The national ad campaign, coupled with the return of the NFL this fall, contributed to one of our biggest acquisition months to date on the streaming side. We are working hard to improve the consumer experience in and out of the vehicle.\n\nThis past quarter, our product and technology team drove several vital improvements to our core consumer listening experiences, most notably with advancements in our content personalization technology leveraged across both Pandora and SiriusXM. Pandora's personalized music experience has long been driven by our proprietary algorithms that continually learn from past user behavior, enabling Pandora to deliver music catered to each user's taste and preferences. Recently, we've made algorithm improvements that include scaling up our model and adding more signals derived from listener interactions with songs and artists. On the SiriusXM side, we made several in-vehicle personalization improvements to our 360L product, including the introduction of data-driven music and talk recommendations on 4U TAB, which has helped drive double-digit increases in listener click-through rates.\n\nWe also made enhancements to the 360L user interface that has significantly increased engagement and discovery of new content, including One Touch access to Pandora artist stations from SiriusXM's Now Playing screen. The update is live in select 2023 GM vehicles and will launch with more OEMs next year. Last week, we rolled out an updated version of SiriusXM on Apple's CarPlay with redesign navigation, new recommendation carousels cells, and several new design enhancements. An upgraded SiriusXM experience on Android Auto should ship in the coming months.\n\nLater this year, we also plan to update our core SXM mobile app for iOS and Android with a design refresh that will enhance navigation and streamline content discovery. The updated personalized carousels will ease listeners' quick access to a wide range of personalized recommendations, and the update will include visual enhancements like the new dark mode team. These are just the start of a series of improvements in the SiriusXM products that we will be making in the coming months. In addition to the product enhancements, we continue to broaden our content in music, comedy, and sports to draw and streaming subscribers that are younger and more diverse.\n\nThis audience segment tends to over-index on fandom for music artists and other celebrity talent. We see a real opportunity to highlight the intimate connections and unique artist experiences that we have built our brand on over the past two decades. This past quarter saw launches of new artist shows, channels, and special events. For example, six-time Grammy Award-winning Singer-Songwriter Brandi Carlile, launched her new show, Somewhere Over The Radio on the Spectrum, where Brandi engages in candid conversations with guests from the LGBTQ community and their allies.\n\nThe launch of The Chicks Channel, a limited-run channel celebrating the music of the 13-time Grammy winners was another great example of our curated artist experiences. And the channel provided a great promotional vehicle for the artists to connect with fans across the country while they were on tour this summer. Turning to our small-stage series, we hosted two iconic bands at the Apollo Theater in New York City this quarter, pearl Jam and the Red Hot Chili Peppers, ology performed for us in Philadelphia, John Legend in Los Angeles, and earlier this month, we hosted Lizzo in her hometown of Detroit. These incredible experiences continue to prove a valuable and unique subscriber benefit with our Enter to Win campaigns reaching record highs, while promotions through dedicated pop-up channels rebroadcast across our most popular stations and other on-demand content in the SXM App contributed to a 22% year-over-year lift in on-demand listening.\n\nThe third quarter also saw a strong performance in our sports category. SiriusXM remains an essential unmatched subscription for sports fan, offering more live games and events to listeners in North America on one platform with one subscription than anyone else in audio. We recently extended our NFL agreement as the exclusive third-party audio broadcaster of every NFL game, and we continue to cover sports underserved by other outlets. Sports have a proven appeal to new subscribers with trailers who listen to sports channels converting to paid subscribers at a higher rate and one subscribed sticking around with higher retention rates.\n\nWe know there is more opportunity to capture audio share on this front, and we recently launched our first-ever, fully dedicated sports campaign to increase awareness. Lastly, we remain incredibly bullish on the broader entertainment, political, and news talk audio ecosystem that we were continually cultivating. As part of our election coverage, Crooked Media's top-ranked podcast have taken over the SiriusXM Progress channel's weekend lineup leading up to this month's midterm elections. This special programming includes recordings of Pod Save America taped in front of live audiences at SiriusXM's L.A.\n\ngarage studios. SiriusXM subscribers also had exclusive early access to a Pod Save America interview with former president Barack Obama. And we will soon be launching a full-time original Team Coco comedy channel available only to SiriusXM subscribers, tapping into the large-scale fandom behind his popular podcast, Conan O'Brien Needs a Friend. Our unique broadcast strategy sets us apart in the marketplace as we can monetize efficiently through off-platform distribution and give advertisers and creators a thing they want most, tremendous audience reach across all platforms while also offering creators' unique access to the exclusive and live audience of SiriusXM.\n\nToday, we touch over 150 million listeners, including SiriusXM, Pandora, SoundCloud, and our broader podcast and off-platform ad network. Having the best content and talent and podcasting makes us the leader in digital audio advertising. We have more shows in Edison's Top 25 Podcast rankings than any other network, with Prime Junky, Office Ladies, Dateline NBC, Pod Save America, and Conan O'Brien Needs a Friend continually making the chart. In the third quarter, we added ad representation and distribution agreements with the school of Greatness and the Mel Robin podcast.\n\nCapitalizing on the growth we are seeing in podcasting, SXM Media recently deployed new ad products to give brands more automated and efficient ways to buy advertising at scale. Our new podcast Everywhere Solution allows brands to reach their audience wherever they're listening, and our podcast Select product gives advertisers better control over audience targeting. Revenue from these two solutions, plus Podcast Programmatic, meaningfully increased compared to a year ago, and we saw more than 250 additional advertisers leveraging network solutions such as these versus Q3 last year. We expect continued uncertainty around macro factors and recessionary trends impacting the broader economy in the coming months to dampen the digital audio ad market, but we are encouraged by the early response to these foundational drivers of our SXM Media business.\n\nWe are closing the year with momentum in our vehicle distribution, new product and technology enhancements and an exciting pipeline of fresh content, including the launch of Team Coco's channel and next week's special event with Grammy award-winning hip-hop artist Drake live at the Apollo. The announcement of exclusive show for SiriusXM led to record-breaking downloads of the SXM app in the days that followed, and we are incredibly excited to share Drake's performance next week with listeners. To wrap up, despite some uncertainty in the macro environment, we continue to pursue all avenues of opportunity to build long-term and sustainable value for our business and remain equally committed to delivering consumers the best and most comprehensive choice and premium audio content. I am confident we have taken appropriate actions to finish the year strong I'm excited and energized by the momentum of our business and organization and the culture of progress at SiriusXM.\n\nAnd with that, I'll turn it over to Sean.\n\nSean Sullivan -- Chief Financial Officer\n\nThank you, Jennifer, and good morning, everyone. Starting with a recap of the third quarter financials, revenue was up 4% in the quarter to $2.28 billion. Within that, advertising revenue was up 1% to $457 million, while subscription revenue climbed 4% to $1.7 billion. Adjusted EBITDA was flat at $720 million as we continue to make material investments in sales, marketing, content, and product development.\n\nDuring the quarter, we booked $69 million of onetime charges, reflecting cost to exit real estate leases, personnel severance, and a write-off of select software development initiatives that we no longer intend to pursue as we speed ahead on other enhancements to the listener experience. Net income for the quarter was $247 million, representing diluted earnings per common share of $0.06 or $0.07 excluding the onetime restructuring costs. We generated $329 million of free cash flow during the third quarter, down year over year, as the third quarter of 2021 benefited from $208 million of satellite insurance recoveries. In addition, free cash flow felt the material impact of a $56 million year-over-year increase in cash taxes as most of our federal net operating loss carryforwards became fully utilized last year.\n\nWe expect cash taxes, which were $82 million in 2021, to grow to approximately $270 million this year. This year's increase was partially mitigated by the use of R&D and other tax credits. These tax credits are likely to be available on a much smaller scale in 2023, including the adverse timing of certain R&D expenses that are now required to be capitalized under Section 174, therefore, we expect our cash taxes to continue growing meaningfully next year. Also, looking ahead, we expect capital expenditures to increase next year as production for the SXM 11 and 12 satellites currently being procured begins to ramp.\n\nAs we discussed at investor conferences in September, a combination of years of improving churn and successful used car and win-back programs means that we have more subscribers on our low-band spectrum today than we might have thought a few years ago. So this constellation refresh signals our commitment to maintaining premium services on our low-band spectrum and will also give us options to create new revenue streams on this portion of our spectrum over the long term. Turning to our operating segments. At SiriusXM, total revenue in the third quarter increased 5% to $1.7 billion, driven by a 6% increase in ARPU to a record $15.72, which includes a 6% advertising growth rate on the SiriusXM platform, combined with a larger self-pay subscriber base compared to the prior-year period, partially offset by lower paid trial subscribers.\n\nAs Jennifer mentioned, SiriusXM's net self-pay subscriber growth in the quarter was an outstanding 187,000, boosted by trial funnel growth in the second quarter, leading to increased conversion opportunities combined with growth in our streaming-only subscriber base. During the third quarter, SiriusXM's new and used car trial starts were both down 4% sequentially as auto industry sales continue to remain soft and vehicle prices remain near record highs. And analysts largely expect this to continue. Since May, the consensus 2023 SAAR estimate has fallen from 16.6 million to 14.8 million.\n\nWe anticipate that continued softness will continue to impact the trial funnel and self-pay net adds into Q4 and into next year. Gross profit in the SiriusXM segment climbed 6% to $1.08 billion, representing a gross margin of 62%, a point higher than last year's third quarter. In our Pandora and off-platform segment, third quarter advertising revenue of $407 million was a slight increase versus last year, and Pandora's ad revenue per 1,000 hours of $103 declined slightly from $109 in the third quarter of 2021. During the quarter, our Podcasting and off-platform generated $123 million in total revenue, an increase of 37% year over year.\n\nNon-Pandora ad revenue was about 38% of the company's total ad revenue during the quarter, and we expect this to continue growing over time. This past quarter, we saw growth in political advertising in restaurants, travel, and tech have all been strong categories for us. Pharma, entertainment, telecoms, and financial services have shown more weakness in recent months. Gross profit in the Pandora and off-platform segment declined 12% to $173 million, representing a 32% gross margin.\n\nThe margin decrease in the third quarter of 2021 is mostly due to investments we are making in new podcasting content, and we expect the margin profile of these new advertising representation deals to improve over time. Today, we reiterate our existing financial guidance for 2022, revenue of approximately $9 billion, adjusted EBITDA of roughly $2.8 billion, and free cash flow of about $1.55 billion. Given the macro outlook and headwinds in the advertising market, we remain focused on cost discipline across the organization, and we expect that to continue in 2023. That discipline will be important given the CPI adjustments to some of our streaming royalties and the expiration of our discounted 2015 rates or pre-1972 content will produce an increase in music royalty costs next year.\n\nOn the capital allocation front, we returned $262 million to stockholders in the third quarter with $176 million of share repurchases and $86 million in dividends, bringing year-to-date capital returns to roughly $1.84 billion. We are very pleased to announce a further 10% increase in our recurring dividend on top of last year's 50% increase. This marks the sixth year in a row of double-digit increases to our dividend. We ended the third quarter at 3.5 times net debt-to-EBITDA within the low to mid-3s range we previously articulated.\n\nOur balance sheet remains exceptionally well-positioned with limited near-term maturities and roughly $1.4 billion of liquidity available at the end of September via cash and undrawn revolver capacity. We have significant capacity to continue investing in the business, evaluating strategic opportunities and to continue returning capital to our stockholders. With that, operator, let's open it up to Q&A.\n\nOperator\n\nThank you. [Operator instructions]. We now take our first question from Ben Swinburne at Morgan Stanley. Your line is open.\n\nPlease go ahead.\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nThank you. Good morning. Maybe two questions. One, maybe for Jennifer, on digital subscribers, which seems like they continue to build, can you just remind us of sort of the unit economics for that business relative to the core satellite business and whether or not it's becoming large enough to sort of start to impact gross margins? I think you've got pretty attractive economics on the digital front.\n\nAnd then maybe, Sean, as you think about expense growth into next year, you mentioned cost discipline and some of the pressures on the licensing front. How does that all shake out at this point in terms of kind of where you guys are leaning in and where you see opportunities to pull back when you think about the overall opex space for the company looking into next year? Thank you.\n\nJennifer Witz -- Chief Executive Officer\n\nOK. Thanks, Ben. First, on the satellite versus streaming subs, the unit economics that we talked about in the past are pretty different in terms of the upfront cost to acquire a subscriber. As you know from your years focusing on our business, on the satellite side, we have upfront SAC that doesn't necessarily tie to producing a subscriber.\n\nOn the streaming side of the business, our upfront costs are much more marketing-based, whether they be with partners or direct marketing performance media. And that will fluctuate based on what we are seeing happening in the markets. Obviously, we're really focused on cost per trial as it relates to LTV of these subscribers. And so the dynamics of that may shift in a given quarter, whereas the funnel is obviously clearly a function of what automotive trials are in a given period.\n\nSo the levels of subscribers will be dynamic based on how we're investing in the market. The marketing investments that we make toward streaming trials continues to get more efficient. Part of that, obviously, near term has just been the trends in advertising in general, and we're able to buy at lower rates. But also, as we learn which channels are more effective for our business, we continue to optimize there.\n\nSo I mean the economics from a margin standpoint, as we said in the past, are pretty consistent. And I don't -- they're not material enough today to really impact overall gross margin. But as we said in the past, our prices on streaming are lower than on satellite, but the actual margin percentages are relatively consistent.\n\nSean Sullivan -- Chief Financial Officer\n\nYes. And Ben, on the expense growth, again, it's important to reiterate that we're obviously investing for long-term growth. So we're doing a number of things around product, platform, features, functionality, and that's both opex and capex. I think it's just as important to highlight for everyone as we look into 2023, and we'll have more to say certainly in February on the year-end call, some of the things that are impacting the business and the fact that we're focused on it.\n\nSo for example, the expiry of the pre-'72, that's a 2015 event that expire to the end of '22. I thought it was worth highlighting that for everyone since it was public a number of years ago. So we'll remain focused. We've talked about facility rationalization.\n\nYou saw some of the charges we took in Q3. We continue to prioritize headcount against key roles and key strategic initiatives, and we'll continue to do that and look for efficiencies across the organization to continue to fund the growth initiatives that we have on the plan.\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nThank you both.\n\nHooper Stevens\n\nOperator. Next question, please.\n\nOperator\n\nWe'll now take our next question from Jessica Reif Ehrlich at Bank of America. Your line is open. Please go ahead.\n\nJessica Ehrlich -- Bank of America Merrill Lynch -- Analyst\n\nThank you. Good morning, everyone. Your churn is astounding, it's so low. And I'm just wondering, are you seeing any increases in bad debt? We're hearing cable operators starting to say that.\n\nAnd just the turn at this level, at this low level, does it imply that pricing power, can you just kind of talk to how you're thinking about that? And secondly, can you give us color on Podcast Everywhere? How different is this offer from prior sales efforts? I mean you'd kind of call out and mentioned on the call more targeting. And then just last, just a clarification, but what are your subs from streaming only?\n\nJennifer Witz -- Chief Executive Officer\n\nOK. I could take a couple of those. So starting with churn, I continue to be amazed at how low our churn rate has been. We have not seen any real negative impacts on non-pay or canceled demand on the voluntary side that would indicate that there is a different health of the consumer to be concerned about.\n\nSo our nonpaying voluntary continue to trend in that sort of 1% to 1.1% range. It's been very strong. And again, I tie that to the improvements that we have made in our streaming products. We have many more satellite subscribers listening outside of the car, and that continues to drive engagement across those subscribers.\n\nAnd so we would expect vehicle-related going forward to increase, hopefully, as the auto trial -- or the auto funnel continues to slowly recover. So that will have an impact on churn, but we're very pleased on where we are in non-pay and voluntary. And I do think that gives us some opportunity on pricing. We obviously have the rate increase we did last fall rolling through this year.\n\nBut as we look forward to next year, we will look again at our rates. We have consistently raised prices. I think, as you know, we've launched these services 20 years ago at a $10 price point and we're now -- our primary package is priced at $18. So should we have an annual average increase of about 3%.\n\nThere are some tailwinds, I think, with other audio and video services raising prices. Obviously, in an inflationary environment, that certainly could help support that. But the reality is we need to continue to deliver value for our subscribers, and that will come through increased content, better features and capabilities in our products and certainly access to listen in more locations. And we're very focused on building the value in the products so that we can continue -- just checking to see if you all can hear me still?\n\nHooper Stevens\n\nDo you hear us?\n\nJennifer Witz -- Chief Executive Officer\n\n-- back now. Sorry about that. OK. Great.\n\nThe two products will allow us to offer brands more solutions in podcast advertising. And look, we're trying to increase automated capabilities so that brands can continue to connect to their audiences at scale across our network. We're -- that includes new ad targeting capabilities that are very privately minded, and we talked last quarter about what we're doing with ComScore on predictive audiences there. And these solutions will also enable content filtering, which is increasingly important for brands to have brand safety and suitability guidelines for their advertisements.\n\nSo this is just an indication of how we continue to innovate using our Ad technology. And the fact that the market, I think, will continue to move toward some more automated and programmatic solutions that the audio market is clearly behind where we are on video in general. So look, the podcast solutions that we're developing are clearly important to drive growth in podcast revenue. You see some of our numbers on podcast advertising and off-platform in general relative to our overall advertising that continues to grow.\n\nAnd we represent the -- some of the biggest networks in the world, whether it's NBCUniversal, Audio Chuck, or Crooked Media. So we're going to continue to invest here. And there was one other.\n\nSean Sullivan -- Chief Financial Officer\n\nYes. And then, Jessica, I think your last question was about the number of streaming subs. We have not yet disclosed that. And as that grows and becomes more material, we can revisit that in the future.\n\nJessica Ehrlich -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you.\n\nSean Sullivan -- Chief Financial Officer\n\nOperator?\n\nOperator\n\nWe'll now move on to our next question from Bryan Kraft at Deutsche Bank. Your line is open. Please go ahead.\n\nBryan Kraft -- Deutsche Bank -- Analyst\n\nThank you. Good morning. I wanted to ask two, if I could. I guess, First, can you just talk about what you're seeing in advertising so far in the fourth quarter? Has it slowed from the third quarter? Is it holding up OK? And is that being impacted by political? If you could just remind us to what degree do you participate in the political cycle? And then secondly, just wanted to see if you could provide any additional color on your streaming-only subscribers in terms of -- I know, Sean, you don't disclose subs yet, but I don't know if you can give us some rough contribution to net adds in the quarter.\n\nAnd then also, anything on the behavior of that customer as far as engagement, churn, demographics, and maybe anything on their broader listening behavior? Do they subscribe to music on-demand services like Apple Music or Spotify? What's their behavior as far as home car and other out-of-home usages? I mean anything you could share there would be great.\n\nSean Sullivan -- Chief Financial Officer\n\nYes. So Bryan, let me start. So on the advertising market, as I think I mentioned in my comments, we did see a bit of a deceleration in the end of the third quarter. In terms of demand, I think we're seeing that broadly across the landscape in terms of advertising.\n\nSo we are watching it closely. It is the one thing that we don't really have complete control over as we think about delivering our 2022 financial guidance. But the good news is we have the capacity. We have the ability to monetize in Q4, which hasn't always been the case at Pandora in Q4.\n\nSo we feel good about the opportunity. We just need the market to stabilize and not deteriorate any further. As it relates to political, we do participate in the political cycle. It is not a material portion, but we have seen growth.\n\nWe saw growth in Q3 versus the last year, not surprisingly. And hopefully, the expectation is we'll see a slight uptick in Q4 from the political cycle in the midterm elections. So we'll do that. As it relates to the streaming-only subs, as I said, I think the good thing in Q3 is we saw positive net adds in both streaming and satellite in Q3.\n\nI don't know if Jennifer, you want to jump in on listening behavior and anything else in the streaming side.\n\nJennifer Witz -- Chief Executive Officer\n\nThey are still a relatively small portion of our overall base. But from -- in terms of what they look like, in general, our streaming subscribers tend to be younger, more diverse, a little more urban. And we do believe that there is a larger opportunity to go after segments that are different than the core segment. We have relatively high penetration rates in today that has obviously been clearly focused on in-car listing.\n\n. So as we pursue streaming-only subscriptions, there is still listening in the car, whether through CarPlay or Android Auto. And you saw that we recently released an update for CarPlay that I think we'll offer better navigation and discovery through that application, and we expect to improve the Android Auto app as well or capability as well. This is really the first time we've done a major update in several years, and there is definitely more to come here. But these subscribers also listen more outside of the car.\n\nWe see behaviors are a little different in terms of the type of content. They listen to you because they're younger and more diverse. So there's more hip-hop and pop versus more hard rock and country maybe with our in-car subscribers. And I think there's still a lot of opportunity here, and we really are just getting started on the product front and rolling out improvements.\n\nWe have work to do on making sure that we are surrounding these listeners with content they love. They may come in and listen to something specific, but we have more personalization coming into the app with -- we just launched based on your listening carousels in the apps, and we hope to have a design refresh later this year. And that is going to enable these subscribers to listen to even more on-demand content, Pandora artist stations, and our extra channels, which are just enabling more control in an environment where clearly consumers expect more of that.\n\nBryan Kraft -- Deutsche Bank -- Analyst\n\nGot it. Thank you very much.\n\nOperator\n\nWe will now move on to our next question from Steven Cahall at Wells Fargo. Your line is open. Please go ahead.\n\nSteven Cahall -- Wells Fargo Securities -- Analyst\n\nThank you. So I thought the Lucid announcement was interesting, and I was wondering if you're able to track at all what your penetration is of electric vehicles. And if you've got any difference in penetration of electric vehicles may be versus combustion vehicles just because that's such a big secular trend and we've got some new OEMs as well as growing models at existing OEMs. So that's the first one.\n\nAnd then just a couple of quick follow-ups after that.\n\nJennifer Witz -- Chief Executive Officer\n\nYes. Thank you, Steven. On the Lucid, really pleased with the Lucid announcement, in part because they're just one of the leaders in the luxury EV space, and we're thrilled to be aligned with them. I think one of the great things is that we continue to hear from our customers that if we're not in a vehicle, whether it's combustion or electric, that they want to make sure that they have access to an embedded satellite radio subscription or embedded SiriusXM experience.\n\nAnd so that's certainly come up, and we keep hearing it from our consumers. It's logical given that many of the initial EV launches have been targeting higher affluent customer base, and that's where we obviously do really well. Our pen rates on the sort of more start-up EV companies are pretty low. I mean we are just getting started in doing some of these agreements with those EV automakers, and we expect to have more to say on that in the coming months.\n\nThe electric vehicle cars that are being produced by the OEMs that we have had relationships for years, our -- the pen rates are very similar to what we see on the combustion engine side. So there's really not a difference in pen rates for all the other OEMs that we've been working with over all these years. And again, the automakers on that side of the business are very committed to SiriusXM. You saw that we announced the extension with Stellantis and with Subaru.\n\nSo we continue to renew and extend those agreements. There's just a lot of support, obviously, for having the very seamless and easy-to-use service that we provide in the car.\n\nSteven Cahall -- Wells Fargo Securities -- Analyst\n\nThanks, Jennifer. And then just a couple of kind of housekeeping modeling ones. Maybe first, how should we think about capex going forward? I think satellites 11 and 12 are going to be ramping pretty soon. And whenever inventories do pick up, which I know no one has a crystal ball on and our self-pay net adds start to pick up, should we expect churn to tick up a little bit as well due to vehicle churn? Thanks.\n\nSean Sullivan -- Chief Financial Officer\n\nYes, Steven. On the capex, as we said, 11 and 12, I think the majority of that spend will be absorbed in '23 and '24. So those will be the bubble years and then moderating in '25 and beyond.\n\nJennifer Witz -- Chief Executive Officer\n\nYes. And on churn, you're absolutely right, as auto sales pick up, new end use, by the way, we would expect to see some lift on the vehicle later site.\n\nSteven Cahall -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nOperator\n\nThank you. We'll move on to our next question from Stephen Laszczyk at Goldman Sachs. Your line is open. Please go ahead.\n\nStephen Laszczyk -- Goldman Sachs -- Analyst\n\nHey. Great. Thank you. Good morning.\n\nMaybe just to expand on the ARPU point from earlier, your Apple rates are priced by about 10% at the other week. Can you maybe just talk a little bit more about how you think about your pricing strategy to some of the other music services? And if we did see broader base price increases from the streamers, is that something that you think could give you headroom above and beyond the typical 2% to 3% pricing growth that we've seen in the service over time over the next year? Then I have a follow-up.\n\nJennifer Witz -- Chief Executive Officer\n\nIt certainly doesn't hurt. We really do see that many of our subscribers who choose to be active end up using AM/FM. So while we are competing with other audio services, AM/FM is still dominant in the car, from a share-year standpoint. So we're very cognizant of that level of competition.\n\nObviously, we have been premium-priced relative to AM/FM for a long time. But the rise in some of these other music streaming prices is certainly a tailwind. And I would say gives us more confidence that we probably have some room to continue to raise rates in a productive way relative to how we're adding value to the subscription.\n\nStephen Laszczyk -- Goldman Sachs -- Analyst\n\nGreat. And then just a follow-up on Steve's prior question on the EV penetration. I think both of your deals with Tesla and Lucid are 100% over there, software-enabled. Do you expect this to be the status quo for EV manufacturers going forward? And then I was just curious if there's any significant differences in the economics of the deals with EVs versus traditional automakers that we should be aware of.\n\nJennifer Witz -- Chief Executive Officer\n\nSo with Tesla in the act, we actually -- we do have hardware in the vehicles. And going forward, it may look different depending upon the EV automaker. In certain cases, we'll have modules. In certain cases, it may be leveraging the modem in the car.\n\nI think the preferred solution for us is 360L because we get the benefit of broad-based availability with satellite distribution and efficient economics certainly in the near to medium term. And then on the streaming side, we have all the benefits of interactive capabilities, personalization, and back channel on data. So that is our preferred solution, but we will be flexible just as we've shown, frankly, in terms of launching improved car plate and to come Android Auto experiences because we do want to make sure that we are wherever customers want to listen to us and however they want to listen to us. So yes, I think that there is room certainly on the EV side going forward to make sure that we can continue to increase penetration rates, and we'll be flexible with the technology we use there.\n\nStephen Laszczyk -- Goldman Sachs -- Analyst\n\nAnd the economics are similar, different in some aspects? Or how should we think about that?\n\nJennifer Witz -- Chief Executive Officer\n\nI think the economics -- the pieces of the economics, whether it's the trial lanes and payments or no payments revenue share, subsidies, things like that, obviously, will depend on the specific automaker. So I don't -- I'm not going to talk about the deal economics for sales. But to the extent that there is not hardware in the car, we wouldn't have subsidies, but we're looking to continue to provide incentives for the automakers to work with us to offer the best solution for subscribers or trialers so that they will subscribe and to work with us to make it easy for them to convert and become self-pay subscribers. So we believe in revenue share as a way to incentivize that.\n\nStephen Laszczyk -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nThank you. We will now take our next and final question from James Ratcliffe at Evercore ISI. Your line is open. Please go ahead.\n\nJames Ratcliffe -- Evercore ISI -- Analyst\n\nHi. Thanks for taking the question. Just looking at the -- on the Pandora side, RPM was flat year on year. Can you help us break that down in pricing or any changes in ad loads? And related to that, it looks like listening hours are down.\n\nWhere are these going? Are people just listening to less digital audio? Or where are they spending their hours? Thanks.\n\nSean Sullivan -- Chief Financial Officer\n\nYes. From an RPA perspective, James, I think for the quarter, we were slightly down from the prior year. I think the ad load has been largely consistent over the last few quarters. Listening hours are down.\n\nI would reiterate, hours per active listener has continued to increase. So we continue to have more and more listening from our most loyal customers. So in terms of the ability to capture new registered users, that's where the challenge has been. So RPM continues to be slightly under pressure from macro trends.\n\nWe talked about the advertising marketplace. So I don't know if, Jennifer, you want to comment where they're going specifically.\n\nJennifer Witz -- Chief Executive Officer\n\nThe -- most of the Pandora listeners are already listening to other audio services as well. Most actually consumers in the U.S. are listening to multiple audio services. But I do -- we do see dynamics where we're recapturing prior users coming back to the service for specific stations that they've set up previously.\n\nBut it's the same dynamic in terms of the user base is increasingly going to other services with more interactive capabilities. And generally, they have those capabilities in the free tiers that they offer. But it is a trend that has fluctuated a bit. We have seen some recent stemming of the losses, but the dynamic overall haven't changed materially.\n\nAnd just back to what Sean said about ad load and things like that, I do -- we can -- we do have a lot of great science on how to appropriately put advertisers in front of different listener cohorts. And I also believe that over time, many of our competitors are going to be increasing ad load, and that obviously benefits us from the standpoint of what we can do in our products as well.\n\nJames Ratcliffe -- Evercore ISI -- Analyst\n\nGreat. Thank you.\n\nHooper Stevens\n\nJames, thank you for participating in our call. And thanks, everybody, for joining today. We'll speak to you soon. Goodbye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHooper Stevens\n\nJennifer Witz -- Chief Executive Officer\n\nSean Sullivan -- Chief Financial Officer\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nJessica Ehrlich -- Bank of America Merrill Lynch -- Analyst\n\nBryan Kraft -- Deutsche Bank -- Analyst\n\nSteven Cahall -- Wells Fargo Securities -- Analyst\n\nStephen Laszczyk -- Goldman Sachs -- Analyst\n\nJames Ratcliffe -- Evercore ISI -- Analyst\n\nMore SIRI analysis\n\nAll earnings call transcripts"
}