{
  "companyName": "Camtek",
  "companyTicker": "CAMT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/17/camtek-camt-q3-2022-earnings-call-transcript/",
  "content": "Camtek (CAMT -0.18%)\nQ3 2022 Earnings Call\nNov 17, 2022, 9:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. Welcome to Camtek's third quarter 2022 results conference call. [Operator instructions] You should've all received by now the company's press release. If you have not received it, please contact Camtek's investor relations team at EK Global Investor Relations at 1-212-378-8040, or view it in the news section of the company's website at www.camtek.com.\n\nI'll now like to hand over the call to Mr. Ehud Helft of EK Global Investor Relations. Mr. Helft, would you like to begin, please?\n\nEhud Helft -- Investor Relations Contact Officer\n\nYes. Thank you, operator. I would like to welcome all of you to Camtek's third quarter 2022 results conference call. Let me remind you everyone that this conference call is being recorded, and the recording will be available on Camtek's website within a few hours of the call.\n\nWith me today on the call, we have Mr. Rafi Amit, Camtek's CEO; Mr. Moshe Eisenberg, Camtek's CFO; and Mr. Ramy Langer, Camtek's COO.\n\nRafi will open by providing an overview of Camtek's results and discuss recent market trends. Moshe will then summarize the financial results of the quarter. Following that, Rafi, Moshe, and Ramy will be available to take your questions. Before we begin, I would like to remind everyone that certain information provided on this call are internal company estimates, unless otherwise specified.\n\nThis call may also contain forward-looking statements, and I'll refer you to our safe harbor statement that you can read it in press release. Furthermore, during this call, certain non-GAAP financial measures will be discussed. These are used by management to make strategic decisions, forecast future results, and evaluate the company's current performance. We believe that the presentation of non-GAAP financial measures is useful to investors' understanding and assessment of the company's ongoing core operations and prospects for the future.\n\nA full reconciliation of non-GAAP to GAAP financial measures is included in today's earnings release. And now I'd like to hand over the call to Rafi Amit, Camtek's CEO. Rafi, go ahead please.\n\nRafi Amit -- Chief Executive Officer\n\nThanks, Edward. Good morning or good afternoon everyone. Camtek ended another quarter of continued revenue growth. Third quarter revenues were a record of $82 million, a 16% increase year over year.\n\nGross margin came in at 49%, and operating margin at 28.3%. Close to 60% of our revenues came from advanced interconnect packaging applications. Heterogeneous integration and HBM account for over 30% of this segment. We continue to expand our customer base.\n\nWe sold system to 42 new customers in the first nine months of this year. Specifically, we are cementing our position in the front end and compound semi segments. These two segments accounted for approximately a quarter of our revenues. As widely reported, consumer demand for PC and mobile is down.\n\nAs a result, the contribution of CMOS image sensors related system to this year's revenue will be slightly below 10%. This quarter, we continued to strengthen our position in the U.S. and Europe due to major industry investment made there. U.S.\n\nand Europe accounted for 27% of our sales versus 21% last quarter and 12% in Q3 of last year. Q4 revenues are expected to be similar to those of Q3 translating into record annual revenue of around $320 million for 2022. The company diversified exposure to multiple customers. Secular trends and territories contributed to our success.\n\nLast month, the U.S. Commerce Department announced new regulations restricting the sales and support of semiconductor equipment for advanced nodes in China in both memory and logic. Our customers in China are mainly OSATs in the advanced packaging segment or manufacturers of trading-edge silicon wafer. We continue to evaluate the impact of such restrictions on Camtek.\n\nBut based on our initial assessment, we believe that the direct revenue impact will be marginal, if any. The global economy is projected to decline in 2023 and expected to affect both wafer fab equipment in general and even more so in the memory segment. 2023 is expected to be a challenging year for the industry with customers being more cautious. We believe that although Camtek's business model is not immune, it is however more resilient.\n\nI will point few reasons. One, we support a technology change in the industry of transition to advanced packaging and heterogeneous integration. Sixty percent of our business is related to these segments. This strength is expected to continue [Technical difficulty]\n\nRamy Langer -- Chief Operating Officer\n\nRafi, we can't hear you. Operator, can you hear?\n\nOperator\n\nLadies and gentlemen, thank you for standing by. Mr. Ramy Langer, would you like to continue, please?\n\nRamy Langer -- Chief Operating Officer\n\nThank you. And I apologize. We have a technical issue, and I will continue on Rafi's behalf. And I will pick up where he stopped.\n\nAnd as we said, we believe that Camtek's business model is not immune. It is, however, more resilient. And let me give you the reasons for it. First, is we support a technology changing the industry of transition to advanced packaging and heterogeneous integration.\n\nSixty percent of our business is related to these segments. This trend is expected to continue in the next two years. Furthermore, the sales to the memory segment are limited to DRAM only, which historically accounted for less than 5% of our total business. This segment, we mainly support the transition of the high-bandwidth memory, which is growing.\n\nBased on orders we have on hand and in the pipeline, we expect increased sales in this space next year. Also, the increasing complexity of wafers being manufactured today means that manufacturers require ever more advanced inspection systems in their facilities. We believe that the field of inspection and the segments in which we operate will be less affected in the event of a slowdown. Moreover, Camtek has a wide and diversified customer base.\n\nThis quarter alone, we sold systems to more than 40 different customers and added eight new customers. Altogether, we have over 250 active customers. Despite the positive factors that I've outlined, we are progressing cautiously into the new year. We're carefully monitoring our balance sheet items, such as inventory levels and account receivable, as well as our headcount.\n\nHowever, we continue to invest in R&D and plan to introduce new products and capabilities next year, securing our long-term growth path. I would like to conclude by stating that semiconductor is a strategic industry, and all leading countries are heavily invested in it. We expect that in 2023, the semiconductor industry will likely decline. Camtek is also not immune, but we believe our leading position, wide customer base, and longer-term strategic relationship with customers will enable our business to be more resilient than the overall semiconductor industry.\n\nI would like to hand over to Moshe for a more detailed discussion of the financial results. Moshe?\n\nMoshe Eisenberg -- Chief Financial Officer\n\nThank you, Ramy. In my financial summary ahead, I will provide the results on a non-GAAP basis. The reconciliation between the GAAP results and the non-GAAP results appears in the tables at the end of the press release issued earlier today. Third quarter revenues came at the record $82 million, an increase of 16% compared with the third quarter of 2021.\n\nThe geographic revenue split for the quarter was as follows. Asia accounted for 73%, and U.S. and Europe for 27%. Gross profit for the quarter was $40.2 million.\n\nThe gross margin for the quarter was 49% versus 50.9% in the third quarter of last year. Indeed, it is below the typical range of our gross margin model. And this quarter, it was mainly driven by a less favorable product mix resulting from a few large orders. And it does not represent a meaningful trend.\n\nWe expect some improvement in our gross margin in the fourth quarter. Operating expenses in the quarter were $17 million, an increase of $2.7 million compared to the third quarter of last year and $300,000 compared to the previous quarter. The increase from last year is mostly due to the increase in R&D expenses and sales-related activities to support increased revenue. Operating profit in the quarter was $23.2 million compared to the $21.7 million reported in the third quarter of last year and $23.2 million in the previous quarter.\n\nOperating margin was 28.3% compared to 30.6% last year and 29.9% in the previous quarter. Net income for the third quarter of 2022 was $23.3 million, or $0.48 per diluted share. This is compared to a net income of $20 million, or $0.45 per share, in the third quarter of last year. Total diluted number of shares as of the end of the third quarter was 48.3 million.\n\nTurning to some high-level balance sheet and cash flow metrics. Cash and cash equivalents, including short- and long-term deposit as of September 30, 2022, were $460.3 million. This compared with $438 million at the end of the second quarter. We generated $25.3 million in cash from operations in the quarter.\n\nInventory level remains flat compared to the end of the previous quarter. In the last few quarters, we increased the inventory to overcome potential supply chain issues. With the stabilization trends of the supply chain, we plan to reduce the inventory level. Accounts receivables went down by $9.7 million as we had good and strong collection in the quarter.\n\nThis represents approximately 71 days outstanding. I would like to note that the company management is closely monitoring the different scenarios of market demand and customer investment plans for 2023 and is ready to respond accordingly. Regarding guidance, as Rafi mentioned before, we expect fourth quarter revenues to be around the same level as with the third quarter. And with that, Rafi, Ramy, and I will be open to take your questions.\n\nHelft?\n\nEhud Helft -- Investor Relations Contact Officer\n\nOperator?\n\nMoshe Eisenberg -- Chief Financial Officer\n\nRafi, are you with us?\n\nRafi Amit -- Chief Executive Officer\n\nYeah. I was -- I continued with the script all the way.\n\nMoshe Eisenberg -- Chief Financial Officer\n\nOK. Operator?\n\nOperator\n\n[Operator instructions] The first question is from Brian Chin of Stifel. Please go ahead.\n\nBrian Chin -- Stifel Financial Corp. -- Analyst\n\nHi there. Good afternoon, and thanks for letting us ask a few questions. Maybe, kind of Rafi, first following the recent U.S. export restrictions into China, I'm just curious, what is your sense on the new investments or how the new investments in fab and advanced packaging capacity might be directed and prioritized moving forward? And also, how big of a benefit do you see this for Camtek next year based on increased activity in China in areas like advanced packaging or specialty power, etc.?\n\nRafi Amit -- Chief Executive Officer\n\nYeah. So, The situation in China, I think, remember just four weeks ago, the Commerce Department made all these restriction and the announcement, and I think it's too early to evaluate the effect on the semiconductor industry in China. But at this point, you know, when we discuss with customer in China, it looks like business as usual, and utilization is OK, and the PO -- everything look like normal. So, I believe it's still too early to understand if this restriction -- if it will affect the whole industry or specific area.\n\nWe don't know yet. But as I said, for at this point, it looked like business as usual.\n\nBrian Chin -- Stifel Financial Corp. -- Analyst\n\nOK. And kind of moving beyond the geopolitical, but is it fair to characterize the environment you're seeing and sort of your order book and the backlog and those patterns? Is it fair to characterize your advanced packaging customers and maybe even more broadly as being in a digestion mode? And based on your order book, can you provide any sense on the revenue trajectory in the Q1 or first half next year?\n\nRafi Amit -- Chief Executive Officer\n\nLook, first of all, as we mentioned, you know, most of our customer are not in the high notes. And we are mainly support, the OSAT. So, they're not in this -- under this restriction. Second, about the backlog and pipeline, I would say that if we just look, you know, a year ago, definitely all the supply chain interruption caused many customer to place order ahead of time to secure delivery.\n\nNow, when, you know, delivery back to normal and people feel more comfortable and even some think about even probability of slowdown, definitely a customer not so hurry to place order. So, we can see, you know, that the amount of pipeline is much bigger than backlog. So, we discuss this customer. We see leads, but we can't see today a forecast as we saw a year ago because the customer looking, you know, they place order when they really need it.\n\nAnd they don't feel they need to secure, you know, delivery few quarter ahead. So, as I said, if we talk together, the backlog and the pipeline, it's, look, I would say pretty normal. But I would say to see when the pipeline will be converted to backlog, this can take time. And probably as before, we will know more before we start the new quarter, we get a better picture.\n\nBrian Chin -- Stifel Financial Corp. -- Analyst\n\nOK. Got it. Yeah, I mean, I've -- this might have be based on a huge sample size, but I've noticed or observed sometimes Q1, kind of maybe it's seasonal, tends to be sequentially up in terms of revenue. But maybe, listening to what you're saying, Rafi, maybe it's -- you could take a step down a little bit, given, sort of, you don't have as much backlog -- defined backlog moving into next year.\n\nRafi Amit -- Chief Executive Officer\n\nRamy, [Inaudible] or --\n\nRamy Langer -- Chief Operating Officer\n\nLet me try and be a little bit -- you know, definitely our visibility at this stage, looking into 2023, is limited. Now, the backlog is healthy, and we have a very strong pipeline. And I think, as Rafi said, it is too early to assess how quickly this pipeline will turn into orders. And this is a little bit different than where we were, let's say, a year ago.\n\nBut definitely, at this stage, it's too early. We'll need to wait for another few weeks until we'll be able to really give a better assessment on the first half of '23.\n\nBrian Chin -- Stifel Financial Corp. -- Analyst\n\nOK. Fair enough. I'll hop out to move the line along. Thanks a lot.\n\nBye.\n\nOperator\n\nThe next question is from Tom O'Malley of Barclays. Please go ahead.\n\nTom O'Malley -- Barclays -- Analyst\n\nHey. Thanks for taking my question, guys. I just had a question on the December quarter. So, clearly, visibility isn't as strong as it was before, but you guys are guiding to flat business.\n\nCould you just talk about how much of the December quarter is actually booked today already? And how much is influx as the quarter goes along?\n\nRafi Amit -- Chief Executive Officer\n\nNow, the current quarter is fully booked, and it really now is a question of executing the shipment. And that's it. We don't expect any surprises this quarter.\n\nTom O'Malley -- Barclays -- Analyst\n\nOK. And then if I look at the mix of business, clearly CMOS image sensing is a little weaker. I think you said in the prepared remarks that that's coming in below 10%. It's already kind of tracking well below that, so that makes sense.\n\nBut in the quarter for September, you saw a pretty big decline in what you've called the other or general business. What contributed to that decline sequentially? And will that go down again in December?\n\nMoshe Eisenberg -- Chief Financial Officer\n\nThe decline. You know, Tom, I'm not sure about which decline. I mean, we are seeing -- and I think we said it in the prepared remarks, our business for the advanced packaging is around 60%. It has been in the last few quarters, and it's a very similar rate.\n\nThe front-end and the compound semi is about 25%. So, overall, I would say that 85% of the business is very, very stable. Now, the rest, CMOS image sensor historically was above 10%. This year, it will be a little bit less.\n\nAnd this will be compensated by what we call general 2D inspection applications, things like MEMS and other applications, which are smaller in the volume. But from the business point of view, there aren't any differences or declines. The only change, I would say, is the CMOS image sensors, and this is strongly related to mobile phone sales.\n\nTom O'Malley -- Barclays -- Analyst\n\nGot it. Got it. And then just one more on the coverage. So, totally understandable that you're seeing limited visibility.\n\nI think, broadly, markets are just getting weaker in general. And you're kind of talking about a semiconductor market that's down next year. Have you thought about what your business can grow in a scenario where wafer fab equipment's down 20%-plus? You know, I'm just trying to understand. You guys have clearly outgrown the market for the past several years.\n\nIn a market that's down, say 10% or 20%, how much growth do you think you see off of a market that's a little weaker next year? Thank you.\n\nRamy Langer -- Chief Operating Officer\n\nYes, so Tom, I think it is much too early to say today what will be with our current visibility to really say, to give a good indication of the 2023 business, what we believe that we'll do better than industry. And at this stage, how much better than the industry? It is really too early to say. And I believe that within a quarter or so, we'll be in a much better position to give more accurate statements.\n\nTom O'Malley -- Barclays -- Analyst\n\nThank you.\n\nRamy Langer -- Chief Operating Officer\n\nThank you.\n\nOperator\n\nThe next question is from Charles Shi of Needham and Company. Please go ahead.\n\nCharles Shi -- Needham and Company -- Analyst\n\nHi. Thank you for taking my question. I have, first, a little bit longer-term question not specific to 2023. I think one underappreciated part of your business is that you have a very broad customer base, 250 active.\n\nI mean, assuming each one of them just by one, two systems, that's enough to support you to $300 million annual run rate. And I think customer is either in a greenfield customers or, you know, competitive displacement. However, I do want to ask you this question. From this point and forward, how much of the incremental additions of new customers do you think is going to be? Could there be a slowdown of the number of customer you can add going forward from here? And specifically, I want to ask you about the wafer manufacturers.\n\nI don't recall you talk about that particular set of customers. And is that some competitive displacement there? Thank you.\n\nRamy Langer -- Chief Operating Officer\n\nHey, it's -- I didn't think about it before. But, you know, first of all, I believe it'll continue to add new customers. And the broad addition of customers is in general. It's not related to one specific territory.\n\nI think as we grow the business, we're getting into new segments. And therefore, yes, we'll continue to add the customers. Whether it will be in the range of this year that we've already added 42 customers, I'm not sure. Whether it will be, or it will be in a different magnitude.\n\nBut definitely, if we look also historically into previous years, we've been adding a significant number of customers every year. Now, specifically wafer manufacturers, yes, we are adding new wafer manufacturers to our portfolio. And we'll continue to add. And when I look at the target market for 2023, I believe that we'll have new customers in this segment as well.\n\nDid I answer your question?\n\nCharles Shi -- Needham and Company -- Analyst\n\nYes. So, the other question I have is, well, first off, we appreciate you, from time to time, provide press releases about the latest orders you received from your customers. But your last update was in early September. So, between September to now, over the last two months, how do you see the ordering rate going? And I may have another follow-up after this.\n\nThank you.\n\nRamy Langer -- Chief Operating Officer\n\nSo, I think what you mentioned it in the previous remark that you talked about, yes, we've been adding orders. I think, currently, we see customers waiting to make sure that they're getting the business before they'll turn the pipeline into POs. But when we look to the, at our backlog and add the pipeline, the business is healthy. They're -- really, the big question, and this is why we are a -- we have a limited visibility, is the rate of the customers turning potential POs from the pipeline into real POs.\n\nThey are taking more time, and they will -- the lead times are shorter. And so I think we'll have a better assessment, and we'll be able to give better numbers and more accurate numbers within a couple of months.\n\nRafi Amit -- Chief Executive Officer\n\nYeah. I would like to add one more comment. Usually when we make announcement of order, it should be, over what we call multiple system orders. We don't, you know, make announcement for one or two system per customer.\n\nThat's the big difference. And, if we look on our portfolio, it's definitely contained a lot of what we call one and two unit per customer. So, definitely we don't make any announcement of each order of it.\n\nCharles Shi -- Needham and Company -- Analyst\n\nGot it. Got it. So, maybe my last follow-up is in your backlog. What's the -- based on your backlog, what's your visibility into first half '23? Can you see something shipments scheduled out? What's the latest? Is it the second quarter '23? Or is it still first quarter '23? Thank you.\n\nRamy Langer -- Chief Operating Officer\n\nWell, looking into the backlog, we have backlog today, that is already including, machine shipments in the first and the second quarter. However, we still need -- in order to complete shipments for both quarters, we will need to convert some of the pipeline into POs. And that's exactly what we're doing today.\n\nCharles Shi -- Needham and Company -- Analyst\n\nThank you.\n\nOperator\n\nThe next question is from Craig Ellis of B. Riley Securities. Please go ahead.\n\nCraig Ellis -- B. Riley Securities -- Analyst\n\nHey, team. Thanks for taking the question and congratulations on the execution in the third quarter. A lot of discussion around backlog and orders and visibility into calendar '23. So, I wanted to pivot to gross margin.\n\nMoshe, you talked about some large customer dynamics that impacted gross margin in the quarter. Can you just identify if there were any other factors that impacted gross margin? And what should be expected with gross margin, beyond the calendar fourth quarter? Would they get back to that 51% level? Or are there input cost or other large customer items that would have them maybe sub-50 or right around 50%?\n\nMoshe Eisenberg -- Chief Financial Officer\n\nSo, the main impact of the relatively lower gross margin for the third quarter was indeed a few large orders that we have delivered in the quarter. And we will continue -- we will complete a delivery of them over the course of the fourth quarter. So, you will see some improvement in the fourth quarter but not to the full extent. We should go above the 50% mark, you know, next year.\n\nI'm not sure to the full 52%, the upper limit. But we should be able to go back to above the 50% level.\n\nCraig Ellis -- B. Riley Securities -- Analyst\n\nGot it. That's helpful. And then, the second question just related to operating expense. And I acknowledge we're dealing with an unusually uncertain environment.\n\nBut the question is this, if order trends and other dynamics meant that we weren't seeing the backlog conversion to firm orders, as you look at operating expense, do you feel like you have any flexibility to reduce operating expense tactically? Or given the significant increase in customer engagements, do you really have pressure on R&D to scale that up so that you can do the work that you need to do to serve all these new customers?\n\nMoshe Eisenberg -- Chief Financial Officer\n\nSo, you know, the two key elements in our operating expense structure is the R&D and sales and marketing. G&A stays pretty much flat. We believe that our business model is pretty, you know, agile, you know, so we can change, you know, some of the old expense mix between, direct and indirect. On the R&D front, I think Ramy -- Rafi mentioned in his prepared remarks that we want to continue to invest.\n\nWe have plans to introduce new products and new capabilities. So, this is definitely an area that we don't want to affect. But within the certain marketing, there are certain activities that can be changed based on activity level.\n\nCraig Ellis -- B. Riley Securities -- Analyst\n\nYes, that makes sense. And then, for my final question, a real strong, cash performance in the quarter. Here we are with $460 million in cash and equivalent. Rafi, can you just give us an update on how you're thinking about M&A? I know you've talked about it in the past, and one of the things that precluded significant progress was that we had a COVID environment that really made it hard to get out and meet potential targets in person.\n\nBut what should investor expectations be as we exit '22 and look into '23 on potential there? Thank you.\n\nRafi Amit -- Chief Executive Officer\n\nYeah, regarding, you know, M&A, definitely, we invest a lot of efforts. And the fact that I'm not, you know, participated the meeting in Israel because it also -- I'm investing on this issue. So, we really believe that we can do something in the next few months, definitely. But, you know, it's a long process even if you find something, you want to make today especially good to check everything, to be sure that this is the right merge, and not to do -- to make any mistake.\n\nSo, we do it cautiously. But, definitely, we invest a lot of effort to execute, I would say, in the next six months something.\n\nCraig Ellis -- B. Riley Securities -- Analyst\n\nAnd can you talk a little bit about what your priorities are, whether it's increased geographic and market exposure, or particular technology capabilities that might --\n\nRafi Amit -- Chief Executive Officer\n\nYou're talking about M&A priority, M&A --\n\nCraig Ellis -- B. Riley Securities -- Analyst\n\nYup. Yup.\n\nRafi Amit -- Chief Executive Officer\n\nOK. I would say that since we take a major market share, we are not looking for a company similar to Camtek or doing something like Camtek. This is not so -- I don't think it brings any advantage for us. We focus more on some -- you know, in one hand, it should be in the same market segment.\n\nBut on the other end, different technology or different product line. And then we can still use our, you know, infrastructure of sales and marketing and support, and enjoy this infrastructure to promote another product line. And this is the roughly the way -- this is the priority that we are giving. And there are some area, you know, there are metrology, there are some process.\n\nThe other thing that's still, you know, targeting the same segment as we focus, and we really believe that we can bring some results very soon.\n\nCraig Ellis -- B. Riley Securities -- Analyst\n\nThat makes sense. Not so much scaler, but really technology extension, product line extension. Thanks, guys.\n\nRamy Langer -- Chief Operating Officer\n\nThank you.\n\nOperator\n\nThe next question is from Gus Richard of Northland. Please go ahead.\n\nGus Richard -- Northland Securities -- Analyst\n\nYes, thanks for taking my question. Just on the frontend side, you mentioned you've got pretty good demand from -- excuse me, compound semis. And I was just wondering if that's silicon carbide, gallium arsenide, you know, indium phosphide, you know, gallium nitride. Which compound semiconductors is driving in that part of your business?\n\nRamy Langer -- Chief Operating Officer\n\nI think today, what's dominant in the business in the last, I would say, couple of quarters is definitely the silicon carbide portion.\n\nGus Richard -- Northland Securities -- Analyst\n\nAnd how much of your front-end business is compounded?\n\nRamy Langer -- Chief Operating Officer\n\nNow, I would say, you know, it differs from quarter to quarter. It is roughly, I would say, close to 10%. But, you know, it's one quarter more, one quarter less. Roughly 10% of the business.\n\nGus Richard -- Northland Securities -- Analyst\n\nGot it. That's very helpful. And then, just one last attempt on visibility. You know, 90 days ago, you were slotting out, I think, into Q1.\n\nToday, if somebody came in and wanted a tool as soon as possible, when could you accommodate that customer?\n\nRamy Langer -- Chief Operating Officer\n\nYou know, this is a difficult question, Gus, because it really depends on the kind of tool that he wants. So, certain tools we'll be able to give him in less than two quarters. How much less? It depends. But I would say, it is the -- the soonest we can give is roughly four to six months.\n\nThis is the soonest we can give somebody a tool.\n\nGus Richard -- Northland Securities -- Analyst\n\nGot it. And what does that -- you know, in normal times, if we ever get back to that, what would that lead time be?\n\nRamy Langer -- Chief Operating Officer\n\nThat's the lead time. I mean, you are talking about 16 to 20 months -- 20 weeks. And if you go back, let's say, six months or a year ago, I think those lead times extended up to two quarters. So, definitely, lead times are shorter today by roughly -- I would say they have shortened by roughly, if you want to get a number, anywhere between -- around a month and a half to two months.\n\nAnd that's exactly the difficulty that we have been describing now because having said that, people understand that we can provide machines at around four months and, therefore, they are less quick to secure the slots. They understand that there are slots in our manufacturing, and, therefore, this limits our visibility to the first half of next year.\n\nGus Richard -- Northland Securities -- Analyst\n\nGot it. Got it. Super helpful. And do you have any supply constraints at this point? Or have the supply chain issues been alleviated?\n\nRamy Langer -- Chief Operating Officer\n\nI believe they have been alleviated. There are some issues here and there. There is a missing component here and there. But we are able to get the material that we need.\n\nI don't think that supply chain issues today will create any shortages, or lack of -- or the ability to ship any machine. So, I think this is not the main issue today that we have. Overall, we can get the parts. I think the supply chain, in general, is getting to, I would say, more reasonable situation.\n\nGus Richard -- Northland Securities -- Analyst\n\nOK. And then, the last one for me, today, you know, roughly what is your quarterly revenue capacity?\n\nRamy Langer -- Chief Operating Officer\n\nNo, I think that we're not -- I think we discussed this in previous calls. We have made a significant investment in a clean room capacity. And today, the capacity is -- it's not a limitation anymore. We've increased our capacity by about 50% [Inaudible] today able from our facility to ship about $0.5 billion of revenues or in machines.\n\nSo, this is not a limitation anymore.\n\nGus Richard -- Northland Securities -- Analyst\n\nOK, great. Thank you so much for taking my questions.\n\nRamy Langer -- Chief Operating Officer\n\nThank you, Gus.\n\nOperator\n\n[Operator instructions] There are no further questions at this time. Before I ask Mr. Amit to go ahead with his closing statement, I would like to remind participants that a replay of this call will be available on Camtek's website, www.camtek.co.il, beginning tomorrow. Mr.\n\nAmit, would you like to make your concluding statement?\n\nRafi Amit -- Chief Executive Officer\n\nYep. I would like to thank to thank you all for your continued interest in our business. Again, I would like to thank all of our employees and my management team for their tremendous performance, and we look forward to continue it. To our investor, I thank your long-term support.\n\nI look forward to talking with you again next quarter. Thank you and goodbye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEhud Helft -- Investor Relations Contact Officer\n\nRafi Amit -- Chief Executive Officer\n\nRamy Langer -- Chief Operating Officer\n\nMoshe Eisenberg -- Chief Financial Officer\n\nBrian Chin -- Stifel Financial Corp. -- Analyst\n\nTom O'Malley -- Barclays -- Analyst\n\nCharles Shi -- Needham and Company -- Analyst\n\nCraig Ellis -- B. Riley Securities -- Analyst\n\nGus Richard -- Northland Securities -- Analyst\n\nMore CAMT analysis\n\nAll earnings call transcripts"
}