{
  "companyName": "Snowflake Inc.",
  "companyTicker": "SNOW",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/24/snowflake-inc-snow-q2-2023-earnings-call-transcrip/",
  "content": "Snowflake Inc. (SNOW 0.81%)\nQ2 2023 Earnings Call\nAug 24, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. Thank you for attending today's Q2 FY '23 Snowflake earnings conference call. My name is Hannah, and I will be your moderator for today's call. All lines have been muted during the presentation portion of the call with an opportunity for questions and answers at the end.\n\n[Operator instructions] I would now like to pass the conference over to our host, Jimmy Sexton, head of investor relations. Please go ahead.\n\nJimmy Sexton -- Head of Investor Relations\n\nGood afternoon, and thank you for joining us on Snowflake's Q2 fiscal 2023 earnings call. With me in Bozeman, Montana are Frank Slootman, our chairman and chief executive officer; Mike Scarpelli, our chief financial officer; and Christian Kleinerman, our senior vice president of products, who will join us for the Q&A session. During today's call, we will review our financial results for the second quarter fiscal 2023 and discuss our guidance for the third quarter and full year fiscal 2023. During today's call, we will make forward-looking statements, including statements related to the expected performance of our business, future financial results, strategy, products and features, long-term growth, and overall future prospects.\n\nThese statements are subject to risks and uncertainties, which could cause them to differ materially from actual results. Information concerning those risks is available in our earnings press release distributed after market close today and in our SEC filings, including our most recently filed Form 10-Q for the first quarter ended April 30, 2022, and the Form 10-Q for the quarter ended July 31, 2022, that we will file with the SEC. We caution you to not place undue reliance on forward-looking statements and undertake no duty or obligation to update any forward-looking statements as a result of new information, future events or changes in our expectations. We'd also like to point out that on today's call, we will report both GAAP and non-GAAP results.\n\nWe use these non-GAAP financial measures internally for financial and operational decision-making purposes and as a means to evaluate period-to-period comparisons. Non-GAAP financial measures are presented in addition to and not as a substitute for financial measures calculated in accordance with GAAP. To see the reconciliations of these non-GAAP financial measures, please refer to our earnings press release distributed earlier today and our investor presentation, which are posted at investors.snowflake.com. A replay of today's call will also be posted on the website.\n\nWith that, I would now like to turn the call over to Frank.\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nThanks, Jimmy, and good afternoon, everybody. Product revenue grew 83% year on year to $466 million. Remaining performance obligations grew 78% year on year to $2.7 billion. And in the quarter, we added 12 Global 2000 customers.\n\nOur net revenue retention rate exceeded 170%, and Snowflake leads the industry with a Net Promoter Score of 72. Snowflake is delivering high growth and operating leverage. Non-GAAP product gross margin exceeded 75%, and we continue to generate non-GAAP operating income and free cash flow. Our success is fueled by broad-based workload enablement.\n\nThe core idea behind the Snowflake Data Cloud is to enable work to come to the data and prevent data from having to be moved to the work. Previously, data was copied, transferred, and replicated to be used wherever it was processed. That led to massive operational complexity, cost, and governance risks. The Snowflake Data Cloud promises to bring that regrettable legacy to an end.\n\nStarting in 2014, Snowflake's cloud-native architecture removed the scale, performance, and economic bottlenecks that held back data analytics at scale for generations. The impact was immediate and led to a major expansion of workloads and use cases. Initially, organizations use Snowflake to drastically improve overnight analytical processes so that fresh up-to-date data about the business was reliably available first thing. Checking that box, customers move on to using data for predictive insights and prescriptive solutions.\n\nThis is what has driven Snowflake's massive platform expansion in terms of workload types, user types, and data types. Snowflake's data sharing solves the challenge of data access and enrichment. In Q2, the number of Snowflake data sharing relationships measured with what we call stable edges grew 112% year on year. 21% of our growing customer base has at least one stable edge, up from 15% a year ago.\n\nAmong customers over $1 million in product revenue, 65% have at least one stable edge. Across sectors, we are meeting customers with solutions pertinent to their vertical industries. For example, supply chain management relies on Snowflake's combination of execution and access. We hear how supply chain management is failing at many levels because of dislocations such as the pandemic and spiking inflation.\n\nThis is, in large part, a data problem. The data originates in different places, which is why it has such a challenging time coming together. And the world is stable and changing marginally day to day. This has been somewhat tolerable.\n\nNow with massive disruption, the status quo must change. Our next frontier of innovation is aimed at reinventing cloud application development. Our ambition is far reaching. Our aim is to transform how cloud applications are built, deployed, sold, and transacted.\n\nTo help achieve this, we launched our Powered by Snowflake program. Today, we have 590 Powered by Snowflake registrants, representing 35% quarter-over-quarter growth. We announced a number of significant product innovations at our Summit users' conference in June, which saw an approximate fivefold increase in attendance from 2019. These announcements are foundational for that vision.\n\nUnistore allows developers to bridge transactional and analytical workloads in a single data set to save users time and effort associated with moving and transforming data across systems. Snowpark for Python is now in public preview. This capability brings more optionality to a technical audience of application developers, data engineers, and data scientists. Our integration with the recently acquired Streamlit is tracking well against plan.\n\nStreamlit bridges the gap between data scientists and business users, accelerating time to insight by enabling developers to build applications using their favorite tools. Finally, we announced support for Apache Iceberg table formats in private preview. Iceberg is the emerging standard for data lake architectures. With this offering, we bring the performance and governance benefits of Snowflake to externally stored data.\n\nWe are pleased to announce our intent to acquire Applica. Applica mobilizes unstructured data for advanced analytics and machine learning. Applica's team and best-in-class technology will create opportunities for customers and partners to get more value from all data types. We believe our strategy and underlying market trends position us for success.\n\nWe look forward to executing against this growing opportunity. And with that, I will turn the call over to Mike.\n\nMike Scarpelli -- Chief Financial Officer\n\nThank you, Frank. Q2 product revenues were $466 million, representing 83% year-over-year growth, and remaining performance obligations grew 78% year over year, totaling $2.7 billion. Of the $2.7 billion in RPO, we expect approximately 57% to be recognized as revenue in the next 12 months. This represents a 79% increase compared to our estimate as of the same quarter last year.\n\nOur net revenue retention rate of 171% includes 15 new customers with $1 million in trailing 12-month product revenue and reflects durable growth among our largest customers. We continue to pursue a vertical sales strategy. Our core verticals are financial services, advertising, media and entertainment, retail and CPG, technology, and healthcare and life sciences. While all verticals are growing rapidly, financial services drove the most product revenue growth sequentially.\n\nAdvertising, media and entertainment, and technology verticals grew in line with the overall company. Driving this growth is our continual move upmarket. In the quarter, we added 12 new Global 2000 customers. Our average trailing 12-month product revenue from these customers grew 14% quarter over quarter to $1.2 million.\n\nWe believe these accounts will grow to become our largest customers. A Global 2000 technology company is now a top 10 product revenue customer less than two years after signing their initial deal. Last quarter, we called out customers that were negatively impacted by headwinds specific to their businesses. The Q2 results from these customers were mixed.\n\nSome saw the weakness we expected while others outperformed. We are monitoring our key business metrics, which we believe are leading indicators of the macro economy impacting our business. We are not seeing these metrics soften across the customer base. For example, our corporate sales team that addresses small and medium-sized businesses outperformed their net new bookings goal for the quarter.\n\nOur EMEA sales team contributed four of our top 10 new customer wins in the quarter. And as mentioned earlier, the largest organizations in the world continue to increase their use of Snowflake. These indicate that companies globally are prioritizing Snowflake right now. Foreign currency exposure has been a relevant topic recently.\n\nHowever, less than 5% of our revenue is invoiced in currencies other than the U.S. dollar. So at the moment, we do not evaluate our business on a constant-currency basis given the immateriality. Now turning to margins on a non-GAAP basis.\n\nOur product gross margin was 75%. Scale in our public cloud data centers and enterprise customer success contribute to the year-over-year gross margin improvement. Operating margin was 4%, benefiting from revenue outperformance. Our adjusted free cash flow margin was 12%, positively impacted by strong collections.\n\nWe collected a $33 million invoice in Q2 from a customer who had paid its invoices in Q3 in prior years. We ended the quarter in a strong cash position with approximately $5 billion in cash, cash equivalents, and short-term and long-term investments. Now let's turn to our guidance. For the third quarter, we expect product revenue between $500 million and $505 million, representing year-over-year growth between 60% and 62%.\n\nI would like to remind everyone that in Q3 last year, we saw unusual seasonality due to reaccelerated product revenue growth. Turning to margins. We expect, on a non-GAAP basis, 2% operating margin. And we expect 358 million diluted weighted average shares outstanding.\n\nIn Q3, we expect $4 million of expenses associated with our Data Cloud World Tour. The 21 events will take place around the world and showcase our latest innovations. For the full year of fiscal 2023, we expect product revenues between $1.905 billion and $1.915 billion, representing year-over-year growth between 67% and 68%. Turning to profitability for the full year fiscal 2023.\n\nWe expect, on a non-GAAP basis, approximately 75% product gross margin, 2% operating margin, and 17% adjusted free cash flow margin. And we expect 358 million diluted weighted average shares outstanding. The full year outlook includes operating expenses related to the acquisition of Applica. We are adding headcount to support our growth initiatives.\n\nYear to date, we have added almost 1,000 net new employees. We view the current hiring market as favorable for Snowflake and have not altered our hiring plans for the year. Our long-term opportunity is stronger than it has ever been, and we look forward to executing. With that, operator, you can now open up the line for questions.\n\nOperator\n\nCertainly. [Operator instructions] We kindly ask that participants limit themselves to one question today. [Operator instructions] The first question is from the line of Mark Murphy with J.P. Morgan.\n\nPlease proceed.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nYes, thank you very much. I'm looking at the sequential growth in the product revenue, which is very strong. It's almost twice as strong as it was in Q1. So I'm curious, first, if you think analytics and data-intensive projects might be an insulated area of activity during an economic slowdown.\n\nAnd just relatedly, are you seeing many customers consume at higher levels to try to analyze the changing macro, maybe looking at FX sensitivity or interest rate sensitivity, etc.?\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nHey, Mark, this is Frank. In general, I would say that Snowflake gets prioritized fairly high inside the enterprise. And the reason is we're sitting right on the intersection of cloud computing, artificial intelligence, machine learning, advanced analytics. Customers are -- they picked up the scent of the opportunity that is in front of them.\n\nAnd they're investing. They're hiring. They're buying because these are things that are going to be big changes for the industry. The whole industries are going to get redefined in healthcare, in pharma, and financial services.\n\nSo this is not a business-as-usual let's try to hit the brakes. There is a very, very high urgency around advancing toward cloud computing environments and then having an opportunity to really pursue the promise that it brings. We're looking at very, very exciting times where things are becoming possible that we couldn't even dream of just a few short years ago. So this is why we feel that this is not one of those expenses that people are going to casually cut back on because it's strategically compelling and important.\n\nMike Scarpelli -- Chief Financial Officer\n\nYeah. I'll also add, Mark, just to remind, this is a consumption model, not a SaaS model. So even if we sign up a customer, it takes some months before they go into production. As I mentioned, there was a Global 2000 technology company we signed in the last two years.\n\nIt's now one of our top 10 customers. That customer didn't start really ramping until the end of last year, and they're going to continue to ramp. And there's many more that started ramping this quarter that we would have signed last quarter. So you can't just do a quarter over quarter.\n\nAnd because it is a consumption model, we do see patterns. Some customers do go down consumption based upon specific projects. But by and large, most of our customers are still ramping, moving workloads to us. And we think that is going to continue on average with our customers.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nWonderful. Thank you very much.\n\nOperator\n\nThank you. The next question is from the line of Keith Weiss with Morgan Stanley. Please proceed.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nThank you for taking the questions. This Sanjit Singh for Keith. Very impressive Q2. Mike, I want to talk to -- I wanted to ask you a little bit about the Q3 guide.\n\nFrom a seasonal perspective, the high end sort of implies 8% growth. And understanding that last year was an abnormally strong seasonal quarter, if I look back historically, the guidance does seem more conservative than usual. I wonder if you could provide any context in terms of what you're assuming going into Q3, just conservatism or extrapolating any sort oftrends that you may have seen in July.\n\nMike Scarpelli -- Chief Financial Officer\n\nNothing has changed in our guidance philosophy since the time we went public. And what I would say is Q3 of last year was unusually high. So it's not a good year-over-year comparison. And as I said, there is uncertainties in the macro environment right now, and I think the guidance is prudent that we put out.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nUnderstood. Thanks so much.\n\nOperator\n\nThank you. The next question is from the line of Simon Leopold with Raymond James. Please proceed.\n\nSimon Leopold -- Raymond James -- Analyst\n\nThanks for taking the question. I wanted to see what your take is on your suppliers of public cloud capacity and whether or not you're seeing any changing in how they work with you and your pricing. And really, what is the criteria to pick one over another, AWS versus Google versus Azure? Thank you.\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nThis is Frank. I think that most enterprises typically decide first on their public cloud platform strategy. And oftentimes, it's a multicloud posture. And over time, that can also change.\n\nAnd then they sort of decide on, OK, where is Snowflake going to run? And that can also change over time. We've seen customers also deploy Snowflake on one cloud. So that's sort of how it works. And obviously, our pricing does vary.\n\nI mean Snowflake is more expensive on one cloud than another. And obviously, the most aggressive pricing we have is on our top cloud providers where we have these concentration of deployment. So obviously, it matters to our customers. It all translates to dollars and cents.\n\nBut the reality is Snowflake is Snowflake. There's really no change in the experience depending on what cloud you're running on. So you would think that it is strictly an economic trade-off, but it's usually predicated by why they picked one public cloud platform over another.\n\nMike Scarpelli -- Chief Financial Officer\n\nWith that said, the majority of our customers, 80-plus percent run in AWS, and about 18% is Azure and 2% is GCP.\n\nSimon Leopold -- Raymond James -- Analyst\n\nThank you very much for that detail.\n\nOperator\n\nThank you. The next question is from the line of Alex Zukin with Wolfe Research. Please proceed.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nHey, guys. Thanks for taking the question. I guess maybe just a high-level mix with a tactical financial question. If I look at the environment, right, a lot of investors, a lot of customers are wondering about optimizations.\n\nAnd I think on the call, Mike, in your script, you mentioned that you actually have changed -- you've increased the prediction of how much will be consumed in reference to your cRPO metric over the next 12 months. So it feels like there's some -- there's kind of a mass differential in terms of expectations versus what you're seeing and delivering. And I just wanted to better understand what's driving that increased conviction around consumption. Have you seen a meaningful wave of optimizations that have rebased and now you're kind of off to the races in those workloads? Do you not anticipate that occurring? And I guess how is that -- what were the dynamics that made you change those assumptions that you saw in the quarter?\n\nMike Scarpelli -- Chief Financial Officer\n\nWell, we didn't change any assumptions in the quarter. It's the same that we've had for quite some time. Optimizations are not something that's new. We just started talking about them and showing the impact about them.\n\nWe have always done optimizations. We will continue to do optimizations. They're good for our customers because when they see if we can help make them use Snowflake more efficiently, we become cheaper, they move more workloads to us. And I showed you guys at our Financial Analyst Day real data with two customers around that.\n\nWith regards to the cRPO, that 57% of the total RPO, that is more of a function that we have a lot of our contracts that are starting to get burned down that were multiyear that we do expect in Q4 there will be a number of renewals of those contracts. So I do think the current cRPO as a percent of the total in Q4 will come down more in line with that into the low 50s where it historically has been. But that's really a function of -- think of our largest customer. They signed a three-year contract.\n\nAnd I think it was September of 2020 that they're going to burn through that contract in advance, and there will be a big renewal with them. Whether they do it one year or multiyear, that's up to them. That will happen in our Q4. And then you'll see that as well.\n\nWe have a number of customers like that. One of the things that we're seeing more and more is customers because they're consuming faster than their annual amount in their actual contract term, they're doing what we're calling co-term or they're bridging to their annual renewal. And a lot of those annual renewals are really moving toward Q4 for us.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nGot it. That's why the billings -- delta billings versus cRPO delta is a little bit higher?\n\nMike Scarpelli -- Chief Financial Officer\n\nWell, I have to tell you, I don't even look at billings because it's a meaningless thing for our business because we're not a SaaS company. We're really focused more on cash flow and revenue consumption by our customers.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nPerfect. Thank you, guys.\n\nOperator\n\nThank you. The next question is from the line of Raimo Lenschow with Barclays. Please proceed.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nThank you. Quick question. I'm sure, Frank and Mike, you heard all the concern from investors this quarter about consumption models and how, in lower economic activities has left. But I'm also seeing like the 12 new global customers.\n\nWhat are you seeing in your customer conversations about consumption models in terms of like it gives customers more flexibility to pay for what they're using, etc., so that almost in tougher times should be an incentive to go that way rather than having this massive upfront commitment? Like maybe talk a little bit about what you're seeing in the field. Thank you.\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nRaimo, it's Frank. I mean we sort of invert that whole way of thinking because it's actually quite attractive for customers to have a consumption model because they can sign a contract with us but then they can throttle up and down how much they want to use. You can't do that in a SaaS model. You're going to pay no matter what, whether you're using it or not.\n\nSo this gives customers actually more confidence to contract with us knowing that they can throttle up and down. So we actually think it's an advantage in the type of times that we're living in as opposed to a negative, which is what has been portrayed on the sell side and in the media.\n\nMike Scarpelli -- Chief Financial Officer\n\nYeah. I'll add to that, too, Raimo. As a reminder, new customers when we land them, they generally start very small, and it takes some nine months to really start to consume. So it's very low risk to come on.\n\nAnd once we have an existing customer that is looking to buy more, they already have a path for what they want to do workloads, and they want to do that on Snowflake because we will save them money from what they're doing. And the other thing I want to remind you, too, is we have many different models. You can sign a one-year commitment. You can sign a three-year commitment.\n\nOr you can go on to on-demand as a customer if you're not comfortable making a big commitment upfront. And we do see customers -- I think last quarter, about $7.2 million of our revenue was actually on-demand. These are new customers that are just trying us out before they sign a capacity deal. And that's most of our capacity deals start from being on-demand to go to that.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nOK, perfect. Thank you. Well done.\n\nOperator\n\nThank you. The next question is from the line of Kirk Materne with Evercore. Please proceed.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nYes. Thanks for taking the question. I guess, Frank, I was wondering if you could talk a little bit about some of the feedback you got from partners, both GSIs and ISVs coming away from your user conference. And kind of what are they asking you about in terms of making -- or telling you about rather in terms of making bigger investments in Snowflake and maybe some of the takeaways you had in terms of -- as you set up your own go-to-market not only for the remainder of the year but into next year? Thanks.\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nYeah. I think the conference was an extraordinary display of our ecosystem. We had a partner [Inaudible] and it's the size of multiple football fields, and I think we're punching way above our weight in terms of how vibrant and how large and how active our ecosystem is. And it's a very purposeful choice on our part to run the company that way.\n\nWe're not trying to create a single vertically integrated stack where you have to buy all things Snowflake. We do quite the opposite. We would try to create maximum choice and innovation on our platform. So we really become market and channel, if you will, for system integrators.\n\nThe reality in the world of system integrators is Snowflake's presence in the marketplace is obviously forcing their hand because our customers are their customers and vice versa. We intercept in the marketplace, and their customers are expecting them to be able to step up and then deliver high-value, impactful capabilities on Snowflake. So they're growing leaps and bounds, but sometimes they're more following than leading. So that's why Snowflake is always leading, and the other rest of the world is following.\n\nMike Scarpelli -- Chief Financial Officer\n\nJust to give you a little data around the GSI network, in the first half of this year, the GSIs have done north of $550 million in services around Snowflake. Our top five GSIs represented more than $320 million of that work. These are real practices within these GSIs now. And just on another thing because I know there's been some chatter about resellers and other things, I just want to make it very clear.\n\n1% of our bookings in Q2 went through the resale channel. 2% of our product revenue goes through resellers. So resellers is not a significant amount of our direct business. But the GSIs are very helpful in doing the services work to get customers to consume on Snowflake.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nThank you all.\n\nOperator\n\nThank you. The next question is from the line of Brad Reback with Stifel. Please proceed.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nHi, thanks very much. Mike, I know you mentioned the 3Q consumption comp. You also have a really, really difficult 4Q RPO comp. But given your commentary, should we expect a healthy end to the year given that renewal pool? Thanks.\n\nMike Scarpelli -- Chief Financial Officer\n\nYeah. We expect we'll have a big increase in RPO. But I'm not guiding to it. You'll have to wait and see.\n\nI'm never going to guide to RPO.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nUnderstood. Thanks very much.\n\nOperator\n\nThank you. The next question is from the line of Brent Bracelin with Piper Sandler. Please proceed.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nGood afternoon. Wanted to drill down into Europe. That's been an area where we saw large deal delays with other large software companies. It sounds like there's opportunity for you.\n\nYou closed several large deals. So maybe if you could just talk about the demand environment in Europe right now and what's driving some of the momentum for you that perhaps is a little different than some of the peers. Thanks.\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nYeah, Brent, it's Frank. We've really shifted gears in Europe in terms of moving -- not so much moving away but sort of really emphasizing the large iconic accounts in key verticals and obviously, in the top regions and countries. And that's really how you win markets over there. And that redirection has taken us a little bit of time.\n\nAnd we last -- this last quarter that we just reported on, we've seen some significant impact. And we made one comment during the prepared remarks about how they contributed some very, very large customers to the overall portfolio -- to the overall roster. So we're actually feeling good about the progress we're making in Europe, in the large names, in the key verticals. So I think it's going good.\n\nThe macro commentary, it's probably we're not really feeling a lot of sort of headwinds, if you will, in Europe. Obviously, there are pockets that are weak. The farther East you go, the more you feel it. But that's really not what we were to begin with.\n\nSo it's not really a factor. So we're not negative on Europe at all.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nGreat to see. Thank you.\n\nOperator\n\nThank you. Next question is from the line of Gregg Moskowitz with Mizuho. Please proceed.\n\nGregg Moskowitz -- Mizuho Securities -- Analyst\n\nOK, thank you for taking the question. Another software vendor that primarily has a consumption-based model recently made the comment that their NRR for customers below the 130% threshold has been unchanged, but those above 130% have been slowing their consumption growth since it deviates a lot from what had been budgeted or committed. Now your overall NRR this quarter again was quite strong, guys, but I'm curious if you've seen any of this dynamic with your bigger enterprise customers. Thank you.\n\nMike Scarpelli -- Chief Financial Officer\n\nNo. Obviously, there are some of our top 10, and we talked about last quarter, with some specific things to their business where they have slowed down, and that's been in our guidance. But overall, our top customers continue to grow. And I haven't seen that slowing down the NRR.\n\nGregg Moskowitz -- Mizuho Securities -- Analyst\n\nGot it. Thanks very much.\n\nOperator\n\nThank you. The next question is from the line of Pat Walravens with JMP Securities. Please proceed.\n\nPat Walravens -- JMP Securities -- Analyst\n\nGreat. Thank you. And let me offer my congratulations on this quarter. Frank, can you take a minute to differentiate Snowflake's approach to the market from that of Databricks and their lake house approach?\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nI mean one of the ways we characterize it is sort of historically, Snowflake has been a data lake with its own platform, its own proprietary platform, and so on, whereas Databricks has taken the approach that they are just another tool in the lake. You can use many including them. So we were a far more strategic choice customers commit to than -- and a much more tactical choice of just being a tool in the lake. Over the years, we have really converged because, for example, we mentioned in the prepared remarks of our support of the Iceberg open table formats, which allows Snowflake files to be used by non-Snowflake tools, for example, right? So it really puts us completely on par or better, if you will, in terms of functionality and performance in a pure data lake configuration.\n\nBut customers can also use this in the conventional, traditional, highly optimized Snowflake proprietary format that most people are using. So I think that -- so that's one aspect of it. The other aspect of it is we come from different places, our DNA, our culture as a company is -- as a database platform. And obviously, Databricks comes from a totally different type of background.\n\nWe also have different user types. We have a very much high-level approach. We very much democratize access to the sophistication of a platform like Snowflake, where Databricks is coming from a world that's much more rolling around and very, very deep technical, very skilled demand type of environment. And there is a market for that as well.\n\nSo there's different user types, different workloads that were -- people will use different type of tools. The last thing I will say about it is that de facto Databricks and Snowflake have lived side by side for many, many, many years, playing different roles in the setups and the type of workloads that they perform. So anything you want to say about that, Christian?\n\nChristian Kleinerman -- Senior Vice President of Product\n\nYeah. One quick comment on everything Frank said. We hear very consistently from customers that our approach to simplicity and ease of use is one of the reasons why you see the results that you're seeing today and the Net Promoter Score that Frank mentioned. Because we help customers focus on solving data problems, getting value out of the data and not deal with the infrastructure.\n\nPat Walravens -- JMP Securities -- Analyst\n\nGreat. Thank you both.\n\nOperator\n\nThank you. The next question is from the line of Kamil Mielczarek with William Blair. Please proceed.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nThanks. Congrats on the solid quarter. The headcount growth in your sales and marketing organization has exceeded 50% in the first half of this year, which is comfortably above the growth rate you achieved in both fiscal '21 and '22. Can you provide more detail on where you've been focusing these new investments? And given the macro uncertainty, how do you think about the time to ramp? How long should it take for the new hires to be fully reflected in revenue? Thank you.\n\nMike Scarpelli -- Chief Financial Officer\n\nWell, the first half of the year is always the biggest hiring, and that tends to be we want to get people on board for our sales kickoff. It's also when we like to onboard a lot of our junior SDRs so we can train them altogether in the year. But the people we're adding are principally in direct sales and sales engineers, and we continue to open up new countries around the world. But we're going a lot deeper within North America as well, too, because there still is a lot of accounts that are being covered today.\n\nAnd it takes -- depending on where they are in the corporate sales team, which is more of an inside sales, it's about a six-month period to ramp. It's a little bit longer around the enterprise and the verticals. The real large verticals we go after, those guys could take a year to ramp because those are long sales cycles.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nHelpful. Thank you.\n\nOperator\n\nThank you. The next question is from the line of Derrick Wood with Cowen. Please proceed.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nGreat. Thanks. Congrats on a great quarter. [Technical difficulty]\n\nMike Scarpelli -- Chief Financial Officer\n\nDerrick, we can't hear you very well. You're cutting in and out. Could you repeat that maybe?\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nIs this better? Can you hear me now?\n\nMike Scarpelli -- Chief Financial Officer\n\nYes.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nI wanted to ask about the -- just the activity of migrating customers from legacy on-prem systems. And I think you've shown stats that close to 60% of your new customers come from that environment. And given the macro out there, some would argue you'd see acceleration because of operational efficiencies. Some would argue maybe there's a lot of change management, and companies would want to hold off.\n\nBut just curious what you're seeing out of your pipeline in terms of the prospects priority to migrate off of on-prem systems.\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nI'll make one comment. I mean I will tell you that just in the last week, I've heard some -- two very, very iconic names in two different industries that were staunch on-premise people who would never ever go cloud and that are now going. So I just feel that the resistance is completely breaking and people are going cloud. I'm sure they have their own reasons.\n\nBut a lot of this is what you said as well, is that they are -- they're going to get left behind. You can't take advantage of innovations that are only available on the cloud. So, if anything, I tend to agree with you that we're going to see acceleration out of this as opposed to people holding back.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question is from the line of Brad Zelnick with Deutsche Bank. Please proceed.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nExcellent. Congrats, guys, on a really strong quarter and navigating a crazy environment out there. My question for you guys, maybe for Frank, is, I mean, if we think about just Data Cloud as the Holy Grail and data sharing being a really important element of that, and I look to the metric on stable edges, number of customers with at least one stable edge, I think it was 20%, you said, versus 15% a year ago, which I think is unchanged from what you had also said in Q1. Can you just give us a sense of how you would expect to see that progress? And when we look back one day, maybe where might the peak be? Thank you.\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nI think there is a natural progression in these things. As you said, lots of people are preoccupied with the migration. That takes a lot of time. There's a lot of risk.\n\nThere's a lot of -- so people want to get their core capabilities in place. They want to deal with their backlog, all the things that they need to do before they sort of move on to more aggressive, more ambitious projects where they're really starting to execute on their strategies and the vision that they have for themselves. So I think that the Data Cloud is an incredibly important positioning element for us but also for our customers because if you don't adopt that posture, you will end up resilo-ing your environment in the cloud, and you will basically load up on the same set of problems that we historically have had. And it's a much bigger problem now because data science and thepromise of data science, the ability to generate predictive insights and prescriptive solutions really depends on your ability to join and blend and overlay data regardless of data types, data source or where it's coming from.\n\nYou can't predict. So it's really, really important that you don't throw up new barriers between data sources because you will not only frustrate your data science teams. You will literally not be able to realize the potential that is now there. So we draw a line in the sand on that.\n\nIf you're going to go silo by silo, then you will be on the cloud, which you will not have set yourself up for the promise that's now in front of us.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nExcellent. Thanks so much.\n\nOperator\n\nThank you. The next question is from the line of Will Power with Baird. Please proceed.\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nGreat. Thanks for taking the question, and again, congratulations on the strong numbers. It looks like really strong upmarket success. I think a record number of $1 million or at least new $1 million customers.\n\nI just wanted to get more color, if there are any common variables helping drive that upmarket success. It sounds like there's a correlation with data sharing, the percentage of those customers that are deploying stable edges. So any further color on that, that would be great, too.\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nIt's Frank again. I think as Mike said earlier, I mean, a lot of these million-dollar accounts can be years in the making. And a lot of the work that we've done in previous years is now culminating, and it's becoming visible in this particular manner. So it's not an overnight success.\n\nThese things take time. But data sharing is incredibly important. Every industry and sub-industry has its own unique data networks and their own reasons and use cases where we know why they need to share data. In financial services, for example, which is, of course, an industry that you're all very familiar with, I mean, the need for sharing is extremely pronounced.\n\nAnd it's a daily preoccupation between institutions that need to share data. So Snowflake has really become a de facto platform for financial institutions on how to share data. So that becomes a very, very powerful thing. We feel the network effect from data sharing in certain verticals that are really more advanced, more mature in terms of the adoption of data sharing than some others that are taking more time to get into that.\n\nMike Scarpelli -- Chief Financial Officer\n\nYes. And what I will add, too, is we have 510 Global 2000 customers. The average revenue from them today is $1.2 million. That's up from $1.05 million last quarter, and that will continue to grow.\n\nThose large customers are what is driving those million-plus customers for us, and we don't see that slowing down.\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nAlright. Thank you.\n\nOperator\n\nThank you. The next question is from the line of DJ Hynes with Canaccord. Please proceed.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nHey, guys. Thanks for taking the question. Mike, I wanted to ask you about the margin trajectory of the business. I mean continue to impress with the cash flow operating leverage you're showing.\n\nYou raised the guidance to 17% this year. Given the trajectory, we're not miles off from that longer-term 25% target. What was the philosophy from here? Like do we reinvest the growth and the upside that we're seeing into the business to drive sales, productivity, and accelerated investment there? Or does some of that flowthrough the bottom line, and maybe that 25% margin target is achievable ahead of schedule?\n\nMike Scarpelli -- Chief Financial Officer\n\nWell, we're going to get to that number before we even think about changing it. And with regards to investing in the business, we are continuing to invest in the business. You can see the headcount we're adding. Principally, headcount is the main investment we're doing in the business because that's what drives R&D.\n\nThat's what drives sales. But we're very thoughtful about where we invest those dollars and how quickly we do. And we think we're investing at the adequate pace, and we will continue with that. And nothing has changed in our philosophy.\n\nWe will continue to show leverage year after year.\n\nOperator\n\nThank you. Our next question is from the line of Brent Thill with Jefferies. Please proceed.\n\nBrent Thill -- Jefferies -- Analyst\n\nThanks, Frank and Mike. On verticals, were there some standouts this quarter? We've heard energy has been a hot topic, just as an example. Any other big verticals you'd call out that you saw particular strength that you're excited by?\n\nMike Scarpelli -- Chief Financial Officer\n\nYeah. Energy is not a very big vertical for it. Yes, we have some good customers, but they're not huge consumers of Snowflake. Really financial services is the No.\n\n1 vertical. It's about -- if you look at it from a revenue perspective, about 20%, 21% of our revenue is from the financial services vertical. And then closely behind that is the media and entertainment. And then technology is right after that as well, about the same.\n\nThose are our three biggest. And then healthcare is pretty big, but it can grow a lot bigger.\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nRetail CPG.\n\nMike Scarpelli -- Chief Financial Officer\n\nRetail CPG is a meaningful segment as well. But financial services is very large, and those are very large stable edges, the data sharing that goes on in financial services. And when we talked about big accounts we landed in Europe, a big telco. We landed a big bank.\n\nWe landed a big insurance company. And we continue to land big accounts in these verticals.\n\nBrent Thill -- Jefferies -- Analyst\n\nOK. And one quick follow-up. Just tonight, you've seen Salesforce.com take down guidance and Splunk takedown guide. Everyone's asking.\n\nIt seems like the industry is taking the guide down, but you're seeing incredible strength and no stretched-out deals or duration. What do you think is going on? Are you just taking share? Is it just early on? How would you characterize what you're seeing, what --\n\nMike Scarpelli -- Chief Financial Officer\n\nYeah. I would say most SaaS companies, when they land an account, they typically license most of the users in an account. When we land, we land small. And they go workload by workload, and they just keep moving stuff over to Snowflake.\n\nThat drives that. And it's a multiyear journey within our customers. And I don't see any of our customers that are fully saturated, where I think some SaaS companies may be saturated.\n\nBrent Thill -- Jefferies -- Analyst\n\nVery clear. Thanks.\n\nOperator\n\nThank you. The next question is from the line of Steve Koenig with SMBC.\n\nOwen Haworth -- SMBC Nikko Securities -- Analyst\n\nHey, guys. This is Owen Haworth on for Steve. Thanks for taking the question. Two quick related questions from us.\n\nFirst, can you describe the near-term opportunity and analytics beyond your core data warehouse use case? And which of these other workloads would you expect to become most prevalent in the near term? And then as a second, I'm wondering if you can talk through the plans to break into the operational use cases. And how many times bigger is that market opportunity in the near term compared to that heritage EDW market? Thank you.\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nIt's Frank. I'll make one comment. I'll give Christian some time to think about some additional comments. We started out in this business with what I'd refer to as a workload modernization, where we're taking existing workloads and move them to the cloud.\n\nAnd we're running them much faster because of all the architectural innovations that Snowflake has represented. And this really helps customers. And I mentioned this in the prepared remarks. It really helped customers a 24-hour cycle to very reliably deliver data to their business users.\n\nAnd that's been a long time coming. The customers have struggled with that enormously. And then we hear about it every single day. But that's just reporting yesterday's news.\n\nAnd these days, I will tell you that nine out of 10 conversations I had with customers are not about that, OK? They are about very specific industry challenges and industry opportunities. For example, we have pharma customers that are seeing opportunities to reduce their clinical trials. It takes on average 12 years to bring a drug to market. You've got five years left to monetize it.\n\nThey can take a whole year off for that. You redefine the economics of an entire industry. Healthcare is trying to go to an entirely predictive model. Let's say treating people for disease, they're trying to predict who is going to get sick and what preventative protocols they can put in place to help people then steer clear of that.\n\nSo these are very different conversations than what we're doing. In advertising, for example, with clean room technologies, we're doing totally different things now, and we're enabling these industries to navigate all the issues around privacy and compliance and so on. So to characterize this as a data warehousing company, I've said this a million times, but that is probably five years out of date by now. And you can keep doing that, but that doesn't make it the reality of our business because it's not anymore.\n\nChristian Kleinerman -- Senior Vice President of Product\n\nI'll add that we see broadening of the personas within a company that we speak to. It's not just the traditional data analyst team, but data engineering team are engaged with us. Data science teams are engaged with us. Streamlit has a really strong relationship with many of the data science teams, and we see that part of it.\n\nWe announced at our user conference in June, cybersecurity is a workload that is doing very well for us. And probably the largest announcement was around Snowflake for data applications and application platform. That's where the opportunity for the operational database capabilities fit into, and we see tremendous interest on both customers and partners.\n\nMike Scarpelli -- Chief Financial Officer\n\nYeah. And just a quick follow-up. Snowflake has become de facto a cloud application development and run time platform. People are building and deploying applications on Snowflake.\n\nI mean we have customers like Western Union who were starting whole businesses on top of Snowflake. Those are the conversations that we are having with customers. Workload modernization, we'll be doing that until the end of time, but that's no longer the reality that dominates our daily existence.\n\nOwen Haworth -- SMBC Nikko Securities -- Analyst\n\nSuper helpful. Thank you, guys.\n\nOperator\n\nThank you. The next question is from the line of Ittai Kidron with Oppenheimer. Please proceed.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nThanks, and a nice quarter. Mike, I wanted to piggyback to a comment you made earlier that it takes months for customers to get into production even after they sign up with you. I guess with that being the case in the current environment being what it is, what is the risk that six to 12 months from now, we'll see a little bit of a lull in your growth as whatever slowdown in activity that's happening with them right now translates into a smaller number of workload transitions into the cloud? How much visibility do you have into the prep work customers are doing with respect to the workload transition?\n\nMike Scarpelli -- Chief Financial Officer\n\nWell, we have a lot of that. You can see in the number of Cap Ones that we landed last quarter, it was north of 600. All of those customers, they signed up on Snowflake to move workloads to us. And we know, based upon discussions we have with many of our top customers, their plans, what they're planning on doing.\n\nAs an example, we have a number of our customers that are just chomping at the bit for Snowpark to go into GA with Python because they want to do more on Snowflake. So that's what gives us the confidence. And we spend a lot of time looking and engaging with our reps. We're talking to our customers to get a feel for what is consumption going to be like over the next three months, six months with ourcustomers.\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nJust a quick follow-up. I actually think that the dynamic that you're describing, I mean, we're going to see the exact opposite of that. We think people -- because of the nervousness that they may have about the macro, they're going to accelerate to a cloud computing platform. And the reason is these are elastic models.\n\nThese are consumption models, right? So it's much better to be in the elastic model where you only pay for what you use, and you can run on demand than when you have to make large upfront commitments to vendors. So if anything, I think people are going to get a move on instead of hold off.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nGood. Thank you.\n\nOperator\n\nThank you. The next question is from the line of Ari Terjanian with Cleveland Research. Please proceed.\n\nAri Terjanian -- Cleveland Research Company -- Analyst\n\nThank you for taking the question and congrats on the great results. You alluded to earlier referring on Snowpark and Python support. I was just hoping if you could provide a little bit more color on the feedback you're getting from customers around Python or Snowpark, as well as the announcements you made around Apache at the user conference. Curious when you think those can start to drive consumption for the platform when you're expecting contribution and what types of projects that you're currently not involved in, what kind of use cases it could open up for you.\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nYes. I'll start, and maybe Christian can finish. Python is -- Snowflake for Python is red hot, and people are chomping at the bit for us to declare it GA, which is something. And we have customers that are really wanting us to let them use it in production now, some of the largest customers that we have.\n\nSo the pressure is on because the demand is there. The thing about the Iceberg open table formats that really completely open Snowflake up to be -- for Snowflake tables to be used by anybody and everybody that can support that format, we're seeing incredible results in terms of performance of Snowflake executing against that file format. So these are all very, very, very promising developments for us. And I think that the pressure is on for us to declare these things generally available because people are trying to rip them out of our hands right now.\n\nMike Scarpelli -- Chief Financial Officer\n\nYeah. As we said at our Summit conference, we expect those to be GA at the end of this year. So a meaningful contribution to consumption will happen next year.\n\nChristian Kleinerman -- Senior Vice President of Product\n\nThat's right. And qualitatively, the feedback is extremely positive, which is why, as Frank said, we get these many requests to go production, go GA as soon as we can.\n\nAri Terjanian -- Cleveland Research Company -- Analyst\n\nExcellent. Thank you.\n\nOperator\n\nThe next question will come from the line of Tyler Radke with Citi. Please proceed.\n\nTyler Radke -- Citi -- Analyst\n\nThank you. So we made it almost a full hour without talking about Graviton. I actually just wanted to ask you how you're thinking about new projects or new workloads in response to some of the optimizations. And any change to your assumptions? I think you had talked about kind of $60 million of net new spend coming online.\n\nJust curious how that's tracking and your expectations for the second half of the year. Thank you.\n\nMike Scarpelli -- Chief Financial Officer\n\nNo changes to our assumptions there. And we always expect that the biggest impact is in the second half of the year on those? And then Christian?\n\nChristian Kleinerman -- Senior Vice President of Product\n\nYeah. We're always continuously looking at how to deliver price performance advantage to our customers. Graviton happened to be one of the more significant changes. But any quarter, we have tens of changes that go and improve performance for different workloads.\n\nAnd we're also constantly evaluating hardware advancements, and our commitment to our customers is to do that research that we have and deliver best price performance.\n\nTyler Radke -- Citi -- Analyst\n\nAnd if I could sneak in a quick follow-up, I guess, just what type of workloads are you seeing customers bring on with those lower price points? Is it kind of new workload that you weren't able to handle in the past? Just any way to characterize that?\n\nChristian Kleinerman -- Senior Vice President of Product\n\nYeah. We're seeing a lot of lower-latency, higher-concurrency use cases, like slicing and dicing. We did our migration from Drewry, which is very related to use cases recently, in part because of the better economics, but in part because of the performance. And they're obviously -- it's highly correlated.\n\nWe're also seeing a lot of data engineering, data transformation, Spark migrations coming on to Snowflake, all because of the price performance that we offer.\n\nTyler Radke -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nThank you. That concludes the question-and-answer session [Operator signoff]\n\nDuration: 0 minutes\n\nJimmy Sexton -- Head of Investor Relations\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nMike Scarpelli -- Chief Financial Officer\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nSimon Leopold -- Raymond James -- Analyst\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nRaimo Lenschow -- Barclays -- Analyst\n\nKirk Materne -- Evercore ISI -- Analyst\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nGregg Moskowitz -- Mizuho Securities -- Analyst\n\nPat Walravens -- JMP Securities -- Analyst\n\nChristian Kleinerman -- Senior Vice President of Product\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nOwen Haworth -- SMBC Nikko Securities -- Analyst\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nAri Terjanian -- Cleveland Research Company -- Analyst\n\nTyler Radke -- Citi -- Analyst\n\nMore SNOW analysis\n\nAll earnings call transcripts"
}