{
  "companyName": "Privia Health Group, Inc.",
  "companyTicker": "PRVA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/privia-health-group-inc-prva-q2-2022-earnings-call/",
  "content": "Privia Health Group, Inc. (PRVA -0.53%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and thanks for standing by. Welcome to your Privia Health Q2 2022 conference call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session.\n\n[Operator instructions] Please be advised that today's conference is being recorded. I would like to hand the conference over to your speaker today, Robert Borchert, SVP of investor and corporate communications. Please go ahead.\n\nRobert Borchert -- Senior Vice President, Investor and Corporate Communications\n\nThank you, Kyle. And good morning, everyone. Joining me today are Shawn Morris, our chief executive officer; Parth Mehrotra, president, and chief operating officer; and David Mountcastle, our chief financial officer. This call is being webcast and can be accessed from the investor relations section of priviahealth.com.\n\nToday's press release, highlighting our financial and operating performance and the slide presentation accompanying our former remarks are posted on the investor relations pages of priviahealth.com. Following our prepared comments, we'll open the line for questions and we ask that you please limit yourself to one question and one follow-up so that we can get through the full queue in a timely fashion. The financial results reported today and in the press release are preliminary and are not final until our Form 10-Q for the quarter ended June 30, 2022, is filed with the Securities and Exchange Commission. Some of the things we will make today are forward-looking in nature based on our current expectations and our view of our business, as of August 11, 2022.\n\nSuch statements, including those related to our future financial market performance and future business plan objectives, are subject to risks and uncertainties that may cause actual results to differ materially. As a result, these statements should be considered in conjunction with the cautionary statements in today's press release and the risk factors described in our company's most recent SEC filings. Finally, we may refer to certain non-GAAP financial measures on the call, and reconciliations of these measures to comparable GAAP measures are included in our press release and the accompanying slide presentation posted on our website. Now I'll turn the call over to Shawn.\n\nShawn Morris -- Chief Executive Officer\n\nThank you, Robert, and good morning, everyone. Privia Health delivered another strong quarter of growth and our highly aligned provider partnership model continues to gain momentum highlighted by our 31.5% growth of implemented providers from a year ago. We expect to continue expanding our number of provider partners, increase distributed lives, and into new markets over the coming quarters, while also driving profit margin expansion by leveraging our capital-efficient operating structure. We are executing on multiple opportunities to extend our market reach, drive future growth, and positively impact care delivery.\n\nWith continued momentum in existing markets, we remain highly confident in our growth outlook for 2022 and beyond, as we continue to organize physicians into scaled networks across our country. This morning, I'll present an overview of key business highlights and then David will discuss our recent financial performance and updated outlook for 2022 before we take your questions. Privia Health is continuing to execute at a very high level. Practice collections increased more than 67% in the second quarter, reaching over $615 million.\n\nWe generated a record quarter of $15.5 million and adjusted EBITDA of 55% when compared to the second quarter of last year, showing the scale of our operating model, while we continue to invest across our enterprise to support this accelerated top-line growth. This business momentum and high forward visibility into our growth metrics are reflected in our updated financial guidance for 2022. Our balance growth is being driven by continued same-store growth and strength in ambulatory utilization across all our existing practice locations. We generated another solid quarter of new provider additions in existing markets in combination with the sustained high level of provider retention.\n\nIn addition, our business development pipeline remains robust as we look to enter many new markets over the next few years. On an industry note, in early July, CMS released the proposed 2023 Medicare physician fee schedule rule. Overall, we believe the proposals are a net positive for Privia. In particular, CMS made a significant endorsement of the Medicare shared savings program, and some of the changes positively impact both Privia providers and their patients.\n\nCMS has been vocal in its support, having recently said it wants to use MSSP as a chassis for growth and care transformation. Launched 10 years ago, the Medicare shared savings program now serves 11 million patients across 525,000 providers. The structure of the program has evolved over the last five to seven years into one of the most successful CMS and CMMI programs. We continue to prove our success in the program by lowering costs and improving outcomes, thereby generating shared savings for CMS as well as for Privia and our provider partners.\n\nAs I noted, our business momentum has continued to be extremely encouraging across both existing and potential new geographies. Our national footprint now includes more than 3,500 implemented providers, caring for over 3.9 million patients, in more than 890 locations across eight states and the District of Columbia. Our scale and geographic density are also defined by the breadth of medical specialties. As I noted last quarter, we approached, while approximately 60% to 65% of our practice partners are primary care focused, including internal medicine, family practice, pediatrics, and OB-GYNs, we actually partner with over 50 specialty types.\n\nThis enables us to offer our primary care providers and our payer partners, as well as consumers, a broad ambulatory care delivery network that can improve patient outcomes and reduce costs across the value-based care spectrum. Our operating model and strategy have led Privia to have one of the broadest, most balanced, and well-diversified balance care, value-based care platforms in the industry. Our more than 80 at-risk contracts now cover approximately 856,000 attributed lives across commercial, Medicare, and Medicaid programs. This is up 15.8% from a year ago, giving us a lot of momentum and visibility and the remainder of 2022.\n\nAs you know, we take upside and downside risks and many of our payer contracts covering nearly two-thirds of our attributed Medicare live across our MSSP and Medicare Advantage programs. With this thoughtful move, the risk continues to provide significant opportunities for top-line and EBITDA growth as we execute on our goals to earn greater shared savings in the years to come. Now I'll ask David to review our recent financial results and updated 2022 outlook.\n\nDavid Mountcastle -- Chief Financial Officer\n\nThank you, Shawn. Our operating model again delivered an outstanding performance in the second quarter of 2022, highlighting both the scale of our operations and our continued business momentum. Our 31.5% growth in implemented providers and 15.8% increase in value-based attributed lives combined with solid ambulatory utilization trends led to all of our financial results coming in above expectations. Practice collections increased to $615.5 million, up 67.6% from Q2 a year ago, care margin increased 36.6%, and adjusted EBITDA was a record $15.5 million, up 54.8% over the same period last year.\n\nAs expected, our top line grew slightly faster than EBITDA again this quarter due to the new capitated arrangements, as well as investment across our business enterprise to support this accelerating top-line growth. At the same time, the operating leverage in our model is clearly apparent as our top line and care margin growth is translating nicely into EBITDA growth and margin expansion. Our adjusted EBITDA margin as a percentage of care margin increased 240 basis points from a year ago to reach 20.4% for the first half of 2022, practice collections increased 65.5% to almost $1.2 billion. Care margin was up 36.5%, and adjusted EBITDA grew 51.8% to reach $30.3 million for the first half of the year.\n\nOur capital resources continue to be very strong given the cash flow dynamics of our business. In June 2022, the company repaid all of its outstanding debt with cash on hand. Our balance sheet included cash and cash equivalents of 292.2 million, and our 65 million revolving loan facility remains in place, available, and undrawn as of June 30, 2022. Given our first half performance, business momentum, and visibility through the rest of 2022, we have a high level of confidence in our updated financial guidance.\n\nWe now expect practice collections, GAAP revenue, and care margin to be at the high end of our guidance ranges. We raised our platform contribution guidance to a range of $137 million to $142 million and also raised our adjusted EBITDA guidance to a range of $57 million to $60 million, an 8.3% increase at the midpoint. Our year-end implemented provider guidance is now expected to be in the mid to high end of our range, and our guidance for attributed to lives is now at the midpoint of our range. Our growth outlook includes only previously announced new market entries and we continue to expect 90% plus of our adjusted EBITDA to convert to free cash flow with capital expenditures of less than $1 million in 2022.\n\nWe remain focused on growing and expanding our business and continuing to execute on our multiple growth initiatives. This includes growing existing practices, increasing attribution in risk-based contracts, adding new providers, identifying opportunities to expand our platform, and opening new markets over time. With that operator, we are ready for the first question.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Joshua Raskin from Nephron Research. Your line is now open.\n\nJoshua Raskin -- Nephron Research -- Analyst\n\nHi. Thanks. Good morning. My question, I wanted to follow up on the comment you made about this Medicare, the physician fee schedule, and the proposed changes around the MSSP program.\n\nI'm curious, do you think they're short-term benefits from some of the benchmark changes? Do you think that helps? And then, I'm curious, if you guys are in a position where the changes to the risk score cap actually impact you as well.\n\nShawn Morris -- Chief Executive Officer\n\nHey, Josh, this is Shawn. Good to hear your voice. As we -- without getting into all the details of it, as we talked about -- it's proposed, we're going through all this. We think it's -- there are a lot of beneficial things to -- within the proposed remarks.\n\nBut the biggest thing probably is that -- it's just as we've talked a lot about in the past, it's a huge endorsement, the way CMS wants to kind of invest in MSSP in these changes. And I think some of the ones you mentioned are positive for Privia. As we've had one of the largest, most successful ACOs in the country. And our experience over the last seven years is it's been very positive and it's continuous and headed in that direction.\n\nSo. they'll continue to evolve it, and the changes you mentioned are positive for us.\n\nParth Mehrotra -- President and Chief Operating Officer\n\nAnd Josh, just to add it's not a program where risk adjustment as a big factor averages scores around one or thereabouts. So that's what differentiates us. It's relative performance and it's harder to execute. So we're pretty happy with how we perform here.\n\nJoshua Raskin -- Nephron Research -- Analyst\n\nOK, that's helpful. And then if I could follow up. I know it's early, but I know you guys have a pretty good lead time on implemented providers. So I'm just thinking, just curious on your thoughts going into 2023.\n\nYou had sort of a big bump at the end of last year. I don't know how they ended this year. Based on guidance seems like a sort of continued steady march upward. But I'm just curious, 2023 how we should be thinking about that, and specifically, if there are any new market entries that you guys are expecting.\n\nDavid Mountcastle -- Chief Financial Officer\n\nYeah. Thanks. So obviously, we're not giving '23 guidance today. What I would say is, as we sit at this time of the year, pretty much everybody that's expected to be implemented this year is already sold.\n\nSo that gives us a lot of good visibility and that's reflected in the guidance we provided. Our sales pipeline and execution have been ahead of our expectations this year and we continue to see a lot of momentum. So as we close out the year with new providers being added across all of our eight states, that gives -- that will give us very good visibility as we enter '23 and we expect to continue to see that momentum going in the existing markets. And then obviously this guidance does not reflect any new markets that we may enter.\n\nThe business development pipeline is pretty robust, similar to last year. Again, the timing is uncertain, but as and when we execute those arrangements, we'll announce them, and we'll update the guidance appropriately and that could impact that metric into 2023.\n\nJoshua Raskin -- Nephron Research -- Analyst\n\nGotcha. It sounds like there are a couple of big ones in the pipeline. And you're talking sort of similar to what we've heard in the past, but tough to figure out the timing.\n\nShawn Morris -- Chief Executive Officer\n\nThanks, Jess. Next question, please.\n\nOperator\n\nYour next question comes from the line of A.J. Rice from Credit Suisse. Your line is now open.\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nThanks. Hi, everybody. Maybe I'll just follow up on that last one, when you think about 2023, you mentioned some of the -- you mentioned some in response to Josh's questions, but what are some of the big puts and takes when you think about the outlook, what are the biggest swing factors in your mind as to where we might end up and looking at 2023 for businesses?\n\nParth Mehrotra -- President and Chief Operating Officer\n\nYeah. It's Parth. Appreciate the question. Look, again, generically speaking, the drivers are, as we've stated in the past, its growth in our existing markets.\n\nIt's a pretty broad footprint. A lot of them left, we continue to add new providers. So that obviously factors really well. A lot of same-store growth in the existing providers that are already implemented, both on the fee for service book.\n\nAdding attributed lives in existing markets and then moving them further down the spectrum of risk. So it's pretty multipronged on the existing base of business. And then obviously, as we execute on business development and new markets, similar to what you saw last year when we announced California, Montana that accelerates growth even farther, so it just depends on where we end this year. We're focused on just executing pretty strongly, really happy with what we've done in the first half-year.\n\nPositioned us really want to close this year out strong and then we continue to execute here in the next few months, and see what 2023 brings. The one generic comment, we've obviously, given is our long-term guidance of 20% practice collections growth and 20% EBITDA growth. And obviously, we are growing much faster than that this year, as you can see. As a lot of those drivers hit pretty well last year and this year.\n\nSo there'll be some years where we grow faster, some slower. We're obviously focused on accelerating that growth as much as we can, as soon as we can, but you'll have variability year over year. Over the long term, 10-plus years at least that's what we see ahead of us. As we're in eight states, we have 42 to go.\n\nSo lots more to go.\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nOK. Maybe just the follow-up question. A lot of mixed messages this quarter across providers, across people broadly in your space, and around utilization trends. I just wondered if you could comment both on your risk and your fee for a service business, anything to call out, and underlying utilization trends that you're seeing, Are there any areas of surprise or something to highlight?\n\nParth Mehrotra -- President and Chief Operating Officer\n\nSure. So to break it out on the fee for service book ambulatory utilization, very similar to our comments in the last few quarters have been running ahead of our expectations. We think that is good utilization with patients seeing their primary care provider, pediatrician, and OB-GYN in the community that's been running ahead of our expectations. Our guidance assumes that that normalizes.\n\nSo obviously, we're trying to be prudent and it's been tough to predict in and out of COVID, as has been the case with everybody. But we prefer on the side, if you're wrong, there's an upside and not a downside. The inpatient utilization, obviously, has been also very difficult to predict. That impacts a value-based book.\n\nAgain, our guidance and accruals reflect what we see today and we try and again, be prudent with our assumptions. There's a lot more variability in the inpatient utilization. You've seen that in the comments from others in the industry. And again, it's a tough, tough environment to just predict that.\n\nSo we'll see how it plays out.\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nOK. Thanks a lot.\n\nShawn Morris -- Chief Executive Officer\n\nThanks, A.J.\n\nOperator\n\nYour next question comes from the line of Lisa Gill from J.P. Morgan. Your line is now open.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks very much. Good morning. Congratulations on the quarter.\n\nI'm wondering if you can maybe just give a little more detail around the value-based care lives that the 15% or 16% growth. What areas are you seeing growth? That would be the first question. And then secondly, as we think about the improvement in the adjusted EBITDA, what are some of the key drivers? Are you starting to see leverage in the business model? Or is there something else that you would call out, as we think about that, that improvement being that the biggest of the line items that you called out for improvements in the back half of the year?\n\nParth Mehrotra -- President and Chief Operating Officer\n\nThanks for the question, Lisa. So on the first question, the growth is broad-based. As you can compare quarter over quarter, year over year, we are focused, and I think that's where we differentiate from a lot of peers. We are focused on commercial MA and MSSP attribution as well as Medicaid.\n\nSo all four buckets are important to us. We are trying to add lives across those four. There can be some variability quarter over quarter in the mix, but ultimately we are focused on the full patient panel, which I think really diversifies our book and is a key source of differentiation. It's also impacted by which providers we are adding and which markets and what the mix is in that particular geography.\n\nAnd that could influence it a little bit quarter over quarter, especially as we add new markets and ramp them up. But again, our focus is on growing all of those four buckets from an attribution perspective and then hopefully, moving to increased levels of risk in all of those. So that's your first question. On the second one, again, look at we're really proud that the business already operates at a pretty good scale while we are just in a stage.\n\nIf you look at any of our metrics, a number of locations that close to 900, number of patients at close to 4 million, and 3,500 providers, attributed lives over 850,000, and our book of business is at scale and there's a lot of room to grow. So where we are at today is a pretty nice point where if we see an acceleration in the top line that is ahead of our expectation. You can see that translating into very good operating leverage down the P&L, which is what we like to see. Now we obviously don't invest in the business and capitalize on the growth opportunity that's ahead of us.\n\nLike I just mentioned 42 more states to go. And so there'll be quarters where we prudently increase the level of investment if we open up new markets and so on, so forth and of the guidance. But as we see that top line momentum, it's all across the P&L where we see good operating leverage.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks for the comments.\n\nShawn Morris -- Chief Executive Officer\n\nThanks, Lisa.\n\nOperator\n\nFor our next question. It comes from the line of Adam Ron from Bank of America. Your line is now open.\n\nAdam Ron -- Bank of America Merrill Lynch -- Analyst\n\nHey, thanks for the question. Going back to that fee for service revenue, and I guess the revenue at the point in the quarter, it looks like based on the guidance that you kind of touched on conservatism in the back half, but it looks like there's 46% of your practice collections in the second half versus 56% last year and 53% in 2020. So just wondering how that seems very counter to how I would think about utilization trending, as people kind of hit their deductible in Q4, generally being the highest utilization quarter, is anything else you would call out in terms of the slowdown in your expecting?\n\nParth Mehrotra -- President and Chief Operating Officer\n\nNo, nothing in particular. Again, we are being prudent. everything that we see doesn't point to any material difference from how this operated last year. And again, look we are at the midpoint of the year and we've guided toward the high end of the range.\n\nLike I said, if these trends continue again, we'll update our guidance in three months here, but nothing that we see is different from what we saw last year.\n\nAdam Ron -- Bank of America Merrill Lynch -- Analyst\n\nSo you're saying that [Inaudible] position utilization is above your expectations, but like what specifically makes you think that it's the actual utilization itself that is elevated enough that you're just gaining share on the same store basis? And --\n\nParth Mehrotra -- President and Chief Operating Officer\n\nI think that's a good point. I think it's a combination of both. Obviously, all our locations are they have some spare capacity. And if there's increased demand we are able to absorb it.\n\nI think we have gained market share at the care center level, given the strength of our business and our practices and how they've come out of COVID. I think we've increased patient panels at each provider level in aggregate overall. So we see all of that strength playing out. And again, it's hard to predict some of these trends, the overall level of utilization on a per patient basis and then increases in the number of patients at the provider level if they are growing same-store growth on top.\n\nWe continue to also see telehealth, which is about 10% of the mix. It's pretty stable, it's in the ambulatory fee for service book. Again, all of those, I think both pretty well for how we are set up, and if those continue, we'll update guidance again in three months.\n\nAdam Ron -- Bank of America Merrill Lynch -- Analyst\n\nAll right, great.\n\nOperator\n\nFor your next question, it comes from the line of Richard Close from Canaccord. Your line is now open. Please ask your question.\n\nRichard Close -- Canaccord Genuity -- Analyst\n\nThanks for the questions. Congratulations. I was wondering if you could just provide us an update on the new markets you entered last year, West Texas and Bass. I know there's a period of time where you're selling and investing in potential new providers.\n\nJust curious about how that sales process is going now that we call it two plus quarters into it?\n\nParth Mehrotra -- President and Chief Operating Officer\n\nYeah, thanks, Richard. Appreciate you joining despite your conference. All three markets are up and running. California, West, Texas, and Montana, as we end each of those with an anchor partner in a group joining us, Bass Medical Group in California, Abilene Index in West Texas, and then Great Falls Clinical Surgery Partners in Montana.\n\nSo all of those are live. And we have started our sales effort in all of the markets. We have sold our first provider groups in these markets and we are on our way. Obviously, that just takes time to ramp up the effort on the ground, but they're going as expected.\n\nAnd obviously, Montana and West Texas are smaller towns, but we're really excited about California, a big state with a big population. And we think we can really grow that medical group pretty meaningfully in the years to come. So we're really excited about it.\n\nRichard Close -- Canaccord Genuity -- Analyst\n\nAnd just to follow up, Shawn, on the -- your comments on the new market potential, it seems maybe a little bit more bullish, although it was bullish in the first quarter. Any big changes with respect to the pipeline that you can call out from? maybe three months ago.\n\nShawn Morris -- Chief Executive Officer\n\nYeah. I mean, Richard, we remain bullish, I guess, to use your words, pipeline's robust. It's we've talked a lot about the core model kind of in position groups. We're still very excited about the health system approach.\n\nSo not to get overly specific about what's in our pipeline, but it's a good cross-section. It's geographically dispersed. It's across those the two I talk about. So if you look at our history, these things come in at different times and it's not we're not selling a widget.\n\nSo we were out there selling a solution and they take time. But at the same time, we're very excited about the pipeline itself.\n\nRichard Close -- Canaccord Genuity -- Analyst\n\nGreat. Congratulations. Thank you.\n\nShawn Morris -- Chief Executive Officer\n\nThanks for joining. We know you're busy today.\n\nRichard Close -- Canaccord Genuity -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Whit Mayo from SVB Securities. Your line is now open. Please ask your question.\n\nWhit Mayo -- SVB Leerink Partners -- Analyst\n\nHey. Thanks. Maybe just first on the two new full-risk contracts. How did those track versus expectations, what did MLR look like? I don't have your Q yet, but just maybe any early learnings, or observations now that you are sort of six months into standing up a full risk-bearing entity?\n\nShawn Morris -- Chief Executive Officer\n\nYeah. Thanks for the question. Yeah. Again, yeah, we're again, we're still really early into those contracts and we're taking a, I would say, a conservative approach in how we're recording things.\n\nSo at least today we recorded -- and again, you'll be able to see this in our Q that 100% of the revenue we've taken in, we've recorded expense again. We're recognizing zero care margin from the business so far. Really only have about four months of data was some tale out of 12. And so again, just sort of taking it pretty conservative at this point.\n\nBut again, I think we feel good about the business. And again, as we get more data from those programs, where I think, we're looking to see them take off.\n\nWhit Mayo -- SVB Leerink Partners -- Analyst\n\nYeah. Maybe just to follow up, are you finding any additional interest from existing affiliated groups today to explore these arrangements? I'm just sort of curious, like how we kind of think about 2023, 2024, and perhaps the penetration of new full-risk contracts. And I have one other follow-up, sorry.\n\nParth Mehrotra -- President and Chief Operating Officer\n\nYeah, it's Parth. So, look, I mean, at every point, very evaluating. What part of the book do we move into it, enhanced level of risk could be capitation, could be just enhancing the level of risk that we take without being capitated. And I think, that just goes by payer by payer, geography by geography, and medical group by medical group.\n\nWe're looking for good density in each market in our pools. And that's a discussion we continuously have with both providers as well, as well as our payer partners. So we're going through that discussion right now for 2023 and obviously, we will update. The one thing I would say is our criteria, as we've been very clear to take on more risk is always to ensure that at a minimum we're not economically and from an EBITDA standpoint, worse off and ideally we are doing it to enhance the level of EBITDA earnings and share savings.\n\nSo that's a fundamental criteria. We're not going to do it just to recognize top-line practice collections or revenue. We'll do it when it makes sense and when we think it is a good financial decision for our physicians as well as the payers and Privia.\n\nWhit Mayo -- SVB Leerink Partners -- Analyst\n\nThat makes sense. AR days grew two times faster than revenue. Can you kind of flesh out what's going on there? I presume some of that may be influenced by some of these capitated contracts, but I'm not sure.\n\nDavid Mountcastle -- Chief Financial Officer\n\nYeah. I would tell you, it's a combination of the capitated contracts. And if you want to think about how our shared savings accruals work. We're at Q2 we're at -- whatever, 18 months of accruals related to '21 because again, we keep looking at those.\n\nAnd then, as we look at '22, we put in additional accrual. So when we get, for example, MSSP, which we're expecting hopefully in Q3, maybe early Q4, you'll see a bunch of that receivable come down. But we're we kind of get to a high point on receivables especially related to shared savings because we've just got so much accrued in that number as of the end of Q2.\n\nWhit Mayo -- SVB Leerink Partners -- Analyst\n\nOK. So it's not really a bad number then. OK. All right.\n\nDavid Mountcastle -- Chief Financial Officer\n\nNo.\n\nWhit Mayo -- SVB Leerink Partners -- Analyst\n\nThanks a lot.\n\nShawn Morris -- Chief Executive Officer\n\nThanks, Whit.\n\nOperator\n\nYour next question comes from the line of Gary Taylor from Cowen. Your line is now open. Please ask your question.\n\nGary Taylor -- Cowen and Company -- Analyst\n\nHey. Good morning. I just want to ask a question about patient-attributed slides. Small picture question and a big picture one.\n\nThe small picture is just I think the ACO lines were down about 4,000 sequentially. We had seen a sequential decline there back in my model. So just wondering what that small change was. And what the bigger picture one is, sort of look at this quarter, I think gross practice collections are up north of 60%.\n\nProviders year over year, providers up like 32%, and attributed lives up 16%. I don't think that's a long-term growth algorithm. So I just wanted to see kind of -- as we think about modeling '23 and '24, and trying to hit that 20% long-term guidance on growth practice collections. I would imagine practice collection lies and providers are all tying a little closer together than we're seeing right now.\n\nSo just wanted to make sure I'm understanding that.\n\nParth Mehrotra -- President and Chief Operating Officer\n\nYeah. Thanks, Gary. It's Parth. So on the first question, there'll always be some quarter-over-quarter variability in the MSSP book.\n\nAs these are PPO kinds of lives. There's also some movement from two MA from the MSSP book as those patients can move. And then, the third factor could be if some patients in the first half just simply haven't come in from coming for their PCP visit. CMS classifies them as non-assignable and you can't count them in the period, but when that happens, you count them again.\n\nSo again, the movement is pretty small and I think that worries us. Again, our guidance range was pretty tight. And so I think that's kind of the short-term near-term question that you had. On the longer-term question, the model is, we add providers in existing, and then obviously, a new market, and the attribution then follows.\n\nSo California has a great example that the medical group that we partnered with Bass doesn't have a big value-based book today, not a lot of attribute lives, even though it's about 400 providers. So the mix of providers matters, and the market matters. But over time, that's a really good market to do a lot of value-based care as we know. And as we add more primary care providers in California, as the existing providers add more patients and attributed lives, the attribution follows the provider growth.\n\nThe third aspect then will be the level of shared savings and the profile of the contracts we get into. So even with the same attributed lives over the course of two, three, four, or five years, you can expect the level of shared savings to increase in the same program. And our MSSP book is a perfect example in the mid-Atlantic. If you look at the history over seven years, publicly available data with CMS, you can see we've grown both attribution, the level of shared savings, and the actual percentage of savings under the benchmark.\n\nSo you can see the value for life or the yield for life increases over time. And then obviously in the MA book, there's a much more pronounced revenue recognition when you move into capitation. And that's what you saw with about 25,000, 30,000 lives this year as we entered those contracts. So it's a multi-pronged answer to bridging top line practice collections to the provider and attribution, but that's the algorithm essentially.\n\nAnd again, that plays out over multiple years. So it's tough to pinpoint what happens in one particular year. A lot of the growth in California would likely come from the subsequent years, even though we entered the market last year. Hopefully, that helps.\n\nGary Taylor -- Cowen and Company -- Analyst\n\nIt does. Thank you.\n\nOperator\n\nFor our next question. It comes from the line of David Larsen from BTIG. Your line is now open. Please ask your question.\n\nDavid Larsen -- BTIG -- Analyst\n\nHi. Congratulations on another very good quarter. When we think about 2023, can you maybe talk a little bit about some of your large largest groups? I mean, how are satisfaction levels? What percentage of revenue do some of your largest groups make up? And is there any risk that some of those large groups that you're either in the process of implementing, or implementing now, may, for whatever reason switch off of your platform due to like M&A activity or anything else? Just any color around that would be very helpful. Thank you.\n\nParth Mehrotra -- President and Chief Operating Officer\n\nThanks, David. It's Parth. As we showed in Slide 5, our satisfaction levels are pretty high, one of the highest we've seen since the beginning. Patient NPS is 84, provider NPS is 57.\n\nThey are tough graders, but 57 is pretty high, no matter what benchmark you use. Our attrition is at a record low again, close to a record low across all markets, give or take. And that just -- is a great metric for us to crack internally. We don't disclose it externally, but -- so all of those things point to really good satisfaction.\n\nUltimately our value proposition is very ROI driven. The providers are making more take-home pay at the end of the day and having pretty robust patient panels. We're moving them into value-based care and adding a lot of value to their overall practice in the functioning of the practice and efficiency, productivity, and so on and so forth. So we're not worried about M&A activity and folks buying out our groups.\n\nWe don't have a very big concentration. We had the one group that had left us prior to us going public in 2020 that we had disclosed. And again, that was if somebody wants to come in and pay a big check, we've said, we're not going to chase it. But again, our practices are joining us in a very self-selected manner.\n\nThey are vehemently independent. And our health system partners are also very progressive in the way that they are thinking about partnerships with us. So that gives us a very diversified book. And as we grow, there's no really no single practice that really -- we have any concentration risk from that perspective.\n\nShawn Morris -- Chief Executive Officer\n\nHey, David, this is Shawn. I will add a little color. We've -- over the years, we've talked a lot about physicians are the customers of Privia in their care centers. And we strive to -- when you -- in any business when your customers are referring you other potential customers be that in part through the how we grow that same-store growth, additional providers in existing markets, the addition of doctors, and existing care centers, and even growing new markets.\n\nYou're on to something special. You can always improve, but you've headed in the right direction. With that over half of our additions come from doctors referring colleagues to Privia. And I mean, if you think about it and somebody asked a question in the last quarter about how does the inflation factors and is it kind of different? Will it -- what do you think from a driving business perspective? And any time there are, I guess, tough things going on in the economy people are looking for partners and solutions to help.\n\nAnd we believe that I mean, we've seen it through COVID and we believe that's going to continue to play out in the next few years as the economy kind of gets back on its feet.\n\nDavid Larsen -- BTIG -- Analyst\n\nGreat. Thanks very much. And then one more quick follow-up, for the cap revenue. It sounds like you have four months of data.\n\nI like how you're not assuming any margin there. What's the risk of a loss, though? How do you know you're being sort of conservative enough with that four months of data that you have? Is that within budget or is it over budget? What is that telling you? Thanks.\n\nParth Mehrotra -- President and Chief Operating Officer\n\nYeah, it's Parth. Look, I mean, when you and the risk business, we've said very clearly it's called risk for a reason, that there is always a potential for loss, there's a potential to have good savings. Generically speaking, again, we're not going to go into any particular contracts or what the data are saying for four months and so on, so forth. Our view has been you enter into these arrangements with the hope that you will do better than when you would just take an upside-only risk.\n\nAnd you're not on the downside on any hope. So our hope is that we underwrite these properly. That there is not much potential for downside, but anomalies can happen, and events can happen that can impact the book again year over year. But from a long-term perspective, we feel pretty good as we are moving into these contracts that we can perform in them.\n\nAnd again the diversity of our book also prevents any one particular contract from really impacting the P&L in a big way. And I think we're differentiated in that respect given we are taking -- we're doing value-based care across commercial MSSP, MA, and Medicaid, and capitation is just part of the business.\n\nDavid Larsen -- BTIG -- Analyst\n\nOK. Congrats on a good quarter. Thank you.\n\nShawn Morris -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nFor your next question, it comes from the line of Taji Phillips from Jefferies. Your line is now open. Please ask your question.\n\nTaji Phillips -- Jefferies -- Analyst\n\nHi. Good morning. This is Taji on for Brian and thanks for taking my question today. So first to start, I'm just curious, can you give some color on the factors that drove the beat and specifically clarify operational metrics that came in higher than your original expectations?\n\nParth Mehrotra -- President and Chief Operating Officer\n\nYes, sure. It's Parth. Look, it was pretty broad-based, which is what we like to see. The fee for service book performed ahead of our expectations, and the utilization trends were ahead of our expectations, as we just stated.\n\nOn the value-based side, again, we are -- our accruals reflect all the information we have and that's been ahead of our expectations, so that's reflected there. And then that outperformance is reflected down the P&L, given the scalability of the business and the inherent operating leverage. So as we have been meaningfully profitable in free cash flow positive and we're managing the expense base pretty prudently, investing where we need to. And some of this outperformance, if it happens translates nicely into bottom-line metrics.\n\nSo it was fairly broad-based all across. And that shows our confidence, we paid all our debt from that, and we feel pretty confident in the future here.\n\nTaji Phillips -- Jefferies -- Analyst\n\nGreat. Thanks, Parth. And then just one more question. I was thinking about your specialty offering.\n\nCan you provide some detail on patient demand or specialties that are driving the highest patient demand or healthcare utilization and how that's informing -- how you target additional providers for inclusion in your network?\n\nParth Mehrotra -- President and Chief Operating Officer\n\nSure. So, look, obviously, as Shawn stated in his prepared remarks that were fairly broad-based with 51 odd specialties on the platform today. You know the one differentiation is our specialists are folks that typically take care of the chronically ill. We're not going for surgical specialties specifically we do have some.\n\nAnd so that is a good reflection of the medical groups. We are trying to create very primary care OB speed focused and then surround them with the right specialists. In some markets, the concentration going to be different with our anchor partner, as is the case in Florida and with Bass in California. But over time, as those medical groups grow, the hope is that that makes normalize, and it's very primary care-focused.\n\nSo that's point one. And again, we received early realization all around. We have pretty good in-network referrals with our high-quality lower-cost specialists and that benefits our value-based book. And I think that differentiates us to create a pretty holistic medical group that can perform at a pretty high level across both fee-for-service and value-based arrangements.\n\nTaji Phillips -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\nFor your next question, it comes from the line of Sandy Draper from Guggenheim Partners. Sandy, your line is now open. Please ask your question.\n\nSandy Draper -- Guggenheim Partners -- Analyst\n\nThanks very much. Actually, all my questions have been asked and answered, so I'll pass it back to the operator.\n\nShawn Morris -- Chief Executive Officer\n\nThank you, Sandy. Appreciate it.\n\nOperator\n\nFor your next question, it comes from the line of Jessica Tassan from PSC. Your line is now open. Please ask your question.\n\nJessica Tassan -- Piper Sandler -- Analyst\n\nHi. Thanks so much for taking the question. So I guess just my first one would be, I know you guys said you're booking the full risk lives at 0% care margin, but then also that you wouldn't enter these contracts if they were going to make you less well off. So just over what time frame --\n\nParth Mehrotra -- President and Chief Operating Officer\n\nYeah. Thanks for the question, Jess. Look, we look at data, and, as and when we feel comfortable that we see the right trends, we'll -- we look for it appropriately. You should expect to see that happen over the next few quarters.\n\nthe data does come with a lag. And it's not almost immediate. So this could flow into next year as well. And that's why you do have prior period adjustments in this business when you're taking risks and they could be positive.\n\nThey could be negative in certain cases, and that's why it's called risk. But again, we hope we can manage the book pretty well. And we've entered into these to do well for both our payers as well as our physicians and Privia. So hopefully over time, you'll see that trend.\n\nJessica Tassan -- Piper Sandler -- Analyst\n\nGot it. So then just one more on 2022, if the '22 full cap performance does prove to be better than 0% care margin, what is kind of the latest possible date that you'd expect to reconcile that and the upside on the P&L? And then just if you could remind us what was capitated revenue in the quarter. And that's it for me. Thanks.\n\nParth Mehrotra -- President and Chief Operating Officer\n\nYeah, sure. So in the first half, part of the question is our guidance assumes the existing accrual that we would book medical expense that equals capitated revenue. And that's what's reflected in the guidance we are giving today. If it is better or worse, we'll update guidance appropriately and that could happen again in subsequent quarters this year.\n\nSo in Q3 or Q4, when we report Q4 or early next year or it could happen afterward if there are any appropriate adjustments. So again, you'll expect to see that as we close out the year and go into next year. And then David can take the next --\n\nDavid Mountcastle -- Chief Financial Officer\n\nYeah. And as you'll see in our 10-Q when it gets published later today cap data revenue was $57.7 million for the quarter and $106.1 million for the first six months. Now value-based care equals about 29.6% of our total GAAP revenue, up from 12.5% last year, which we'll see in the Q as well.\n\nJessica Tassan -- Piper Sandler -- Analyst\n\nGot it. And then just quickly, sorry, is the sequential increase due to capitated rates? Or is it due to just an increasing population of lives under full caps?\n\nParth Mehrotra -- President and Chief Operating Officer\n\nYeah, it's a combination of all of those. We entered one additional capitated contract from what we announced in our press release earlier in the year. So it's increased in lives, as it's the nature of the capitated arrangement and the top line that we can recognize on a PMPM basis. And then it's also reflected in shared savings across the rest of the book in commercial and MSSP.\n\nJessica Tassan -- Piper Sandler -- Analyst\n\nGot it. Thanks so much and congrats on the quarter.\n\nParth Mehrotra -- President and Chief Operating Officer\n\nThank you, Jess.\n\nShawn Morris -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour last question comes from the line of Ryan Daniels from William Blair. Ryan, your line is now open. Please ask your question.\n\nUnknown speaker\n\nHey. Good morning, guys. This is Jackson on for Ryan Daniels. Congrats on a solid quarter and thanks for taking my last question here.\n\nSo my phone cut out, so apologies if you address this already, but just looking at your total practice collections for the first half of the year, it looks like we're already past the halfway point for the high end of your guidance range for I think it's 2,200. So just curious if you can provide any color on how we should kind of think about the quarterly cadence, as it relates to the back half of the year? And if we should anticipate any sequential step-downs in the third or fourth quarter? Just any update would be great. Thanks.\n\nParth Mehrotra -- President and Chief Operating Officer\n\nYeah, sure. Jack, I think we did address that one, but no worries if your line got cut off. So look, again, we don't expect any deviations from the trend we saw last year. We're being prudent.\n\nIt's tough to predict ambulatory utilization, as we've stated. And so our guidance assumes that there's some normalization of that trend. It's been running ahead of our expectations. If the trend continues, then we'll obviously update the guidance in three months or so.\n\nBut again, we don't see any anomalies from what we've experienced previously.\n\nUnknown speaker\n\nGotcha. Thanks, guys.\n\nShawn Morris -- Chief Executive Officer\n\nThanks.\n\nParth Mehrotra -- President and Chief Operating Officer\n\nThanks.\n\nOperator\n\nThere are no further questions at this time. I would like to turn the conference back to Mr. Shawn Morris, chief executive officer, for closing remarks.\n\nShawn Morris -- Chief Executive Officer\n\nAs always, thank you for listening to our call. Privia Health supports all providers and all patients through all reimbursement models. Our capital-efficient and proven integrated care delivery model, as always, is already running at scale. We have significant momentum in the physician labor market and we look forward to continuing to execute at a high level through '22 and beyond.\n\nWe appreciate your continued interest in support of our company and we look forward to speaking to you again and wish you the best. Enjoy the day and the rest of the week. Thanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRobert Borchert -- Senior Vice President, Investor and Corporate Communications\n\nShawn Morris -- Chief Executive Officer\n\nDavid Mountcastle -- Chief Financial Officer\n\nJoshua Raskin -- Nephron Research -- Analyst\n\nParth Mehrotra -- President and Chief Operating Officer\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nAdam Ron -- Bank of America Merrill Lynch -- Analyst\n\nRichard Close -- Canaccord Genuity -- Analyst\n\nWhit Mayo -- SVB Leerink Partners -- Analyst\n\nGary Taylor -- Cowen and Company -- Analyst\n\nDavid Larsen -- BTIG -- Analyst\n\nTaji Phillips -- Jefferies -- Analyst\n\nSandy Draper -- Guggenheim Partners -- Analyst\n\nJessica Tassan -- Piper Sandler -- Analyst\n\nUnknown speaker\n\nMore PRVA analysis\n\nAll earnings call transcripts"
}