{
  "companyName": "John Wiley & Sons Inc.",
  "companyTicker": "WLY",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/07/john-wiley-sons-inc-wly-q1-2023-earnings-call-tran/",
  "content": "John Wiley & Sons Inc. (NYSE: WLY)\nQ1 2023 Earnings Call\nSep 07, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning, my name is Rob, and I will be your conference operator today. At this time I would like to welcome everyone to the Wiley's first quarter 2023 earnings conference call. All lines have been placed on mute to prevent any background noise. [Operator instructions] Thank you.\n\nBrian Campbell, Wiley's vice president of investor relations, you may begin your conference.\n\nBrian Campbell -- Vice President, Investor Relations\n\nThank you, and hello, everyone. I'm joined by Brian Napack, Wiley's president and CEO; and Christina van Tassell, executive vice president and CFO. A few reminders to start. The call is being recorded and may include forward-looking statements.\n\nYou shouldn't rely on these statements as actual results may differ materially and are subject to factors discussed in our SEC filings. The company does not undertake any obligations to update or revise forward-looking statements to reflect subsequent events or circumstances. Also, Wiley provides non-GAAP measures as a supplement to evaluate underlying operating profitability and performance trends. These measures do not have standardized meanings prescribed by U.S.\n\nGAAP. And therefore, may not be comparable to similar measures used by other companies, nor should they be viewed as alternatives to measures under GAAP. Unless otherwise noted, we will refer to non-GAAP metrics on the call, and variances are on a year-over-year basis and will exclude the impact of currency. After the call, a copy of the presentation and a transcript and playback of the webcast will be available on our Investor Relations web page at investors.wiley.com.\n\nI'll now turn the call over to Brian Napack.\n\nBrian Napack -- President and Chief Executive Officer\n\nGood morning everyone, and welcome to Wiley's Q1 earnings call. Before I get to our Q1 results, I want to touch on a couple of foundational topics. Wiley like all companies is operating today in an uncertain global economy and continues to pose a variety of interesting and novel challenges. Despite this, our underlying markets remain strong and opportunity rich, and we are successfully executing our focus strategy.\n\nThe evidence is in our current momentum. Wiley performs well through challenging economic cycles and periods of disruption. It does this for two primary reasons. First, scientific research is indispensable to economic progress and thus global spending on it continues through the cycles.\n\nSecond, higher education enrollment tends to be countercyclical as workers react to soft labor markets by investing in themselves and their futures. Because of these factors, Wiley can take the long view and it is benefiting from this today. Our core strengths serve us well in good times and bad. These strengths include, must have brands and an ability to create and distribute world-class content and tech-enabled services, all of which move the needle for researchers, learners, and leaders who use new knowledge and skills to achieve their objectives.\n\nAnd all of this is supported by consistently strong Wiley balance sheet and cash flow. At Wiley we're grounded in 215 years of serving the demand for scientific research and career-connected education, we continue to use this experience to find new ways to meet the world's ever increasing need for knowledge and knowledge services. Today's Wiley is a digital company with 83% of our revenue coming from digital products, and 58% of our revenue is recurring. Over the past few years, we've found renewed growth by investing in transformative approaches to research and education that drive real-world outcomes and these approaches have opened up new addressable opportunity for us worldwide.\n\nFinally, our mission and purpose dictate that we are and must always be a positive force for a more sustainable world, both through our work and as a corporate citizen. To that end, we will release our commitment to net-zero environmental targets later this year. Let's turn to the key takeaways for the quarter. Revenue growth was driven by strength in the targeted growth areas that we have been talking about consistently for some time.\n\nThese more than offset cyclical declines in our enrollment dependent lines. Significantly our earnings performance overall was largely as expected in Q1. As with other companies, we are seeing higher employment costs and increased T&E expenses resulting from the resumption of in-person of travel and activity. Earnings were also impacted by continued targeted investment in our key growth areas, Research publishing, Research solutions, and Corporate talent development.\n\nResearch publishing grew nicely due to our aggressive open research strategy in which we're publishing more quality research with unit driven PxQ economics. And we're doing so faster and ever more efficiently with industry-leading automation. This is what the research community wants, and in fact, this is what the research ecosystem needs. The foundation of our competitive advantage here remains the same.\n\nThe enduring draw of our 1,900 journal brands. Research solutions is growing quickly, fueled by the rapid expansion of our network of clients and partners. Research solutions is a terrific compliment to our Research publishing business. And we saw this in the quarter as our pipeline of multi-solution clients grew across our client network.\n\nFinally, Corporate talent development is growing by strong double digits. As we continue to help the world's leading corporations solve, perhaps their biggest pain point, a persistence shortage of talent with the critical technology and digital business skills that they need to succeed. In academic learning, we continue to operate in a challenging enrollment cycle. The labor market remains and usually strong despite recession fears that many students are presently forgoing school for opportunities in the workforce.\n\nAs a result, the overall U.S. spring enrollment was down nearly 5% and summer enrollment in our programs was down 8%. For the remainder of the year, we expect better top-line performance compared to Q1 driven by research. We also see restructuring savings kicking in during the latter part of the year.\n\nTherefore we are reaffirming our fiscal 2023 guidance, which Christina will speak to. I'm also happy to point out that during Q1, we raised our quarterly dividend for the 29th consecutive year. This is something that very few companies can tell. Let's review our overall performance in more detail.\n\nChristina will speak to our segment performance later in the presentation, as usual, all variances exclude currency impact. Revenue for the quarter grew 4% or 2% organically. As I said, growth was driven by Research publishing, Research solutions, Corporate talent development, and Corporate Training. These offset at 12% decline in University services, which was mainly due to the cyclical enrollment challenges that I've been talking about.\n\nAlso contributing to the revenue performance in University services what are -- was our work to extend our university client relationships. Specifically, in certain renewals, we lowered tuition share as we work collaboratively with our clients to ensure long-term mutually advantageous relationships. Adjusted EBITDA declined 34%, in line with our expectations for the quarter. Investments in research, higher employment costs, higher T&E spend related to the resumption of in-person activities and market-related challenges in University services all contributed to our Q1 performance.\n\nAdjusted EPS declined 60% due to the adjusted EBITDA performance, as well as lower pension income and higher interest expense. Adjusted EPS was also in line with expectations. As I mentioned, our Q1 financial results are not indicative of how we see the rest of the year playing out. Christina will now take you through our segment financial performance, our financial position, operational excellence initiatives, and our outlook.\n\nAfterwards, I'll pick it back up to discuss the recent OSTP guidance on federally funded research, and then how we're executing on our fiscal 2023 commitments.\n\nChristina van Tassell -- Chief Financial Officer\n\nThank you, Brian, and good morning everyone. As always I'll start with Research. Research was up 4% this quarter or 2% organically. As we discussed in June, we changed our segment reporting this quarter to Research publishing and Research solutions.\n\nSolutions replaces the Research platform reporting line and includes platforms, society services, and corporate solutions. Research publishing revenue rose 2% this quarter driven by continued strong growth in open-access publishing. Demand to publish remains robust. Article submissions were up 7%, although our output was down year over year due to variances in publication timing.\n\nFor the full year, we expect steady growth in output to resume. Our Hindawi acquisition continues to perform of our own high expectations with rapid publishing growth and exceptional margins. As a reminder, Hindawi solidified our leadership position in open research with its fast-growing collection of 200 plus journals and a highly efficient publishing platform. Research solutions rose 17% in the quarter driven by recent acquisitions, namely J&J Editorial, Knowledge Unlatched, and eJournalPress, as well as organic growth from platform services for societies and career centers for R&D centric companies.\n\nAdjusted EBITDA in research declined 9% due to investments in both Publishing and Solutions. Higher employment costs and increased T&E expense compared to the prior-year COVID environment. For the remainder of the year, we see growth in article output due to strong demand to publish and continued progress in expanding our client relationships and solutions. All that to say is, we remain fully confident in our full year revenue and EBITDA outlook.\n\nNow onto APL, which serves the university and corporate markets with content and courseware. Revenue in this segment was down 1% in the seasonally small quarter with professional learning flat and education publishing down 2%. Wiley is delivering double-digit growth in corporate training as companies expand their investment in leadership and team development. We are encouraged by the success we're seeing both in in-person and virtual training.\n\nGrowth here, offset moderate declines in professional publishing and corporate e-learning. Ed Publishing saw print declines modestly outpaced growth in digital content and courseware. Although seasonally this is our smallest quarter. As for enrollment, it's too early to give a proper read on fall numbers, early industry projections signal a more modest decline compared to the 4.7% decline last spring.\n\nThis would be good news as we normalize following the COVID bump and snapback effect. Adjusted EBITDA in APL declined 30% this quarter due to the timing of marketing and technology spending, higher T&E expense, and higher employee costs. Given seasonality and other timing issues, APL's Q1 EBITDA performance is not indicative of our full year expectations. Let's turn to Education services; we saw overall revenue growth of 11% driven by Talent Development growth of 76%.\n\nWe are capitalizing on this massive market opportunity by signing up new Fortune 500 clients doubling our tech placements and growing rapidly in regions around the world. Our investments in client expansion are paying off and when has become a major long-term growth area for Wiley. University services decline 12% or 17% organically driven by ongoing enrollment headwinds and lower revenue share in some recent long-term partner renewals. As Brian mentioned, we are working with our strategic partners to ensure a strong value proposition that will lead to long-term mutually beneficial relationships.\n\nOptimizing our cost structure and maintaining flexibility we ensure good returns. Adjusted EBITDA, with a loss this quarter mainly, due to revenue declines in University services and growth investments in Talent Development. EBITDA was further impacted by seasonality as Q1 is typically our lowest profit quarter in University services. All that to say, Q1 is not an adequate read of our full year performance for ed services.\n\nHowever, we do expect some EBITDA margin pressure this year due to the dampen revenue outlook in that University services. Well online education remains challenged by countercyclical enrollment declines; we foresee long-term underlying growth in demand for online degrees. Students and professionals will always need to differentiate themselves with credentialing and certification delivered online and on campus. And given how challenging and expensive it is to find the right student and manage these programs, many institutions rely on outside partners.\n\nThat said we anticipate enrollment headwinds over the near term and will look to optimize our cost structure to mitigate any revenue pressure. Our free cash flow for the quarter was lower by $6 million compared to prior year with lower cash earnings, partially offset by lower annual incentive compensation payments for our fiscal 2022 performance. As a reminder, our cash flow is normally a use in the first half of the year due to the timing of collections for journal subscriptions, which are concentrated in the third and fourth quarters. Capex was $24 million for the quarter in line with prior year and there were no acquisitions of note this quarter.\n\nWe remain active on the M&A front as we focus on our key growth areas, which are expanding our research journal portfolio, Research solutions offerings, and Corporate talent development capabilities. Our annual cash flow complements a healthy balance sheet with more than $104 million of cash on hand and undrawn revolving credit capacity of $532 million at quarter end. Net debt-to-EBITDA ratio was 2.1 at the end of July, compared with 2.0 in the prior year. Finally, we allocated $29 million to dividends in share repurchases this quarter up from $27 million in the prior year.\n\nAs Brian noted, we raised our dividend payout for the 29th consecutive year, and current dividend yields around 3%. This dividend streak is a testament to our consistent cash flow over time and our focus on rewarding long-term shareholders. During the quarter, we acquired 212,000 shares at an average cost per share of approximately $47. Total spend on repurchases was $10 million.\n\nWe are highly focused on operational excellence. We are prioritizing investments in our most advantageous gross opportunities, and we're driving toward future margin expansion through simplification and cost reduction. On that front, we recorded a $22 million restructuring charge in Q1 related to targeted workforce reduction and continued real estate optimization. The program targets approximately $35 million of run-rate savings with approximately $25 million to be realized in fiscal year 2023.\n\nThese savings are reflected in our 2023 outlook and will be recognized in the back half of the year. We've made significant progress again, this quarter in reducing our office footprint with 28% reductions since spring 2020. This is up from 18% at the end of last quarter, we will identify additional cost-saving opportunities throughout the year. As we actively manage our portfolio, simplify operations and automate workflows.\n\nNow let's turn to our full year outlook. Despite the unusual, but largely anticipated first quarter, our leading indicators confirm our initial revenue and profit projections. On revenue, we expect mid-single-digit growth at constant currency driven by Research and Corporate talent development. Adjusted EBITDA constant currency is expected to be in the range of $425 million to $450 million.\n\nSolid revenue growth and restructuring savings will be partially offset by targeted investments in Research publishing, Research solutions, and Corporate talent development, as well as higher employment costs overall. Adjusted EPS at constant currency is expected to be in the range of $3.70 to $4.05. In addition to targeted investments and wage inflation, we expect higher interest expense, higher tax expense, and lower pension income. As noted on our last call, these three items are expected to account for $0.35 of additional adverse impact.\n\nOur adjusted effective tax rate is expected to rise this year from 20% to between 22% and 23%. This is primarily due to a less favorable mix of earnings by country and an increase in the U.K. statutory rate. In terms of lower pension income, it's important to note that our pension has been frozen since 2015 and we are above 90% funded.\n\nFree cash flow is expected to be in the range of $210 million to $235 million. Positive cash earnings and lower incentive payouts for fiscal 2022 performance are expected to be offset by higher cash taxes, interest, and capex. Capex of $115 million to $125 million, compares to $116 million in the prior year. Capital investment will be focused on platform and product development in our core growth areas of Research and Corporate talent development.\n\nIn terms of our outlook, including FX, currency remains headwind at the revenue line, but since most of our global businesses denominated in U.S. dollars and given our large expense base in Europe, we are largely self-hedged from an earnings and cash flow standpoint. And with that, I'll pass it back to Brian.\n\nBrian Napack -- President and Chief Executive Officer\n\nThank you, Christina. I want to talk now about the execution commitments we made for fiscal 2023 and how we're doing against them at the end of Q1. You recall that we laid out eight commitments at the start of the year foreign research and foreign education. But before I go over these, I want to spend a few moments on a recent development in U.S.\n\nscience research policy. Two weeks ago, the U.S. Office of Science and Technology Policy, which is a department within the White House issued guidance that calls for U.S. Federal agencies to ensure that all new federally funded research is open and freely available starting in 2026, if fully enacted the implication would be that all U.S.\n\nfederally funded research published by Wiley and others from that day forward would need to reside outside of a subscription payoff. While we were surprised by the timing of this statement and are still evaluating its implications, we are not at all unprepared, simply stated the new guidance is fully aligned with our stated strategy and mission and is supported by the strong momentum that we have in open Research publishing. We've been working for years with the OSTP and other stakeholders around the world to support the transition, to open research. As some of you may know, we saw similar guidance in Europe, a while back and reacted affirmatively.\n\nAnd today we are greatly benefiting by executing against our shared objective of unlocking access to scientific research and improving the efficiency of peer review and publication. Wiley has led this global transition to OA through our robust OA publishing program and our groundbreaking transformational agreements. We expanded our OA leadership position with the acquisition of Hindawi in fiscal 2021 and are further expanding it with the acceleration of Research solutions. In the past three years alone, we drove OA share of our Research publishing revenue from less than 6% to approximately 33%.\n\nAnd this number continues to increase rapidly as our multi-year transformational agreements stake hold. For reference less than 10% of our published articles today are funded by U.S. Federal Department impacted by this policy ship. And a third of those articles are already OA.\n\nThe OA share will continue to accelerate through 2026. All to say, while we're still evaluating the recent OSTP guidance, we do not anticipate that it will have a material financial impact. OK. Turning now to our fiscal 2023 commitments in research and how we performed on them in Q1.\n\nAt the start of the year, we said, we would publish more to meet global demand, especially in open access. We would establish more transformational read and publishing agreements worldwide. We would scale our Research solutions offerings, and we would streamline our publishing operations. On publishing more, as Christina mentioned, we grew article submissions by 7% and OA output by 25%.\n\nOverall publishing output was down year on year, but we continue to expect steady growth for the fiscal year. As you know, scientific and technical research is powered by global R&D spend, which is expected to grow 5% to nearly $2.5 trillion this year. We announced three major transformational agreements this quarter, including consortia in France, representing 130 institutions and Italy representing 68 institutions. And I'm proud to say that we announced our first Read and Publish agreement in Latin America, UNAM in Mexico, which is the largest university in the region.\n\nThe pipeline remains strong for our multi-year transformational agreements. These deals are great for our large customers, and they're great for us as they drive incremental publishing volume and thus revenue in an increasingly open access economy. As you know, in open access revenue is a direct function of the number of articles published and the price we charge for publishing in one of our journals. During the quarter, we continue to see strong momentum in Research solutions, to refresh Research solutions delivers the critical platforms and tech-enabled services that allow publishers, corporations, and other stakeholders to succeed in the open research economy.\n\nOur platforms make processing, publishing, and consuming research content easier, quicker, and more efficient. And our knowledge network enables corporations to reach 10 million plus researchers and leverage 170 million plus monthly impressions. Increasingly we're creating new revenue models for Wiley and our clients by leveraging these platforms and our network. For example, our career centers help major societies like the AAAS generate new revenue by connecting people with jobs and help pharmaceutical companies like Pfizer, fill critical talent gaps.\n\nOur new product offerings like Knowledge Hubs and virtual events allow R&D intensive companies like Eli Lilly and Perkin Elmer to reach and activate valuable audiences. During the quarter, we signed six new solutions partners, including the American Cancer Society, the National Park Service, and Eli Lilly, and we expanded four other partnerships with additional services and we are continuing to drive organic growth through upsell and cross-sell opportunities with our existing 450 society and corporate partners. To give you a sense of this opportunity. So far only 16% of our partners subscribe to more than one service and only 4% subscribe to more than two.\n\nFinally, we are streamlining operations in research, particularly the referral of rejected articles from one Wiley journal to another. We've been discussing this process for some time, we call it the cascade. As a reminder, Wiley does not publish 70% of the articles we've received. Mostly this is due to improper fit between a submitted manuscript and the first journal to which it is submitted.\n\nOur goal is to find these articles, another home within Wiley's portfolio and we do this through an intelligent transfer and referral process. Notably, 65% of rejected authors are now offered another Wiley option to publish up from 53% at year end. It will take time to fully capitalize on this opportunity across our 1,900 journal portfolio, but we're very encouraged by the progress so far. So as you can see, Q1 was a very solid quarter of delivery against our stated commitments in Research.\n\nLet's turn now to our progress in executing on our fiscal 2023 commitments in career-connected education. Here, we're working to expand our corporate and university client base to drive growth in our differentiated course we're offerings and to gain operating efficiency. On the client development front, Wiley signed another three large global clients this quarter to Corporate talent development agreements. This group includes our first two multinationals in the insurance sector and another one in financial services.\n\nOur success in growing the client base resulted in employee placement growth of a 97% year on year with notable expansion in Europe. Looking ahead, the new client pipeline is very strong and it spans multiple industry verticals. We're also having conversations with existing corporate clients to add reskilling services to our new employee training services. Critically, we're seeing strong demand for talent development services, even in the face of economic uncertainty.\n\nThis speaks to the growing need for tech talent development worldwide and the success of our unique and effective models. On the client development front and University services, we renewed three long-term partnerships determines ranging from five years to nine years. Our partner count declined this quarter by two to 66. Although, we continue to see a healthy pipeline of potential new partners.\n\nWe also signed 47 new degree programs within the existing partner base. This is well ahead of plan and speaks to the importance of Wiley's services to its university partners especially in these difficult times. We remain focused on delivering differentiated courseware that moves the needle for learners and workers, where we have focus to date we are seeing exceptional growth. zyBooks revenue for example, was up 27% in the quarter.\n\nAnd the team signed 18 new institutions in the spring semester, bringing us to a total of 827 zyBooks institutions. We are replicating this success across the publishing program and for example, our expanding zyBooks into other high demand, courseware disciplines. Most recently engineering. In science, Knewton Alta courseware was named the best science instructional solution as part of the prestigious Software & Information Industry Association awards.\n\nOn the efficiency front, our work is preceding a pace. We are driving talent development toward meaningful profit contribution as we scale through redesign and automated processes, and we are improving efficiency in education publishing through platform upgrades and process improvement. So overall we are executing well on our fiscal 2023 commitments in education, despite the cyclical enrollment challenges. So let me summarize some key takeaways for today.\n\nFirst, we're delivering solid organic revenue growth through our clearly identified growth strategies. Our investment and Research publishing, Research solutions, and Corporate talent development are paying off. Our growth strategies are working and our markets remain essential, vibrant, and recession tolerance. The consistent execution of our research strategy over the past few years, rejuvenated the business, materially improving our growth profile while driving continued strong margins in cash generation.\n\nWe expect this positive trajectory to continue. The execution of our high potential career connected education strategy most notably in Corporate talent development is also working as revenue continues to grow by strong double-digits. This has increased the size of Wiley's Blue Ocean growth opportunity and our profit potential. Of course, not everything is perfect as is evident in the effect that cyclical declines in higher ed enrollment are having on revenue growth in our university-focused offerings.\n\nWe do expect that to correct over time as typical countercyclical patterns resume following this unusual enrollment cycle. As we always say, the world is demanding and continues to demand more and better post-secondary education as a core engine of economic advancement. As a blue chip provider of essential academic services and courseware in some of the most in demand subjects and career areas, we continue to see good market opportunity and cash flow potential in the long-term, despite current growth challenges. As Christina emphasized, we believe that a simpler Wiley is a better Wiley.\n\nThus, we continue to streamline operations this year and are delivering meaningful efficiency gains, and we made good underlying progress in Q1. Our goal is clear to increase profitability and cash flow beyond fiscal 2023, while still powering our proven growth strategies. To that end, we will continue to sharply focus investments on profitable growth initiatives in Research publishing, Research solutions, and Corporate talent development. Our consistently strong balance sheet and cash flow will enable us to reinvest in this core and strategically acquire while also rewarding long-term shareholders.\n\nAs always our strategic planning cycle begins in the fall. It continues through the winter as we finalize long-range plans. And so we look forward to sharing these plans and our outlook with you at an April Investor Day. My gratitude goes out to our Wiley colleagues for their continued achievements this quarter.\n\nI want to thank them for their hard work and enthusiasm in advancing our mission and their continued support of many humanitarian causes in their communities and around the world. And I will now open the call up to any questions\n\nOperator\n\n[Operator instructions] Your first question comes from line of Daniel Moore from CJS Securities. Your line is open.\n\nDaniel Moore -- CJS Securities -- Analyst\n\nThank you. And thank you and good morning, Brian and Christina. Thanks for taking the questions and for all the color. Obviously a lot of moving parts this quarter, so greatly appreciate it.\n\nAnd I'll probably ask a few extra because there's a few topics to discuss, but starting with research, which is, it remains very solid and robust 4% growth X currency kind of low single-digit in publishing and strong double in solutions. Is that generally how you see the remainder of the year playing out?\n\nBrian Napack -- President and Chief Executive Officer\n\nYeah, Dan. Well, first of all, thanks for the questions. It's always good to have you on the call. We are, we feel very good about where we stand in Research publishing and we are sticking to our belief that we are in a cycle where we are seeing positive momentum in both Research publishing and in our OA and in our partner solutions.\n\nSo from the perspective of Research publishing, I would say that you can continue to see our growth as we have stated grow significantly in the area of submissions we're seeing good upper single-digit growth in the submissions category now, and that leads to an even higher level now of acceptances, which is what you want to see the submissions turn into acceptances. And that's at an above 10% level now, which is terrific. And that should turn translate into our publishing volume and as you know our publishing volume leads to our revenue. So we don't provide sub-segment guidance as you know, but we're feeling very good about the outlook for the balance of the year in Research publishing.\n\nFrom a Research solutions perspective, the momentum is very good. We're signing up a significant number of new clients. And as I stated earlier, in my remarks, we're seeing really very good uptake on our effort to upsell and cross-sell these essential solutions in those areas. So yes, we're feeling really good about the momentum that we're seeing across research and we expect that to continue if not accelerate for the balance of the year.\n\nDaniel Moore -- CJS Securities -- Analyst\n\nSuper helpful switch gears to ed services, specifically start with University services. Just talk a little bit about maybe the incremental headwinds, and I think you mentioned you'd lowered tuition share at a certain partners any color on, what percentage of your programs that covers and it, would you expect that to extend to other partners as well?\n\nBrian Napack -- President and Chief Executive Officer\n\nYes. So we have to think about this business in two ways. One is as a long-term opportunity; and two as the component of our value proposition as we deliver it to our clients. And so if we think about the long-term, we continue to feel very good about the potential of our University services businesses as university's transition to compete in a very competitive world and to deliver on the increasing demand for career-connected education and for online education.\n\nSo we feel really good as a gold standard provider that we're going to be there for our university partners and continue to help them and that will translate into continued growth and profitability for the segment. As we think about, so from a long-term perspective, we feel very good. As we think about the shorter-term or secular or cyclical issues going on in that business, we have three basic characteristics. The first one is the overall enrollment environment.\n\nAnd what we're seeing in enrollment is that at this stage in the cycle we've seen declines across all enrollment of all universities. And that has been significant over the last couple of years, you saw 5% decline followed by a 4% decline. This fall, we're starting to see enrollment decline that is actually ameliorated to the point where it's just down a little bit, maybe 1% for the year. And so as we look ahead, we should benefit from that in our programs, which tend to be aligned with the most in demand categories of degrees and or certifications going forward.\n\nSo the first thing we have to think about is the generally countercyclical behavior of enrollment, and we feel pretty good about the future, although we still need to see how the fall plays out and how that translates into the spring. As you know Dan, we're in a very unusual period in the post-COVID environment where there was a rise in enrollment significantly during COVID and then there was a little bit of a settling back. That's been exacerbated by the economic situation where a really hot labor market's just attracted a lot of people to go to work instead of going back and getting degrees simple as that. So that's the biggest component, but there are a couple of other components that you highlight.\n\nOne is the number of our University services partners, and how our overall portfolio is playing out. And the second is, the term is upon, which we're working with those partners. So as is always the Wiley case, we're working, and you've heard this from us for a long time, we're working to build a long-term portfolio, valuable partners, who we are in mutually beneficial relationships with over time. And that we're not so much focused on the absolute number of partners, but rather focused on the quality and the profitability of partners.\n\nAs such our portfolio numbers will go up and down a little bit over time. And as we said, we lost a couple of partners and that is certainly reflected in our numbers, but and in no way represents our future belief about the -- size or the quality of our portfolio. And in fact, testament to that is the 47 programs that I told you about a little earlier in my remarks. That means that with the partners that we have, they value us significantly, and we are launching additional degree programs, all of which lead to growth in the future, because that's why they launch them.\n\nThey launch them in order to serve an ever increasing number of students that leads to their financial success. So there's significant demand in our portfolio. The final point about the terms upon, which we work with our partners, which is this issue of the price point or the revenue share, we believe that in order to have a long-term growing business, we need to have relationships with our partners that are mutually advantageous. And in many cases, that means that we have to take a look at all the terms.\n\nAnd one of those terms is the share of revenue, which we get from our partners, but to the extent that we are fully aligned with them where we're going to go, that we have a high-quality relationship, we're happy to work on terms that work for our clients, because what that leads to is it leads to ultimately leads to growth for us. It leads to our ability to extend our relationships with them, both in length and in volume. And in fact, again, we're, we have renewed some very important clients just in the last quarter. So in terms of the terms, they will continue to evolve, but we feel very good about the mix of business and the terms upon, which that business is being conducted, including our revenue share.\n\nSo we don't see from where we stand now any significant changes in our outlook based upon that.\n\nDaniel Moore -- CJS Securities -- Analyst\n\nAnd no significant changes, obviously in the long-term margin targets for that portion of your business as well?\n\nChristina van Tassell -- Chief Financial Officer\n\nHey, Dan. It's Christina. Nice to speak to you. Yes.\n\nIn terms of the University services margin targets we don't specifically talk about sub-segment level, but from an ed services margin we're actively managing to adapt to the outlook, as we talked about with our -- with enrollment pressures with our renegotiations. And we're really going to look at how we adapt to make sure that our margin profile stays on point.\n\nBrian Napack -- President and Chief Executive Officer\n\nYes. And I'll just add to that. We have over time talked about a goal of 15%, and we're comfortable with that. As Christina pointed out, we're not breaking out the individual sub-segment margins, but we'll -- we feel very good that the business can run at a nice profitable creative level for Wiley.\n\nAnd we are actively working both on the revenue side and the expense side to ensure that that's going to happen.\n\nChristina van Tassell -- Chief Financial Officer\n\nYes. I wouldn't use Q1 as an indication of full year as well. So that's another thing.\n\nDaniel Moore -- CJS Securities -- Analyst\n\nOf course, I misspoke them at the segment margin of mid teens. Thank you. Is the 35% expected -- sorry, $35 million expected run rate savings from restructuring? Forgive my short-term memory, was that contemplated when you gave the initial guide? Or does that represent more recent actions kind of reflecting some of these incremental short-term macro headwinds?\n\nChristina van Tassell -- Chief Financial Officer\n\nThat was the original plan that we discussed with you in Q4 and we're executing on that plan.\n\nDaniel Moore -- CJS Securities -- Analyst\n\nOK. And last topic and I'll jump out, but Brian really appreciate the color as it relates to the administration's recent announcement. So just to make sure I heard correctly less than 10% of journal publics of articles published have any kind of government backed or funding today. But I hear that correctly, number one.\n\nAnd number two, sounds like this is just more of a continuation of evolution of your driving the ship toward open access. But any impact that you see at all on your kind of longer-term growth trajectory and I guess were you at all surprised by the actions taken any additional color on those would be really helpful.\n\nBrian Napack -- President and Chief Executive Officer\n\nYeah. Definitely, we spoke to this very well in the script, and I won't -- I'll try not to repeat myself, but yes to answer your very specific question, less than 10% of our articles are funded by U.S. federal departments that are impacted by this policy. On underline that a third of those are already published OA and that's rising precipitously as it is across all of our business.\n\nTo answer your second and higher level question, we don't affect expect this policy to have a material impact on the trajectory or the financial health of Wiley. Quite the contrary this is completely in line with everything that we've been talking about on these earnings calls for three or four years now. We believe in a future of scientific research where research is available freely and openly to the world. That's a great thing.\n\nWe also believe that we're going to be in a mixed model environment for a long time to come perhaps forever because funding isn't distributed evenly. And some disciplines simply don't have the funding to pay for the publication. And so we expect subscriptions to be a significant part of our future. To answer your other question this is not all unexpected -- at all unexpected.\n\nIn fact, this is completely in line with discussions we've been having specifically with the OSTP. Parenthetically say, I've personally been down at the OSTP having conversations with them a couple years ago. And it's the continuation of what we view as an orderly transition to this new world of open research. We've been actively and aggressively signing up transitional agreement, excuse me, transformational agreement customers.\n\nIt started in Europe, it's continuing in the U.S. We signed up -- we've signed up over 41 major customers. Over 18 of those customers or 43% are in the U.S. alone, including the U.S.\n\nDepartment of Energy. So this is completely consistent with our belief system. Was it a little bit unexpected? Yes, we didn't expect the timing right now, but if you've been listening, which I know you do, we've been enthusiastically talking about this transition to open access for both mission reasons and for business reasons for some time. And this transition alone is what has been the engine upon our return to growth in Research publishing.\n\nNow I will also point out, because it's not insignificant. Our Research solutions strategy is built to help the world transition to open access. We are currently expanding that business significantly. Just this quarter we're launching, we may have already launched a thing called Oable, which is a payment processing system that allows the almost infinite number of transactions to be effectively processed, attributed back to their author with funding matched from institutions in order to pay for APCs.\n\nI won't go into the details, because it's kind of complicated, but that solution alone will be a fundamental enabler of the open strategy. So Wiley is built to serve the need for scientific research and a healthy ecosystem and a major part of that will be open access. This just keeps us on that pathway.\n\nDaniel Moore -- CJS Securities -- Analyst\n\nAll right. I apologize for the repetitive nature of that question, but I just thought it would be --\n\nBrian Napack -- President and Chief Executive Officer\n\nNo. Dan look, it's a really important question. We're -- it's a really important question. We understand.\n\nWe appreciate it. We're happy to talk about it at whatever level of depth you want to.\n\nDaniel Moore -- CJS Securities -- Analyst\n\nVery good. Thank you again for the color.\n\nOperator\n\n[Operator instructions] And there are no further questions at this time. Mr. Brian Napack, I turn the call back over to you for some closing remarks.\n\nBrian Napack -- President and Chief Executive Officer\n\nAll right. Well, I want to thank everybody for joining us on the call today. And we will look forward to sharing Q2 results in December. Thanks again and have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrian Campbell -- Vice President, Investor Relations\n\nBrian Napack -- President and Chief Executive Officer\n\nChristina van Tassell -- Chief Financial Officer\n\nDaniel Moore -- CJS Securities -- Analyst\n\nMore JW.A analysis\n\nAll earnings call transcripts"
}