{
  "companyName": "Korean Telco",
  "companyTicker": "KT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/korean-telco-kt-q2-2022-earnings-call-transcript/",
  "content": "Korean Telco (KT -0.44%)\nQ2 2022 Earnings Call\nAug 10, 2022, 3:00 a.m. ET\n\nOperator\n\n[Foreign language] Good morning, and good evening. Thank you all for joining this conference call. And now we will begin the conference of the 2022 second quarter earnings results by KT. We would like to have welcoming remarks from Mr.\n\nSeung-Hoon Chi, KT IRO; and then Mr. Young Jin Kim, CFO, will present earnings results and entertain your questions. [Operator instructions] Now we would like to turn the conference over to Mr. Seung-Hoon Chi, KT IRO.\n\nSeung-Hoon Chi -- Investor Relations Officer\n\n[Foreign language] Good afternoon. I am Seung-Hoon Chi, KT's IRO. Let us begin KT's second quarter 2022 earnings presentation. This earnings release call is being webcast live on our website, and you can follow the slides as you listen in on the call.\n\nBefore we begin, please note that today's presentation includes financial estimates and operating results under the K-IFRS standards that have not yet been reviewed by an outside auditor. As we cannot ensure accuracy and completeness of financial and business data, aside from historical performances, please be reminded that these figures may be subject to changes. With that, I will hand it over to our CFO, Young Jin Kim, to present on Q2 '22 earnings.\n\nKim Young-Jin -- Chief Financial Officer\n\n[Foreign language] Good afternoon. I am KT's CFO, Young Jin Kim. Let me begin with KT's key highlights for Q2 2022. In 2022, the second quarter, we firmly established the group's portfolio around growth businesses with a successful transition to a digital platform company and the ramping up of our business portfolio around finance, media and content, and real estate businesses.\n\n2022 marks the third year since the pledge as a DiGiCo, achieving record high performance of first half consolidated operating revenue of KRW 12,589.9 billion as we successfully broadened the playing field. In the B2B business, we are leading the market, catering to corporate demand for DX or digital transformation, leveraging our core DX technologies and the biggest fixed and wireless infrastructure that we have in Korea. By offering differentiated services for each customer segment and by bringing AI, big data, and cloud capabilities to our existing businesses to drive digital transformation, we plan to further power growth of these services. AICC is where we see an adoption of AI technology by Korea's top-notch customer service centers and a good example of our DX digital transformation coming together in traditional businesses.\n\nFirst half revenue, therefore, has surpassed last year's annual figure, spearheading digital conversion for call centers in Korea. For the B2B business, underpinned by our strength in public, defense, and financial sector, we delivered customized services for customers across different sectors, growing the number of orders booked, up by 33% year over year for the first half and 45% on a cumulative basis as of July end, solidifying our mid- to long-term growth foundation for B2B business. B2C business is also sustaining its growth in terms of quality and volume by elevating customer experience and values. 5G penetration reached 54% as Internet and IPTV have all maintained growth rate on par with that of last year.\n\nCloud and IDC business is now established as a separate special entity, setting itself up as a solid growth pillar. We are at the forefront of the market, pre-emptively responding to demand as we equip ourselves with managed services capabilities for the cloud business and build additional IDC capacity. Key pillar of the group's portfolio of growth businesses, which comprise of financial and media and content business has seen growth fully ramp up, supported by the DiGiCo strategy. In the first quarter, we enhanced business capacity through active partnerships and alliances with outside partners and visible results were seen and proven in the market during the second quarter.\n\nFor the media and content business, on the back of the popular hit from our original content, brand awareness of the ENA channel improved, building a positive feedback loop across content, channel and the platform. Also following strategic alliances with CJ ENM, we decided on the merger of Seezn and TVing connecting Korea's No. 1 OTT platform to KT Group's media value chain, equipping with a solid foundation and becoming a leading provider of K content. KT's financial business is evolving into a digital financial platform as we strengthen profitability and tap into markets with high future growth potentials.\n\nBC Card is seeing growth from its incumbent payment business, while through the My Data business is diversifying its business portfolio and nurturing engine for future growth. K Bank has also seen all of its operational indicators up trend, including number of customers, deposits, and loans, reporting a profit for five consecutive quarters, while solidifying platform capabilities through different forms of outside partnerships. I will now run through financial results for Q2 2022. Operating revenue was up 4.7% on year, reporting KRW 6,322.2 billion, and operating profit was down 3.5% on year to report KRW 459.2 billion.\n\nNet income was down 2% on year to KRW 363.4 billion, while EBITDA was up 1% year over year, reporting KRW 1,387.2 billion. Next is operating expense. Driven by changes in macro backdrop such as inflation, business expenses were up and on one-offs, including labor expense, operating expense was up 5.4% on year, reporting KRW5,853 billion. Next is the financial position.\n\nDebt-to-equity ratio as of end of June '22 was 131.1%, up 6.3 percentage points Q-on-Q. Net debt ratio was up 5.5 percentage point Q-on-Q, reporting 42.9%. Next, on capital expenditure. To provide a clearer communication on KT Group's DiGiCo strategy, we will share the capex figure of our major subsidiaries starting this quarter.\n\nFirst, KT Group's first half capex spend was a total of KRW 1,716.6 billion, while KT stand-alone capex reported KRW 1,402.2 billion, with major subsidiary capex, which comprises of financial, media and content, cloud and IDC, and real estate business amount to KRW 314.4 billion. Next is breakdown of business performance. Driven by wireless revenue and solid growth of broadband Internet revenue, telco B2C revenue was up 1.6% on year, reporting KRW 2,371.9 billion. Wireless revenue on the back of 5G subscriber growth was up 2% year over year to KRW 1,550.3 billion.\n\nTotal wireless subscribers were 23,410,000 as of Q2 end '22, sustaining the net addition trend of total wireless subscribers, underpinned by integrated management of the MVNO and the MNO market. Broadband Internet revenue was up 2.5% year over year to KRW 596.3 billion on subscriber growth around GiGA Internet. Fixed line telephony revenue was down 3.4% on year to KRW 225.3 billion on decline in number of household subscribers. Next is on DiGiCo B2C business.\n\nDiGiCo B2C business was up 2% year over year to KRW 554.4 billion on the back of media business and growth of the mobile platform business. On sustained platform-based revenue growth and subscriber uptrend, IPTV business was up 6.1% on year. And in June, in order to satisfy wide-ranging content demand from our users and to offer more choice, we revamped the tariff plan into the Choice plan. On the back of balanced growth from enterprise Internet, data and voice call, Telco B2B was up 6.8% year over year, reporting KRW 529.9 billion.\n\nOn steep rise in enterprise data traffic and growing demand for premium services, B2B Internet and data revenue was up 5.9% year over year. Enterprise voice call continued on with a high growth, posting 8.9% year-over-year increase, thanks to pre-emptive responses to the expanding MVNO market and continuing net add trend for enterprise VoIP. Next is DiGiCo B2B. DiGiCo B2B business is growing in step with expanding DX demand from businesses.\n\nWhile the year-over-year revenue was down 2.4% to KRW 481 billion, if we include kt cloud's revenue, there was 17.4% growth with revenue at KRW 578.6 billion, which is a double-digit growth and a continuation of such growth. Enterprise DX reported 12.9% year-over-year growth as we differentiated our service offerings and responded to the market pre-emptively. For the AICC business on more projects and orders booked ramping up the revenue stream, there was 48.1% year-over-year growth for the AI and new business. Next is subsidiary performances.\n\nAn increase in acquiring volume following recovery of domestic consumption and rise in financial assets, BC Card revenue was up 9.3% on year to KRW 991.2 billion. Skylife revenue was up 45.2% on year to KRW 254.2 billion on the back of growth from MVNO and Internet resale businesses and from the content business underpinned by SkyTV. On higher revenues from digital ad and e-commerce and KT Studiogenie ramping up its business, content subsidiary revenue was up 34.7% on year, reporting KRW 285.3 billion. Under the endemic, as hotel operations started to recover, KT Estate revenue was up 46.3% on year, reporting KRW 97.7 billion.\n\nFor the second half, we have opening schedules upcoming for Myeong-dong, Le Meridien and Moxy Hotel and we expect KT's real estate business to continue on with the growth trajectory. So far, I've walked through KT's second quarter 2022 earnings highlights. In the first half of 2022, we recorded a record high revenue, thanks to a successful transition to DiGiCo and firmly established group portfolio around growth businesses, which broadened the playing field for the company. We will continue to create new value for our customers from our telco business and further advance group's portfolio of growth businesses underpinned by DiGiCo B2B to generate concrete results.\n\nWe look forward to your continued interest and support. Thank you very much.\n\nSeung-Hoon Chi -- Investor Relations Officer\n\n[Foreign language] For more detailed information, please refer to the material that we have circulated previously. And we will now begin the Q&A session. [Operator instructions]\n\nOperator\n\n[Foreign language] [Operator instructions] The first question will be provided by Joonsop Kim from KB Securities. Please go ahead with your question.\n\nJoonsop Kim -- KB Securities -- Analyst\n\n[Foreign language] Thank you for the opportunity. I would like to ask you two questions. First has to do with the mid-priced price scheme for the 5G services. And the second question relates to your B2B business.\n\nRegarding that 5G mid-range pricing scheme, your competitor has introduced that pricing scheme ahead of everyone else. I would like to get your assessment of what you expect or how you expect the competitive landscape to develop going forward? And if KT also has a plan to adopt this pricing scheme? What impact are you expecting from that release? Second question, if you look at the second quarter's B2B business result, it was quite positive. What is your assessment of the growth potential from the B2B business going forward?\n\nKim Young-Jin -- Chief Financial Officer\n\n[Foreign language] Thank you, Mr. Kim, for your question. I will first respond to your 5G pricing scheme first. We, at KT, were also making preparations to adopt a mid-price range pricing scheme under the view or under the objective to provide more choice, more expanded choice to the customers so that they can select the rate plan that best befit them.\n\nSo just to remind you that we have a 5G mid-priced tariff scheme upcoming in the near future. With regards to the possible impact that this will have -- because we are still a prelaunching phase, it will be -- I'm quite cautious to provide you with any specific outlook for this. Now having said that, there will be some of the 5G subscribers, who will downgrade to the lower pricing scheme, but we also have quite a bit of LTE subscribers, and I believe that by providing more choice to our subscribers in terms of the rate plans that they can select, this can actually accelerate the speed of migrating the LTE subscribers to move over to this pricing scheme. So once again, I will be able to provide you with a more clearer picture on the outlook in terms of the impact this will have after we release this pricing scheme.\n\nMoving on to the second question and what the growth drivers are for B2B and what our projections are. Let me elaborate on that point. Now as I mentioned during my opening presentation, our B2B business is a very critical growth driver for the company. If you look at the first half numbers on a year-over-year basis, we've seen increase in the number of orders booked by 33%.\n\nAnd as of end of July, that year-over-year growth was about 45%. So we are seeing a quite robust trend. Then just to elaborate more on what the growth engine is behind the B2B business, I would like to provide you with some more detail on that. So if you look at KT's B2B overall digital or business strategy, there are three pillars to this.\n\nThe first one is expanding into a new business area by adding digital on top of our telco capabilities. Second is to gain an upper hand and dominance in the DX market, DXI, the different businesses and companies by really tapping into the digital segment where we could actually leverage the potential that we have with the strong underpinning of our telco capabilities. And third is providing a customized DX model by providing a differentiated offering for each of the customer segments. In terms of the competitive edge that we have in our B2B business, KT boast of Korea's biggest nationwide coverage in our B2B services, and supported by such fixed line and wireless infrastructure, we actually have a very metropolitan base based on which we have our own sales channels that could actually address the needs and visit our customers on their sites at their office.\n\nAnd in order to facilitate DX transition of different businesses, what is important is the infrastructure. And KT has the fixed and wireless network that is robust and stable. And we also have core technologies that's required for DX, including AI, Big Data, and cloud. And we also have a portfolio of enterprise products, whereby we could provide a customized service for each of the customer segments.\n\nAnd that really works as the strength of KT in the sense that we can be right next to our business partners in the journey toward digital transformation. In terms of the growth rate projection for B2B revenue, the basis for that growth rate is going to be the order book that we build. Our objective, therefore, for this year in terms of the revenue is more than KRW3 trillion and by 2020 -- excuse me, in terms of the order book, the amount of orders that we win, our objective is to have more than KRW3 trillion in orders for this year and also more than KRW5 trillion by year 2025. Next question, please.\n\nOperator\n\n[Foreign language] The following question will be presented by Hoi Jae Kim from Daishin Securities. Please go ahead with your question.\n\nHoi Jae Kim -- Daishin Securities -- Analyst\n\n[Foreign language] This is Kim Hoi Jae from Daishin Securities. My first question relates to your content business. With the recent hit of the Extraordinary Attorney Woo on TV, there has been growing interest on your company's content investment. And we are seeing a lot of changes on the content side.\n\nYou've decided to merge TVing with Seezn, and we are curious as to what your future collaboration would look like with CJ ENM. And also in that light, I would like to understand whether you have other plans to merge Media Genie plus SkyTV going forward? Second question relating to your wireless business. We are seeing very good measures for 5G penetration as well as ARPU. But because the penetration is so high, there is concern that maybe the ARPU up trends may start to slow.\n\nSo from a long-term perspective, what are your strategies in place to make -- for you to make sure that you can actually sustain that elevated level of ARPU and wireless revenue going forward?\n\nKim Young-Jin -- Chief Financial Officer\n\n[Foreign language] I will first respond to the first question about the content business. Since we've merged TVing with Seezn, what are our future collaboration plans with ENM, I will respond to that first. Yes, let me first provide you with the background as to why we entered into partnership with CJ ENM. As one of the very key pillars for us to transition into a DiGiCo for a media content business is a very important pillar that's going to play a key role.\n\nAnd we've been continuously reviewing possibilities of entering into a mega alliance for us to very quickly gain competitive edge and also scale up our business through outside partnerships. Hence, we've decided to enter into an all-around partnership with CJ ENM, which is a front runner in the media and content business equipped with content production capabilities as well as distribution competitiveness. And also CJ ENM had also decided to make KRW100 billion of investment into Studio Genie. KT and CJ ENM have agreed to these investments as well as scheduling and purchasing of the content and key executives of the two companies through a council of business collaboration and cooperation have really ramped up cooperation and collaboration across the board.\n\nIn terms of the content sourcing and scheduling of the content, there was an agreement made so that KT Genie's original content and certain titles that it produces will be scheduled through the platforms that CJ ENM has in terms of its channel and platform, including TV and channel and TVing. Also, in terms of coproducing AAA titles, KT Studiogenie and CJ ENM will engage in joint and coproduction in order to produce a global AAA content. In terms of the merger and integration between Seezn and TVing, everything is on a smooth sale with an objective date or the target date of integration as of December this year. Relating to the question of future integration between Media Genie and SkyTV.\n\nIn order for us to further improve our competitiveness in MPP, we are, at this point, reviewing multiple options, but we have not yet finalized a certain direction as of today. But once we make the decision, we will come back to you and communicate that to you. I will now move on to your second question, elaborating on our strategy to drive continuous wireless revenue. Now the 5G penetration is continuously up trending.\n\nAnd as of the first half, the figure was 54%, and our objective is to reach 60% by the end of this year. We expect -- we introduced the Choice plan. This is a value-added tariff service where people, the subscribers can select and use and subscribe the rates that they wish. And through such provision of value-added services, we wish to bring additional revenue.\n\nLast but not least, we are at this point in developing and preparing various different value-added services that satisfies our customer needs. And once we release them, we will come back to you and provide you with more details. Next question, please.\n\nOperator\n\n[Foreign language] The following question will be presented by Seyon Park from Morgan Stanley. Please go ahead with your question.\n\nSeyon Park -- Morgan Stanley -- Analyst\n\n[Foreign language] Thank you. I would like to submit two questions. First has to do with the spun-off of your cloud business, kt cloud. If you look at the impact that it had on the operating profit on a separate basis, we'd like to gain some understanding as to the extent of what the impact was on operating profit line? And second question is in connection with this.\n\nIf you look at KT's dividend payout policy, basically, it is 50% of adjusted net profit on a separate basis. And with kt cloud being carved out, there, of course, is going to be impact on the profit. So at the end of the year, when you actually distribute the dividend, would you also consider for this corporate income tax element as well when you determine the amount of dividend to be paid out at the end of the year.\n\nKim Young-Jin -- Chief Financial Officer\n\n[Foreign language] Thank you, Mr. Park, for your question. Yes, let me tackle your first question. You asked a question on the separate basis, operating profit impact with the carve out or spinoff of kt cloud.\n\nLet me first talk about the top-line revenue. With kt cloud being spun off, we expect there to be about KRW100 billion of impact on the top-line revenue. So just assuming that the kt cloud is still included within the KT Group under that assumption, if you look at, so that's pre spin-off, cloud and IDC growth of Y-o-Y 11.4%, with on a separate basis, service revenues 3.8%. So as just mentioned, basically, the top line growth trend is continuing.\n\nBut with the carve-out of cloud and IDC business, this will have an impact in terms of lowering the top-line revenue, but we also need to consider for the lower level of operating expense, which includes the labor cost, depreciation and power expenses. So if you think of both of these elements, there is -- we expect there's not going to be that big of an impact on the operating profit, the size much less than the reduction in the top-line revenue. So typically, in the past, our cloud and IDC business, their operating profit margin typically was higher compared to the companywide average. But recently, there has been a steep surge in demand, which entailed in -- a rise in initial investment as well as other investments, for instance, hiring of additional headcount, which weighed down on the current OPM margin.\n\nBut from a long-term perspective, we believe that this margin will start to also improve as we more pre-emptively respond to the market and as we expand our capacity. Now moving on to your second question. With the establishment of kt cloud as a separate special entity in terms of the corporate income tax that we had paid and whether that's going to be used as an item for adjustment for our adjusted net profit. So when it comes to expense items, for non-cash expense items and P&L, this was, yes, it was an item that we considered in adjusting the net profit.\n\nIn the spin-off of our cloud business, also this is an accounting-based treatment. There was no actual cash out regarding the corporate income tax. So yes, because it's a non-cash expense item, it will be considered in the adjustment of the net profit for distribution purposes.\n\nSeung-Hoon Chi -- Investor Relations Officer\n\n[Foreign language] Well, with no further questions, we would like to now close the Q&A session for the day. Thank you very much for your interest and for your questions, and thank you for joining us. If you don't have any more questions, we would like to end the Q&A session. Thank you very much for your interest and your questions and also for joining us despite your very busy schedules.\n\nThis brings us to the end of second quarter 2022 earnings conference call. Thank you.\n\nDuration: 0 minutes\n\nSeung-Hoon Chi -- Investor Relations Officer\n\nKim Young-Jin -- Chief Financial Officer\n\nJoonsop Kim -- KB Securities -- Analyst\n\nHoi Jae Kim -- Daishin Securities -- Analyst\n\nSeyon Park -- Morgan Stanley -- Analyst\n\nMore KT analysis\n\nAll earnings call transcripts"
}