{
  "companyName": "WalkMe Ltd.",
  "companyTicker": "WKME",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/walkme-ltd-wkme-q2-2022-earnings-call-transcript/",
  "content": "WalkMe Ltd. (WKME 8.44%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the WalkMe third quarter earnings call. [Operator instructions] At this time, I would like to turn the conference over to Mr. John Streppa. Please go ahead, sir.\n\nJohn Streppa -- Head of Investor Relations\n\nHello, and thank you for joining our second quarter 2022 earnings call. I'm John Streppa, head of investor relations at WalkMe. And today, I'm joined by Dan Adika, CEO and co-founder; Rafi Sweary, president and co-founder; Scott Little, chief revenue officer; and Andrew Casey, our chief financial officer. Certain statements we make today may constitute forward-looking statements and information within the meaning of Section 27A of the Securities Act of 1933, Section 21E of the Securities Exchange Act of 1934 and the safe harbor provisions of the U.S.\n\nPrivate Securities Litigation Reform Act of 1995 that relate to our current expectations and views of future events. These forward-looking statements are subject to risks, uncertainties and assumptions, some of which are beyond our control. Actual outcomes may differ materially from the information contained in the forward-looking statements as a result of a number of factors, including those set forth in the section titled risk factors in our annual report on Form 20-F filed with the Securities and Exchange Commission on March 24, 2022 and other documents filed with or furnished to the SEC. See our press release dated August 11, 2022 for additional information.\n\nIn addition, certain metrics we will discuss today are non-GAAP metrics. The presentation of this financial information is not intended to be considered in isolation or as a substitute for or superior to the financial information prepared and presented in accordance with GAAP. We use these non-GAAP financial measures for financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe that these measures provide useful information about operating results, enhance the overall understanding of past financial performance and future prospects and allow for greater transparency with respect to key metrics used by management in its financial and operational decision-making.\n\nFurther, throughout this call, we provide a number of key performance indicators used by our management and often used by competitors in our industry. For more information on the non-GAAP financial measures and key performance indicators including the reconciliation tables, see our press release dated August 11, 2022. And with that, I'd like to hand it off to Dan.\n\nDan Adika -- Co-Founder and Chief Executive Officer\n\nThank you, John, and good morning, everyone. I'm proud to be here in our Tel Aviv office with all the global management team today. We're excited to share our second quarter results. We're executing against our strategy, delivering our full Digital Adoption Platform to leading global enterprises.\n\nOur ARR from DAP customer is growing 60% year over year by driving expansion, use cases, and adding product lines like the newly launched Workstation, our centralized digital employee hub. I'm thrilled with the progress we made over the last two years from selling single-application use cases to now having 142 customers deploying WalkMe across far more applications all within ELA, now accounting for over $100 million of our ARR. This progress is what is driving us to move faster in our transition, focusing on larger enterprise with complex workflows. Overall ARR has seen 29% growth year over year and surpassed 245 million.\n\nOur enterprise and large enterprise customers are seeing the value of DAP in this complex business environment and seeing growth expanding these accounts focusing on achieving digital transformation success with a focus on digital employee experience. I'm happy to share with you that in this quarter, we've closed our biggest deal in the company history, and we've seen three of our $1 million ARR accounts expand by $1 million or more. This is a huge testament to the growing demand of digital adoption and value realization by our customers. Our biggest customers are getting bigger; these customers, the innovators, that are driving digital strategies forward and focusing on new ways of work.\n\nAs we continue to deliver value and expand within these accounts, we're also prioritizing our strategy focusing on the right segments and the right product offering to lead our business to improve operational efficiency. We are driving our business to improve our efficiency and pushing to improve our margin and free cash flow from quarter to quarter. We improved our non-GAAP operating loss from Q1 by nearly $2 million, showing the underlying leverage in our operating model. We have moved fast in better prioritizing our strategic priorities, leading to this leverage and expect to see continued improvement in our margin going forward.\n\nWe are growing the DAP market category and the transition of our customers to our complete Digital Adoption Platform. We are better aligning our offering including our products in data, action, and experience with increased focus on our go-to-market engine of enterprise and large enterprise customers. With our large customers, we are also moving our conversation to higher levels within the organization, driving more strategic discussions with CIOs. But in the near term, macro headwinds and budget consideration are lengthening the sales cycle.\n\nLonger-term strategic discussion with CIOs and business leaders is a positive for our business as we become more essential in our customer digital transformation efforts. We are encouraged to see our pipeline continue to show robust growth, namely expansions with our enterprise and large enterprise customers and our partner ecosystems which we believe will be more durable. On the operational side, we are prioritizing our investment spend with an intense focus on our strategic growth drivers of expanding our market category, driving growth in our partner ecosystem, and investing in areas of competitive advantage, such as our federal business. As a leadership team, we were pleased with the improvements we saw in the operating margins and free cash flow, and we'll continue to focus on profitability as we drive toward the Rule of 40 that we laid out in our investor day in May.\n\nWe believe that our technology and the ROI that we deliver position us well in a value-focused software spend environment. Our ability to deliver greater value has been driven by the flexibility of our Digital Adoption Platform, which can be deployed across an entire organization to aid employees in completing their unique workflow. As we work toward general availability for Workstation, our newest product designed to be a central hub for employees to start their workflow, we're thrilled to see some of our largest customers deploy it to their entire workforce. It's our first major product that complements our platform but also provides an additional revenue stream.\n\nA great example of deploying Workstation at scale is with one of the largest U.S.-based property and casualty insurance provider, a Fortune 50 company with over 55,000 employees, who we had a strong expansion with us this quarter. They've seen huge success using WalkMe Workstation to drive a mission-critical change management initiative, streamlining processes and ensuring team members completed specific regulatory requirements on a tight time line, resulting in significant higher cost savings. They partnered closely with WalkMe to establish a center of excellence that enable each business unit to develop solution and design-efficient user experiences across the enterprise application ecosystem, from HR to sales. This customer digital adoption program has ushered in a new way to distribute information across the enterprise, changing how employees learn and work, and we'll continue to partner with them as they deploy on more systems.\n\nProving value is important to us and to our customers. We invested in our presales team to improve the efforts and demonstrate this value to our customers, but nothing can beat the live AB testing by our customers. Metcash is Australia's leading wholesaler and distributor, supplying and supporting more than 100,000 businesses across the network of independent retailers, and businesses in the food, liquor, and hardware industries. Metcash developed a self-service product management system for its supplier and internal teams.\n\nWalkMe was deployed for its supplier-facing portal compared to traditional change management and enablement approaches were used for its internal team. Metcash seamlessly migrated over 5,000 suppliers to the new system in less than 25% of the time it took to migrate their far smaller internal team of 140 users. With WalkMe guidance for the self-service portal, suppliers can add new products and update offerings quickly. This enabled Metcash's network of independent grocers, liquor stores and hardware stores to purchase goods and get them on their shelf and into customers' hands.\n\nAs a result of this real-world AB test experiment, Metcash introduced WalkMe to their internal users of the system. Metcash is now rolling out WalkMe enterprisewide for their employee-facing application, as well as their customer and supplier-facing portals and website. Another great example is W. L.\n\nGore & Associates, a global materials company which uses WalkMe to enable its global sales force of over 2,200 people, with cohesive just-in-time training relevant to each user's role. Providing the right information and the right time with the proper context of each person's function has led to an 83% reduction in training time with faster feature adoption resulting in sales leaders and sellers saving hundreds of hours a year. We continue to invest in our products. In our July product release, we released new functionalities and enhancements related to data, governance, multi-language, integration, security, and more.\n\nNotably, we introduced our newest version of Workstation to our customers. Workstation changes how employees interact with software through a desktop-based hub that brings workflow, automation, and enterprise search to the employees and simplify employee interaction with software. In addition to Workstation, we introduced Digital Transformation Intelligence, DTI for short, to a select group of beta customers. DTI is our observability platform for digital transformation, allowing CIOs and executives to gain full insight into their software stack, including discovery and analytics.\n\nNot just on the usage level but into the business processes and end-to-end workflows to truly measure how software is being used and our business processes are being completed. CIOs will be able to use DTI to focus their digital transformation efforts. And combined with our action and experience product, they will be able to target and deliver experiences that allow the employees to be more efficient, accurate, and fast. Now, transitioning to our categories.\n\nYesterday, WalkMe revealed the findings of the second annual state of digital adoption report, in which we served nearly 1,500 senior business leaders from enterprise across 10 countries. The research helps us take the pulse of organizations' digital transformation challenges and where the gaps still lie when it comes to digital adoption. Some of the most compelling findings include 60% of decision-makers are concerned about the effect of poor employee technology adoption on expected software ROI. This past year, on average, enterprises have only met 41% of their digital project KPI.\n\nSixty percent of enterprises say change management programs are no longer fit for purpose. Sixty-three percent of enterprise says a one-size-fits-all approach to technology, support, and training is inapplicable. So, this is clearly a gap and where we can help these organizations solve these issues. According to the survey, the top five consequences of failed digital adoptions include increased security risk, operational inefficiencies and waste resources, poor employee retention, failing to adapt to industry changes, and losing a competitive edge.\n\nThe survey shows that organizations increasingly realized that without effective digital adoption strategy, business processes improvements will fail. Another facet we include in the report was the growing community of WalkMe DAP professionals. The number of LinkedIn profiles that say WalkMe Admin grew by nearly 40% from '21 to '22 to more than 4,600. To honor the DAP profession, WalkMe recently registered the last Thursday of July as International DAP Professional Day, celebrating individuals who are advancing the use of digital technologies within the organization.\n\nIn recognition of this day, we took the opportunity to officially announce the date of Elevate, our annual DAP professional event, which is taking place on October 25 to 27 both virtually and in person. And just as DAP community continues to grow, we have also seen growth in the DAP category itself in terms of expanded application of technology. In the recent Gartner report titled Innovation Insight for Digitally Enabled Diversity, Equity, and Inclusion, DAP is cited as a DEI technology for the ex-equity use case, mentioning WalkMe as a sample provider. We believe this is more evident of how DAP really levels the playing field for employees from all different backgrounds, generations, and experiences.\n\nAnother example of category growth, WalkMe was included in the recent Forrester report titled Adopt An Anywhere-Work Strategy to Compete in the Future Tech Labor Market. The report mentioned WalkMe as an example for technology that can complement the current workforce to increase the productivity of the overall labor strategy. Our category continues to expand, from our end users to DAP professionals, and we have been working to scale our partner ecosystem to continue to drive this forward. In the past, we recognized our increased partnership with Deloitte, Accenture, HCL, and others.\n\nIn this quarter, we continued to expand our relationship with these partners in geographies and executing against our combined go-to-market plan. As our efforts around the partner ecosystem continue to expand, we're seeing more significant deals being impacted by our partners. Our partner ecosystem contribution in the first half of 2022 has already eclipsed all of 2021. We saw numerous deals make a meaningful contribution to our net new ARR in Q2, including TWO Global 2000 customers with six-figure net new ARR deals, one a new customer and one in expansion.\n\nPart of developing our partner ecosystem is delighting them as customers, and our partners are investing in their own talent to deliver WalkMe to their internal employees, as well as their customers. Our partners already have hundreds of their employees certified with WalkMe or in the process, and we expect that the trend to continue to grow. As we outlined in our investor day, our partner ecosystem enables us to expand the reach of our platform to some of the largest organizations undergoing digital transformation. We expect this focus to continue to contribute meaningfully in 2022 and scale further in 2023, as we laid out previously.\n\nLastly, our work on FedRAMP certification continues to progress. We've invested in building out the team, capabilities, and technological infrastructure to support the public sector business. Last week, Georgia's secretary of state announced significant enhancement to Georgia's My Voter Page including the addition of WalkMe as part of a comprehensive plan to ensure voter access in the upcoming November election. In addition, we're in the process of pursuing FedRAMP and StateRAMP status and are pleased with the progress we made so far.\n\nWhile undergoing the certification, we continue to gain new public sector customers including in the city of Chandler, Arizona and large transportation customers. Our investment in our federal practice isn't just in our go-to-market strategy but has helped us overhaul our entire technical infrastructure of our solution. This investment, driven by our goal of being able to serve the large federal segment, will drive greater efficiencies across our entire business and a more nimble approach to the structure and deployment of our product going forward. Last quarter, we noted that we had signed our new chief revenue officer, and I'm pleased to be joined today by Scott Little, who started a few weeks ago.\n\nAdditionally, earlier this week, we announced that we had hired Adriel Sanchez as chief marketing officer. We're thrilled to reunite Scott and Adriel and have them join us to help drive greater focus on our strategic priorities and alignment by driving increased focus on strong execution. I'd like to invite Scott to say a few words. Scott?\n\nScott Little -- Chief Revenue Officer\n\nThank you, Dan. I am thrilled to be here today. I joined WalkMe because I saw firsthand some of the largest digital transformations in the Global 2000, as well as the money being invested in process discovery and optimization to support those transformations. Software solutions are a key ingredient to the success of these kinds of projects, whether that is an overhaul of existing deployments or new fit-for-purpose applications.\n\nAn often underappreciated aspect of these digital transformations is the change management element related to the adoption of new systems and processes. WalkMe brings a nimble, cost-effective way to drive adoption of both new and existing applications, as well as a flexible platform to deliver lightweight process changes that can drive material outcomes. And in the end, customers want good outcomes from their investments. These large digital transformation and process optimization projects are never implemented completely in-house by our clients.\n\nPartners play a huge role in their success, whether that is a software partner like Celonis or SAP, or a GSI partner like Accenture or Deloitte. These partners understand that the most valuable business processes live in multiple organizations and across multiple applications. Our largest clients with the most complex workflow environments realize the greatest return on their software portfolio investment when they deploy the WalkMe platform across their Tier 1 applications. Our partners are a critical part of our ability to deliver good outcomes in these large clients.\n\nSuccessful projects and happy clients turn into repeat business. Since joining in July, I have taken the time to meet with employees from across the world, and I'm very excited to work with these smart, talented, and driven people. The people that have joined recently have come from some of the best software companies in the world. As I look at my organization today, we've grown fast, and we're not immune to the problems that come with rapid growth.\n\nBut I plan to provide the structure and processes that can help this organization continue to scale and grow in a repeatable and effective way. Thanks again. And now, I'll hand it back to Dan.\n\nDan Adika -- Co-Founder and Chief Executive Officer\n\nThank you, Scott. I'm really pleased with our progress this quarter. Thank you to all our partners, investors, employees, and customers. We are continuing our journey to fulfill the DAP vision that we kicked off four years ago.\n\nSince, DAP offering has grown to over $100 million in ARR. We have an expanding ecosystem with over 4,600 DAP professionals. Top tier analyst firms are recognizing the category, and our customers are expanding with us by realizing true value and signing multimillion dollar contracts with us. With that, I will hand it over to Andrew.\n\nAndrew Casey -- Chief Financial Officer\n\nThank you, Dan. Our second quarter was driven by strong expansions with our Global 2000 customers, who continue to invest and expand their relationships with us. As Dan highlighted, we saw the biggest deal in company history, but we also saw broad expansions from some of our largest customers, as evidenced by the increase in ARR of our DAP customers, which grew 60% year over year. And our average contract duration for the quarter was nearly 24 months, highlighting the strategic nature of these agreements.\n\nWe also focused on our organization and on improving our operating efficiencies by utilizing WalkMe internally, driving greater savings in our software costs, improving our core processes, and in aligning our people with our long-term strategic vision that we laid out in our investor day. I'm pleased with the operating margin improvements we saw in the second quarter compared to the first, and it's a direct reflection of our customer focus and many of the initiatives we outlined to drive scale in our operations. The benefits from these initiatives will enable us to achieve greater operational efficiencies in the coming quarters. Improvements in our sales efficiency is one of these initiatives.\n\nAnd that's why we're excited to welcome Scott as our chief revenue officer and Adriel as our first chief marketing officer. Adding both of them to our executive team will drive greater alignment and the focused execution we need to take our business to the next level. Our biggest customers continue to invest and deploy WalkMe across our organizations. Impressively, in the quarter, we had 30 expansions that were greater than 100,000 from customers who already paid us over 100,000 in ARR.\n\nNearly 1/3 of our $1 million customers expanded within the quarter, and we had three expansions of more than $1 million in net new ARR. All of this is validation of our shift in the go-to-market to focus on enterprise and large enterprise customers. We now have 490 customers who are paying us over 100,000 in ARR and 31 customers paying us over 1 million in ARR. In both cases, the average ARR per customer increased year over year, 12% and 24%, respectively.\n\nOur ARR grew to 245.7 million, up 29% year over year, with expansions being the largest driver in the quarter. Total revenue for the quarter was 59.9 million, up 28% year over year, while subscription revenue was 54.2 million, up 28% year over year. Remaining performance obligations, or RPO, ended the quarter at 346 million, representing a growth of 33% year over year. And current RPO, which is the contracted subscription revenue expected to be recognized over the next 12 months, grew 28% year over year to 193 million.\n\nLong-term RPO, which is contracted subscription revenue expected to be recognized after the next 12 months, grew 39% year over year to 153 million. The momentum in large enterprise continues. ARR growth from customers with more than 500 employees continues to outpace the rest of our business, growing 31% year over year after accounting for the customer maintenance undergone in the fourth quarter of 2021. Our dollar-based net retention for customers over 500 employees was 120% for the trailing four quarters compared to 117% in the second quarter last year.\n\nWhile I'm pleased with the progress of our investments in our partner ecosystem and public sector, we've also taken steps to improve our operational efficiencies, which will enable us to continue improvement on both the margin and dollar-loss basis sequentially throughout 2022, making the first quarter the high watermark for our loss. As a result of the improved non-GAAP operating margins, we now expect to achieve positive free cash flow during 2023. Before turning to gross margins, expenses and profitability, I would like to note that I will be discussing non-GAAP results going forward. In the second quarter of 2022, gross margin was 78%, up 0.8% from the first quarter.\n\nGross profit was 47 million, up 31% year over year. We've seen improvements in our gross margin due to a revenue mix shift toward subscription and improved hosting capabilities as we move to a multi-cloud strategy. We expect our overall gross margin will continue to improve due to the positive mix of subscription versus services revenue and optimization of our hosting operations and an improved services engagement model, leveraging partners where feasible. Turning now to operating expenses.\n\nWe are increasingly focused on our strategic growth drivers of category expansion, growth in our partner ecosystem and prioritizing our go-to-market strategy to enterprise and large enterprise across the globe. Sales and marketing expenses in the second quarter of 2022 was 38.5 million compared to 29.1 million in the second quarter of last year. This represents 64% of total revenue in the second quarter compared to 67% last quarter and 60% in the second quarter of last year. R&D expense in the second quarter of 2022 was 14 million compared to 10.7 million in second quarter last year.\n\nThis represents 23% of total revenue versus 23% in the same period last year. We continue to make investments in our platform to drive innovation and increase our flexibility for deployment. We will continue to invest in R&D as we extend our product and invest in our ecosystem in 2022. G&A expense was 11.1 million for the second quarter of 2022 compared to 8.8 million in the second quarter last year.\n\nG&A was 19% of revenue in the second quarter versus 19% in the second quarter of last year. We are investing in the infrastructure of our business and continue to drive long-term scale in our business. Going forward, the primary areas of investment for us will be in R&D and sales and marketing as we look to continue to capture the growing market opportunity for our products. We've made progress in the second quarter, driving greater efficiencies in our operating model, which drove our operating loss lower than our initial plan for the quarter.\n\nWe are very focused on driving toward cash flow breakeven and operating profitability showing increasing leverage in our business model. Operating loss in the second quarter of 2020 was 16.7 million compared to a loss of 18.6 million last quarter and 11.7 million last year. Operating margin of negative 28% compared to negative 33% last quarter and in the same period last year of negative 25%. Net loss per share in the second quarter of 2022 was $0.19, using 84.7 million weighted average shares outstanding.\n\nFree cash flow was negative $12.2 million in the second quarter of 2022 compared to negative 20.3 million last quarter and negative 7.4 million in the second quarter of last year. Free cash flow margin in the second quarter of 2022 was negative 20%, down from negative 36% last quarter and 16% for the second quarter of last year, which is a reflection of our improved operational efficiencies. Turning to balance sheet. We ended the quarter with 317.9 million in cash, cash equivalents, and short-term deposits.\n\nGiven our sizable cash balance and the expectation of improving operating margins throughout 2022 and 2023, we are well-capitalized to continue to support our growth goals. Turning now to guidance. While we were pleased with our performance in the second quarter, we are taking a more conservative approach to the remainder of the year. In addition to the more uncertain macroeconomic environment, we are doubling down our focus of greater than 500 employee customers and expect increasing churn from our small customers, which currently represent around 70% of our total ARR.\n\nWith that in mind, the macroeconomic and SMB impacts are factored into our revenue guidance. Combined, we expect this to be a $4 million to $5 million headwind for the revenue and our total ARR from the second half of 2022. We are driving more efficiencies with our operating model while aligning our strategic priorities. As a result, we expect to see improved operating margins sequentially in the third and fourth quarter on a non-GAAP basis.\n\nAnd we are improving our operating loss guidance despite the revenue headwinds mentioned previously. With that said, for the third quarter of 2022, we expect revenue in the range of 62.5 million to 63.5 million, representing growth of 24% to 25% year over year; non-GAAP operating loss in the range of $15.5 million to $16.5 million. For the full year 2022, we are lowering our top-line revenue guidance and lowering our expected operating loss range. We expect revenue in the range of 246 million to 249 million, representing growth of 27% to 29% year over year, non-GAAP operating loss in the range of 68 million to 65 million, reflecting a gradual improvement in operating leverage in the second half of 2022 as we continue to see returns from our investments.\n\nWith that, Dan, Rafi, Scott, and I will take your questions.\n\nOperator\n\n[Operator instructions] We will take our first question from Michael Turits from KeyBanc. Your line is open. Please go ahead.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nHey, guys. Congrats on the good numbers and expansion rate for those large customers. Good to see those -- that enterprise focus. Can you talk a little bit more about the Fed opportunity and how close you're getting there? And then also, talk a bit about the move to free cash flow breakeven next year.\n\nI assume that's just on a one-quarter basis. How sustainable is that? And when do you think we're going to actually get to that free cash flow breakeven on a full year basis?\n\nAndrew Casey -- Chief Financial Officer\n\nHi, Michael. It's Andrew. I'll take the first two, and Dan can back me up on Fed if you had more specific questions. But I'd tell you, we're making progress in line with our expectations on the certification.\n\nThe teams are very focused, and I expect that we'll be showcasing our progress on that front with greater detail in the coming weeks. So we're very pleased with the progress there. On a free cash flow basis, I would tell you there's a couple -- whenever you drive big operational improvements, there's many factors which contribute to improving. Most importantly for us is we're very proud of the fact we're using our own product internally in our WalkMe for WalkMe program.\n\nWe're driving process efficiencies improvements in how we operate, and that's showing up in a real way in our operating expenses. So, very proud of the progress the team has made there and the areas we focus, which is really every major operational unit. The other thing that I'd tell you is, you know, when you get the teams really focused on executing on a singular goal and that singular goal highlights inefficiencies in other areas, we all work toward -- all work together toward making sure that we're optimizing every dollar we spent. And I will tell you that when we talked about that at our analyst day, the response from our employees was tremendous.\n\nAnd everybody was giving us new ways in which we could drive efficiencies in our model. And it's all -- it's not about major, major improvements, although our sales and marketing areas where we have to drive some big efficiencies, it's all these little things that come together when you work as a cohesive unit that makes the improvements palatable. And so, you're right that, you know, we're talking about in terms of hitting free cash flow positive position, you know, in 2023. And I do think that given the strength of our model and our framework and our unit economics, that we'll continue to do that on a sustainable basis.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nThanks, Andrew. And I think we're going to discuss the Fed, right, was the other one?\n\nAndrew Casey -- Chief Financial Officer\n\nWell, so I'd say the Fed progress has been going great for us. We're well on pace for meeting our objectives. And I expect that we'll be showcasing, you know, our progress on the certification in the coming weeks.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nOK. Thanks.\n\nAndrew Casey -- Chief Financial Officer\n\nYup.\n\nOperator\n\nWe will take our next question from Scott Berg from Needham. Your line is open. Please go ahead.\n\nScott Berg -- Needham and Company -- Analyst\n\nHi, everyone. Congrats on the sales in the quarter. Thanks for taking my questions. I guess I've got a couple of things here.\n\nFirst of all, I wanted to start with the new chief revenue officer, welcome to the call. But then I wanted to try to maybe get some commentary and understand, you know, what new process efficiencies or changes in the sales organization we can maybe expect over the next, I don't know, 12 to 18 months. Thank you.\n\nScott Little -- Chief Revenue Officer\n\nThank you, and I'm glad to be on board. I don't expect significant organizational changes per se. I think they're in pretty good shape from that perspective. But there are some discipline and efficiencies, I think, we can drive in the way in which we manage pipeline and the way at which we manage aging maturity.\n\nJust things that as you would expect for the company to mature itself that you would see in the sales organization. So, there's no magic here, just good sales discipline, and approach.\n\nScott Berg -- Needham and Company -- Analyst\n\nGot it. Helpful. And then, Andrew, on your guidance here for the second half, we can obviously back into the fourth quarter guidance. And your guidance assumes a little acceleration in revenue growth rate from Q3 to Q4.\n\nWanted to try to understand where the confidence in that guidance comes from and is just something in, I don't know, sales cycles or deals that moved from Q2 into Q3 that's helping that. But any color there would be great. Thank you.\n\nAndrew Casey -- Chief Financial Officer\n\nSo, certainly, Scott, you remember that when we talked about the Q2 earnings, we did talk about a few opportunities that we had slipped, you know, from the quarter and then moved into Q3. And I'd certainly tell you that we did a great job in closing almost all of those that had slipped in one of our major areas. So, we're pretty pleased with the linearity that we saw in the quarter on -- especially with respect to those deals as well. You know, when you look at our history on our revenue profile, the Q4 is always our strongest period, you know, throughout the year, and it's a reflection of the fact that how we actually go through our selling process and, frankly, how our PS revenues line up to on a quarterly basis as well.\n\nSo, it's really more linearity than anything else. But the thing that -- despite the macroeconomic headwinds that we're all talking about, and they're well documented, I will tell you that I'm really pleased with how well our pipelines are lining up to align to our G2Ks and our enterprise, large enterprise. It's -- we put -- made that as a focus, and the teams reacted, and the pipeline is really shifting in a material way toward the right customers. And I talked about that in our analyst day.\n\nIt's really about focus on the right customers that can expand with us and have the problems with which we can solve. The other thing I would tell you is that the pipelines are exhibiting more and more expansion opportunities, and it is a reflection of the sales efforts and the sales motions we're driving. And you don't have to go sign up a new client with a new contract and go through all the DPA and the security reviews. It makes the sales cycles easier.\n\nAnd so, that weighs a little bit in our optimism with respect to how we would operate in Q4. So, I don't -- I want to be prudent about how we're actually setting guidance with respect to the broader macro environment. But for us, the levers we've pulled and the ones we highlighted are starting to show up in a material way, and it feels like we're just positioning the company very well for long-term growth.\n\nScott Berg -- Needham and Company -- Analyst\n\nGreat. Super helpful. Thank you for taking my questions.\n\nOperator\n\nWe will take our next question from Kevin Kumar from Goldman Sachs. Your line is open. Please go ahead.\n\nKevin Kumar -- Goldman Sachs -- Analyst\n\nHi. Thanks for taking my question. One on the updated guide, just given the increased profitability expectation, how much of that is improvements to maybe sales rep productivity? And are there any changes in terms of sales capacity investments in the back half of the year? Thanks.\n\nAndrew Casey -- Chief Financial Officer\n\nSo, I'll take that one, and I'll let Scott maybe comment if he wants to on sales capacity. I would tell you that you may recall that we hire most of our sales capacity at the beginning of the year. And so, we made those investments with the expectation that they would get more and more productive as we go throughout the year. And certainly, in certain markets, in certain segments, we're seeing that productivity as we expected.\n\nAnd that's certainly given us a lot of confidence that the investments we made, we can continue to drive that focused sales efficiency. And I also told you at the analyst day that we are focusing our efforts on specific market segments and specific opportunities. And in other areas where we're deemphasizing, we're not spending as much time and effort investment on. And that's allowing us to drive greater efficiencies overall.\n\nYou know, it's amazing when you start focusing on the types of customers that give you the greatest profit, how much you can then focus the teams on doing the right activities. And so, that's really kind of all of it built up, Kevin, and it's ones that I think we can continue to execute and grow our business with the sales teams that we have in place. I don't think we have to have materially greater hires in order to reach our growth goals. What we need to do is drive greater efficiencies in the investments we've made.\n\nScott Little -- Chief Revenue Officer\n\nAnd I guess -- this is Scott. I would add to that, that it's not just a combination of greater efficiency in the sales organization and the right deployment of rep resources, it's also greater efficiency and better communication with the marketing side of the house, right? So, I think we're going to get a lift out of both of those going forward and with an expectation that I don't see a significant increase in sales and marketing expenditure to achieve the growth that we need.\n\nKevin Kumar -- Goldman Sachs -- Analyst\n\nSuper helpful. Thank you. And then one on the Celonis partnership. I think it's been a couple of months since that was announced.\n\nAnd curious if you're starting to see customers leverage the combination of Celonis and WalkMe. And is that accelerating say the identification of technology gaps and time to value for customers? Thank you.\n\nDan Adika -- Co-Founder and Chief Executive Officer\n\nHey, this is Dan. So, we are seeing the pipeline growing, and there is a lot of interest especially with the larger enterprise. We have a lot of CIOs asking about it. We're joining a lot of calls.\n\nThat was our first, obviously, integration with them. So, we are looking in the next quarter to have at least one or two big customers to try it out. So, we're pleased with that. But the interest just keeps growing and growing.\n\nAnd obviously, we're working on phase 2 with them to deepen the technology partnership.\n\nKevin Kumar -- Goldman Sachs -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nWe will take our next question from Vinod Srinivas from Barclays. Your line is open. Please go ahead.\n\nVinod Srinivasaraghavan -- Barclays -- Analyst\n\nHi. Thanks for taking my question. Just wanted to talk a little bit about your kind of revenue growth versus free cash flow profitability philosophy given that you've moved up the free cash flow goal by about one, two years. Can you just talk about the formula for reaching the Rule of 40 now? And do you still expect to get there by 2024?\n\nAndrew Casey -- Chief Financial Officer\n\nSo, the short answer there is yes, we do. And I think that we still fancy ourselves as a company that can still drive 30-plus percent revenue growth year over year given the market opportunity we see in front of us. Now, having said that, the guidance we're giving is the guidance. And it's based upon the way -- what we see in front of us and some of the macroeconomic headwinds we're all experiencing.\n\nBut I do believe that over the short term and, certainly, what we're thinking about increasingly is second half of this year and into 2023, there's not a lot of more incremental investments we need to make in order to really drive the revenue growth that we see. So that's really the basic formula. We've got a lot of little different initiatives on every major line to go drive improvements in our operating leverage. And the actions we've taken, and some of them date back, you know, a year or two, we're starting to see the benefits from those actions now in our operating model.\n\nSo, it's not magic, it's just hard work. And we heard the market and the feedback from when we rolled out our initial investments at the beginning of the year, and we doubled down on our focus on operational efficiencies and targeting the right customers. And that really helps get the whole company aligned on the outcome of driving toward free cash flow positive position.\n\nVinod Srinivasaraghavan -- Barclays -- Analyst\n\nGot it. No, that's helpful. And then can you just talk a little bit about kind of the cadence of demand through the quarter given that you do report a little bit later than some other on-cycle companies and kind of the trends from later in June continued through July into early August. And then I guess a quick follow-up on that, you talked about how G2K customers make up, you know, maybe about -- I think there are about 60 of them that are DAP customers.\n\nCan you talk about how some of those customers specifically performed versus the overall base?\n\nAndrew Casey -- Chief Financial Officer\n\nSo, I'll take the second part first. I think that one of the reasons why we're very optimistic that the things that we're doing are the right things is that the DAP customers we added during the quarter were G2K customers in some -- in a couple of cases. And of those cases, even the G2K customers that were already DAP were the ones that were expanding with us. So, we're showcasing our technology to the largest companies in the world, and they're seeing the benefits associated with broad adoption -- and when they do, they are able to improve their business processes in a meaningful way.\n\nAnd that's really been our optimism that we've done the right things. It's focusing our organization. So, no major change in that focus. I think we're not just seeing the benefits of it.\n\nYou'll see it in our DAP customer number, I think, on a go-forward basis. We're going to continue to see that progression. And you may remember, I talked about G2Ks and the progression there. I reminded -- I told everybody at that point in time, we had over 380 G2K customers.\n\nBut of those G2K customers, we only had 59 that were DAP. And that's the real opportunity, taking those G2K customers and showcasing our technology capability and making them DAP. And so, the more DAP customers we can drive, the better off we'll be at really driving our growth. And if you do the basic math that I'd shared before, it's a $200 million-plus opportunity for us just focusing on our existing customers by making them into a DAP customer.\n\nDan Adika -- Co-Founder and Chief Executive Officer\n\nRegarding the unit economy of a DAP-specific average deal, it grew to 725 from 540. So, the deals themselves are also growing, the average deal size. And that --\n\nVinod Srinivasaraghavan -- Barclays -- Analyst\n\nThat's helpful. Thank you. And just on the demand part of the question?\n\nAndrew Casey -- Chief Financial Officer\n\nYeah. So I wouldn't say that the demand profile has substantially changed for us. I think we're like every other major enterprise software company that has a back-end loaded quarter from a linearity perspective. But certainly, our thought process is when every other company is talking about demand headwinds and lengthening sales cycles caused us to really reflect on what the right position was for us on guidance.\n\nAnd as we shift upmarket and talk to larger and larger clients, you know, invariably, what happens is you get into longer-than-prior sales cycles. And we want to be prudent about how we approach that and make sure we're being clear with our teams and with our investors that as we do that, there may be some short-term impacts. Longer term, it's absolutely the right strategy, it's absolutely the right focus, and we're seeing it in our core metrics.\n\nDan Adika -- Co-Founder and Chief Executive Officer\n\nAnother great thing we see in our demand metrics is an increase from the partners, more demand driven by partners, and that's another significant thing. And the partner deals that are coming are larger in their ASP.\n\nVinod Srinivasaraghavan -- Barclays -- Analyst\n\nAll right. Thank you. I appreciate that color.\n\nOperator\n\nWe will take our next question from Michael Turrin from Wells Fargo Securities. Your line is open. Please go ahead.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nHey. Thanks. Good morning. Appreciate you taking the question.\n\nI think maybe just taking a step back, it would be helpful if you could just spend some time on what you're learning around selling into the DAP space in the current environment. You mentioned landing the largest deal ever during the quarter. Also, it sounds clear there's a more measured stance in framing targets for the back half of the year. So, just how much of the shift in outlook comes from the continued deemphasis of smaller customers and impacts you're expecting there? And then on the larger customer side, are there ROI or efficiency gains you're finding yourself able to lean into in the current environment to help offset some of that elongation or just constrained environment that we're hearing more broadly across software?\n\nDan Adika -- Co-Founder and Chief Executive Officer\n\nHey, Mike, I will start. So, as I mentioned just now on the call, in the quarter we signed our largest deal ever in our history, and that was an expansion. So, what we're seeing is that our larger customers continue to increase their spend with us because they're seeing the gains and the ROI from deploying a Digital Adoption Platform. And it's clear to them that they need to go enterprisewide or to start deploying WalkMe on more and more and more applications.\n\nSo, we're seeing it across all our DAP customers. This is why the average per customer went up to 725. As they're deploying it, we absolutely think that in today's economics, WalkMe and DAP in general will help them a lot, one, saving money on software, increased productivity, and just gain ROI from their current investment. So, we are suited to be this solution to help organizations utilize their spend on software.\n\nSo, we're happy to see it, and we're seeing more and more and more of our customers expanding with us. And as I mentioned on the call, three of our customers that are paying us over $1 million ARR increased by more than $1 million ARR. So, that was a big sign for us that we're doing the right thing.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nThat's all helpful. Maybe just as a quick follow-on, Andrew, in terms of what's assumed in the outlook for the rest of the year, is it just big picture what you're seeing currently holds throughout the rest of the year? Are you allowing for additional impacts for those to surface? Or how do you approach framing targets given a bit more uncertainty here and just how much visibility do you have into targets between now and end of the year? Thank you.\n\nAndrew Casey -- Chief Financial Officer\n\nSo I think we've got good visibility on our pipeline. And as Scott said, he's doing more and more to drive discipline in how we frame those pipelines and how we mature them. So, that part is really positive. I will tell you that we were very intentional with our guidance with respect to the less than 500 employee accounts.\n\nThat's where we've shifted away our focus. And I do expect that when you shift away your focus away from roughly 7% of our ARR, there's going to be some headwinds there that may accelerate. And that factored definitely into softening of our revenue guidance. It's a little bit nuanced.\n\nNow, we're doing some shifts away from the less than 500, but there's also the larger impact from macroeconomic on small and medium-sized business clients. When we entered into -- when we had the slowdowns associated with COVID back in 2020, the biggest customer segment impact we had was on our small, medium-sized business clients. So, as we look out and see and expect that there's going to be some headwinds, that's the market segment for us that will be hit naturally by a slowdown. So, it's a little bit nuanced on trying to split hairs between what is more macroeconomic versus intentional on our part to shift away from less than 500.\n\nBut it does weigh heavily on our thought process and what the second half guidance is going to be.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nOperator\n\nWe will take our next question from Tyler Radke from Citi. Your line is open. Please go ahead.\n\nTyler Radke -- Citi -- Analyst\n\nHi. Thank you. Good morning, and appreciate the questions. I wanted to ask you just about the $1 million customers, it looks like you haven't added a new $1 million customer in Q1 or Q2.\n\nYou added about seven in the first half of last year. You are talking about some pretty good expansions within those $1 million customers. So, could you just help us understand, you know, your outlook there. Were some of those new million dollar customers part of the slip deals you referenced that closed in Q3? Or was there any, you know, churn from that existing cohort that just kind of makes that metric, you know, look flat over the last couple of quarters? Thank you.\n\nDan Adika -- Co-Founder and Chief Executive Officer\n\nYes, so I'll start with the end. We have absolutely 0 churn in that million-dollar cohort. Actually, they're just expanding. I would say, as we're a new category, and we're entering an organization, we need to prove our value.\n\nSo, to get a customer to the first million, that's the goal and that's harder. On the flip side, when we are getting to a million, we are seeing those customers increasing. So, we didn't add new $1 million customers, but we added more than $1 million with those existing customers and signed our biggest deal in the company history, adding another over $3 million in ARR just in one account. So, we are seeing that trend.\n\nSo, our goal is obviously to continue to adopt deployment, see more and more and more adopt customers and will time -- with time, it will get to more $1 million ARR customers. The good sign, as I said, as I mentioned, is the existing customers are continuing to expand.\n\nAndrew Casey -- Chief Financial Officer\n\nSo, the other thing I'd add to that, Dan, is that we did see good increases in the number of customers greater than 100,000. And virtually all those customers that each are up a million were expansions. They grew over a period of time.\n\nDan Adika -- Co-Founder and Chief Executive Officer\n\nYup.\n\nAndrew Casey -- Chief Financial Officer\n\nSo as we're adding more and more customers even in the great 100K, they're expanding, too. The average ARR for that cohort grew 38% in overall value and in quarter over quarter -- sorry, year over year grew -- the average ARR grew 12%. So, as those customers continue to expand, they'll graduate into million-dollar customers. And we go back to where our focus is, is we've got a lot of opportunities to go drive expansions to the clients.\n\nYou can bet that in the future, we'll see more and more graduate.\n\nTyler Radke -- Citi -- Analyst\n\nThat's helpful. And maybe a follow-up just on the ARR outlook for the full year. How are you just thinking about kind of your revisions to maybe your ARR forecast? I know you took revenue down. And anything we should keep in mind in terms of seasonality? I know Q3 is typically a bit softer for you guys because of summer and typical Q3 seasonality, but it did seem like maybe this year, you do have the benefit of some slip deals.\n\nSo, maybe just frame for us how we should be thinking about ARR seasonality for Q3 and Q4. Thank you.\n\nAndrew Casey -- Chief Financial Officer\n\nSo, thanks for that. I appreciate the question. I think you're absolutely right. And, you know, typically, you see a little softness in the new year to year-round around this time.\n\nAnd as well, I'd say, look, this is also the time when we're seeing some of the initial churn from the SMB client, so it's going to be something in the line with what we saw in Q2. But when -- in Q4 is typically where we see our largest ARR contribution, so we're going to see that same type of seasonality. Obviously, there's a lot of things at play with respect to that, but I wouldn't expect huge growth in Q3. And I'd point you to those same types of linearity you saw last year to try and come up with your thought processes on how ARR will look in the second half, where we really did -- we did have some softness last year in Q3 on ARR.\n\nBut we more than made up for that in Q4.\n\nTyler Radke -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nWe will take our next question from Josh Baer from Morgan Stanley. Your line is open. Please go ahead.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nGreat. Thanks for the question. Clearly, some great expansion trends that we're seeing and talked about strong pipelines. At the same time, we have this macro backdrop and, I guess, some commentary on slip deals.\n\nSo, just wanted to get a better sense for sales cycles and how your conversations with customers are going in light of this macro maybe both from the perspective of existing customer -- existing large customers and then also for new potential customers.\n\nAndrew Casey -- Chief Financial Officer\n\nYes. So I'd start with -- on -- whenever you're moving your focus on, say upmarket, you're going to see that the overall average deal cycle time will extend a bit. I mean just naturally, as we shift more and more of our focus on the large customers, you'd see that extension. The good thing is the focus in the pipeline we've got is weighted more toward expansion, so it's not trying to capture a lot of new clients.\n\nHowever, you know, I'll also tell you, I don't want to over-rotate too much on just focusing on expansions, we're still focusing going after new clients as well. There's -- we have objectives to go capture a lot of new G2Ks, and those are in our pipeline, too.\n\nDan Adika -- Co-Founder and Chief Executive Officer\n\nYes. And I would add two things. One, as you know, when we started WalkMe 10 years ago, we're very much focused on the use case base. So, we sold WalkMe product, WalkMe for Salesforce, WalkMe for Workday.\n\nNow, as we are expanding the DAP category and we're seeing massive demand for Digital Adoption Platform, obviously, those conversations are much more wider. So, when we're talking with CIOs or COOs within companies, we're talking on a much bigger deployment. Just as I just said about Workstation, which is an employee app that sits on every employee desktop, this is much different deployment with much greater value than just overlaying WalkMe on your Salesforce or CRM or HCM. So, obviously, it takes a little bit more time because the value is bigger, the deployment is much, much deeper, but the value of the contract is way higher.\n\nSo, that's the focus. That's what we're seeing that's working. And obviously, that's our mission and our promise. We want to help companies with their digital transformation goals and KPIs.\n\nAnd this is not just a per app deployment, this is a full enterprise deployment that we can touch every employee, every technology, every business process. I hope it answered the question.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nYes. Thank you.\n\nOperator\n\nWe will take our next question from Pat Walravens from JMP Securities. Your line is open. Please go ahead.\n\nPat Walravens -- JMP Securities -- Analyst\n\nGreat. Thank you. And congrats on all the progress. So, I guess maybe, Dan and Andrew, I'm not sure, but I'd love your perspective -- this is a very big picture.\n\nI'd love your perspective on where WalkMe and digital adoption fits in strategically with what other players are doing. So, you have a partnership with Celonis. Celonis started as process mining, now they're positioning themselves as execution management software. You integrated with ServiceNow, which is where Andrew worked before.\n\nAnd they have their creative workflows, and that includes the low code and RPA. I think it's really confusing for investors. How do all these pieces fit together? And where do you fit in?\n\nDan Adika -- Co-Founder and Chief Executive Officer\n\nSure. So I would start -- I would go to those specific examples that you just mentioned, Celonis and ServiceNow. So, Celonis is doing back-end business mining, business process mining, right? They're taking all your transactions from the database, from the log. But they don't have anything on the front end, like what the users -- how users are actually interacting with software.\n\nSo, that's one. On the ServiceNow, yes, they have great inspiration obviously to be the work [Inaudible] or something like that. But reality is that companies are deploying a lot of software. Just in sales, they're using eight to 12 different applications, not mentioning HR, benefits, payroll, and so on.\n\nSo reality is that employees are not using one vendor, they're not using one application. They're using multiple. We're talking about 20, 30 and, in some cases, much, much more. Think about organizations, big organizations that making acquisitions.\n\nThey have four or five different CRMs from different vendors. It can be Oracle, Salesforce, Microsoft, you name it. At the end of the day, the employee needs to be productive. They need to complete the process.\n\nAnd this is exactly where we fit. We're sitting on every employee front and -- or on the application or on the desktop, and we're helping them execute business processes being more efficient, data validation, ensuring that they're doing their job correctly, onboarding search, a lot of features. But at the end of the day, we are the last mile from the employees. Integrations that we have to ServiceNow or to Celonis, just making our customer getting most out of what WalkMe can do.\n\nSo, for example, our integration with Celonis, we're allowing Celonis to activate automation and action on the user desktop based on their data, right? So, they have this amazing data, but what now? How we can actually make the user take an action? So, Celonis trigger WalkMe via API, and then WalkMe pops on the screen. If you have ServiceNow, think about how many different processes you need to do, and not all of them is on ServiceNow. Sometimes, you need to go to your HCM, update details, then go to ServiceNow, then go to Salesforce, then go to another application. You don't want it to be -- break or you don't want the employee to be confused just because they need to go to one other solution or one other piece of software.\n\nAnd obviously, WalkMe is orchestrating all of it. So, I hope it answered the question, I would be happy to do a follow-up if you have.\n\nPat Walravens -- JMP Securities -- Analyst\n\nThat's great. Thank you.\n\nOperator\n\nIt appears there are no further questions at this time. Mr. John Streppa, I'd like to turn the conference back to you for any additional or closing remarks.\n\nDan Adika -- Co-Founder and Chief Executive Officer\n\nYeah. I want to thank everyone, our team, our customers, and our investors, analysts, everyone on the call. Thank you for being with us today.\n\nOperator\n\n[Operator instructions]\n\nDuration: 0 minutes\n\nJohn Streppa -- Head of Investor Relations\n\nDan Adika -- Co-Founder and Chief Executive Officer\n\nScott Little -- Chief Revenue Officer\n\nAndrew Casey -- Chief Financial Officer\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nScott Berg -- Needham and Company -- Analyst\n\nKevin Kumar -- Goldman Sachs -- Analyst\n\nVinod Srinivasaraghavan -- Barclays -- Analyst\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nTyler Radke -- Citi -- Analyst\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nPat Walravens -- JMP Securities -- Analyst\n\nMore WKME analysis\n\nAll earnings call transcripts"
}