{
  "companyName": "ABB",
  "companyTicker": "ABB",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/20/abb-abb-q3-2022-earnings-call-transcript/",
  "content": "ABB (ABB -1.36%)\nQ3 2022 Earnings Call\nOct 20, 2022, 1:00 a.m. ET\n\nAnn-Sofie Nordh\n\nGreetings to all, and nice to connect again, as I welcome you to the presentation of ABB's third quarter results. I'm Ann-Sofie Nordh, head of investor relations. And next to me here is our CEO, Bjorn Rosengren; and our CFO, Timo Ihamuotila. They will, as usual, take you through the presentation before we open up for the Q&A session.\n\nBut before we begin, I should mention the information regarding safe harbor notices and our use of non-GAAP measures on Slide 2 of the presentation. Also, this call will include forward-looking statements, which are based on the company's current expectations and certain assumptions and are, therefore, subject to certain risks and uncertainties. And with that said, I will hand over to Bjorn and Timo, later on, for their quarterly comments.\n\nBjorn Rosengren -- Chief Executive Officer\n\nThank you, Ann-Sofie, and a warm welcome from me as well. I have to say, I'm very pleased with our performance this quarter. Operation numbers show strength and verifies that ABB is moving in the right direction, even faster than we originally had anticipated. You have probably already figured out that I'm very happy about the high margins of 16.6%.\n\nIt looks like we likely will reach our margin targets one year early. But I'm also pleased that we executed on our promises of portfolio management. In my view, today's result is a good indication that we are improving operational performance through our new way of working, accountability, transparency, and speed. To me, some proof points are our strong and broad price execution.\n\nThe record-high margin, we have made division-led acquisitions, we divested noncore operations, and we completed the spin-off of Accelleron. In short, we are making ABB a more focused and well-performing company with focus on being a technology leader in electrification and automation. That said, we still have a couple of matters that needs to be resolved. One such item is the legacy Kusile project.\n\nWe now booked a provision related to this, which impacted EPS performance in the quarter. We feel confident that there will not be any additional material provisions related to these matters. I will come back to this a little bit later. Before we move on, I want to comment on E-mobility.\n\nWe have said that we want to list part of this company. And we remain committed to this. But given the high volatility in the capital markets, we do not see it happening this year. We follow the market development closely, and we'll come back when we feel circumstances are right.\n\nNow, let's look more closely at orders and revenues on Slide 4. In our results, FX, especially the continued strengthening of the dollar, was a big negative swing factor of 9% to 10% when you compare our reported orders and revenues with the organic development. But looking beyond that, we had another strong growth quarter with comparable orders up 16%. We saw a stable to positive development in most customer segments.\n\nEasing of component constraints will shorten delivery lead times, which should trigger a normalizing of the order pattern. Still, it was another strong quarter for orders. It was actually the seventh consecutive period with a book-to-bill ratio above 1. And our order backlog remains on the record high-level.\n\nLooking at the revenue chart on the slide, you see that this was one of the strongest quarters; comparable growth of 18% with a positive development in all business areas. This reflects a strong price contribution. But I was also pleased to finally see volumes released to a greater extent than in the previous quarters. Deliveries were held by better availability of electrical components.\n\nAnother positive was that our China business faced less business disruptions from COVID lockdowns. Now, let's take a quick look at the different regions. Both Americas and Europe improved by 20% or more. They clearly outpaced the 4% growth in AMEA.\n\nIn Americas, the important U.S. market increased by 29% on a strong development across most segments. In Europe, orders increased in most of the major markets. In the AMEA region, China declined by 2%.\n\nThree of our businesses areas saw a lower orders in China with only Motion in positive territory. Let's turn to Slide 6 and our earnings outcomes. Gross margin is important, and I was pleased to see an improvement of 90 basis points to 33.5%. The high volumes clearly helped, but also very good price execution of close to 7% for the group.\n\nWe increased operational EBITA by 16%. But the underlying improvement was even stronger. If we exclude the negative FX, earnings were actually up by 27%. I already mentioned the strong margin of 16.6%.\n\nWe achieved this through an impact from high volumes, good operational performance, and well-executed price management. We are clearly becoming more efficient. I mentioned the Kusile project earlier. As a reminder, this is the legacy project dating back to 2015.\n\nAnd we are now finally resolving the remaining matters of this topic. This triggered a nonoperational provision of $325 million in the quarter. So, on the back of this charge, despite our strong operational performance, EPS declined from last year. We feel confident that there will be no -- not any more additional material provision related to these matters.\n\nSince the Kusile case was reported, ABB has spent considerable time and efforts, including launching a new code of conduct, educating employees, and implementing control system to prevent something similar to happen again. It is very important that our stakeholders feel confident in ABB and our business. With that, I hand over to Timo.\n\nTimo Ihamuotila -- Chief Financial Officer\n\nThank you, Bjorn, and greetings to everyone also from my side. First, I want to connect to Bjorn's Kusile comment. Once this is resolved, I would say that besides the one noncore item of max 100 million of risk, which we have mentioned to you already before, we are now in normal course of business. Fundamentally changing ABB's risk profile has been a painful journey during past years.\n\nNow, we are pretty much done. We have a strong balance sheet. We have a net positive pension position. And we have not been doing ABB business in a while, and it is not coming back.\n\nSo, we are in a good position going into 2023. OK, let's then look at the performance in the business areas, which actually all contributed to comparable growth, as well as earnings and margin improvement. Starting with electrification, where we continue to see strong customer activity, which resulted in comparable orders being up 20%. Looking at the total picture, we saw strength in all customer segments, and all regions improved at a double-digit rate.\n\nIf you take a slightly more granular look, we actually saw softness in some segments in China, which declined by 4%. In Europe, Germany stood out in the sense that orders declined. Germany is a distribution-led market, and we saw distributors bringing inventories to what seems to be a normalized going-forward level. I should also mention that very strong comparable order growth in the U.S.\n\nat 37%. It was good to see that pricing was a strong top line driver also in this quarter. But importantly, we now also saw volumes improving as a result of a generally strong market and easing of supply chain constraints. This helped momentum in customer deliveries, also in distribution solutions, which earlier has been hampered by semiconductor shortages.\n\nIn total, comparable revenues grew by 22%. But still, the order backlog increased to all-time high level of 6.8 billion as book-to-bill remained above 1. Electrification operational EBITA margin came in at a very strong 18%, the highest level in recent history. This was primarily driven by a good development in volumes and the continued strong price execution, which more than offset cost inflation.\n\nThe margin expansion of 210 basis points admittedly included approximately 50 basis points tailwind from a two-years-old insurance play. Looking ahead into the fourth quarter, we expect double-digit growth in comparable revenues and the seasonal pattern to repeat, meaning a sequentially lower operational EBITA margin. Let's then move on to Motion on Slide 8. Motion's orders again came in at around 2 billion, despite the headwind from the stronger dollar.\n\nIn addition to a strong underlying market, the 24% comparable growth was also driven by large orders, including the approximately 170 million in traction orders, a really good example on how we are supporting sustainable mobility in line with our purpose. Our cutting-edge technology include high-efficient traction converters and motors that will power more than 300 new trains, reinforcing Europe's railway network. Looking at the revenue chart in the middle of this slide, you'll see a clear acceleration in comparable book growth to 23%. In addition to the continued solid pricing execution, we now saw volumes contribute to growth, helped by strong demand, improved supply chain, as well as a sequential recovery in customer deliveries in China as COVID-related business disruptions eased.\n\nThe strong top-line development was also reflected in Motion's operational EBITA margin of 17.8% as higher volumes facilitated an improved fixed cost absorption. Price increases continued to offset the negative impact from higher input costs, but also a slight negative product mix which was triggered by high deliveries of electrical motors. The margin increased by 40 basis points from last year, which is a strong outcome, also taking into account that this includes about 60 basis points dilution from the Dodge divestment. Looking ahead into the fourth quarter, Motion is facing a challenging revenue comparable from last year.\n\nHence, we anticipate a sequentially lower growth rate to comparable revenues. We expect the operational EBITA margin to decline slightly, a Q4 pattern you recognize from earlier years. Turning then to Slide 9 and Process Automation, for which the underlying market activity continued to be strong, particular strength was noted in end markets like gas, mining, and refining, while there was some signs of headwinds in the more energy-intense segment of the metals industry. Services was up 12%.\n\nPA's total comparable order growth of 3% was impacted by the timing of customers placing orders, particularly in the energy industries and marine and ports divisions. Regionally, Europe and the Americas both saw high single-digit growth, while AMEA declined, as China orders were down 11% from a high comparable from last year. The sequential decline in the order backlog that you can see on this slide was mainly driven by FX movements. In constant currencies, the order backlog increased compared with the end of the second quarter, as the book-to-bill ratio remained above 1.\n\nRevenues grew 6% on a comparable basis with contribution from all five divisions. We did see a sequential easing of component shortages but are not totally out of the woods yet. Looking at profitability, you can see that the operational EBITA margin reached the highest level in recent history at 15.3%, expanding 160 basis points from last year. As a reminder, we have earlier mentioned to you that turbo has roughly 180 basis points profits positive impact on the PA margin.\n\nHigher volumes and mix were key drivers, but also some benefits from earlier taken efficiency measures. It is great to see that the team's conscious efforts to improve the gross margin in the order backlog is now being realized in revenues. The margin trajectory is clearly moving in the right direction. Looking at the expectations for the fourth quarter, I note that PA had very high revenues in Q4 last year.\n\nAnd consequently, we anticipate a low or even slightly negative comparable revenue growth rate in Q4 this year. We expect operational EBITA margin to be similar to last year's reported level, even excluding the high-margin Accelleron business. On Slide 10, we turn to Robotics & Discrete Automation, where overall customer activity remained at the high level. That said, the lower comparable order growth reflects customers returning to a more normal order pattern, as they seemingly anticipate the easing of supply chain constraints to shorten delivery lead times ahead.\n\nIn addition, there were some signs of customers taking slightly longer to place orders, but we still see a robust opportunity pipeline. Looking at comparable revenues, it was good to see RA return to positive growth of 12% after having been held back by shortages of electrical components and COVID-related lockdowns in China in recent quarters. While it is still no walk in the park, we would expect this improved supply situation to sustain and support deliveries from the backlog in both divisions. I'm also happy to say that the new robotics manufacturing site in Shanghai is now fully operational, and volumes were transferred during the quarter.\n\nSimilar to the other business areas, RA's profitability benefited from higher volumes and a positive price impact as the operational EBITA margin increased by 170 basis points to 12.8%, underlined by both divisions in double-digit territory. For the fourth quarter, we expect an even stronger growth rate for comparable revenues than what we had in Q3 supporting some sequential margin improvement. Moving to Slide 11, showing the group operational EBITA bridge, as you can see, the comparable earnings improvement benefited from our strong pricing execution and the recovery in volumes, which more than offset the adverse effects from cost inflation. Acquisitions and divestments, mainly Dodge, as well as the impact from changing FX, were slightly diluting on a group level.\n\nLet's now look at our cash flow on Slide 12. It was good to see our back-end loaded cash flow expectations for the year coming through, with the third quarter cash from operating activities in continuing operations at $793 million. Compared with last year, the cash impact from better operational performance was, however, more than offset by negative movements in trade working capital. The reasons primarily being a higher buildup in inventories and less favorable change in trade receivables to support strong continued order intake and higher revenue levels.\n\nIn this quarter, we had a negative cash impact of about 125 million from the exit of one noncore legacy businesses as announced in Q2. Looking ahead, I want to remind you about couple of items, which will impact our future cash flows. First, Bjorn mentioned earlier, the Kusile provision of about 325 million. This is expected to impact our cash flow in the coming quarters as we finalize the settlement.\n\nOn a more positive note, we also received about $1.4 billion in cash flow from investing activities from the sale of the remaining stake in Hitachi Energy, as we expect to close the transaction now in Q4. Now, you have heard us talk about being more active on the M&A side. So, before I hand over to Bjorn, let me briefly walk you through what we have done here. We are actually picking up the pace.\n\nAdmittedly, they are small tickets, but this is natural, since smaller tends to be easier to find and close. The important thing is that our new processes work. Through the implementation of the ABB Way, we have significantly change how we work with M&A. First, we have increased the analytical discipline for acquisitions.\n\nThen, as a consequence of the decentralized ABB Way operating model, we have transferred the responsibility to build the target pipeline to the divisions, i.e., close to the market. Each division is different and has different investment needs to secure future growth. We firmly believe that this new setup will result in more focused and accurate growth activities. We simply think that doing many smaller deals is better for the buyer.\n\nBjorn mentioned earlier division lead acquisitions in this quarter. Motion announced their first two acquisitions in a long time. Both the Siemens' low-voltage NEMA motor business and the PowerTech Converter acquisition will help respective divisions to further cement their leading market positions. And then looking at the gray dots on the right side of this slide, you can see that we have also driven minority investment through our divisional lenses.\n\nBoth the InCharge Energy and Numocity majority acquisitions made earlier this year are good examples that these minority investment can later also become acquisition targets. So, in summary, I feel we are on the right track to drive value creation also through inorganic growth. And with that, let me hand over to Bjorn to some final comments.\n\nBjorn Rosengren -- Chief Executive Officer\n\nThank you, Timo. And lastly, on Slide 14, we take a quick look at the expectations for Q4. We expect the low double-digit comparable revenue growth impacted by the high-level of revenues recorded last year. The operational EBITA margin is typically lower in Q4 compared with Q3, and we expect this pattern to repeat also this year.\n\nWe have had good performance so far this year, and we are likely to achieve our margin targets already in 2022. We will leave the 2023 targets unchanged. And what we mean is that any normal market fluctuation should not prevent us from achieving our operational EBITA margin of at least 15%. And with that, I will let Ann-Sofie start the Q&A.\n\nAnn-Sofie Nordh\n\nYes, let's open up for the Q&A. And for those of you that have dialed in on the phone, you press star 14 to register to ask a question. And just as a reminder to secure the sound quality, please do remember to mute the webcast as your line is open for questions. If you instead want to put your question through by using the online tool in the webcast, please type your question in the field in the bottom right corner of the screen.\n\nAnd I will then put your through -- will put your question through from here. I already see that we have a long queue for questions. And as we really want to try and get through as many of you as possible, I kindly ask you to, this time, limit you to one question per person. And with that said, I think we start off with a question from the conference call as we open up the line for Martin at Citi.\n\nAre you there, Martin?\n\nMartin Wilkie -- Deutsche Bank\n\nYes, I'm here. Thank you for taking the question. As I'm limited to one, perhaps, I could ask about the energy crisis impact. You've touched on a little bit in your opening remarks.\n\nIf we look at some of your end customers, they're obviously energy intense. When we look at your process automation, you talk about strong pipeline, even though the quarter itself, perhaps, not so much in the way of large orders. How are you seeing this impacting your customers? Should we think that this is creating an opportunity for you that can support energy efficiency orders over the coming months, or even more of a concern that the impact of, perhaps, on capacity being scaled back in you and so forth could actually lead to demand disruption, if you like, in Europe and therefore more of a negative? So, we're very interested to hear how Europe [Inaudible] that. Thank you.\n\nBjorn Rosengren -- Chief Executive Officer\n\nYeah, thanks, Martin for the question. Maybe I'll take a crack at that. So, first of all, I just want to say that the energy intensity for ABB itself is quite low. So, this is like, you know, half a point of our cost base.\n\nSo, this really comes from the customer side, as you mentioned. And I think this is really a bit of a dual situation. So, yes, we have some customers, as we mentioned today, like in the metals industry. So, if you think about something like aluminum smelters and that kind of stuff, so very energy intense.\n\nAnd on these ones, we are seeing a little bit of slowdown. On the other hand, because our products are really driving energy efficiency on the market, we are seeing a lot of growth. I mean, in some big new areas, while I just mentioned that in Middle East and Africa, we had like 50% type of order growth driven by energy. And we are seeing this also in some parts of the U.S.\n\nmarket and so forth. So, I don't think for us this is like a one answer. I think -- overall, I think we're pretty balanced on the situation. But we, of course, have to see how it plays out.\n\nAnn-Sofie Nordh\n\nAre we good with that, Martin? I realize you have more questions, but I'd kindly ask you to get back in line, and, hopefully, we'll have time to come back to you for those. We move on to Alex at Bank of America Merrill Lynch. Alex, please. Your line should be open.\n\nAlexander Virgo -- Bank of America Merrill Lynch -- Analyst\n\nThanks very much. Good morning, everyone. Yeah, one question. I wondered if you could talk a little bit about your pricing then.\n\nYou said 7% at the group level. I wondered if you could expand a little bit around regional differences or comment, perhaps, around where you find that that pricing is, I guess, coming up against any pushback or any indication of any deterioration, deceleration in that regard. Thank you.\n\nBjorn Rosengren -- Chief Executive Officer\n\nThank you, Alex. I can talk a little bit about the pricing. As you probably know, we put in a pricing strategy in each of our division already 2020. And pricing is not just lifting prices.\n\nWe work on value-based pricing concept, and we have implemented these strategies in all our divisions. Of course, we are happy that we did it already then. So, when the inflation came, I think, more or less, all of our divisions was well prepared to handle that. And I think that has been done.\n\nAnd as you can see, we have been able to offset many of the cost increases that we have had during the last years. Of course, going forward, we see there are certain parts where we see inflation. We see some increases in cost, even though it's getting a little bit better, I must say. Freights are going down.\n\nSome of the commodity prices are being more neutralized. On the other hand, energy prices are going up. And inflation is still there, as you see in some of the numbers. So, far I think the divisions, which is this is a division that have done that in a quite professional way.\n\nGoing forward, I think that is actually dealt with all the divisions. So, some of them will be more impacted, some less, and they need to deal with it. So, I wouldn't say there's a general picture for all ABB. We can say though, that U.S.\n\nand Europe had a bigger inflation than we've seen, for instance, in Asia.\n\nAnn-Sofie Nordh\n\nOK, very good. Thank you. And now, we'll put through a question here that we received online. And it's from Jonathan Mounsey at Exane BNP Paribas.\n\nHe says, \"We are likely heading into a downturn next year. I would think that the efforts to decentralize over recent years will yield a very different set of behaviors within the group compared to previous slowdowns. In previous downturns, group management moved to announce companywide restructuring plans. If demand softens now, how will things be different this time?\" And I guess this is --\n\nBjorn Rosengren -- Chief Executive Officer\n\nI'd say, Timo, maybe I should answer that question. Of course, we have a strong confidence in our new operating model, the ABB Way, meaning we are moving the decision making to all our businesses. As you know, 99% of all our people are today working in our businesses. Now, we are not planning any kind of corporate activities when it comes to the size of the company.\n\nI think already our divisions have been since a half year back in working with different scenario planning, looking at different kind of softening of the market more heavily or just a little bit. And they have made their plans based on that. Some divisions are more impacted, and some will be less impacted. And they will make these decisions in the businesses.\n\nThis is an operating model that works. And we feel comfortable about that going -- if we will go into softer times going forward.\n\nAnn-Sofie Nordh\n\nAnd we open up for next question from the conference call which should be coming from Gael, Deutsche Bank.\n\nGael De Bray -- Deutsche Bank -- Analyst\n\nThanks very much. Good morning, everybody. Can you hear me?\n\nAnn-Sofie Nordh\n\nWe can.\n\nBjorn Rosengren -- Chief Executive Officer\n\nWe do.\n\nGael De Bray -- Deutsche Bank -- Analyst\n\nOK. That's great. Thanks very much. I have a question on the order dynamics.\n\nI mean, if I try and adjust for seasonality, it appears that organic orders were up sequentially, maybe by, you know, nearly 5%. So, it clearly defies my expectations of some sort of normalization. I mean, I heard you, you know, talking about this normalization in different industries. But it appears that in order segments, we've seen really nice positive development.\n\nSo, my question is, I mean, in which segments and in which regions in particular did you see the greatest positive developments, sequentially speaking? Thank you.\n\nBjorn Rosengren -- Chief Executive Officer\n\nYeah, sequentially, I will start with this, and thanks for the question. We more look at this year on year. But I think if you look at our sequential development, we are, first of all, seeing very strong development in the U.S. We had a very strong U.S.\n\ngrowth, close to 30%. And also, in some markets in southern Europe, we have been a very, very strong development in places like Italy, Spain, so forth. Also, U.K. was, this time, strong.\n\nWe have very strong growth in India, actually, already, two years in a row over 40% growth. So, these are some of the areas. But I also -- I mean, this is, of course, orders, I understand, not revenue. But we also were expecting a little bit of this happen going into the year that we would really have a strong performance in Q3 when we sort of come out from some of the constraints.\n\nSo, these are some of the areas. And then as I mentioned earlier, we are seeing some strong opex demand on oil and gas. And we're also seeing strong demand in mining, industrial automation, or industrial electrification continues very strong. If you look at the trends in Motion, in particular, we have now, I think, sequentially, twice over 20% growth.\n\nSo, these are some of the areas where it's coming through. The Motion trend, I think, is really, really looking very strong, even if we had a bit more mix now on electric motors. But that seems to be continuing on a good trajectory.\n\nGael De Bray -- Deutsche Bank -- Analyst\n\nOK. Thanks very much.\n\nAnn-Sofie Nordh\n\nThank you and -- OK, thanks, Gael. We take the next question from the conference call. And we open up the line for Ben at Morgan Stanley.\n\nBen Uglow -- Morgan Stanley -- Analyst\n\nGood morning. Hope all is well, and thank you for taking the question. The -- really, it's for Bjorn and it's more color, it's a local sense of what's going on in China. If we think about the order development during the quarter, which areas do you see is relatively strong? I'm assuming Motion was the best.\n\nBut if you can just give us a feel for how -- you know, which were the relative areas of strength and weakness? And I guess, similarly, how did the kind of base orders trend throughout the quarter? So, things in -- were things accelerating in China during 3Q? Thank you.\n\nBjorn Rosengren -- Chief Executive Officer\n\nThank you, Ben. If you look at China, you're seeing the orders in North America, you're seeing in Europe, and somewhat weaker in Asia. And China was down a couple of [Inaudible]. These are, of course, mainly driven by the residential construction market, which is, as we all know, the weakest one.\n\nWe feel so much stronger on the industrial part of the businesses. It varies a little bit between our different businesses, where I think the one sticking out most positively is Motion actually. We'd had a very strong position during the quarter. I mean, then if you look at on the Robotics & Discrete Automation, as you know, robot -- China is our biggest robot market.\n\nAnd it was down a little bit during the quarter. But at the same time, we should know that we have an order book, which is up 80% on that part. So, we are normalizing a little bit on the order side. I mean, going forward, we are not so nervous about China.\n\nWe think it is moving on. And we expect not to see any huge growth number but pretty steady going forward.\n\nTimo Ihamuotila -- Chief Financial Officer\n\nYeah, maybe just comment on the base orders. They were actually very similar now this quarter. So, there is no big delta on the base orders. We had -- in Germany, we had a bit of a delta because we have a lot -- had a large order.\n\nBut this dynamic was not there regarding China this time.\n\nBen Uglow -- Morgan Stanley -- Analyst\n\nOK. Thank you very much. That's helpful. Thanks.\n\nAnn-Sofie Nordh\n\nOK, then -- thanks, Ben. And then, we open up for a question from Guillermo at UBS.\n\nGuillermo Peigneux Lojo -- UBS -- Analyst\n\nHi. Good morning, everyone. Thank you for taking my question.\n\nAnn-Sofie Nordh\n\nGood morning.\n\nGuillermo Peigneux Lojo -- UBS -- Analyst\n\nI guess, maybe I wanted to elaborate on the segments within electrification. I guess you gave very clear country and regional picture. But I was wondering whether you describe a little bit the growth patterns that you've seen in industrial infrastructure, non-resi, and residential, which I think was interesting. And then, similarly, you know, about cancellations, do you think that there is an increasing risk in cancellations coming from any other points of the backlog wherein [Inaudible]? Thank you.\n\nTimo Ihamuotila -- Chief Financial Officer\n\nYeah, thanks, Guillermo. Maybe I'll at least start this one. So, first of all, on electrification, it's a broad-based strong demand. So, I would say, this China topic what Bjorn was discussing is pretty much the only area where we are seeing a bit lower growth.\n\nAnd as you saw, we had over 20% both order growth and revenue growth. So, it's really nice to see now the conversion coming in. And also actually, pretty much all the divisions are improving in performance. So, the fact that distribution solution is now both revenue and getting better margin, it's actually really good situation in the electrification.\n\nNow, then, if you go a little bit deeper into the market, in Germany, we had 8% growth. Base order growth was slightly negative. There, we are seeing a bit of impact in electrification in Q3, but we're actually expecting the channel to normalize going into Q4. And then, really, the other markets are looking quite strong.\n\nAnd I think electrification in the U.S. was even more than the 30%, if I remember correctly. So, these are some of the dynamics on the really, really good performance in electrification. And we're, of course, super happy about that 18% margin there.\n\nAnn-Sofie Nordh\n\nAnd we move on with a question for Bjorn from the online tool. It comes from Phil Buller. And he says, \"Bjorn, you're known for being a turnaround guy. And it looks like ABB is now turned around.\n\nIs your work done here now? Or is there more heavy lifting that you can see and wish to progress in the coming years?\"\n\nBjorn Rosengren -- Chief Executive Officer\n\nOK, that's an interesting question. But let me start with saying that before I even joined ABB, I always had huge respect for this company. I said, when I came in directly, this is a great company. It has a very strong foundation and we have good people.\n\nI was a little bit baffled about the financial performance, why we couldn't, you know, deliver in line or better than our peers. So, that is an important part. I think we've taken a giant step on this side. And I think we are now coming up to the right levels.\n\nAnd -- but of course, this is only a start of a long journey. And I believe that ABB has much more potential than this to go forward. I'm having my time of the life. So, I will not -- I hope I don't have to leave the company at this stage.\n\nI hope I can continue for a while more, while we're having here a good time. And the company is a great place to work for. So, big respect for ABB.\n\nAnn-Sofie Nordh\n\nAnd we'll take another question from the online tool. Actually, it comes from two people but on the sort of along the similar lines with our intentions on how to spend the proceeds from the sale of the final 20% of power grids. How are you going to spend the cash, boys?\n\nBjorn Rosengren -- Chief Executive Officer\n\nWell, you're sitting on it, Timo. So, why don't you --\n\nTimo Ihamuotila -- Chief Financial Officer\n\nOK, sure. We'll go for that. No change in our capital allocation principle, so we will continue to look to execute and all of these. We, of course, first and foremost, want to drive organic growth.\n\nAnd then we are expecting to continue to pay sustained growing dividend per share, value adding acquisitions, we spoke about that a little bit more, how we do that on the divisional lens, and then finally also share buybacks. And we should have capacity, as we have discussed earlier, to continue on all of these areas. Of course, in the end, it is always a board and AGM decision regarding the share buybacks, but really no change there. We expect to end the year with a strong Q4 cash flow and, of course, adding the [Inaudible] money with a strong balance sheet.\n\nAnn-Sofie Nordh\n\nVery good. And we'll take the next question from James Moore at Redburn. James, your lines should be open.\n\nJames Moore -- Redburn Partners -- Analyst\n\nGood morning, everyone. Hope you're well. Could I come back to pricing, please? On revenue price impact, I guess from your peers that you might have been around 2% in PA and RA last quarter, maybe about 6 or mid single digit in electrification and motion last quarter. And I wondered whatever the numbers were, how that sort of developed in the third quarter, and how you expect that to develop into the fourth and into next year.\n\nAnd to what degree average order prices are higher or lower than revenue prices?\n\nTimo Ihamuotila -- Chief Financial Officer\n\nYeah, yeah. So, division now -- sorry, not -- division business area based price level, so, of course, we are not disclosing this likely. So, I can just refer, maybe, to the 7. So, I would say that our shorter cycle businesses were a little higher.\n\nAnd then, as you say, PA and RA little lower. When we look at the dynamics, what is really, really good to see is that we are actually now covering with pricing all the costs in the gross margin and a little bit more. So, our cost increase from commodities has started to come down. Also, the freight actually didn't have a big impact.\n\nWe have salary inflation on the factories. That's understandable. But the pricing was well covering that, and we had a nice drop-through if I remember on the ABB level, 23% on the additional revenue. So, in that sense the equation is working quite well.\n\nAnd then, how will this stick? Of course, it's depending on the demand normalization, which we have been seeing. But I would say that in the shorter-cycle business experiences that it sticks sort of fairly well in this kind of situation, unless we've something totally drastic happened.\n\nBjorn Rosengren -- Chief Executive Officer\n\nI can say we also look at the gross margin in our order book, which is, of course, an important measurement --\n\nTimo Ihamuotila -- Chief Financial Officer\n\nRight. Exactly.\n\nBjorn Rosengren -- Chief Executive Officer\n\nFor the future. And we can of course, see that a good strengthening in this and we believe that the gross margin is of utmost important for any businesses to be able to develop. And that is the value, you -- actually you are pricing into your customer. So, if you're looking at our order book, it looks quite promising.\n\nJames Moore -- Redburn Partners -- Analyst\n\nAnd if I may, if labor costs, labor inflation goes up, which it looks like it's going to, is that harder to pass on with pricing and requires productivity? Or can you pass that on?\n\nBjorn Rosengren -- Chief Executive Officer\n\nI mean, we look at the total cost picture. There's a lot of factors. You know, it's from sub-suppliers, it's energy cost, it is freight, everything else that needs to be priced in, of course. And we have professional pricing department now in all our divisions.\n\nAnd we do expect that they deal with all these kind of inflation, if it's material or if it's cost increases from labor.\n\nJames Moore -- Redburn Partners -- Analyst\n\nThank you very much.\n\nAnn-Sofie Nordh\n\nThanks, James. And we move to Will Mackie at Kepler Cheuvreux.\n\nWilliam Mackie -- Kepler Cheuvreux -- Analyst\n\nHello, good morning. Thank you for the time. The question relates to supply chains and balance sheet, primarily the $1.7 billion of inventory increase in the working capital year to date and the nearly $700 million of trade receivables. Perhaps, you could talk to how you expect the working capital to normalize over the next 12 to 18 months and specifically in the fourth quarter, and how that may relate to -- how you see the evolution of the supply chain? Thank you.\n\nTimo Ihamuotila -- Chief Financial Officer\n\nYeah, thanks for the question, I was kind of expecting that that would come at some point. So, when we look at the inventory, first of all, of course, the most important thing is that the inventory is line with the growth we are seeing in the backlog. And when we look at that measure, i.e., inventory relation with inventory to the backlog, it has actually stayed pretty similar during the last two, three years. So, around 30% type of level when we look at it on constant currency.\n\nAnd if you then look at our order backlog, we are actually expecting more conversion shorter term. So, as we are sitting here and standing and looking at our numbers, we expect about 50% conversion now from current backlog, 23. Last year, we were expecting 45 conversions. So, it's actually kind of like coming closer.\n\nAnd in that sense, we think that is well in line. And we would expect the conversion to start to happen now already in Q4 when the demand picture in our expectation will start to normalize. Now, let's see how that plays out. And then, we expect a strong cash year for 2023, given this continuing.\n\nAnd I can't see any reason why ABB's long-term net working capital to revenue would have moved to a higher level from where we have been historically. So, I would expect that number to come down now, Q4, again, provided, we don't have some, let's call it surprise, additional order boost and then to continue to then further normalize 2023.\n\nWilliam Mackie -- Kepler Cheuvreux -- Analyst\n\nThank you.\n\nAnn-Sofie Nordh\n\nThank you. And we have one question from Andy here at J.P. Morgan. He says, \"Can you comment on the attractiveness on the pipeline on smaller acquisitions, if that rules out larger deals? Or are all large deals -- no, where are all deal sizes on the table?\n\nBjorn Rosengren -- Chief Executive Officer\n\nThank you. Maybe I can talk a little bit about the acquisition side. I think we've been clear that we look at each of the division and we say stability and profitability to full growth. About 70% of our divisions are now in what we call growth mode.\n\nAnd when we talked about growth, it's organic and acquisitions. So, we are seeing more and more deals taking place at the moment. And we expect this, of course, to accelerate. Five to 10 per year is where we think is a reasonable level, of course, driven fully from the divisional side.\n\nAnd they are doing it, of course, to strengthen their competitive situation in -- into the market. So, it can be technology or market share in certain areas. The size of these deals are quite small at this -- which is natural when it's driven by the divisions. But we could, of course, also see, I think, at this stage that ABB now is coming in to stable and profitability phase, maybe somewhat bigger.\n\nBut I'm not saying that we are going to go into any corporate-driven, by business area-driven if there is, for instance, a smaller division size that could be added on to the business if it strengthen the business area overall. So, I think we have a pretty good control over this, and I think it's a good process at the moment. So, we will experience many small to medium size and maybe some little bit bigger.\n\nAnn-Sofie Nordh\n\nAnd then, we'll take another question from the online tool, which says, \"Does the full year '22 margin outlook for at least 15% exclude Accelleron for full year?\"\n\nBjorn Rosengren -- Chief Executive Officer\n\nYes, I can answer that one. It's very important when we say that if we will reach our target for this year about 50%, then we exclude the Accelleron for the whole year. So, that is important. And you know that Accelleron has approximately 0.2 percentage points impact on the group.\n\nAnn-Sofie Nordh\n\nAnd then, we'll take another question from the conference call as we open up the line for Joe at Cowen. Joe, are you with us?\n\nJoe Giordano -- Cowen and Company -- Analyst\n\nI am. Good morning.\n\nAnn-Sofie Nordh\n\nGood morning.\n\nJoe Giordano -- Cowen and Company -- Analyst\n\nI still struggle with what I see in, like, larger-term macro kind of indicators with what companies are saying with short-cycle demand. I mean, when I look at orders, you're looking at things like ISM. I mean, it's in contraction mode, yet companies seem to be talking very positively about short cycle. When you look at your own results here, how do you square that? Do you feel that ABB is significantly outperforming what your competitors are doing? Does this feel like some sort of inevitable kind of one has to meet the other? Or do you expect that, like, you can just continue to grow, while the -- while broader indicators suggest that the markets are going the other way?\n\nBjorn Rosengren -- Chief Executive Officer\n\nMaybe talk a little bit about growth, and we talked not too much about the expectation going forward. But yeah, we have -- I mean that seven quarters with book-to-bill ratio, which is about 1. So, we've seen good growth and the last quarter on very high levels. Of course, now, when also when revenues start coming out in the right way, we should see a normalization, I think, of the order pattern going forward.\n\nThis will be too early to say yet, but we look at different kind of scenarios, and we have to play with that. I think ABB is keeping itself well up, you know, in relation to competitors. I don't think we are outperforming probably anyone. I think we have a good way to execute and operate and well-positioned when we look at the global trends.\n\nSo, we are where you should be, for where we should see growth in the coming years. And that is one of the reason also why we lifted the growth targets over a business cycles to 4% to 7% because we believe that we are in good markets. Then short term, of course, there will be ups and downs in the market, has always been, and we need to deal with them. And the divisions need to deal with them in a professional way.\n\nAnd we do believe that the operating model we have today will do that. So, so far, I mean, it's -- we haven't seen year on year in Q3 any changes in the order or behavior, in the buying pattern. But, of course, we read the news, we see what's taking place in the world. They're not -- we of course expect that everybody else that, going forward, we ensure there's going to be some difference what we have seen during the last six to 12 months.\n\nAnn-Sofie Nordh\n\nAnd unless I remember only, I'm a little bit -- we can tag on to the question of how has Q4 started? Because I don't think anyone has asked it yet. So, I'll might as well put the question to you.\n\nBjorn Rosengren -- Chief Executive Officer\n\nYeah, we continue to see growth, even though we expect a more normalized order pattern during the quarter.\n\nAnn-Sofie Nordh\n\nRight. Thank you. And a question from Simon at Jefferies. It says, \"Can you comment a bit on the end markets in discrete industries where you're seeing customers taking longer to place orders?\"\n\nBjorn Rosengren -- Chief Executive Officer\n\nYeah, I mentioned that a little bit before. And that's very much related to the robot, Robotics & Discrete Automation business. You also probably -- you know that these are the two divisions where we have had the biggest challenges when it comes to supply chains and semiconductors parts. So, we have, during the time, built up a huge order book.\n\nSo, that needs to be executed. So, we have thousands of robots, and we have a lot that determines that need to be executed during next quarter but also into next year. I mean, I can just mention that our order book here had from one year been 80% up. You can imagine this is, of course, not normal market trends.\n\nSo, there is of course, a lot of orders laying there, which was also placed because of our limited possibilities to deliver. So, of course, that needs to be delivered out. And then, we, of course, have to build on the market trends when it comes to automation in the market, which we believe are positive.\n\nAnn-Sofie Nordh\n\nAnd we have actually one, I think, final question here coming through on electrification and the comments about normalization on distributor inventory levels. How much of a risk, if any, it is dynamic for demand in the next quarters, given that we say that it seems to be completed by the end of Q3?\n\nTimo Ihamuotila -- Chief Financial Officer\n\nWhy don't I just say that this comment was specific to Germany and then maybe hand over to Bjorn. Yeah.\n\nBjorn Rosengren -- Chief Executive Officer\n\nThis is -- of course, we've seen that effect in Germany, especially in electrification, where most of the businesses that have been through our partners and the discussions with them. There is certain normalization of their inventory levels. Talking to our electrification business, this is more or less completed now, and we do expect more a normal order pattern within that industry going forward. This is very specific for Germany.\n\nRest on the market, as you've seen on the electrification, it's -- besides China, we've seen, of course, very, very strong growth, not least in North America.\n\nAnn-Sofie Nordh\n\nYes. And then, we actually have one quick last question from the conference call. It comes from Daniela at Goldman Sachs. Daniela, your line should be open.\n\nDaniela Costa -- Goldman Sachs -- Analyst\n\nThank you very much. Good morning. So, following up on the commentary regarding margins and growth going forward, I guess, looking from here to '25, you just said over 15% remains the target. But you seem to lean in the commentary in the call a bit more toward growth? Is it fair to say when we think about earnings growth going forward, are there any places where there's significant margin improvement potential left or the opportunity is more the growth side?\n\nBjorn Rosengren -- Chief Executive Officer\n\nThank you, Daniela. It's a good question. As I mentioned here is that our approach is cemented to stability, profitability for growth. And you've seen more and more division moving in, where they have what we call the growth mandate.\n\nThat doesn't mean that they're not driving their margins because they continue to improve this. And that is part of it. But, of course, they will also drive growth more stronger. And today, about 70% of our divisions have what we call the growth mandate.\n\nBut we still have a number of divisions that are not meeting their expectations for financial performance. And they are focusing, of course, to getting the levels to the right level before they really push these kind of businesses. Of course, we are happy to be on the one year early with reaching the target. But for us, this is just an in-between target.\n\nWe believe that ABB has the great potential. We will continue to drive that. And for us, it's important to stay above 50% despite different demands in the market, if it gets tougher or not. So, we need to make sure that the business has continued to develop and -- but also protect the margin in the downturns.\n\nSo, if it would be a tougher time next year, we do expect that they also should deliver on that. But we have no roof, so they will hopefully continue to improve.\n\nDaniela Costa -- Goldman Sachs -- Analyst\n\nVery clear. Thank you.\n\nAnn-Sofie Nordh\n\nThank you very much. Thanks, Daniela. And with that, we close this session. We thank you very much for joining us today, and we will see you in about a quarter's time.\n\nBjorn Rosengren -- Chief Executive Officer\n\nThank you. Bye, bye.\n\nDuration: 0 minutes\n\nAnn-Sofie Nordh\n\nBjorn Rosengren -- Chief Executive Officer\n\nTimo Ihamuotila -- Chief Financial Officer\n\nMartin Wilkie -- Deutsche Bank\n\nAlexander Virgo -- Bank of America Merrill Lynch -- Analyst\n\nGael De Bray -- Deutsche Bank -- Analyst\n\nBen Uglow -- Morgan Stanley -- Analyst\n\nGuillermo Peigneux Lojo -- UBS -- Analyst\n\nJames Moore -- Redburn Partners -- Analyst\n\nWilliam Mackie -- Kepler Cheuvreux -- Analyst\n\nJoe Giordano -- Cowen and Company -- Analyst\n\nDaniela Costa -- Goldman Sachs -- Analyst\n\nMore ABB analysis\n\nAll earnings call transcripts"
}