{
  "companyName": "Tesla",
  "companyTicker": "TSLA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/20/tesla-tsla-q3-2022-earnings-call-transcript/",
  "content": "Tesla (TSLA 1.12%)\nQ3 2022 Earnings Call\nOct 19, 2022, 5:30 p.m. ET\n\nMartin Viecha\n\nGood afternoon, everyone, and welcome to Tesla's third quarter 2022 Q&A webcast. My name is Martin Viecha, VP of investor relations, and I'm joined today by Elon Musk, Zachary Kirkhorn, and a number of other executives. Our Q3 results were announced at about 3:00 p.m. Central Time in the update that we published at the same link as this webcast.\n\nDuring the call, we will discuss our business outlook and make forward-looking statements. These comments are based on our predictions and expectations as of today. Actual events or results could differ materially due to a number of risks and uncertainties, including those mentioned in our most recent filings with the SEC. During the Q&A session portion of today's call, please limit yourself to one question and one follow-up.\n\n[Operator instructions] But before we jump into Q&A, Elon has some opening remarks. Elon?\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nThank you, Martin. So just to do a Q3 recap. Q3 was another record quarter on many levels. We had our industry-leading operating margin reach of 17%.\n\nAnd our free cash flow surpassed $3 billion in Q3 and approached $9 billion in the past 12 months. As our factories ramp, we're looking forward to a record-breaking Q4. So, it really, knock on wood, it looks like we'll have an epic end of year. So, Q4 is looking extremely good.\n\nOn the production ramp, Giga Berlin achieved another milestone of 2,000 cars made in a week with very good quality and is ramping rapidly. Giga Austin or Giga Texas should reach this milestone very soon. And in fact, just yesterday, we extrapolated yesterday's hold rate, it would be 2,000. Our production of 4680 cells has tripled in Q3 compared to the previous quarter.\n\nWe are finally gaining rapid traction on the 4680 cell. And its output is growing rapidly, and we expect it to start incorporating in cars and having it be a significant portion of our production here in Texas in the coming months. We also have our second generation of manufacturing equipment for 4680 cells in Texas, which continues to show great progress along with our original pilot line in Fremont. The Fremont factory team once again reached record production in Q3.\n\nAnd we intend to keep raising production in Fremont. Regarding Autopilot, at the end of -- at the end of September, we hosted our second AI Day and showed the first prototype of our Optimus robot, released updates on our trained computer, and high range of improvements of full self-driving software. Our vehicles have now driven nearly 60 miles in full self-driving beta mode, and this number continues to grow exponentially. Our goal with that AI Day was to post recruiting, and we've seen a massive influx of world-class artificial intelligence engineer and scientist resume.\n\nSo, it generated a tremendous amount of interest from some of the best AI researchers in the world. I can't emphasize the importance of this enough because I think it finally has become clear to the smallest AI technologists in the world that Tesla is among the very best. So, this quarter, we expect to go to wide release of full self-driving beta in North America. So, anyone who has ordered a full self-driving beta -- full self-driving will have access to the FSD beta program this year, probably about a month from now.\n\nSo -- and then obviously, any new -- anyone who buys a car and purchase a full self-driving option will immediately have that available to them. So, the safety that we're seeing when the car is in FSD mode is actually significantly greater than the safety we're seeing when it is not, which is a key threshold for going to a wide beta. Let's see with respect to demand [Inaudible]. We've got a lot of questions about demand in recent weeks.\n\nI can't emphasize enough, we have excellent demand for Q4, and we expect to sell every car that we make for as far in the future as we can see. So, the factories are running at full speed, and we're delivering a recovery make and keeping operating margins strong. We are still a very small percentage of the total vehicles on the road. Of the 2 billion [Inaudible] trucks on the road, we only have about 3.5 million.\n\nSo, we're about a long way to go to even reach 1% of the global fleet. Let's see. Kind of based on my -- what people -- based on many things, but certainly questions I get on Twitter about buybacks. And I think every one of our board members has gotten questions about buybacks.\n\nThe -- we've debated the buyback idea extensively at the board level. The board generally thinks that it makes sense to do a buyback. But we want to work through the right process to do a buyback, but it's certainly possible for us to do a buyback on the order of $5 billion to $10 billion. Even in the downside scenario next year, even if next year is -- was a very difficult year, we still have the ability to do a $5 billion to $10 billion buyback.\n\nThis is obviously pending board review and approval. So, it's likely that we'll do some meaningful buyback. So, in conclusion, while the market teams revolve around the short term, it's very important to focus on the long term. I can't emphasize this enough with investors and I think longtime investors, obviously, recognize this with Tesla.\n\nWe have our sort of local ups and downs, but long-term trend has been extremely good. And several years ago, I said, I think on our earnings call, that I thought it was possible for Tesla to be worth more than Apple, which was then the highest-cap company, I think, in the market. At that time, I think it was around $700 billion. And I said it required an incredible execution, at least some luck, and we didn't only achieve that.\n\nTesla went, in fact, or passed Apple's market cap at the time. And now, we have the opinion that we can far exceed Apple's current market cap. In fact, I see a potential path with Tesla worth more than Apple and Saudi Aramco combined. So now that doesn't mean it will happen or that will be easy.\n\nIn fact, I think it will be very difficult. It will require a lot of work, some very creative new products, manage expansion, and always luck. But for the first time, I am seeing -- I see a way for Tesla to be -- let's say, roughly twice the value of Saudi Aramco. And I think that's -- I haven't quite seen that yet.\n\nI mean this is the first time I've seen that potential. So, we have an incredible product portfolio. I think we've got the most exciting product portfolio of any company on earth, some of which you've heard about, some of which you haven't. We're in the final lap for Cybertruck.\n\nWe're building a Cybertruck line here at Giga Texas [Inaudible] and making a lot of progress in the robotaxi platform design. And then with respect to batteries, we're moving as fast as possible to have -- to achieve 1,000 gigawatt hours a year of production capacity in the United States vertically integrated. And our cathode Tesla refining, we're moving a ton of speed to do that. So, I think it's an incredibly exciting future and really an unprecedented future.\n\nNone of this would be possible without the incredible team that we have here at Tesla. So, I'd like to give a huge shout-out to all of our factory employees, engineers, executives, and the whole Tesla team. You guys rock. You're the ones that make it happen.\n\nThank you. Thank you, everyone. \n\nMartin Viecha\n\nThank you very much. And Zach has some opening remarks as well. \n\nZachary Kirkhorn -- Chief Financial Officer\n\nYeah. Thanks, Martin. Just to continue on Elon's theme, I just want to thank and congratulate the Tesla team for achieving record vehicle deliveries, production, and storage deployments in the third quarter. On automotive profitability, our GAAP operating margin was 17.2%, with automotive gross margin at 27.9%.\n\nOperating margin is one of our best yet, with improvements in operating leverage. However, Austin and Berlin ramp costs weighed on our margins, particularly if you compare it to Q1. Removing regulatory credits and Austin and Berlin, our operating margins would have been our strongest yet and auto gross margin would have been nearly 30%. Note that while small and growing, each car we build in Austin and Berlin is contributing positively to profitability.\n\nWe also continue to experience margin headwinds associated with macroeconomic conditions, as we've discussed at length on prior calls. In particular, raw materials, logistics, and foreign exchange was a big part of this past quarter. On energy profitability, we achieved our strongest gross profit yet for this business, driven primarily by record volumes of our Megapack and Powerwall products. Our free cash flows were also a record despite an increase in cars in transit at the end of the quarter, which has a negative impact on working capital.\n\nSpecifically on cars in transit, as noted in our press release on October 2, we've started to experience limits on outbound logistics capacity which we didn't anticipate. This issue is particularly present for ships from Shanghai to Europe and local trucking within certain parts of the U.S. and Europe. Our historical operating pattern of batch building by delivery region leads to extreme concentrations of outbound logistics needs in the final weeks of each quarter.\n\nJust to put this in perspective, roughly two-thirds of our Q3 deliveries occurred in September and one-third in the final two weeks. As a result, we have begun to smooth the regional builds throughout the quarter to reduce our peak needs for outbound logistics. We expect this to simplify our operations, reduce costs, and improve the experience of our customers. As we look ahead, our plans show that we're on track for the 50% annual growth in production this year, although we are tracking supply chain risks which are beyond our control.\n\nOn the delivery side, we do expect to be just under 50% growth due to an increase in the cars in transit at the end of the year, as noted, just above. This means that, again, you should expect a gap between production and deliveries in Q4, and those cars in transit will be delivered shortly to their customers upon arrival to their destination in Q1. Boston and Berlin ramp costs will continue to weigh on margins, although we expect the impact to be less than what we saw in Q3. And as Elon mentioned, we are continuing to build as many cars as possible while also maintaining strong operating margins.\n\nThank you. \n\nMartin Viecha\n\nThank you very much. And let's go first to the shareholder questions. The first shareholder question is given the stringent battery content and assembly requirements for consumer tax credit eligibility under the Inflation Reduction Act, can you speak to Tesla's ability to meet those thresholds in each of 2023, 2024, and 2025 through your existing and planned supply chain?\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nWell, yeah, I mean I think just at a high level, I'd say, we do expect to fully meet the IRA's requirements. Do you want to add? \n\nZachary Kirkhorn -- Chief Financial Officer\n\nYeah. We view that passing of the Inflation Reduction Act, there's a significant boost toward accelerating automation, while also scaling the battery supply chain at large in the United States. We expect Treasury to publish detailed guidance by the end of the year. Until such time, it's difficult to fully determine the eligibility criteria, but we believe Tesla is very well-positioned to capture a significant share of that for solar storage and also electric vehicles.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah, I'd like to say, we're -- like I said earlier, we're going to go basically pedal to the metal as fast as humanly possible to get to 1,000 gigawatt hours a year of production in the U.S. vertically integrated.\n\nMartin Viecha\n\nThank you. Let's go to the next question. The next question is, what updates can you offer on the backlog and the recent order intake trends, especially outside of the U.S. and especially in China?\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nWell, it's -- there's definitely -- China is experiencing a reverse of a recession of sorts, which is property market -- simply from a property market mostly. And Europe has recession of sorts driven by energy. The U.S. actually isn't -- going North -- North America is a pretty good health.\n\nAlthough the Fed is raising interest rates more than they should, but I think they'll eventually realize that and bring back down again. So, demand is a little higher than it would otherwise be. But as I said earlier, we are extremely confident of a great Q4, and we anticipate continuing to grow our vehicle production sales deliveries by -- on average 50% a year as far into the future as we can see.\n\nMartin Viecha\n\nThank you. \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nActually, I want to caveat, I should say, growing production by 30% every year because deliveries -- we're trying to smooth out the deliveries and not have this crazy delivery way at the end of every quarter. So, in fact, we're just fundamentally running out of -- there weren't enough boats, there weren't enough trains, there weren't enough car carriers to actually support the wave because it got too big. So, whether we like it or not, we actually have to smooth out the delivery of cars intra-quarter because there aren't just enough transportation objects to move them around.\n\nMartin Viecha\n\nThank you. The next question is, do you still expect 50% annualized growth for the foreseeable future? Is this also true specifically for the Chinese domestic market? Do you expect to need to cut vehicle prices or offer incentives in any market to sustain a demand? Or has demand remained stable? Or is it even rising? There are three questions there.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nWell, like I said, we want to sort of focus on a high level on what we think is possible here. We -- to the best of our knowledge, we believe that Tesla will continue to grow deliveries and revenue production at a 50% or greater compound annual growth rate. It might occasionally be a year that is a little less, and then some years would be maybe a little more or a lot more. In some of our out-year planning, we see potential annual growth rates that are in excess of 50%. \n\nMartin Viecha\n\nThank you. The next question is, can you tell us more about the product feature road map beyond new models and FSD, and especially for interior and powertrain of existing vehicle models?\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah. We could, but who wants? Sorry, guys, we can't like jumping on, on future product announcements.\n\nZachary Kirkhorn -- Chief Financial Officer\n\nCommitted to continuous improvement.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah, we obviously are -- yeah. [Inaudible] But we'll also be committed to continuous growth. Yeah. At Tesla, we've always been committed to continuous improvement.\n\nSo, his friends might have asked me like, when should I buy a car, I'm like, \"Now\" because we just keep improving the cars. Always been the latest Tesla. Yeah, there's still the latest Tesla. So, I don't really -- yeah, the -- and on the gain, we do have some big technology upgrade like Plaid.\n\nAnd by the way, I think the Plaid Model S and X are the best cars on earth. There's nothing even close, in my opinion. Just try one. Epic.\n\nMartin Viecha\n\nThank you. The next question is, we keep hearing of dire energy crisis in Germany this winter. What are Tesla's plans to combat power cuts? And will there be any delays in ramp-up in production from Giga Berlin because of this?\n\nZachary Kirkhorn -- Chief Financial Officer\n\nYeah, I can take that. I think two points on this question. The first is that based upon everything that we know, we don't see this as a large risk to the company. Even if production did go down for a period of time, this is on near term, it doesn't have any impact on the long term of the company.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nBut we don't -- we have no indication whatsoever that we will have to cut our production in Germany.\n\nZachary Kirkhorn -- Chief Financial Officer\n\nYeah. And we put in place backup plans, and we're working through the supply chain as well. Nearly all of our suppliers are prepared as well. So, we'll see how this plays out, but it's not something that we're terribly worried about.\n\nMartin Viecha\n\nThank you. And the next question is, how is production planning going for the Cybertruck? What is the initial phase 1 production target? When can we expect an update on pricing and final design? \n\nUnknown speaker\n\nYeah. I mean, as Elon said earlier, we'd be on facilities preparations here in Giga Texas for Cybertruck. We're still on track to enter early production in the middle of next year. We started our data builds of all of the battery body in the existing -- \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nWhen should I drop my beta? \n\nUnknown speaker\n\nIn a few weeks. That's going well, and we continue ramping up through the end of next year and into 2023.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nGreat. Yeah, the car is going to be sick and sick. That is going to be a hall of famer next level. Sorry, sorry, I took it longer than expected, but there were a few things that got in the way, like insane global supply chain shortages like FedEx, which are force majeure if [Inaudible] one.\n\nMartin Viecha\n\nRight. Thank you. \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nOf course. There's Tesla Semi, of course. So, we'll be handing over our first production Tesla Semis to Pepsi on December 1. I'll be there in person.\n\nAnd we will begin ramping up production of the Tesla Semi, which is a max low, heavy -- a heavy truck. That's a Class A truck, Class A truck.\n\nZachary Kirkhorn -- Chief Financial Officer\n\nNo sacrifice to cargo capacity. \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah, exactly, very important, no sacrifice to cargo capacity, 500-mile range.\n\nZachary Kirkhorn -- Chief Financial Officer\n\nJust to be clear, 500 miles with the cargo.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah, 500 miles with the cargo on level ground. Yeah, sure. Not up. It's excellent.\n\nBut the point is it's a long-range truck and even with heavy cargo. And the number of times people talk about you can't -- it's impossible to make a long-range heavy-duty Class A truck. And they'll ask, \"Well, what are your assumptions about watt-hour per kilogram and watt-hours per mile,\" and they look at me with a blank stare and then say hydrogen. I'm like, \"No, that's not the answer,\" but I was looking for numbers literally.\n\nIt's not a number. It's [Inaudible] table. You obviously don't need hydrogen for heavy trucking [Inaudible]. And we'll be ramping up Semi production through next year.\n\nAs I think everyone knows at this point, it takes about a year to ramp up production. So, we expect to see significant -- we're tentatively aiming for 50,000 units in 2024 for Tesla Semi in North America. And obviously, we'll expand beyond North America. And these would sell -- I don't want to say the exact prices, but they're much more than a passenger vehicle.\n\nSo, with a few thousand heavy trucks of this nature would be worth several Model Ys.\n\nMartin Viecha\n\nThank you. The next question is, what is the progress of the 4680 cell ramp? And what factors determine whether vehicles get 2170s versus 4680 cells? And how will that change in the next year?\n\nZachary Kirkhorn -- Chief Financial Officer\n\nYeah, ramp is going well, as Elon said. Total output is up 3x quarter over quarter, and production is tracking to exceed 1,000 car cells per week this quarter as we said last quarter. Our focus is now shifting from 100% ramp to cost and further expanding production capacity in North America, as Elon also mentioned. On the 2170 versus 4680, in our factories, we really attempt to minimize factory complexity and product changeover while still making sure we get enough new product into the field to learn how it is performing.\n\nAnd that sort of mix is going to shift as 4680 scales here and the overall factory ramp proceeds in Texas.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nRight. Basically, production of 4680 ramp is growing exponentially. And yeah, it's going well. We're just looking at this -- just going to be a major back to the future.\n\nZachary Kirkhorn -- Chief Financial Officer\n\n[Inaudible] \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah. And like I said, we're -- our goal is to strive toward 1,000 gigawatt hours a year of annualized production in United States alone by Tesla, not including [Inaudible] will be on top of that.\n\nUnknown speaker\n\nWe need to get 300 to 400 terawatt hours to accomplish our goal.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYes, there's roughly -- to transition to sustainable energy, our calculation for both stationary and vehicles is 300,000 to 400,000 gigawatt hours or 300 to 400 terawatt hours.\n\nUnknown speaker\n\nSo, when you're like one tower assembling a lot, well it's a lot of terawatt hours to get. \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah. And on the cathode side, the [Inaudible] we think will probably be iron and most of the iron -- iron can scale to very, very high tonnage and then some nickel. The exact percentages are hard to figure out, but it's probably be twice as much iron cathodes as they [Inaudible]. And then there's the manganese wildcard as well [Inaudible] \n\nZachary Kirkhorn -- Chief Financial Officer\n\nNo. And on that note, we're pursuing aggressively North American iron cathode supplies. And how -- yes, we can talk more about that at a future date. \n\nMartin Viecha\n\nYeah. Thank you. The next question is on the Semi truck, which we already addressed. So, I'm going to skip to the next one.\n\nCan you talk about how Tesla could adjust if we were to enter a prolonged recession, including new product prioritization, investment flexibility, new factory versus factory expansion, service support infrastructure, productivity cost measures, and demand stimulation alternatives?\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nWell, to be frank, we're very pedal to the metal come rain or shine. So, we are not reducing our production in any meaningful way, recession or not recession. \n\nZachary Kirkhorn -- Chief Financial Officer\n\nIt's the 1% point you made.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah, exactly. So, I think the public, at large, realizes that the world is moving toward electric vehicles and that it's foolish to actually buy a new gasoline car at this point because the residual value of that gasoline car is going to be very low. So, I think we have to be in a very good spot. But I wouldn't say it's recession proof, but it's certainly risk -- recession resilient because basically, it has -- people both have large part made the decision to move away from gasoline cars to electric cars.\n\nAnd then I think transitioning [Inaudible] generation to sustainable, you need solar wind with the stationary battery pack to buffer the power. So, you have 24/7 power because the wind doesn't go [Inaudible] travel time. So that also -- we actually see the energy storage business, stationary storage, growing more like 150% to 200% a year, much faster than cars by a lot.\n\nZachary Kirkhorn -- Chief Financial Officer\n\nI'm, sorry, just to add before you jump in, Martin. Just to echo Elon's point, I mean, I think where our cash balance is, what our forecasted cash generation is, where our margins are as a company, I mean, we can withstand quite a lot of downside before we would have to dig into our capital plans, Supercharger expansion, product lineup. So, the business has done quite well over the last handful of quarters. And this is a real opportunity, I think, for the company to press forward, I mean, most aggressively, as Elon has mentioned.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah, we try to model out like, let's say, 2023 is a brutal recession year. Even then, we generate meaningful cash. Once you get out of that for [Inaudible]\n\nMartin Viecha\n\nGreat. Thank you very much. And let's go to the last investor question, which is the progression from Tesla's first platform with SMX to the second platform with 3 and Y led to a 50% reduction in cost of goods sold. When do you see Tesla's third platform being released? And what level of cost of goods sold reduction could you achieve?\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nWell, we don't want to talk exact dates, but this is a -- I mean, the primary focus of our new vehicle development team, obviously. But at this point, we've done the engineering for Cybertrucks and for Semi. So, it's obviously against what we're working on, which is the next-generation vehicle, which will be probably about the cost of 3 and Y platform. It will be smaller, to be clear.\n\nBut it will, I think, certainly become -- certainly exceed the production of all our other vehicles combined. I mean, obviously, we're going to take everything we learned from S, X, 3, Y, Cybertruck and Semi into that platform. But we -- as you've said to us many times, we're on a 2-for-1 target. So [Inaudible] we're trying to get to that 50% number again.\n\nIt's like, we're going to take two. If that's exactly what [Inaudible], how are we making two cars for the amount of effort that we currently take to make one Model 3.\n\nZachary Kirkhorn -- Chief Financial Officer\n\nYeah. Effort costs, efficiency.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nNeeds to be considered.\n\nZachary Kirkhorn -- Chief Financial Officer\n\nYeah. All those things. Half the loss, half the past, half the factory floor space.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nWe're twice the output. And we do believe this can be done. By the way, I should mention that when I said that probably now that I see a path in extremely very difficult path, incredible execution required, a massive amount of hard work, and some luck to get to where Tesla with as much as Apple and Saudi Aramco combined, I wasn't including Optimus.\n\nMartin Viecha\n\nThank you. Let's go to analyst questions next. The first question comes from Adam Jonas from Morgan Stanley. Adam, go ahead and unmute.\n\nAdam Jonas -- Morgan Stanley -- Analyst\n\nGreat. Can you hear me?\n\nMartin Viecha\n\nYes.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah.\n\nAdam Jonas -- Morgan Stanley -- Analyst\n\nSo, Elon, would you consider vertically integrating into mining? That's my first question.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nWe'll do whatever we have to. Without limiting factors, we'll do. We do not personally constrain ourselves. We don't particularly integrate just for the hell of particularly integrating.\n\nLike if there was a great supplier who's better than us or we think actively is very good, or even where the economics of comparative advantage suggests that we should use that supplier, even if we could beat them, but we could use our resources to do something else that will be more productive, then we would in source in that case. But if we have to go mine, we will mine.\n\nAdam Jonas -- Morgan Stanley -- Analyst\n\nOK. Thanks, Elon. My follow-up is one terawatt hour of manufacturing in the United States, vertically integrated. I guess my question is what would need to change with U.S.\n\npermitting laws to allow that? Kind of what would be your message to this administration or next? And do you think you could do a terawatt hour? What's the going price of that? Can you do that for under 100 billion bucks in the States? Thanks. \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nWell, I mean, I think the message to the government would be that there should be -- I should say, we've actually had conversations with a number of senior government leaders, White House, Congress, and whatnot. And the suggestion that we have is that there should be an expedited permitting process for anything which is critical to a sustainable energy future. So, it doesn't make sense to put like a coal mine and a sustainable energy battery like lithium mine in the same category. Coal is not of the future, lithium does.\n\nAnd by the way, you can extract lithium with almost no disturbance to the local environment. So, it's not actually ugly, nasty find situation. So, I would recommend expedite permitting would really be helpful. Basically, a fast track environmentally, I think a sense fast track things that are important for the environment and communities, for sure.\n\nThat seems logical. And the reception has been positive. So, we'll see if something happens with that. I think probably on this earnings call, we're not ready to go into financial details of the -- what will take to get there.\n\nBut what we are seeing is practical improvements as we redesign the whole supply chain and all of the elements that go into battery cell. We're figuring out dramatic efficiencies. And I think we'll get net result which would be that the capital required to achieve that level output will be much less what people think. \n\nMartin Viecha\n\nThank you very much. And let's go to the next question from Colin Langan from Wells Fargo. Colin, go ahead and unmute. \n\nColin Langan -- Wells Fargo Securities -- Analyst\n\nCan you hear me now? \n\nMartin Viecha\n\nYeah, we can hear you.\n\nColin Langan -- Wells Fargo Securities -- Analyst\n\nOK. Sorry about that. Any update on full self-driving? I think you had said a couple of quarters ago, would be available by the end of the year. Is that still possible? Is it -- would it still be like a Level 4 or Level 5 that you're talking about? And are there any sort of regulatory hurdles you'd have to think about?\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nWe -- as I said earlier, we're expecting to release the full self-driving software to anyone who orders the package by the end of this year. So, a separate matter as to will it have regulatory approval. It won't have regulatory approval at that time. But the car we'll be able to take you from your home to your work, your friend's house, to the grocery store without you touching wheel.\n\nSo, it's looking very good.\n\nColin Langan -- Wells Fargo Securities -- Analyst\n\nAnd it would mean like Level 4, Level 5 kind of traditional definition you're talking about?\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nWell, there's this debate is like what's the -- what are the interventions per mile and maybe safety interventions per mile. Like we're not saying that that's quite ready to have no one behind the wheel. It's just that you will almost never have to touch the control, vehicle controllers. So, like when I came to Giga Texas from Brent's house, I never touched any of the controls already here.\n\nAnd then there is a longer process of like called the march of 9s of like how many 9s reliability do you need before you could really be comfortable saying that the car could drive with no one in it. And that's some subjectivity as to how many nines you need. But I think we'll be pretty close to having enough 9s that you're going to have no one in the car by the end of this year. And certainly, without a question, that's whatever in my mind next year.\n\nI think we'll also have an update next year to be able to show to regulators that the car is safer much so than the average human.\n\nColin Langan -- Wells Fargo Securities -- Analyst\n\nGot it. And just as a follow-up. You mentioned in the prior questions about IRA. I mean it sounded like you thought you could get -- can you get all of it? I mean, because my interpretation is like the production credits, battery component credits for buyers seems very likely for you guys.\n\nIs the sourcing part of it possible? Because that seems like a pretty tough hurdle given how much has to be sourced from the U.S.?\n\nUnknown speaker\n\nYeah. So, we have a cross-functional team that's looking very closely. As you mentioned, the sourcing threshold increases by the year. So, we're looking at all options and also getting some clarification from Treasury.\n\nThat's -- it's important to say that's only a fraction of the other credits. We do manufacture ourselves in the U.S. We manufacture the modules in the U.S. So, that's a pretty thin.\n\nSo yeah, we feel confident that we'll have a path as these incentives -- as the threshold sort of increases by the year.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah. We'll meet those thresholds –-\n\nMartin Viecha\n\nThank you. The next question comes from Colin Rusch from Oppenheimer. Colin, please go ahead and unmute.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nThe operating leverage has been pretty impressive here. And I'm curious about areas where you could invest in an incremental way, whether it's on the R&D side or on the sales side to accelerate growth or cost reduction? Or should we be thinking about this level of spend on a go-forward basis and some significant operating leverage as you scale up from here?\n\nZachary Kirkhorn -- Chief Financial Officer\n\nYeah. I mean, our operating leverage has improved quite a bit. It's the lowest this quarter, I think, ever, and by a decent amount, opex as a percentage of revenue. I mean, our forecast is that it will keep reducing.\n\nI mean, I think the way to think about it is our total amount of operating expenses will slowly tick up as the company grows. It's very hard to keep it flat with the rapid growth of the company, but it's growing much slower. So, some amount of growth there, but the top line of the business is growing so quickly. So, I think there continues to be enormous opportunity to improve the overhead efficiency of the business, and we're seeing it.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nAll right. Great, guys. I'll take the rest of that offline. Thank you.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah. Look, we are in the -- at least for now, quite in a good position of we're investing in everything we can think of to possibly invest in, and we're still generating cash. So, I guess it gets a pretty good place to be.\n\nZachary Kirkhorn -- Chief Financial Officer\n\nYeah. I mean, how many R&D programs are we running in parallel right now? \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nPeople don't even know old R&D so per day. There are some of it, but a bunch of it.\n\nZachary Kirkhorn -- Chief Financial Officer\n\nI also don't think cash is a good gauge of how much R&D you're doing.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nNo. It isn't because like it's not like -- it's not like engineers, they're not generic. So, it's just like if you could you spend $5 billion or $10 billion, that will like -- that your actual R&D is useful product ship will be proportionate to that. It's just not true.\n\nEngineers are -- coming off with some assembly line like cookies or something.\n\nZachary Kirkhorn -- Chief Financial Officer\n\nUntil we get optimistic. \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nGet optimistic. Don't change things. What matters is where are the most brilliant people working. And Tesla remains the -- Tesla and SpaceX are two companies where the smartest engineers want to work.\n\nZachary Kirkhorn -- Chief Financial Officer\n\nI mean, like we don't have to spend billions of dollars to invest in the future and invent the future. Engineers are also cost-conscious. And we don't just burn the money out the window when we're trying to do R&D. I would stop looking at like R&D as a cash investment for [Inaudible]\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nI think one nickel Tesla is frankly worth an infinite number of dollars. You could have like a -- almost same the number of credit shares and they would not be able to do work one nickel of Tesla we can do. You can't make it up in volume. \n\nMartin Viecha\n\nOK. Thank you very much. Let's go to the next question from George at Canaccord. George, please unmute.\n\nUnknown speaker\n\nHi, good afternoon and thanks for taking my question. I think you would -- at your Annual Shareholder event, where Elon mentioned that the prices of many of the materials used in your production have started to come off the boil. If that continues, does that give you an opportunity to adjust prices globally after several increases? Thanks.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nWell, we're looking at the prices of -- [Inaudible] prices closely. I mean, obviously, anyone can just Google what the price of -- future price of copper or steel is going to be. It's just like one Google Search away. And everyone can see that the commodities look on a go-forward basis are on a dropping a lot.\n\nBut in electric vehicles, things like battery-grade lithium are still crazy expensive. So, we've got a mixture of things where prices are dropping and things where prices are increasing.\n\nUnknown speaker\n\nYeah. I would say quarter over quarter, steel, aluminum has stopped anywhere between 17% to 20% at the same time on the battery side.\n\nZachary Kirkhorn -- Chief Financial Officer\n\nAnd the cost of shipping has come down tremendously. Like last year, the cost of a container on the spot market from Shanghai got as high as $20,000. And now it's $3,500, $3,600. It's that kind of reality.\n\nWe're seeing deflation in a lot of commodities with a few exceptions as Elon mentioned on batteries.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nThere's more deflation than inflation.\n\nZachary Kirkhorn -- Chief Financial Officer\n\nDefinitely.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nAnd again, this is publicly available information. Anyone could just Google it. And I think Cathie Wood at Ark Invest is -- I'm going to make this point over and over again, to the Fed and the Fed is not listening because they're looking at the rearview mirror instead of looking out the front windshield.\n\nZachary Kirkhorn -- Chief Financial Officer\n\nYeah. Just to add a little bit more context. So, commodity increases were the highest in Q3 that we've seen over the last two years. And so, when indexes change, it does take time before they fully reflect.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah, there's latency.\n\nZachary Kirkhorn -- Chief Financial Officer\n\nYeah, there's latency.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nThat's why I say that the best decisions make sense if you're looking through the rearview mirror, but not if you look out the windshield. And windshield got the front windshield. \n\nZachary Kirkhorn -- Chief Financial Officer\n\nYeah. And so, what -- at least of what we know so far, the peak on the commodity side in Q3, I say peak, hopefully, it stays the peak, hopefully, it starts to come down. There is a small amount of production that we're seeing going into our Q4 cost structure from steel and aluminum primarily, but it's less than 10% of the total increases we've seen so far. So, we're optimistic here based upon what we're seeing on the indexes for some of our cost structure.\n\nSo, this will start to come in over time. But I just want to set expectations that there's not some windfall of cost reduction in this space coming in Q4, maybe some as we go into next year. \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah. We'll probably see some cost reduction in 2023. I'll be surprised if we did not.\n\nUnknown speaker\n\nAnd just as a follow-up, this is for Elon. With your pending acquisition of Twitter and your stakes in SpaceX and Neuralink and Tesla, how much would the combined companies benefit from operating under a single super structure, if at all, like a Google Alphabet?\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nIt's not clear to me what the overlap is. It's not zero, but it's -- I think we're reaching. I'm not worried about it. I'm not an investor.\n\nI'm an engineer and a manufacturing person and a technologist. So, I actually work and design and develop products. That's what I do. So, it's not a -- we're not going to have a portfolio sort of investments over it.\n\nSo, I don't know. I don't see obvious sort of some -- get combined under an umbrella, at least right now. So, I am excited about the Twitter situation because obviously another part incredibly well. And I think it's massive that this sort of languished for a long time, but has an incredible potential.\n\nAlthough, obviously, myself and the other investors are obviously overpaying for Twitter right now, the long-term potential for Twitter, in my view, is, in order of magnitude, greater than its current value.\n\nMartin Viecha\n\nThank you. Let's go to the next question from Pierre Ferragu from New Street Research. Pierre, go ahead, please, and unmute.\n\nPierre Ferragu -- New Street Research -- Analyst\n\nHello. Can you hear me, guys?\n\nMartin Viecha\n\nYes, we can hear you now. \n\nPierre Ferragu -- New Street Research -- Analyst\n\nGreat. I'd love to have another update on 4680, Drew. So last time we talked about it, there were -- was it was a question about like scaling up with manufacturing and there were still a few things to get right. Is it fair to say that now you are at scale, and it's just a question of logistics to get bigger? So that's question number one.\n\nAnd then question number two, on the kind of like innovation and cost reduction and efficiency improvements kind of path that you described at the battery day, where are we today? And how much time is it going to take to deliver all the potential you outlined then?\n\nDrew Baglino -- Senior Vice President, Powertrain and Energy Engineering\n\nWell, I'll take the second question first. At Battery Day, we showed a timeline out to 2026 for all of the ideas we had proposed and had shared with everybody then.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nAnd yeah, I'd be surprised. I think we'll do better than that.\n\nDrew Baglino -- Senior Vice President, Powertrain and Energy Engineering\n\nYeah. I mean, but just that's the rough -- just give you all -- it's in that order. It's not like a month. It's not six months.\n\nIt's six years. And we are executing on all of those different ideas pretty aggressively in parallel with the opex that some people think isn't enough, but we're getting it done. \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nI mean I'm not turning down POs. \n\nDrew Baglino -- Senior Vice President, Powertrain and Energy Engineering\n\nYeah, yeah, yeah. We're great talent, like we find someone awesome, we bring them into the company. And people shouldn't believe we are turning people away. \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah. I mean, it's a hot pond but we're solving it. And I think -- we still feel confident that 4680 will be the most competitive battery cell in the world. \n\nDrew Baglino -- Senior Vice President, Powertrain and Energy Engineering\n\nAnd it's the whole system around it, right? It's not necessarily a specific form factor. It's the attention to detail on how to bring costs out of the manufacturing process -- or remove processing steps.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nAnd all the way down from the mine to the cell. \n\nDrew Baglino -- Senior Vice President, Powertrain and Energy Engineering\n\nYeah, exactly.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nMany steps along the way.\n\nDrew Baglino -- Senior Vice President, Powertrain and Energy Engineering\n\nYeah. And for those who watched the YouTube videos, like our on-site cathode facilities coming together, I'm really excited about that, which is a part of the plan that we discussed on Battery Day. \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nWe're possibly lithium refinery. \n\nDrew Baglino -- Senior Vice President, Powertrain and Energy Engineering\n\nIn Corpus Christi. So, we're making -- putting our money where our mouths are and all the various efforts that we discussed on Battery Day. On the technical challenges and the ramp question, which is your first question of 4680, no ramp is ever easy even at the end when you're 80% to the end, like it's still very challenging to get to the end. And that sort of leaning out of yields, the final cycle time to achieve target -- you mentioned logistics.\n\nIt's not something that we're specifically focused on, I guess, but eventually could be a problem as we're talking about hundreds of gigawatt hours at different sites across the United States. But I would never sit here and say we have no challenges remaining, but we've made a lot of progress reducing technical risk in many areas. Cycle times have dramatically improved. Yield has dramatically improved.\n\nAnd just walking the line here in Texas, like Martin was walking it yesterday, made some comments to me. You really see the acceleration around you. And we've made a ton of simplifications moving from the Fremont factory to Texas, and it's coming to play in speed of ramp here. And of course, that's on one line of many here in Texas.\n\nSo, it's not like factory to factory. It's a multiplication of both simplicity and scale. So yes, we're excited about where it's headed.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah. And I think, once we are fully integrated, I think we still do see a path to hold roughly $70 kilowatt hour cell -- $70 per kilowatt hour cell before any incentive.\n\nDrew Baglino -- Senior Vice President, Powertrain and Energy Engineering\n\nBefore incentive. \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nBefore incentive. Yeah.\n\nMartin Viecha\n\nThank you. And the next question comes from Toni Sacconaghi from Bernstein. Toni, go ahead and unmute yourself, please.\n\nToni Sacconaghi -- AllianceBernstein -- Analyst\n\nYes. Thank you. I just wanted to follow up on the 4680 cells and where we are seeing them deployed today. So, are those in the Semis that are being delivered on December 1? Are we seeing them in Model Ys that are being produced out of Austin? And is -- do you anticipate 4680 being a gating factor for Cybertruck ramp later this year? And how do you balance the need for 4680 across Semi, Cybertruck and potentially Model Y in 2023? And I have a follow-up, please.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nWow. OK. The Semi doesn't use 4680s. Yes.\n\nWe are making Model Ys. Some of the Model Ys coming out of Giga Texas are 4680. And I think, Drew, the car you drive around is 4680 Model Y?\n\nDrew Baglino -- Senior Vice President, Powertrain and Energy Engineering\n\nYes. 10,000 miles. \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nTen thousand miles. Pretty good.\n\nDrew Baglino -- Senior Vice President, Powertrain and Energy Engineering\n\nNo problems yet. Yes. Structural back, structural pack.\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nYeah. So -- and yes, I mean, and our output 4680 is growing exponentially. So -- but it's worth bearing in mind like there are entire highly competitive companies that are very smart that all they do is make battery cells. This is simply one segment of Tesla.\n\nSo, yes. So it's not a total --\n\nDrew Baglino -- Senior Vice President, Powertrain and Energy Engineering\n\nNo, there aren't -- there are challenges still ahead that we have not yet surpassed. No doubt. \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nWe don't anticipate this being anything like Cybertruck or anything else.\n\nMartin Viecha\n\nOK. Thank you. And the last question comes from William Stein from Truist. Go ahead and unmute yourself, please.\n\nWilliam Stein -- Truist Securities -- Analyst\n\nGreat. Thanks for taking my question. I guess I'll go at one that I asked last time, Elon, which is your expectation for the likelihood of commercial success in each of the three major AI endeavors? FSD sort of as imagined without a driver, the training computer and, of course, Optimus? \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nWe'll achieve full self-driving full time -- that occurring is 100%. And I think we'll -- we're almost there. And then, of course, we've got to prove it to regulators and get the regulatory approvals, which is outside of our control. But anyone who's driving full self-driving cars, full self-driving beta in the car, you can see the rate of improvement.\n\nYou can just experience for yourself that we are, in fact, getting there. In fact, we almost are there. And so, we're probably achieving that 100%. The Optimus, probably of that being a successful product, I think, also extremely high given enough time, 100%.\n\nDojo, just maybe more of a question around Dojo. Like can we be competitive with NVIDIA GPUs even as somebody continues to rapidly evolve their GPUs? So, the jury is out on Dojo. Dojo team thinks they can outperform NVIDIA for neural training. Dojo is out.\n\nWe will probably -- I don't know, next year, if that's true or not. But we think we're probably -- we think it's -- the architecture of Dojo as the right architecture to win. It depends on how well we execute in that architecture.\n\nMartin Viecha\n\nThank you very much. I think, unfortunately, it's all the time that we have today. So, thank you so much for your great questions and look forward to talking to you in about three months from now. Thank you, and have a good day. \n\nElon Musk -- Chief Executive Officer and Product Architect\n\nThanks, everyone.\n\nDuration: 0 minutes\n\nMartin Viecha\n\nElon Musk -- Chief Executive Officer and Product Architect\n\nZachary Kirkhorn -- Chief Financial Officer\n\nUnknown speaker\n\nAdam Jonas -- Morgan Stanley -- Analyst\n\nColin Langan -- Wells Fargo Securities -- Analyst\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nPierre Ferragu -- New Street Research -- Analyst\n\nDrew Baglino -- Senior Vice President, Powertrain and Energy Engineering\n\nToni Sacconaghi -- AllianceBernstein -- Analyst\n\nWilliam Stein -- Truist Securities -- Analyst\n\nMore TSLA analysis\n\nAll earnings call transcripts"
}