{
  "companyName": "DoubleDown Interactive Co., Ltd.",
  "companyTicker": "DDI",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/doubledown-interactive-co-ltd-ddi-q2-2022-earnings/",
  "content": "DoubleDown Interactive Co., Ltd. (DDI 1.93%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to DoubleDown's earnings conference call for the financial results for the second quarter ended June 30, 2022. My name is Gary, and I will be your operator this afternoon. Prior to this call, DoubleDown issued its unaudited financial results for the second quarter 2022 in a press release, a copy of which has been furnished in a report on Form 6-K filed with the SEC and is available in the Investor Relations section of the company's website at www.doubledowninteractive.com. You can find the link to the Investor Relations section at the top of the home page.\n\nJoining us on today's call are DoubleDown's CEO, Mr. In Keuk Kim; and its CFO, Mr. Joe Sigrist. Following their remarks, we will open the call for questions.\n\nBefore we begin, Mr. Grampp, the company's outside investor relations advisor, will make a brief introductory statement. Mr. Grampp?\n\nJeffrey Grampp -- Investor Relations\n\nThank you, Gary. Before management begins their formal remarks, we need to remind everyone that some of the management's comments today will be forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 as amended and Section 21E of the Securities Exchange Act of 1934 as amended, and we hereby claim the protection of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are statements about future events and include expectations and projections, not present or historical facts and can be identified by use of the words such as may, might, will, expect, assume, believe, intend, estimate, continue, should, anticipate or other similar terms. Forward-looking statements include and are not limited to, those regarding the company's future plans, mergers and acquisition strategy, strategic and financial objectives, expected performance and financial outlook.\n\nForward-looking statements are subject to numerous risks and uncertainties that could cause actual results to differ materially and adversely from what the company expects. Therefore, you should exercise caution in interpreting and relying on them. We refer you to DoubleDown's annual report on Form 20-F filed with the SEC on April 4, 2022, and other SEC filings for a more detailed discussion of the risks that could impact future operating results and financial condition. These forward-looking statements are made only as of the date of this call.\n\nThe company does not undertake and expressly disclaims any obligation to update or alter the forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. During the call, management will discuss non-GAAP measures, which are believed by management to be useful in evaluating the company's operating performance. These measures should not be considered superior to, in isolation or as a substitute for the financial results prepared in accordance with GAAP. A full reconciliation of these measures to the most directly comparable GAAP measure is available in the earnings release and on the Form 6-K filed with the SEC prior to this call.\n\nI would like to remind everyone that this call is being recorded and will be made available for replay via a link available in the Investor Relations section of DoubleDown's website. Now I would like to turn the call over to DoubleDown's CEO, Mr. In Keuk Kim.\n\nIn Keuk Kim -- Chief Executive Officer\n\nThank you, Jeff. Good afternoon, everyone. Thank you for joining us on the earnings call for our second quarter 2022 results. During the second quarter of 2022, we continued our lengthy track record of healthy financial results that are intrinsic to our high-margin capital-light business model.\n\nThis is evidenced by the $21.1 million in cash flow generated from operations in the quarter, or $0.43 per ADS, and an adjusted EBITDA margin of 32.4%, which has improved from the first quarter of 2022. These results also illustrate what we consider the adaptability of our business model to varying industry and macroeconomic conditions with a positive operating cash flows driving an increase in our cash and cash equivalents and short-term investments balance to $284 million. While revenue was down from the prior year period from $93.2 million to $80.6 million, our results continue to be above pre-COVID levels with revenue in the first half of 2022 exceeding 2019 levels by over 20%. We believe this shows our ability to have both acquired productive new players and expanded overall paying behavior during the COVID pandemic period.\n\nCompared to the prior year period, we believe our revenue was down for two primary reasons. The first is that 2021 results benefited from COVID-related restrictions that positively impacted player engagement and has since had a lesser impact on our results as those restrictions have been lifted. The second is that global inflation and potential economic slowdown concerns seem to be impacting user spend for certain users. These dynamics are certainly not specific to DoubleDown, and we are continuing to see positive metrics in the context of these dynamics as payer conversion remained above 5% and average monthly revenue per payer increased almost 4% year over year.\n\nGiven our flexible operating model, we also reduced operating expenses excluding a noncash accrual charges to income in the second quarter by 20% from the prior year, partially due to a reduction in overall sales and marketing costs. Given the ATT, IDFA deprecation situation with plans left to acquire new iOS players while investing more in the acquisition of new Android mobile users. We also have begun investing more to hire new players outside of North America as we can see it as an opportunity, especially for DoubleDown casino. We believe that this trend away from advertising to Apple users is consistent with that of the overall mobile gaming industry, and we will continue to monitor the effectiveness of advertising plans with each of our marketing channels to ensure we are meeting or exceeding our internal targets.\n\nAs we have discussed in the past, we maintain a [Inaudible] approach to our marketing investments and will not ramp spending really to grow users at the expense of shareholder value. The other factor reducing our operating expenses was our decision to moderate user acquisition investments for our first nonsocial casino app Undead World: Hero Survival. As you may recall, we began scaling back marketing activity for Undead World in the first quarter of 2022 to enable us to test new monetization enhancements while we observe improvement to monetization metrics with this enhancements. Our analytics suggest the title is not yet where it needs to be.\n\nAccordingly, we plan to continue optimizing future developments in the app and as a result, do not envision increasing marketing investment in Undead World this year. It is important to keep in mind that developing success for new games is not a risk release process as not all titles can be game changing hits. It is also important to note that we can develop these new titles within our existing financial model, which allow us to continue generating higher margins, positive cash flow and release new games that have a symmetric risk return profiles. Looking ahead, we continue to develop a robust pipeline of new titles outside of the social casino segment as we look to diversify our revenue and growth opportunities.\n\nWe plan on launching new games in the future, which can be accomplished within our existing R&D budget, all while continuing to reinvest in our flagship DoubleDown Casino app to introduce new meta-features and slot games. For example, we are continuing to work toward the open beta release of Spinning Space later this quarter, followed by a worldwide launch targeted in the fourth quarter of 2022. Spinning Space has both casino and noncasino elements and can, therefore, attract users within our existing social casino demographic and new users who prefer noncasino casual gaming. We also have several gaming apps under development by our internal studios planned for launch during 2023.\n\nNow I will turn it over to our CFO, Joe Sigrist, to walk you through our financials before providing my closing remarks. Joe?\n\nJoe Sigrist -- Chief Financial Officer\n\nThank you, IK, and good afternoon, everyone. Revenues for the second quarter of 2022 decreased 13.5% to $80.6 million from $93.2 million for the second quarter of 2021. As IK mentioned, we believe that during the second quarter, players became increasingly concerned about inflation and a slowdown in the global economy and adjusted spending on our apps. It is also important to note that the continuation of stay-at-home or work-from-home COVID prevention initiatives were still positively impacting the business during the second quarter of 2021, unlike in 2022.\n\nThese initiatives have significantly abated since then. Our key monetization metrics for the second quarter of 2022 reflect the trends noted above with respect to player behavior. In particular, average revenue per daily active user, or ARPDAU, was $0.95 in the second quarter, down from $0.99 in the second quarter of 2021. Average monthly revenue per payer was $226 in the second quarter, a year-over-year increase from $218 in the second quarter of 2021 and up slightly from 2025 in the first quarter of 2022.\n\nLastly, peer conversion, which is the percentage of players who pay DoubleDown was 5.2% in the second quarter compared to 5.8% in the second quarter of 2021. Total operating expenses for the second quarter of 2022 increased 71% to $128.6 million from $71.5 million for the second quarter of 2021. The increase was due to a noncash accrual of $71.5 million in the quarter, which was included in general and administrative expenses, reflecting an increase in the low end of the reasonably possible range of loss of $75 million to $201.5 million associated with the legal proceedings related to the Benson class action complaint. You may recall that the low end of the range set in the financial statements of our quarter ended June 30, 2021, was $3.5 million.\n\nAs we have noted in our financial statements, the company continues to review this charge periodically in the preparation of its quarterly financial statement and we consider it appropriate to adjust the possible range of loss at this time. Excluding the $71.5 million charge, operating expenses for the second quarter of 2022 were down 20% from the second quarter of 2021 and down 6% sequentially from Q1 of 2022. Of note, sales and marketing expenses in the second quarter of 2022 were $18.1 million, representing a nearly $2 million sequential decrease, compared to the first quarter of 2022 and lower than the $20.0 million recorded in the second quarter of 2021. The sales and marketing reduction was based on a combination of continued minimal investment in Undead World: Hero Survival, as well as a moderation of spending in DoubleDown Casino in the quarter to acquire iOS users, as IK mentioned.\n\nGoing forward, we expect sales and marketing expenses to continue at the Q2 level until later in Q4 with the pending release of Spinning and Space. It is also worth noting that depreciation and amortization expenses in the second quarter of 2022 were $1.5 million, compared to $5.9 million in the second quarter of 2021. The decrease from the quarter a year ago was due to the completed amortization of certain identifiable intangible assets for which we use purchase price allocation at the time of the 2017 DoubleDown Interactive acquisition. Net income for the second quarter of 2022 reflected a loss of $34.1 million or a loss of $13.75 per diluted common share and a loss of $0.69 per ADS, compared to net income of $18.4 million or $8.32 per diluted common share and $0.42 per ADS in the second quarter of 2021.\n\nNote, the weighted average number of ADS is in the second quarter of 2022 were 49.6 million, an increase from the second quarter of 2021 of 44.3 million due to our August 2021 IPO. Next, I want to discuss adjusted EBITDA. Adjusted EBITDA and adjusted EBITDA margin are non-GAAP measures, which we believe are useful in evaluating our operating performance. A full reconciliation of these measures to the most directly comparable GAAP measure is available in the earnings release.\n\nAdjusted EBITDA for the second quarter of 2022 was $26.1 million, compared to $31.1 million in the second quarter of 2021. Adjusted EBITDA margin for the second quarter of 2022 was 32.4%, down from adjusted EBITDA margin of 33.4% for the second quarter of 2021. The year-over-year decline in adjusted EBITDA and adjusted EBITDA margin is primarily attributable to the lower revenue in the second quarter of 2022, which I previously described. Adjusted EBITDA decreased slightly sequentially from $26.9 million in the first quarter of 2022 to $26.1 million in the second quarter of 2022 while adjusted EBITDA margin increased sequentially from 31.5% in the first quarter of 2022 to 32.4% in the first quarter of 2022 due to the reduction of cost and revenue and marketing and R&D costs.\n\nAs I mentioned, the overall reduction in our operating costs, excluding the noncash accrual compared to the second quarter of 2021 illustrates the variable and discretionary cost structure we have. Our most significant cost, our cost of revenue, which is comprised mostly of platform fees and royalties that are directly correlated to our revenue and sales and marketing costs, which are to a great extent discretionary. We believe this gives us an adaptable business model that can generate relatively consistent adjusted EBITDA and cash inflows across many different industry conditions and the ability to react on a timely basis to changes in macroeconomic cycles. Cash flow from operations for the second quarter of 2022 was $21.1 million, compared to $21.8 million for the second quarter of 2021.\n\nNote that the noncash accrual had no impact on our operating cash flow. We did not incur any material capital expenditures during the quarter. Finally, turning to our balance sheet. At the end of the second quarter of 2022, we had $284.4 million of cash and cash equivalents and short-term investments, compared to $268.2 million of cash and cash equivalents and short-term investments at the end of the first quarter of 2022.\n\nOur total debt at the end of the second quarter of 2022 was $38.7 million. Our cash position continued to improve as we continue to generate positive cash flows from operations. That completes my financial summary. Now I'll turn the call back over to IK for his closing remarks.\n\nIn Keuk Kim -- Chief Executive Officer\n\nThank you, Joe. In closing, I want to reiterate the attractiveness of our flexible business model, which we believe enables us to exploit and timely with time to changes in industry and macroeconomic conditions. With the majority of our operating costs being either directly correlated to revenue or discretionary, we believe we have significant flexibility and a strong ability to maintain high margins. Additionally, we currently have essentially low capital obligation and minimal debt with net cash, building minimal fixed costs in the context of our current cash flow and capitalization position.\n\nThese factors allow us to maintain favorable adjusted EBITDA margins, positive net income and positive free cash flow, which we believe are highly resilient, even in downside scenarios. We believe this attractive business model, coupled with our strong balance sheet of $171 million of cash and equivalents and short-term investments, net of that and the contingent loss accrual for the legal complaint makes a compelling investment opportunity. As we have discussed before, we are targeting -- augmenting our business through strategic M&A opportunities, while we, of course, cannot make any assurances about the timing of a potential transaction, if any, we are optimistic about the opportunities we are currently seeing in the market as our patient approach since our IPO has put us in an optimal buying position given the overall putback in valuations and associated tightening of capital market. As a reminder, while we intend to exploit synergistic opportunities, we would expect to leverage our current product development, marketing, user acquisition and live app capabilities with good growth prospects, strong assets and a healthy business model.\n\nWe are now happy to take your questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question is from David Bain with B. Riley. Please go ahead.\n\nDavid Bain -- B. Riley Financial -- Analyst\n\nGreat. Thank you, and congratulations on managing the 2Q cash flow. I was hoping to start with Benson. As you know, IGT recently took $150 million expense for Benson as well.\n\nAnd they own DoubleDown, I believe, for most of the years of the complaint period that would be covered. I'm wondering if one, that reserve amount -- your reserve amount versus IGT's, if that's contemplated that ownership period? Second, does W also have any exposure here? And then lastly, you identified a number that's more narrow in range. Does that provide some kind of visibility to more closely look at shareholder return of capital options? Sorry for the multiple-part question, but it's a -- we're excited about the movement in the case.\n\nJoe Sigrist -- Chief Financial Officer\n\nYeah. No, Dave, thanks so much for your questions. Obviously, our accrual was something we want everyone to understand. There's unfortunately, not a lot that I can say about IGT's decision with their reserve.\n\nAs most people, I think, know who are familiar with the case, both IGT and DoubleDown our codefendants in the complaint that has been brought by the class or prospective class. And so I really can't comment or do -- frankly, I have any insight -- we have any insight into IGT's decision with their reserve. As it relates to W exposure, all I can say is, I think, what I just said a minute ago, which is the co-defendants in the complaint are us, DoubleDown, and IGT. W is not a named party in the complaint.\n\nAnd as it relates to the accrual we've taken and how it could be viewed relative to our cash and to potential capital return to shareholders. Let me just state again that shareholder return is a primary focus of the company, and we recognize the importance of communicating with shareholders, plans and strategies around our cash balance. As we talked about before, we're very focused on growing our business inorganically. And I can make some comments on during his remarks about the status of the M&A market.\n\nAnd so we're obviously focused on that and have been continuing to be focused on potential acquisition. Clearly, cash is important as it relates to protecting ourselves and not only fighting whatever legal activities we're faced with, but also if a settlement has to occur, you have to be mindful of that as well. And so I think I'll finish by saying -- echoing what you said, Dave, which is we look forward to having this behind us, the expensing complaint behind us as soon as possible as well.\n\nDavid Bain -- B. Riley Financial -- Analyst\n\nAwesome. That was really helpful. IK, it was encouraging to hear you speak about M&A valuations rationalizing. When you're reviewing categories, how broad are you in that search at this point? Do you look at PTE, the play to earn, iGaming? Or can you give us some ideas as to what category, concepts you're either most attracted to or would rule out at this point?\n\nIn Keuk Kim -- Chief Executive Officer\n\nHi, Dave. Thank you for your question. We definitely look -- see our candidates around hypercasual gaming industry, including iGaming. Actually, we are in mobile gaming space.\n\nSo we do into more wider gaming industry as well. So it is how it helps you.\n\nDavid Bain -- B. Riley Financial -- Analyst\n\nOK. Thanks. So pretty broad-based. Are you narrowing it at all like in saying certain categories are less attractive than others or just very open, just so I have some clarity?\n\nIn Keuk Kim -- Chief Executive Officer\n\nYeah. We're actually very open to focus on our candidates, but especially, we continue to look for hypercasual gaming industry and iGaming industry as well. So it helps start it.\n\nDavid Bain -- B. Riley Financial -- Analyst\n\nOK. Yeah. No. Thank you.\n\nVery helpful.\n\nOperator\n\nThe next question is from Greg Gibas with Northland Securities. Please go ahead.\n\nGreg Gibas -- Northland Securities -- Analyst\n\nHey, IK and Joe. Thanks for taking the questions. Regarding, I guess, the trend of the inflationary pressures concerning players and spending less on apps industrywide, any thoughts on what that will mean for -- as that continues for sales in the back half of 2022? I guess as we layer in maybe another game or two, how are you kind of thinking about -- would it be kind of similar to what we saw in terms of a decline year over year in Q2? Or is there anything else you're taking into account there?\n\nJoe Sigrist -- Chief Financial Officer\n\nYeah, Greg, thanks for the question. The -- certainly, the trend that we've seen in our social casino business is impacted, we think, by a certain level of payer concern about inflation and their pocketbooks. That being said, it's really very positive to see that even compared to Q1 of 2022, average monthly spend for payers was up slightly. And as you can see up considerably year over year.\n\nSo the desire for players who are very engaged to play our game to the point where they're willing to invest and spend still very much seems to be there. The goal that we have in order to grow our social casino business revenue in the back half of the year is really around continuing to acquire high-quality payers. That's why for us, really continuing to monitor our user acquisition spend and focusing on return on advertising spend metrics so that we can get high quality, not just engaged players, but payers is extremely important. So IK and I talked a little bit about spending more focus and actually spending more dollars on the Android side and certainly looking at international opportunities.\n\nWe think that's important as we continue to look at ways to acquire strong new payers. And I think if we do that successfully, we do have an opportunity to start to turn around what has been a trend -- downward trend that we've seen in our social casino business. And so that's what it's going to take. As it relates to new apps, as we've always said, that layers on top of our social casino business.\n\nIt's added to our revenue there. And so the launch is being in Spinning and Space, our ability ultimately to improve the metrics on Undead World. And then, of course, if you look into 2023, we're pretty excited about the pipeline of games that we have in development. And so that's additive to kind of the baseline or foundation of revenue we have for our social casino business.\n\nGreg Gibas -- Northland Securities -- Analyst\n\nGreat. Very helpful, Joe. And kind of leads into my next question, too, if you can expand a little bit more on some of those recent efforts to attract higher value players and kind of rightsize the ad spend based on what you're seeing. It sounds like targeting new markets, you mentioned Android kind of players too.\n\nJust wondering if you can expand on those efforts?\n\nOperator\n\nPardon me, this is the conference operator. It appears that speakers' connection has dropped from their location. I'm going to try and get them back in here momentarily. Thank you.\n\nPardon me, everybody, the speakers of the line has reconnected. Mr. Gibas, your line is open. Again, if you would like to repeat your question for them?\n\nGreg Gibas -- Northland Securities -- Analyst\n\nSure. Yeah. Thank you. Kind of a follow-up.\n\nWas just wondering if you could maybe expand on those recent efforts to attract some higher value players. You mentioned, I think, starting new markets, but then also Android-based players, to -- just trying to understand how you're maybe maximizing your ad spend and what you're targeting?\n\nJoe Sigrist -- Chief Financial Officer\n\nYeah, sure. And again, apologize everyone for the drop. Yes. I mean -- so as we mentioned, it's important for us to continue to optimize our spend from ROI standpoint.\n\nBut we're also looking to expand not only the number of advertising channels, but also to optimize the channels that we have and to really provide to them what they need to be successful. So one of the things that we're working very hard to improve is -- are creative and the advertising content that we have and can be used to really excite our players and potential new players. So the focus on new creative is really important. And we're looking to leverage both new features and new slots because the ability for us to kind of leverage the excitement of a new slot release is critical as we've seen a pretty nice bump in the cases of new player engagement and new payer engagement, most importantly, when we are able to really lean into a high-performing new slot game.\n\nAnd so those are some of the things that we're doing, of course, in addition to this focus on Google and Android players and expanding beyond the U.S. market.\n\nGreg Gibas -- Northland Securities -- Analyst\n\nGreat. Very helpful. Last one for me. Just wanted to follow up on the M&A strategy and great to hear kind of your comments on seeing good opportunities.\n\nHas -- I guess, has the M&A strategy changed at all during this kind of period of industrywide headwinds, whether it's just from a target site you're looking at perspective over just timing? It sounds like valuations are getting better. So just wanted to see if anything has changed at all there.\n\nJoe Sigrist -- Chief Financial Officer\n\nYeah. No. Thanks, Greg. I mean, in general, I mean, as IK said, we haven't ruled out any categories as a result of what's happened in the macroeconomic environment more recently.\n\nI think the biggest change is the fact that valuations have become frankly more reasonable. Now obviously, there are some targets -- well, at least potential targets, I'll be honest and say no one that we had really in our sites. But certainly, in general, what we're hearing from bankers is that some people who were sellers before have decided they're going to wait it out a bit while hopefully, things improve from their perspective in the markets. And that said, that doesn't mean that there's a lag.\n\nThere certainly isn't a lack of opportunity. And again, I think it's only to the good relative to the valuations that we can ultimately secure a company for.\n\nGreg Gibas -- Northland Securities -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThe next question is from Aaron Lee with Macquarie. Please go ahead.\n\nAaron Lee -- Macquarie Group -- Analyst\n\nHi. Thanks for taking my questions. Wanted to dig into the quarter a bit more. Could you describe the cadence of trends through the quarter? Did April, May and June look pretty consistent? Or was there a point where you saw trends drop off more steeply, just given your comments around macro impact in players? Thanks.\n\nJoe Sigrist -- Chief Financial Officer\n\nYeah. I think the quarter was pretty consistent relative to what we saw. I mean there is always a bit of seasonality, if you will, in the second quarter in the sense that as the summer approach is June generally just becomes a little different because school's out and people are generally more active and away from their devices perhaps a bit more. But again, that's fairly typical.\n\nAnd relative to some of these other factors that we expressed in the call, I think yes, it was a fairly consistent set of trends over the 90 days.\n\nAaron Lee -- Macquarie Group -- Analyst\n\nGot it. And can you share which users are being impacted by these macro concerns? And when did you start noticing this impact?\n\nJoe Sigrist -- Chief Financial Officer\n\nWell, I think it's -- I'll answer the first question. The second question is a little harder. But I do think that -- especially -- and again, if you look and do the math, I mean if you think about our average revenue per month per payer, going up actually sequentially. The more engaged payer certainly is still engaged.\n\nAnd it's the kind of the lower value payer, which is generally kind of less long-lived as it relates to its paying behavior anyway. That appears to be where we're seeing the macroeconomic and inflationary concerns impacting us the most. The good news is that those players are the ones that generally get replaced in a kind of a larger way, if you will, by new players and new payers and that's why the focus is on acquiring really good new players and payers.\n\nAaron Lee -- Macquarie Group -- Analyst\n\nOK. Understood. Thank you.\n\nOperator\n\nAt this time, this concludes our question-and-answer session. I'd now like to turn the call back over to Mr. Sigrist.\n\nJoe Sigrist -- Chief Financial Officer\n\nYeah. Thank you, operator, and thanks, everyone, again, for your interest in the company and for your participation in our earnings call today. We look forward to providing more updates over the next several weeks to the company's progress and look forward to hopefully having you on our call next quarter. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJeffrey Grampp -- Investor Relations\n\nIn Keuk Kim -- Chief Executive Officer\n\nJoe Sigrist -- Chief Financial Officer\n\nDavid Bain -- B. Riley Financial -- Analyst\n\nGreg Gibas -- Northland Securities -- Analyst\n\nAaron Lee -- Macquarie Group -- Analyst\n\nMore DDI analysis\n\nAll earnings call transcripts"
}