{
  "companyName": "MGM Resorts International",
  "companyTicker": "MGM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/mgm-resorts-international-mgm-q3-2022-earnings-cal/",
  "content": "MGM Resorts International (MGM 0.81%)\nQ3 2022 Earnings Call\nNov 02, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the MGM Resorts International third quarter 2022 earnings conference call. Joining the call from the company today are Bill Hornbuckle, chief executive officer and president; Corey Sanders, chief operating officer; Jonathan Halkyard, chief financial officer and treasurer; Hubert Wang, president and chief operating officer of MGM China; and Andrew Chapman, director of investor relations. After the company's remarks, there will be a question-and-answer session. [Operator instructions] Please note this conference is being recorded.\n\nNow, I would like to turn the call over to Andrew Chapman.\n\nAndrew Chapman -- Director of Investor Relations\n\nGood afternoon, and welcome to the MGM Resorts International third quarter 2022 earnings call. This call is being broadcast live on the Internet at investors.mgmresorts.com. We've also furnished our press release on Form 8-K to the SEC. On this call, we will make forward-looking statements under the safe harbor provisions of the federal securities laws.\n\nActual results may differ materially from those contemplated in these statements. Additional information concerning factors that could cause actual results to differ from these forward-looking statements is contained in today's press release and in our periodic filings with the SEC. Except as required by law, we undertake no obligation to update these statements as a result of new information or otherwise. During the call, we will also discuss non-GAAP financial measures in talking about our performance.\n\nYou can find the reconciliation to GAAP financial measures in our press release and investor presentation, which are available on our website. Finally, this presentation is being recorded. I will now turn it over to Bill Hornbuckle.\n\nBill Hornbuckle -- Chief Executive Officer and President\n\nThank you, Andrew, and thank you all for joining us this afternoon. I'm pleased to report another phenomenal quarter of financial results driven by our domestic business, with the Las Vegas Strip setting a new record for revenues and adjusted property EBITDAR. These results come on the heels of a record-setting quarter in Las Vegas -- our second quarter in Las Vegas and our regions. Also, the Cosmopolitan Las Vegas had one of its best quarters in its first fourth quarter of operation under MGM Resorts leadership and continues to outperform our initial expectations.\n\nWe continue to see further opportunity with the Cosmopolitan as we look to integrate our reward system and improve physical connection to our sister properties. Net-net, 2022 is shaping up to be a record year for many of resorts, and we believe a fundamental change in people's perception of travel and the value that it brings to their lives in Las Vegas and MGM Resorts is benefiting this emerging theme. I want to thank our employees, again, for the tremendous efforts they put forward to achieve these outstanding results. We know that our guests are experiencing greater satisfaction in their stays as measured by our internal Net Promoter Scores, which continue to exceed our projections, as well as our TripAdvisor rankings, which have improved significantly across our portfolio in the last year.\n\nPut all together, and MGM continues to make great progress toward our long-term vision which is to be the world's premier gaming and entertainment company. We've achieved this vision by remaining laser-focused on that strategic plan. Let me hit some of the highlights of the quarter, and then Jonathan will dig into the results in more detail. First off, I'm pleased to share that we have completed our acquisition of LeoVegas in September.\n\nThis important acquisition represents the first step of an aggressive expansion in international and online gaming for MGM. I'd like to again welcome Gustaf Hagman and the team. And we also recently announced the addition of Gary Fritz as our president of interactive. Gary will lead our broader digital strategy both here in the U.S.\n\nand internationally, which LeoVegas is a significant part. Staying with digital for a moment, we remain bullish on BetMGM, which continues to build on its success every quarter. And the third quarter, BetMGM launched in Kansas representing its 24th market to date and the eighth new market we have added since November of last year. Looking forward, we will add Massachusetts, Ohio, and Maryland to our online sports betting portfolio.\n\nBut MGM remains the clear leader in iGaming with a 29% market share, and BetMGM commands 22% share in active markets when combining U.S. sports betting and iGaming. As we hit the halfway point of the NFL season, we're encouraged by the preliminary metrics, reinvestment has remained within our expectations and market appear to be acting more rationally. As BetMGM shared in May at its Investor Day, our strategy is to focus on profitability by allocating spend to geographies with the highest ROI and targeting bonusing.\n\nWe believe this is being executed exceptionally well. Our investment in BetMGM and LeoVegas will allow us to continue to drive our omnichannel strategy, a key competitive advantage that over time allows us to generate incremental earnings between our brick-and-mortar and our online channels. Early results of this strategy have been positive with a strong acquisition story, as well as the creation of brand stickiness. Of the players that play in both channels, we've seen a younger customer, in fact, almost 90% of the BetMGM omnichannel customers who visit Vegas are younger than 50 and over 50% are under the age of 35.\n\nOverall, customers who play online at our properties have increased engagement and our lower cost per acquisition which reflects the operating leverage we can and will drive into the future. Now I'd like to talk about the integrated resource development opportunities we have. New York State pointed the majority of the Gaming Facility Location Board members in October, and we anticipate the state to issue the casinos RFA by early January. We are developing a compelling proposal, and we look forward to submitting it in the coming months.\n\nBeyond the United States, MGM and our development partner, Orix, along with the city of Osaka, submitted our area development plan to the government of Japan in April, and we are optimistic that we received certification in the near future. I recently visited our development site and we and the Orix team couldn't be more excited by the opportunity to bring a fully integrated resort to Japan. Turning to Macau. We officially submitted our application for a new concession in September and we remain committed to supporting Macao's continued development as a world-class tourism and leisure destination.\n\nWe aim to support the Macau government in achieving its diversification goals, and we'll continue to invest in the innovative projects and programs that help the region flourish. The Macau government is in the process of reviewing each of the concessioners' proposals and we expect a decision to be made by year-end. Let me close by making some high-level comments on the current state of business and our future outlook. Business is exceptionally strong right now in Las Vegas at MGM Resorts and we see the market remaining exceptionally hot.\n\nIn particular, we are seeing outsized strength in our luxury resorts where pricing remains robust. In fact, October was our highest month ever in terms of hotel revenue. As we look at the convention segment, which has the longest lead time it gives us visibility into the future, our convention room mix is pacing at our goal of 19% with increased ADRs year over year. Our outlook continues to be positive and we're flexing our operations to take full advantage of the demand we're experiencing in the marketplace.\n\nProgramming also remains an exceptional story which further solidifies Las Vegas as the nation's top sports destination. We will host a men's NCAA West Regional for Suite 16 in Elite 8 rounds at T-Mobile in March and Formula One, as you know, were selected the weekend of November 16 next year. So, it was the first-ever Las Vegas race on the strip, that weekend happens to be one of the slowest historic weekends of the year for us ahead of Thanksgiving. We'll open our hotel calendar tomorrow for those states and expect an exceptional demand based on our studies of other host cities.\n\nWe believe the prime positioning of our properties will allow us to fully capture the benefits of this exciting race. So, right now, we have reasons to be optimistic as we look ahead. That said, we're not blind to the overall macroeconomic conditions, and we remain keenly aware of the impact of inflation and the concerns of a potential recession. We continue to stay alert and are actively monitoring our business and indications of a slowdown.\n\nOur operations teams have become incredibly nimble over the last few years and are prepared to quickly adjust our business to the changing demand trends if they occur. In the meantime, we'll continue to look for opportunities to drive organic growth in our core business to select key capital investments in our properties and through our MGM Rewards program. MGM Rewards continues to deliver on our promise to provide more compelling benefits to all of our members. In fact, since we launched the new program, we have seen a greater portion of our direct bookings from MGM Rewards members and an increased tier progression, particularly for our Gold Plus players.\n\nWith that, I'll turn this over to Jon and to discuss more details of the quarter. Jon?\n\nJon Halkyard -- Chief Financial Officer\n\nThanks very much, Bill. Let me start my remarks by also welcoming Gustaf and the over 900 LeoVegas employees to MGM Resorts. No doubt the future of LeoVegas is bright, and I'm confident this enterprise will serve as a meaningful contributor of talent and earnings to our company. I'd also like to echo Bill's comments and thank all of our employees for the second straight quarter of record results.\n\nOur people are the best in the business, and they demonstrate that every day with the care they show for our guests. Now, let's discuss our third quarter results in some detail. Our consolidated third-quarter net revenues were $3.4 billion, an increase of 26% compared to 2021 despite the 70% revenue decline at MGM China due to closures and other COVID-related limitations. On the Las Vegas Strip, top-line demand was strong, with same-store net revenues increasing 18% and same-store adjusted property EBITDAR up 8%.\n\nOccupancy was a major driver of the improvement year over year, reaching 93% for the quarter, the highest it's been since the start of the pandemic, an improvement -- and an improvement of over 1,000 basis points year over year. The key driver of the occupancy gain is midweek demand, which is returning to more normal levels as conventions and group's return. The value proposition of our group business supports our pricing power in Las Vegas. ADR hit a record $227 in the third quarter, an increase of 26% year over year.\n\nWe continuously work to optimize the hotel mix in our business. Over the past two years, we've increased the effectiveness of our casino marketing and loyalty programs to drive the casino and direct high-rate transient business mix up by several percentage points each. And this has helped offset the decrease in convention mix that we experienced in 2020 and 2021. Now as our convention mix returns, we're generally displacing less profitable but still important leisure business.\n\nThis convention business comes at a higher average rate typically between $30 to $40 higher and brings with it higher-margin catering spend. Our third-quarter regional net revenues grew 5%, while adjusted property EBITDAR declined 8%. During the quarter, our highest daily Warts Casino segment remained our best performing with the greatest increase in both rated days and theoretical win. Our casino customers aged 65 and above grew again this quarter as compared to last year and 2019, but it still hasn't reached the visitation frequency pre-pandemic.\n\nOur local and cross-property efforts will continue to address these important segments to drive further growth. Adjusted property EBITDAR margins were 33%, a decrease of approximately 450 basis points compared to the third quarter last year. This margin result is consistent with our prior commentary. And as the market stabilize, we expect to maintain 400 to 600 basis points of margin improvement versus 2019.\n\nWe've increased our employee headcount by low double digits. During 2021, we faced a difficult hiring environment and had a number of outlet closures, but we're now fully staffed, fully open and have returned to the service levels for which we are known. In Macau, adjusted property EBITDAR was a loss of $70 million in the third quarter of 2022 due to property closures and COVID-19-related policies limiting visitation to the market. On BetMGM, the growth and continued improvement we are seeing in this business is overwhelmingly positive.\n\nOur 50% share of the losses in the third quarter narrowed to $24 million, which is reported as a part of the unconsolidated affiliates line of our adjusted EBITDA calculation. This brings our year-to-date loss to $186 million, and we remain comfortable with our guidance for a $225 million contribution for the year. Net revenues associated with BetMGM operations were $400 million this quarter, exhibiting an approximately 90% year-over-year growth from the third quarter last year, led by the continued strength in iGaming and new markets, as well as disciplined reinvestments within sports betting by the management team. Through the first nine months of the year, BetMGM's revenue associated with operations have surpassed $1 billion, which puts them well on track to achieve their target of over $1.3 billion this year.\n\nLooking forward, improved design and functionality of the BetMGM app launch of a single wallet and omnichannel growth will be tailwinds behind future growth of their business and its impact to MGM as we look to reach profitability during 2023. Our third quarter corporate expense, including share-based compensation, was $117 million, which included $9 million of transaction costs related mostly to LeoVegas. We do expect corporate expense to remain elevated in the fourth quarter due mostly to transaction costs related to the Mirage sale. We're strategically investing our corporate resources in growth areas, including improvements to our IT infrastructure, enhanced digital offerings, and our IR development efforts in Japan and New York.\n\nAnd finally, our capital allocation priorities are as follows. First, we'll maintain a strong balance sheet with adequate liquidity. Second, we'll invest where we have clear advantages, exercising prudence and measuring prospective returns for our shareholders. And finally, we'll return cash to our shareholders.\n\nThese priorities are manifested in our major allocation decisions this year. We bolstered our liquidity through the closing of the VICI transaction and the announced sales of the Mirage and Goldstrike. We acquired the Cosmopolitan of Las Vegas, which strengthened our portfolio. We're making strategic capital deployments into improving our existing product with room remodels across three of our major properties and an announced refresh of the Mandalay Bay Convention Center to shore up our long-term group market share.\n\nWe returned cash to our shareholders through share repurchases. During the third quarter, we repurchased 10 million shares for $307 million. From the beginning of 2021 through yesterday, we've repurchased 115 million shares for $4.4 billion, or 32% of our market cap. This activity brings our share count down to 384 million shares.\n\nLast quarter, I made the case for the attractive valuation of our shares, and I feel even more strongly now with market-leading domestic operations driving record results leases limited to 2% or 3% escalation for the next 10 years, embedded cash flow growth in BetMGM and MGM China and about $11 per share in cash I think our stock trades at pretty attractive levels. We plan to continue to buy back stock through our authorized program. And moving forward, we will also continue to invest our capital in growth projects such as New York, in Japan, as well as strategic M&A. With that, Bill, back to you.\n\nBill Hornbuckle -- Chief Executive Officer and President\n\nThanks, Jon. We believe we've accomplished a great deal year to date. I'm optimistic about our path forward. What we are doing is working.\n\nOur existing operations continue to grow as evidenced by another record court in Las Vegas with a positive outlook thinking about October and beyond. Our balance sheet is in a position of strength as we have more than $6 billion in domestic liquidity with almost no net debt. BetMGM is firing on all cylinders, demonstrating tremendous growth, and remains on track to achieve profitability during 2023. We also expect further global digital growth with LeoVegas, MGM China, and Macau market are showing some productive signals, and we believe we are well positioned with respect to licensing renewals.\n\nAlso, New York and Japan represent future development growth opportunities for our company. I would again like to thank our employees for their continued hard work and commitment to our company. And with that, we'll open this up for questions. Operator?\n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions] As a reminder, in all fairness, please limit yourself to one question and one follow-up. Our first question will come from Joe Greff with JPMorgan. Please go ahead.\n\nJoe Greff -- JPMorgan Chase and Company -- Analyst\n\nGood afternoon, everybody. Bill, Jonathan, whoever wants to take this question. I was hoping you could just talk a little bit more about where you do have visibility into next year, the group and convention business in Las Vegas. What percentage of your anticipated room nights are on the books right now? And at what price is that relative to this year or if you want to look at it in relation to 2019?\n\nBill Hornbuckle -- Chief Executive Officer and President\n\nSure. Let me kick it off and I'll probably turn it over to both of my colleagues here. So, we're targeting, as I mentioned in my comments, 19% market mix. A couple of things.\n\nWe've been as high as 2021. We've got about 100,000 room nights off-line. We're doing a Mandalay Bay complete remodel, which is undertaken and underway, and it's been highly well received. We were able to preview it recently through IMAX.\n\nWe've taken 100,000 room nights off of weekends. Given the strength with weekends, we're very positive on our ability to drive higher-rated business, particularly through leisure and casino ultimately. ADRs in the mid-single digits. And then, Corey, if you want to talk, I think, a little bit the percentage.\n\nCorey Sanders -- Chief Operating Officer\n\nYeah, yeah. We usually are about 80% on the books right now. I think we feel pretty good on where we are. In addition to that, we also are looking at where we place convention.\n\nIn the past, we had a lot of convention room nights on weekends. So, we strategically think we could do better cash flow by not placing some of that business on weeknights. So, you'll probably see our mix come down a little because of that also.\n\nJoe Greff -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thank you. And then with respect to New York, can you remind us, the scope of the all-in investment, the timing of the spend, and anticipated timeline to complete once you start once you get approval?\n\nBill Hornbuckle -- Chief Executive Officer and President\n\nYes. You said New York, correct?\n\nJoe Greff -- JPMorgan Chase and Company -- Analyst\n\nNew York, yeah.\n\nBill Hornbuckle -- Chief Executive Officer and President\n\nYeah, yeah. So, hopefully, we hear something -- obviously, we get this RFA request. They have a 90-day window to issue it, which means by January 1. There's some debate over if they can issue all three licenses at once or if they will issue all three at once or they'll go independent of that.\n\nBut we're hoping for '23 in terms of being awarded a license. If you factor in the licensing fee and the initial expansion, we're looking at about a $2 billion to $2.2 billion investment, which given -- let's just say it takes till the end probably the spend on that is going to be between $24 million and $25 million.\n\nJoe Greff -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nOperator\n\nOur next question will come from Carlo Santarelli with Deutsche Bank. Please go ahead.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nHey, everyone. Good afternoon. Jonathan, you provided a lot of color on kind of the mix, and you guys just hit on the group pace for next year. But what was -- how do you think about kind of the target of casino? What is casino running at this year as a percentage of room nights? And what is kind of the target next year within the 19% group and obviously trying to pull out of FIT and some of the OTA channels, things like that?\n\nJon Halkyard -- Chief Financial Officer\n\nI'll just -- I'll make a couple of comments and certainly invite Corey to comment as well. The casino room mix be in the high 20s to low 30%. It's pretty stable A lot of our work recently has been around yielding the casino even more effectively, particularly during midweek. The casino business was very strong for us in terms of room nights a year ago, as I noted in my comments, but that has -- since that and some of the leisure business has been overtaken profitably by group business.\n\nThe other thing I'd mention, which is important is our direct bookings through our proprietary channels are up about 11% this quarter versus a year ago. And that's at nearly three times the rate of the growth of our overall web bookings. So, this is one of the areas in which our MGM Rewards program and the improvements we've made to that, as well as other marketing efforts, have really helped drive the leisure business even through our proprietary channels.\n\nCorey Sanders -- Chief Operating Officer\n\nJon, I agree. I mean, we've got our casino room nights about where we want them. making sure that we have the most profitable customers on the weekend there. The goal would be as this group business comes back to shift it really out of the package business, our lowest rate of business.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nGreat. Thank you both. And then if I could, just one follow-up. Jonathan, I know you mentioned the project for regional was kind of to remain 400 to 600 basis points north of 2019 for that segment.\n\nWith respect to Vegas and acknowledging a lot of moving parts with Cosmopolitan coming in city center being consolidated, start to sort this going out if we're going back to 2019. And then obviously, Mirage going out later this year. On an apples-to-apples basis, relative to '19, do you guys have a similar kind of target range in mind?\n\nJon Halkyard -- Chief Financial Officer\n\nI actually think we can do better than that in Las Vegas in part for a number of the reasons you mentioned, which is, of course, some of the changes we've made to the portfolio here or will have prospectively with the sale of the Mirage but also just increasing effectiveness in driving demand and yielding, I'd feel comfortable that the margins will stabilize at increments higher than that that I described for the regional properties.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nOK. Is it safe to say it's kind of 400 to 600 operational plus the mix influence of those kind of four assets coming in and out?\n\nJon Halkyard -- Chief Financial Officer\n\nAt a minimum, I would say yes.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nAt a minimum. Great. Thank you very much.\n\nJon Halkyard -- Chief Financial Officer\n\nOK.\n\nOperator\n\nOur next question will come from Shaun Kelley with Bank of America. Please go ahead.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good afternoon, everyone. Just wanted to ask a little bit about mix and margins, specifically maybe sticking with Las Vegas for a moment. It looks like continued pretty strong sequential growth on the casino side.\n\nAnd Jonathan, I know this has been an area where you've probably been expecting things to be at some point, maybe settle back into more normal behaviors, but it just still seems like it's really robust. So, could you just give us a little bit more color about the dynamic there, what you saw in the quarter and how you see that trending both sort of marketwise and then things you might be doing for market share because, again, that does look strong relative to the market?\n\nJon Halkyard -- Chief Financial Officer\n\nYeah. I think the margin performance is, of course, a number of dynamics going into it, but one of the most important has been our ability to yield on the room demand here. And we've seen it not only in our luxury properties but also more recently in our other properties here in Las Vegas. So, I would say the main contributor to it has been the has been the strength in the hotel yielding.\n\nWe have grown our labor in both the regional markets and in Las Vegas in the past quarter. And we've done that intentionally. It's been reflected in our NPS scores and what our customers are telling us about their experience here. But it's also had some impact on margin, one that we intended.\n\nAnd hopefully, we've signaled pretty clearly in the past. And that's really important because it is all about growing long-term market share for profitable market share for our businesses here in Las Vegas. And we think that those customer service scores and the retention associated with those customers are going to help us get there.\n\nCorey Sanders -- Chief Operating Officer\n\nAnd, Shaun, what I would add on the casino side, every weekend here is just a major weekend with events between Allegiant, the three major showrooms here, the arenas that demand, we don't really see slowing down. And probably piece is still missing, but we're starting to see some of this come back is the Far East play. We've seen some groups from Hong Kong. We've had intentions from groups from Singapore that wanted to come back.\n\nSo, I think we're pretty optimistic on what we see in the casino front in Las Vegas.\n\nBill Hornbuckle -- Chief Executive Officer and President\n\nAnd, Shaun, maybe final, just some color. It was kind of interesting to me last night. Elton John was here on a Tuesday night, he put 50,000 plus in Allegiant Stadium the south end of the strip is absolutely benefiting. We thought Allegiant could do like 40 events.\n\nI think it's going to do that in more. And if you think about the nature of people saying, that's like 100 days a year that people have visitation to Las Vegas driving a huge activity case, particularly at the south end of the strip which is obviously core to that neighborhood. And so, we're pretty excited by it. We think it underlines a foundation that just puts us at a different place than we've ever been historically.\n\nSo, that's one of the reasons I think we've seen this ADR growth has been amazingly substantiated throughout the company. This particular month in October, Excalibur Luxer had great months.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nThank you very much.\n\nOperator\n\nOur next question will come from David Katz with Jefferies. Please go ahead.\n\nDavid Katz -- Jefferies -- Analyst\n\nAfternoon, folks. Thanks for taking my questions. In the past, I can recall, Jonathan, you're giving out some and land-based MGM and MGM Rewards players. Are you able to talk about any of those this time?\n\nBill Hornbuckle -- Chief Executive Officer and President\n\nIt's actually Bill, David. I'll take part of that. Yeah, we are -- look, it continues. The idea of omnichannel is still very strong.\n\nFirst and foremost, MGM Rewards has just surpassed 40 million folks in our database. We get about 40 -- the key driver to that has been BetMGM. And so, we are just supplying close to 40% of our new customer base. The inverse of that is we're supplying BetMGM with about 15% of its customers.\n\nAnd then we've seen -- and I know you've heard some other industry numbers on folks that have come in omnichannel spend. We've seen that number double in the last year between what happened in the third quarter of '21 versus the third quarter of '22 in terms of activity. So, there's nothing to indicate we're not extremely positive by that opportunity in the channel that brings us and the overall nature of it. And interestingly, we're excited to continue to project that into LeoVegas and some of the things we want to do internationally over time.\n\nAnd so, overall, it's working exceptionally well.\n\nDavid Katz -- Jefferies -- Analyst\n\nUnderstood. And my follow-up question was going to be about LeoVegas. And if you could just be a bit more specific about what capabilities it brings you that may be transferable or helpful within the United States or North.\n\nBill Hornbuckle -- Chief Executive Officer and President\n\nWell, to be clear, within the United States and North America, of note, Canada and Ontario province, to be specific, that is the domain of BetMGM. And so, that -- all of that activity case would remain with that JV and that partnership. Leo Vegas was an opportunity to open up rest of the world. And so, while relatively small, its scale to some, it's probably going to be about $50 million in cash flow.\n\nWe love the team. We love the operating environment it has, the system it has. It's got a full slate of iGaming opportunities. Sweden is the benchmark, about 35% of its business comes from there.\n\nBut we've got a sports betting product. So, it's got all of the tools. We look to add on to it with live dealer. We're looking at a studio increment that could be added on to this thing.\n\nAnd so, we see it as a cornerstone to grow rest of world. If we think about places like Brazil, which is that activity, and talking more and more about sports betting and hopefully and potentially, casino gaming. We just see that as a leading opportunity for us and a vehicle to do that.\n\nDavid Katz -- Jefferies -- Analyst\n\nOK. Thank you very much.\n\nOperator\n\nOur next question will come from Dan Politzer with Wells Fargo. Please go ahead.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nHey, good afternoon, everyone. Jon, you gave some detail on how you think about valuation for your stock. I think you called out the $11 per share of cash on the balance sheet. How do you think about the elution here given you have the $4.4 billion of cash, $1 billion one-sixth of liquidity? What do you think is the normalized cash balance that you feel comfortable with, given the macro and some of your rent and capex obligations?\n\nJon Halkyard -- Chief Financial Officer\n\nYeah. There's about $400 million or so that's required in so-called working capital and our cages, etc. And we have established a financial policy that we will have $1.5 billion available to us in addition to our revolving credit, which is approximately $1.5 billion. So, that's the way we think about it.\n\n$1.5 million would be considered our minimum cash.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nGot it. And then just as my follow-up on Vegas, some of your competitors have called out one-offs in the quarter such as utilities. Was there anything there that you'd call out or that you saw on your side?\n\nJon Halkyard -- Chief Financial Officer\n\nNo. Not in the third quarter. Our utilities are largely bought through the -- our energy costs largely bought through the end of 2023. So, we didn't suffer any meaningful increase there.\n\nIn fact, the opposite is that we continue our energy efficiency programs have had a slight decline in usage. But no, there's really nothing unusual in Vegas. In the regions, there were a couple of unusual items. There was some minor hold impacts in the third quarter, about 60 basis points.\n\nAnd we also had some hurricane proceeds in the prior-year quarter, about 80 basis points. Most of the rest of it was labor increases when we look quarter over quarter, but we did probably have one and a half points of unusual margin items in the regions in the third quarter.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nGot it. Thanks so much.\n\nOperator\n\nOur next question will come from Chad Beynon with Macquarie. Please go ahead.\n\nChad Beynon -- Macquarie Research -- Analyst\n\nHi. Good afternoon. Thanks for taking my question. Bill, Jonathan, I know you mentioned that, I guess, firstly, BetMGM is coming in better than the $1.3 billion revenue projection.\n\nAnd you're still on track on the losses for the year. You did mention that you still expect to achieve profitability in '23 at some point. But given that everything is coming in better than expected. California, there's not going to be a big launch in '23.\n\nJust given the maturation of the markets where you currently offer your product, are there reasons why you might not be able to hit that goal potentially earlier if hold is as expected? Thanks.\n\nBill Hornbuckle -- Chief Executive Officer and President\n\nLook, Chad, I wouldn't go so far as to change our projections and our prediction that by this time next year, we should be in a profitable scenario. So, I want to stay on point on that. You know the new markets we've indicated we're opening up. We think we have real opportunity there.\n\nWe're doing some very interesting one and the only kinds of things in the iGaming marketplace where we have integrated jackpots that are omnichannel that will stretch across our casinos, as well as the digital channels. And so, we've got two or three products coming out that are going to be exclusive, and we're excited by. And I think you all know iGaming is the lion's share of the NGR in this whole universe, actually. And so -- but no, I don't want to get ahead of ourselves.\n\nWe continue to invest in the business. We want to see it grow. We like the positioning we have, both from iGaming in particular and ultimately in sports betting. And so, it will take some investments.\n\nPoint on California is well taken. But we're not going to get ahead of ourselves right now.\n\nChad Beynon -- Macquarie Research -- Analyst\n\nOK. Thanks. And then with respect to the zero-COVID policy in China and kind of where things stand right now. Has anything changed in terms of your expectation of when the spigot could or should turn back on? And then if not, how should we think about the current burn rate in that market? Thanks.\n\nBill Hornbuckle -- Chief Executive Officer and President\n\nI'll let Hubert chime in here in a moment. I would say this because obviously, we all got the message of zero tolerance, and it was demonstrated this week in Shanghai and ultimately at our own Cotai property, and ever can speak to that. Also, at the other side of the coin is they've opened up every province. All 31 provinces now are accessible to do eVisa which is convenient and timely.\n\nAnd so, we're encouraged by the signal and really what it means for Macau. Macau is obviously an SAR, but it is obviously considered part of broader China in every way shape performance. So, the support, I think it's trying to give it. By doing that, I think, is meaningful to us.\n\nAnd hopefully, over time, can get us to a different place. I'm not going to project when that time is. It's just been, as we all know, so many curves in this road. But I don't know me, Hubert, if you want to talk any more sentiment and particularly, maybe talk about where you are with the lockdown.\n\nHubert Wang -- President and Chief Operating Officer of MGM China\n\nYeah. Thanks, Bill, and thanks, Chad, for your question. The policy that recently lost the Visa application and also the group visa application entire nation to Macau. I think that's definitely a long-term positive.\n\nShort term, we probably will still -- it's a gradual ramp-up process and maybe with fluctuation between due to the dynamic zero-COVID policy in place. So, I think that just to give you an example, in Macau, recently, there have been in some cases. So, we have seen the measures to border crossing has been tightened. And there are cases -- there were one case, single case in MGM Cotai, and we had to shut down the operation for three days, and we just reopened and quarantine yesterday and will reopen today.\n\nSo, these types of things could happen from time to time if the policy is still in place. But overall, I think over the long run, it's a positive. In terms of your question on the bond rate for us, I think that we're looking at opex of about $1.5 million a day, in that range.\n\nChad Beynon -- Macquarie Research -- Analyst\n\nThank you very much.\n\nOperator\n\nOur next question will come from Robin Farley with UBS. Please go ahead.\n\nRobin Farley -- UBS -- Analyst\n\nGreat. Thanks. I know you talked a little bit about some of the factors with the regional margin being down with labor costs and things. I'm just curious if you're seeing anything in terms of marketing your promotions in the regional markets, just given that you mentioned that gaming revenue was pretty much flat, and the growth was coming from non-gaming if that is starting to lead to anything promotional.\n\nThanks.\n\nCorey Sanders -- Chief Operating Officer\n\nHi, Robin. It's Corey. I think in general, in most of our regions, we're seeing some reasonable reinvestments. Atlantic City, we saw a little bit of a ramp -- that market is a tough market right now.\n\nBut in general, our reinvestments have stayed pretty consistent. As we add some of these amenities, which our players have been asking for, that component of those comps will go against that gaming revenue, which would give it a reason why it'd be flat, but you would see profitability in other departments in the regional areas.\n\nRobin Farley -- UBS -- Analyst\n\nOK. Thank you. And just for the follow-up, I'm curious if you're seeing anything different in terms of demand at your Vegas resorts in terms of the more premium properties versus the properties that are sort of more broad market. Are you seeing any difference in demand trends there? Thanks.\n\nBill Hornbuckle -- Chief Executive Officer and President\n\nLook, I think we've said it in our general comments, Robin, although again, October for some of our legacy properties was a bit surprising in the context of affirmative part of it was probably due to the programming I mentioned earlier. But generally speaking, our ability to yield up is tied to luxury. It's tied to average rates at places like Aria, Casapalca, and Bellagio. It's tied to fine dining.\n\nIt's tied to the entertainment experiences that may be a Bruno Mars or something of that ilk. And so, we just have not seen a slowdown in that fact to the contrary. And so, it doesn't mean -- we're not -- eyes wide open on what may happen here. But to date and through October, the phenom of what's happened in Las Vegas, particularly for our higher-end properties continues, and we're pretty excited by all of that.\n\nRobin Farley -- UBS -- Analyst\n\nOK, great. Thank you very much.\n\nOperator\n\nOur next question will come from John DeCree with CBRE. Please go ahead.\n\nJohn DeCree -- CBRE -- Analyst\n\nHi, everyone. Thank you for taking my questions. Maybe one more in Las Vegas about your convention group bookings, maybe a bigger-picture question. As you look forward to 2023, and we've got the big ones in 1Q, maybe Corey, are you seeing attendance or bookings per the big events get back closer to 2019 levels or when you start to see pacing, is it more driven by more events? I guess we have a lot of conversations.\n\nAre those big events going to see similar attendance as 2019? Or might they be smaller and then you guys can kind of grow overall attendance through various sales to other departments? So, curious if you have any visibility on that yet.\n\nCorey Sanders -- Chief Operating Officer\n\nYeah. I think the answer is yes to all of them, actually. The bigger events that are still coming in, depending on the type of industry, you'll see attendance reach the levels that they were before, especially if they're more domestic they have an international component, maybe not. But we're also seeing a lot of smaller groups and medium-sized groups come in and book also.\n\nSo, the business is definitely dynamic right now from that perspective. We're seeing a lot of demand for that business, where we're seeing a lot of demand for that business in the year -- for the year also.\n\nJohn DeCree -- CBRE -- Analyst\n\nGot it. Thanks, Corey. And, Jonathan, maybe a housekeeping one. In the press release, there was a little over $1 billion amortization charge, I think, related to subconcession in Macau.\n\nI think we've maybe talked about this last quarter, but we've got a couple of questions. Could you remind us on the accounting of that and what's that for?\n\nJon Halkyard -- Chief Financial Officer\n\nYeah. When MGM went to a majority position in MGM China in 2011, we recorded through the purchase accounting an intangible related to the concession. We've been amortizing that intangible to between 2031 and 2038. When the law was released back in June, we, together with our outside auditing firm, Deloitte, we came to the conclusion that it's a new concession that we'll be beginning post December.\n\nSo, the existing concession on which the intangible was based, we needed to amortize that toward the end of its life or by the end of its life, which is this year. So, we took a relatively small amortization charge in the second quarter, and then we're taking the remainder in the third and the fourth quarter. And so, that's what that is.\n\nJohn DeCree -- CBRE -- Analyst\n\nGot it. Understood. Thanks for that clarity. Thanks, everyone.\n\nOperator\n\nOur next question will come from Barry Jonas with Truist Securities. Please go ahead.\n\nBarry Jonas -- Truist Securities -- Analyst\n\nGreat. Thank you. Just a follow-up on the strip margin in the quarter. There was a call out in the 10-Q for higher advertising costs.\n\nAre we now at a more normal level there? Or could that line item fluctuate a little bit going forward?\n\nCorey Sanders -- Chief Operating Officer\n\nYeah. It's higher than '21 because '21, we cut back a little, but it's lower than we were spending in 2019.\n\nBarry Jonas -- Truist Securities -- Analyst\n\nGot it. OK. And then just --\n\nCorey Sanders -- Chief Operating Officer\n\nYes. It's probably a new normal of where we feel pretty comfortable, plus or minus on going forward in the future also.\n\nBarry Jonas -- Truist Securities -- Analyst\n\nOK. That's great. Just as a follow-up, I wanted to ask about some of the partnerships and sponsorships that BetMGM has made. Wondering if you think some of the lower ROI deals could roll off over the next few years and maybe help drive profitability for BetMGM, if possible, maybe walk us through the setup there.\n\nBill Hornbuckle -- Chief Executive Officer and President\n\nSo, Barry, this is Bill. The answer is yes. We go into different markets. We try different things.\n\nSome of them are access deals. You need a partner and a sponsor to help you get state, etc., and get ultimately licensed and in some cases, even get legislation through in terms of motivating the cost from the get-go. Some of them have been very profitable, some of them not as. The team knows exactly the CPA cost per market, and it allocates certain percentages to what those sponsorships may feel like.\n\nBut there's clearly an opportunity going forward. Those deals range anywhere from a single year up to five. It just depends on market and depends on who and what they are. But yes, I think as we get all smarter about this, we all build a customer base that begins to plateau at a reasonable level, you'll see everyone get including us, most notable more efficient at that.\n\nBarry Jonas -- Truist Securities -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nOur next question will come from Stephen Grambling with Morgan Stanley. Please go ahead.\n\nStephen Grambling -- Morgan Stanley -- Analyst\n\nHey, thanks. In the deck, you did mention investing in advanced marketing and physical/digital experiences, I think, associated with the loyalty program. As you ramped up to around, I think you said 44 million members and continue to invest in engagement, how are you thinking about monetization opportunities or partnerships fund reinvestment or even make the loyalty program a profit center?\n\nBill Hornbuckle -- Chief Executive Officer and President\n\nLook, we have several different opportunities, whether it's around our existing partnership with Hyatt and expanding it. We just actually did something with BetMGM with Carnival that we'd like to bring into MGM Rewards over time as well. And so, there are -- we obviously have a deal with Marriott at the Cosmopolitan of Las Vegas. And so, we'll continue to push on that.\n\nAnd obviously, we have something now to trade at 44 million members that are active. There's a real opportunity to go back and forth on that. As we've opened up, remember, the whole essence behind MGM Rewards versus MLive as we've opened up for rewarding all spend, not just gaming spend. And so, it's introduced a different set of customers to us.\n\nIt's introduced a higher-end retail customer. I think that gets expanded by things like F1 and some other things that are coming to town. And so, we've got a whole team structured and focused on doing exactly that. And we'll begin -- we're going to hit our first full year here coming up.\n\nWe'll begin to give you some metrics here going forward about where we've been and where we're at. But some of the initial indicators are pretty very firm of actually. So, the general thinking.\n\nStephen Grambling -- Morgan Stanley -- Analyst\n\nSounds good. That's helpful. Thanks. One other unrelated follow-up.\n\nThe market in Canada on the online side is a bit opaque at this point. I guess, what are you seeing in that market for BetMGM in terms of how it's ramping versus the U.S. and how it might evolve from here?\n\nBill Hornbuckle -- Chief Executive Officer and President\n\nSurprisingly well. And why I say that is obviously, that's been a market that's gray market in Ontario of note for a decade or so and maybe more. And our ability -- they don't actually publish per share. So, we can't have exact things, but I know what we're doing.\n\nWe've done exceptionally well. I think part of it is our Ontario/Detroit database, and we've had exposure to those customers for 20 years. And so, we have taken real share. And if we're not leading, we're damn close in the context of iGaming of note.\n\nAnd we have a real position in place with sports betting, we were fortunate enough to get Wayne Gretzky on board early. And he's just iconic. And so, we feel really good about what's happened there. And surprisingly so, which gives us a great deal of confidence in a highly competitive market before we entered.\n\nStephen Grambling -- Morgan Stanley -- Analyst\n\nThat's a great one. Thank you.\n\nOperator\n\nOur last question will come from Ben Chaiken with Credit Suisse. Please go ahead.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nHey, how's it going? Sorry if I missed it. Just taking another swing at Vegas margins. Revenue and EBITDA improved kind of regardless of how you cut it. With this in mind, if we think about the sequential margin compression in Vegas, 2Q to 3Q, how much of this is a mix dynamic, so adding lower margin revenues as you called out? And how much of this is sequential margin compression on the existing business from headcount, for example, which you also called out? If that didn't make sense.\n\nI can try it differently. Thanks.\n\nJon Halkyard -- Chief Financial Officer\n\nNo, that's all right. This is Jonathan. It is mostly having to do with mix and to a minor extent, some addition of labor. It's almost impossible to overstate how much.\n\nI know your question was around sequential, but year over year and sequential, just the volume of activity has increased here, and that's required some additional labor resources. We've also opened some final outlets that had been closed over the past year or two. So, it's really both of those dynamics, which have caused that.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nGotcha. And then just to squeeze one more in. There seems to be -- I think you've highlighted a few times, but there seems to be a disconnect in your valuation. You've got the lease liability on the balance sheet, and then you've got kind of the EBITDAR multiple discount.\n\nWith this in mind, I guess, just kind of like high level, is the opco structure do you think still the most desirable strategy? Or would you ever consider a pivot from the asset structure, if that's an appropriate way to phrase it?\n\nJon Halkyard -- Chief Financial Officer\n\nI think it is absolutely the right strategy. The valuation considerations aside for a moment, I love this capital structure. It's a perpetual capital structure with escalations of 2% to 3% over the next 10 years. It is one that we do not have to refinance.\n\nAnd when I look at what we've been able to accomplish on our M&A agenda, it's probably not too difficult to tease out that the Cosmopolitan and ARIA did nearly $300 million of EBITDA during the third quarter. And these are businesses that when you look at what we paid to acquire them are sub-six times EBITDA multiples. And at the same time, we've sold the Mirage and the Gold Strike at 17 and 11 times multiples respectively. So, there's clear valuation disconnect going on here.\n\nBut when I look at the capital structure, the combination of it and its cost with what I think is our operating leverage in these other businesses with the demand dynamics we've described and the fact that really our regional cross-property efforts are just getting started to the Cosmopolitan integration is still very early in this whole event backdrop I just think it's a fantastic opportunity for value creation. So, I wouldn't change it.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nThat's very helpful. Thank you.\n\nOperator\n\nLadies and gentlemen, this concludes our question-and-answer session. I would like to turn the conference back over to Bill Hornbuckle for any closing remarks.\n\nBill Hornbuckle -- Chief Executive Officer and President\n\nThank you, operator, and thank you all for your attendance and, obviously, your interest. Just some highlight comments again. But we feel obviously very strong and excited by our business here in Las Vegas. You continue to see the strength in the growth Again, we think there's been a couple of fundamental changes both in the context of the customer mix, the opportunity, and the desire to want to come to a place like Las Vegas and our position with the asset changes of Mirage for Cosmopolitan and some of the other things we do.\n\nWe just really like where we are in Las Vegas. Macau, despite all of its trials and tribulations, in the month of October, did $450 million GGR. So, annualize that and think about that marketplace and its potential long term. We have a great deal of safe in Macau long term.\n\nAnd I think we're really well positioned to get relicensed and are confident that we'll do so by year-end. You heard obviously the success in BetMGM. It's absolutely tracking in the right direction. And we're equally, if not more excited, ultimately for MGM Resorts for LeoVegas, and our push into rest of world with that vehicle leading the way.\n\nI think most relevant is Jonathan's point about our balance sheet. The liquidity is amazing. It gives us two things. If we should go into a more significant downturn Obviously, we've got the resources to sustain and ultimately enough resources to also be opportunistic.\n\nAnd so, the opportunity that balance sheet presents for us, we think, is very compelling and very exciting as we think about the next couple of years. We are keenly focused on margins. I can assure you. We are at a place -- we said they would come back to where they are.\n\nWe want to do more work, and we will continue to do -- they will not go backwards from this point. You have a commitment on that. And I think there's some room for enhancement in a couple of places, Las Vegas, and potentially a couple of regional properties despite the one-off opportunities and things that hit us. The rent is compelling.\n\nThe 2% to 3% versus open -- the cost of what's going on right now in the marketplace. And ultimately, our growth pipeline with New York and Japan around the Horizon -- we love that -- both of those opportunities for obvious reasons. And so, I think we're well positioned in both of those places to take advantage of that as well. And then ultimately, to the colleagues at the table and all of our team, I couldn't be happier with the crew and how it's performing.\n\nSo, thank you all, and appreciate you joining us today. Have a great night.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAndrew Chapman -- Director of Investor Relations\n\nBill Hornbuckle -- Chief Executive Officer and President\n\nJon Halkyard -- Chief Financial Officer\n\nJoe Greff -- JPMorgan Chase and Company -- Analyst\n\nCorey Sanders -- Chief Operating Officer\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nDavid Katz -- Jefferies -- Analyst\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nChad Beynon -- Macquarie Research -- Analyst\n\nHubert Wang -- President and Chief Operating Officer of MGM China\n\nRobin Farley -- UBS -- Analyst\n\nJohn DeCree -- CBRE -- Analyst\n\nBarry Jonas -- Truist Securities -- Analyst\n\nStephen Grambling -- Morgan Stanley -- Analyst\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nMore MGM analysis\n\nAll earnings call transcripts"
}