{
  "companyName": "Bright Health Group, Inc.",
  "companyTicker": "BHG",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/bright-health-group-inc-bhg-q2-2022-earnings-call/",
  "content": "Bright Health Group, Inc. (BHG 10.89%)\nQ2 2022 Earnings Call\nAug 10, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning or good afternoon, and welcome to the Bright Health Group Q2 2022 earnings call. My name is Adam, and I'll be your operator today. [Operator instruction] I will now move to Stephen Hagan to begin. To Stephen, please go ahead when you are ready.\n\nStephen Hagan -- Director, Investor Relations\n\nGood morning, and welcome to Bright Health Group second quarter 2022 earnings conference call. The question-and-answer session will follow Bright Health Group's prepared remarks. As a reminder, this call is being recorded. Leading the call today are Bright Health Group's president, and CEO.\n\nMike Mikan; and CFO, and chief administrative officer, Cathy Smith. Before we begin, we want to remind you that this call may contain forward-looking statements under U.S. federal securities laws. These statements are subject to risks and uncertainties that could cause actual results to differ materially from historical experience or present expectations.\n\nA description of some of the risks and uncertainties can be found in the reports that we filed with the Securities and Exchange Commission, including the risk factors in our current and periodic reports we file with the SEC. Except as required by law, we undertake no obligation to revise or update any forward-looking statements or information. This call also reference non-GAAP amounts and measures. A reconciliation of non-GAAP to GAAP measures is available on the company's second quarter press release, available on the company's Investor Relations page at investors.brighthealthgroup.com.\n\nInformation presented on this call is contained in the earnings release we issued this morning and in our Form 8-K, dated August 10, 2022, which may be accessed from the Investor Relations page of the company's website. Before we start the call, I would like to note the Bright Health Group will be participating in a Morgan Stanley conference on Wednesday, September 14th. With that, I will now turn the conference over to Bright Health Group chief executive officer, Mike Mikan.\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nThank you, Stephen. Good morning, everyone and thank you for joining Bright Health Group second quarter 2022 earnings call. I'll open my remarks with an update on the business, discuss the progress we've made on our strategic action, and then I'll turn the call over to Cathy to give additional details on our second quarter results. We always start with our mission at Bright Health Group, we are focused on making healthcare right together.\n\nOur model is built on the belief that by connecting and aligning the best local resources and healthcare delivery with the financing of care, we can deliver better outcomes at a lower cost for all consumers. In the years since we became a public company, our businesses matured dramatically in scale, diversification, capabilities, and consistency in performance. We have achieved scale across some of the largest markets in the country, specifically in Florida, Texas, North Carolina, and California. We continue to demonstrate diversification across both our commercial and rapidly growing seniors business.\n\nWe have significantly grown our new health business while demonstrating the differentiated performance of our fully aligned care model. And as important as that growth, we have made substantial progress on improving our underlying operating performance, developing our proprietary bio's technology, and driving integration between our great healthcare and new health businesses. These pieces together all drive key points of differentiation for Bright Health Group. In the second quarter, our team continued to deliver solid performance in the underlying business, while making significant progress on our fully aligned care model and our operational improvements.\n\nWe have generated strong growth in our core markets, while effectively managing medical costs across all of our markets. With the improved performance of our business, the cost actions we have taken, and our disciplined pricing strategy for 2023, we are confident in our path to adjusted EBITDA break even in 2024. Furthermore, to support the growth and execution of our business, we've always planned for more capital and we are well underway in satisfying this need. Cathy will provide additional details on our capital position in a moment.\n\nOur solid performance so far this year has led us to reiterate our key 2022 guidance metrics. We are delivering on the focused actions and operational improvements that we previously laid out. Through our medical cost management efforts, we are achieving cost savings in line with our expectations. On track for greater than $300 million in savings relative to our 2022 planned pricing changes.\n\nAdditionally, we are experiencing significantly lower COVID costs so far this year. Overall, utilization across our entire business is lower and has been stable through the second quarter, and we are seeing the benefits of a higher percentage of our member base being retained members from last year. And this has resulted in an enterprise medical costs ratio that's in line with our expectations and better year-over-year on a restated basis. Our risk adjustment performance is meaningfully better this year due to the higher routine number base, more stable special enrollment period, and the operational investments we've made.\n\nIn Florida, for example, our own data corroborated by the initial Weekly National Risk Adjustment Reporting, WNRAR, shows we are achieving a 25% improvement in risk adjustment on a per member basis. Our member engagement efforts are much further along this year. We attributed members faster to our owned and affiliate care providers in our identifying members with complex health conditions who would benefit from care interventions earlier. Importantly, we are doing this not just for members in Medicare Advantage, but also members in our individual and family plans.\n\nOur efforts around identifying higher-risk members supports our patient outreach, allowing us to better direct members to in-network care, as well as helping us accurately capture the risk of the patient population we serve. Our technology development and operational capabilities advanced considerably this year. Our new PRISM, and panoramic claims, and care management platforms respectively are performing well, and we are achieving our target benchmarks for prompt pay, [inaudible] claims, and appropriate denials. While the claims platform in our legacy market continues to require additional manual work, we have made progress on claims processing in these markets, and the median age of claims has continued to come down throughout this year.\n\nOverall, we have significantly more data informing our forecasting, and the predictability of our business is improving. We are also upgrading our provider-facing systems, adding more automated and electronic processes for care providers, which increases provider satisfaction, improves the efficiency of our business, and drives better site of care selection to help lower medical costs. The operational improvements we made in 2022 set us up well as we look out to next year. We expect to continue our 2022 efforts on medical cost management, including implementing new contracts that reflect the scale of our business, driving lower medical costs for consumers.\n\nWe expect further improvement in our engagement with members, and accurately capturing the risk coding of these members across our markets. We also expect to benefit from the markets we entered in 2022 going into their second year, where we will have significantly more data on our members, and we expect to drive a meaningful improvement in the accuracy of risk adjustment. We've driven a strong improvement in the medical cost ratio in both our commercial and Medicare Advantage businesses this year, and expect to continue to improve our performance in 2023. We will also drive further profitability in our direct contracting business in the new [inaudible] program, building on our expected strong first year performance.\n\nWe view the market as being in a disciplined pricing environment into 2023 that supports the positive pricing actions we have taken. These pricing actions take into account our underlying unit cost structure and our objective to move our business closer to our targeted long-term margins. Overall, we do not expect these pricing actions to meaningfully alter our competitive positioning and are positive on the potential benefit of the APT subsidies extension in the Inflation Reduction Act as passed in the Senate last Sunday. We will also continue to advance our fully aligned care model and drive medical cost benefits from the combined strength of our Bright HealthCare and new health businesses.\n\nThe net result for pricing next year across both commercial and Medicare Advantage, combined with our medical cost efforts, are expected to drive a significant improvement in gross margin, and allow us to move meaningfully closer to profitability in 2023. Which gives us further conviction in our target of break-even adjusted EBITDA in 2024. I'll now hand it over to Cathy Smith, our CFO, and chief administrative officer, to go over our second quarter performance, and provide some additional updates on the business.\n\nCathy Smith -- Chief Administrative and Financial Officer\n\nThank you, Mike, and good morning, everyone. I'll start with a review of our second quarter and year-to-date results, provide a balance sheet update and then go over our 2022 outlook. Our second quarter top-line results reflect solid year-over-year member growth and member attrition in line with expectations. From the first quarter.\n\nWe ended the quarter with over 970,000 commercial consumers and 120,000 Medicare Advantage consumers, as well as approximately 500,000 NeueHealth Value-Based lives. Bright Health Group consolidated revenue increased 42% year-over-year to $1.6 billion in Q2. Bright Healthcare segment revenue grew 34% year-over-year to $1.4 billion, and NeueHealth segment revenue of $422 million compares to 114 million in the prior year. Consolidated and segment revenues were negatively impacted by $93 million due to final settlement of the 2021 risk adjustment payable across our marketplace states.\n\nAs well as impacts from an increased forecast for 2022 risk adjustment payable, and our revised direct contracting forecast based on a reduction in the CMMI trend benchmarks for direct contracting. Our 2021 Marketplace Risk Adjustment coding was in line with our expectations, but the final market benchmarks for our states were on average higher than expected and resulted in a higher risk adjustment payable. It is important to note with this healthier population in both 2021 and 2022, we are seeing lower medical expenses, offsetting the risk adjustment estimate changes. Our second quarter adjusted EBITDA was a loss of $195 million, which excludes mark-to-market investment gains and losses on equity securities we hold, a $16.2 million loss in the quarter.\n\nAdjusted EBITDA was negatively impacted by the 2021 risk investment settlement, which was partially offset by favorable 2021 medical expense reserve development in the quarter of $38 million and $53 million year-to-date. Additionally, the healthier population we are seeing in 2022 in certain markets results in lower medical cost offset by higher risk adjustment, but approximately neutral to both gross margin and adjusted EBITDA. Adjusted EBITDA was also negatively impacted by an in-year $37 million net increase in our premium deficiency reserve recognized in operating expenses. This in-year PDR, primarily reflects the accounting treatment for our new markets, as we have more claims data and actuarial experience to support our forecast.\n\nTo be clear, the PDR increase does not reflect a change in our expectation for 2022 performance, but rather is an acceleration of the estimated full year losses into the second quarter. Our second quarter 2022 GAAP medical cost ratio at the enterprise level was 88.8%, up from 86.8% in the second quarter of 2021. The net impact to our second quarter MCR from the final 2021 risk adjustment payable true-up, and the partial offset from medical expense reserve development added 270 basis points to our enterprise MCR in Q2. The change in revenue associated with the revised DCE Benchmark was offset by a revision to our forecast for DCE medical expenses, and the net impact to our year-to-date enterprise MCR was minor.\n\nThe increase in MCR from the first quarter to the second, when looking at adjusted MCR for each quarter, reflects a few factors. Typical seasonality has never start to utilize their health benefits more, members progressing through their deductibles, and an increase in utilization in new markets, with members becoming acquainted with their benefits and provider networks. Our year-to-date medical cost ratios 86.6% reflects strong performance in our medical cost management initiatives, and improved operational performance, as well as the success of our fully aligned care model. I'll note again this quarter that in looking at the comparison to the prior year, recall that in the first half of 2021, we had limited visibility to the future impacts from COVID or SEP, and were behind in claims processing.\n\nTherefore, looking at the first half of last year, if restated for medical costs and risk adjustment that subsequently transpired, we would have experienced a much higher MCR. I would also remind you that in looking at a comparison to 2021, our 2022 MCR is impacted by DCE revenue booked at 98% MC.  Without DCE, second quarter enterprise MCR would be 90 basis points lower, and the year-to-date MCR would be 110 basis points lower. With respect to COVID, second quarter COVID costs declined meaningfully compared to the first quarter, due to COVID costs of $20 million were down nearly two-thirds from Q1, adding approximately 130 basis points to second quarter MCR, but down from the 320 basis points impact in the second quarter of 2021. The $78 million year-to-date COVID costs are approximately in-line with our expectations and create a favorable impact given the pricing adjustments we made pre-COVID in 2022.\n\nWhile reported results reflect the impact of the 2021 risk adjustment payable true-up, and the net PDR increase driven by our newer IFP markets. Our second quarter operational results were in line with our expectations, and reflect solid progress on our operational and medical cost efforts. The commercial MCR in the second quarter was 89% and was negatively impacted by 430 basis points due to the 2021 risk adjustment true-up I noted earlier. Adjusting for this impact, the commercial MCR in the quarter would have been 84.7%.\n\nThe year-to-date commercial MCR of just under 83% reflects the strong performance in risk adjustment and medical cost management. The second quarter, Medicare Advantage MCR was 90.3%, and year-to-date MCR was 93.5%, demonstrating the substantial work the team has done in improving the overall profitability of the business while continuing to build a differentiated Medicare franchise. Both our commercial, and Medicare Advantage businesses are performing as expected year-to-date. As we detailed last quarter, our forecasts for this year reflect our learnings from last year, including a prudent approach to our risk adjustment payable expectations, and our medical cost forecast.\n\nOur operational improvements, and our increasing claims processing efficiency result in significantly greater visibility this year. And we are confident in our MCR forecast for the year. Turning to NeueHealth, the business continues to perform well in managing fully capitated members. Total value-based care patients as of the end of Q2 were approximately 500,000, including approximately 400,000 from Bright HealthCare, 47,000 from direct contracting, and the remainder from value-based external payer relationships.\n\nSecond quarter revenue for NeueHealth with $422 million, with a sequential decline reflecting revised risk adjustment estimates for 2021 and 2022 that flowed through to the capitated NeueHealth lives, as well as direct contracting member attrition in line with expectations and a reduction in the year-to-date direct contracting benchmark recognized in Q2. The NeueHealth second quarter revenue was additionally negatively impacted by $16 million due to an unrealized mark-to-market investment loss. The impacts to revenue are largely offset by real-life medical expense performance below our prior forecast and lower book DCE expenses on the benchmark reduction and attrition. The net result was a solid NeueHealth medical cost ratio performance in the quarter at 92.2%, despite the lower than expected revenue.\n\nWe continue to expect approximately breakeven gross profit from direct contracting for the full year. The main takeaway on NeueHealth due to performance is that with the improved PHC commercial performance, NeueHealth is beginning to contribute to improved enterprise performance. NeueHealth as diversification, as well as eventually enhanced margin potential while providing better, more affordable care. Turning to our balance sheet.\n\nAs of June 30th, 2022, we had over $138 million in non-regulated liquidity, including $74 million in highly liquid cash and equivalents, and $64 million in a passive equity investment classified as short-term. We had about $3 billion of additional cash and short or long-term investments held by our regulated insurance subsidiaries. On our $350 million credit facility, we had $300 million available at the end of Q2. Subsequent to the quarter, we have drawn $154 million on the credit facility while we pursue a more permanent solution to our capital needs.\n\nAs Mike said, we are actively working to satisfy our capital needs, which will require additional financing in the next year. We have formed a special committee of the board, and are working with outside advisors to raise sufficient capital to reach profitability and self-sustaining cash flow. We have received significant interest from, and are in advanced discussions with third parties and current investors to finalize the capital raise. Apart from our financing efforts, we have improved our financial performance and taken actions to reduce our incremental capital needs by exiting several markets in 2023, as well as taking strong pricing actions for 2023.\n\nOur business is now in a much more capital-efficient stage, and we continue to focus on balanced growth while driving improvements in profitability to reduce the amount of capital needed. In our earnings release this morning, we reaffirmed the Bright Health Group full year 2022 outlook while making modest adjustments to our NeueHealth segment forecast. Specifically, we have maintained our expectation for enterprise revenue to be in the range of $6.8 to $7.1 billion. But I would note that due to the prior year, risk adjustment payable change recognized in Q2, a slightly more conservative view on 2022 risk adjustment, and a lower DCE benchmark, we now expect to be in the lower half of the range.\n\nGiven the moving pieces between the first and second quarter, I would point to the average quarterly revenue over the first half as the run rate and then factor in normal marketplace and DCE attrition rate, partially offset by in-year Medicare Advantage member additions. We continue to expect our enterprise medical cost ratio to be in the range of 90% to 94%, and full year 2022 adjusted EBITDA to be in the range of a loss of $500 to $800 million, which consistent with prior guidance excludes any impact from mark to market investment gains and losses. We expect an operating cost ratio of approximately 22%. We continue to watch our operating expenses closely, and are focused on efforts to control external vendor expenses.\n\nOn a segment basis, we are maintaining our end-of-year Bright Healthcare member forecast for approximately 1 million members. Full year 2022, NeueHealth revenue is expected to be approximately $2.2 billion, taking into account the changes to our risk assessment forecasts and the DCE benchmark. We have also lowered our expected intercompany revenue elimination estimate to approximately $1.2 billion, the lower end of our previous forecast. We expect NeueHealth Value-Based care patients to average between 450,000 and 500,000 during the year.\n\nWe continue to expect approximately 40% of new health revenue generated from external sources. This includes the revenue contribution from direct contracting of greater than $600 million. Our performance through the second quarter has been strong, and we have made significant progress on managing medical expenses and on our operational initiatives. Supporting our view that the midpoint of our MCR and adjusted EBITDA guidance ranges are the appropriate targets for the year.\n\nWhile the first half performance has been strong and we are optimistic for the full year, we are maintaining our guidance ranges to reflect a prudent view on the second half. As Mike discussed, our operational actions in 2022 and operating for 2023 sets us up well for a meaningful improvement in profitability in 2023. Let me double-click into 2023 a little more. We have taken pricing action on our 2023 products in excess of expected medical cost trends, inclusive of medical cost management initiatives.\n\nTo advance toward our long-term margins, we expect these actions to yield a gross margin improvement of approximately $400 to $500 million across our commercial Medicare Advantage and NeueHealth businesses. This gives us confidence we will be well on our way in 2023 to our breakeven adjusted EBITDA target for 2024. Before I turn the call back to Mike, I appreciate our amazing Bright Health teams across the country. Working together, we are changing healthcare.\n\nAdditionally, I want to thank our shareholders, for their continued support as we build a fully aligned, integrated system of care for the consumer retail market. Now. Here's Mike for some final comments.\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nThank you, Cathy. We have made substantial progress across our business this year and continue to focus on delivering on our enterprise priorities for the year. We are seeing the benefits of these efforts in our year-to-date results, and expect to continue our efforts on medical cost management, member engagement, and improving our operational performance. As we look forward to 2023, our successful execution this year against our targeted actions sets us up incredibly well.\n\nWe will also see key benefits in 2023 as our markets mature, with our 2022 new states moving to a year or two, and an additional year of experience, and member relationships in our other markets. In developing our pricing for 2023, we have significantly more experience in each of our markets, more data on our ability to manage medical expenses, and the trade-offs associated with risk adjustment payables. We expect pricing will be a key lever, as we look to improve our margins next year while taking into account medical cost trends and expected changes in market pricing. Additionally, we're excited to have Michael Carson, and Jeff Cook on board now, to lead Bright HealthCare and NeueHealth, and to work with me and the rest of the management team to drive further clinical and financial alignment between the businesses, as we continue to improve our fully aligned care model.\n\nWith that, I'd like to thank our team, and our care partners. Michael Carson, Jamie Toshack, and Jeff Cook are also on with Cathy and me for the questions. Operator. Let's take the first question.\n\nOperator\n\n[Operator instructions] Our first question today comes from Lisa Gill from J.P. Morgan. Lisa. Please go ahead.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nThanks very much, and thank you for all the detail. Cathy, I just want to go back to your comment around Opex and talking about getting it to 22%. As I look at this quarter, I know you talked about the reductions in revenue, but is there anything specific or one time that you would call out on the Opex side as we think about this quarter?\n\nCathy Smith -- Chief Administrative and Financial Officer\n\nGood morning, Lisa. Thank you. So year-to-date, we're at 24% or so in the quarter 26, I would call out that PDR that we know to be in-year PDR for $37 million that are due 30 basis points to the quarter. So remember, that will reverse out over the next two quarters.\n\nSo I would pull that out, and then we're solidly on track for a 22% for the year.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. And then just as a follow-up, Mike, you talked about pricing for 2023, really helping to drive the margin. But just curious as to your thoughts around membership with the new pricing, and how you're thinking about both sides of the business, especially as we think about Medicare Advantage beds, we think about the IFP market.\n\nAny incremental insight into how you're thinking about membership going into next year? Thanks.\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nYeah. Thanks, Lisa. I don't want to get too far ahead in our 23 expectations in terms of enrollment. Obviously, there's a lot of information that is yet to come out in terms of how the market is positioned.\n\nBut we feel we're positioned well. We believe, overall, we're in a disciplined pricing environment with rate, so we took prudent actions, and we think we're well-positioned in the majority of our markets next year. So we'll come up more with enrollment projections as we get closer to AP or OAP. But at this point, I think we'll stay with our prepared remarks that we believe our positioning is well overall.\n\nThanks.\n\nOperator\n\nThe next question comes from Steven Valiquette from Barclays. Steven, your line is open.\n\nSteven Valiquette -- Barclays -- Analyst\n\nYeah. Thanks. Good morning, everybody. The main question I wanted to ask was around some of that membership growth outlook for next year.\n\nI mean, we've seen some other publicly traded companies, take pricing actions in the exchange business to improve profitability, whether there's some pretty wild swings in their membership, some folks down  60% plus year-over-year, but still growing profits, and investors seem to be comfortable with that, and actually could be if you view that more favorably. So I guess, I know it's early, but I'm wondering just from your planning and your corporate strategy right now, are you anticipating or bracing that your membership could be down next year? Or are you anticipating that there still will be growth? To just directionally growth or decline might just help us just for like a large framework, just as how you're thinking about it internally the way it stands right now based on your pricing action. Thanks.\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nSteven, I'll try to answer it again without getting too far into expectations on 2023, as it's pretty early here as we said in August. But, if you exclude the active markets, which we've disclosed just roughly 7.5% of our overall revenue. So relatively small, if you exclude that next year, we expect growth on a top-line basis. We continue to expect growth, while it will be more balanced growth than we've seen up to this point, we're still anticipating growth.\n\nNow, candidly, a fair amount of that is going to come through from yield, which is anticipated. But we're still looking forward to market growth then in several markets. So we like how we're positioned, overall, and then I would also note that part of our business model is a balance model between our financing business, Bright HealthCare, and NeueHealth, and we expect continued growth in NeueHealth, which is partially offset any in-market. Degradation that we would have on Bright HealthCare where we'd have relationship with external third parties.\n\nOn top of that, other opportunities like growth with the [inaudible] reach program that we've talked about. So, we're well-positioned for continued growth, although I would note it's more moderate growth from obviously, what we've seen over the last three years, which has been robust growth. Thanks.\n\nSteven Valiquette -- Barclays -- Analyst\n\nThanks.\n\nOperator\n\nThe next question is from Nathan Rich from Goldman Sachs. Nathan, please go ahead.\n\nNathan Rich -- Goldman Sachs -- Analyst\n\nHi. Good morning. Thanks for the questions. I'll ask both up front, I guess.\n\nFirst on the risk adjustment improvement in Mike, you called out the 20% to 25% in Florida, in North Carolina. How did that, it sounds like that compared favorably maybe relative to where your expectations were. But how much more room is there for improvement? And how do you kind of more accurately capture the risk for first year members going forward? And then, Cathy, if I could just ask a follow-up on the financing needs that you had alluded to. Can you give any more details on what you think that looks like, and what the timing of that might be? Thank you.\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nGreat. Thanks, Nathan. So with risk adjustment performance, we went obviously last year was very challenging for us, and principally in Florida, where we grew significantly coupled with extraneous variable COVID, the special enrollment period that had a fair amount of switching of lives throughout the year. And then what we talked about when Cathy talked about in the prepared remarks was we were behind significantly on claims processing, as a result of that significant growth coming into the year, and having to catch up with loading contracts and the like.\n\nAnd so the comparison last year is obviously difficult. But with that said, we've made the operational improvements engaged earlier with our patients, attribute them to our care provider partners, our care centers, and our affiliates earlier in the year. And then we've got good, clean data, and clinical data to go after those patients that really need clinical interventions earlier. So we're engaging earlier.\n\nAnd that helps us with the second part of your question in terms of accuracy, with first year capture with the consumer. The sooner we can get to know them and engage with our consumer base that we're serving, the better off we're going to be. And then as the years go on, as a result of just having a greater routine membership, if you exclude our first year markets last year, our retention was 80% or so. Some of our markets were approaching 90%.\n\nThe higher retention we have, obviously, the better performance we're going to be in terms of risk, cold capture, and accuracy given the risks that we take. So over time, we expect that reduction. I'm not sure I would characterize that Florida, and North Carolina is better than our expectation. I think we believe we could do 20% to 25% improvement.\n\nI think we talked about that earlier. We've done what we said we would do. So we're very pleased with the early results, and believe they'll continue throughout the year and future periods. Maybe I'll just take the financing question as well.\n\nWith respect to our financing, we've always talked about, Nathan, that we're going to need additional financing to get to break even. We've taken significant actions over the last 12 months or more to improve our operating performance and our cash burn. I'd also note that part of the process of building an enterprise in the insured risk business is you've got to capitalize your legal entities, your statutory entities. And for the most part, when we get through 2022, we've capitalized our statutory entities.\n\nSo our cash requirements going forward in terms of building the growth engine in these big states, where we're an insured entity is going to decline significantly. So our outlook on cash has improved and is favorable. And we always knew we would need additional capital, we're just underway with talking with our existing investors who we still have strong support from, and the new investors to raise the additional capital to meet our needs to get to adjusted break even in 2024. And given the actions we've taken, we've got a lot of confidence in achieving that.\n\nThanks, Nathan.\n\nOperator\n\nThe next question comes from Joshua Raskin from Nephron Research. Joshua, please go ahead.\n\nJosh Raskin\n\nHi. Thanks. Good morning. I've got a question, and then a follow-up as well.\n\nI guess the first question would be just then I'd be interested to hear about the progress at NeueHealth on two fronts. So first, if you could speak to your ability to attract new physicians to your platform, and how you're approaching that, the growth of the platform. And then second, how is the Bright HealthCare membership that's being cared for under new health performing relative to the remainder of your membership that's being cared for outside of NeueHealth --\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nNow, Josh, you know, that's two questions, right?\n\nJosh Raskin\n\nUnderstand that.\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nSo, yeah, that's right. I've known you a long time. So with respect to attracting positions, yes, we continue to attract physicians and other care providers, ancillary providers into our own care centers. We're in competitive marketplaces for the most part.\n\nObviously, there are some pockets where we've seen some challenges, but we've seen a very stable workforce within our physician groups, we're very proud of. And I do think our model we're value-based care, and really focus on quality, and the relationship with the consumer, and consumer satisfaction, and all the tools, the technology that we enable our physicians is a differentiator for us. So we've been able to do that and attract new physicians as we go along, and we've been growing. So we're pleased with that.\n\nWith respect to Bright HealthCare lives being managed within NeueHealth, we looked at it as NeueHealth manages a population both with our own care centers, and then what we call our affiliate care partners, which are partners that we share in the risk and the population. Overall, we continue to see the population compared to the non-managed risk population, better within our peer centers, and our affiliates by about somewhere around 10%, maybe north on an underlying cost perspective. So in other words, lower costs within our care centers and in our affiliates, overall compared to the market 10% north. So we're pleased with that.\n\nWe believe over time we can favor, we can do better than the market by 10% to 20%. That's what we've targeted, and we're probably on the lower end of that now, but we believe we can improve upon that over time.\n\nOperator\n\nThe next question comes from Jeff Garro from Piper Sandler. Josh [inaudible]\n\nJosh Raskin\n\nI'm sorry. I'll follow-up real quick. So the 400 to 500 gross margin improvement that Cathy mentioned. How should we think about, I heard enterprise top line up, excluding the 7.5% have been from exits.\n\nBut I'm just trying to figure out the G&A dollars. Does that mean we're going to see G&A dollars up except for the exits type of thing? Or should we expect total G&A dollars to actually be down next year?\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nAgain, we don't want to get, I recognize we're going to get into modeling, but we don't expect to be as G&A to be up next year. We'll come out with more specifics later, Josh, but we're expecting the productivity improvements. We've talked about this in the past, as we built the organization, we built with a lot of blended relationships which we are now bringing in-house. We're achieving the productivity on those.\n\nOne of the biggest implementations that will create significant productivity gains as we move off our legacy bended claims system, which is about 70% of our ACA business today, and we move on to our more permanent prism system, which we get the productivity out of. And we'll have significantly higher auto adjudication rates today. On our prism system, we're at about 75% auto adjudication. That's coming off our legacy system where we have no auto adjudication.\n\nSo we have significant opportunities to improve our underlying cost structure, and that's a key contributor to ultimately getting below 15% in 2024 to get to adjusted break even. So that's the way I would answer the question, Josh.\n\nCathy Smith -- Chief Administrative and Financial Officer\n\nYeah. Maybe I'll add on Josh, just where Mike was just finishing up, which is we're guiding 22% this year. Mike just said by 2024, we need to be at 50% or better. So it's pretty easy to figure out what next year needs to be.\n\nAnd that's those are all the teams we're putting in place right now.\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nThanks, Josh. Jeff?\n\nJeff Garro -- Piper Sandler -- Analyst\n\nYeah. Good morning, and thanks for taking the questions. And I start off asking about the second half MCR guidance, and maybe a little bit more color on how we should think about balancing the typical seasonal headwind, your medical cost management improvements, and maybe some of the more one-time factors seen in the first half of the year normalizing.\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nYeah. So, we reiterated our guidance of 90% to 94%. And so given obviously, we're at 86.6% mid-year, we've got some one-time items. We would assume a higher medical loss ratio on the second half of the year.\n\nWe're cautiously optimistic, as we look to the remainder of the year that we're going to continue to see very stable utilization, subject to seasonality that we'll see in the remaining part of the year. Last year, COVID hit starting in the summer for us, especially in the southeast, and then was pretty rampant through the remainder of the year. So that's a big unknown. So I think kind of what Cathy said, we believe in the midpoint of our range and we're cautiously optimistic.\n\nAnd you can probably interpolate to get to what the second half MCR could be to get you to that point.\n\nJeff Garro -- Piper Sandler -- Analyst\n\nGreat, very helpful. And follow-up for me to maybe looking ahead a little bit, your comments on pricing and renegotiations with some of your network providers. I wanted to ask there, is the renegotiating the contracts that are up for renewal. Is it finding new partners? And how do you balance the repositioning for scale with those providers versus them seeking to adjust rates for inflationary effects?\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nYeah. Maybe I'll start, Jeff, if you want to add anything, if I miss. But we view what we call our integrated system of care is a aligned model with a set of care resources where we're all in partnership to improve the consumer experience, improve the health outcomes, the quality of care, and ultimately drive lower costs. And so since we're all in it together, we look at kind of the contract negotiations as is really a go to market together approach.\n\nAnd so it's really a partnership overall. And we don't just think of it as unit cost in it by itself. We also think about it as the levers of having a partnership together, how we can improve that experience. And one of the key points of our model or differentiation is the high referral we have into the network.\n\nAnd that drives significant volume to the partners that where we want our members to be at [inaudible] to care. And so as a result of that, and just the sheer volume that we have in some markets with 25% market share more in the commercial marketplace, in some markets, significant Medicare Advantage in the marketplace, combined with our affiliate relationships from other payers, we've got strong relationships with our care partners, and we believe net net we're going to continue to drive our underlying unit cost down. So that's the way we approach it. Jeff, do you have anything else? Okay.\n\nSo that's the way we think about it, Jeff.\n\nOperator\n\nThe next question comes from Michael Hall from Morgan Stanley. Michael, please go ahead.\n\nMichael Hall -- Morgan Stanley -- Analyst\n\nThanks, guys. Appreciate all the findings and related commentary. Just in terms of other potential cash levers, I think in the past you may have mentioned reinsurance, helping to reduce statutory companies might be more on that. My question is, how many of your markets you actually have reinsurance in place and how much of a lever could that be?\n\nCathy Smith -- Chief Administrative and Financial Officer\n\nGood morning, Michael. Looking forward to the coverage with us. With regards to reassurance in the markets, we currently have closure-type arrangements in a couple of our markets, we're currently pursuing another, actually, we haven't been in three or more of our markets right now, and we're pursuing another is a great way to leverage someone else's balance sheet. Well, I would also point to the other cash levers we've talked about.\n\nWe're continuing to work on our operating costs, as we've talked about before. And then those exit markets will be able to eventually think about some capital there as well. So we've got a few other levers continuing to work.\n\nMichael Hall -- Morgan Stanley -- Analyst\n\nThanks, Cathy. Really appreciate it. One more quick follow-up. I know items have impacted revenues this quarter, but I'm also noticing membership is a bit [inaudible] seemingly a little bit higher and unchanged.\n\nIt didn't seem like there in your member additions quarter-to-quarter, and you have looks like there's a bit of attrition. Wondering if you could comment on those components. Thanks.\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nYeah. I think,  I'm not exactly sure what the [inaudible] estimates were. I mean, it's pretty typical attrition in the second quarter as we drew up those who have made premium payments for their portion and what have you are effectuate. And so it's pretty much in line with what we expected.\n\nAnd if you just look at where we were starting from, and our end-year estimate of a million of total lines, we're well within that kind of estimate. So we imagine that would flow through, by the way, Bright HealthCare, given the large portion of their business, being NeueHealth having with Bright HealthCare, obviously, they're going to degrade or decline with them. So we didn't see anything out of the normal there and it was pretty much in line with our expectation. Thanks, Michael.\n\nOperator\n\nThe next question comes from Jason Cassorla from Citi. Jason, please go ahead.\n\nJason Cassorla -- Citi -- Analyst\n\nGreat. Thanks for taking my questions. I was just hoping you could give us an update on how trends have developed for the 20 or so NeueHealth clinics in Texas specifically. I know it's early after entering into Texas's IFP market this year, but perhaps if you could also detail how performance in Texas so far is helping to inform you of your future NeueHealth clinic buildout or any other considerations at this time.\n\nThat would be helpful.\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nYeah. Thanks, Jason. It's early, of course, and but overall, we're pleased with the performance of the clinics that we built out. It's a core part of our strategy to enter new markets as we build out the fully aligned integrated systems of care, it includes care centers where it makes sense, especially in highly competitive, highly dense markets where we can build access points for an underserved community.\n\nSo we're really pleased with the results so far. But overall in Texas, part of the reason why risk adjustment was impacted in 2022 and our outlook is utilization is lower, well below our initial estimates, and just a slightly healthier population. So but overall, where we're managing the population with our care clinics, we're seeing similar trends, albeit early as we did in Florida. And that's a strong indication of the future performance of our model.\n\nSo we're excited about it.\n\nJason Cassorla -- Citi -- Analyst\n\nGot it. OK, Thanks. And then just quickly a follow-up here. I was just hoping you could give us an update on your relationship with Cigna that our discussions there have progressed perhaps around Cigna evernorth capabilities , and the NeueHealth or otherwise.\n\nThanks.\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nWell, as we said before, we're really pleased with our relationship with Cigna as a capital partner and a strategic partner where it makes sense, and we continue to look for ways to work together. But I don't have anything to add beyond what we discussed previously. It's a good partnership, and I think it benefits both of our organizations, obviously, much more to us, just given our size. But we're pleased overall with the relationship.\n\nOperator\n\nThis question comes from Justin Lake from Wolfe Research. Justin, your line is now open.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nThanks. Good morning. Just a couple of quick follow-ups. One, you got to ask about our capital.\n\nIs there a, I know you don't want to box yourself in, but is there at least kind of a minimum number that you're looking that you kind of have investors think about you would want to raise next year?\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nJustin, I don't want to get into specifics on the capital raise. We've said we're pleased with the interest level and the work that's underway. This has been normal course for us. This wasn't an immediate type action as we've been planning capital since we built the business from day one.\n\nAnd so this is very part of our normal routine course and we just consider it that. So, I guess as to not get into specifics, but we're well underway.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nOK. And anything on timing there when you expect to announce that for the next year.\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nYeah. I mean, we're obviously, as we said, it's underway. I don't want to get into a specific date, but we are in the call it near to intermediate term. We do expect to conclude our financing efforts.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nOK. Great. And then just a follow-up. You gave us a couple of useful pieces for 2023 on the way to break even, I think you said $400 to $500 million in gross margin improvement.\n\nI think you said operating costs flat to down at a dollars basis for next year. So obviously, what would take $400 to$500 million, maybe more of operating profit going to EBITDA, any other moving parts you want us to consider there? Or is that a reasonable kind of trajectory to that in 23 to break even in 24?\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nI think those are reasonable assumptions. I think when you go back Justin to 21 and what we said we would do in 22, and you just build to where we kind of set the range for 22. We've executed on what we said we would do, $300 million of incremental medical cost initiatives, improved risk adjustment in Florida and North Carolina, another $150 to $200 million of improvement. And obviously, COVID, we didn't price in for 21, but we did price in for 22 at $125 million, and we're seeing lower COVID costs.\n\nSo we believe we've executed on our plan, which is really around fixing a lot of the challenges we had in 21, but also moving toward the way we believe we can manage a million live book of business or more for 22. In 23, we're going to continue those enterprise initiatives, continue to refine and improve building on our scale, our deep local relationships, higher retention. But we also believe we're in a disciplined pricing market, that it's not just us that the market competitive disciplined pricing market. And when you take those together that's how we believe we're going to be moving more closer to our targeted margins at an individual product line or business line, and ultimately enterprise profitability or break even in 2024.\n\nSo those are reasonable assumptions. Justin.\n\nOperator\n\nThe next question comes from Kevin Fischbeck from Bank of America. Kevin, please go ahead.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nOK. Great. Thanks. Why don't you get a little more color on the $400 to $500 million improvement that you're looking for next year? I think you mentioned pricing above trend, but that trend number includes cost savings that you're trying to effectuate.\n\nSo maybe help us break down maybe into two parts. How much of it is kind of pricing above core trend, and how much of it is actually you going out there and getting the medical price management savings? Thanks.\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nYeah. Thanks, Kevin. We'll get more in specific into this as we get closer to the year and put out full year guidance for next year. That's a little more detailed than we're prepared to offer.\n\nIt's safe to say that the initiatives that we put in place for this year, some of those initiatives they roll over into next year and have favorable impact in next year that weren't impacted in time this year. And then we've got obviously more initiatives that we put in place that we believe will effectuate next year incrementally to this year. And our focus on medical cost initiatives is becoming a real strength of ours. And with our integrated model, we believe we can only improve upon that.\n\nSo we'll get more into that. But we believe we feel confident that the pricing will be above and beyond our underlying medical trend and then include additional upside as a result, the medical cost initiatives which yield the $400 to $500 million of incremental gross margin next year. And just incidentally, that includes both improvement in IFP as well as Medicare Advantage. We continue to see significant improvement in our Medicare Advantage book of business.\n\nAs you know, Medicare Advantage for the second quarter had a 90.5% MLR. We continue to bring that down year-over-year and improve our path to profitability. So both of our major lines in the Bright HealthCare business, we're seeing improvement and it's a direct relation to a lot of the initiatives we put in place starting last year that we've talked about previously.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nOk. And then I guess you're MLR guidance, I appreciate that you're focused on the midpoint of that, but it is  given that we're halfway through an extremely wide range and you guys have spent a lot of time talking about improved visibility, and claims, and systems, and data. So why is it prudent to keep such a wide range and not narrow it a little bit if in fact, you feel like you've got that confidence and improve visibility?\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nYeah. I appreciate the question, Kevin. And we're coming off obviously a very challenging year-end 21. And while we really have strong confidence in the improvements that we've made, given the potential for COVID, and other things.\n\nWe just want to make sure that we're well, we're optimistic. We want to stay prudent in our estimates. And so that's the best way I can answer that question.\n\nOperator\n\nOur final question today comes from Ben Hendrix from RBC Capital Markets. Ben, please go ahead.\n\nBen Hendrix -- RBC Capital Markets -- Analyst\n\nHi. Thank you, everyone. I think you've touched on this a little bit, but can you go into more detail about the investments and progress you've made with the Legacy Claim Management platform? Where are we from a timing perspective in the transition process to getting the whole enterprise to an electronic submission and audit adjudication? Thanks.\n\nCathy Smith -- Chief Administrative and Financial Officer\n\nHey. Good morning, Ben. So, as we've shared with you before, we're really well underway. We're excited about the progress the team has made across the company.\n\nWe've moved all of our new markets, remember this year and onto our present platform to our new claims platform in all of 2022 that's executing really well. Mike shares, we're seeing a really great first pass yield or first quarter adjudication on that platform. We're really pleased with its performance, and so that's the all new markets, it's bout 30% of our business. All remaining IFP markets or commercial markets will move on that same platform on one 23.\n\nSo we're preparing right now to move the rest of the book from the commercial book. And then we're debating what the right answer is for MA as we move forward. So that those will move on the remainder of this year. This year, though, the other 70% is on the legacy platform from previous.\n\nWe've done a ton of work to improve its ability to process highly inaccurate claims. And our inside and visibility into the performance has been tremendously different from last year. So we're managing that with all of our team and the vendors team, and feel really good about its performance this year. But we're excited to move into our next environment.\n\nAs we think about reducing our operating expenses, we have to move from multiple claims platforms to one for moving all of our clinical programs or clinical efforts on to Panorama, which Mike shared. So very, very excited about what that does for our members and our providers, but also for our cost structure.\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nAnd we're focused not just the core claim platform that were bended out. We're really focused on building out tools that will be part of the present bias environment going forward. So as we mentioned, provider-facing tools, authorizations, we rolled out an online tool, significant increase in online authorization. So we're reducing manual workarounds and interventions, and moving to more online streamlined capabilities, which is a big [inaudible] of the expected productivity going forward.\n\nAll of that together, we're really excited about where we're at, noting that we still for 2022 remain on a legacy system that has been inefficient, and we're working our way. We have much better knowledge, and the work that we done is favorable, as Cathy said, we're more excited about where we're going, and that's our new system starting 2023, addition in 2023. Thanks, Ben.\n\nOperator\n\nSince we don't have other question, this will conclude our Q&A session. I'll hand it back to the management team for their closing remarks.\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nGreat. We appreciate your interest in the company, and we look forward to future updates next quarter.\n\nDuration: 0 minutes\n\nStephen Hagan -- Director, Investor Relations\n\nMike Mikan -- Vice Chairman, President, and Chief Executive Officer\n\nCathy Smith -- Chief Administrative and Financial Officer\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nSteven Valiquette -- Barclays -- Analyst\n\nNathan Rich -- Goldman Sachs -- Analyst\n\nJosh Raskin\n\nJeff Garro -- Piper Sandler -- Analyst\n\nMichael Hall -- Morgan Stanley -- Analyst\n\nJason Cassorla -- Citi -- Analyst\n\nJustin Lake -- Wolfe Research -- Analyst\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nBen Hendrix -- RBC Capital Markets -- Analyst\n\nMore BHG analysis\n\nAll earnings call transcripts"
}