{
  "companyName": "ProFrac Holding Corp.",
  "companyTicker": "PFHC",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/profrac-holding-corp-pfhc-q2-2022-earnings-call-tr/",
  "content": "ProFrac Holding Corp. (PFHC 2.15%)\nQ2 2022 Earnings Call\nAug 12, 2022, 11:00 a.m. ET\n\nOperator\n\nWelcome to the ProFrac Holding Corp. second-quarter earnings conference call. [Operator instructions] As a reminder, this conference is being recorded. It is now my pleasure to introduce your host, Mr.\n\nRick Black. Thank you. You may begin.\n\nRick Black -- Director of Investor Relations\n\nThank you, operator, and good morning, everyone. We appreciate you joining us for ProFrac Holding Corp.'s conference call and webcast to review second quarter 2022 results. With me today are Matt Wilks, executive chairman; Ladd Wilks, chief executive officer; Lance Turner, chief financial officer; and Coy Randle, chief operating officer. Following my remarks, management will provide a high-level commentary on the company, the financial details of the second quarter and outlook before opening the call on for your questions.\n\nThere will be a replay of today's call that will be available by webcast on the company's website at www.pfholdingscorp.com as well as the telephonic recording available until August 19, 2022. More information on how to access these replay features is included in the company's earnings press release. Please note, that the information reported on this call speaks only as of today, August 12, 2022, and therefore, you're advised that any time-sensitive information will no longer be accurate as of the time of any replay listening or a transcript reading. Also, comments on this call may contain forward-looking statements within the meaning of the United States Federal Securities laws, including management's expectations of future financial and business performance.\n\nThese forward-looking statements reflect the current views of ProFrac's management and are not guarantees of performance. Various risks and uncertainties and contingencies could cause actual results, performance or achievements to differ materially from those expressed in management's forward-looking statements. The listener or reader is encouraged to read ProFrac's perspectives, Form 10-Q, and other filings with the Securities and Exchange Commission, which can be found at sec.gov or on the company's investor relations website under the SEC filings tab to understand those risks, uncertainties, and contingencies. The comments today also include certain non-GAAP measures as well as other adjusted figures to exclude the contributions of Flotek.\n\nAdditional details and reconciliations to the most directly comparable, consolidated, and GAAP financial measures are included in the quarterly earnings press release issued yesterday, which can also be found on the company's website. And now, I'd like to turn the call over to Mr. Matt Wilks. Matt?\n\nMatt Wilks -- Executive Chairman\n\nThank you, Rick. I'd like to begin by setting how pleased we are to report exceptional results for the second quarter to which Ladd and Lance will speak more about in their remarks. I will highlight that we've outperformed what we said we were going to do once again. I'm extremely proud of our $28 million of annualized EBITDA, adjusted EBITDA per fleet, and more excited about the future opportunity than ever.\n\nOur view of the macro environment and oil field services has not changed and we are extremely well-positioned for the current US frac market where supply of pressure pumping horsepower is limited and incremental horsepower is bottlenecked. With many of our competitors completely sold out and having legacy footprints that need to be upgraded, the supply chain is extremely strained for maintaining and upgrading the existing fleets with a limited ability to build new capacity and as we all know, capital is more expensive. Taking together, these dynamics strengthen our belief that there is a great deal of link left in this cycle and margin expansion will continue through this cycle. We believe this is the best backdrop that we've seen since we started in the shell industry over 20 years ago and we see this lasting for quite some time.\n\nIn terms of this of the path forward, I see opportunity for growth in multiple areas in pressure pumping that Ladd will discuss, but I also see opportunities for continued execution on our growth strategy. As I've mentioned before, we have a two-pronged growth strategy acquire, retire, replace on the equipment side and a desire to scale our vertical integration on the supply chain. It is important to state that our M&A strategy is and will continue to be based on a very strict criteria for what is considered an accretive transaction and to maximize cash generation. We will continue to put all potential acquisitions under the same technical and financial microscope and although we believe the market is right for consolidating the space and expanding our vertical integration, we will not sacrifice the strength of our balance sheet for any deal.\n\nWe remain extremely thoughtful about our overall leverage and believe that we are on track to maintain our target of below one turn of debt to EBITDA so that we can continue to enhance our ability to return cash to shareholders. We expect that the excess cash flow we generate after interest and maintenance capex will be sufficient to fund growth capex, de-lever the balance sheet and return cash to shareholders. All three of those are priorities to us. To continue illustrating our strategy, I am very excited that we closed our acquisition of the Monahans West Texas sand operations in late July, and that our pending acquisition of US well services is on track to close in the fourth quarter.\n\nAs you have heard and seen from us already, we are constantly thinking about strategic efficiencies, enhancing value of the supply chain and vertical integration for our company to maximize profitability and returns for our stakeholders. Our vertical integration reduces overall cost of services and cost of maintenance to a level that is unmatched in the industry. From designing and manufacturing fluid ends, power ends, high-pressure iron or sand, chemicals, logistics, refurbishment, and new fleet construction, we see the impacts on margins, cost structure, and capex savings. Our vertical integration provides ProFrac with more control over the timing and amount of critical inputs into our business and it uniquely distinguishes us with a cost advantage compared to our peers.\n\nSpecifically in this environment where supply chain interruption is a challenge for pretty much everyone, we're in a better position than our peers to capitalize because we have our own sand minds. We have our own iron, our own machine shops, and we design engineer and assemble our own equipment from frac pumps to blenders, to e-fleets. With the Monahans mine, which combined with our La Mesa plant and Kermit mines; ProFrac has close proximity sand supply to almost every well in West Texas, which is far superior to any asset base in the region. The pull-through profit from logistics into our frac fleets are considerable in this environment and helps to ensure that our pumping is not interrupted.\n\nThis increases ProFrac's efficiency in the region by ensuring a reliable uninterrupted supply of high-quality sand, as well as our ability to reduce truck traffic, fuel consumption and emissions, which helps mitigate our costs in this inflationary environment. To provide some perspective prior to the Monahans purchase we were only producing sand for three of our fleets while purchasing the rest from third parties at current market rates. After all three mines are producing, we will have the capacity to supply up to 15 fleets worth of sand in West Texas when operating at an optimal capacity. While we expect to continue to supply a mix of third-party sand to our customers, we believe there is a tremendous value in procuring more materials on behalf of our customers.\n\nThese are exactly the kinds of opportunities we continue to look at to consolidate within our Sandy chemical markets. The margin contribution that comes from these types of opportunities will provide continued growth. On top of any quarter over quarter of price increases on our fleet pricing, which we continue to see today. I cannot stress this enough.\n\nHaving custody and control of our supply chain is one of the biggest drivers of utilization on our fleets. We are bullish on the future of, of our industry and our company. And as we continue to execute on our acquired retire, replace strategy, and vertical integration strategy, we plan to continue to redefine what is possible for an oil field services company. I will now hand the call over to Ladd to provide additional comments about our operations.\n\nLadd Wilks -- Chief Executive Officer\n\nHey. Thanks, Matt, and good morning, everyone. Our business and our teams performed extremely well. During the second quarter, we had 31 total fleets active during the quarter, and we're currently deploying our first electric fleet into the field.\n\nDuring the quarter we experienced significant price increases as all fleets were brought up to the current market pricing, and we continue to see additional pricing power. More importantly, we see continued growth in profit per fleet. As we incorporate our electric fleets, our vertical integration enhancements and provide more materials to our customers. We expect to exit the third quarter at 32 fleets as we deploy our first electric fleet late in the third quarter, we plan to deploy two additional electric fleets during the fourth quarter.\n\nAnd we did not expect to deploy any incremental conventional fleets. We plan to focus our labor and our available supply chain on supporting existing fleets and our electric fleet deployments, margins and cash flow. While pricing continues to move higher. We see further incremental expansion from additional bundling.\n\nWhen we acquired FTS, they had effectively de-bundled all their fleets. ProFrac has always aimed to provide sand chemicals, storage, and logistics, as it lowers the MPT on pad and lowers the overall cost to our customers while adding add adding incremental EBITDA to our fleets. In the second quarter, we provided more sand and chemicals on an absolute basis, but we only provided approximately 30% of sand that we pumped compared to 40% in the first quarter, as we look forward, we believe we have the supply, the proximity and cost to become the primary choice for our customers. This dynamic will allow ProFrac to continue growing profitability per fleet in the current environment beyond just pricing power of the fleets, but also through additional product offerings and creating incremental value for our customers.\n\nI cannot help but think back to when we started in the industry and at that time pressure pumping companies provided every bit of sand and chemicals used in the completions process. In 2011, our customer base was paying nearly two times as high rate as they are paying now. And more importantly, it was taking them three times longer to complete a well and, and take that production to market. When compared to the last cycle of 2018, we are still charging a 30% lower rate and delivering Wells in 60% less time, we have come a long way as an industry and in becoming more efficient, but more efficiency means more wear and tear and more attrition as we continue to pump more hours using more equipment and charging less than we did previously at a time when we're helping our customers generate record levels of cash.\n\nIt's this perspective that makes me bullish on the path forward, moving on to the most exciting development. Our first electric flag fleet is in the process of being deployed for a customer. We are very happy with the performance so far and are testing the equipment out under various conditions. The economics are unmatched and the power of these pumps are incredible.\n\nWe have just scratched the service of defining what is possible with these new electric pumps. We look forward to that fleet generating a full quarter of revenue and profitability during Q4, which we expect to return higher profitability due to the lower repairs simpler design and the higher value add to our customer. Another operational update that I'm very proud of the team for is the speed at which we've been able to integrate FTSI operationally. We are fully integrated with one team and one process from sales to procurement to maintenance to operations customers have commented on how engaged our crews are on both sides.\n\nAnother huge win is having all our equipment running on a single software that is interchangeable as one company, we're bringing together culture, ideas, and collaboration to improve the company all along the way. We've been able to accomplish this with very little one-time costs and are seeing the synergy benefits in real time. Before turning the call over to Lance to review the quarterly results in more detail, I'd like to restate our commitment to ProFrac's mission, which never changes for us, which is one to be the best and safest company to work for in the oil field service industry and two to amaze our customers with elite products and services utilizing the most cost effective and environmentally friendly solutions and three to achieve superior returns for our shareholders. With that, I'm going to hand the call over to Lance.\n\nLance?\n\nLance Turner -- Chief Financial Officer\n\nThank you, Ladd. Good morning, everyone. We're pleased to announce our second quarter 2022 results on a consolidated basis revenue for the second quarter, total of $589.8 million, compared to the first quarter of $345 million as reported and $421.6 million on a pro forma basis adjusted for the FTS acquisition. The increase was due to higher average pricing on equipment and on materials, providing more materials for our customers and to a lesser extent, higher efficiency on our fleets as measured by pumping hours per fleet net income was $70.1 million for the quarter net income, excluding the stock compensation with a deemed contribution from a related party, would've been $108.9 million, compared to $24.1 million.\n\nIn the first quarter adjusted EBITDA was $210.6 million or $218 million when excluding the amount attributable to flow text results. This resulted in $28.1 million of EBITDA per fleet on an annualized basis. Excluding the impact from Flotek, this quarter included a couple of new developments that I would like to highlight as this will impact the comparability of our results to the first quarter. You will notice that we now have in other business activities in our business segment information, this is new in the second quarter and relates to the results attributable to Flotek.\n\nIn May, we expanded our supply agreement with Flotek in exchange for an additional $50 million in convertible notes. We also received the ability to designate four of seven directors to Flotek board because of our right to appoint directors to the board without a direct equity interest in Flotek, we determine the proper accounting treatment is to consolidate their results. As a result, subsequent to May 17. We have accounted for this transaction as a business combination and Flotek financial results have been consolidated into our financial statements for the second quarter.\n\nAfter May 17, we will refer to certain measures, excluding Flotek that will make these measures more comparable to the first quarter and more representative of our underlying operations. You will also see $38.8 million in stock compensation related to a deemed contribution from a related party. This stock compensation relates to shares sold by Dan and Farris Wilks to Matt and Ladd Wilks. This transfer was completed in conjunction with the IPO and was structured as a purchase.\n\nHowever, the accounting treatment resulted in stock-based compensation funded directly by the Wilks. I want to highlight that this was a transaction between the family members and did not result in any additional shares issued and therefore did not have a dilutive impact on other shareholders. The accounting treatment is nuanced because it is a related party transaction with an executive and therefore was deemed to be considered stock compensation reflected in the company's financial statements during the quarter, and resulting from the IPO proceeds. We also had an $8.8 million loss on debt extinguishment, $5.9 million of which was non-cash selling general administrative costs increased to $87.5 million, which included $40.3 million in total stock compensation expense $4.2 million related to Flotek during the quarter and $4.1 million in acquisition-related costs.\n\nThe second quarter costs increased beyond these three items due to having a full quarter impact of the FTS-related expenses, as well as higher incentive compensation costs driven by outperformance of the business during the quarter. Looking at the third quarter of this year, we expect continued improvement in our profitability, perfectly pricing discussions preceding the third quarter, went well with customers and remained constructive at this point in time. In addition, as Ladd mentioned, we believe there is more profit to be captured by providing more materials for more of our customers. We believe this bundling has the opportunity to exceed that of price increases over the next 12 months, turning to our business segments.\n\nThe stimulation services segment generated revenues of $576.6 million in the second quarter up 72% from the first quarter adjusted EBITDA for the segment was $196.1 million. The increase from the prior quarter was driven by FTS contributing to the full quarter compared to one month of contribution in the first quarter, as well as increased pricing and a higher amount of materials provided during the quarter, the manufacturing segment generated revenues of $34.9 million in the second quarter up 8.9% from the first quarter, approximately 88% of this segment was intercompany revenue compared to 84% in the prior quarter adjusted EBITDA for manufacturing was $9.4 million in the second quarter down slightly from $10 million in the first quarter. This segment experienced slightly higher manufacturing costs due to increased cost of production, as well as a less profitable product mix, which we think should normalize in the third quarter. Profit production segment generated revenues of $17.5 million during the quarter up 41% from the first quarter, approximately 66% of this segment was intercompany revenue compared to 69% in the previous quarter adjusted EBITDA for the profit segment was $12.6 million up from $7.9 million last quarter.\n\nThe improved operating results were due to higher production levels with a higher average selling price, slightly offset by increased production costs, other business activities, which solely included Flotek generated revenues of $15.4 million and negative $7.5 million in EBITDA. This represents a partial quarter of activity and eliminates activity between flow and ProFrac. Turning over to capex, we continue to adapt our capital program to the current environment. We expect the full-year capex to come in at the high end of the range that we previously provided.\n\nThat is between $265 million to $290 million. The increase primarily relates to a higher quantity of engine replacements and upgrades in the back half of the year. The budget for our electric fleets remains the same between $65 million and $70 million for all three fleets, which excludes the cost of the licenses that were paid in 2021. In addition, we expect our La Lama plant to be completed and operational in the fourth quarter and estimate the total cost to be approximately $30 million, looking at the capital structure and cash flow, excluding the amounts attributable to Flotek.\n\nWe ended the second quarter with $477.5 million in outstanding principal and $88 million in liquidity. When we talk about liquidity, we exclude the liquidity attributable to Flotek because while we do consolidate their results, we do not have the ability to use their cash or liquidity in our operations. Subsequent to the second quarter, we announced an upsize of our term loan and we close the acquisition of our Monahans sand plan, including the subsequent events, our debt excluding Flotek, would've been $627.5 million with approximately $131 million in liquidity. Operating cash flow was $39.5 million during the quarter, which was impacted by a large working capital build due to higher fleets, higher pricing, and higher efficiency.\n\nWe expect this to normalize in the back half of the year and are focused on working capital initiatives to help offset future working capital builds, driven by improved operating results with the improved financial results. We expect cash flow to accelerate meaningfully as these results convert to cash in the third quarter as well as service acquisition progresses, we will assess our liquidity needs to ensure a successful closing and integration. And with that, I'll now turn the call to the operator to take your questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Dan Kutz with Morgan Stanley. Please proceed with your question.\n\nDan Kutz -- Morgan Stanley -- Analyst\n\nI wanted to ask Lance, it might have been you that mentioned that you saw that kind of the earnings up uplift from the bundling of materials could be a bigger opportunity relative to price. I guess I just wanted to dig into that a little bit more and see if you guys can kind of stack rank where you see the most kind of per fleet profitability growth opportunities from here as it relates to pricing efficiencies, adding fleets, or incremental activity versus kind of the vertical integration benefits and the bundling of materials. Just wondering if you could expand on that, that comment a little bit.\n\nLance Turner -- Chief Financial Officer\n\nSo I think my comment on the bundling is when we look forward over the next 12 months, I think the point is we see accretion, we see improved performance not just through increasing prices, particularly as you look out into next year and I think that, as we said, we're only about 30% bundled or on the sand side and we think there's a lot of opportunity there as it relates to the short term we do continue to see pricing discussions and pricing improvement. We do intend to improve the bundling in the short term, but it's really a longer-term picture when you look into next year that we really want to increase the percentage of materials that we provide materially. Yeah. And as we continue to expand our supply chain and we're having greater and greater success in bundling services.\n\nAnd I think that for example, with Flotek in Q3, we expect to average around 16 fleets with the Flotek chemistry, and expect to be at full contracted volumes early in 2023 on sand. We're really excited about bringing the bundling on there and continuing to see more and more fleets. We're further ahead on sand than we are on chemistry. And just as an example frag fleet on average will consume about 0.5 million tons per year per fleet.\n\nAnd so if you look at getting a gross margin of $20 a ton, that's $10 million contribution margin per fleet. And so it very quickly becomes a substantial contribution across the platform and of course, on the equipment, we are seeing very, very constructive conversations. The market continues to tighten, and we expect to see that tightening continue on through 2023. As of now, what we're looking at is, is a very healthy uplift in double-digit percentage, quarter over quarter from Q2 to Q3.\n\nDan Kutz -- Morgan Stanley -- Analyst\n\nGreat. Thanks, guys. It's really helpful. And then just wanted to ask about capital allocation priorities.\n\nSo I know that you guys have some electric crack fleet, new builds that you're doing. You're kind of -- you still have the upgrade program for some of the legacy conventional fleets. I know that managing debt and hitting the leverage target that you pointed to is obviously up there and wanted to ask, I guess, how shareholder returns fit into that as well as potentially any incremental M&A, just wondering what your kind of capital allocation priorities are looking forward.\n\nLadd Wilks -- Chief Executive Officer\n\nDefinitely. So I'll touch on this and then hand it over to Lance, but our number one priority is for the equipment that we have today to be as good or in better shape than at the end of the year, compared to the beginning of the year. And so we want to make sure that we take good care of our equipment. And but we're also in an upgrade cycle because of diesel where old tier two old diesel fleets are considerably expensive for our end customer.\n\nSo as we look to tier four DGB or dual fuel systems to reduce our overall diesel consumption we see substantially higher margins on that equipment, on those fleets, as well as we're really excited about the EFL program. But beyond that, we prioritize our equipment and then it's shareholder returns. And then behind that is our growth initiatives. And so we want to make sure that we take the lead on returning capital to stakeholders.\n\nWe think that this is very important for the entire oilfield services space to make it a priority that this isn't just sector that you trade that this isn't a sector you can invest in. And when you prioritize profitability, it becomes investible. And we believe in that, and this is, this is why this, this is why we're in this business. And we think that this is an incredible industry to invest in and taking the lead on returning capital to stakeholders is exactly how you deliver an investment rather than a trade.\n\nDan Kutz -- Morgan Stanley -- Analyst\n\nGot it. All right. Great. That's really helpful.\n\nThanks a lot, guys. I'll turn it back.\n\nOperator\n\nThank you. Our next question comes from John Daniel with Daniel Energy Partners. Please proceed with your question.\n\nJohn Daniel -- Daniel Energy Partners -- Analyst\n\nHey. Good morning, guys. Really impressive numbers. Matt, big picture question for you guys that just your view on power generation, who owns it, the best approach to generating it.\n\nJust any color there would be thought would be helpful.\n\nLadd Wilks -- Chief Executive Officer\n\nDefinitely. Good morning, John. Yeah, as we look forward, we think that right now there's a lot of power producers out there that are providing, providing equipment, but as we look forward, we're taking a wait-and-see approach. We're not quite at a spot where we would like to outline our specific plan, but just like everything else that we do, we have a very focused effort on making sure that the reliability of our equipment and the supply chain is in our custody so that we can control the moving pieces control the lead times control the timeframes.\n\nAnd I wouldn't expect this to be this part of our business to be any different.\n\nJohn Daniel -- Daniel Energy Partners -- Analyst\n\nOK. Fair enough. And then the last one for me, just on the stand side, I think you noted if I heard correctly capacity to call it cover 15 fleets and the Permian, I think that's about where you guys are 13 fleets, 15 fleets. I'm curious if you have a big presence in other markets like the Eagle Ford in Haysville.\n\nDoes the logic apply to having vertical integration on sand in those markets? Just your thoughts.\n\nLadd Wilks -- Chief Executive Officer\n\nYeah, I think, I think each market is you evaluate whether it makes sense what can you purchase it for locally compared to what your cost would be owning it? And so we continue to evaluate, but we have nothing to report any expectations or, or intentions at this time.\n\nJohn Daniel -- Daniel Energy Partners -- Analyst\n\nOK. I'll queue up again if no one else asks questions. Thank you for your time.\n\nOperator\n\nOur next question comes from Chase Mulvehill with Bank of America. Please proceed with your question.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nSo just quickly following up on John's question on sand. I think you said 15 fleets, so I'm just trying to do the math. 0.5 million ton, right? So it sounds like you can pretty much produce at all of that 8 million ton nameplate capacity, right? So for you, nameplate is basically the same as actually marketable or, or the amount of sand that you can produce just to clarify on that front.\n\nLadd Wilks -- Chief Executive Officer\n\nYeah. The way that these are built physically, they can each produce over, just right at or just above 3 million tons each. Our plant is permitted for 2 million, but the equipment is rated for more than that. So once it's up in operational, we expect to go in and look to expand to that permit.\n\nSo that'll gain us an additional million tons of name play capacity.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nOK. OK. No. That makes sense because we tend to think about nameplate and marketability a little differently.\n\nSo that makes sense. Thanks for that clarification. And then in with clarification, I think the first question you said you expect I think I heard the word profitability to go up double digits to Q2 Q3 right. But I wanted to clarify it.\n\nDoes that mean even apples need to go up double digits through 3Q? So we are talking 28 to 31 kind of a number. Is that what you meant?\n\nLance Turner -- Chief Financial Officer\n\nYeah, I don't want to nail it down to a specific, number of EBITDA per fleet, but I am very comfortable saying that there, we expect to see a three-handle on the EBITDA per fleet.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nOK. OK. That makes sense. And obviously, you got the SP Monahans acquisition that close in July, so that's going to be helpful.\n\nLadd Wilks -- Chief Executive Officer\n\nYeah. And just on that real quick, I'd like to comment on a few things there and that, as we look at that type of performance, there's several things that are really driving that, I think it's important to highlight that, one is our maintenance rotation is phenomenal. We've got an incredible pit crew that allows our equipment to be out on location longer. And when it does come in for a tire change or to get topped off on fuel, like, like a race wood and pit row, we're able to get it back out working.\n\nAnd so you're when you've got a really good pit crew, your R&M expenses tend to run pretty consistently otherwise, but what you end up with is that race car is on the track longer running and that's, I think that's one of the main things that drives our superior performance and allows us to get the industry-leading EBITDA per fleet. Whereas having uniform components is a big part of that. The supply chain is incredibly tight and it's creating situations where many in the industry are having to go in and get fluid ins wherever they can. When you have different fluid ends from different manufacturers, you end up with a very complicated skew with your parts room, the training with your personnel on locations, swapping out fluid ends, changing valves and speeds.\n\nIt gets really complicated and if they put the wrong valves and valve in sequence or if they put the wrong part in, you have a higher number of failures. So it stresses your overall supply chain even further when you don't have uniformity. And so when you look at this tight supply chain, we really see this as a driving factor in our standout performance relative to our peer class. And this is also what we believe is going to keep this from really becoming a new build cycle too quickly.\n\nSo we're really excited where we're positioned, how we've built this company and very, very proud of our vertical integration that allows us to consistently generate these results, not just in Q2 Q3, but we're really excited about how this advantage will drive material results in 2023 as well.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nRight? No. All of that makes sense. And then just quickly last one from me on the fleet side. In the press release, you did say you are, you're doing the trials, you're doing trials on the first fleet on the field right now.\n\nAnd you expect the commercial deployment before the end of the third quarter rate quickly wanted to check on that. What are you seeing in the trials? How happy you are not happy you are with the trials, how are they going? And just as a follow-up on that how are you thinking about new building on the EFL site for 2023, especially now that you're acquiring you as well?\n\nLadd Wilks -- Chief Executive Officer\n\nYeah. With the EFL program, these are commercial platforms. And so we're really excited to get these out there. The reason we call this, this one is really getting out there on its first location.\n\nIt's just running through diagnostics, making sure that we understand all the error codes that are kicked out by the controls and making sure that everything is communicating appropriately. So we're just going through getting that knocked out. And this is a much faster process than what you would see anywhere else because this is a proven commercial platform. So we're really excited to have this thing fully available for all of Q4 and, and very delighted to see what kind of be able to share with, with our stakeholders.\n\nWhat kind of results these, these provide relative to conventional fleets?\n\nMatt Wilks -- Executive Chairman\n\nYeah. And, Chase, I would just add to that. We have two of our pumps out there on location now, and they're pumping today. So want to be clear that this isn't something that we're planning to put out they're out today.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nOK. Cool. And thoughts on 2023 do think you want to build more, more easily, especially now that you're getting a lot more on the US side?\n\nLadd Wilks -- Chief Executive Officer\n\nYeah. We'd rather not discuss at this time our growth plans for 2023. But very excited looking forward to closing U.S. Well transaction early in Q4 and bringing in and integrating that business very similar to we, we, what you saw from us with the FTSI integration and how phenomenally, well, that has gone.\n\nWe expect the U.S. Well transaction and integration process to go equally as successful. And this is with our vertical integration, the different components that we've built specifically for these types of processes have shown incredible results so far, and we're getting better at it as we go. So as we look at the U.S.\n\nWell integration, we expect to see those types of results carry forward. So yeah, it's exciting time for us looking forward to getting that taken care of. But it's too early to tell and would rather not get into that at this point on any further growth initiatives for 2023.\n\nOperator\n\nThank you. Our next question is from Stephen Gengaro with Stifel. Please proceed with your question.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nThanks, and good afternoon or good morning, everybody. So I guess two things for me, if I could start with we've, we've heard from, from some of your peers about equipment demand for 2023 and, and, and your customers trying to lock up capacity for 23. What are you seeing on that front, and how do you think about that balance when you're looking at pricing?\n\nLance Turner -- Chief Financial Officer\n\nYeah. We're seeing a great deal of early looks and it seems like the RFQ season has started earlier than usual. Typically, that means better margins and continued expansion of pricing. We like what we're seeing on the capex budgets, and there is a shortage of horsepower in the market and with the complexity and the mismatch, as you see more of our peers adding, mismatching fluid ends, and mismatching components when you look at the amount of horsepower, that's in a maintenance cycle at any given point 20% to 25% usually when you start mismatching parts and having different types of fluid ins, different types of iron you start seeing more frequent failures and more stress on that supply chain.\n\nSo as we look at the market going forward, I think that this, this does not ease up, it actually tightens further, but what we're really proud of is the customers that we have now about the reliability that we bring and the consistency that we bring and that, that reliability and consistency is a value proposition. That's easy to take up. So we think our peer class is, is going to continue to struggle with, with supply chain and many price improvement improvements with these, these competitors likely will be going to a more and more complicated R&M and supply chain.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you. And when we think about us well services they recently announced numbers they've clearly been hurt by sort of a lack of overhead absorption as they roll out new assets. But I think they've run the last quarter, [Inaudible] fleet, like $5.5 million on an annualized basis.\n\nHow long do you think it takes, based on the contracts that they have in place to get their assets up to your level of profitability?\n\nLadd Wilks -- Chief Executive Officer\n\nYeah, I'd really rather not comment or speculate on where their contracts are or, or anything like that. What we really look at is what we're capable of with the same assets and you then going back and looking at what we've been able to accomplish with the FTS integration and quickly being able to get in and see material commercial results as where as well as operational results. And so we're really looking at this rather than how do we get from where they are really looking at it from the perspective of what can we do with it. And we typically these things would take nine to 12 months.\n\nWe take a conservative approach, what feels like to us, a conservative approach of around six months, but that's also what we put out for FTS. And we're able to realize that within very short order of being able to get their profitability up. And so given it some bookends, I'd say an outside date would be six months and our own internal expectations for ourselves would be, in a very similar timeline to what we did with FTS.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nGreat. And if I could fill one other quick one, I don't know if you, you could comment on this or not. Do you have -- can you give us a sense for Flotek revenue per fleet per year?\n\nLadd Wilks -- Chief Executive Officer\n\nYeah. I don't want to look at an indication there. But what we do like is that the contracts that we have with them is going according to plan, they continue to scale operations and not just with us, but also out with third, with true third-party customers on their end. So we're really excited to see that business continue to scale and really look forward to the early, early part of 2023 to get this to fully contracted volumes that we've mutually negotiated.\n\nAnd of course, as that does get to scale, we're really excited to see what that does with their financials in bringing this to profitability. We're also outside of that agreement. We, we're very excited about the JP3 agreement that we have in place that gives us confidence in the quality of the gas that we're, that we're pumping with. And being able to monitor BTUs in near real time allows us to protect our equipment and provide reliable service for not just the dual fuel systems, but also for the turbines providing or for the power gen on location that runs on the gas.\n\nSo making sure that we have good high-quality gas on location is a very important thing. We're also excited about what that means for Flotek and the JP3 team because being able to monitor BTUs for gas has far-reaching, consequences has far-reaching, impacts across the entire oil and gas industry, and especially for the midstream side for these operators, as they look to make sure that they capture every dollar for the gas that they, they sell down the line.\n\nOperator\n\nOur next question comes from Don Crist with Johnson Rice. Please proceed with your question.\n\nDon Crist -- Johnson Rice and Company -- Analyst\n\nI wanted to touch a couple. People have asked about sand but given the significant impact on the potential financials next year, it could be, 10% or 15% of your total EBITDA. Just wanted to ask about number one volumes. Do you think you can get up to that, call it 7.5-or-so million tons per year? And number two, what your thoughts are around pricing? I know it, I know it spiked in, in the first quarter of this year to, upwards of $80 to $100 a ton, but didn't know what kind of long-term price that you were kind of expecting going forward?\n\nLadd Wilks -- Chief Executive Officer\n\nYeah, there was, there was a point early in the year where it was $80 to $200 a ton at the mine gate. It, it hasn't I think occasionally you'll see it get there depending on, on whether it's a, a spot pad or not, but for the most part we've got contracted volumes that are much lower than that really would prefer not to go into specifically where for obvious reasons but what we can say is that this is one on utilization. We definitely believe we can get our utilization where it needs to be -- to provide a minimum of 7 million to 7.5 million tons on annual basis. But when you look at the pricing on that end, I think that you wouldn't see spot pricing across the board, but trying not to box myself in 'cause I like you guys.\n\nLance Turner -- Chief Financial Officer\n\nLet me let throw a range. Like you guys, how you are -- you agree with doing that next quarter. I don't want you to do that to me. Well, if is it between call it 35 and 50? Is that a good enough range to kind of not box you in?\n\nLadd Wilks -- Chief Executive Officer\n\nThat's a good range.\n\nDon Crist -- Johnson Rice and Company -- Analyst\n\nOK. And then two kinds of clean-ups for me. Lance, can you tell us what the share count was in the second quarter? It wasn't in the press release.\n\nLance Turner -- Chief Financial Officer\n\nYeah. So it'll still be about 142.4 million when you get the financials because the IPO happened mid-quarter EPS will be a little nuanced given the FC structure. But that share count at the IPO is, and forward is about 142.4.\n\nDon Crist -- Johnson Rice and Company -- Analyst\n\nOK. And then just one final one for me SG&A was a little bit crazy this quarter with, with the shares going to the Wilks brothers, obviously, go going forward. Do you think it's going to be in that call it 40 million to 45 million? Or do you think it's going to be closer to what it was in the first quarter?\n\nLadd Wilks -- Chief Executive Officer\n\nYou're exactly right. If you back out those three items I called out that kind of gets you into the 40 million to 45 million. And that's, that's probably our best estimate at this point. The first quarter, you had a lot of things going on with the companies coming together and not having been together previously the IPO, etc.\n\nAnd then, and so I think Q2 is going to be a better measure than Q1 and then $4 million of that was the acquisition-related expenses, obviously with us. Well, I'm sure we'll, we'll have some of those that will elevate it in future quarters as well, but we'll, we'll be sure to call those out.\n\nLance Turner -- Chief Financial Officer\n\nYeah. And that anomaly that you see on there is related to the GAAP requirements that we put that in the SG&A the share account pre and post is exactly the same. Those shares were private transactions paid for by the individuals receiving that.\n\nDon Crist -- Johnson Rice and Company -- Analyst\n\nUnderstood. I appreciate the color. I'll turn it back.\n\nOperator\n\nOur next question is from Tom Curran with Seaport Global. Please proceed with your question.\n\nTom Curran -- Seaport Global Securities -- Analyst\n\nJust wanted to, just wanted to pick up where Stephen left off with Flotek. So I know it was a profitability drag in the quarter with adjusted EBITDA loss of $7 million in Flotek's release. They emphasize that as chemical deliveries ramped to your contract's full scope margin should expand toward or, or into positive territory and operating leverage and economies of scale. What are your own expectations for when Flotek should get there? Sounds like you've referenced it twice.\n\nI believe so far in the call. Sounds like it should be around early 2023, maybe. And just, what sort of potential run rate EBITDA contribution do you see there longer term, how collaborative is, is the relationship at this point when it comes to Flotek's broader company revival plan?\n\nLadd Wilks -- Chief Executive Officer\n\nYeah, as we look at that, it is early 2023 for getting to full contracted volumes. What we're excited about is, is, as they ramp and they get to a higher utilization, they'll be able to absorb a lot of the early costs that you saw in, in Q2. Our procurement and their commercial team is working very, very constructively to, to bring these volumes up and to get things in line we're also, as we bring these volumes on, we're excited to see that they're able to get their economies of scale and a greater purchasing power to bring their overall cost structure lower. So not only do they gain on the top line as we scale to full contracted volumes, but those economies of scale will drive their per unit cost lower on every product that they have, and continue to expand, not just the profitability associated with our contracted volumes, but also with the third party customer base that they have.\n\nThey'll also benefit from the economies of scale that, that these types of volumes drive.\n\nTom Curran -- Seaport Global Securities -- Analyst\n\nMakes sense. And when it comes to your conventional and, and dual spread reactivation situation, is it a scenario in which, you could already definitely get the pricing in terms you'd want really the return on that incremental deployment, but are holding back as, as part of your fleet growth, discipline, and strategy, and if you were to anchor reactivation contract, what sort of lead time advantages would you expect to have over the industry norm at this point?\n\nLadd Wilks -- Chief Executive Officer\n\nSo right now we have no intentions of activating any fleets that are on the sidelines. But what I would like to touch on is the upgrade program of upgrading tier two conventional fleets to dual fuel fleets. It's giving us additional engines that we have at our disposal to use as swing units. And these swing units have an incredible ability to really shift and change the way that our R&M program is, is currently operated so that if you have a hard down engine, we don't have to bring it all the way back to here in Toledo or out into Cisco where we'll do an engine rebuild or a transmission rebuild.\n\nInstead of having the pumping trailer sitting there, waiting for the rebuild to be completed. These excess engines allow us to swing them in the district where we can get a 48-hour turn and have them back out in the field pumping. So when you look at the R&M expense associated with that, our engine rebuild and transmission rebuild are going to pretty much fix the same number of engines and the same number of transmissions in a given period of time. But having this swing program doesn't keep the actual trailer itself tied up while those repairs are being completed.\n\nInstead, those trailers stay in the field longer generating revenue. And so just kind of looking at prior to the FTS transaction, we had 17 fleets out of 20 fleets active. Those other three fleets were supporting a lengthy R&M cycle. And so now that we've brought in the engine repair and transmission repair in-house, we also continue to see expansion of our swing unit program for engines and transmissions that we can do in the district.\n\nAs we see that come to come to scale, what you'll see is we'll get those three fleets back, and rather than supporting an R&M cycle, they'll be available to generate revenue out in the field. So I wouldn't necessarily call those activations or reactivations, they're already active. They're just not generating revenue, they're supporting an R&M cycle. And so these are high-value fleets in a very low-cost way of getting them back out there, generating revenue for, for equipment that is already active.\n\nIt just doesn't generate the same revenue and the R&M cycle and the cost of that R&M should relatively remain the same. So those three fleets would come at higher profitability because we're already paying for the R&M.\n\nTom Curran -- Seaport Global Securities -- Analyst\n\nGot it. And just to clarify, as it stands today, do you have any horsepower, and if so, how much left that is neither participating in this swing program nor being, cannibalized or used as a source for parts components, but is solely idle parked against the fence. And you're still deciding what to eventually do with it. Is there any horsepower that would fall into that category still?\n\nLadd Wilks -- Chief Executive Officer\n\nThere is no equipment that is in a yard anywhere in this company that we anticipate bringing back. And, and just going back to the swing program, what I like to look at on it just an example, just to highlight just how material it is if you can get a trailer that has a hard down engine or a hard down transmission, if you can get it back out in the field, generating revenue in 48 hours, as opposed to close to 20 days or three weeks it's kind of like seeing a racecar go into pit row and get a new set of tires and topping off the fuel in 10 seconds instead of a hundred seconds. And it's incredible the cumulative effect that that type of cycle time has on your overall performance across your entire company. And so those are the types of improvements we like to focus on.\n\nAnd those are the immediate opportunities that we see to continue improving the profitability of pro rack looking at the demand side and we like what we see there, but rather than responding to it with adding capacity to the market, what we're looking at is that busted old equipment that's in, on a fence or any yard somewhere and needs to stay there.\n\nMatt Wilks -- Executive Chairman\n\nYeah. And, Tom, you're kind of hitting around just EBITDA per fleet and how we think about all of our fleets. And that's how we talk about it, EBITDA per fleet, but fleet isn't a -- they're not all the same. And even though we kind of talk like they are they haven't, they've, they're not what they used to be either.\n\nLike, and if you think back to 2018, a fleet was closer to 45,000 horsepower. And today our fleets are around 62,000 horsepower that we have out in the -- well with the equipment that we have maintenance that we're -- and in that maintenance rotation, it's closer to that 62,000 right now. And that equipment that's coming back in that Matt's talking about, we're going to use that to support the fleets that we have out in the field and, and get better utilization and when you think about, when you look at other people's fleets, that they have a similar, it's similar for them as well. And when you think about new build economics, it's actually a lot higher than what people talk about with inflation, but also just the larger, the more the, with these more jobs that are more intense, you have to have more, more horsepower to support them.\n\nYeah. When you look at the strength of your, of your supply chain and your R&M cycles being able to really focus on your efficiencies and your utilize utilization there keeps you from having to really reach out into a boneyard and activate fleets that wouldn't have otherwise. I think reviving these zombie fleets is definitely not something that pro rack is going to do or has to do to continue providing the top-quality service that we're known for. And so that I think that we are we're in the same industry as everybody else, but when you look at the vertical integration, the capabilities that we have, I think that we, what you see is a better utilization, better performance delivered because of the quick cycle times that we have and it's not everybody is positioned to replicate those results.\n\nOperator\n\nWe have reached the end of the question-and-answer session. I'd now like to turn the call back over to management for closing comments.\n\nLadd Wilks -- Chief Executive Officer\n\nWell, we definitely appreciate everybody for their questions. And look forward to the days ahead, the quarters ahead and to 2023, as we continue to expand our overall platform, continue to execute on our commitment to our stakeholders of delivering incredible results and continued expansion and on our acquired retire, replace, and consolidation within the supply chain. Our commitment is to profitability over growth and we look forward in the months ahead of providing further guidance on exactly what we mean by that with specifics and are very excited to look forward to the opportunity to pay dividends. And with that, we want to thank everybody and thank our stakeholders.\n\nHave a good day. Thanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRick Black -- Director of Investor Relations\n\nMatt Wilks -- Executive Chairman\n\nLadd Wilks -- Chief Executive Officer\n\nLance Turner -- Chief Financial Officer\n\nDan Kutz -- Morgan Stanley -- Analyst\n\nJohn Daniel -- Daniel Energy Partners -- Analyst\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nDon Crist -- Johnson Rice and Company -- Analyst\n\nTom Curran -- Seaport Global Securities -- Analyst\n\nMore PFHC analysis\n\nAll earnings call transcripts"
}