{
  "companyName": "The Children's Place",
  "companyTicker": "PLCE",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/17/the-childrens-place-plce-q3-2022-earnings-call-tra/",
  "content": "The Children's Place (PLCE 1.05%)\nQ3 2022 Earnings Call\nNov 17, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning and welcome to The Children's Place third-quarter 2022 earnings conference call. On the call today are Jane Elfers, president and chief executive officer; Sheamus Toal, chief financial officer; Maegan Markee, senior vice president, digital marketing; and Josh Truppo, vice president, financial planning and analysis. At this time, all participants or in a listen-only mode. After the prepared remarks, we will open the call up to your questions.\n\nWe ask that each of you limit yourself to one question so that everyone will have an opportunity. As a reminder, this conference is being recorded. The Children's Place issued its third-quarter 2022 earnings press release earlier this morning, and a copy of the release and presentation materials have been posted to the Investor Relations section of the company's website. Before we begin, I would like to remind participants that any forward-looking statements made today are subject to the safe harbor statements found in this morning's press release, as well as in the company's SEC filings, including the Risk Factors section of the company's annual report on Form 10-K for its most recent fiscal year.\n\nThese forward-looking statements involve risks and uncertainties that could cause actual results to differ materially. The company undertakes no obligation to publicly release any revisions to these forward-looking statements to reflect events or circumstances after the date hereof. It is now my pleasure to turn the call over to Jane Elfers.\n\nJane Elfers -- President and Chief Executive Officer\n\nThank you and good morning, everyone. I would like to welcome Sheamus Toal, our chief financial officer, to the call. Sheamus has more than 25 years of financial and operational management experience. Sheamus is a strategic leader with a proven track record of delivering financial and operational improvements and is respected as a highly collaborative business partner.\n\nOn behalf of the entire senior leadership team, we are thrilled to welcome Sheamus to The Children's Place.\n\nSheamus Toal -- Senior Vice President, Chief Financial Officer\n\nThank you, Jane. Good morning, everyone. As you may know, I joined the company last week, and I wanted to take this opportunity to thank Jane and the board for their trust in me. I am so excited to be part of The Children's Place family.\n\nAnd I strongly believe that we are well positioned for future operating margin and EPS growth. As a parent, I have been a longtime Children's Place customer, and I know firsthand that this is an amazing brand with outstanding recognition. We clearly have superior product and a strong value proposition, which, when combined with our customer-centric focus and digital dominance, creates significant opportunity for future growth. I am excited to partner with Jane and the talented senior leadership team that she has assembled to further enhance shareholder value.\n\nI truly believe that the best is yet to come for our strong brands.\n\nJane Elfers -- President and Chief Executive Officer\n\nThank you, Sheamus. I'd also like to welcome Maegan Markee, our senior vice president of marketing, to the call this morning. In addition to leading our marketing organization, Maegan also leads our Amazon initiatives, both of which she will discuss later in the call. I want to start off by highlighting and recognizing our entire team for two key companywide accomplishments.\n\nFirst, we published our 2021 ESG report on October 31st, and we are proud of the progress we have made on the company's environmental initiatives, including our science-based goals to reduce greenhouse gas emissions and our measurable targets to increase the use of more sustainable raw materials in our products and to reduce the use of water and chemicals in our global supply chain. In addition, we are particularly proud of our industry-leading gender diversity across every level of our organization, from our sales associates to our board of directors, a key differentiator in the marketplace that we believe gives us a competitive edge. 85% of our customers are women, and 87% of our workforce are women. Our women-led company, many of whom are mothers, deeply understand the wants and needs across our diverse customer base, allowing the voice of our customer to be at the forefront of our decision-making.\n\nSecond, we're very proud of our newest brand, PJ Place, which launched online on October 12th. PJ Place is the ultimate sleepwear destination, and PJ Place has two key growth components, both of which provide us with additional market share opportunities. Maegan will cover PJ Place in her prepared remarks. I want to thank our entire organization for all their hard work on successfully delivering these two important initiatives.\n\nMoving on to results. Top-line sales for the quarter slightly exceeded our projection. August top line performed in line with expectations and represented approximately 39% of our retail sales for the quarter. Post-Labor Day sales were soft, but we experienced a significant top-line lift later in the month of September and through mid-October as a result of the combination of cooler weather across the northern parts of the country and the launch of three powerful celebrity marketing campaigns.\n\nSales significantly decelerated the last two weeks of October. Gross margin was approximately 300 basis points below our internal expectations due to transitory supply chain cost pressures, including elevated freight distribution and transportation costs. Unlike many other retailers, we did not experience significant supply chain cost pressure in the back half of 2021. So, we are currently experiencing our largest year-over-year supply chain cost increases.\n\nFrom an AUR perspective, we were encouraged by our ability to pick up 4% in AUR for the quarter versus our internal projections of an approximately 2% increase even with the heightened promotional environment. This speaks to the strength of both our product assortment and our marketing efforts and is a positive sign for the future as we continue to see cotton prices normalize. Moving on to our digital-first strategy. Digital represented 50% of our total retail sales in Q3 versus 48% in 2021 and 37% in 2019.\n\nWe're very proud of our industry-leading digital penetration, and we're excited about our digital growth opportunities in 2023 and beyond. E-commerce traffic held up well during the quarter at positive 6% versus last year. We continue to deliver industry-leading digital results supported by the combination of our structural reset during the pandemic, our increased marketing investments, and our focus on optimizing our channel results. Our digital acquisition for the quarter was approximately 60%, a metric we are very focused on as our millennial mom continues to prefer to shop for her kids online versus in stores.\n\nEvery quarter, we cite our comp store traffic metrics versus 2019, and they are consistently significantly down versus pre-pandemic level, with store traffic in Q3 down 23% versus Q3 2019. The millennial mom's shift to digital was happening long before the pandemic. And now, as we're about to enter our third year since the pandemic first hit, the preference for online shopping by our millennial mom has only increased. Maegan will provide more detail on our millennial mom in her prepared remarks that will further validate that our decision in the early stages of the pandemic to significantly accelerate both our digital transformation and our store closures, resulting in almost a third of our stores closing since the start of the pandemic was clearly the right strategic move for us based on our customers' strong preference for online shopping.\n\nImportantly, in order for us to take full advantage of our millennial mom's preference for digital purchasing, the intense focus and success that we have had in shifting our primary acquisition channel to digital from stores in a remarkably short period of time is a key strategic shift. Continuing to rely on our stores who are experiencing multiyear declines in traffic as our primary acquisition vehicle, when the overwhelming majority of our customer base is a millennial mom who prefers the digital shopping experience, would not have positioned us for future success. Our millennial mom's clear preference for the ease and convenience of shopping for her kids online is here to stay. And we believe our rapid and successful shift to make digital our primary acquisition channel gives us an important competitive advantage as we work to acquire and retain millennial moms and begin to market to the oldest of the Gen Z cohort who are now just starting to become our next generation of parents.\n\nDigital is their highest operating margin channel. And based on the strength of our digital business and our increased investments in this channel, digital is projected to represent an industry-leading 50% of our 2022 retail sales, further cementing our position as a digital-first retailer. Looking ahead, we are projecting digital to represent approximately 60% of our total retail sales by the end of full-year '24 versus 33% of retail sales in 2019, almost doubling our digital penetration in only five years. For several quarters now, we've been discussing the top-line opportunity we believe we have due to the strategic marketing investments we've made since the start of the pandemic.\n\nOver the past couple of years, we've put significant resources behind upgrading and expanding our marketing organization, including our third-party providers, putting new practices in place and implementing new state-of-the-art marketing system. Now that we have the marketing teams, tools, and strategies in place, starting in Q3, we have the confidence to significantly shift our marketing mix toward top-of-funnel initiatives to drive acquisition and brand awareness. So, now, I'll turn it over to Maegan to review our marketing transformation and to share some very exciting, measurable results from our Q3 marketing campaign.\n\nMaegan Markee -- Senior Vice President, Marketing\n\nThank you, Jane. Based on our decision at the start of the pandemic to accelerate our digital transformation and significantly accelerate our store closure program, we knew we needed to also accelerate our marketing transformation at the same time in order to be ready to take advantage of what we believed would be a significantly bigger and stronger digital business coming out of the pandemic. We invested in the team, enhanced our process, and upgraded our tools in order to emerge from the pandemic with a strong digital marketing strategy in place. We began the journey by restructuring our marketing organization across four key areas: customer centricity, marketing mix optimization, resources, and branding.\n\nFirst, customer centricity. For any retailer, it is important to have a deep understanding of your customer. For us, given our high natural churn as our customer is constantly sizing out of our product, it is absolutely critical that we keep up with the wants, needs, behaviors, and expectations of our increasingly digitally savvy customer. The millennial mom makes up the largest and fastest-growing share of our customer base.\n\nShe was born between 1980 and 1995, and she's between 27 and 42 years old. Approximately 80% of new moms in the U.S. are millennials, and over 70% of millennial moms have school-age kids. The percentage of millennial moms is projected to continue to increase for the next two decades.\n\nThe millennial mom values speed and ease when shopping for her kids. Millennials are the most socially connected generation in history and spend an average of 8.9 hours a day consuming media and over 17 hours a week on social networks. They favor Facebook and Instagram and have an average of 3.5 social media accounts. Younger millennials and Gen Zs engage more with new social platforms like TikTok.\n\nMore than 85% of millennial moms spend most or all of their online time on their mobile devices. Our millennial mom relies on search engines, social networks, and online communities for product information and discovery. She uses her phone to search for the best value, the best selection, and the best shipping options. Millennial parents spend 75% more time shopping online and two-thirds more money online than their childless counterparts.\n\nThey are time starved and stressed out, so they put a premium on convenience. Millennials are more committed to online shopping than any previous generation. And a recent study shows that 91% of millennials prefer to shop online. While these statistics I'm citing are critical to understanding the millennial customer, they're readily available.\n\nWe needed a much deeper understanding of our specific customers. So, we launched an in-depth enterprise segmentation exercise in order to better understand our customers. This work included research, persona building, and opportunity sizing, and it has enabled us to target with more precision our current and opportunity shoppers. Our segmentation work has allowed us to deeply understand our customers.\n\nWe have a clear understanding of where they live, how they consume media, what drives them to purchase, and what their channels preferences. Most importantly, this work has also given us a clear blueprint of where to find more of them as acquisition is a critical priority for us. At The Children's Place, our primary customer is a millennial mom with two-plus children at home. We all know who this shopper is, and many of us who work at The Children's Place, are this customer.\n\nThis work has shown us that this digitally native shopper has a strong propensity and preference to transact online versus in-store. This is why, for many years, our strategy has been laser-focused on digital transformation and why it is so important for us now and into the future to be ready to meet the needs of our digitally savvy millennial customer where and when she wants to shop. Second, marketing mix optimization. To truly maximize our opportunity, we need to speak to audiences across the customer funnel: those that are current or past shoppers, those who are aware of our brands but have not yet shopped with us, and those potential buyers who aren't yet aware of our family of brands.\n\nThis requires us to fill the media funnel and ensure our marketing mix or spend reflects that. To do this effectively and efficiently, we put in place a multi-touch attribution tool, a tool that allows the marketing organization to generate real and measurable value in the form of increased revenue and profit through the optimization of marketing investments by channel. Our marketing mix optimization work has given us the road map of how and where we should spend our next dollar to drive the highest return. This best-in-class attribution tool has enabled us to significantly optimize our spend and clearly understand our full-funnel marketing performance.\n\nThird, resources. Over the last two years, we've onboarded top-tier talent and strategic agency partners to help us with our marketing strategy. We optimized teams, bringing areas of specialty together and ensuring transparency and fluidity across all of our channels and brands. Our upgraded team has allowed us to operate with increased speed and accuracy and enables us to make significant progress against our strategic goals.\n\nFourth, branding and brand awareness. We're a trusted brand that offers unique on-trend product at an unbeatable value, but we are so much more than that. We have heritage. We have a story to tell, and we have an engaged audience.\n\nThe branding work that we've started is focused around driving brand awareness, filling the media funnel, and developing cohesive and compelling campaigns that tell our powerful story to an engaged audience. This branding work has led to highly curated brand campaigns that are focused around filling the customer funnel at every stage of the purchase journey, driving growth and brand awareness, fueling acquisition, and increasing brand closeness and desire. Two years into this journey, I can confidently say that we have a strong foundation in place, a great team, strong process, and state-of-the-art tools. But when it comes to driving acquisition and brand awareness, we're just getting started.\n\nSo, let's recap how we've applied our new strategies during the third quarter. We launched our back-to-school campaign on July 26th. Based on our understanding of how children and their education were impacted by the pandemic, this campaign was centered around fostering children's education and making important resources accessible to children across the country. We partnered with actor, author, and philanthropist Kevin Hart for this campaign, as well as supporting partners like Thriftbooks and BIC.\n\nTogether, we set out to revitalize 10 public spaces in local communities across the country and donated books, school supplies, and products to today's youth. Since the campaign launch, which was aimed at driving maximum brand awareness, the brand has garnered over 36 billion impressions across over 600 national and local print, broadcast, and digital outlets. This meaningful campaign was packed with rich photo and video content, which was syndicated and amplified across our owned and operated channels, earned and paid media. This campaign not only showed robust customer engagement defined by our nearly 20 million video views and strong clicks to site, but also in our above-industry benchmark double-digit return on ad spend and top-line sales incrementality that the campaign drove.\n\nMillennials, our largest shopper audience, are social first and look to influencers and celebrities for inspiration. Gen Z follows a similar trend. This is validated by the strong return on ad spend we're experiencing from our celebrity and influencer partnerships. Informed by this knowledge, we planned for and then launched three additional top-tier celebrity campaigns during the third quarter.\n\nIn support of our iconic Gymboree brand, we partnered with actress, singer, and mom Mandy Moore on a holiday collaboration. Gymboree, under our umbrella, is now known as a brand who actively listens and responds to customer feedback. So, it was important for us to deliver against our strong customer feedback from last year by launching our holiday assortment on July 28, over two months earlier than last year's holiday launch. This first-to-market strategy, coupled with our collaboration with Mandy Moore, has yielded impressive results to date.\n\nThe Mandy campaign has driven over 7.7 billion impressions across 310 print, digital, and broadcast placements. The nature of this incredibly emotional photo and video content resonated deeply with our current Gymboree loyalists while also attracting new shoppers in the marketplace, making this our top Gymboree revenue collection in the third quarter. We're incredibly excited to see our brand ambassadorship with Mandy Moore, combined with our strong product assortment, resonate so deeply with so many shoppers. For the second year in a row, The Children's Place brand partnered with the iconic celebrity family known for their love of Christmas: Kris Jenner, Khloe Kardashian, and True Thompson.\n\nThis year, we also welcomed Dream Kardashian to the campaign. Since our Kardashian launch, on September 15th, we've garnered over 7 billion earned media impressions across over 390 placements, making The Children's Place the leading children's retailer on Facebook and Instagram in terms of social awareness. We are really proud of the newest addition to our family of brands, PJ Place. PJ Place, the ultimate sleep destination, brings together all of our branded sleepwear offerings in one easy-to-shop digital-first experience.\n\nFor our current shoppers, PJ Place offers an easy and seamless shopping experience, allowing them to shop sleepwear for their kids, their family, and now, for themselves, while allowing us to cross-promote other branded products from our family of brands. For new shopper audiences, PJ Place enables us to acquire a new generation of young millennial and Gen Z customers in a rapidly growing category. PJ Place gives us the opportunity to engage and build relationships with these young millennial and Gen Z customers before they become parents, providing us the opportunity to maintain these relationships and eventually migrate them to our stable of children's brands when they become parents. We launched PJ Place on October 12th, and in just a few short weeks since launch, we have experienced incredibly positive customer sentiment and industry support.\n\nAs part of the PJ Place launch, we partnered with 16 inspirational powerhouses to champion the PJ Place mission. Since launch, we've driven over 17 billion paid media impressions. When it comes to measuring success on social media, the foundation is about quality of followers versus quantity. Success is defined by follower engagement.\n\nAnd due to our overwhelming response of our celebrity marketing campaigns during the third quarter, our social audience of over 2 million followers on Facebook and over 1 million followers on Instagram drove the highest number of engagements of any children's brand in our industry. Said another way, The Children's Place dominated social media during Q3, with our brands representing 60% of social impressions against our children's apparel retailers' competitive set and taking the No. 1 spot for social media engagement. This is a remarkably powerful accomplishment in a very short period of time.\n\nAnd we're thrilled to see our audiences just as excited and engaged as we are about our celebrity content and our superior product offering. Acquisition is the primary goal of our branding work, and we are extremely encouraged by our strong results. U.S. acquisition during the third quarter of 2022 was up 7% versus Q3 of 2021, which was our highest acquisition quarter ever.\n\nWhen we compare to Q3 of 2019, acquisition was up 29% despite having 30% less stores. We attribute our strong Q3 marketing results to our deep understanding of our millennial customer, our strong product offering, and our compelling brand campaigns that drove new and existing customers through the customer funnel. These cross-functional, customer-centric efforts have affirmed The Children's Place as a market leader in children's clothing and accessories, and within that, the market leader in the special events and holidays in our customers' lives. Now, for an update on our mobile app and our loyalty program.\n\nMobile is the cornerstone of our digital strategy as our millennial mom is connected to her phone. In Q3, 75% of our digital transactions occurred on a mobile device. Our mobile app continues to drive strong customer engagement, especially among our loyal team members who represent 95% of our mobile app transactions. Our mobile app customer spend frequency is 14% higher than our non-app customers.\n\nAnd basket size of customers transacting on the app is 11% higher than our non-app customers. In Q3, our mobile app accounted for 17% of our digital transactions versus only 12% in Q3 of 2021, fueled by an impressive 36% increase in mobile app users over last year, making the mobile app our fastest-growing digital channel. We attribute the significant increase in our mobile app transactions and mobile app users to our targeted mobile app strategies during the second and third quarters of this year. Our loyalty and private label credit programs continue to be strong retention vehicles for our brands, with retention up 8% in Q3 versus Q3 of 2021.\n\nOur consolidated loyalty penetration was 81% of U.S. sales in Q3 versus 77% in 2021, showing meaningful growth across our largest customer base. And our private label credit penetration was 24% of U.S. sales in Q3 versus 23% in 2021.\n\nOur private label credit card customers' annual spend is more than 3.5 times higher than our non-loyalty members, and our loyalty customers ' annual spend is more than 1.5 times higher than non-loyalty members, making these customers a very important part of our overall customer strategy. Moving on to Amazon. To complement our decision early in the pandemic to significantly accelerate both our digital transformation and our store closure plans, we also knew the time was right to accelerate our Amazon initiative. A significant time and resources, including inventory and marketing investments that we've dedicated to building this marketplace over the past two years, has resulted in Amazon delivering another strong quarter.\n\nAs we shared on the last call, our Prime Day results in Q2 reached record high for sales on Amazon. And more importantly, sales continued to build from there throughout Q3. We participated in the first-ever October Prime Day event in Q3, promoting our holiday sleep program, which resulted in the largest day of Amazon sales in our history. Our Q3 Amazon site sales were up 118% to Q3 of 2021, fueled by a 187% increase in traffic over last year.\n\nMarketing is critical to driving the Amazon business, and it is the key driver of the significant traffic increases we're experiencing year over year. My teams take a 360-degree approach to ensuring that our brands are highly visible across all of the consumer touchpoints throughout the entire Amazon ecosystem. Our focus is on maximizing our visibility, optimizing our return on investment, and continuing to drive new customer acquisition through this channel. And these efforts are clearly paying off.\n\nAd-attributed sales for the third quarter were 50% of total sales, with strong double-digit return on ad spend that was more than $6 higher than the Amazon benchmark. Our cost per click was down 37% versus Q3 of 2021, signaling meaningful efficiency gains year over year across our marketing efforts. Another key driver of our success with Amazon is our ability to leverage our celebrity and influencer partnerships across the Amazon site through both paid and organic placements. For example, our holiday sleep collection featuring the Kardashians is off to an explosive start on Amazon, with sleep sales up 233% versus Q3 of 2021.\n\nAs we mentioned on our last call, we launched our iconic Gymboree brand on Amazon in late July. The Gymboree business has built consistently since launch and is continuing to gain momentum, fueled in part by an enhanced advertising strategy built around maximizing the brand's visibility in high-impact placements. In addition, we've leveraged our content with Mandy Moore in order to engage and convert customers in the awareness, consideration, and purchase stages. Gymboree ad performance has been flagged as a case study by Amazon for cold start brands based on the strong performance with over 55% of total sales coming through ad-attributed sales in Q3.\n\nThank you. And now, I'll turn it back over to Jane.\n\nJane Elfers -- President and Chief Executive Officer\n\nThanks, Maegan. As you can clearly tell by listening to Maegan, we're very excited about the results we are achieving through our increased and targeted marketing efforts, and we're even more excited about how we can leverage these learnings to drive results in 2023 and beyond. We're also very pleased with our continued strong results from our Amazon partnership. Through the collective efforts of our entire team and with the help of many of our best-in-class outside providers, we have successfully made the transition to a digital-first retailer, and we're not looking back.\n\nLooking ahead, we have reduced our top and bottom line expectations for the fourth quarter due to the combination of an increasingly challenging macroeconomic environment and continued supply chain cost pressure. Sales for the first two weeks of November were below expectations, and we anticipate that the record levels of inflation impacting our core consumer will continue to result in lower demand this holiday season. We are now planning for a significantly heightened promotional environment in the fourth quarter and we are focused on rightsizing our inventory levels during the quarter and anticipate that due to our planned actions, our inventory will be better positioned and, in Q4, at up approximately high single digits. I'll now turn it over to Josh.\n\nJosh Truppo -- Vice President, Finance\n\nThank you, Jane. And good morning, everyone. After I review our Q3 results, I will provide our Q4 and full-year outlook. For the fiscal third quarter, we delivered and adjusted earnings per diluted share of $3.33 versus $5.43 in 2021 and $3.03 in 2019.\n\nNet sales decreased by $49 million, or 9%, to 509 million versus 558 million in Q3 2021 and decreased $16 million, or 3%, versus 525 million in Q3 2019. Our U.S. net sales decreased by $60 million or 13% to 417 million versus 478 million last year. And our Canadian net sales decreased by $7 million, or 14%, to 46 million versus 53 million last year.\n\nComparable retail sales were negative 10% versus Q3 2021 and positive 7.6% versus Q3 2019. Our Q3 net sales were negatively impacted by the continued slowdown in consumer demand, driven by the unprecedented levels of inflation, combined with increased promotions across our competitive set. As we discussed in our Q2 call, lapping the impact of the enhanced child tax credits, which started last July, combined with the pent-up demand from last year's return to in-person learning, impacted this year's key back-to-school selling season and the impact of permanent store closures, representing approximately $14 million for the quarter. Our net sales were positively impacted by outsized sales growth in our wholesale channel with Amazon.\n\nAnd as Maegan discussed, our successful marketing strategies contributed to our sales beat versus our projection. Our sales by channel were the following. Consolidated digital sales decreased 8% versus Q3 2021, with our digital penetration growing to 50% of our total retail sales versus 48% in 2021 and 37% of retail sales in 2019. Store net sales were down 18% versus Q3 2021.\n\nOur comp store traffic was down 6% versus Q3 2021. However, as a point of reference, store traffic remains significantly below pre-pandemic levels, with comp store traffic down 23% for Q3 2022 versus Q3 2019. Adjusted gross margin decreased 910 basis points to 34.8% of net sales, compared to 43.9% in Q3 2021 and 37.8% in Q3 2019. While our previous outlook had assumed a 600-basis-point decrease in gross margin, we incurred an additional 300-basis-point decline driven by higher transitory supply chain costs in the quarter, including higher container costs and air freight, which has peaked in the back half of 2022.\n\nThe 900 basis points decrease versus Q3 2021 was primarily driven by the following items. First, the sales mix shift to wholesale, which operates at a lower gross margin. We had planned for an increase in our Amazon business in Q3 2022 versus Q3 2021. As a reminder, while our Amazon business operates at a lower gross margin, it is accretive to our consolidated operating margin, delivering operating margins nearly as high as our own digital channel.\n\nSecond, the impact it -- the impact of elevated inbound freight transportation costs driven by higher levels of air freight and higher container rates. As a reminder, unlike many others, we incurred minimal supply chain cost pressure in 2021 due to being in a strong inventory position. Therefore, supply chain costs are more significantly impacting us in 2022 with the peak of those costs happening in Q3 and Q4. With that being said, container costs are moderating, and we will begin to see relief in 2023.\n\nWhile the supply chain continues to negatively impact our results, these elevated costs are transitory in nature, and we believe that signs are pointing to the light at the end of the tunnel for the post-pandemic supply chain challenges, which are expected to moderate throughout 2023. Last, we were impacted by lower merchandise margin versus Q3 2021, driven by significantly higher AUCs that were partially offset by higher AUR. On the positive front, despite lower merchandise margin versus last year, our merchandise margin exceeded our internal expectations, which was driven by higher AUR in the quarter. Over the last few quarters, we had discussed the importance of the structural reset to our business model and P&L since the start of the pandemic.\n\nOne of the key pillars of that reset is our pricing and promotional strategy. Our ability to hold AURs above pre-pandemic levels will continue to have a benefit on the business and drive improved margins. Unlike the transitory supply chain costs, we believe that our pricing and promotion reset is a permanent structural change that will continue to drive our merchandise margins higher versus pre-pandemic levels. We believe that this reset will have an outsized impact as record-high cotton prices decrease and supply chain costs moderate.\n\nIn Q3, we had planned for a 2% AUR increase year over year. Our actual AUR increase was 4%. As a reminder, in Q2, our AUR was flat. As discussed on our last call, the major driver of our flat Q2 AUR was our fashion AUR, which was down negative mid-single digits.\n\nIn Q3, our fashion AUR turned flat. This, combined with our continued double-digit increase in basics UR, resulted in the overall 4% increase for the quarter. Adjusted SG&A was $105 million versus 115 million last year and 117 million in 2019, and deleveraged 10 basis points to 20.7% of net sales compared to 20.6% of net sales last year. The deleverage was driven by the decline in net sales on our fixed expenses and was partially offset by lower incentive compensation expenses and a reduction in discretionary spend.\n\nAs we have continued to experience gross margin pressure from the supply chain, we have and will continue to take actions to reduce discretionary spending. As planned, marketing spend was higher in the quarter, inclusive of investments in brand marketing. Adjusted depreciation and amortization was $12 million in the quarter versus 14 million last year and 18 million in 2019. Adjusted operating income for the quarter was $59 million, a decrease of 58 million versus $117 million of operating income last year and deleveraged 930 basis points to 11.6% of net sales, compared to 20.9% of net sales in Q3 2021 and decreased 50 basis points versus 12.1% of net sales in Q3 2019.\n\nOur adjusted interest expense for the quarter was $3.8 million versus 4 million last year, and our adjusted tax rate was 20.8%. Moving on to the balance sheet. Our cash and short-term investments ended the quarter at $19 million, and we ended the quarter with 265 million outstanding on our revolving credit facility. Additionally, we made progress on inventory levels during the quarter.\n\nWe ended Q3 with $549 million of inventory, or up 24% versus last year, compared to our Q2 ending inventory of $616 million, or up 34% versus last year. The increase in inventory versus last year is driven by higher costs, including higher AUC, driven by cotton and higher inbound transportation costs. Our basics inventory, which includes several key high-volume categories with limited to no markdown risk, accounted for approximately 50% of our on-hand inventory at the end of the quarter. Moving on to cash flow and liquidity.\n\nWe generated $36 million in cash from operations in Q3 versus 71 million last year. Capital expenditures in Q3 were $12 million. During the third quarter, we repurchased 434,000 shares for $18 million, leaving 178 million outstanding on our current authorization. Year to date, we have purchased 1.6 million shares, which represented approximately 12% of our total outstanding share count.\n\nNow, I will provide an update on our store activity in the quarter. We did not close any locations in the third quarter, and we now plan to close between 40 to 50 stores for full-year 2022. We continue to carefully evaluate our store fleet and close lower-volume unprofitable stores. With over 75% of our fleet coming up for lease action in the next 24 months, we are maintaining meaningful financial flexibility in our lease portfolio.\n\nThese short-term leases will continue to provide us with the flexibility to optimize our occupancy costs. We ended the quarter with 658 stores and total square footage of 3.1 million square feet, a decrease of 7% compared to Q3 2021 and 30% versus Q3 2019. With respect to our fleet optimization strategy, it's important to continue to highlight that, for 2022, we are planning for 50% of our retail sales to come from our stores, with 50% of our store sales coming from traditional malls and 50% coming from off-mall. With our digital business also planned an industry-leading 50% of total retail sales, we are planning for 75% of our retail sales from off-mall, strongly supporting our structural reset to a digital-first retailer.\n\nNow, let me take you through our outlook for Q4 and fiscal 2022. Moving on to our Q4 outlook. Our revised Q4 outlook reflects significant headwinds, the biggest of which is the macroeconomic environment and continuation of record inflation. While inflation has impacted our business all year, this is the first holiday shopping season experiencing this 40-year-high inflation.\n\nAs we have said previously, the average income demographic of our core customer is one that is the most heavily impacted, particularly by elevated food and fuel prices. Our revised outlook reflects these current economic conditions and the likelihood of a challenging season. Additionally, we are now planning for a significantly heightened promotional environment in the fourth quarter, and we are focused on rightsizing our inventory levels during the quarter. We now anticipate that, due to our planned actions, our inventory will be better positioned at approximately up high single digits in Q4.\n\nIt's important to know the vast majority of our current on-hand inventory has been impacted by the higher freight and supply chain costs. Therefore, we will continue to experience these higher costs as we sell through that inventory in Q4. The company now expects net sales for the fourth quarter to be in the range of $460 million to $470 million, representing a low-teens percent decrease in comparable retail sales versus Q4 2021 and an approximately flat comp versus Q4 2019. Adjusted operating income is expected to be in the range of 2.5% to 3.3% of net sales as compared to 12.1% in Q4 2021, primarily driven by the decrease in sales and gross margin.\n\nThis compares to 6.9% in Q4 2019. We anticipate fourth-quarter adjusted earnings per diluted share to be in the range of $0.50 to $0.75 as compared to adjusted earnings per diluted share of $3.02 in Q4 2021 and $1.85 in 2019. We anticipate that the Q4 2022 gross margin rate will experience a similar year-over-year decrease as Q3. Approximately half of this decrease will be driven by elevated freight and supply chain costs, while the other half will be driven by the rightsizing of inventory levels and the significantly heightened promotional environment.\n\nWe continue to plan for higher marketing investments in Q4, which we believe will continue to support our sales and acquisition goals, as Maegan discussed earlier. We are planning for capital expenditures of approximately $10 million for the quarter, the majority being allocated to support digital and supply chain fulfillment initiatives. Moving on to our full-year outlook. For fiscal 2022, the company now expects net sales to be in the range of $1.713 billion and $1.723 billion, reflecting a low double-digit decrease in comparable retail sales versus fiscal 2021 and a positive low single-digit comp increase versus full-year 2019.\n\nWe project that e-commerce penetration will increase to approximately 50% of total retail sales for full-year 2022 versus 46% in full-year 2021 and 33% in full-year 2019. Adjusted operating income is expected to be in the range of 4.7% to 4.8% of net sales, as compared to 15.1% in 2021 and 6% in 2019. We anticipate fiscal 2022 adjusted earnings per diluted share to be in the range of $4.05 to $4.30, as compared to $13.40 in 2021 and $5.36 in 2019. We are planning for a full-year tax rate of approximately 23%.\n\nThank you. And we will now open the call to your questions.\n\nOperator\n\n[Operator instructions] One moment while we queue. We'll take our first question from Dana Telsey of Telsey Advisory Group.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nHi. Good morning, everyone. Welcome, Sheamus. Nice to see you again or hear you again. \n\nSheamus Toal -- Senior Vice President, Chief Financial Officer\n\nThank you, Dana.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nWe'd love to start -- we'd love to get some more color. As you see the current environment and the consumer, is there a difference whether it's online, whether it's urban areas, suburban areas, malls, whether it's rural, how are you seeing the consumer -- consumer? How did it differ? And then, on supply chain, how do you think about supply chain costs and the progress for you guys going forward into '23? Thank you. \n\nJane Elfers -- President and Chief Executive Officer\n\nSure. Well, I think from the -- as far as stores versus online, we are certainly seeing, you know, significant traffic challenges in all of our stores. Our outlets are performing slightly better in Q3 than our stores did, and we think that probably has something to do with the inflationary pressure on our consumer and seeking out deals in the outlet centers. As Maegan discussed and I discussed in the prepared remarks, the digital business has held up very well.\n\nWe had increased traffic. So, we're feeling good about where digital is headed. As far as supply chain, you know, we are under significant supply chain cost pressures, and we've been calling these out all year. You know, again, in Q3 we had, you know, 300 basis points, as Josh called out, of additional \"unplanned,\" if you will, supply chain costs.\n\nAnd I think, you know, in looking at The Children's Place, when you look at what happened to us last year, we had very, very little supply chain pressure. And unlike, you know, most, if not all other retailers in our competitive set, we didn't call out supply chain cost pressure in 2021 because of our inventory position. As -- as you remember, you know, we were in really good shape with basics going into the back half of 2021 because we had them from the year before when the pandemic hit and kids didn't go back to school. So, we weren't scrambling for containers, we weren't scrambling to put our goods on airplanes.\n\nAnd, you know, like I said, we were in a strong inventory position. So, it is really, really showing up this year in the gross margin how these costs are really kind of rocking us. And so, we don't have the cushion from last year. You know, we don't have a cushion of having spent $50 million on AUR last year.\n\nAnd so, we're really, really seeing those peak costs. Now, you know, this is the peak year certainly for the AUC from cotton for the input costs, and this is the peak year for supply chain costs. You know, the good news is cotton is moderating, and the good news is the supply chain costs are moderating. And getting into the back half of '23, we're going to see significant progress on both those two fronts.\n\nWe're going to live with these supply chain costs into Q4, which Josh mentioned. You know, we're looking at another 900 basis points of gross margin pressure in the quarter, pretty much evenly split between March margin pressure from the competitive environment and what we anticipate to be a much, much more promotional environment. What we've seen in the last two weeks of October, certainly in the first two weeks of November, is a significantly changed consumer and a significantly changed promotional environment. So, we are going to focus on moving through our inventory and ending the quarter clean with no pack and hold.\n\nAnd we are going to continue to absorb supply chain costs in the quarter. So, that's really how we see it. You know, like I said, the good news is both of them are abating. And when we get to the back half of '23, I think that will be on a -- you know, a much better path toward higher up margin and EPS results.\n\nOperator\n\nWe'll take our next question from Jim Chartier of the Monness, Crespi, Hardt.\n\nJim Chartier -- Monness, Crespi, Hardt and Company -- Analyst\n\nGood morning. Thanks for taking my questions. I understand, you know, the level of, you know, freight inflation, but just kind of surprised, I guess, why were you so surprised by the level of costs. It seems like something you would have had visibility into in August.\n\nSo, just, you know, hoping you provide more detail on -- on what happened in the last three months and then why this was such a surprise.\n\nJosh Truppo -- Vice President, Finance\n\nYeah. Jim, I think, you know, as I called out in my prepared remarks, out of the 900 basis points, there is about 300 basis points that we didn't expect. A vast majority of that is the incremental freight. As Jane mentioned, we continue to navigate through what was still a very volatile supply chain environment.\n\nWe incurred more freight than we had planned and sold through the merchandise that we received really at a higher level of freight. So, you know, from that perspective, that's, you know, the biggest piece of that 300-basis-point decline. And the other piece of that 300-basis-point decline, while it's a smaller piece, relates to our distribution center, again, still under the realm of supply chain. But in late September, we had a significant influx of orders, and we had to move more of our orders to our third-party fulfillment, which we fulfill at a slightly higher cost.\n\nSo, you know, as Jane mentioned, from a -- from a freight and supply chain perspective, you know, we think, go forward, as we provided in Q4 and you saw our guidance, obviously, you know, we have captured the cost that we feel we're going to absorb in the P&L as we continue to sell through the higher freight inventory and. again, really get aggressive to -- to end 2023 -- I'm sorry, end 2022 in a rightsized and really clean inventory position.\n\nJim Chartier -- Monness, Crespi, Hardt and Company -- Analyst\n\nOK. And I guess -- I mean, do you -- I mean, a lot of companies lock in freight costs, you know, container costs, on an annual basis. I guess, how are you approaching that? And, you know, are you going to negotiate [Inaudible] next year, and when would that happen?\n\nJosh Truppo -- Vice President, Finance\n\nYeah. So -- so, you know, we're seeing in the market, as others are, supply chain costs moderating now, Obviously, that doesn't impact our inventory that we're going to sell through in '22 and even, to an extent, in the first part of 2023. But we are starting to capitalize on the slightly lower container costs, which we are seeing out in the market. And as Jane mentioned, really when we're going to see the significant impact of those moderating supply chain costs is going to be in the back half of 2023.\n\nJim Chartier -- Monness, Crespi, Hardt and Company -- Analyst\n\nOK. And then just, you know, on Amazon, you know, what -- you know, what do you think the growth rate is going forward? And, I guess, where are you in terms of maximizing the potential of that opportunity?\n\nJane Elfers -- President and Chief Executive Officer\n\nYeah. I mean, I'll let Maegan talk about the potential with Amazon and the opportunity. I think, from a numbers point of view, you know, we talked a little bit about picking up, you know, a nice chunk of business in Q3. We haven't really given the Amazon, you know, revenue metric.\n\nSo, we're not going to do that today. But from an opportunity point of view, Maegan, if you want to comment on that.\n\nMaegan Markee -- Senior Vice President, Marketing\n\nYeah. I mean, I think, longer term, we believe there's a significant amount of growth opportunities still sitting in this partnership. There's an incredible amount of white space in the kids business in Amazon. And really, until now, there hasn't been a leading brand in the kids category.\n\nOur product, the depth and breadth of our assortment, is really unmatched in the industry and certainly in the Amazon marketplace. And I think when we look at the incredible return on investment that we're seeing in our marketing investments and the efficiencies that we're gaining, it's signaling a significant amount of headroom for our brand. So, I think, at this point, you know, we don't even really know how high is high, and we're anticipating that this business will continue to grow for all of our brands on the Amazon marketplace.\n\nOperator\n\nWe'll take our next question from Jay Sole of UBS.\n\nJay Sole -- UBS -- Analyst\n\nGreat. Thank you so much. Jane, can you just talk a little bit more about the promotional environment,? You know, how much is it being driven by traffic may be slowing and the consumer being weaker and how much is it being amplified by just the, you know, the unusual levels of inventory and all of your competitors and what they're doing and how much more promotions you have to do to get your inventory -- inventory back to where you wanted it to be?\n\nJane Elfers -- President and Chief Executive Officer\n\nYeah, I think, Jay, that we really saw a drop-off in business in the last two weeks of October. We had a really nice trend going, you know, from the mid-September to mid-October when the colder weather hit and also driven by the marketing campaigns. And then, like we said, we saw a pretty precipitous drop-off in end of October and we got more promotional. If you go on our website, you can see we're in a 60-off event, which we haven't been in all year.\n\nThere is definitely heightened promotions from our competitors that we're aware of. I think, at the end of the day, when you look at the last two weeks of October and the first two weeks of November and what's happened to business, you just -- you know, it's undeniable that, for our customer at least, that, you know, dealing with the 40-year record-high inflation is definitely eroding our -- you know, our core customer spending power, if you will. You know, our customer is in a position now where they're going to have to make choices between discretionary spend and, you know, essential spend. Food's up, gas is up, you guys know that.\n\nThey have less savings than they did a year ago, and they have less money to allocate. So, she's in a different place than she was last year when she had stimulus. There was pent-up demand, you know, supply chain shortages. None of that is really happening this year.\n\nSavings are leaner and we've really seen her curtail discretionary spend. So, our focus in Q4 is to really end clean. We have high AUC goods right now, which, you know, and you can see, you know, that's showing up quarter after quarter and these supply chain pressures. So, our focus is to really -- you know, to deal with the challenge of the inflation, is to ramp up our promotions to stay competitive, you know, number one; and stimulate more discretionary spend, if you will, from what is, you know, now an extremely price-sensitive consumer.\n\nSo, we see the balance of Q4 being very promotional. You know, we'll know a lot more when we get to next year and we start to see, you know, what happens on those real promotional days of Black Friday and Cyber Monday. We anticipate going into December and, you know, seeing a lull, particularly in the, you know, first part of the month. And, you know, we'll see what happens in Christmas and then, you know, particularly post-Christmas when the sales are on.\n\nBut we are not -- you know, hope is not a strategy, and we are not feeling that the customer is going to come roaring back, you know, this quarter. So, we are going to get those inventories cleaned. You can see it in our guidance. We're going to move through it, we're going to stay competitive, and we're going to do what we can to, like we said, you know, kind of see if we can get some more discretionary spend out of what is a very strapped consumer at the moment.\n\nOperator\n\nWe'll move next to Marni Shapiro of Retail Tracker.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nHey, guys. A lot of my questions have actually been answered, but I just have a couple quick follow-ups. The holiday line and the pajamas look outstanding. So, this is clearly not a product issue.\n\nThis is, like you said, your customer pulling back. But it sounds like you're saying that the worst of your expenses are now -- have peaked, and it's starting to abate heading into '23. If you could just confirm that's what we were hearing. And then, I guess, could you talk a little bit just about the marketing costs and how we should think about this going into '23? Have -- are you seeing any abatement in the marketing costs from, you know, social media, for example? Facebook and Instagram marketing costs have gone much higher.\n\nYou guys are spending more there. So, if you just walk us through what that looks like in '23 as well.\n\nJane Elfers -- President and Chief Executive Officer\n\nSure. You know, I think we have answered some of those, Marni. You know, we have a lot of macro challenges that are impacting us this year in 2022. You know, we talked about decade-high cotton prices, decade-high AUCs.\n\nSo, the good news is cotton is moderating, and we're going to start to see that in the back half of '23 with the back-to-school buys. You know, we're coming out of a 100-year pandemic. The good news is those effects are starting to moderate as well. We've talked pretty extensively this morning about supply chain costs, and I assume we'll continue to talk about them.\n\nBut this is the peak year for them, and certainly, Q4 is the peak quarter for them. And so, we will do what we need to do to get out -- get our inventories clean and start to see those supply chain costs start to moderate in 2023. You know, we've spoken about inflation. We've spoken about where our customer is.\n\nCertainly, you know, they have one bucket of spend and a higher and higher piece of it is going toward necessities. So, we'll do what we can to stimulate, you know, the discretionary buying as we talked about. You know, I think the good news is, you know, there's a lot more opportunities. We have a lot more long-term opportunities than we do short-term challenges.\n\nSo, we covered a lot of them today. We've covered it this year. You know, we're a different company than we were before the pandemic. We've been on offense for the last three years.\n\nWe've restructured the company. And, you know, what I would consider I guess -- you know, I've been in the business for a long time. I would say that this is, you know, certainly the most challenging time, you know, I've felt in retail history. And so, you know, staying on offense has been important for us.\n\nYou know, you look back at what we do from a product point of view, we've launched, I guess, Maegan, three brands?\n\nMaegan Markee -- Senior Vice President, Marketing\n\nThree brands.\n\nJane Elfers -- President and Chief Executive Officer\n\nSince -- three brands since the start of the pandemic. You know, we've talked about making the pivot to a digital-first company. 50% of our business this year is going to come from digital, 60% by the end of '24. It's our highest operating margin channel.\n\nOur Amazon business is surging. The marketing function is working. It's measurable. We're acquiring new customers at a healthy rate.\n\nYou know, our brand awareness metrics are exploding. You know, we talked about today in the call pivoting to a -- like, a digital acquisition model, if you will, from a store acquisition model in what we think is a pretty remarkably short period of time, keeping up with where the millennial customer, which we spoke a lot about today, wants to be and wants to shop. You know, Maegan brought up social media and I'll have Josh answer your question about spend. But we've gotten a lot, lot smarter about spend.\n\nIt's not about necessarily spending more, which we will be in '23, but it's about spending what we have smarter. And you look at the campaigns that we launched. And, you know, you brought it up about Christmas and you brought it up about, you know, holiday Christmas dress-up in the holiday sleepwear. When you look back at the campaigns that Maegan spoke about, those are two of our largest campaigns with the quarter, and those are two of our strongest businesses.\n\nSo, we just absolutely dominated social media across the entire kids set, which, you know, Maegan gave you the numbers on. You know, we're holding on to the AUR increases versus pre-pandemic. So, when cotton comes down in the back half, that's going to be really important that we have those double-digit increases. And, you know, our product, which we don't talk about enough, is -- you know, continues to resonate with our customer.\n\nAnd, you know, thank goodness, mom loves our product. And then, you look at some of the structural changes to the P&L, we've closed a third of our stores. We've gotten significant [Inaudible] fixed expense. So, there is a lot more going for us than the short-term challenges of high cotton prices and high supply chain costs that are going to, you know, be in the rearview mirror in the back half of '23.\n\nSo, we're just going to keep doing what we're doing. We're going to keep focused. We're going to keep our head down. We're going to stay on offense.\n\nAnd, you know, we'll get through this. You want to talk about marketing spend?\n\nJosh Truppo -- Vice President, Finance\n\nYeah, sure. You know, we have historically, and we've said this before, underfunded marketing. And to Jane's point, from a year-over-year perspective, in '22, our marketing investment is not significantly higher. One thing we are doing -- and Maegan talked about her third-party providers and the tools that we brought on -- we're definitely getting more out of our dollar, right? We're increasing our marketing effectiveness, which obviously is a very important piece of our P&L and optimizing that marketing spend.\n\nAs you move forward into 2023, you know, we expect to take a small portion of all of these transitory costs that we're experiencing and reinvest into marketing to really get that marketing spend up to the levels that we need to be at as a 50% digital-first retailer. So, that's kind of how we're thinking about marketing investment.\n\nOperator\n\nThank you for joining us today. If you have any further questions, please call investor relations at 201-558-2400 extension 14500. You may now disconnect your lines and have a wonderful day.\n\nDuration: 0 minutes\n\nJane Elfers -- President and Chief Executive Officer\n\nSheamus Toal -- Senior Vice President, Chief Financial Officer\n\nMaegan Markee -- Senior Vice President, Marketing\n\nJosh Truppo -- Vice President, Finance\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nJim Chartier -- Monness, Crespi, Hardt and Company -- Analyst\n\nJay Sole -- UBS -- Analyst\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nMore PLCE analysis\n\nAll earnings call transcripts"
}