{
  "companyName": "Ciena",
  "companyTicker": "CIEN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/ciena-cien-q3-2022-earnings-call-transcript/",
  "content": "Ciena (CIEN 0.49%)\nQ3 2022 Earnings Call\nSep 01, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day and thank you for standing by. Welcome to the Ciena fiscal third quarter 2022 financial results conference call. At this time, all participants are in a listen-only mode. After the speaker's presentation, there will be a question-and-answer session.\n\n[Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Gregg Lampf, vice president, investor relations. Please go ahead.\n\nGregg Lampf -- Vice President, Investor Relations\n\nThank you, Michelle. Good morning and welcome to Ciena's fiscal third quarter 2022 results conference call. On the call today is Gary Smith, president and CEO; and Jim Moylan, CFO. Scott McFeely, our senior vice president of Global Products and Services, is also with us for Q&A.\n\nIn addition to this call on the press release, we have posted to the investor section of our website and accompanying investor presentation that reflects this discussion as well as certain highlighted items from the quarter. Our comments today speak to our recent Q3 performance, our view on the current demand environment and supply chain conditions, as well as discussion of our financial outlook. Today's discussion includes certain adjusted or non-GAAP measures of Ciena's results of operations, a detailed reconciliation of these non-GAAP measures to our GAAP results is included in today's press release. Before turning the call over to Gary, I'll remind you that during this call, we'll be making certain forward-looking statements.\n\nSuch statements, including our quarterly and annual guidance, discussion of market opportunities, and commentary about supply chain constraints on our business results are based on current expectations, forecasts, and assumptions regarding the company and its markets, which include risks and uncertainties that could cause actual results to differ materially from the statements discussed today. Assumptions relating to our outlook, whether mentioned on this call or included in the investor presentation that we'll post shortly after, are an important part of such forward-looking statement statements and we encourage you to consider them. These statements should be viewed in the context of the risk factors detailed in our most recent 10-K filing and in our upcoming 10-Q filing, which is required to be filed with the SEC by September 8. We expect to file by that date.\n\nCiena assumes no obligation to update the information discussed in this conference call whether as a result of new information, future events or otherwise. [Operator instructions] With that, I'll turn it over to Gary.\n\nGary Smith -- President and Chief Executive Officer\n\nThank you, Greg, and good morning, everyone. Today we reported lower than expected fiscal third quarter financial performance, including revenue of $868 million and adjusted gross margin of 40%. In a moment, I will discuss the specific supply chain challenges that impacted our results and our continued actions to mitigate their effects on our customers and their business. Before doing so.\n\nHowever, I think it's important to understand the context of the current environment as it relates to Ciena and specifically demand. Despite supply chain challenges and elongated lead times, strong secular demand trends show no signs of abating. And we remain confident that the fundamental macro drivers propelling this demand are durable over the long term. As we all know, these include 5G, cloud, and automation in addition to infrastructure spending, residential broadband funding, and opportunities to displace Huawei.\n\nThe combination of these secular drivers and our market leadership, including our technology, investment capacity, and global scale, is driving continued robust demand from customers in both absolute and relative measures. In fact, we had nearly 60% order growth in our last four quarters versus the same prior four-quarter period. In Q3, specifically, orders outpaced revenue by more than 30% and we continue to grow our backlog, which is now well over $4 billion. And we project further growth in our backlog in Q4.\n\nObviously, as we convert this large backlog to revenue and continue to win new business in a strong demand environment, we have confidence in continuing to gain market share as the supply chain challenges ameliorate. Let me talk about supply chain. In the face of this strong demand, challenging supply chain conditions persist. I would like to note that at a high level, the majority of our suppliers are delivering to their promised, albeit extended lead times, and we are also starting to see higher volumes.\n\nAnd I think this is sort of consistent with recent market commentary that has pointed to some signs of improvement in the overall supply environment. However, we have recently been challenged by the unpredictable performance of specific vendors and their associated component traits. And when we spoke to you after our second quarter, our outlook for the remainder of the year reflected commitments made to us by our suppliers in early June, which a very small number of them did not meet. Specifically in the second half of our Q3, we experienced substantial delays and lower than expected component deliveries from this very small group of suppliers.\n\nThese late-notice decommits were primarily for certain integrated circuit components that represent a very small fraction of our overall materials. However, these delays and decommits impede our ability to build and deliver finished goods and systems such as modems for our customers and ship product for revenue. Put another way, this relatively small number of low cost, low value components is holding up a disproportionate amount of revenue, primarily for our optical modems. As a result, our Q3 revenue and adjusted gross margin were both negatively impacted to a significant degree.\n\nAnd to size this for you. But for this specific challenge, we would have been at the high end of our revenue range and in line with consensus gross margin expectations for Q3. I would also say that certain of these supply dynamics have continued into our fiscal fourth quarter and are expected to negatively impact that current quarter's results, which Jim will discuss shortly. We remain very focused on our investments and actions to minimize the impact of these challenges on our customers.\n\nFirstly, we are working very closely with this small number of partners to resolve these acute challenges around delivery commitments and volumes. Secondly, we continue to qualify engineering alternatives to expand our sources of supply and to pursue product redesign activities. And thirdly, we continue to invest in our readiness with respect to contract manufacturing capacity as well as our inventory levels to be prepared when these components do arrive. As a reminder, we also continue to place large advance purchase commitments in their various forms, pay premiums and expedite fees, and access the broker market to secure additional supply.\n\nWell, these actions have obviously been ongoing for a long time and their benefits take time to be fully realized, we believe that we will start to achieve an improvement in volume and predictability with our suppliers as we move into fiscal 2023. At the same time, it's important to stay focused on the investments that we're making in our long-term strategy to further open the aperture of our addressable market. Our portfolio and solutions offerings are at the heart of our customers network priorities, and our innovation has never been stronger or more competitive than it is today, evidenced by the strong order flows. In optical in Q3, we added 14 new customers for WaveLogic 5 Extreme.\n\nAnd despite the supply challenges, we had a record number of quarter for our WaveLogic 5 shipments, bringing our total WaveLogic 5 Extreme modems shipped to date to more than 44,000. And for WaveLogic 5 Extreme specifically, Q3 was strong with North American Tier 1 service providers as well as webscale customers. Also in the quarter, we were awarded sole vendor status with a large international Tier 1 service provider for a major network upgrade. I would also say that our switching and routing revenue grew 45%, not all organic, year over year as we continue to capture additional opportunities and expand our TAM in this important area with our differentiated Adaptive IP approach, which is clearly resonating with customers.\n\nIn Q3, we added 25 new Adaptive IP customers, bringing the total to nearly 200, as customers continue to seek alternatives to many traditional legacy IP vendors. Of those new customers, many were wins in key new areas, including 5G XL, cell site routing, residential broadband, and in enterprise with the uCPE SD-WAN solutions. Of particular note is the momentum with our Universal Aggregation and PON solution, where our customer count has grown significantly this year and we are now expanding globally. Indeed, as you can see in our Q3 results, our routing and switching portfolio has not been impacted to the same extent by supply chain challenges, certainly when compared to our Converge packet optical segment.\n\nAnd I think this is consistent with some of the more positive recent commentary from others in the packet IP space. Overall, we have tremendous momentum in the combination of significant secular demand drivers, our leading portfolio, and our TAM expansion opportunities. The business has never been positioned better. As we are increasingly able to service the unprecedented demand, we are confident in our ability to continue to gain share and expand addressable market.\n\nWith that, I'll turn it over to Jim.\n\nJim Moylan -- Chief Financial Officer\n\nThank you, Gary. Good morning, everyone. As Gary mentioned, revenue in Q3 came in at $868 million, reflecting the impact from the late and incomplete delivery of key components by small number of suppliers. Adjusted gross margin was 40% in Q3, which was at the low end of our range.\n\nOverall, gross margin continues to reflect the negative impact of higher component costs and expedite fees. In addition to that dynamic, in Q3, gross margin performance also reflects the specific supply chain in the quarter as the key components mentioned before, primarily related to our higher margin modem technology. Had it not been for the lack of those key components. Revenue would have been approximately $60 million higher in the quarter and at the high end of our outlook range and adjusted gross margin would have been in line with expectations.\n\nAdjusted operating expense in the quarter was $273 million. This is below our expected range. During the quarter, we reduced our accrual rate for our annual incentive compensation plan given our expected financial performance for the year. With respect to profitability measures, in Q3, we delivered adjusted operating margin of 8.5%, adjusted net income of $49 million and adjusted earnings of $0.33 per share.\n\nIn addition, in Q3, cash used for operations was $205 million, free cash flow was a use of $227 million, and adjusted EBITDA was $96 million. We ended the quarter with approximately $1.3 billion in cash and investments. On the balance sheet, our current inventory levels reflect the current demand environment as well as the impact of the supply dynamics Gary mentioned. Since 2021, we have been ordering all of the components and subassemblies required to meet our backlog based upon vendor published lead times and other than a handful of vendors, the supply chain is delivering at 90% reliability.\n\nLack of performance by that handful of vendors is preventing deliveries to customers. Therefore, we are accumulating components while we wait for delivery of those specific remaining items that are necessary to produce finished goods. We expect our inventory levels to reduce over time as the delivery performance for these key components stabilizes. Finally, in Q3, we repurchased approximately 3.2 million shares for $155 million.\n\nWe have now completed our goal of repurchasing $500 million in shares in fiscal 2022. With respect to guidance, as we said last quarter, in today's market environment, our revenue is not a function of demand. It is a function of supply. And as Gary said, and we've repeated, we have a very small number of suppliers that are not meeting their commitments or our expectations in terms of delivery times and volumes for a handful of low cost, low value parts.\n\nThese decommits are having a disproportionate impact on our revenue. We saw that in Q3 and we are seeing these dynamics continue in Q4. As a consequence, in Q4, we expect to deliver revenue in a range of $800 million to $880 million. This range is lower than previously expected and incorporates a wider set of potential outcomes, reflecting our expectations for a continuation of key component supply challenges in the quarter.\n\nAdjusted gross margin of approximately 40%. We expect similar dynamics to impact gross margin in Q4, including lower modem volume and continued higher component costs and logistics expenses. And finally, adjusted opex of approximately $315 million. This reflects a return to more normalized levels from the atypical Q3.\n\nQ3, as I'll remind you, was below our original outlook due to the reduction in the accrual rate for our annual incentive compensation plan. Additionally, in Q4, we expect a higher level of variable sales compensation reflecting the extraordinary level of demand we've described. For the year, we will be approximately on the guide we gave at the beginning of the year, absent the changes in our annual incentive compensation plan, which I discussed. As we look to next year.\n\nWe remain set up well for outsized growth next year and continue to expect to deliver revenue growth significantly above our annual long-term target of 6% to 8%. The strong demand environment and our backlog reinforce our confidence in these expectations for fiscal year '23. And our current revenue expectations for 2023 remain at the level we referenced when we reported Q2 90 days ago. With that will now take questions from the sell-side analysts.\n\nMichelle?\n\nOperator\n\n[Operator instructions] The first question comes from George Notter with Jefferies. Your line is now open.\n\nGeorge Notter -- Jefferies -- Analyst\n\nHi, guys. Thanks a lot for the question. I guess just sort of stepping back and looking at the bigger picture here, can you talk about how you're dealing with these issues in terms of customer conversations? I guess one thing I'm curious about is just on a relative basis, it seems like you guys are doing worse vis a vis your competition in terms of deliveries here. And I'm kind of wondering is this going to impact your long-term market share, long-term opportunity for Ciena? Like, how permanent do you think the damage is here in terms of your customer relationships?\n\nGary Smith -- President and Chief Executive Officer\n\nSo, George, let me let me take that. I mean, I think -- listen, we've got very close relationships with all of our customers, many of which go back -- some of which go back decades. So I think we have strong degrees of trust and transparency with them. And we can only talk about what we see in terms of the challenges from a supply chain point of view and the difficulties that we're encountering now but we've been very transparent with them.\n\nand I think the best way of sort of answering that, and sort of summary, George, is really we're continuing to see very robust orders. We've not seen cancellations. We've seen orders continue to well outstrip revenue. And the statistic that I kind of shared about 60% year-on-year order growth for the last four quarters, that's sort of testament to it.\n\nAnd they understand the challenges that we're having. But I think because of our technology and our relationships, we believe that when all of the smoke clears from all of this and begins to ameliorate, that we will actually gain share given the outsized demand that we that we set.\n\nGeorge Notter -- Jefferies -- Analyst\n\nGot it. [Inaudible]\n\nJim Moylan -- Chief Financial Officer\n\nGeorge, on the vendor side, I can tell you that we do see some improvement on most components. In fact, for the majority of our vendors -- for everyone except these key components that we're talking about, we're seeing about a 90% deliverability performance against promised lead time, which is pretty good. So we're focused, of course, on this very small number, less than a handful of vendors that are not delivering. In fact, they're there have been they've been quite unreliable and have caused us great difficulty.\n\nWe're dealing with them appropriately at all levels of the company. We're hoping that that performance improves as we move through time. Then in the meantime, we're taking a lot of steps to to deal with it in case it doesn't, such as we specify parts on our boards, etc.\n\nGeorge Notter -- Jefferies -- Analyst\n\nYeah, that's what I wanted to ask you about. So where are you in the process of redesigning these components out? How many components specifically are we talking about? When might those redesigns be done? Just give us any more detail there. That would be great.\n\nScott McFeely -- Senior Vice President, Global Products and Services\n\nGeorge, it's Scott. So just in terms of dimensioning it, and Jim said the vast majority of the supply chain is pretty much delivering to the promises. We're talking about a very focused set of components here. And to put it in perspective, when we say that it's a couple of handfuls of component parts on a handful of vendors.\n\nObviously, we have a significant amount of redesign work going on as a vehicle to get out those problem components in addition to working with the existing component suppliers to get a better answer out of them as well. On the design side, George, there's -- they fall into two categories. One is is a sourcing exercise where you may be able to find alternative components that are plug replaceable. In that case, you still have to get in line to lead times from those component providers but it's a less of a heavy lift on our side.\n\nThe second category, of course, is where you need to redesign in order to take advantage of those component parts. And those are hardware redesigns and those are multi-quarter activities. All of that activity, I think, starts to come on board in 2023 and we'll start to see a gradual benefit from that as we go throughout the year, in addition to continuing to work with the existing component suppliers.\n\nGary Smith -- President and Chief Executive Officer\n\nAnd to be clear, again, these handful of suppliers has been very reliable in the past. This is a new phenomenon. Of course, we're in unusual times, but when we have spoken to guidance in past quarters, we have always based our expectations of revenue upon their published lead times and the fact that they have met those lead times in the past. So that's how we came up with our view of the world.\n\nAnd that's why we've got it where we have.\n\nScott McFeely -- Senior Vice President, Global Products and Services\n\nYeah, and a number of those vendors, George, they supply multiple parts to us. And in many cases, the -- many of their parts are performing as they promised. This is a very focused subset.\n\nGeorge Notter -- Jefferies -- Analyst\n\nOK. Thank you, guys.\n\nOperator\n\nOur next question comes from Meta Marshall with Morgan Stanley. Your line is now open.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Maybe just kind of jump in on George's question, is there a way to size kind of the impact of products already redesigned. So we can just get a sense that given that we're a year through this that you've already redesigned and that's made X number of revenue available just to kind of balance out some of the downdrafts that we're seeing. And the second piece would be just as you kind of continue to express confidence in fiscal '23, I mean, what what are you basing kind of that confidence on would be helpful.\n\nThanks.\n\nGary Smith -- President and Chief Executive Officer\n\nWhy don't I answer that second part first, Meta. We're basing that confidence on, first of all, incredible visibility in backlog. So that's number one. Number two, the actions that we've taken, which are multifaceted and we're trying to get out ahead of this.\n\nThis is not a reactive piece. I mean, we've talked about this for a while. We knew that demand was going to increase substantially this year. And we planned, as we shared with you, for well double-digit growth this year.\n\nAnd we took a lot of what we thought were the right supply chain actions in place for that in terms of placing orders, in terms of actually engineering work to reduce our dependency. Those things start, I think, to kick in as we come out of this year into '23. And while we're cautious, given the impact that we're seeing both in Q3 and Q4, we believe that they will ameliorate from the actions that we've taken and the work that our partners are doing also to ameliorate the issue. So we have very good confidence as we turn the year that this will start to improve.\n\nIt won't be an on/off switch. It will be a process that improves as we starting in Q1 but it does give us confidence in the early start to grow out of this.\n\nScott McFeely -- Senior Vice President, Global Products and Services\n\nAnd Meta, just to give you some sizing on the activities, if you look at our total component bill of materials, if you like, for the entire portfolio, we've had multi-sourcing activities. There's qualifying alternative parts that adds about 10% to our approved vendor list. Obviously, focused on the challenge areas. The timing challenge with that, of course, is when you when you identify a new component, you get -- there are new orders and you get in line on their lead time.\n\nSo those activities were ongoing throughout 2022. Lead times in history would suggest that those are going to start to come and have an impact on our ability, a wider aperture, if you like, for the supply components in '23. On the redesign side, we've got multiple tens of redesign activities on the go right now, which is probably about ten times more than we would have in a normal year. All of those are in front of us.\n\nThose are all 2023 impacts because they really are a hardware redesign. So they will help in '23 as well. And maybe to put -- another way to look at it, if those problems didn't exist on that very small handful of components, we would have had revenue in the range of our originally yearly guide and then some just on those -- just on alleviating those small number of components.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nThanks.\n\nScott McFeely -- Senior Vice President, Global Products and Services\n\nHopefully it helps to mention it for you.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nYeah.\n\nGregg Lampf -- Vice President, Investor Relations\n\nThank you, Meta.\n\nOperator\n\nOur next question comes from Paul Silverstein with Cowen and Company. Your line is now open.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nGuys, what's the backlog increased to exactly? I heard you say it was significantly greater than $4 billion, but what was the sequential increase? What was the book-to-bill this quarter? If I remember, it was 1.5 or over 1.5 last quarter. What was it this quarter? [Inaudible]\n\nGary Smith -- President and Chief Executive Officer\n\nGo, ask you second as well, Paul.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nI see head count was up almost 500 sequentially. I mean, that's massive relative to the total head count. It's more than we've seen in a long time. What's that all about?\n\nGary Smith -- President and Chief Executive Officer\n\nSo let me take the first part of that and then and then Jim can talk about the headcount growth. The revenue to orders, orders were about 30% above revenue in Q4 -- sorry, in Q3. We expect as well the orders to be above revenue in Q4. So we're going to create more backlog.\n\nThe backlog as we turn out right now is about four -- is approximately 4.4 billion, Paul.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nGary, that was up from the previous quarter?\n\nGary Smith -- President and Chief Executive Officer\n\nYes. Yes, yes, absolutely.\n\nJim Moylan -- Chief Financial Officer\n\nup 100 million.\n\nScott McFeely -- Senior Vice President, Global Products and Services\n\nIt's up a few hundred million.\n\nJim Moylan -- Chief Financial Officer\n\nWe're going to limit you to your two questions, Paul. So I just want to know why --\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nWell, Jim, before you respond, let me -- because those were just clarifications. The real question is, relative to the order in the backlog, what's the risk? For cynics who say you're just masking weakness by laying it off on supply chain? What's the risk with respect to the robust orders and backlog? What's the risk? Is that a function of customers not willing to step out of line on orders? And for that matter, they continue to place orders with both of them being related to the fact that supply chain remains so tight and that real demand is not reflected by what nominally appears to be extremely strong orders in backlog.\n\nGary Smith -- President and Chief Executive Officer\n\nI would answer the question like this, Paul. Your second question of three. I would I would answer it like this, yes, the order book is made up of sort of three elements, in my view. One is a little bit of catch-up from all the COVID time, but that's sort of flushed through to a large extent right now.\n\nDo you have a little bit of forward ordering because of supply chain lead times and the rest of it? Yes, it's nowhere near what you imagine that might be. It's that's very much with certain customers who absolutely want to secure next year's revenue. And we have some orders that are scheduled for next year for 2023. That is not the majority of the backlog.\n\nThe vast majority of the backlog customers would take immediately because they have real needs. And I think what we're seeing is a very strong step function in demand, unfortunately, at a time where we've got a constrained supply chain. So if you look at the actual demand of our customers, they would roll this product into their network very quickly and put traffic on it. So I'm very comfortable of the demand characteristics there and what we're seeing in our large backlog is not just a function of mitigating their supply chain lead times.\n\nThere's some of that, for sure, with one or two customers. Most of it, they would absolutely take the equipment. So we take a lot of comfort from that.\n\nJim Moylan -- Chief Financial Officer\n\nAand we know them very well. We speak to them every day. We know that their system, their networks need this gear. And we've had no essentially no order cancellations.\n\nWe don't think there's a significant risk there. On the people side, our headcount is generally in line with the plan we set out at the beginning of the year. Recall that I said that absent the changes to the accrual rate for our incentive compensation plan for the company, our opex would be approximately what we added at the beginning of the year, which was approximately our plan. So it's well in keeping with what we planned to do.\n\nAnd as we said in the past, we do think that as networks converge across a few layers, then it's very important that we add to our capability in the routing and switching layers of the network. We are, of course, the best in the world in optical. We think that we will have the best converged solution as we develop these capabilities. In order to develop those capabilities, we have to bring people into our R&D shops around the world.\n\nWe have to bring people into our salesforce in order to sell these capabilities. So that's why the headcount has grown. I think it will probably -- it's not going to grow at that level next year, I would say. I think we're just about at the level that we need to be.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nSo the bulk of those people are going into?\n\nJim Moylan -- Chief Financial Officer\n\nR&D and sales.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nFor routing and switching?\n\nJim Moylan -- Chief Financial Officer\n\nGenerally, yes. Not all, but generally, yes.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nAll right. I'll pass on. Thank you. Thanks, guys.\n\nScott McFeely -- Senior Vice President, Global Products and Services\n\nI'd say routing and switching, Paul, but also to the off-box software capabilities to manage those forward-looking solutions as well.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nThanks, Scott.\n\nOperator\n\nThe next question comes from Simon Leopold with Raymond James. Your line is now open.\n\nSimon Leopold -- Raymond James -- Analyst\n\nThanks for taking the question. Two for me as well. First one is we've seen the 5G awards for Spectrum in India occurring and really, recall that in the past you've had some very strong business in India. And if you could maybe talk about what you're seeing in terms of that particular opportunity and what you're expecting in fiscal '23 in terms of contributions from the region.\n\nAnd then I'll ask my follow-up after.\n\nGary Smith -- President and Chief Executive Officer\n\nOK. Simon, yeah, we're seeing very strong cyclical activity in India after a very challenging set of years. We are incredibly well placed there with all of the major players. And including all the webscale, it's a very focused area for the major webscale players to use the fastest Internet growth country in the world.\n\nYou can see now things are very turbulent given all the supply chain challenges, but we were up pretty robustly in in the quarter. In fact, 44%. From a revenue point of view, I wouldn't sort of bet too much to that because you've got ebbs and flows largely driven by supply chain at this moment in time. But I think it is a moniker around the growth that we see there and we expect a very robust 2023 in India, driven by all of the Spectrum stuff with Jio and Bharti, etc.\n\nSimon Leopold -- Raymond James -- Analyst\n\nGreat. And then on my follow up, I hate to talk more about supply chain, but I need to get a better understanding of these sort of low end parts that that ended up being the constraints. Are these parts that are unique to the vendors and therefore you did not have an option to multi-source and that's what leading to redesign or was there some misstep on your part that you didn't multi-source because these seem to be readily available parts. I just need to understand a little bit better about the particular components you're talking about.\n\nScott McFeely -- Senior Vice President, Global Products and Services\n\nSorry. Sorry. I'm sorry. I categorize them as multi-industry, low-cost ICs that we we've used in that family for many years across many generations of our products and have been very consistent in terms of their availability.\n\nThe challenges are unique and yeah in perfect hindsight, do I wish we had designed multi-source in there? Of course, we have. But frankly, going back a year, that wouldn't be the area of the product portfolio we would have concentrated our multi-sourcing activities on because it's been a very reliable part of the supply chain ecosystem in the past. As we sit here now, obviously, we are working on those multi-source activities both in terms of alternative sources that can be plug replaceable. Those are part two and part between, but also the physical redesign of the boards to be able to accept multiple alternatives.\n\nSimon Leopold -- Raymond James -- Analyst\n\nThank you.\n\nGregg Lampf -- Vice President, Investor Relations\n\nThanks, Simon.\n\nOperator\n\nOur next question comes from Alex Henderson with Needham and Company. Your line is now open.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nGreat. Thank you very much. I want to go back, I guess, like mine to kind of situation. I want to go back to the cancellation question.\n\nClearly, you haven't seen cancellations in the current environment. That wouldn't make a lot of sense. People accelerating orders and then canceling them. But can you talk about your history of cancellations? If you go back over the last recession, what kind of cancellations did you see in that environment? Have you had -- it's my understanding that your net cancellation rate is something under 1% in pretty much every quarter in the history of the company.\n\nIs that is that accurate? And to what extent does the order require the service provider or other vendor to do a lot of work before they put the order in to set the RFP up, which makes it expensive for them to cancel. And then the second piece of that is what's going on with your pricing? You talked about price increases before. Is that something that reduces the risk of cancellation?\n\nJim Moylan -- Chief Financial Officer\n\nJust historically, Alex, our order cancellation rate has been well under 1%. In fact, I can think of a handful of cases in the past in which we've seen order cancellations. It's just not done because by and large, our customers order this gear because they need it. Not by and large, 100%.\n\nThat's why they order this stuff. They don't buy it on the hope that they'll need it. So when they order it and it's specified for their system and their network, they're going to take it eventually. Now we're not making our customers particularly happy right now with our extended lead times.\n\nWe're going to make -- we're going to do better than that in the future and we'll deliver this backlog.\n\nScott McFeely -- Senior Vice President, Global Products and Services\n\nYeah, the other thing, I think, to point out is that these aren't commodity items, for the most part, in our customers. These are networks that are designed to our specifications. These are solutions that are integrated into their back office. And we've talked about it in the past in a totally different context, the length of time it takes to do a new product introduction into these large scale service providers or webscale.\n\nThat is the stickiness that also prevents them from just saying, OK, I'm going to take order X, Y, Z, and take it down the street to somebody else.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nSo the second piece of that question was around price, which I don't hear you mentioning. And I do have a follow-up question on the supply chain, which is to what extent, given additional lockdowns in China that are alarming the market right now, are you at risk that those ICs, those low-priced ICs, which tend to be more commoditized and may be sourced in China, are exposed to risk due to those lockdowns?\n\nJim Moylan -- Chief Financial Officer\n\nAt the beginning of this calendar year, we went out to our customer set and negotiated a price increase, which was consistent really across the customer base. We did it to cover the costs -- the increased costs that we were seeing. Now we chose not to reprice the backlog. We placed the price increase on orders after a certain date.\n\nAnd it so happens that we have not seen any effect of that price increase yet because we have not yet completed delivery of the backlog that was in place before the price increase went into effect. We think that late this year and in early next year, we will see a positive impact from that. I was very pleased with the way our customers reacted to it. It was a negotiation.\n\nAnd you want to answer the second part, Scott?\n\nScott McFeely -- Senior Vice President, Global Products and Services\n\nYeah, I mean, COVID, in general, obviously, has been difficult to predict around the world. So there is that overall overriding risk to some degree for everybody in the industry. But the specific news that was out of China over the last 24 hours in that particular province, we don't have any direct operational exposure to that and certainly haven't had any signals at this point in time from our suppliers that they have exposure either. That's something that we're going to have to monitor relatively new news.\n\nAnd subjectively, it's not a province that has ever come up in any of my dialogs traveling around the supply base.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nBut just to be clear, the question is how much of those ICs are coming from China specifically as opposed to that particular province? Nobody's expecting that particular $21 million -- $20 million Chinese to be the issue. But broadly, if there is a broad shutdown in China, are there ICs coming from there?\n\nScott McFeely -- Senior Vice President, Global Products and Services\n\nYeah, the general sentiment, I would say, is that the direct supply from those component providers is not from China. That's not to say, though, that they don't have subcomponents in there that if they trace their supply chain, the tertiary effect comes from China. But the direct components from the vendors that we deal with are not source out of China.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nPerfect. That's what I was looking for. Thank you.\n\nOperator\n\nThe next question comes from Jim Suva with Citi. Your line is now open.\n\nJim Suva -- Citi -- Analyst\n\nThank you. I believe you mentioned that fiscal '23, your sales outlook is unchanged from like 90 days ago. But if you just had weakness this quarter because you couldn't meet it with supply and then that's continuing again into Q4, why wouldn't actually fiscal '23 be a stronger outlook than 90 days ago?\n\nJim Moylan -- Chief Financial Officer\n\nWell, what I'd say is that we're taking a balanced view to '23 as we look at it. Now, we've not guided to '23. The number and consensus is -- it's 4.2 billion. I don't think that's a terrible number for the years and reference and we'll guide appropriately as we go through time.\n\nBut remember, we're not expecting all of the particular component demand. I mean, supply issues that we have seen to ameliorate immediately. And our balanced view is that it will improve but not get us to the point where we can deliver everything in our backlog next year. By the way, I hope I'm wrong.\n\nIf we could deliver -- if we could get more of these key components, we will deliver more revenue. But that's not our expectation today.\n\nGary Smith -- President and Chief Executive Officer\n\nJim, this is Gary. I mean, I think obviously we're not guiding into '23 right now. We haven't finished this year. And that's been -- and that's challenging enough right now given the supply chain pieces that we're seeing.\n\nBut given the backlog we've got and the amelioration activities in place, if all stays in the course that it's on, we will start to see improvement as we as we get into '23. Bit too early to call that. Consensus right now is about 4.2, as Jim said. And I think that's probably a reasonable number, given what we're seeing.\n\nI understand the math. We went into this year planning for double-digit growth and when you sort of step back from it, if you get to sort of the midpoint of the guide and in Q4 we basically taken that number down by about half a billion dollars. And that's really all supply chain related. I understand the point.\n\nDoes that all roll into next year? Well, it doesn't work like that because I don't think there's going to be a magic switch on supply chain. But that's probably the best number we have right now.\n\nJim Suva -- Citi -- Analyst\n\nThank you. And then my follow up is other companies have gone to the broker market or secondhand market when they've had some shortages of parts. I assume you probably tried to, but it just happened so late in the quarter. Is that what happened? Because if you said they're low priced parts and a handful, why not pay up a bit of a premium and get your product out the door into sale?\n\nScott McFeely -- Senior Vice President, Global Products and Services\n\nWe certainly have gone to the broker market. That's one of the reasons -- in fact, it's the biggest reason why our margins have deteriorated from the sort of mid-40s level. But I'll tell you this, that the broker market is not as robust as it was a year ago because everybody go in there to buy their parts. So we've done it.\n\nWe do it where we can and we'll continue to do it.\n\nJim Suva -- Citi -- Analyst\n\nThank you so much.\n\nGary Smith -- President and Chief Executive Officer\n\nThanks, Jim.\n\nOperator\n\nThe next question comes from Tim Long with Barclays. Your line is now open.\n\nTim Long -- Barclays -- Analyst\n\nThank you. Yeah, I've got two as well. First one, sorry to beat a dead horse here but we hear all the mitigations and whatnot that you guys have been going through for the supply chain here. Just it's been a long time here coming and most in the industry are improving, not getting worse.\n\nSo when you think about kind of higher level, you think about your procurement, your ability to estimate, ability to redesign, what have you guys been doing as far as like processes internally and personnel to try to address these problems better? So not just kind of what you guys have done, but what kind of investments are you're making in people and process to ensure that it doesn't continue to happen? And then I got a follow up on webscale.\n\nScott McFeely -- Senior Vice President, Global Products and Services\n\nYeah. So, Tim, let me walk you through the steps on mitigation, including your processes and people questions. So, first and foremost, obviously, we're out there from a process perspective, putting a large demand on the supply base with long lead times and in fact, overriding their lead times and actually extending them. So that's that's one.\n\nNumber two is we've stepped in to put ourselves between ourselves and the direct component suppliers, where in the old world, when these things were moving on 90-day turn times, the contract manufacturers would do a lot of that. So we have added resources basically to manage the component suppliers and chase parts, if you like, directly ourselves. Obviously, there's a focus in terms of governance on the key components that are challenges. We have brought significant more resources from an engineering perspective to bear on the redesign activities throughout the year.\n\nThose will pay off, but they will pay off in front of us because they are longer lead time. And we've made significant investments in our manufacturing capacity such that when the specific history and components get solved, we can turn that into finished goods and start servicing our customers faster than we would have been able to before. So we're looking at all aspects of that. They will pay off.\n\nIt's just these are things that take time.\n\nGary Smith -- President and Chief Executive Officer\n\nTim, the other thing that add to that is I think we've basically done all of the right things. And we were very proactive with it and we tried to get out ahead of that 18 months ago. And I look at all the things that we've done, and frankly, I think it's all the right stuff. We have a supply chain, team, and process that has navigated through some incredible challenges and outperformed everybody else.\n\nIf you were to be in hindsight to it, which is a wonderful thing would we have bought some of that engineering talent in earlier to get multi-sourcing? Maybe, but the challenge is we wouldn't know which components to focus on, quite frankly. So I'd be defensive to it, but I don't think there's really much else we could have done as we do -- as you look through that. Hindsight is a wonderful thing. But the other thing I'd say, Tim, is we're not happy with where we are in terms of the performance.\n\nWe're about half a billion dollar down because of this this issue and impacting customers. But I would say we are experiencing more relative than absolute demand than anybody else. And we are still shipping more equipment than anyone else in our space. So I would remind everybody of that.\n\nTim Long -- Barclays -- Analyst\n\nOK. Thank you. And just a follow up on the webscale. I noticed it kind of was down a little bit more sequentially particularly compared to service providers.\n\nSo I'm curious about that. And related to that, I would guess webscalers are probably your most impatient customer base. There's all this stuff going on, it seems like once you introduce an optical system, there's a lot of drama around the componentry where in a pluggable, not so -- not as much. Much lower bill of material, much smaller part count.\n\nSo is there a risk to that customer base that the potential transition to more pluggables in their network could accelerate because of the more difficulty around a system sale? Thank you.\n\nGary Smith -- President and Chief Executive Officer\n\nTim, I'll let Scott take the pluggable part of that. But my answer to that would be no. We're absolutely not seeing that. Webscale, we're down in revenue for the quarter.\n\nThat's just really turbulence from supply chain. What was the question? The answer is supply chain. So I think that the demand we're seeing, very strong order flow for our systems, 6,500 architecture around the webscale players. And I think they'll be -- continue to be robust as we as we go through '23.\n\nOn the pluggable side, Scott, do you want to talk about it?\n\nScott McFeely -- Senior Vice President, Global Products and Services\n\nI'll just -- Tim, where we are deployed today from a webscale perspective is not the patch where pluggables have applicability as we said in the past, that pluggable conversation in the webscale space for the most part for us is new territory and potential upside. So what you're seeing when you look quarter over quarter or period over period is 100% supply chain related. We reference one of the key challenge areas for us is modems. They're obviously a big consumer of modems.\n\nSo the two correlate very well. On pluggables in general, as we've said consistently, we think it's very early innings for that ZR pluggable application. We're confident that we have the best plug available where we've shipped them to 45-plus customers, including the large webscale pieces of it. We think that's going to be a a growing piece of our business as we go into 2023 as well.\n\nGary Smith -- President and Chief Executive Officer\n\nThank you.\n\nTim Long -- Barclays -- Analyst\n\nThanks.\n\nGary Smith -- President and Chief Executive Officer\n\nTim.\n\nOperator\n\nOur next question comes from Rod Hall with Goldman Sachs. Your line is now open.\n\nRod Hall -- Goldman Sachs -- Analyst\n\nHi, guys. Thanks for the question. I guess I wanted to come back to the range of outcomes that's possible in 2023. I think what you guys have said is your long-term growth model is 6% to 8% and that would begin in 2023.\n\nAnd obviously now the supply situation has become much less predictable and certainly could run into the beginning of '23. I think you would agree with that. And on the other hand, you have this huge backlog and you could see much higher growth in that range in 2023. So I wonder if you would be willing to at least say from a breadth of outcomes point of view that it's a possibility if this supply situation were to persist in the beginning of the year, that you might even be below that 6% to 8% range.\n\nAnd acknowledging that, it's also possible you could be well above consensus. But I think when I hear back from investors this morning, some of them are saying, hey this is a stock I would like to own. Clearly, the demand situation is great, but given the supply uncertainty, the 2023 numbers could be a little bit punchy if this supply thing continues to be a problem in the beginning of the year. So I just wonder if you could kind of comment on how that range looks to you and what the risk to the maybe even the 6% to 8% growth might be.\n\nThanks. And then I have a follow up.\n\nGary Smith -- President and Chief Executive Officer\n\nHere would be my my response to that, Rod. First of all, we're not giving guidance for '23. We haven't finished '22 yet. So we normally give that as we as we turn the year.\n\nAnd you're absolutely right. I mean look what happened in 2010, the supply chain, etc. I would say that given what we're seeing now, if that does not deteriorate, then we have very high confidence in exceeding that 6% to 8%. If you look at sort of 4.2, let's just take that as the current consensus based on our midpoint there, that's more than 20% growth.\n\nThat's entirely possible if the supply chain stays with some stability and we fix some of these particular issues that we're seeing right now. More than that right now would be kind of speculation.\n\nRod Hall -- Goldman Sachs -- Analyst\n\nOK. All right.\n\nJim Moylan -- Chief Financial Officer\n\nThe whole point there, Rod, the number, 6% to 8% is not a meaningful number right now. We have a depressed level of revenue this year. So 6% to 8% is -- it's not a relevant number. And as Gary said, we haven't guided to next year.\n\nIt's very hard for us to give a range guide that we haven't given. So what I would say is we've got a big backlog and it could be a lot higher than that if we got the parts.\n\nRod Hall -- Goldman Sachs -- Analyst\n\nYeah. Makes sense. OK. And then the second question I had, I guess is mostly for you, Gary, but it's related to the sales force.\n\nYou had mentioned that you're accruing less for the call plan and are considered base compensation. I wonder, are you worried that it's going to be tough to retain salespeople? The labor market is still pretty tight. There are, I guess, other peripheral companies maybe not in optical that are having better luck on supply. So I wonder how you're feeling about retention of salespeople, what the plan there is.\n\nGary Smith -- President and Chief Executive Officer\n\nYeah. Well, listen, that's a good question. the large amount of the bonus accrual that we change per GM is actually non-sales and non-sales related. And most not all of the sales force, they're actually comped on orders.\n\nSo, I mean, we've had an extraordinary order year, so I feel pretty good, Rod, that the sales force quite rightly have been a very on the whole well compensated and we have a highly tenured salesforce. We have the largest and best equipped optical sales force in the world. And I'm talking about systems engineering and the sales folks as well. So I think they are largely compensated on orders so that they've generally had a pretty good year.\n\nJim Moylan -- Chief Financial Officer\n\nBut the question does pertain to our general employee to employee level. But -- and of course, we're not happy to lower the accrual range for our general set of employees. We have in the last couple of years paid out very well against that incentive comp plan. And this year is probably not going to be as good, and our accrual reflects that, but we're trying to deal with that as best we can with merit and other things.\n\nGregg Lampf -- Vice President, Investor Relations\n\nMichelle, we'll take one more question.\n\nOperator\n\nThe next question comes from Amit Daryanani with Evercore. Your line is now open.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nPerfect. Thanks a lot. And glad I snuck in here. It just maybe the first two as well but the first one I have is I think you like what he talked about, a $60 million mess due to the supply chain issues.\n\nThe October quarter guide, there's I think 220 million below the Street was what you had implied in the past, is all of that would be related to the same supply chain issues if something else happens. It almost seems like a backdrop for that impacting the October quarter guidance versus July. And then what is the top of recovering from what you're hearing from the supplier? Is it going to happen in Q1 or is there a much longer lead time for this recovery of the bottleneck to alleviate?\n\nJim Moylan -- Chief Financial Officer\n\nIn general, the -- if I heard and understood the question correctly, the space that is the challenge is consistent between through Q3 and Q4. It's that small number of IC components that we talked about that is getting in the way of us maximizing the production of our modem. So it's the same challenge, a little bit different dynamic though in Q3. In Q3, obviously, we had a perspective going into our Q3 guide of what the commitments were on all the components, including those.\n\nAnd in that particular case and those components, those commitments weren't met and they were -- it was too late for us to mitigate it. Going into Q4. Same sort of dynamic and set of components. And we're giving you are our perspective as the environments and commitments sit today.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nGot it. And then you -- could use thoughts on how do you think free cash flow stacks up in Q4 and fiscal '23? I mean, is working capital still going to be a use of free cash flow in Q4? So potentially negative? Or do you think free cash flow can start to improve? Love to understand free cash flow expectations for Q4 and then broadly for '23.\n\nJim Moylan -- Chief Financial Officer\n\nYeah. What I'd say is that we consumed a fair amount of our free cash in Q3. We built a lot of inventory. My guess is that we will probably build a little more inventory as we move to the next couple of quarters and hopefully as '23 progresses.\n\nAnd if we get to the kind of numbers we're looking at, then that inventory level will start to decline and our free cash flow will start to build next year. So I think next year we'll have a good free cash flow. I won't qualify that in any other way except to say we'll have a good free cash flow next year.\n\nGregg Lampf -- Vice President, Investor Relations\n\nThanks, Amit, Appreciate it. Thank you, everybody, for joining us today. We do look forward to connecting with everyone during the day today as well as at a few events next week. Enjoy the Labor Day weekend and [Inaudible]\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGregg Lampf -- Vice President, Investor Relations\n\nGary Smith -- President and Chief Executive Officer\n\nJim Moylan -- Chief Financial Officer\n\nGeorge Notter -- Jefferies -- Analyst\n\nScott McFeely -- Senior Vice President, Global Products and Services\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nSimon Leopold -- Raymond James -- Analyst\n\nAlex Henderson -- Needham and Company -- Analyst\n\nJim Suva -- Citi -- Analyst\n\nTim Long -- Barclays -- Analyst\n\nRod Hall -- Goldman Sachs -- Analyst\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nMore CIEN analysis\n\nAll earnings call transcripts"
}