{
  "companyName": "Varonis Systems",
  "companyTicker": "VRNS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/varonis-systems-vrns-q3-2022-earnings-call-transcr/",
  "content": "Varonis Systems (VRNS 0.63%)\nQ3 2022 Earnings Call\nOct 31, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings. Welcome to Varonis Systems, Inc. third quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode.\n\nA question-and-answer session will follow the formal presentation. [Operator instructions] Please note this call is being recorded. I will now turn the conference over to Tim Perz, investor relations. Thank you.\n\nYou may begin.\n\nTim Perz -- Investor Relations\n\nThank you, operator. Good afternoon. Thank you for joining us today to review Varonis' third quarter 2022 financial results. With me on the call today are Yaki Faitelson, chief executive officer; and Guy Melamed, chief financial officer and chief operating officer of Varonis.\n\nAfter preliminary remarks, we will open the call to a question-and-answer session. During this call, we may make statements related to our business that would be considered forward-looking statements under federal securities laws, including projections of future operating results for our fourth quarter and full year ending December 31, 2022, as well as the full year ending December 31st, 2023. Due to a number of factors, actual results may differ materially from those set forth in such statements. These factors are set forth in the earnings press release that we issued today under the section captioned Forward-Looking Statements, and these and other important risk factors are described more fully in our reports filed with the Securities and Exchange Commission.\n\nWe encourage all investors to read our SEC filings. These statements reflect our views only as of today and should not be relied upon as representing our views as of any subsequent date. Varonis expressly disclaims any application or undertaking through publicly any updates or revisions to any forward-looking statements made herein. Additionally, non-GAAP financial measures will be discussed on this conference call.\n\nA reconciliation to the most directly comparable GAAP financial measures is also available in our third quarter 2022 earnings press release and investor presentation, which can be found at www.varonis.com in the Investor Relations section. Lastly, please note that an updated investor presentation, as well as a webcast of today's call, are available on our website, in the Investor Relations section. With that, I'd like to turn the call over to our chief executive officer, Yaki Faitelson. Yaki?\n\nYaki Faitelson -- Chief Executive Officer\n\nThanks, Tim, and good afternoon, everyone. Today marks an important milestone in the evolution of our company, and I want to talk about our short- and long-term vision and walk you through the trends challenges and opportunities we see today. Let's start by reviewing our third quarter results. ARR grew 26% year over year to $447.8 million or 30% year over year when adjusting for FX and the impact of exiting our Russia business.\n\nEven when adjusting for the $9.2 million headwind to our reported results caused by the weakening of the euro and the pound, our organic results were still below our expectation. The primary reason was our EMEA segment with economic uncertainty and additional deal scrutiny led to a softer-than-anticipated outcome. We reviewed some of this last quarter, but the continued effect of the war in the Ukraine, the energy crisis, and general economic slowdown were more impactful than we expected. The second factor was our U.S.\n\nfederal business where our close rates had an impact of approximately $4 million to $5 million against our expectation. However, despite the challenges we faced in the quarter in our federal and EMEA business, we see no change in our long-term view that this should both be strong contributors to our business. Total revenue grew 23% year over year to $123.3 million or 27% adjusted for effects in Russia. In North America, revenue grew 30% year over year, a strong performance in our commercial business was somewhat offset by more-than-expected results in the federal vertical.\n\nIn EMEA, reported revenue was down 3% but grew 16% after adjusting for FX in Russia. Because of Q3 results and expectations that these headwinds will persist in Q4, we are adjusting our full-year ARR guidance. Specifically, our updated guidance assumes that the economic conditions continue to deteriorate in EMEA and that this also begins to moderately affect our U.S. business.\n\nThis also factors an incremental headwind due to unfavorable changes in the euro and the pound. These factors will impact our full-year revenue guidance as well, and Guy will walk you through those details. As a result, of our updated top-line guidance, we are taking thoughtful and prudent steps to manage expenses across the business, which includes a 5% reduction in headcount in addition to other cost reduction initiatives. We have always said that we seek to tie our level of investment to the revenues we plan to achieve.\n\nAnd given the greater short-term uncertainty in the macro environment, we believe this is a prudent approach at this time. Now, I would like to take a step back from our near-term results and discuss our vision. We founded Varonis to help organizations solve their biggest data protection challenges, and to date, the strategic priority is more critical and yet more challenging than ever. What makes data protection so hard, the explosive growth of data across cloud and on-prem data stores have expanded the attack sources, which open organization to the growing sophistication of bad actors has made the threat environment more dangerous, making the kind of automation we provide critical to protect against those attacks and the penalties for not securing data continue to go because of increasing government regulation.\n\nThese trends generate challenges for organizations all over the world, but also create opportunity for Varonis. Since our founding, we have invested heavily in innovation to address these problems, going to a comprehensive data security pattern. With our platform, we provide visibility into who can and does access sensitive data and where it's at risk. We automatically shrink the blast radius or damage that a single compromised user machine can cause while also alerting on unusual behavior and, importantly, stopping it before any harm is done.\n\nAll of our technological innovation ultimately led us to innovate within our business model as well. As we grow the platform, we realized that our customers could utilize additional licenses at the lower upfront cost if we deliver them a subscription. So, in 2019, we announced the transition of our on-premises perpetual model to a term-based subscription licensing model which reduced the upfront cost to consume Varonis as a platform and increase the total lifetime value of the customer. We were able to complete this transition in these four, five quarters because the demand from our customers increased significantly as our subscription offering made the buying process easier.\n\nToday's introduction of our flagship data security platform as a SaaS is the next stage in the evolution of our company and builds on the success we had with our perpetual-to-term license transition, while the success of the OPS transition was primarily defined by a record pace, we performed, we expect to take a more measured approach to make this transition in our success. The SaaS delivery model has been in our road map for many years in part because we have seen the company and additional flexibility in how we consume the platform. Throughout the last two-plus years, we have invested over $100 million, and a significant part of our engineering group has worked relentlessly to transform the features of our on-prem subscription offering into SaaS offering. To be clear, we will continue to sell our existing DA Cloud product, which are delivered solely as a SaaS, alongside our flagship Data Security Platform, which, for the time being, will be offered either as a SaaS or through term-based on-prem subscription licenses.\n\nI would like to review in more detail some of the benefits we expect to realize by offering our flagship data security platform as a SaaS deployment. First, risk assessment. The core of our sales motion are expected to be quicker to deploy, which, once our sales force gets past the initial ramp-up phase and is fully trained on the new selling motion, should help shortening our sell side. Second, customers will be able to more quickly and easily deploy and maintain our solution, significantly reduce infractructure requirements, and lower upfront costs.\n\nWe expect that this will help to effect of customers realizing a faster time to value, which will ultimately be beneficial to us in contracts. Third, ones will have more visibility into usage behavior and the ability to spot threats more quickly, which will better inform our product innovation. Fourth, customer will benefit from continual threat model and classification updates that will help them stay prepared for new and evolving threats and regulation. We expect that this will also help the renewal rates as customers get greater value for our products.\n\nAnd finally, the SaaS model will allow us to deliver additional features and functionality to customers more efficiently. Taken together, these enhancements create significant value for our customers and in turn, we expect them to continue driving meaningful growth for us as the macroeconomic situation will improve. In closing, we founded Varonis to help customers solve their most urgent data protection needs. And today, the launch marks an important milestone in helping them achieve that goal with additional flexibility.\n\nWe believe the introduction of our SaaS-delivered flagship data security platform will dive significant long-term value for our shareholders as we continue our march toward $1 billion in ARR and deal. With that, let me turn the call over to Guy Melamed.\n\nGuy Melamed -- Chief Financial Officer\n\nThanks, Yaki. Good afternoon, everyone. I'd like to start today's call by providing you with additional thoughts on the current operating environment, how it impacts our business, and the ways we are responding to it. I'd also like to provide you with a framework on how to think about our new SaaS offering and a review of our third-quarter results.\n\nIn the third quarter, total revenue grew 23% year over year to $123.3 million or 27% adjusting for FX and Russia. While this was within our guided range, our reported revenue did not meet our expectations. As Yaki mentioned, reported revenue in our EMEA business was down 3%, reflecting additional currency headwinds and a continued worsening of the economic climate. Let me take a minute to separate the two headwinds that I'm discussing.\n\nThe impact of foreign currency fluctuation does not impact demand for our product but does impact the translation of revenue in our reported results because we sell in local currency. The significant weakening of the euro and the pound was a $3.3 million headwind to reported results in the third quarter. Adjusting for the impact of foreign currency, as well as Russia, EMEA revenue grew 16% year over year. That said, the economic slowdown in the region does impact short-term demand for our products.\n\nIn North America, our commercial business drove growth of 30% despite results from our federal team that were below our expectations. To remind you, the third quarter is the seasonally strongest one for our federal business which currently represents a mid-single-digit percentage of total ARR. Although our current results don't reflect this, we remain confident that this number can grow considerably. And over the past couple of years, we have made significant investments in the business to make that goal a reality.\n\nUnfortunately, those investments have not yet generated the returns that we expect. As a result of these near-term challenges and our expectations that there will likely be some spillover from the economic weakness we've seen in EMEA into our North America operations, we are adjusting our full-year guidance. Let me take a moment to review the impact of each of these factors to help you better understand the numbers. First, the significant weakening of the euro and the pound against the dollar accelerated since our last earnings call.\n\nThis is relevant given that we price both our new business and renewals in local currency, and as such, this trend impacts ARR and revenue. For the full year, this headwind impacts our previous ARR guidance by approximately $2 million. Second, due to the deterioration of the macro environment, we are reducing our full-year ARR and revenue expectations. This assumes continued worsening of economic conditions in Europe and the slowing of business conditions in North America.\n\nWhile we have not seen softness in the metrics we track for North America commercial business, given the prevailing global macroeconomic backdrop, we believe it is prudent to plan for a wider range of outcomes than we foresaw last quarter. Taken together, the reduction in our guidance is primarily related to the impact of the macro environment and the additional headwinds from currency which reduced our total ARR and revenue guidance by $25 million and $16 million, respectively. The $9 million difference between the reduction in our ARR and revenue guidance can be attributed to the timing of FX headwinds, as well as the maintenance component of deals that we previously expected to close in 2022, which were included in our previous 2022 ARR guidance but would not have been recognized as revenue until 2023. As a reminder, FX rate used to translate ARR and revenue sold in foreign currencies into U.S.\n\ndollars are booked as of the date a deal is closed. The deferred revenue and ARR balance associated with each deal are not revalued at subsequent quarters during the duration of the contract. The headcount reduction and other cost savings initiatives that Yaki mentioned, should result in approximately $7 million of savings during the fourth quarter as reflected in our updated guidance. While this was not an easy decision to make, we felt it was the right thing to do given our updated outlook and our strategic philosophy to balance top-line growth, operating leverage, and cash flow generation.\n\nFor many years, you've heard us talk about our goal to get to $1 billion in ARR and today is the right time to take the next strategic step toward that target by offering our flagship data security platform as a service. SaaS has a number of compelling operational and financial benefits. First, we expect it will improve the customer time to value, allow us to better protect our customers, and, in turn, shorten our sales cycles and benefit renewal rates. It also will allow us to service customers who only want to consume RONA as a SaaS, which broadens our market opportunity.\n\nWe know that SaaS will provide us with better visibility into how our customers use and interact with our platform. It will also provide us with improved visibility and predictability into our business over time and will enable us to better address our underpenetrated market opportunities. New and existing customers may now choose to consume our platform through SaaS delivery or through term-based on-premise subscription licenses. In this transition period, a key point to understand is that on a quarterly basis, revenue recognition of the same deal is materially different, if sold as on-prem subscription or SAP because, on on-prem subscription deals, we recognize approximately 80% of the deal's value upfront.\n\nWhereas in a SaaS deal, the revenues are fully ratable from the outset. It's important to note, however, that each deal is measured exactly the same way for ARR. At this early stage in our rollout, it is very difficult to predict the pace by which our customers will choose to adopt SaaS, but we expect our visibility to improve over time, and we will do our best to let you know how the transition is progressing. As Yaki mentioned, we do expect this transition to take some time.\n\nwith our current base assumption of four to six years. As a reminder, our transition from perpetual licensing model to an on-prem term-based subscription model was primarily a financial exercise. -- while the transition to SaaS has additional operational component. This is why we expect to take a more measured approach this time around.\n\nThis means that our forward-looking metric of ARR, along with free cash flow, will be the key metrics we focus on to discuss the health of our business and our progress toward achieving our targets. During this transition period, the shift of our business from term licenses where approximately 80% of the deal's value is recognized upfront to a SaaS model with fully ratable revenue will make our reported revenue and operating income metrics somewhat less indicative of the health of our business than they have been in the past. This is exacerbated by a SaaS rollout that will be both measured and optional for our customers. Until we have several quarters of experience, it will be difficult to predict the pace of which both our new and existing customers transition to this new ratable model.\n\nAnd throughout this transition, similar to our previous one, we are committed to providing you with as much transparency as possible to understand the progress we are making toward our goal and expect to provide both a framework for the way in which revenue and profits will play out under various scenarios, as well as some new KPIs to help you gauge on our program. As a reminder, ARR and cash flow will be the cleanest metrics to follow throughout our journey. We expect to deliver more color and new KPIs in early 2023, but the general framework to think about for next year includes free cash flow levels of $20 million to $25 million for the full 2023 year with similar seasonality to previous year. As a reminder, we generate the largest amount of free cash flow in Q1 with Q2 being the lowest of the year, followed by a moderate improvement throughout the second half of the year.\n\nARR and revenue growth of 10% to 12% for the full year, which assumes further deterioration in the European economy, the slowing of business conditions in North America, and an initial ramp-up phase for our sales team in the first half of the year. This also assumes a 5% SaaS mix of sales from new licenses in the first half of 2023. We plan to provide our full-year SaaS mix assumption next quarter. Now let's turn to our third quarter results in more detail.\n\nARR grew 26% year over year to $447.8 million. After adjusting for the FX and Russia headwind, ARR growth was 30%. As I mentioned earlier, total revenues grew 23% or 27% after adjusting for FX on Russia. This includes subscription revenues of $96.1 million, which grew 37% year over year.\n\nMaintenance and services revenues were $27.3 million with renewal rates again over 90%. Looking at the business geographically, North America had another strong quarter as revenues grew 30% to $98 million or 79% of total revenue. EMEA revenues declined 3% to $22.1 million or 18% of total revenue. Last, Rest of World revenues grew 63% to $3.2 million or 3% of total revenue.\n\nEnd of September 30, 2022, 76% of our customers with 500 or more employees purchased four or more licenses, up from 70% a year ago and 60% two years ago. At the same time, 47% of those customers purchased six or more licenses, up from 37% a year ago and 26% two years ago. Our bundles are helping simplify the pricing discussion and continue to be well-received by both new and existing customers. Turning back to the income statement.\n\nI'll be discussing non-GAAP results going forward. Gross profit for the third quarter was $108.9 million, representing a gross margin of 88.3%, compared to 88% in the third quarter of 2021. Operating expenses in the third quarter totaled $99.1 million. As a result, third-quarter operating income was $9.8 million or an operating margin of 7.9%.\n\nThis compares to operating income of $8.1 million or an operating margin of 8.1% in the same period last year. After accounting for the 200 basis points of headwind in related to our shekel hedging program, the expansion was 180 basis points. During the quarter, we had financial income of approximately $2.5 million primarily due to interest income, which was partially offset by interest expense on our convertible notes. Net income for the third quarter of 2022 was $6.7 million or income of $0.05 per diluted share compared to a net income of $5.7 million or income of $0.05 per diluted share for the third quarter of 2021.\n\nThis is based on 126.9 million and 119.1 million diluted shares outstanding for Q3 2022 and Q3 2021, respectively. As of September 30, 2022, we had approximately $790 million in cash, cash equivalents, short-term deposits, and marketable securities. For the nine months ended September 30, 2020, we generated $8.4 million of cash from operations, compared to $6.8 million generated in the same period last year. We ended the third quarter with 2,270 employees an increase of 89 net new employees from the second quarter.\n\nIn a moment, I will review our fourth quarter and full-year guidance in full. But first, let me take a moment to remind you of our expense exposure to the new Israeli shekel, which we have partially mitigated through our hedging program for 2022. For the fourth quarter of 2022 and full year 2022, this headwind is expected to be 50 basis points and 200 basis points, respectively. Turning to our guidance.\n\nFor the fourth quarter of 2022, we expect total revenues of $139 million to $142 million, representing growth of 10% to 12% or approximately 16% growth at the midpoint, adjusting for FX in Russia. And non-GAAP operating income of $22 million to $24 million and non-GAAP net income per diluted share in the range of $0.17 to $0.18. This assumes 127.3 million diluted shares outstanding. For the full year 2022, we now expect ARR of $460 million to $463 million representing year-over-year growth of 19% to 20% or approximately 24% growth at the midpoint, adjusting for FX and Russia.\n\nTotal revenues of $470 million to $473 million, representing growth of 20% to 21% or approximately 25% growth at the midpoint, adjusting for FX in Russia. Non-GAAP operating income of $25.5 million to $27.5 million and non-GAAP net income per diluted share in the range of $0.14 to $0.15. This assumes 126.7 million diluted shares outstanding. Lastly, as we announced today, our board has authorized a $100 million share repurchase program for the first time.\n\nWe are able to make this announcement because of our strong balance sheet that has nearly $800 million in cash and an expectation to be free cash flow positive beginning next year. Our main use of capital will continue to be investing in our business over the long term. But today, we want the ability to act in order to maximize shareholder value. In summary, we have never shied away from challenges, and today is no different.\n\nWe will continue to thoughtfully manage our business to not only navigate the near-term uncertainty but also to position us for success in our transition to a SaaS model, which will allow us to continue our durable growth as we capture our significant long-term opportunity and ultimately create value for all of Varonis' stakeholders. Thanks for joining us today. And with that, we would be happy to take questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question is from Matt Hedberg with RBC Capital Markets. Please proceed.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nOh, hey, guys. Thanks for taking my question. So, on the macro side, I guess, maybe a little bit more color. It sounds like it was mostly Europe, but you know you're embedding some additional concern for North America.\n\nBut I guess I'm curious, as the quarter played out, did Europe progressively get worse? And has it continued to deteriorate through October? And is that sort of the run rate that you've used to sort of forecast the balance of Europe? And maybe a little bit more color on how you're sort of discounting the European business or excuse me, the North America business here for 4Q.\n\nGuy Melamed -- Chief Financial Officer\n\nMatt, there are a lot -- a couple of components there. So, I'll try and give some color. Last quarter, we talked about the uncertainty in Europe when we talked about additional deal scrutiny that was going on there. And as you know, a significant portion of our business is in the last two weeks of the quarter.\n\nIn Q3, there were three things that really didn't go as expected. First, EMEA deteriorated faster than we expected with longer sales cycles and worse closing. The second thing that happened is the U.S. dollar strengthened even further.\n\nAnd third, federal really came in about $4 million to $5 million below our expectations. They had good pipeline, but they didn't close as we expected. -- we haven't changed the long-term view for EMEA and federal, but as we look at our Q4 guidance, we want to take a prudent approach, and we expect economic conditions to worsen in Europe and that longer sales cycles and lower close rates may impact our U.S. business as well.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is from Joseph Gallo with Jefferies. Please proceed.\n\nJoseph Gallo -- Jefferies -- Analyst\n\nHey, guys, really appreciate the question. Guy, any color you can provide on DA Cloud? It's been nine months since we've gotten a quantitative update there. Are we still on track for the $5 million? And then maybe separately, ignoring the deployment model, but rather focusing on the location, the data you protect, if we include Office 365, how much of your business is protecting data on-prem today versus in the cloud? Thanks.\n\nYaki Faitelson -- Chief Executive Officer\n\nSo, regarding DatAdvantage Cloud Cloud, it's Yaki. Nothing changed. Everything works so far according to plan. We see this massive opportunity.\n\nYou think about this repositor, is salesforce.com, you know, user identity repositors like Okta, get hub we just see tremendous opportunity and we invest heavily in the product, the data on-prem is not going anywhere. So, the data on-prem is going relentlessly and just a lot of risk there. It's a big target for every form of attack and a lot of ransomware. But the tremendous milestone that we announced is the Varonis score platform is a SaaS model.\n\nThis was the lion's share of our engineering investments in the last two years. Most of the engineering efforts were there just to build a very modern architecture for the Varonis platform. And it's just a tremendous game changer long term. And the metadata that we have there, it's just golden.\n\nIt's given us the ability to analyze thousands of customers and give tremendous network effect. And primarily, it's all about the automation, automation installation, automation in remediation, our ability to deliver a feature request faster with changing the company completely. Actually, except of the first version of the product that was diverse of Varonis, this is the biggest technological milestone.\n\nGuy Melamed -- Chief Financial Officer\n\nJust to add for DatAdvantage Cloud, the expectation for the year is still $5 million ARR. That hasn't changed.\n\nJoseph Gallo -- Jefferies -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question is from Fatima Boolani with Citigroup. Please proceed.\n\nFatima Boolani -- Citi -- Analyst\n\nHey, good afternoon. Thank you for taking my questions. Either for Guy or Yaki. Actually, maybe for Guy.\n\nJust with respect to the federal deals that you talked about that essentially slipped. Can you give us a little bit more context as to some of the reasons behind why those deals didn't necessarily make it to the finish line and were these engagements competitive? And then just generally around the SaaS transition, I know you mentioned that it's going to be very measured, but how are you going to plan to manage maybe a demand air pocket or confusion between customers who are electing between the term and the SaaS form factors? Thank you.\n\nGuy Melamed -- Chief Financial Officer\n\nI'll start with the federal performance. Like we said in the prepared remarks, they were about $4 million to $5 million below our expectations. We came into the quarter with a strong pipeline, but they just -- we just didn't close the deals. We don't expect all of those deals to close in Q4, but we do expect some of them to close.\n\nAnd the Fed business is really behaving today like the Varonis Enterprise business behaved about four to five years ago, which is much more evangelical. It sometimes takes longer than one would anticipate. But we do believe in the longer-term opportunity because the Fed customers faced the exact same problem as our enterprise customers do, if not more.\n\nYaki Faitelson -- Chief Executive Officer\n\nIt's Yaki. You need to understand that in terms of the data, the federal customers maybe have the most critical data and in terms of the data that we are protecting and it's just a top priority for them, but you know how things are working in the programs. The other thing you're starting to see on the zero trust, a lot of specifications that are related to data and data protection just not two, three large deals in Q3 can be the difference. And sometimes we are still not embedded in the programs like other product categories.\n\nSo, this is why you can see fluctuation. This is why you can see a healthy pipeline that sometimes not materialize the way that it will work in the commercial sector of the business. And regarding -- what was the question regarding the ask, can you remind me?\n\nFatima Boolani -- Citi -- Analyst\n\nJust how to manage customer confusion or education around the term options versus now the SaaS options? And I recognize you just launch the gold and silver and platinum bundles for your term-based licenses and modules. So, how do you to just manage maybe the confusion or education for customers around that without impacting your business on the term side?\n\nYaki Faitelson -- Chief Executive Officer\n\nSo, first, we're just announcing it and yet to be seen. So, this is why we are a bit careful here. But you need to understand that it's relatively the same product is much, much better delivery -- so today, with the on-prem, it didn't stop us. Thankfully, we've done very well, but you need hardware, and it takes time and all of this kind of stuff.\n\nSo, today, with 365 immediately, it's task to SaaS, it's a mediate time to value. We're also in starting the first version we provided the automation engine for 365 and 365 in terms of the blast radius because of the fact that the data is in the hands of the end user, so the same amount of data on-prem and in the cloud in the Suits opening much more and also the best service that we give to our customers is the incident response 1, and we can give it automatically from the SaaS. So, we think that for the -- initially a conversation that we had with customers and the way that the POCs are working, so far, it's exceeding our expectations. And this is how it works.\n\nBut we know how to do transitions very well, and we are careful because, yes, in the short term, it's something that can introduce some confusion, but most probably in the long term, it's a complete game changer. This is how people consume consumer software today in a SaaS model. And everywhere from the deployment to the maintenance to the automation that we provide, it's a tremendous friction reduction. We believe that in the next 18 months, the value proposition literally can be in order of magnitude better with the stock clock, the time that it had to deploy, the time that it takes to remediate to classify, to provide incident response, the time that we are spending on support is changing the company completely.\n\nGuy Melamed -- Chief Financial Officer\n\nJust to add one more thing. The way we plan to initiate the rollout of the SaaS offering is that we will start with new customers first on the smaller side, then we will go upstream with those new -- with new customers. And as we gain more confidence with the platform, we will go to our existing customers.\n\nOperator\n\nOur next question is from Rob Owens with Piper Sandler. Please proceed.\n\nRob Owens -- Piper Sandler -- Analyst\n\nGreat. Good afternoon. Thanks for taking my questions. Just one more on the transition to SaaS realizing it's going to take some time, but two questions, really.\n\nIs that ARR neutral, so it's going to be like-for-like relative to customer pricing? And then how should we think about potential gross margin pressure and the operating margin pressure with shift to SaaS? Thanks.\n\nGuy Melamed -- Chief Financial Officer\n\nSo, we have said over the last couple of quarters that ARR is really the leading metric in order to gauge the strength and the health of the business. And that should continue throughout the transition because from an ARR perspective, there is no different accounting treatment. So, that's really the way to look at it. In terms of kind of the operating margin, we're giving ARR and free cash flow as the north star because SaaS will cause headwinds to gross margins and operating margins really due to the upfront costs.\n\nAnd during the transition, the accounting treatment of SaaS and the operating metric income metrics will be less indicative of the health of our business than they have been in the past because of the difference in accounting treatment of SaaS versus on-prem subscription. So, putting all of that together, there's one more component to keep in mind, which is the faster the transition the more negative the impact on the income statement in the shorter term, but this will be a positive longer term.\n\nRob Owens -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is from Saket Kalia with Barclays. Please proceed.\n\nSaket Kalia -- Barclays -- Analyst\n\nOK. Great. Hey, guys, thanks for taking my question here. Guy, maybe just a couple of short housekeeping questions for you.\n\nMaybe first, I think we said about a $25 million cut to ARR guide for the year. Can you just walk us through how much of that is from incremental FX headwinds since the last time we spoke versus additional macro headwinds? That's the first question. And the second question is, as you sort of looked at the results these last few quarters, how are competitive win rates kind of changed, if at all?\n\nYaki Faitelson -- Chief Executive Officer\n\nSo, I will start with the competition. So, the competitive situation didn't change. In DatAdvantage Cloud, here and there, we just see that companies try to do what we are doing on one use case or one platform. But in terms of the breadth and the coverage that we have for the three use cases and really a company that can integrate these three streams, which the potential access, the actual access, and the content, we are, by and large, uncontested.\n\nAnd when we are doing the POC head-to-head, it's -- we don't really have real competition. So, the competitive landscape stays the same.\n\nGuy Melamed -- Chief Financial Officer\n\nAnd second, in regards to your question about the ARR and the impact of FX, the U.S. dollar continued to strengthen in Q3 compared to when we gave guidance that there was a couple of million dollars of headwind. But when we look at the reduction of guidance it was really a component of EMEA sales cycle and deal scrutiny, the federal coming in $4 million to $5 million below expectations and our expectation that some of the EMEA deal scrutiny will spill over to the U.S. even though we haven't seen it yet in any of the metrics we track.\n\nSaket Kalia -- Barclays -- Analyst\n\nVery clear. Thank you.\n\nOperator\n\nOur next question is from Shaul Eyal at Cowen and Company. Please proceed.\n\nShaul Eyal -- Cowen and Company -- Analyst\n\nThank you. Good afternoon. Guy, Yaki, a quick question on the headcount rating. Is that predominantly sales in marketing? And also, maybe on the EMEA softness, was it country-specific or pretty much across the board? Thank you.\n\nGuy Melamed -- Chief Financial Officer\n\nShaul, I'll start with the EMEA question. We felt the effect of the macro environment across the board. We saw deals slip, but we didn't lose them to competition. And that really, the opportunities continue to be there.\n\nWe've closed some of those deals already, not all of them, but they are in the pipeline, and they live.\n\nYaki Faitelson -- Chief Executive Officer\n\nAnd regarding -- Shaul, regarding the hiring, no, it's just across the company. We hired more than 550 people in the last two years and we just feel that a lot of productivity gains. We want to make sure that we are very efficient. So, we believe that we are doing the relatively small cut and the hiring trees without taking anything from the future.\n\nWe can keep investing for the future. And we just believe that we, you know, focus, focus on execution. We can realize material productivity gains and be more efficient.\n\nShaul Eyal -- Cowen and Company -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is from Andrew Nowinski with Wells Fargo. Please proceed.\n\nAndrew Nowinski -- Wells Fargo Securities -- Analyst\n\nOK. Thank you. I was wondering if, you know, given the rev rec differences between term and SaaS, if you could tell us how much revenue headwind you factored into the Q4 guidance for the SaaS transition. And then also, I was just wondering if you could just update us on the net retention rate.\n\nYou haven't updated that since, I think, Q4 of last year. So, just wondering if you could tell us how that's changed throughout the course of this year. Thanks.\n\nGuy Melamed -- Chief Financial Officer\n\nSo, we're not expecting any material contribution of the Varonis SaaS offering in Q4 because we're not changing the comp plan that will happen at the beginning of 2023. And in our 2023 color, we're baking in some ramp-up time with our sales force in the first six months, as we have seen in the past and as we have seen in the transition from perpetual to on-prem subscription. In terms of the NRR, that's an annual number that we provide, and we'll provide color in the next earnings call.\n\nOperator\n\nOur next question is from Roger Boyd with UBS Securities. Please proceed.\n\nRoger Boyd -- UBS -- Analyst\n\nHey, thanks for taking my question. Maybe another way to look at that net retention rate question. But if you could just talk about what you're seeing in terms of renewals. I mean, it sounds like the platform adoption metrics continue to trend nicely.\n\nBut just on a renewal basis, how are you seeing adoption of the bundles? How is that impacting a dollar net retention either way? Thanks.\n\nGuy Melamed -- Chief Financial Officer\n\nDefinitely. I'll give some color on that. When we look at the bundles that were introduced at the beginning of this year, we see them being received very well by both customers and our sales force. It's really simplifying the conversation our intention is to continue to offer and go in that direction of more and more licenses that are part of a bundle, it's actually helping us in landing a higher number of licenses with new customers, but it's also allowing us to expand within our customer base because customers that have a larger number of licenses see more value.\n\nThey have a portion of automation that they really like and therefore, the likelihood of them coming back and buying more goes up significantly, which is part of the reason that we see with the SaaS offering the ability with the automation to have higher renewable.\n\nOperator\n\nOur next question is from Chad Bennett with Craig-Hallum Capital Group. Please proceed.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nGreat. Thanks for taking my questions. So, just in terms of the initial SaaS platform and offering, is it going to be like-for-like capabilities in terms of repositories covered, applications covered and the number of licenses you have, you know, whether it's data advantage classification and everything underneath? Will it be like-for-like in terms of -- compared to your on-prem product?\n\nYaki Faitelson -- Chief Executive Officer\n\nEventually. Eventually, yes. Now we have a party, but it's a relatively small party. Most of the core functionality is there.\n\nWe also have now for 365 advanced remediation capabilities and the ability to do incident response from remote, which is just a complete game changer for most of our new -- most of our new customers. But we are moving very fast with the cloud. And what you can expect from us is that we will going to close the gap very fast and then become a SaaS-first company. So, we will move with our feature set much faster in the cloud.\n\nGuy Melamed -- Chief Financial Officer\n\nAnd Chad, just a -- just to add one more thing, Chad, from a pricing perspective. For the same product, SaaS is priced 25%, 30% higher compared to the on-prem subscription offering. So, just to make sure that's clear.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nAnd then just one real quick clarification, guy. Maybe just in terms of a prior question around kind of how this rolls out or the next year from a go-to-market standpoint. I think you talked about the SaaS offering being focused mainly on new logos and kind of expansion in new logos. So, if I'm an existing on-prem customer and there is a like-for-like SaaS product or license, and I'm up for renewal.\n\nAnd am I able to switch over to the SaaS offering next year?\n\nGuy Melamed -- Chief Financial Officer\n\nThe short answer is yes. We will do what's best for our customers. And if a customer wants to move to SaaS, we will allow them to do that. Obviously, with the uplift that that involves.\n\nBut the intention is to start with our new customers, and then go upmarket with those new customers, and then later on, go to our existing customer base and switch them to SaaS.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nGot it.\n\nYaki Faitelson -- Chief Executive Officer\n\nThe case is to get to critical mass of small customers to see how everything works to have our sales cycle learning curve. This is exactly how we did with the transition to OPS. And once we have all our ducks in a row, which we know how to transition very well, then we are all in, it will be more measured than the OPS. It's more you have technical and then we need to build some of the migration tools.\n\nIt takes time. It's development -- but this is where we are going, and we are going to execute on the transition because, as I said, we really believe that the value will be just in orders of magnitude better changing the company completely and just reducing friction just in every step of the way. So, again, once -- we have a very good understanding how everything works. We will -- we are going to execute in the transition in full force.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nGot it. Appreciate the color. Thank you.\n\nOperator\n\nOur next question is from Hamza Fodderwala with Morgan Stanley. Please proceed.\n\nHamza Fodderwala -- Morgan Stanley -- Analyst\n\nHey, gentlemen, thank you for taking my question. Guy, two questions for you. One, following up on the early comment that SaaS is priced -- I think you said 25% to 30% higher versus on-prem subscription. The ARR uplift on SaaS, should we think about that being maybe double digits after you discount?\n\nGuy Melamed -- Chief Financial Officer\n\nObviously, we need to see how things evolve. But we have a grading system in place that allows our reps to make more money when they sell at good discounts. They can make $1.20 for every $1 they sell. But if they sell a really high discounts, they, in some cases, make $0.50 on the dollar.\n\nSo, that allows us to control kind of the discount levels Obviously, we want to see how things progress. But the price list as is, and if they keep the same discount levels or similar discount levels, should have a 25% to 30% up.\n\nHamza Fodderwala -- Morgan Stanley -- Analyst\n\nOK. All right. So, that's -- OK, with the similar discount level, this 25% to 30% uplift on ARR, did I hear that correctly?\n\nGuy Melamed -- Chief Financial Officer\n\nYep.\n\nHamza Fodderwala -- Morgan Stanley -- Analyst\n\nOK. And then on the 2023 guide, if I heard correctly, you're guiding to ARR growth, which implies just about 30% decline in net new ARR. Can you talk a little bit about how you got to that number? Are you assuming just lower new customer bookings? Are you assuming a lower renewal rate? And how much does FX factor into that 10% to 12% ARR guidance? Thank you.\n\nGuy Melamed -- Chief Financial Officer\n\nSure. We wanted to bake in a lot of things that can go wrong. You know, there's four quarters of economic softness in 2023 versus just one, one and a half this year, and the macroeconomics are very fluid right now. So, we're building in further slowdown in EMEA.\n\nWe expect that to spread into the U.S., although we haven't seen it in any of the metrics that we track. And there's also two quarters of FX headwinds, two extra quarters of FX headwinds in 2023 versus 2022. When you look at the ARR in the 2023 numbers, we also baked in a ramp-up period for our sales force in the first half of the year with the introduction of the SaaS and the change to the comp plan. So, we wanted to get guidance.\n\nWe wanted to set the guidance that is appropriately reasonable and responsible in light of the uncertainties that we see.\n\nOperator\n\nOur next question is from Shebly Seyrafi with FBN. Please proceed.\n\nShebly Seyrafi -- FBN Securities -- Analyst\n\nYes. Thank you very much. So, related to the last question, you're guiding for ARR growth at constant currency to decline from 24% in Q4 of this year to 10% to 12% at the end of next year. Last year, in 2021, you grew ARR by 35%.\n\nAnd my question really is, what do you believe is your core growth rate in the medium term? I mean, I just want to know whether you think that this kind of low double-digit growth rate near 10% to 12% is the new normal or whether you think that in broad strokes, you're like a 20% grower now not the 30% in the past, but is your core growth in your opinion, around 20%, not 10% to 12%.\n\nGuy Melamed -- Chief Financial Officer\n\nThere's a lot of benefits to the SaaS. And we just introduced it today. But apart from the fact that initially, the unit of economics will decline because of the upfront investment. We expect shorter sales cycles and better renewals over time.\n\nSo, once we reach scale, the unit of economics will be better than the on-prem subscription. So, the benefits of all that on top of the fact that it's not just the efficiency, it's the markets that open up and it's the greenfield opportunities within the market with the SaaS offering gives us confidence that we will be a rule of 40 company as we exit the transition.\n\nShebly Seyrafi -- FBN Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question is from Joshua Tilton with Wolfe Research. Please proceed.\n\nJoshua Tilton -- Wolfe Research -- Analyst\n\nThanks for squeezing me in here. I got a two-parter. My first one is, how much of the weakness in EMEA and have avoided if you had a SaaS solution. In other words, is there any weakness that you saw maybe not just macro, but having to do with having the right product fit? And then my second question is the speed of your first transition, it somewhat benefited from the revenue recognition for terms.\n\nCould you just help us understand the timeline for this transition and how the revenue drop will compare to the one we experienced in the first transition? And is there any way that maybe you have a constant-currency number for the FY '23 guidance that you gave today? I know it's a lot, but --\n\nYaki Faitelson -- Chief Executive Officer\n\nIn terms of the offering, not just related to EMEA, so the deals in EMEA, as Guy mentioned, they didn't go anywhere. It's just the closing is very elusive. We start for people now to just to commit for funds. And regarding the overall staff, if you think about it, if you defect 100% of the breaches in the world, 90% of them are related to data.\n\nPeople are taking data. People are not saying, you know, we tapped into your workloads most of the time, they are trying to take data. And most of the time is the data that we protect. Think about the last Uber breach.\n\nThis is something that only a platform like Varonis can detect and really identify and remediate. So, I think that we really see two objections. One is I don't have now the hardware in time and stuff like that. It didn't stop us were doing very well.\n\nSo, this is one point of reach. And the other thing is that customers plan to see. No one is saying that data protection is not a top priority. Once you can install it in a frictionless way, and you're doing all the remediation automatic, the classification automatically and provide all the incident response that you're taking the operational burden on you and really mitigate all the risk for the customer is a, completely, game changer.\n\nI just elevate your value just significantly just massive. But we just think -- look at our history, we are very careful with what we are saying. We never say something without a lot of empirical evidence. We invested more than two years and more than $100 million in engineering in order to get to the cloud.\n\nThis was a massive, massive undertaking. Most of our engineering work on it. And there are just a lot, a lot of benefits in coverage, in automation. It's a completely, completely different offering.\n\nSo, if we had a mature SaaS with all the automation features, and you just need to pay and don't do anything else without a doubt, we were able to take much more of the overall security budget.\n\nGuy Melamed -- Chief Financial Officer\n\nSo, we don't believe that we're at 10% to 12% growth rate company in the longer term. And regarding your accounting treatment question, we added a new slide in the investor deck that's going to help investors better understand it. But just to give some color in the -- when there was an on-prem subscription deal, we recognize approximately 80% of the deal upfront, and the remaining 20% is recognized ratably in SaaS, obviously, revenue is recognized fully ratable. So, if a deal is signed on the last day of the quarter, it's just one day divided by 365, but ARR on both of those setting the same price would be the same.\n\nAnd that's why we're talking about ARR and free cash flow as the north stars for 2023.\n\nOperator\n\nOur next question is from Erik Suppiger with JMP Securities. Please proceed.\n\nErik Suppiger -- JMP Securities -- Analyst\n\nYeah. Thanks for taking the question. First off, the lift on the SaaS service -- why are you charging that kind of premium if you're trying to migrate to a cloud-first architecture? And then secondly, is this going to be disruptive to some of the DatAdvantage Cloud sales cycles that you have? I would imagine that a customer that's buying DatAdvantage Cloud would be more inclined to adopt the SaaS version than the on-prem version.\n\nYaki Faitelson -- Chief Executive Officer\n\nNo. It's -- it's not just -- it's not distractive, -- it's the same data advantage, just the delivery service just the delivery services is different regarding the uplift is just the cost of computing.\n\nGuy Melamed -- Chief Financial Officer\n\nAnd I just want to clarify, the DatAdvantage Cloud that we've talked for a year about it covers new application and data stores that we never previously covered. The new offering in today's announcement is basically offering the features that we had on-prem for our on-prem product just as a SaaS offer. So, that's the big difference between what we had up to date and what we're offering today. And the 30% is just the additional charge for the SaaS.\n\nErik Suppiger -- JMP Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur final question is from Shrenik Kothari with Robert W. Baird. Please proceed.\n\nShrenik Kothari -- Robert W. Baird and Company -- Analyst\n\nHey, good afternoon. Thanks for taking the question. So, you guys mentioned about taking the prudent steps to manage expenses, which includes 5% reduction in headcount in addition to other cost reduction initiatives that Yaki mentioned. So, all in all, that results in $7 million of savings you said.\n\nSo, what are these other initiatives outside of headcount? And comparatively, how much contributions do you expect overall? And if you can talk about that and if the sales will be one-time or longer-term? Just some color.\n\nGuy Melamed -- Chief Financial Officer\n\nWe want to continue to balance the top-line growth and cash flow improvements. And as you mentioned, you can see in our Q4 guidance that we managed to offset half of the revenue reduction with cost savings to protect profitability and cash flow. We went through our entire spend and try to see where we can cut and be more efficient. And at the end of the day, we're always looking at ways to be more efficient.\n\nAnd today's announcement is really about continuing to do the right thing. And that's why we're also giving our free cash flow expectation for 2023, which shows meaningful improvement compared to what we expect to finish in 2022.\n\nShrenik Kothari -- Robert W. Baird and Company -- Analyst\n\nGot it. Thanks.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the call back over to management for closing comments.\n\nYaki Faitelson -- Chief Executive Officer\n\nThanks for joining us today, and thank you for your interest in Varonis.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTim Perz -- Investor Relations\n\nYaki Faitelson -- Chief Executive Officer\n\nGuy Melamed -- Chief Financial Officer\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nJoseph Gallo -- Jefferies -- Analyst\n\nFatima Boolani -- Citi -- Analyst\n\nRob Owens -- Piper Sandler -- Analyst\n\nSaket Kalia -- Barclays -- Analyst\n\nShaul Eyal -- Cowen and Company -- Analyst\n\nAndrew Nowinski -- Wells Fargo Securities -- Analyst\n\nRoger Boyd -- UBS -- Analyst\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nHamza Fodderwala -- Morgan Stanley -- Analyst\n\nShebly Seyrafi -- FBN Securities -- Analyst\n\nJoshua Tilton -- Wolfe Research -- Analyst\n\nErik Suppiger -- JMP Securities -- Analyst\n\nShrenik Kothari -- Robert W. Baird and Company -- Analyst\n\nMore VRNS analysis\n\nAll earnings call transcripts"
}