{
  "companyName": "McCormick",
  "companyTicker": "MKC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/06/mccormick-mkc-q3-2022-earnings-call-transcript/",
  "content": "McCormick (MKC -1.49%)\nQ3 2022 Earnings Call\nOct 06, 2022, 8:00 a.m. ET\n\nKasey Jenkins\n\nGood morning. This is Kasey Jenkins, chief strategy officer and senior vice president, investor relations. Thank you for joining today's third quarter earnings call. To accompany this call, we posted a set of slides at ir.mccormick.com.\n\nWith me this morning are Lawrence Kurzius, chairman and CEO; Brendan Foley, president and COO; and Mike Smith, executive vice president and CFO. During this call, we will refer to certain non-GAAP financial measures. The nature of those non-GAAP financial measures and the related reconciliations to the GAAP results are included in this morning's press release and slides. In our comments, certain percentages are rounded.\n\nPlease refer to our presentation for complete information. Today's presentation contains projections and other forward-looking statements. Actual results could differ materially from those projected. The company undertakes no obligation to update or revise publicly any forward-looking statements, whether because of new information, future events, or other factors.\n\nPlease refer to our forward-looking statements on Slide 2 for more information. I will now turn the discussion over to Lawrence.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nGood morning, everyone. Thanks for joining us. Third quarter sales increased 3% from the year-ago period as anticipated. In constant currency, sales grew 6%, reflecting 10% growth from pricing actions, partially offset by a 1% decline from the kitchen basics divestiture, a 1% decline attributable to the exit of low-margin business in India and the consumer business in Russia, and a 2% decline in all other volume and product mix.\n\nOur underlying third quarter growth reflects the strength of our broad global portfolio, as well as the effective execution of our strategies and pricing actions against the backdrop of a volatile operating environment. Using 2019 as a pre-pandemic baseline, third quarter sales grew at a constant currency three-year compounded annual growth rate, or CAGR, of 7%, reflecting the sustained momentum in our business across both our consumer and flavor solutions segments. Moving to profit, adjusted operating income was down 12%, or 11% in constant currency, and adjusted earnings per share was down 14%. During the third quarter, supply chain challenges continued, and recovery of certain constrained materials is taking longer than expected.\n\nWe continue to incur elevated costs to meet high demand in our flavor solutions segment. While in our consumer segment, where demand moderated from elevated consumption trends more quickly than expected, we are experiencing lower than optimal operating leverage. Across the supply chain, we remain focused on managing inventory levels and eliminating inefficiencies. So, the normalization of our supply chain costs is taking longer than expected, pressuring gross margin and profit realization in the current period.\n\nOver the coming months, we will be aggressively eliminating supply chain inefficiencies. Importantly, as we had expected in the third quarter, our price increases are catching up with the pace of cost inflation in both segments. We began to recover the cost inflation that had been outpacing our pricing actions and other levers, most significantly in the consumer segment. We expect this will continue into the next year as we plan to fully offset inflation over time.\n\nBefore discussing our third quarter segment performance in more detail, I'd like to comment on our supply chain plans, starting on Slide 5. We have a focused plan in flight that leverages the discipline of our established comprehensive continuous improvement, or CCI program, to ensure that we are able to flexibly support customer demand, both where it has been sustained at higher levels and where it has moderated, while eliminating inefficiencies and normalizing both our cost structure and inventory levels. Our actions are well underway. Our top supply chain priority remains keeping our customers in supply and supporting their growth.\n\nThere are areas of our business that have sustained high levels of demand for an extended period, and our supply chain has been pressured to meet this demand. We have several initiatives in progress that will increase our capacity, strengthen our supply chain resiliency, and, importantly, enable us to service our customers so they can grow their business. For example, we're investing in additional flavor solutions seasoning capacity, which will be online in early 2023. We're expanding fullness footprint to support our flavor growth.\n\nWe recently opened our new U.K. Peterborough flavor solutions manufacturing facility to support our strong growth momentum with quick service restaurants. And just earlier this week, the first pallet were shipped from our new Maryland logistics center. From a cost perspective, as we responded to demand volatility over the past several years, we have incurred additional costs above inflation, service our customers, and have seen inefficiencies develop in our supply chain.\n\nThese are costs we have absorbed. We have not passed on to customers our pricing actions. We are targeting to eliminate at least $100 million of these costs with a significant benefit in 2023. We're moving aggressively to take these costs and inefficiencies out, as well as normalized inventory levels that have built up.\n\nSome of our actions include investing to increase both manufacturing capacity and reliability in bottleneck areas to enable better customer service and repatriation of production from excessive use of co-packers. We're returning to more normal shift schedules and reducing our spend on expensive surge capacity. We're already seeing the benefit of lower overtime and temporary labor reductions. In this more normalized environment, as well as through customer collaboration, we are already beginning to reduce expedited freight costs and less than truckload shipping costs, as well as other transportation inefficiencies.\n\nWe're resolving raw material and packaging supply issues. For example, they're beyond the shortages of glass bottle and certain organic spices, which impacted supply of our U.S. core main line. A supplier facility closure announced in September broke the discontinuation of a component of our dry recipe mix packaging.\n\nAnd through our quick qualification of alternative supply, we mitigated a major disruption during the fourth quarter. And long-running shortage of French's mustard bottle will be resolved in the first half of 2023 as new models come online as a second supplier. And from an inventory perspective, we're also executing on plans to return to historical safety stock levels, which were raised to protect against supply disruption. We expect the impact of our actions to normalize our supply chain cost, increase our efficiency and ability to meet demand, lower our inventory level, and, importantly, increase our profit realization beginning in the first half of 2023.\n\nWe have managed through various supply chain challenges over the last several years with the peak disruption experienced in the third quarter of last year. Since then, there has been steady improvement, building progress and bolstering our confidence in our plan to enhance our operational performance and optimize our cost structure. But we will always prioritize meeting our customers' needs. I'm encouraged by our disciplined approach to resolving the increased costs within our supply chain.\n\nWe've continued to define and quantify specific actions within our plans as we've -- seen since we shared we would be driving the elimination of the supply chain inefficiencies in our pre-announcement last month. We look forward to sharing more details and progress with you in January when we provide our 2023 outlook. Now, moving to third quarter business updates for each of our segments. Starting with our consumer segment on Slide 6 and the status of our pricing actions, our third quarter sales reflect the impact of our pricing actions in all three regions, with an acceleration of effective pricing in the quarter versus the first half of the year, in line with what we expected.\n\nWhile broad pressure on consumers cost of living from inflation, which heightened during our third quarter, has resulted in higher price elasticity than we originally anticipated, our elasticities remain lower than historical levels. And our most recent pricing actions, which in the U.S. took effect as we began our fourth quarter, we focused on areas that are less elastic and did not take pricing on some products where we had seen the highest elasticity. Now, for some further highlights of our region, starting with the Americas.\n\nOur total U.S. branded portfolio consumption, as indicated by our IRI consumption data and combined with unmeasured channels, grew 4%, in line with our shipments. And over the last three years, since 2019, consumption has grown at a three-year CAGR of 8%, which highlights how the sustained shift in consumer consumption continues to drive increased demand for our products and outpace pre-pandemic levels. In early August, we divested our Kitchen Basics business.\n\nWe consistently grew this brand over the years. But as it was the only U.S. brand we had in the stock and profile, our resources were better focused on core categories where we have leading brands. Demand has remained high with strong growth in the majority of our categories.\n\nSpices and seasonings has been one of our strongest categories in the past three years. And as a result, we are lapping all-time highs in consumption. This has created challenging comparisons in some product lines, such as baking-related items, which have returned to a pre-pandemic level unlike most of our categories. Grilling-related items were impacted versus last year by high meat prices, although grilling is still strong versus pre-pandemic.\n\nSales conditions continue to improve as seen in a recipe mix share performance for the fourth consecutive quarter of share gains. Our spices and seasoning share was pressured by service-related distribution losses, the shortage of certain packaging items, as well as certain organic spices, which has largely been resolved, and some trading down by consumers who remain under pressure from broad-based inflation. We are using our category and revenue management capabilities to strengthen our spices and seasoning presence on shelf. The strength of our brands and our category leadership has recently won us new distribution, which we're beginning to realize now.\n\nIn EMEA, we continue to have solid share performance of herbs, spices, and seasonings in the U.K., Eastern Europe and Italy, somewhat offset by softer performance in France. We are continuing to gain share of Frank's RedHot in the UK, and we are beginning to build momentum with Cholula, as we expand that brand into this market. For the quarter and year to date versus last year, as well as since 2019, we are driving the UK hot sauce category growth. Our Vahine brand of homemade dessert products in France, a product line unique to our EMEA region, has flowed as we have seen baking returned to a more pre-pandemic baseline level in EMEA, too, again, unlike our other categories.\n\nTurning to the Asia-Pacific region, last year, the region experienced supply chain challenges such as ocean freight capacity constraints and lapping that impact contributed to growth in the third quarter. Additionally, following an extended lockdown in the second quarter, COVID restrictions in Shanghai and some other cities throughout China, eased as we began the third quarter, resulting in trade and pantry replenishment contributing to growth. Recently, several cities in central China, which is the primary market of our Wuhan operations, have experienced new COVID-related lockdown, and we're continually monitoring the situation. Overall, our China performance is on track with our expectation.\n\nAcross all regions in our consumer segment, we are achieving the price realization we expected, and we're executing on our proven growth strategies, pivoting action plans as needed based on our consumer insights and the environment, We continue to invest behind our brands. We increased brand marketing investments in the third quarter and have additional investments planned for the fourth quarter. In addition to our highly effective and inspiring holiday messaging, we've pivoted our digital messaging to emphasize value and show consumers how our products help them stretch their grocery dollars without sacrificing flavor. We are focusing our innovation efforts to meet the needs of consumers concerned about their budgets.\n\nIn the Americas, we have launched the new Lawry's-branded opening price-point range of everyday 10 spices. And our large-size format, super deal, is one of the best performing product lines as consumers are looking for greater value. This format size is approximately a 40% better value per ounce than the smaller sizes. We've also launched large-size resealable pouches of top-selling items in markets across all regions.\n\nIn terms of category management, we're collaborating with our customers to ensure the right assortment and price points on shelf to optimize category performance and increase profitability for our customers. And as always, we have a strong merchandising program planned for the holiday season. We are confident in our brand marketing investments, innovation, and category management initiatives, which will continue to drive strong growth. Turning to flavor solutions on Slide 8, our sales performance for the quarter was strong, with growth led by our pricing actions in all three regions with an increase in our effective pricing versus the first half of the year as we expected.\n\nNow, for some regional highlights. In the Americas, strong growth was driven by snacks, seasonings, savory flavors, and branded food service products. Demand continues to strengthen the branded food service restaurant and institutional food service customers, as mobility and strong summer travel continue to fuel consumption. And importantly, we also are expanding distribution.\n\nIn EMEA, growth remains strong across our entire customer base. Our third quarter growth was led by strong quick-service restaurant, or QSR, momentum in all markets, partially driven by expanded distribution in our customers' promotional activity. And we're seeing an acceleration of demand in branded food service, as customers shift to more economical formats. Our full spectrum of solutions across price points is driving growth.\n\nWe were winning in both regions with our new product momentum. In Americas, growth from new products contributed approximately 25% more growth in flavors in the third quarter than the year-ago period, driven by beverage, savory snacks, and performance nutrition flavors. We're continuing to win share in these categories. And in EMEA, our third quarter new product launches accelerated versus earlier in the year.\n\nAnd for the full year, we expect new product introductions to outpace 2021. We are fueling future growth. In APZ, we're driving further menu penetration with our QSR customers wanting new limited-time offers, as well as realizing growth and strong performance of their core menu items with flavor. In many cases, we are the heat in their spicy offerings.\n\nOverall, flavor solutions has remained strong. And for certain parts of our business in the Americas and EMEA regions, our supply chain continues to be pressured to meet this high demand. And as I said earlier, we are still taking on some extraordinary costs to service our customers. We appreciate our customers working with us, and we see light ahead.\n\nNow, some summary comments before turning it over to Mike. Turning to Slide 9, global demand for flavor remains the foundation of our sales growth, and we have intentionally focused on great, fast-growing categories that will continue to differentiate our performance. We continue to capitalize on the long-term consumer trends that accelerated during the pandemic: healthy and flavorful cooking, increased digital engagement, trusted brand, and purpose-minded practices. These long-term trends and the rising global demand for great taste are more relevant today than ever, with the younger generations fueling them at a greater rate.\n\nMcCormick is uniquely positioned to capitalize on this demand for great taste. With the breadth and reach of our strong global flavor portfolio, we are delivering flavor experiences for every meal occasion, for our product, and our customers' products, and are driving growth. We are end-to-end flavor. We remain focused on the long-term goals, strategies, and values that have made us so successful.\n\nWe have grown and compounded that growth over the years, including through the pandemic and other periods of volatility. Our solid track record of achieving our long-term objectives highlights the resiliency of our business through a variety of market conditions, as well as our focus on sales growth and profit realization. The long-term fundamentals that drove our industry leading historical performance remain strong. The strength of our business model, the value of our products and capabilities, and the execution of our proven strategies by our experienced leaders, while adapting to changes accordingly, give us confidence in our growth momentum and in our ability to navigate the global dynamic environment.\n\nThe compounding benefits of our relentless focus on growth, performance, and people continue to position McCormick to drive sales growth and balanced with our focus on lowering costs to expand margins and realize long-term sustainable earnings growth. The teamwork of our McCormick employees drive our momentum and success. And I want to thank them for their dedicated efforts and engagement. And now, I will turn it over to Mike.\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nThanks, Lawrence, and good morning, everyone. Starting on Slide 12, our top-line constant currency sales grew 6% compared to the third quarter of last year, including a 1% unfavorable impact from the Kitchen Basics divestiture, as well as a 1% impact from the exits of low-margin business in India and the consumer business in Russia. In our consumer segment, we drove constant currency sales growth of 4%, with 10% related to pricing actions, partially offset by a 1% impact from the Kitchen Basics divestiture, as well as lower volume, with the exits of low-margin business in India and the consumer business in Russia contributing a combined 1% impact to the lower volume. On a three-year basis, our third quarter constant currency sales CAGR was 6%.\n\nOn Slide 13, consumer sales in the Americas increased 3% in constant currency, driven by pricing actions, partially offset by a decline in volume, as well as a 1% impact from the Kitchen Basics divestiture. As Lawrence mentioned, the volume decline was impacted not only by elasticities, but also by constrained supply of certain input materials, primarily packaging items. Over the past three years, constant currency sales in the Americas grew at a CAGR of 6%. In EMEA, constant currency consumer sales declined 1%, which included a 3% unfavorable impact from lower sales in Russia.\n\nGrowth in other markets was driven by pricing actions, partially offset by lower volume, with the most significant volume impact attributable to lower sales of Vahine homemade dessert products. Over the past three years, EMEA's constant currency sales grew at a 3% CAGR. Constant currency consumer sales in the Asia-Pacific region grew 10%, including a 7% unfavorable impact from the exit of low-margin business in India. As Lawrence mentioned, growth was driven by higher volume, mainly attributable to trade and pantry replenishments in China, following the extended Shanghai lockdown last quarter, as well as the region lapping supply chain challenges in the year-ago period.\n\nPricing actions in all markets across the region also contributed to growth. On a three-year basis, APZ's third quarter constant currency sales grew at a 4% CAGR. Turning to our flavor solutions segment in Slide 16, we grew third quarter constant currency sales 10%, primarily due to pricing actions, with higher volume and product mix also contributing to growth. Third quarter constant currency sales for the last three years grew at an 8% CAGR.\n\nIn the Americas, flavor solutions constant currency sales grew 10%, driven by pricing. Higher sales to packaged food and beverage companies with particular strength in snack seasonings, led the growth. Higher demand from branded food service customers also contributed to growth. Over the past three years, constant currency sales in the Americas grew at a CAGR of 8%.\n\nIn EMEA, we drove 11% constant currency sales growth, with 7% related to price actions and 4% volume and mix. EMEA's flavor solutions growth, excluding a 1% decline related to lower sales in Russia, was broad-based across its portfolio, led by strong growth with QSR, branded food service, and packaged food and beverage company customers. Over the past three years, EMEA's constant currency sales growth was 9% CAGR. In the Asia-Pacific region, flavor solutions sales grew 11% in constant currency, with pricing actions and higher volume contributing to the increase.\n\nGrowth was driven by higher sales to QSR customers, in part due to the timing of the promotional activities. APZ grew constant currency sales at a 6% CAGR over the past three years. As seen on Slide 20, adjusted gross profit margin declined 320 basis points in the third quarter versus the year-ago period. Let me spend a moment on the significant drivers.\n\nFirst, almost 80% of this decline, approximately 250 basis points is due to the dilutive impact of pricing to offset our dollar cost increases. Next, I'll cover the impact of supply chain challenges on gross margin. In our flavor solutions segment, we have continued to incur elevated costs to meet high demand for certain parts of that business. And there has also been an unfavorable impact from the start-up and dual-running costs as we transition production to our new U.K.\n\nPeterborough manufacturing facility. In our consumer segment, where demand has moderated more quickly than we expected, we are experiencing lower operating leverage. Overall, while the normalization of our supply chain cost is taking longer-than-expected pressure in gross margin, we are taking actions to normalize our costs, as Lawrence mentioned, which we are confident will be reflected in our 2023 gross margin. Partially offsetting these impacts I just mentioned were our CCI-led cost savings, where we are on track to deliver our expected savings of $85 million for the full year.\n\nAnd finally, of note, in line with our expectations, the impact of our pricing actions in the third quarter began outpacing cost inflation in both segments, more significantly in the consumer segment. We expect pricing to continue outpacing inflation into next year, as we plan to fully offset inflation over time. Overall, our cost recovery and gross margin improvement will vary by region and segment, with a slower flavor solutions recovery. Importantly, though, we have now passed the inflection point with significant gross margin improvement since last quarter, driven by our consumer segment performance, and, we expect further improvement in the fourth quarter.\n\nNow, moving to Slide 21. Selling, general, and administrative expenses, or SG&A, were comparable to the third quarter of last year, with higher distribution costs and brand marketing investments, offset by lower employee benefit expenses. As a percent of net sales, SG&A declined 60 basis points. The net impact of the factors I just mentioned resulted in a constant currency decline in adjusted operating income, which excludes special charges and transaction and integration costs of 11% compared to the third quarter of 2021.\n\nIn the consumer segment, adjusted operating income declined 1% in constant currency; and in the flavor solutions segment, a decline of 34%. Turning to income taxes on Slide 22. Our third quarter adjusted effective tax rate was 21.2% compared to 14.1% in the year-ago period. Both periods were favorably impacted by discrete tax items with a more significant impact last year.\n\nAt the bottom line, as shown on Slide 23, third quarter 2022 adjusted earnings per share was $0.69 as compared to $0.80 for the year-ago period. The decrease was driven by our lower adjusted operating income. A favorable impact from optimizing our debt portfolio in the third quarter was fully offset by the impact of higher adjusted effective tax rate in the third quarter of this year. On Slide 24, we've summarized highlights for cash flow and a quarter-end balance sheet.\n\nOur cash flow from operations was $250 million through the third quarter of 2022, which is lower than the same period last year. This decrease was primarily driven by lower net income and higher inventory levels. We returned $298 million of cash to our shareholders through dividends and used $167 million for capital expenditures through the third quarter. Our priority is to continue to have a balanced use of cash, funding investments to drive growth, returning a significant portion to our shareholders through dividends and paying down debt.\n\nWhile our fourth quarter has historically generated our highest cash flow from operations, based on our current profit outlook and working capital position, we do not expect to delever to our targeted net debt to adjusted EBITDA ratio of approximately three times by the end of fiscal 2022. We remain committed to a strong investment-grade rating, and we have a history of strong cash generation and profit realization. With our improving gross margin, as well as our plan to normalize our supply chain cost and inventory levels, we will be better positioned to continue paying down debt. Now, turning to our 2022 financial outlook on Slide 25.\n\nWe are projecting strong top-line growth, with profit impacted by cost inflation and supply chain challenges. We also expect there will be a 3 percentage point unfavorable impact of currency rates on sales and a 2 percentage point unfavorable impact on adjusted operating income and adjusted earnings per share. On the top line, we expect to grow constant currency sales 3% to 5%. We expect sales to be driven primarily by pricing.\n\nWhile we anticipate volume and product mix to be impacted by price elasticities, we expect elasticity to remain at a lower rate than historical levels given our focused approach led by consumer insights. Our volume and product mix will also be impacted by the divestiture of our Kitchen Basics business. The demand disruptions experienced in China and the exit of our consumer business in Russia, as well as continual pruning of lower-margin business from our portfolio. We plan to drive continued growth through the strength of our brands, as well as our category management, brand marketing, new products, and customer engagement growth plans.\n\nWe are projecting our 2022 adjusted gross profit margin to be 350 to 300 basis points lower than 2021, primarily driven by our flavor solutions segment. Given the rapidly escalating cost environment this year, cost inflation outpaced pricing in the first half of the year. We expect pricing to outpace inflation in the second half of the year and continue into next year. This adjusted gross margin compression reflects the impact of a high teens increase in cost inflation, higher supply chain costs, lower operating leverage, and unfavorable impact of sales mix between segments and favorable impact from pricing and CCI-led cost savings.\n\nAs a reminder, we have priced to offset dollar cost increases. This has a dilutive impact on our adjusted gross margin and is the primary driver of our projected compression. We expect our adjusted operating income to decline 11% to 9% in constant currency. In addition to our gross margin impacts I just mentioned, this projection also includes our CCI-led cost -- total cost savings target of approximately $85 million and a low single-digit increase in brand marketing investments compared to 2021.\n\nWe are projecting our 2022 adjusted effective income tax rate to be approximately 22%. This outlook is expected to be a year-over-year headwind to our 2022 adjusted earnings per share of approximately 2%. We are projecting our 2022 adjusted earnings per share to be in the range of $2.63 to $2.68 as compared to $3.05 in 2021. This projection includes a $0.02 unfavorable impact from the divestiture of the Kitchen Basics business.\n\nAs we currently progress in our fourth quarter, we are confident in delivering our 2022 outlook, continuing our strong top-line growth trajectory and as our guidance implies, delivering fourth quarter operating margin expansion while executing on a focused plan to drive improvement in our cost structure. We are targeting to eliminate at least $100 million of these costs, or approximately a 150 basis point impact to our operating margin. With our proven track record of delivering CCI-led savings to fuel growth investments and expand our operating margin, we are leveraging the discipline of the CCI program to aggressively eliminate costs and inefficiencies. Overall, we are confident our focus on profit realization will drive margin improvement.\n\nAnd while parts of our plan to optimize our cost structure will take longer than others, we expect to begin seeing the benefits of our actions in the first half of 2023. We look forward to sharing more details on progress with you in January when we provide our 2023 outlook.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nThank you, Mike. Now that Mike has shared our financial results and outlook in more detail, I'd like to recap the key takeaways as seen on Slide 26. Our third quarter sales performance reflects the strength of our broad global portfolio and the effective execution of our strategies against the backdrop of a volatile operating environment. Our sales growth momentum is strong.\n\nThe challenges in our supply chain have taken longer to normalize, we have now passed an inflection point. We have begun to recover the cost inflation that has been outpacing our pricing actions while executing on a plan to aggressively eliminate supply chain costs, and we expect 2022 fourth operating margin expansion and continued improvement into 2023. Our long-term performance, including through periods of volatility, has been industry-leading, and long-term fundamentals that drove this historical performance remain strong. We have a proven track record of execution and are confident we will successfully navigate this dynamic environment for our future sustainable growth and build long-term value for our shareholders.\n\nNow, let's turn to your questions.\n\nOperator\n\n[Operator instructions] Our first question is from the line of Ken Goldman with J.P. Morgan. Please proceed with your question.\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks so much.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nHi. Good morning, Ken, by the way.\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nHi. Good morning. You highlighted that you've past the inflection point, right, where your pricing is now ahead of your costs. And this, of course, is natural, right, given the timing and not unexpected.\n\nBut, you know, one of the pushbacks we hear in the industry is that larger retail customers, as they start to, I guess, maybe notice these margin trends, they'll start to ask for a bigger piece of the profit pie. So, I guess my question is, you know, to what extent do you expect sort of these gross margin net tailwinds to be sustainable? Or, you know, is it reasonable to expect maybe some pressure from customers as they see their vendors' margins starting to get better?\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nWell, I think that there's always some tension when you're talking about pricing and margins with customers. And so, I don't want to get into anything with any one specific customer. But right now, all of our customers recognize that inflation is ongoing, and we, you know, continue to have, I'd say, productive pricing discussions with our customers. We just did take another round that is effective here at fourth quarter.\n\nAnd we're really not seeing that kind of pushback right now.\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nI think the reality, Ken, is we're still recovering. You know, our pace of pricing has caught up now with cost. And we -- we'll recover dollar for dollar in 2023. But, you know, there is a trend that is going in the right direction.\n\nAnd obviously, you know, as we look at 2023, we look at, you know, what's the cost environment, things like that, we need to go again next year, but that's still kind of --\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nAnd I think particularly on the flavor solutions side of the business, we have -- we still have, you know, more work to do.\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thank you. And then for my follow-up, you're guiding to at least $100 million of incremental cost savings. It's not a small number.\n\nSo, I just wanted to get a little bit of clarification. How much of that is incremental to ongoing CCI? And how much of that is derived from maybe a normalization of certain factors, such as inventories versus what you would consider more, I guess, discrete savings beyond that?\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nWell, first of all, all of this is incremental to our normal CCI program using the processes and the organization that drives our CCI program to actually execute on these. But this is incremental savings that we -- although, you know, some of the -- I would characterize as a one-time take out the -- it goes straight to run rate. These are incremental costs that we have incurred due to extensive search capacity, some of the things we talked about in our prepared remarks. You know, overtime, temporary labor, and efficient shift, you know, excessive use of co-packers, a lot of premium transportation charges, we do expect to get that out of our system, get back to our pre-pandemic operating standards.\n\nAnd we would expect -- while this is a, you know, one-time takeout, it goes straight to run rate.\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nUnderstood. Thanks so much. Yup, very clear.\n\nOperator\n\nOur next question is from the line of Robert Moskow with Credit Suisse. Please proceed with your question.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nHi. Thanks. So, flavor solutions is really the division that has stumbled the most. I mean, when I look at profit this year compared to like pre-pandemic, it's well below your pre-pandemic levels.\n\nSo, can I assume that most of the $100 million in savings is -- or recovery is going to happen there? And then my second question is, I remember years and years ago that the flavor solutions had problems because it was trying to do too many things for too many customers. It had spread itself too thin. It needed eventually to have a rationalization of its customer base. And I wanted to make sure that that's not possibly one of the root causes today.\n\nYou've grown your sales a lot. Do you feel like the organization is capable of still getting back to like 12% operating margin across all of those customers?\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nYeah. You know, I think that stumble is the wrong way to characterize it. I think that we're a bit of a victim of our own success. You know, we've won a lot of new business, and we prioritized keeping our customers in stock and supplying them.\n\nAnd that has put a lot of pressure on our supply chain in a few areas. And we've got projects underway to address, you know, kind of a normalization of production and through capacity additions. You know, some of these wins are substantial, and we've had real brick-and-mortar projects that take a couple of years to put into place that are coming online right now and that are going to get at a lot of the, you know, extraordinary costs. There's some parts of our business, the 24/7 shifts that we've gotten out of most of our business, you know, we're still doing that in a lot of our that's why I wouldn't say a lot in parts of our flavor solutions business, and that is a less efficient ship pattern even though it does, you know, get you some capacity to be an example of expensive surge capacity.\n\nBut, you know, we've got new seasonings capacity coming online in the Americas, some of it now, some of it in the first -- early part of 2023. We're starting up a new flavor solutions plant in the U.K. We've got, you know, expanded distribution, you know, that's shipping really starting to ship right now. And so, you know, I think that, you know, we've got a lot going for us in flavor solutions to support that strong growth in a more efficient way.\n\nAs a margin issue on flavor solutions, partly is just the way our contractual arrangements work with our customers, you know, there is a pass-through mechanism for the major raw materials that go into their products. There's a lag to it. In times when inflation was, you know, 1%, 2%, 3%, you know, that flag really wasn't important. But this year, where it's been double-digit, it has been important.\n\nAnd we are going, you know, to catch that up.\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nI think, remember, we've talked about this before, over half of the dilution this year is due to the, you know, cost versus pricing. So, that's just the math that we'll get back over time. Also, you know, these projects, Lawrence mentioned, there's a lot of double running costs as we bring those big projects up like U.K. Peterborough that eventually will go away.\n\nSo, that will help the margins, too. To your point, though, about -- are we spread too thin? I was actually at the flavor division back in 2005 when that was identified. There's no comparison to today. It's really focused and, Brendan, why don't you --\n\nBrendan Foley -- President and Chief Operating Officer\n\nI was just going to say, Mike, one thing I would add there, Rob, is the composition and the profile of our business is so different to 2005. And this -- our strategy to keep driving and evolving the business toward that higher value-added portfolio is what you're seeing in our business, you know, portfolio today. And so, there's a very different, I think, set of conditions compared to, you know, the point you referenced.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nAnd we have done a lot of portfolio pruning behind the scenes as we -- especially as we went through, you know, these last three years, where the extraordinary growth, you know, that we have in the parts of the business that we're focused on, you know, more than made up for parts of the business where we were getting out of, you know, low-margin, high-touch businesses. And I think it's been a self-reinforcing strategy. The migration of our business more and more toward, you know, the value-added, technically insulated, and flavor end of the spectrum has made our product wins stickier and our R&D teams more able to work on new business, not focused on constantly rewinning bid business.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nGreat. I'm sorry to bring up 2005, but we're all old, and we all remember it. So, maybe just one follow-up. Of the $70 million or so of profit decline this year in flavor solutions, can you quantify how much of that is just pricing catch-up?\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nI would say -- I wouldn't -- I think the bigger bucket is actually some of the excess costs that we've talked about, and which actually would have driven more sales if we could supply it. But the excess cost that we -- you know, for the reason we called down our pre-announcement was we haven't been able to get those out of the system yet. You know, pricing is a bit behind. I mean, the thing that gives us the comfort that we're going to recover more margin flavor solutions is because we've seen it in consumer.\n\nYou know, consumer is turning positive from a gross margin and an operating profit perspective as pricing wave comes through, and you'll see the same in flavor solutions. But I don't have the exact number for you.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question is from the line of Steve Powers with Deutsche Bank. Please proceed with your question.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nYes. Hey, thank you, and good morning.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nGood morning.\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nGood morning.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nPicking up on that last thread, on the pricing catch-up in flavor solutions, can you talk a little bit about the expected timing of that and cadence of that? Because it seems like, you know, most of it or a good portion of it should be, I think, foreseeable just based on the timing of, certainly, contracted adjustments in pricing and contract renewals and that kind of thing. So, is it a -- should we be expecting a relatively smooth catch-up from here? Or, you know, is it -- is there a reason to believe that you can -- that the catch-up happens on a more accelerated timing.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nI'd rather describe it more in terms of our gross margin trajectory than to talk about pricing specifically because I'm worried that it's going to get into things that might have set our customers. But you can see the margin trajectory on this business beginning to turn. We talked about an inflection point. You know, flavor solutions margins have been ticking down, you know, through the second quarter of the year.\n\nThey're turning -- the year-on-year comparison has narrowed in the third quarter. And we expect it to continue to narrow and begin a recovery as we go through next year.\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nYeah, I think from a dollar perspective, like I said before, for both consumer and flavor solutions business, we will catch up on the cost next year. We just took branded food service. That's a part of labor solutions, along with our consumer business, at the beginning of the quarter. That will be a positive going into next year rapidly.\n\nSo, yes, there's no like one big bag, you catch up. It's over time. But in 2023, we will catch up.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nOK. OK. And on the manufacturing start-up costs, are those -- you know, I guess, what inning are we in there? And how much of that remains versus is in the rearview?\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nYou know, I would say -- I mean, from a -- you're always going to have some of these programs just to say that. So, you're always going to have some of this. I think this year is kind of a high watermark that we should get some get in next year. But, you know, some of these programs take, you know, a bit of time to get fully, fully done.\n\nThese are big programs. I mean the project -- we just shipped our first panel, as Lawrence said, out of our big northeast distribution center. But, you know, we want to -- over time, into 2023, we'll be moving parts of our business into that. So, you know, there'll be a bit of inefficiency there.\n\nBut --\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nYeah. And I want to just emphasize that the things that we talked about on the call in terms of getting out the -- on our prepared remarks in terms of getting at the cost, for example. So, I don't want to overly focus on any one particular thing and give it too much weight. You know, we were sharing, you know, examples.\n\nAnd when we next report in January, we'll be able to give some progress updates on those exact examples, as well as for other actions.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nOK. Thank you. If I could, just one little housekeeping, sorry if I missed it but -- just was there anything notable that caused -- that resulted in reported EBIT this quarter coming in above what you had pre-announced at quarter close? Just anything as you close the books that was --\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nI mean, like we said, we've preannounced -- we haven't closed our books yet, so these are all estimates. And we felt pretty good where we landed. I mean, there was a couple of things. Tax came in a little bit more favorable at about penny, some other SG&A things given a little bit more favorable, but nothing material and so --\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nNo one --\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nLanded right where we thought.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nYeah. I mean, when we pre-announced, it was our -- it was --\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nWe had a little bit more visibility on the sales versus profit. And, you know, between Q3 and Q4, there's a little shift.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nYeah. OK. Thanks so much.\n\nOperator\n\nOur next question is from the line of Chris Growe with Stifel. Please proceed with your question.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nThank you. good morning.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nHey, good morning, Chris. Sorry, it was hard to get in.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nHi. No, no worries. No, thank you for accommodating my question. I appreciate it.\n\nI just wanted to give a couple of, I guess, follow-up questions. I just want to be sure on that lag in pricing in flavor solutions. When we talked some of the pass-along features of that business, that had typically been like a one-quarter lag. Is that still the case? Or have you caught up now when you talk about pricing being over inflation, have you caught up with that? And I guess, I just want to also understand, was that a factor weighing on profit in the quarter? Or was it more just the supply chain challenges?\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nWell, of course, it was a factor weighing on profit in the quarter end and has been all year. You know, again, every customer has got a different contractual arrangements. I think about a quarter lag is a good way to think about it. But remember, costs keep coming in.\n\nI mean, we didn't just get, you know, cost inflation, you know, on January 1 and price for it. You know, these costs have been steadily increasing, you know, all year, and in fact, continue to increase. The inflationary outlook has not settled. So, there's been a bit of a -- we've gotten -- we've passed costs through, but there's been a bit of chasing it, as costs have continued to go up.\n\nI'm going to let Brendan comment on this a little further.\n\nBrendan Foley -- President and Chief Operating Officer\n\nWell, it's true. I think just, you know, the thing I would key in on is there is -- unlike, let's say, our consumer and our flavors -- our branded food service business, there's not, you know, sort of one moment in time where, you know, that pricing is, therefore, effective in the business. And so that's another way to maybe think about it, Chris. And I think just to build on part of your question, you know, certainly, supply chain, as we've been talking about quite a bit in the prepared remarks, you know, were certainly an influence on how we're looking at that.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nOK. Thank you for that. And then just to understand, if I'm hearing it properly. But like the pricing should accelerate in the fourth quarter, it sounds like there will be, again, some continued catch-up in pricing.\n\nI guess that's true for flavor solutions. As I think about consumer, is that one where we should expect incremental pricing based on what you've announced so far. Not asking for anything new there, but I also want to understand maybe how you're utilizing promotional spending there, you know, as a means of trying to trying to attack those price gap issues in some areas of the business there.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nI think you've got -- I'm going to try and unpack that in pieces. We have been guiding all year. And it -- and you can see it coming through now and not just in our reported numbers, but also through the scanner. But we would have more pricing in effect in the second half of the year, especially going into the fourth quarter than we have -- you know, than we did in the early part of the year.\n\nWe've -- in the Americas, you know, this year, you know, taken a number of rounds of pricing that included the most recent one being here right at the beginning of the fourth quarter. And so, there is more pricing in effect now about our consumer business primarily there. And so, you can see that coming through now. And really, other than the contractual windows that we were just talking about in flavor solutions, we largely have our actions for this year in place as we're looking ahead to 2023 now.\n\nI think that, in Asia, we've got one more round that goes into effect actually this month. But really, our 2022 actions are away. And I gave such a long answer to that, but I forgot the second part of your question. But I'm going to let Brendan answer it.\n\nBrendan Foley -- President and Chief Operating Officer\n\nSo, I think where you were going was just looking for some context around promotional spending. And I think, you know, the context we provide is as we go into the holiday, you know, we feel really good about our supply. We have a strong program, you know, planned for the holiday season, as we would, you know, every year. But it certainly feels, you know, I think, a little bit more robust now compared to, let's say, '21 and '20 just because we're in a better situation from the standpoint of the overall context in the market.\n\nSo, we are turning back on promotions where we feel really confident about supply, and we're looking at the holiday season that way. Those choices are not necessarily connected to any pricing decisions we're making in the market, but really to support of the business and helping to drive the category for our retailers.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nYeah. And I would say that our supply situation on the consumer business, you know, going to holiday is the best it's been in the last several years.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nThat's great. Thanks for all that context. I appreciate it.\n\nOperator\n\nThank you. Our next question comes from the line of Andrew Lazar with Barclays. Please proceed with your question.\n\nAndrew Lazar -- Barclays -- Analyst\n\nGreat. Good morning, everybody.\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nHi.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nHi. Good morning, Andrew.\n\nAndrew Lazar -- Barclays -- Analyst\n\nMaybe to start off, I think when you had pre-announced results for the quarter, one of the factors that you had highlighted in the consumer business was that sort of private label price points at some retailers on shelf had not yet really sort of moved upward, leading to some price gaps that get wider maybe than you'd like or had been anticipated. And if I missed this, I apologize. I didn't know if that you've seen any movement there yet, or have heard of any movement that's likely to happen on that front.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nRight. Andrew, no one has asked that yet. So, I'm glad that you did. You know, not only a very short time since we pre-announced, and so we don't have a lot of new information on consumer behavior or on retailer behavior.\n\nI'll let Brendan give some color on that, and then I'll take it back.\n\nBrendan Foley -- President and Chief Operating Officer\n\nYeah, I think, Andrew, things are largely, you know, consistent with what we had discussed or shared, you know, broadly within the last four weeks. So, we haven't really seen a lot of new information or data. They seem -- this price gap seem to be kind of, you know, holding in the very same range that we talked about before. And -- but, you know, we still are a leading supplier of private label into the category.\n\nAnd, you know, we're passing those price increases along to, you know, customers just as we have on branded products. And that's a retailer-by-retailer decision, I think, on, you know, what gets realized itself. But in the meanwhile, we're still driving a lot of that value programming that we had talked about, whether -- not only our messaging, but also, you know, we're seeing a lot of lift in -- you know, some of those parts of our portfolio, you know, tend to drive more value. We offer -- our offerings are really across the spectrum, you know, that would meet consumers' needs.\n\nAnd we're seeing growth on the premium end, we're seeing growth on the value end. In parts of our business like Gourmet Garden, which tend to be on the premium end, we're actually doing really well, you know, in this context. And then we see our value sizes like super deal performing very strongly, you know, also off-shelf and in the market. And then we're introducing, you know, more value into the market through this opening price point, Lawry's program.\n\nAnd we're also doing that in other parts of our -- in other markets around the world where we're -- you know, and many of them were launching resealable pouches that are larger than usual and allow consumers to kind of realize, you know, more value that way. But that's probably the added context I would share, you know, since the last month.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nYeah. And, Andrew, it isn't exactly what you've asked, but it gives -- give me a chance to talk about this a little bit. I want to emphasize that, you know, we have in our offering items for every price point and every retailer strategy and category from the premium end, all the way down to opening price points and private label, we spent a fair bit of time talking about, you know, the consumer that's under pressure. And rightly so, you know, we are concerned about pressure on the consumer, especially, the consumers on the lower half of the income spectrum.\n\nAnd we want to make sure that our products are accessible and approachable. But the gourmet and premium end of our business is still very strong. And sometimes, those price gaps can be exaggerated. And Brendan mentioned large size and super deal.\n\nThe Nielsen data is a pretty blunt instrument when it reports unit price. It doesn't catch the fact that, you know, some of these value packs are really big and carry a high price point. If you adjust that out, you know, the lower-size packs that are growing strongly for us and that price gap actually narrows quite a bit.\n\nAndrew Lazar -- Barclays -- Analyst\n\nThat's a very helpful perspective. Thank you. And then I know we're running short on time. Just a quick one.\n\nObviously, we're not at a point where you're going to get too specific at all about next year, of course. But, you know, with sort of the inflection that's starting to happen in pricing, the new cost saves, you know, and margin recovery actions that you've kind of highlighted today, I guess, consensus already has McCormick sort of getting back to what we'll call more of an on-algorithm type of earnings growth next year, particularly as you would deem, I think, you know, a bunch of the things you talked about impacting this year is somewhat more transitory, you know, as you improve them going forward. So, I didn't know if there were even just any broad comments around that, you know, whether there's a need, you think, to lean in right on the marketing side going into next year, just given whatever the value orientation of the consumer or some of the new product innovations you've got planned? Or just things larger puts and takes that we should sort of think about, you know, as given how, I guess, the Street has already started to sort of lock in expectations for next year? Thanks so much.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nSo, I will start with the caveat that we're not going to give any guidance for 2023. Right now, I've got -- everyone is standing around here with -- holding their breath -- whether I'm going to say something rash about that. But -- so, it is a bit early for that. And I appreciate saying confidence in the investment community that's reflected in those consensus outlook.\n\nBut there are some big puts and takes. I'm going to let Mike talk about those.\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nYeah. Obviously, a big wild part for next year is the inflation environment. So, we're in the process now actually rolling up budgets and things like that, taking a look that drives pricing actions. Obviously, some of the other puts and takes you think about, you know, interest expense.\n\nObviously, some of the actions we took this year might be a negative for next year. This cost pro we talked about, which we're going to give you a lot more detail in January. So, you know, I'd say, right now, there's so many big moving parts, it would be hard even to give you any guidance about.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nAnd frankly, incentive comp has to be rebuilt.\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nRight.\n\nAndrew Lazar -- Barclays -- Analyst\n\nYup. Thank you.\n\nOperator\n\nOur next question is from the line of Adam Samuelson with Goldman Sachs. Please proceed with your question.\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nYes. Thanks. Good morning. So, a lot of ground has been covered.\n\nI wanted to just come back to flavor solutions quickly and just the way you'd characterize kind of the business performance on the strong demand. And I guess I'm trying to -- volume mix in the quarter was up 80 basis points. And so, I'm just trying to get a little bit more color on kind of the pieces within the flavor solutions business because it's not really one business. It's a collection of a bunch of them.\n\nIt would seem from the way you characterize some areas of strength that maybe some of the higher-value flavor businesses were at or below kind of segment average growth? And just, a, is that the right calibration? And b, just any color on the growth of the -- some of the different pieces?\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nYou know, I'll start with the pick of the part of it that was weak. We had strong performance on flavor solutions in that segment across the globe and really all segments. I'm sorry, I'll -- not to say all regions and all of the pieces of it. Well --\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nMaybe a little bit out -- maybe we did talk about a month ago, I mean, some of the challenges on flavor solutions this year were cost related to plaque constraints. We could have sold more. We could have had higher volumes than you noted. So, I think from that perspective, you know, some of the actions we've talked about it more capacity will help.\n\nBut the demand is very strong.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nDemand is very strong.\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nOK. All right. I just -- I guess, relative to historical performance of that business, the 80 basis points of volume mix growth. And I know there's noisiness in the comps with COVID recovery, and it's a lumpy business that doesn't always -- usually that business could be stronger than 80 basis points of volume mix.\n\nSo, I'm trying to get the calibration of that.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nYes. We had enormous price -- 10% pricing, we feel pretty good about.\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nOK. And then just quickly on SG&A, and you alluded to in thinking about '23 a little bit. But it would seem like the way the gross margin and EBIT guidance lays out implied for the fourth quarter that total SG&A is going to be down high single digits. A, is that kind of the right calibration? And within that, just how much is incentive comp resetting lower talk about kind of the declines in SG&A dollars that you've seen this year?\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nYeah. I mean, SG&A, you're right, it's going to be down in the quarter, and it's primarily driven by the incentive comp. We're also getting higher fixed cost leverage, too, as you think about it. But, yeah.\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nSo, is most of that decline in incentive comp, as we think about the headwind, that would be rolling into next year?\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nI mean we adjust incentive comp every quarter, so I wouldn't take one quarter then try to extrapolate the next year.\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nOK. All right. I appreciate the color. Thank you.\n\nOperator\n\nThank you. Our final question is from the line of Peter Galbo with Bank of America. Please proceed with your question.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nHi, guys. Good morning. Just two really quick ones for me. Maybe just to pick up on Adam's question there.\n\nMike, I just wanted to clarify, the operating margin comment for the fourth quarter of operating margin expansion, that was a year-over-year comment in the fourth quarter, not a sequential?\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nI think both.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nBoth. OK. That's helpful. And then just a broader question on the -- just thinking about the cost savings for next year.\n\nI know we spent a lot of time talking about that. But just as we think about like repatriating production, surge capacity coming down, normalizing inventory levels, like, is there a way to quantify, I would imagine the there's probably a volume impact that comes with that? You know, you'll get the benefit on the cost side, but maybe there's an offset a little bit, at least on topline on volume. Is there any way to quantify that at this point?\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nNo, I don't think that's what we're saying at all. And I think we've quantified the cost benefit, but I don't think that there's an impact on volume at all. I mean, this is a normalization and that we went through this year. And I don't think that has an impact.\n\nOf course, we kind of don't want to get into 2023 guidance. But whatever -- that would all be reflected in whatever guidance we give for next year. And I do want to emphasize that we've spent a lot of time talking about supply chain in our remarks and on the Q&A here. But, you know, I do want to be clear that what's the most important thing, I'm glad you really brought this point up about volume, is that the continued growing demand for flavor and the strong growth of our business that we're fueling with executing on our strategies, and with our passionate and engaged employees is the most important thing.\n\nInflation is a reality and our pricing has caught up with it, we're seeing that coming through in the margin sale, you can see it, you know, see us keep caught up and take the actions that are necessary. And then comes supply chain, that's really kind of the third most important, I think, which is to eliminate the excess of costs and inefficiencies that have crept into the supply chain. So, I do want to keep that in perspective, that growth is still at the top of the heap.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nFair enough. Thanks very much, guys.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nThanks.\n\nOperator\n\nThank you. At this time, I'll turn the floor back to management for closing remarks.\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nGreat, thank you. McCormick's alignment with consumer trends and the rising demand for flavor in combination, with the presence and reach for global portfolio and our strategic investments, provide a strong foundation for sustainable growth. We're disciplined in our focus on the right opportunities and investing in our business. We're continuing to drive further growth as we successfully execute on our long-term strategies actively respond to changing consumer behavior and capitalize on opportunities from a relative strength.\n\nWe continue to be well positioned for continued success and remain committed to driving long term value for our shareholders.\n\nKasey Jenkins\n\nThank you, Lawrence, and thanks to everybody for joining today's call. If you have any further questions on today's information, please feel free to contact me. And this concludes this morning's call. Thank you again.\n\nDuration: 0 minutes\n\nKasey Jenkins\n\nLawrence Kurzius -- Chairman and Chief Executive Officer\n\nMike Smith -- Executive Vice President and Chief Financial Officer\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nBrendan Foley -- President and Chief Operating Officer\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nAndrew Lazar -- Barclays -- Analyst\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nMore MKC analysis\n\nAll earnings call transcripts"
}