{
  "companyName": "ServiceNow, Inc.",
  "companyTicker": "NOW",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/servicenow-inc-now-q3-2022-earnings-call-transcrip/",
  "content": "ServiceNow, Inc. (NOW -0.41%)\nQ3 2022 Earnings Call\nOct 26, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen. Welcome to the ServiceNow Q3 2022 earnings conference call. [Operator instructions] And please be advised that this call is being recorded. [Operator instructions] And now I'd like to turn the call over to Mr.\n\nDarren Yip, vice president, investor relations. Please go ahead.\n\nDarren Yip -- Vice President, Investor Relations\n\nThank you. Good afternoon, and thank you for joining ServiceNow's third quarter 2022 earnings conference call. Joining me are Bill McDermott, chairman, president and chief executive officer; and Gina Mastantuono, our chief financial officer. During today's call, we will review our third quarter 2022 results and discuss our guidance for the fourth quarter and full year 2022.\n\nBefore we get started, we want to emphasize that some of the information discussed on this call such as our guidance, is based on information as of today and contains forward-looking statements that involve risks, uncertainties and assumptions. We undertake no duty or obligation to update such statements as a result of new information or future events. Please refer to today's earnings press release and our SEC filings, including our most recent 10-Q and 2021 10-K for factors that may cause actual results to differ materially from our forward-looking statements. We'd also like to point out that we present non-GAAP measures, in addition to and not as a substitute for, financial measures calculated in accordance with GAAP.\n\nUnless otherwise noted, all financial measures and related growth rates we discuss today are non-GAAP except for revenues, remaining performance obligations, or RPO, current RPO and cash and investment. To see the reconciliation between these non-GAAP and GAAP measures, please refer to today's earnings press release and investor presentation, which are both posted on our website at servicenow.com. A replay of today's call will also be posted on our website. With that, I'll turn the call over to Bill.\n\nBill McDermott -- President and Chief Executive Officer\n\nThank you very much, Darren, and I'll add my welcome to everyone joining today's call. ServiceNow had an outstanding third quarter. Looking at the top line results in constant currency, subscription revenue was 28.5% growth. cRPO growth was 25%.\n\nOn profitability, operating margin was 26%. All three metrics are above our guidance, beating expectations once again. ServiceNow had 69 Q3 deals greater than $1 million. Our U.S.\n\nfederal business had its best quarter ever in Q3. We saw strength across industries and business segments. Our performance was consistent globally with Europe executing especially well this quarter. Our renewal rate remains best-in-class at 98%.\n\nWe are the largest organically grown enterprise software company. We have an unmatched combination of organic growth and profitability at scale. As these Q3 results demonstrate, we fully intend to maintain this leadership position. Regarding the operating environment, in recent quarters, we said that secular tailwinds were stronger than macro crosswinds.\n\nThey are. Nothing we saw in Q3 changes this core thesis. Digital technology is a deflationary force. The enterprise digital transformation market is validated.\n\nThe investment thesis is stronger than ever. Hybrid multi-cloud deployments, adoption of a modern data infrastructure stack, cybersecurity and risk management, AI and data analytics, remote work and collaboration, these trends are not only durable, their relevance is expanding. There'll be 750 million new applications built by 2025. In the U.S.\n\nalone, nearly 100 million workers will remain in hybrid environments. 27 billion connected devices will drive more data in cloud over the next three years. And ServiceNow's platform directly addresses all these challenges, which translates to numerous growth vectors for our business. I hear one thing from CEOs consistently.\n\nAnything we prioritize must generate results in weeks or months. This is the essence of the great reprioritization. In past decades, waves of enterprise systems were introduced to meet market challenges of those times, operating systems, databases, applications. What we see now is a generational shift from architectures built in the lab sentry to platforms engineered for this one.\n\nIf you look at the ERP market, we see customers at various stages of their move to the cloud. Some of the world's largest manufacturers, for example, are consolidating hundreds of old procurement processes into a modern workflow experience. This declutters the legacy environment, driving more than $1 billion in cost efficiencies for just one of our many ERP wins this quarter. We could do it because ServiceNow was born in the cloud.\n\nWe integrate with everyone. We meet our customers wherever they are, any environment, any organizational structure, any operating model. Where there is complexity, we simplify. We are fast to deploy, fast to generate ROI.\n\nIn this need for speed environment, the ServiceNow platform is becoming the strategic center of gravity for our customers. In light of this, today, we're announcing a new initiative: RiseUp with ServiceNow to skill 1 million ServiceNow certified professionals by 2024. Our customers, partners and ServiceNow itself are all growing as ServiceNow workforces. We see opportunity everywhere.\n\nWith RiseUp with ServiceNow, we'll give people the knowledge to seize it. Overall, the demand environment is strong. The market opportunity is growing. The ecosystem is expanding.\n\nServiceNow is a growth company on every level. We see the growth across multiple buyer personas as customers consume more of our expanding solutions portfolio. In Q3, both ITSM and ITOM were in 17 of our top 20 deals, with six deals each over $1 million. Security and risk were in 15 of the top 20 with five deals over $1 million.\n\nCustomer and Employee Workflows were each in 12 of the top 20. Once again, we saw Creator Workflows in all the top 20 deals with nine deals over $1 million. Customers view ServiceNow as mission-critical. The Defense Logistics Agency works with ServiceNow to support the global defense supply chain with automated workflows.\n\nFaced with the crisis of Hurricane Ian, state of Florida worked with ServiceNow to deploy a mission-critical application to manage requests from people searching for their loved ones. In crisis situations, weeks to deploy isn't an option, which is why the state did it on ServiceNow in a few hours. Deutsch Telekom provided KPN works with ServiceNow to reduce their order management process from three days to under a minute, saving millions. Thank you.\n\nThese stories are everywhere. In fact, one CEO chose ServiceNow for the first time said it best to me personally. It's always easier to make a strategic partner decision when you trust the people on the other side of it. In late September, we announced the ServiceNow Tokyo release.\n\nWe delivered AI-powered task intelligence, which is all about making the customer service agents like more productive, reducing manual effort, speeding time to resolution and improving the customer experience. On the revenue-facing side, we delivered enhancements to order management, including support for bundling, configurable products and pricing models. We delivered major advances in field service operations and dispatch with scheduled optimization and territory planning. These capabilities help our customers better manage their costs but also their ESG footprint.\n\nAt a moment when customer service is at the very top of C-level agenda, ServiceNow's net new innovation is driving and transforming the front office. The technology leaders, we released a new service operations workspace which will deliver faster incident resolutions to keep people highly productive. And given the ongoing migration to the cloud, we released a new licensed cloud cost simulator so leaders can model the cost benefits by moving from on-premise to cloud deployments. The Tokyo release contains many more new features across each of our major workflow businesses, technology, customer, employee and creator.\n\nIt is the latest demonstration that ServiceNow's products and engineering machine is the best in the world, the best in class, like no other. And speaking of best-in-class, I've been lucky enough to learn from one of the greatest innovators at the 21st century. Fred Luddy and I have been on a multiyear journey together, one built on love and mutual respect. At this week's board meeting, I was honored to take on the role of chairman, with Fred remaining an active member of our board for the long term.\n\nFred remains the soul and inspiration of ServiceNow, and I'm honored to call him our founder and my personal friend. In conclusion, we again delivered on our promise in Q3. We said the company would continue its SaaS growth in any operating environment. We did.\n\nWe said that cRPO growth would accelerate during H2. As our Q4 guidance reflects, it is. We said that we preserved the benchmark near the Rule of 60 for the full year and constant currency. We are on track.\n\nServiceNow has a revenue growth, predictability of growth and sustainable business model. While others are managing the past, our engineers are innovating for the future. The fundamental question facing enterprises today is this: can modernization wait? With the robust demand environment we see, the answer is a compelling no, it cannot. The stated ambition of ServiceNow remains.\n\nWe will be the defining enterprise software company of the 21st century. We are firmly committed to that journey. We are focused on value creation for our customers, our partners, our colleagues and our shareholders. Our confidence in Q4 extends to 2023 and beyond.\n\nSales capacity and pipeline coverage are higher today than at any point this year. We have best-in-class sales and marketing efficiency. We have a highly differentiated platform. We have a business model that will be managed by design for net new innovation, growth and profitabilities you can count on.\n\nWith this growth and margin profile, operating near the Rule of 60, ServiceNow is a unique asset and a premier company. We are hiring with an absolute focus on people who can innovate through code and who could sell solutions and who can help customers realize success. The bottom line is this. When our customers work, the world works better for everyone.\n\nThat's why the world works with ServiceNow. If we didn't do what we do, it wouldn't get done. The hallmark for ServiceNow is net new innovation. And with that in mind, I thank you so much, and I'll hand things over to Gina.\n\nGina Mastantuono -- Chief Financial Officer\n\nThank you, Bill. Q3 was a fantastic quarter of execution. The team delivered strong results, beating all of our constant currency growth and operating margin guidance metrics, an outstanding performance across the board. Investments in digital transformation are a necessity, and ServiceNow remains a strategic priority.\n\nCEOs recognize that the Now Platform can deliver the workflow needs for their digital-first initiative while driving quick time to value and hard dollar savings. These outcomes are imperative in the current macro environment and while we continue to see robust demand for our products. In Q3, subscription revenues were $1.742 billion, growing 28.5% year over year in constant currency, exceeding the high end of our guidance range by 100 basis points. RPO ended the quarter at approximately $11.4 billion, representing 24.5% year-over-year constant currency growth.\n\nCurrent RPO was approximately $5.87 billion, representing 25% year-over-year constant currency growth, a 150 basis points beat versus our FX-adjusted guidance. 50 basis points of the beat was driven by early renewals from Q4 as the team looks to get ahead of our large renewal cohort. Our renewal rate was a best-in-class 98%, continuing to demonstrate the stickiness of our business as the Now Platform remains a mission-critical part of our customers' operations. We finished the quarter with 1,530 customers paying us over $1 million in ACV, up 22% year over year.\n\nThe number of customers paying us over $10 million in ACV grew 60% year over year as our cohort expansion remained healthy. From an industry perspective, net new ACV growth was led by retail and hospitality, up nearly 50%, followed by strength in education. Manufacturing had a good quarter as well, led by a large eight-digit deal, and technology, media and telecom continue to show durability. Federal had its best quarter ever, including an over $20 million net new ACV win.\n\nWe closed 69 deals greater than $1 million in net new ACV in the quarter, including five with new logos. What's more, each of those five deals were led by a different product. That diversification showcases the breadth of our product portfolio and increasing customer awareness of ServiceNow's capabilities as a platform, which includes 11 organic businesses with over $200 million in ACV. In fact, 18 of our top 20 deals contained five or more products.\n\nTurning to profitability. Operating margin was 26%, one point above our guidance, driven by our top line beat and operating efficiencies. Our free cash flow margin was 6%. We ended the quarter with a healthy balance sheet, including $5.5 billion in cash and investments.\n\nTogether, these results continue to demonstrate our ability to drive a strong balance of world-class growth and profitability. Before I move to guidance, I want to give a brief update on the macro. Our ability to outperform in Q3 is a testament to the strong execution of the ServiceNow teams. Account executives are staying close to the customer, constantly checking in and proactively assembling the necessary materials to get deals across the line.\n\nWe will operate with the same rigor in Q4 and are confident that we're factoring in the macro trends into our guidance. Consistent with the market on a year-over-year basis, the strengthening of the U.S. dollar also resulted in incremental FX headwind. We now expect a $290 million headwind to 2022 subscription revenue, a $330 million headwind to Q4 cRPO, 100 basis points headwind to operating margin, an approximate $160 million or 100 basis point headwind to free cash flow margin for 2022.\n\nWith that in mind, let's turn to our 2022 outlook. We're revising our subscription revenues range to between $6.865 billion and $6.870 billion, representing a raise to our year-over-year constant currency growth outlook to 28.5% and excluding a 550 basis point FX headwind. We continue to expect subscription gross margin of 86%, up 100 basis points year over year. We continue to expect an operating margin of 25%, consistent with our original guidance at the beginning of the year as we are offsetting incremental FX headwinds with operational efficiencies and disciplined spend management.\n\nWe now expect capital margin of 29%, reflecting the incremental FX headwinds I previously noted. Despite the $160 million impact of FX, we will generate over $2.1 billion of free cash flow, demonstrating the incredible resilience of our business model. Finally, we expect GAAP diluted weighted average outstanding shares of 203 million. For Q4, we expect subscription revenues between $1.834 billion and $1.839 billion, representing 26% to 27% year-over-year growth on a constant currency basis, excluding a 600 basis point FX headwind.\n\nWe expect cRPO growth of 26% on a constant currency basis, excluding 600 basis points of FX headwinds. We expect an operating margin of 26%, and we expect 204 million GAAP diluted weighted average outstanding shares for the quarter. In summary, we had a fantastic Q3. I'm so proud of our people for being focused, disciplined and committed to helping our customers succeed.\n\nBill and I would like to thank all of our employees around the globe for their continued hard work and dedication. Our business is resilient, our teams are delivering, and we're as confident as ever about the future. We have the platform enterprises need to reinvent their business models and adapt to the new economy so they can innovate to win and come out of this moment stronger than ever. We continue to see a robust pipeline and are maintaining our investments in growth hires as the opportunity in front of us remains large.\n\nWe're well on our way to becoming the defining enterprise software company of the 21st century. With that, I'll open it up for Q&A.\n\nOperator\n\nThank you very much, Ms. Mastantuono [Operator instructions] We go first this afternoon to Samad Samana at Jefferies.\n\nSamad Samana -- Jefferies -- Analyst\n\nHi. Good afternoon, and thanks for taking my question. It's great to see strong results. Bill, maybe I'll start with you.\n\nYou've been telling us, as you noted on the call that ServiceNow is going to grow durably regardless of the environment. I'm just wondering if maybe either the shape or the nature of the conversation that you're having with executives has changed in this type of environment, and how that's ultimately still allowing you to close all of these large deals and maintain this momentum.\n\nBill McDermott -- President and Chief Executive Officer\n\nYeah. I think Gina said it very well, Samad, when she said we're mission-critical and the Now Platform has really become the standard for digital transformation in a modern enterprise today. And we're solving so many challenges. Our customers need to drive automation and productivity.\n\nAs you know, they're either not hiring, they're laying people off and they have to do more with less. We're built for that. They need the computers and the platforms to do the work so that people have a more pleasant experience on the employee side, and they require an experience no matter where they're working from that's world-class. We take care of that.\n\nThe customer service management has evolved from just the engagement layer of how I market to you, sell you, cross-sell you. It's really moved into the mid-office and the back office and back into the supply chain on how I can streamline with great efficiency, giving you the right product and the right form factor and price on time just as you expected it. And that end-to-end is all about the ServiceNow platform. And finally, you're seeing a breakthrough here on building net new innovation.\n\nCustomers are going to have to do that for themselves and with partners. And we are also going into a co-creation mode with our partners in every industry and geo around the world. That's pretty stunning, and there's lots of use cases and examples. The big thing, Samad, is that C-level executives are looking to ServiceNow.\n\nThey are calling us. They want to work with us. They see that we're the defining one. And that took some time to build and I think we're there now.\n\nSamad Samana -- Jefferies -- Analyst\n\nWell, the growth is incredibly impressive. And Gina, maybe just a quick follow-up for you. On the comment around factoring macro, can you maybe just help us understand, last quarter, you called out slightly longer deal cycles. Any change, can you just dimensionalize what you factored in from a macro perspective as it relates to maybe deal cycles or close rates? Thank you so much.\n\nGina Mastantuono -- Chief Financial Officer\n\nYeah, it's a great question. And certainly, we are not immune to the macro environment, and we're certainly not blind to what's happening around us. Our ability to execute despite the macro is quite astounding. And I give amazing kudos to our incredible sales organization around the world.\n\nWe are staying closer to our customers than ever before, checking in with them, making sure we understand the levels of approval that they need to go through, making sure that we understand what they need to get that deal across the line. We will maintain that level of rigor that you've seen us do in Q3. And so while, certainly, there's more outlook on deals that are getting closed and there's more -- people are looking at deals closer, but we are closing them. Close rates are stronger and we feel really good about how we put that all into our guidance.\n\nAnd so macro is evolving but our sales force is staying so close to our customers and really driving superb execution.\n\nSamad Samana -- Jefferies -- Analyst\n\nGreat. Congrats.\n\nBill McDermott -- President and Chief Executive Officer\n\nThank you.\n\nGina Mastantuono -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] We go next now to Phil Winslow at Credit Suisse.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nHey, yeah. Thanks for taking my question, and congrats on just an awesome quarter. Bill, one of the things that you mentioned during your comments was sales capacity has never been higher and never has, and the coverage ratio for the year has not been higher. This is even on the context of growing sales and marketing headcount 30%.\n\nMy question to you is, this is one of the biggest net add quarters in terms of employees in sales and marketing this year and over the past couple of years. You usually don't see a lot of salespeople moving to a new company in Q3 but they're doing that to ServiceNow. When you talk to these new employees and your management team, what are they saying about why they're coming to ServiceNow? And then Gina, you talked about continuing to invest in go-to-market there. You obviously hit 30% growth in Q3.\n\nHow should we think about the exit rate for this year? Thanks.\n\nBill McDermott -- President and Chief Executive Officer\n\nWell, Phil, thank you very much for your kind remarks and also the question. If you think about the first quarter of the year, the economies of the world really weren't shaking. Everything was going very well. And especially a tech company like ServiceNow, people were very desirous of having our people, too.\n\nBut we still weathered that and we continued to hire. And obviously, the people that you hired in the second and the third quarter, the beauty of that is they're now becoming truly productive and certified to execute at a level that we would consider statistically relevant for moving the needle. And that's where I come with my max capacity. It's not just based on the number of people, but it's based upon their readiness to enter into the customer relationship with a level of proficiency so they can execute at a high level.\n\nThat's what I'm talking about. And we're there now. And we're there stronger than we were all year long, Phil. So it's in absolute numbers.\n\nBut it's also on readiness and it's in the pipeline and the coverage in the pipeline is better. So all those dials look great. In terms of why people come here, they come here for the culture. They know that this is all about net new innovation.\n\nIt's all about customer centricity and brilliant execution and it's a politically fat-free environment. We just want to win, and people want to be a part of a winning organization.\n\nGina Mastantuono -- Chief Financial Officer\n\nAnd then on your question on actual sales and marketing hire, Phil, yes. ServiceNow is hiring and will continue to hire and are investing for growth. So we are absolutely committed to continuing to build up our world-class, go-to-market organization. And it's all about driving long-term growth and ensuring that we also are continuing to drive ramp rep productivity.\n\nIt's really about ensuring that the opportunity that we see in front of us, that our sales and go-to-market teams are ready to drive that growth that we continue to see. So you'll see us continue to grow our sales, quota-bearing especially. We'll also be hiring our critical engineering heads. We're very much open for hiring these critical growth hires.\n\nBill McDermott -- President and Chief Executive Officer\n\nAnd one thing, Phil, I just don't want to fall between the cracks, is the 1 million in the RiseUp with ServiceNow campaign, where we're going to hire them. Some of them will end up getting hired here, of course, but we're going to train them for our customers, for our partners and to ServiceNow. So there's a bold move for 1 million ServiceNow-trained professionals to put them into the growth engine of ServiceNow. And that will be done on a global basis.\n\nWe see bold moves that need to be taken in India, Japan, Korea and continued expansion in Europe. We just have a tireless appetite for growth.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nExcellent. Congrats again, and thanks for taking my question.\n\nBill McDermott -- President and Chief Executive Officer\n\nThank you, Phil.\n\nOperator\n\nThank you. We go next now to Sterling Auty at MoffettNathanson.\n\nSterling Auty -- MoffettNathanson -- Analyst\n\nYeah. Hi, guys. My question is, when you look at the large deal activity in the quarter and the pipeline, how much of that is actually replacing legacy architectures to save money in this tough budget environment we're heading into? And how much of it is about that automation to drive increased productivity?\n\nBill McDermott -- President and Chief Executive Officer\n\nThank you, Sterling. It's an interesting question. It's always important to reinforce that the 20th century architectures were heavily invested in by our customers. And our desire is not to replace them.\n\nOur desire is to make them more relevant so they deliver modern value and a highly agile and experience-oriented way for employees, customers and partners. So those underlying systems, some of them that are point solutions, and they never should have been there in the first place, they do disappear. The core large, well-known brand systems, they remain, but with the agility of the ServiceNow platform above them and our ability to automate the workflows and completely change the experience set, we're now reinventing the way supply chains run for the biggest auto manufacturers in the world. We're now taking procurement management to an entirely new level of procurement and finance organizations for the biggest retailers, manufacturers, freight companies around the world.\n\nThey were double-digit wins, doing this for some of the largest companies in the world. So they're taking out huge costs. They are getting rid of point solutions. They're keeping the main ones and then they're automating for speed and agility and value on the ServiceNow platform.\n\nThe business cases are unbelievable. It makes one ask, why are we so generous with our pricing? If they can get $1 billion, can't we get a little more? That's the situation we're in here.\n\nSterling Auty -- MoffettNathanson -- Analyst\n\nThank you.\n\nBill McDermott -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nWe'll go next now to Keith Weiss of Morgan Stanley.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nExcellent. Thank you for taking the question, and Bill, congratulations on the new Chairman position, and congratulations on a great quarter in a difficult environment. My question is actually for Gina. You guys did a tremendous job in driving operating margins.\n\nAt the same time, you're hiring to plan, right? And you're still aggressively hiring. Can you, one, talk to us a little bit about where you're seeing the efficiencies and sort of where you're able to kind of drive that incremental productivity out of the entire ServiceNow? And two, I was wondering if you could touch on free cash flow a little bit. It has been getting more seasonal over the years. This is the lowest free cash flow margin we've seen in quite some time.\n\nWere there FX impacts? Was there increased seasonality? If you could just give us any kind of visibility in terms of what happened on that side of the equation.\n\nGina Mastantuono -- Chief Financial Officer\n\nYeah, absolutely. Great question. So really proud of the fact that despite about 100 basis points of FX impact on our operating margins, we're able to hold them flat with our original guidance at the beginning of the year, while at the same time, still hiring for quota-bearing, go-to-market, fingers-on-keyboard engineers, right? And the efficiencies that we're seeing are across the board. So if you think about leverage in mid- and back-office G&A, leverage on the marketing side of things, if you think about really what our incredible cloud infrastructure team is able to drive with respect to efficiencies even in this macro environment, it's pretty remarkable.\n\nAnd so the other thing is that our platform drives efficiency for ourselves. We are the customer zero for all of our new product innovation, so our platform enables those efficiencies across the board. So that's the other big lever that we always have to play here. So feel really great about the fact that we've been able to drive those efficiencies even through this current macro environment.\n\nWith respect to free cash flow, absolutely. So Q3, in general, is a lower free cash flow period. We have our midyear bonus payout. We have bond interest payout.\n\nBut we also have seen a pretty big FX impact in the quarter and for the remainder of the year. So we talked about 100 basis points impact on free cash flow margin that we're not able to absorb this year because truly the impact on collection happens all at once, whether the FX impact on your P&L because of the ratable way that we recognize revenue and FX happens over a period of time. And so underlying health of free cash flow remains great. We're obviously, as we talked about, staying close to our customers and giving them some leeway on payment terms if they need it.\n\nBut what I can tell you is that it's days as opposed to weeks. And so we are really staying close to the customers. The trajectory of free cash flow accretion over time remains the same.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nGot it. So it sounds like much more linearity and FX headwinds than any significant change in invoicing terms or payment terms.\n\nGina Mastantuono -- Chief Financial Officer\n\nExactly. Exactly.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nAwesome. It was very clear. Thank you very much.\n\nGina Mastantuono -- Chief Financial Officer\n\nThanks, Keith.\n\nBill McDermott -- President and Chief Executive Officer\n\nThank you, Keith.\n\nOperator\n\nThank you. We go next now to Matt Hedberg of RBC Capital Markets.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nGreat. Thanks for taking my questions, guys. Bill, Gina, great quarter. Bill, I had a question for you.\n\nYou've made some previous advances in observability of Lightstep. In this quarter, you acquired Era Software, which looks like a great addition to the platform. Can you talk about sort of what the integration plans are there and sort of maybe refresh what this means for your broader observability efforts?\n\nBill McDermott -- President and Chief Executive Officer\n\nYeah, absolutely. Thank you very much for the question, Matt. Basically, if you look at what we're trying to do here, we are bringing a scalable, cloud-native log management solution and database that complements Lightstep's existing solutions to the world. And this is really exemplifying and accelerating our vision, which is essentially to unify telemetry, logs, metrics and traces and now deliver that truly unified observability workflow on one platform.\n\nAnd this is going to take huge costs out of the equation. And it's going to bring a much greater experience to all users involved because they'll avoid the confusing context switches they have to do now. So all the integration work that is necessary is being done. It is all integrated back onto the Now Platform and there's a road map to do that.\n\nBut right now, we're extremely happy with the way Ben is leading. Era Software just makes us stronger, and we're super excited about the future of this business and what it can be. It's going to be interesting to watch this thing play out.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThank you very much.\n\nBill McDermott -- President and Chief Executive Officer\n\nThank you, Matt.\n\nOperator\n\nThank you. We go next now to Alex Zukin of Wolfe Research.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nHey guys, thanks for taking the question. Bill, I don't think we've heard you say the words procurement and supply chain more often than you have on this earnings call. And I guess I want to dive into that because after seeing SAP's results, after what Oracle was talking about, it does feel like there's a -- there's like a deferred amount of activity that's getting done in the back office. And I just want to see your take on kind of participating in that activity as you're talking about that driving, it seems like, some pretty material wins in the quarter.\n\nAnd then I guess maybe a follow-up for Gina is around linearity in the quarter. And also if there's a way to quantify the federal business seems like it, again, had the best quarter ever. Just how much of that was upfront or kind of self-hosted revenue recognition?\n\nBill McDermott -- President and Chief Executive Officer\n\nAlex, first of all, let me thank you for your question. You're right. There's quite a bit that has to be done in the back office to automate business processes for a new world order of things in the macro. So you're 100% right.\n\nIt's still early days, but I see a massive opportunity, given how much enterprises spend on ERP today. And if you look at procurement and supplier life cycle management solutions that make it possible for customers to unify these transactional systems and enable them, through workflow capabilities, that truly drive efficiency. And the user experience and the consumer grade aspect of ServiceNow is really coming front and center because these transactional systems, they all work fine if you're a power user or a super user. But when you start to get more people collaboratively involved in a process, there's a demand now for consumer-grade UX.\n\nAnd there's nothing that works better than workflow automation to solve some of these problems. So we are providing a collaborative platform for all the stakeholders in an enterprise, and that consistent user experience is our superpower. And I do want to underscore, we are not interested or trying to replace the transactional systems of the brands that you mentioned. Those are wonderful companies and they do something that's very important.\n\nWhat we're responding to is the agility of the supply chain and how you can reorient it in record speed because that's what this world order is asking for, how you can rethink suppliers to manage different labor issues, whether it's in arbitrage or just buying from the people you should be based on your ESG efforts, or your MWBE spend and many other things that many customers care a lot about. ESG is a big thing. They're doing that all on the workflow automation context of ServiceNow. And they love the fact that we integrate with everybody, and we're not at war with anybody because we're on the side of the customer and that's what we should all be doing.\n\nGina Mastantuono -- Chief Financial Officer\n\nAnd on your question, Alex, on linearity in the quarter, we actually had great linearity in Q3, our best ever. Really, really pleased with how the sales organization is, again, staying really close to the customers. Federal business had its best quarter ever this year in Q3 and outperformed. We had 16 deals over $1 million, one of which closed with over $20 million of net new ACV.\n\nFederal also saw great linearity in the quarter really because the platform is demonstrating such strong ROI that is really enabling them to get through the approval process faster. We're really seeing an increase in the volume of federal agencies that are really looking at their partnership with ServiceNow through an enterprise lens, right? So those deals are getting bigger, more strategic, more multiyear. And we're seeing cabinet-level agencies really trying to consolidate contracts at an enterprise level with us and standardize their spend on the Now Platform. So federal team just doing incredible work with their customers.\n\nWith respect to hosted, we had about 3% this year -- sorry, this quarter, which is flat quarter on quarter but down 1% from last year Q3. And so really great linearity across the board. Hosted, flat quarter over quarter but down one point year over year, which is actually a headwind to that revenue growth, which means our revenue growth is even stronger. So really, really great results across the board.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nThank you, guys. Very comprehensive. Congratulations.\n\nBill McDermott -- President and Chief Executive Officer\n\nThank you so much, Alex.\n\nGina Mastantuono -- Chief Financial Officer\n\nThanks, Alex.\n\nOperator\n\nThank you. We take our next question now from Kash Rangan at Goldman Sachs.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nHi. Thank you very much. Congratulations, and what a change from the Microsoft earnings conference call yesterday. Bill, I wanted to get your perspective.\n\nYou talked about the great reprioritization. Microsoft talked about how some new cloud workloads are being paused by the customers and they're optimizing existing workloads. So I just wanted to see, what is it that is different about the prioritization of ServiceNow in the face of other headwinds that we're starting to hear about in the public cloud? And how does this position the company for '23 looking into a more uncertain time? We all thought we're going to have a recession in '22. We sort of escaped it.\n\nMaybe it happens in '23 or maybe it doesn't. The great reprioritization that you talked about, Bill, how are customers viewing the value proposition, return on investment on ServiceNow relative to the cost of capital? And Gina, if you could care, how would you be approaching calendar '23 guidance? Are you going to be more conservative than usual, given the risks in the environment that we all appreciate? Thank you so much.\n\nBill McDermott -- President and Chief Executive Officer\n\nYeah, Kash. Markets are very rational. Customers are extremely focused right now on productivity. They care a lot about their customers and their employees and, obviously, their bottom lines.\n\nAnd no platform in the enterprise software industry gets them what they want faster, from creating great experiences for their employees. You can't give a customer a three-star Michelin experience until you first energize your employees. So that's one aspect of it. They know they have to have more productive, happy people.\n\nThe cost of turnover and problems in the workforce, it's a huge, huge bottom line hit that a lot of people don't factor into the equation. And a lot of it is caused by bad onboarding, bad systems and not really a great user experience for the people who work for their company from anywhere they want to be. And as it relates to the customer, I touched on that. I think what we're adding on customer service management right now with the completeness of our vision is stunning in terms of value creation and a big surprise to customers who didn't use to think of ServiceNow in that space and now they do.\n\nAnd as it relates to our core IT, I mean, we're obviously the leader there, so I won't go into great details on that, but they're blown away by the San Diego release in March and the Tokyo release in October. They know there's an immediate cycle from what they need and how quickly we can engineer it and get it into the release level. So the existing customers love that that they have this incredible seamless experience with ServiceNow. They know the innovation is coming on time and at the highest level of quality.\n\nAnd finally, I think, and at a platform level, the need to speed, Kash, is everything. Getting these business cases rational, getting these customers up and running swiftly and demonstrating immediate business value is the essential ingredient. I didn't give you one example in the ERP world where we did not get these customers live in more than 100 days. So we're talking need for speed and we're talking ability to deliver and the customers are having great experiences.\n\nYou can't find a customer in the global economy that doesn't love the platform. I keep trying, I still can't find them.\n\nGina Mastantuono -- Chief Financial Officer\n\nAnd Kash, on your question with respect to 2023, obviously, we'll provide more details on 2023 in January. Overall, as you're hearing from our tone, the demand that we're seeing for the Now Platform has remained resilient and strong. FX, as you know, has become a significant headwind, particularly over the last three months. Since the beginning of this year, we now see about a $400 million headwind related to FX in 2023.\n\nAnd we certainly don't think the macro environment is, all of a sudden, going to change as we enter into 2023. So when we think about guidance, we'll be taking all of these factors into account, as you would expect us to.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nThank you so much. Congrats again.\n\nGina Mastantuono -- Chief Financial Officer\n\nThanks, Kash.\n\nBill McDermott -- President and Chief Executive Officer\n\nThank you, Kash.\n\nOperator\n\nAnd we'll go next now to Brad Sills of Bank of America.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks, guys. I wanted to ask about an update quickly on the SI channel. I think Bill, in the past, you've said seven or eight of the top 10 global SIs with $1 billion-plus pipeline.\n\nThat's just an astounding number when you think just a few years ago, that channel was almost nonexistent. So just curious, how much of their productivity is contributing to your results here today? How do they give you that reach into these other departments that historically ServiceNow hasn't been and obviously, you're talking about ERP and back office, creator employee customer. You're seeing a ton of momentum there. Just wanted to get your thoughts on how important that channel is in bringing you into those types of opportunities and the traction you're seeing there.\n\nThank you.\n\nBill McDermott -- President and Chief Executive Officer\n\nBrad, it's a great question. And look, it was very interesting in the early days just opening people's minds to the power of the Now Platform. And our global partner ecosystem is obviously a meaningful enabler. And they're critical for us to drive successful implementations for our customers and also to tailor our products to different industries.\n\nSo this idea of co-creation, whether it's for an industry, it's for a sub-industry vertical and even at a micro-vertical level, we've only scratched the surface of what's possible with the ecosystem. We're young in terms of the runway for growth. As it relates to the top ones, we now have eight of the top 10 global advisory and systems integrators that have committed to a plan greater than $1 billion with ServiceNow. And again, I'm very open to the ecosystem.\n\nAnd that's why you see us making a bold move today on RiseUp with ServiceNow to scale 1 million. I know I under-called it but it is what it is. I'm sure it will be 2 million because there's such demand for the platform. And I really want our partners to love and trust ServiceNow as we love and trust them because it really is about mutual goal setting.\n\nIt's about making sure we're very clear about who's doing what, and we don't duplicate efforts and we never disappoint our partners. It's all about trust. And they like us because we're straight shooters here and we want to win, and they want to win. And the other thing that's happening is they have -- like to Kash's point on the great reprioritization, there's going to be so much spend that will go around.\n\nBut what they all realize now is business impact is what it's all about, especially in this macro, and then more and more reaching deep into the ServiceNow relationship because the customers won't listen to long, drawn-out, expensive, time-consuming multiyear projects. If that project isn't in the same calendar year, the likelihood of getting approved is real low. And if you remember, in 2008, that was the era where everyone moved away from capex to opex, and that was where the cloud got the big tailwind. Well, now you got half of them in the cloud so they're looking at opex.\n\nAnd that opex question is which platform can get me to the winning equation the fastest? And which platform is going to be around 10 years from now to be a dominant force in my infrastructure? And that's where ServiceNow seems to be answering the bell.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nGreat to hear. Thanks so much, Bill.\n\nBill McDermott -- President and Chief Executive Officer\n\nThank you very much, Brad.\n\nOperator\n\nWe go next now to Mark Murphy of J.P. Morgan.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nYes. Thank you very much. I'll add my congrats on a fantastic quarter. So Bill, how broad are your ambitions in the Employee Workflows market? I believe you had crossed $500 million there.\n\nSome of your partners seem to have 20% or 30% of their pipeline in HR. And now you have this Hitch Works asset for talent intelligence and skills. So just curious how broad is that multiyear road map at this point.\n\nBill McDermott -- President and Chief Executive Officer\n\nYeah, it's -- first of all, thank you for the question, Mark. It's really broad. If you look at Employee Workflows, they're 12 of our top 20 deals and we had seven deals greater than $1 million. And what we're helping customers do really is navigate this uncertainty that they're dealing with.\n\nAnd they've got to give these employees that they have, no matter where they work, a great experience. And it's not only limited to, I would say, recruiting, hiring, on-boarding, training, certifying, providing all the services that the employee needs on one mobile app. And that includes off-boarding employees in a first-class way, which most companies forget to do, which really hurts their brand image. We care about all of that.\n\nBut in addition to all of that, we're now in a world where customers are really pulling at us because they're like, hey, I'm not going to have as many people. And I really got to think about reorienting my business processes or rethinking how I automate things that I just haven't gotten to yet, but I need to do it quick. So our ambitions are always in the billions. And this is another business where we're in billions.\n\nAnd I think we're just getting started on the employee experience journey. And I'll tell you why. If you look at even ourselves, there isn't a single employee in this company that could tell you a single system of record that might be in the infrastructure somewhere in our cloud. They have no idea.\n\nBut what they do know, like Gina said earlier, everything that they do is on a mobile application on their phone, and it says ServiceNow because we completely workflow automated the entire corporation. So they don't know anything else. And what we're constantly hearing is people want to join because their on-boarding experience is so great. And we don't lose employees.\n\nWe have gotten lots of employees joining here that literally bounced out of another company in a week because they couldn't stand the on-boarding experience and said, this isn't for me. So everything having to do with the employee experience and the management experience. We launched in the Tokyo release a complete manager solution so we can manage their careers, their hierarchy of their training and development and they can also do that with their employees on the Now Platform. And all of this is happening in real time.\n\nSo the system of record, again, we're not interested in being one of those, and we have no quarrel with any of them. We are interested in the experience and that's where the money is.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nThank you very much.\n\nBill McDermott -- President and Chief Executive Officer\n\nThank you very much for the question.\n\nOperator\n\nThank you. We go next now to John DiFucci of Guggenheim.\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nThank you. Bill, we've done a lot of work on the U.S. government opportunity. And you and Gina both mentioned the record results there in this quarter.\n\nAs you know, this is the fiscal fourth quarter for the government and likely the strongest spending quarter of the year for that customer or vertical, I guess, it's a vertical. But can you talk about the opportunity for any spillover into next quarter or even next year? Or is this really sort of a use or lose it mentality? Something -- is that something you can avoid in this vertical so it's always going to be material just like a third quarter thing?\n\nBill McDermott -- President and Chief Executive Officer\n\nYeah, John, thank you for the question. We have always been really strong in federal. And a lot of that is driven by productivity, efficiency and government organizations. And I think we can all agree that that's a big opportunity.\n\nSo that area of focus for us has always been a priority. The budget there is large and there's a lot of demand for updating the technology environment for governments. What they love about ServiceNow is we integrate the things that they've already done. And we're not in a debate about whether the task was done properly or not.\n\nThe customer can decide how they retire point solutions by the bundles, but we don't insist upon that. We are driving the experience. And I can tell you with great confidence, John, we have a very strong pipeline going into the fourth quarter with more multimillion-dollar deals, and I couldn't be prouder or more confident in our team.\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nThat's great. Thanks a lot, Bill. Thanks.\n\nBill McDermott -- President and Chief Executive Officer\n\nThank you very much, John.\n\nOperator\n\nThank you. We go next now to Karl Keirstead of UBS.\n\nKarl Keirstead -- UBS -- Analyst\n\nGreat. I'll ask a quick one for Gina. Gina, did that pull-forward phenomenon that you cited in 3Q continue into the fourth quarter, such that it's shaping up to perhaps be a little bit more front-end loaded in terms of renewal timing than you would have expected? Thank you.\n\nGina Mastantuono -- Chief Financial Officer\n\nSo I talked about the fact that one of the reasons why our cRPO beat in Q3 was related to 50 basis points of pull-forwards of Q4 renewals into Q3. And if you remember, on prior calls, I talked about the fact that this Q4 was a large renewal cohort because the fact that we were able to get some of them done early absolutely helped drive cRPO but also ramped our revenue beat as well. Expectation is that our Q4 renewal will be on par. We had 98% renewal rate in Q3.\n\nWe expect similar levels in Q4, and so feel very good about the pace of renewals for the remainder of the year.\n\nKarl Keirstead -- UBS -- Analyst\n\nGot it. Thank you, Gina.\n\nGina Mastantuono -- Chief Financial Officer\n\nThanks, Karl.\n\nOperator\n\nAnd ladies and gentlemen, we have time for one more question this afternoon, and that will come from Michael Turits of KeyBanc.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nHey, thanks very much. Congrats on a good job. So maybe to continue on that vein. My understanding is the expectation for the cRPO increase was primarily predicated on renewals and at par as opposed to expansion.\n\nSo maybe can you comment on how the expansions have been going both on the early renewals and the prospects for those that you expect to renew in 4Q?\n\nGina Mastantuono -- Chief Financial Officer\n\nYeah. Great question, Michael. Expansion rates, you know we don't give expansion rates anymore on a quarterly basis, but we reported last year expansion rates of 125%. And we've seen very strong similar expansion rates throughout 2022.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nGreat. Thanks.\n\nGina Mastantuono -- Chief Financial Officer\n\nGreat. Thank you.\n\nBill McDermott -- President and Chief Executive Officer\n\nThank you, Michael.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDarren Yip -- Vice President, Investor Relations\n\nBill McDermott -- President and Chief Executive Officer\n\nGina Mastantuono -- Chief Financial Officer\n\nSamad Samana -- Jefferies -- Analyst\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nSterling Auty -- MoffettNathanson -- Analyst\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nKarl Keirstead -- UBS -- Analyst\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nMore NOW analysis\n\nAll earnings call transcripts"
}