{
  "companyName": "Lockheed Martin",
  "companyTicker": "LMT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/18/lockheed-martin-lmt-q3-2022-earnings-call-transcri/",
  "content": "Lockheed Martin (LMT -0.11%)\nQ3 2022 Earnings Call\nOct 18, 2022, 11:00 a.m. ET\n\nOperator\n\nGood day and welcome, everyone, to the Lockheed Martin third quarter 2022 earnings results conference call. Today's call is being recorded. At this time, for opening remarks and introductions, I would like to turn the call over to Mr. Greg Gardner, vice president of investor relations.\n\nPlease go ahead, sir.\n\nGreg Gardner -- Vice President, Investor Relations\n\nThank you, John, and good morning. I'd like to welcome everyone to our third quarter 2022 earnings conference call. Joining me today on the call are Jim Taiclet, our chairman, president, and chief executive officer, Jay Malave, our chief financial officer, and Maria Ricciardone Lee, our new vice president of investor relations. Statements made in today's call that are not historical facts are considered forward-looking statements that are made pursuant to the safe harbor provisions of federal securities law.\n\nActual results may differ materially from those projected in the forward-looking statements. Please see today's press release and our SEC filings for a description of some of the factors that may cause actual results to differ materially from those in the forward-looking statements. We have posted charts on our website today that we plan to address during the call to supplement our comments. These charts also include information regarding non-GAAP measures that may be used in today's call.\n\nPlease access our website at www.lockheedmartin.com and click on the investor relations link to view and follow the charts. With that, I'd like to turn the call over to Jim.\n\nJim Taiclet -- Chairman, President, and Chief Executive Officer\n\nThanks, Greg. Good morning, everyone, and thank you for joining us on our third quarter 2022 earnings call as we review our quarterly results, our 2022 full year outlook and our preliminary expectations for 2023. But before we begin, I'd like to welcome Maria who I'm excited to tell you all started as our new vice president of investor relations just yesterday. I'd also like to thank Greg who announced his plan to retire at the end of the year for his more than 37 years of dedicated service at Lockheed Martin, including five terrific years as our Vice president of investor relations.\n\nIt's been a pleasure to work with you, Greg, and we wish you all the best in retirement.\n\nGreg Gardner -- Vice President, Investor Relations\n\nThank you, Jim.\n\nJim Taiclet -- Chairman, President, and Chief Executive Officer\n\nI'd also like to note that we continue to await the US Army's selection for its future long-range assault aircraft competition, FLRAA, as it is known. We'll modernize the Army's rotorcraft fleet and represent a long-term franchise growth opportunity. We are confident that the Defiant X is the transformational aircraft that the US Army is going to need to accomplish its complex missions today and well into the future, and we look forward to the Army's announcement. Lockheed Martin had a solid quarter financially with 3% increase in sales from last year's third quarter and strong operating margins and earnings per share.\n\nOur free cash flow was outstanding as we generated $2.7 billion in the quarter. And our backlog grew nearly $5 billion, closing at $140 billion. We remain on track to achieve the full year outlook for all of our financial metrics that we discussed last quarter.  In a few minutes, Jay will provide a detailed review of our quarterly results, updated 2022 guidance and trending information.\n\nBut before he does that, I will provide a framework for our outlook and discuss our plans for delivering value to customers and shareholders over the next several years. We continue to anticipate growth over the long term. But with residual pandemic impacts and supply chain challenges continuing, we now expect to return to growth in 2024 with 2023 sales being approximately equal to our 2022 outlook. We are confident in our four pillars to drive growth in 2024 and beyond.\n\nImportantly, we expect to deliver solid growth in free cash flow per share in 2023 and thereafter through a combination of cost reductions throughout the business, improved working capital management and an expanded share repurchase program. Our board of directors has approved an increase to our share repurchase authorization to $14 billion. You will see in Jay's charts that we're doubling our share repurchase plan outlook for this year, increasing our outlook by $4 billion for a total expectation of $8 billion in 2022. We also announced a 7% dividend increase this quarter.\n\nSo altogether, we're on track to deliver approximately $11 billion to shareholders in 2022. We are also elevating our commitment to drive long-term growth through strong, independent research and development and capital expenditure funding with an expected total of nearly $4 billion in 2023. These investments will support our customers and deliver on our 21st century security vision to accelerate leading-edge commercial digital technologies in defense of our nation and allies. A key driver of this strategy is our new 1LM transformation, or as we call it, 1LMX, a multibillion-dollar, seven-year, companywide program to transform our end-to-end business processes and systems.\n\n1LMX will create a model-based enterprise with a fully integrated digital thread throughout the design, build and sustain product life cycle. As part of our ongoing corporate stewardship approach -- we are conducting an internal review to identify potential synergies between our four business areas, further cost-reduction opportunities and a general portfolio review with the goal of increasing operating efficiency in anticipation of our future growth. We are confident in long-term growth as domestic and international demand for a wide range of our products and services remain strong. We will continue to actively reinvest capital into our business to meet our customers' requirements and drive organic growth.\n\nAnd we will use our disciplined and dynamic capital allocation process and strong balance sheet to drive attractive total returns for shareholders. Moving on, I'd like to highlight a few key accomplishments from each of our business areas, beginning with an update on our F-35 program. Last month, the Swiss government signed a letter of offer and acceptance for the procurement of 36 F-35As. This milestone completes the government to government procurement process that was first announced in June 2021 when the Swiss Federal Council shared its selection of the F-35 for its future fighter.\n\nThe signing officially makes Switzerland the 15th F-35 customer. Also in August, we received contractual authorization from the Joint Program Office, enabling us to book a Lot 15 order of over $7.5 billion in recognized revenues and earnings from the second quarter, as well as from the third quarter. Our space team celebrated the successful launch and deployment of the space-based infrared system GEO 6 satellite, the final spacecraft in the SIBRS constellation. SIBRS has been one of our longest running signature programs, providing the space force with an integrated system for missile warning, battle space awareness and intelligence gathering.\n\nWe will also continue to support and advance this important mission through our next generation overhead persistent infrared, or next gen OPIR program, which will deliver even more advanced and more survivable missile warning capabilities to the country. At rotary and mission systems, the Sikorsky line of business secured an order for 12 SEAHAWK helicopters from the Australian Ministry of Defense. Over the past 40 years, we've delivered over 1,000 SEAHAWKs to the US and international customers both with more than 50 remaining in backlog. And in missile and fire control, the State Department approved a potential sale to the United Arab Emirates for two THAAD systems, including 96 interceptors.\n\nThe UAE currently operates two THAAD batteries, and this opportunity would significantly increase their air and missile defense capabilities. And once finalized, could be worth over $2.2 billion. Turning to budgets. Both chambers of Congress have advanced appropriation bills in support of fiscal year 2023 Department of Defense budgets.\n\nWe have seen strong bipartisan support for increased defense funding and congressional authorization and appropriation committees. Final legislation approving these funds has yet to be passed, and the federal government is currently operating under a short-term continuing resolution for FY '23, limiting DoD funding to prior FY 2022 levels. As part of the continuing resolution, Congress did approve additional supplemental spending to support efforts in Ukraine for the defense of their country. The CR added $3 billion in funding for Ukraine security assistance initiatives, a program to provide equipment, weapons and military support to Ukraine, bringing the total amount appropriated for this effort to $9 billion.\n\nIn addition, the continuing resolution appropriated $2 billion to replenish US stocks of equipment sent to Ukraine and to increase production of critical munitions with the presidential drawdown authority funding now having been increased to over $14 billion since the beginning of the year. The international community has also increased their focus on global security with nations across the world having announced a planned five-year increase in defense budget funding of approximately $60 billion in total. We continue to have discussions with customers to expand the manufacturing of multiple products and have submitted offers for consideration. While many of these contracting actions remain in the early stages and may take time to be fully implemented, we believe our signature programs and 21st century security technologies have us well positioned to address the challenges presented by a resurgence in global great power competition.\n\nTurning to our 21st century security strategy. I'd like to highlight two examples of Lockheed Martin's leadership in deterrence technologies and how our 5G.MIL open architecture can be used to enhance performance and drive effective Joint All Domain Operations. During the third quarter, Lockheed Martin and AT&T teamed to transfer UH-60M Black Hawk helicopter flight and performance data from an aircraft flying in Connecticut to receiving location in Colorado using both an AT&T 5G private cellular network and Lockheed Martin's 5G.MIL multisite pilot network. Operational performance has also improved with the efficiencies introduced by this technology shortening the total processing time of the task by nearly 85%.\n\nAlso this quarter, Lockheed Martin and Verizon flew 5G-enabled drones to capture and securely transfer high-speed, realtime intelligence, surveillance and reconnaissance data from aircraft in flight to geolocate simulated adversarial positios. This demonstration showed the capabilities of our hybrid base station to bridge commercial and military technologies together, providing our service members with enhanced deterrent capabilities and further enabling the mission all the way out to the actual battlefield. With that, I will turn the call over to Jay and join you later to answer your questions.\n\nJay Malave -- Chief Financial Officer\n\nThanks, Jim, and good morning, everyone. Today, I will walk you through our consolidated results, business area detail, provide an update to our 2022 outlook, as well as offer some thoughts on 2023 and beyond. As I highlight our results, please follow along with the web charts we have posted with our earnings release today. Let's begin with chart three, and an overview of our consolidated third quarter financials.\n\nLockheed Martin delivered solid results for the quarter. To start, we generated sequential sales growth of 7% to $16.6 billion as anticipated. Segment operating profit was $1.9 billion at an 11.2% margin with earnings per share of $6.71, reflecting solid underlying performance that absorbed $0.16 of mark-to-market headwinds. We also increased backlog with a 1.3 book-to-bill ratio, driven by the F-35 production Lot 15 contract action.\n\nFree cash flow was strong in the quarter at $2.7 billion, further enabling the execution of our disciplined and dynamic cash deployment strategy and returning over $2 billion through share repurchases and dividends. Turning to consolidated sales and segment operating profit results on chart four. Total sales increased 3% from the third quarter of 2021 with growth in three of our four business areas. Segment operating profit was up slightly as the benefits from higher volume and equity earnings more than offset lower step-ups than last year.\n\nMoving to earnings per share on chart five. On a reported basis, earnings per share were higher by $4.50. Adjusting for last year's pension transfer transaction and mark-to-market accounting, EPS grew 4%, primarily reflecting the benefits of higher operating profit and a lower share count. All in all, solid results that position us well to meet our full-year commitments.\n\nMoving to cash flow on chart six. We delivered our strongest quarter of cash class flow year-to-date with strong collections driving $2.7 billion in free cash flow this quarter while maintaining accelerated payments of $1.1 billion to suppliers. Shareholder cash deployment continues to exceed free cash flow year-to-date with 121% of free cash flow deployed through dividends and share repurchases. We have substantially completed our $4 billion -- our original $4 billion 2022 buyback target.\n\nAs we announced this quarter, we also increased our dividend 7%, now paying an annualized dividend of $12 per share. Moving to segment results and starting with aeronautics on chart seven. Third quarter sales increased 8% year over year, driven by higher F-35 production volume, including the recognition of $325 million of sales that were deferred from the second quarter associated with the Lot 15 contract action. Increased volume in our classified programs at Skunk Works also contributed to the growth.\n\nOperating profit increased 6%, primarily following the sales volume increases on F-35, partially offset by lower margins on classified programs. Moving to missiles and fire Control on page eight. Sales increased 2%, driven primarily by increased volume on PAC-3 interceptors. Segment operating profit was down 8% as lower favorable profit adjustments this quarter more than offset the benefit from higher volume.\n\nAt rotary and mission systems on page nine, sales decreased year over year by 5%, driven primarily by lower Black Hawk production volume at Sikorsky. Operating profit decreased 10%, following Sikorsky production volume and lower favorable profit adjustments this quarter on the Black Hawk program. Turning to chart 10 in our space business area. Sales were up 7%, driven primarily by the continued ramp of the next generation interceptor program.\n\nOperating profit increased 14% following the volume increase, along with higher equity earnings from United Launch Alliance. OK. Moving to our updated outlook for 2022 on page 11. We are maintaining our guidance from last quarter for sales, earnings per share and free cash flow.\n\nWith the announcement this morning of a $14 billion repurchase authorization approved by our board of directors, we've increased our forecast for share buybacks to approximately $8 billion for the year, an increase of $4 billion from our prior expectation, reflecting our confidence in the long-term growth outlook and amplifying per share value creation. We expect the EPS benefit from our incremental planned buybacks this year to be offset by the third quarter mark-to-market headwinds and therefore are holding our current EPS guide of $21.55 for the year. Also, while our consolidated outlook did not change, we did have some puts and takes between the business areas, and you can find that detail in our backlog charts. On chart 12, we've laid out our preliminary framework of expectations for 2023.\n\nAs we've discussed before, we remain confident in sustained growth, driven by four pillars. Those are: programs of record, classified programs, hypersonics and new awards. This is supported by the higher backlog through the third quarter and further growth expected by year-end. We do anticipate flattish sales in 2023, however, primarily due to the delayed sales conversion in our programs of record backlog as the expected recovery from COVID and supply chain shortages will be more gradual than previously expected.\n\nIn our classified businesses, we expect another year of growth in 2023. This growth, along with our contract mix headwinds, will be accompanied by pressure of approximately 20 to 30 basis points in overall company segment operating margin, all compared to our 2022 outlook. We are confident that through cost reduction and business area synergy actions, we can work to limit this downward pressure. Importantly, through management focus and aggressive working capital actions, our expectations for 2023 free cash flow remain unchanged in spite of the top line and margin pressure.\n\nLooking forward, we are confident in the company's prospects for growth and value creation. With our aggressive share buyback plan, we anticipate repurchasing approximately 10% of our shares outstanding over the next several years. And coupled with a sustained free cash flow, we expect to deliver outstanding long-term value to shareholders. OK.\n\nSo let's wrap up on chart 13. Our business area operational and financial performance in the third quarter was solid, and we are increasing our outlook for cash return to shareholders. We continue to invest in innovative solutions, including commercial technologies in support of our customers' important missions and 21st century security. Our focus remains on strong cash generation and combined with our robust balance sheet and discipline and dynamic capital deployment strategy allow us to deliver long-term value to shareholders.\n\nBefore we open up to Q&A, I would also like to thank Greg Gardner for his 37 years of dedicated service and contributions to the company. He's been an outstanding partner and resource to all that he has supported. We wish him well in the next phase of his life. Greg will remain with us through the end of the year to transition Maria Ricciardone Lee.\n\nMaria brings investor relations experience from multiple companies, including UTX where we both worked together. She's an excellent financial executive and thought partner, and I'm excited that she is joining the team. With that, John, let's open up the call for Q&A.\n\nOperator\n\n[Operator instructions] And first, the line of Rob Stallard with Vertical Research. Please go ahead.\n\nRob Stallard -- Vertical Research Partners -- Analyst\n\nThank you so much. Good morning.\n\nJim Taiclet -- Chairman, President, and Chief Executive Officer\n\nGood morning, Rob.\n\nRob Stallard -- Vertical Research Partners -- Analyst\n\nAlso, I'd say all the best to Greg, and welcome, Maria. Good to talk to you again. But in terms of questions, Jay, on your outlook for 2023, I know you're not going to go into a lot of detail here, full guidance beginning next quarter. But you mentioned that classified is going to be going up but overall are going to be flattish.\n\nSo what's coming down next year? And what's causing that?\n\nJay Malave -- Chief Financial Officer\n\nYes. We have some program transitions, Rob. And maybe I'll just maybe go through around some of the business areas to give you a little bit of color there. When you look at aero next year, we expect that to probably be in the range of being down -- flat to down slightly, and that's on the back really of lower production volume on the F-35.\n\nWe expect that to be done -- even though sales or the deliveries will be generally flat, we recorded sales in advance of that with long lead procurement in 2021 and 2022. So it will be a period of catch-up on sales for aero there. So that's going to be the biggest driver there, but we'll expect that to abate when we go into 2024. At MFC, we've got some -- just some timing, some program timing, particularly in our sensors business, we expect them to be probably flattish to down slightly as well.\n\nAnd then, we expect some growth -- low single-digit growth in both RMS and space. And RMS will just be driven by new programs. And at space, we have -- our national security business is down, but we've got other programs that are spiking up there. And so, that's generally what's driving it, I'd say, by business area and by segment.\n\nSo slightly down in a few and slightly up in others, and on balance, will be flat.\n\nOperator\n\nAnd our next question, from Ron Epstein with Bank of America. Please go ahead.\n\nRon Epstein -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Hey, good morning. Thanks for the question. Jim, can you walk through why you think growth is going to start again in 2024? I mean, what underlies that? And maybe one of the things I scratched my head on a bunch is you've got, what, the 15th customer for F-35, and it looks like there might even be some more within the next year or so.\n\nSo how do we think about that growth recovery? What's going to underlie that? And why are F-35 levels at a higher rate of production than where they are today, and could they go higher?\n\nJim Taiclet -- Chairman, President, and Chief Executive Officer\n\nSure, Ron. It's Jim here. So the two biggest pieces of our four pillars of growth are programs of record, and I'll speak to a few of those in a second, and the classified business we have. And both of those are going to ramp up from 2023 to 2024, meaningly, we feel.\n\nAnd the biggest piece of all -- again, the programs of record are going to come into three or four very identifiable areas. One is the F-35 sustainment, right? So with more aircraft out flying, there's going to be more of a overhaul, repair, spare parts support, those kinds of activities, going on, and that's going to continue over a number of years. So F-35 sustainment is a growth area. In MFC, the PAC-3 is resurging.\n\nThere's interest in various parts of the world, the Middle East, Europe and Asia now, for PAC-3. So the capabilities of that air defense system are really going to be kicking into gear for the company in the next couple of years, including in 2024. Along with that, similarly, the CH-53K is going to move up the production rate significantly, and there's some additional international interest there. That aircraft can do lift capability that far exceeds any other that's ever been built in history, and it's, I think, going to get even more uptake as time goes on.\n\nAnd the fourth, among many of the programs of record that will grow is fleet ballistic missile that the US Navy, is essentially going to revamp for the second time the Trident fleet ballistic missile system. And that's a Lockheed Martin franchise that will continue to grow, again, starting in 2024. On the classified side, 2023 is helpful, but not really the ramp that will come in 2024. So between programs of record and classified, you're going to get the bulk of that growth.\n\nOn F-35, the US government has got to kind of determine what its budget priorities are at the macro level going forward. One of those has been nuclear deterrents. And so, between the bomber program, the ground-based missile recapitalization and the fleet ballistic missile that I just mentioned, there's going to be a significant amount of defense budget proportionately spent on the nuclear revitalization. But also the conventional threats have gotten worse instead of better as we look forward into the next two or three, four years, and that's going to be a budget issue for the US government.\n\nWe've recommended, and I think the services would support, a steady production rate of 156 aircraft starting again in the 2024 time frame when we can get back up to that based on the COVID recovery for our supply chain, and I think that's supportable. And it takes about 80 US aircraft to make that happen per year with another 75 or so coming from international. We see the international demand, and it's going to be up to the US government to try to support that 80 number between the congressional committee processes for authorization and appropriation along with the President's budgets going forward. So we hope for that.\n\nWe expect it because that's the need, and that's where we think the F-35 program is going to go. But again, in FY '23, we won't have that full ramp up yet.\n\nJay Malave -- Chief Financial Officer\n\nLet me just maybe add a little bit to it as well, Ron. Just to augment, some of the things that we're seeing in 2023, we've got some expected abating headwinds when we go into 2024. Jim mentioned a little bit on supply chain. That's primarily affected our programs of record.\n\nAnd so, those should lift by the time we get to 2024. We also have a few program transitions in 2023 that will also allow for easier comparison when we get into 2024. And so, for example, I just mentioned the F-35 where production will be down next year. Those will normalize when we get into 2024, which will allow our sustainment to grow, as Jim mentioned.\n\nWe'll also see accelerated growth in the F-16 program. As you may recall, that program slipped to the right. But in 2024, we expect that to accelerate. In space, as Jim mentioned, FBM, there are other programs such as NGI that will continue to grow.\n\nAnd so, we've got some things where we're cycling down this -- on 2023 on the SIBRS program and even things like next gen GEO or OPIR, again, those headwinds will abate as we get into 2024. Similarly, on MFC, Jim mentioned the PAC-3 program. We'll see also continued growth there in the classified programs as well. And then, at RMS, as Jim mentioned, also at CH-53K, there's also other radar programs, as well as Joint All Domain-type programs like Defense of Guam that will drive some growth in those years.\n\nSo all of these areas and these programs are the ones that we have pretty clear visibility to. They do assume obviously that there is abatement to an improvement in supply chain. That's 15 months from now for improvement that we expect to occur.\n\nOperator\n\nOur next question is from Matt Akers with Wells Fargo. Please go ahead.\n\nMatt Akers -- Wells Fargo Securities -- Analyst\n\nYeah. Hi. Thanks for the question. And Greg, best of luck and good working with you.\n\nI wanted to ask about Future Vertical Lift, FLRAA, just what you're hearing from your customers there on the delays. And any indication of what's driving that and when do you think that contract might be up?\n\nJim Taiclet -- Chairman, President, and Chief Executive Officer\n\nMatt, it's Jim. The only thing we could say about the schedule for FLRAA decision is what the US government puts out publicly. So we don't have anything else to add to that. It's their schedule and timeline, and we think we've put in a terrific offer.\n\nAnd also having been around some of these helicopter pilots in my Air Force time, they actually scared the heck out of me a couple of times when I flew with them. They want to be low. They want to be maneuverable below the tree line. And I've seen the FARA and FLRAA fly.\n\nThey can do it. There's a video you can look at on YouTube that shows you how amazing this helicopter technology is. And it also gets you up to like a 230- to 250-knot forward speed when you need it, so it gives the best of both worlds if you're in the rotorcraft business as a flyer. You get good forward speed that's faster than it's ever been for traditionally designed helicopter because of our kind of rotating rotors, and it also gives you the maneuverability even better than many of the traditional helicopters could have provided.\n\nSo we think it's the best solution for the actual frontline Army or other service pilot, and it's going to be up the US government to see where they come out on that. But the schedule is theirs, and we can't really comment on it.\n\nOperator\n\nNext, we'll go to Pete Skibitski with Alembic Global Advisors. Please go ahead.\n\nPete Skibitski -- Alembic Global -- Analyst\n\nHey, good morning, guys. Greg, enjoy your retirement. Jim, I had a question on missiles and fire control. I feel like the last few years, you've had -- production programs have been down, but you mentioned this resurgence in the PAC-3.\n\nAnd USA., it seemed like the guys were pretty positive on a range of production programs, HIMARS, for instance, being one of them because of what we've seen in the papers. But if we think about the midterm at missiles and fire control with this kind of resurgence in the production programs, is there a margin opportunity there now that you guys are seeing, whereas maybe the production programs kind of start to shift back versus some of the hypersonic development projects?\n\nJim Taiclet -- Chairman, President, and Chief Executive Officer\n\nSo Pete, I'd say, yes, the legacy, but still extremely effective MFC programs, are fairly high margin because of the volume and the learning curve that were already down. So that will be a margin upside to us should those volumes increase further. And we've gotten ahead of this. So for HIMARS, GMLRS, Javelin, again, the products you kind of see in the news these days and a few others as well.\n\nAbout six, seven months ago when we saw what was beginning to happen in Eastern Europe, I went over to visit some of the senior officials in the Pentagon and basically took them to letter and said  we're going to start spending on capacity for a few of these systems, including the ones you just asked about. And now, we've got a lot done already. So for example, on HIMARS specifically, we've already met with our long lead supply chain to plan for increasing production in 96 of these units a year. We advance funded ahead of contract $65 million to shorten the manufacturing lead time.\n\nThat was without a contract or any other even memo or whatnot back from the government. We just went ahead and did that because we expected it to happen. So those parts are already being manufactured now. The third thing we did was we've determined where we could open up another modern manufacturing facility to be able to produce the products and got it ready early, and we're cross-training our skilled workforce across a bunch of product lines so as the demand grows and shifts across some of these products over the next few years, we're going to have people that can kind of fungibly move between them.\n\nAnd then, the last thing we did was, going back to this 1LMX, we're putting the best and newest manufacturing technology into some of these product lines first so that when the ramp comes, we can pivot to it quicker. So those are some of the things that we've done to actually capture some of the volume we expect to get, and we do expect to get it both from the US to refill stocks, as I mentioned earlier in the prepared remarks, and also significant interest being shown. Now it's got to go ahead and get contracted, which as we discussed last call, it can take a couple of years to get all that done, especially for an FMS contract. But we know it's -- the demand is there, and we've spoken to the senior government officials from those countries that know that this is important for them.\n\nJay Malave -- Chief Financial Officer\n\nPete, just to follow up on that. We do expect some sales upside there on some of these programs that Jim mentioned. That is likely to be in -- probably starting in the 2024 time frame given the long cycle nature of where we are in spite of the fact that we've done some advanced funding. The other thing I just have to also mention is that where we see the margin pressure next year, a lot of that is driven at MFC.\n\nAnd so, while we will see a mix benefit associated from these higher-margin programs, that is probably more in 2024 and beyond. 2023, we'll see a step down from where they are this year in 2022. And the way to think about it is, in the third quarter, MFC did about 13.5. What's implied in our guide for the fourth quarter is high 13s.\n\nThey're going to be in that mid-13 range, in that ballpark, for 2023 given some of these new increases in the programs that we've invested in. And so, we'll see a little bit of pressure there across the company really driven by MFC. But again, we'll see some of those mix benefits come back to us in '24 and beyond.\n\nOperator\n\nNext, we'll go to Sheila Kahyaoglu with Jefferies. Please go ahead.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nThank you and best of luck, Greg. Thank you. Good morning Jim and  Jay. One for you maybe.\n\nI want to ask about the share repurchase authorization increase and the dividend raise. Can you talk about how you're thinking about deployment as a percentage of free cash flow going forward and what were some of the assumptions made around the R&D tax credit perhaps in the expected use of debt? And just maybe adjacent to that, as you think about market multiples coming down and some of these smaller companies needing to potentially prime -- pair up with prime, how do you think about taking advantage of that opportunity along with the share repurchase authorization?\n\nJay Malave -- Chief Financial Officer\n\nOK. There's a lot there. So let me maybe start with the share repurchase. As I mentioned -- both Jim and I mentioned in our prepared remarks, we're confident in the long-term outlook of the company.\n\nWe saw this as an opportunity to really amplify the value creation that we see over the long term. And we saw no better time than really now to get started on that here in the fourth quarter. The profile to think about going forward is $4 billion here in the fourth quarter, $4 billion in 2023, $4 billion in 2024 and maybe $2 billion in 2025 as a starting point. And so, that's the profile we should expect it to be.\n\nAs far as debt, we do -- are going to finance this fourth quarter share repurchase program with the issuance of debt. So it will be about $4 billion. That will increase our interest expense next year. But again, it's all accretive.\n\nAnd so, we'll see that. Again, our debt leverage ratio on an EBITDA basis will put us still below -- at or below one and a half times. So it's still very supportable and also very attractive. As far as the R&D tax capitalization, really nothing's changed at the moment.\n\nWe'll see what happens as we move forward here in the fourth quarter. First things first, we got to get through the November elections. And then, we have the expiration of the existing continuing resolution on December 16. It's possible through legislation, therefore, a new budget that we could see movement on tax extenders that would include some type of either deferral, or what we would prefer, a repeal of the task capitalization policy.\n\nAnd as you know, we believe that it's sound policy, and we believe there's bipartisan support to remove any disincentives that promote innovation. And so, that's a firm policy. It's something that we're firmly behind and we'll continue to push for.\n\nJim Taiclet -- Chairman, President, and Chief Executive Officer\n\nSheila, when it comes to small and midsized companies teaming up with Lockheed Martin, we're set up for that. I can describe three ways in which we are ready now to pair up and team up with whether they're commercial or defense, industrial-based companies of smaller scale. One is that we've had for years, LM Ventures, like literally a VC house inside of Lockheed Martin. It's been funded at $200 million level originally.\n\nThe investments that have been made under that authorization are now worth about $400 million. So even if we mark to market a little bit lower, we had basically 100% return on that initial investment. Seeing the success when I joined the company of the LM Ventures program a couple of years ago, we went ahead doubled the authorization. So we're looking where to invest another $200 million in early stage companies.\n\nAt the next level, I motivated the team and Jay helped us create what we can now call Lockheed Martin Evolve or LM Evolve, E-V-O-L-V-E. And what that's meant to do is to go at a step higher and say, how do we do joint ventures or commercial alliances with midsized companies, co-invest, etc. whether again, there on the commercial side or the defense industrial base side or space industry in ways that we can take that outside of our rate structure and manage it and fund it in a different, more creative way? So we're in the VC space with LM Ventures. We're in the midsized page -- space with LM Evolve, which is just literally getting off the ground, I'll say.\n\nBut we have the framework, the structure and the ability to engage in that level of investment now. And then, thirdly, something we've done over the years is acquire small and medium companies with technologies with critical supply chain components that are available. So we'll continue to do that as well. So those are the three that we have in place up and running: LM Ventures, LM Evolve and the acquisition process to bring those kind of capabilities into -- or an affiliation with Lockheed Martin.\n\nOperator\n\nAnd next, we'll go to Rob Spingarn with Melius Research. Please go ahead.\n\nRob Spingarn -- Melius Research -- Analyst\n\nHey, good morning. Best of luck, Greg. Jim, I want to ask you a high-level question, particularly because you're a pilot. The Air Force is facing a shortage of pilots, and the Navy is planning to have at least 60% of the carrier air wings uncrewed.\n\nAnd so, given that Lockheed is so strong on manned aircraft, I wanted to ask you about unmanned and the positioning there and how that fits into the long-term plans of both the Air Force and the Navy.\n\nJim Taiclet -- Chairman, President, and Chief Executive Officer\n\nSo Rob, autonomy is  one of the 14 critical technologies that we think are essential in the 21st century. And to everyone's credit at the company, we've been investing in Skunk Works and other parts of the company, including Sikorsky, in autonomy for 15-plus years, right? This is not an easy thing to do or an easy thing to get approved or regulated. But Lockheed Martin and Sikorsky, when it was part of UTC and thereafter, had been working on autonomy for quite some time. So the aeronautics side of it, I can't say much about because it's pretty highly classified.\n\nBut we're far down the road on crewed, uncrewed teaming. And in the January call, we expect to have hit a couple of milestones in that that I'll be able to explain in some more detail, but we want to get the testing done before we talk about it. But we're far down the road there, mainly out of Skunk Works, as I said. And then, on the rotorcraft side, if you get the aviation week from maybe three or four months ago that showed a Sikorsky helicopter flying around with no people in it, right? I've actually flown in the Matrix helicopter, we call it, which is a DARPA project that's run out of Sikorsky.\n\nIt has three -- and they all work, by the way. It has three modes. One is manual mode, just like any traditional helicopter. The second mode is sort of assisted like a Tesla, so to speak, right? So you can take over if you need to or if you want to change the flight instantly.\n\nAnd then, the third mode is fully automated. Either you plug the mission in a trailer down or up at Stratford, Connecticut, the thing will take off, go do the mission and come back and land on itself. So it's really working already. And then, it's a matter of when is the US government and the service is ready to turn these technologies into programs of record.\n\nBut we'll be ready when they are.\n\nOperator\n\nOur next question is from Cai von Rumohr with Cowen. Please go ahead.\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nYes. Let me join everybody and say thank you, Greg, for a great job done. And Maria, welcome. So we haven't talked about inflation.\n\nWhat are you guys seeing and assuming in inflation going forward? And as you know, Bill LaPlante has basically suggested that DoD should kind of kick in to help companies because the current level of inflation was not anticipated where the -- when the contracts were signed. And yet Senator Elizabeth Warren, no big surprise, is saying that's not a good idea. So what are you seeing in inflation? And what are you assuming going forward in terms of DoD support?\n\nJay Malave -- Chief Financial Officer\n\nSure, Cai. Inflation is twofold: one on our own labor front and then in what we see in the supply chain. For our portfolio of business, is a fair amount of our business that's somewhat insulated because it's not fixed price. And so, some of the cost-plus benefits that we get, that risk is not held at Lockheed Martin.\n\nFor the 60% of our business that is fixed price, a lot of our just contracting policies and actions and implementations revolve around going back to back with our supply chain. Meaning that whatever duration of time that we commit in our contract with our customer, we have the same commitment to our supply chain to us over that same period of time. And so, in many of those cases, we don't bear that risk either. But it does come into factor as we're going into new bids and proposals with our customer.\n\nWe are seeing different changes both on the labor side and in supply chain, and it does have an impact really going forward on bid and proposals. It's something that we have to keep in front of us. And we're having dialogues with the customer. As you mentioned, there's been a little bit of a shift in policy to DoD as far as acceptance of economic price adjustments, and that's something that we do continue to have dialogue with our customers on in existing contracts, that's subject to funding availability, which has been somewhat difficult to actually obtain.\n\nBut I think going forward, that's something that certainly would be part of our negotiations and part of our contracting. As far as labor is concerned, we have increased our assumptions in our existing backlog contracts. We've been able to absorb that through productivity and other management reserve type of actions. So we've not really seen much of an impact there, but it's certainly a watch item as we go forward.\n\nOperator\n\nNext, we'll go to Seth Seifman with J.P. Morgan.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nHey. Thanks very much. Good morning, everyone. And I echo everyone, and best to Greg and to Maria.\n\nGoing to try and sneak two in here real quick. Just Jay, the Wall Street Journal has you this morning saying that growth in 2024 should be low single digits. Is that right? Is that how we should think about it? And then the second one, I wonder if you could help us with the pension outlook for next year, both FAS and CAS. And then, just thinking about the CAS outlook beyond 2024 and how that remaining balance kind of trails off in the coming years.\n\nJay Malave -- Chief Financial Officer\n\nSure, Seth. Yes, I think low single digit for 2024 as a baseline is the way you should look at it. We talked on this call today that there are some upside opportunities to that baseline. Missiles and fire control is certainly a prime opportunity.\n\nJim talked about opportunities related to HIMARS and other programs, and so there could be upside from where we are today. These are ongoing dialogues we're having with our DoD customers. So it's hard to really put them into a firm forecast until we get ourselves a clearer picture in terms of what's going to be under contract and the timing of those deliveries. So I would say low single-digit baseline is the appropriate level to be.\n\nWe're getting better clarity and I think we'll have a lot more clarity come January, provide our full guidance for 2023 and a better outlook on 2024. As far as pension's involved, we do expect the FAS income to come down. You're talking in the range of say $50 million. On the CAS side, we expect the CAS cost to come down as well by about $75 million.\n\nSo the FAS/CAS adjustment all in, we're expecting to come down by about $125 million. That's if we struck things today. As you know, at the end of the year, we'll have to true up and formally change, but that's based on what we see today. As far as CAS is involved, we're going to have to get back to you in '24 and beyond in that.\n\nGreg will have to come back to you, Seth, on that.\n\nOperator\n\nOur next question, from Kristine Liwag with Morgan Stanley. Please go ahead.\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nHey, good morning, everyone. Greg, congratulations, and welcome, Maria. Jim and Jay, thank you for providing color on the specific headwinds in 2023. But maybe taking a step back for a 30,000-foot view, the defense budget environment is pretty robust.\n\nWe saw the '22 budget request up mid-single digit. The Ukraine military aid so far adds another 10% to the '22 modernization budget. Your book-to-bill also year-to-date is 1.1 times. I guess, I would have thought that these items could have offset the specific 2023 headwinds you called out.\n\nSo maybe absent the specific programs you mentioned, should we expect the portfolio to grow above, below or in line with the overall DoD budget?\n\nJim Taiclet -- Chairman, President, and Chief Executive Officer\n\nSo Kristine, I would say, first of all, that the defense budget is expected to go above and beyond what the President's original submission was a few months back in 2023, right? Now even if that happens, and we do expect it to happen, and I would just point out a couple of programs that probably would benefit from that, and that includes C-130 in that and F-35 production. But it hasn't happened yet, so we're not putting it into our forecast. And let me just take a minute to step back and really reemphasize what Jay said, in that we don't have enough real information right now in the -- early in the fourth quarter of the year to even give much more than an estimate of what the trend will be next year. So starting in 2024, we're going to start doing January guidance that's formal.\n\nWe're not going to do anything ahead of that. And I'll tell you the three issues that I've learned in my couple of years in management here we just don't have clarity on. One is the defense budget, which you just raised a minute ago. We don't know what it's going to be.\n\nIn January, we'll know what the defense budget is going to be. And then, along with that, what's the status of the major orders and contracts that get put into that budget because as you're again pointing out, what's the mix of the budget increase going to be as far as what the contracts and orders come from that. And then, finally, we don't necessarily have status of what the supply chain health is going to be even in 2023 yet because if there's another COVID spike in the winter like there was last time, we're going to have effects in our supply chain. So there's -- those three issues really makes it, I think, almost impossible to give you really high confidence trending information, which has been a tradition at the company when the defense budget was rising 5% to 10% a year.\n\nBut that's not -- and there was no COVID, by the way, but that's not the situation now. So we're going to start next cycle without trying to give you a trend line in October. We'll give you as solid of a formal guidance as we can in Jan of 2024 because of all this. Having said that, even on the products that we fully anticipate are going to get increases because there have been actions inside of government to make it happen, I used the analogy last call of the clutch wasn't engaged yet even on the order process and paperwork that needs to come to us so we can actually start production.\n\nThe way I'd characterize it now is that the clutch is engaging but into some lower gears initially, right? So the process has started. I really give Dr. LaPlante and others a lot of credit, Andrew Hunter in the Air Force, etc. the secretaries of the Air Force, Navy and Army departments are all engaged in making this happen.\n\nBut it does take time to get through, especially on international FMS contracts and commercial sales too. So for all those reasons, Kristine, it's really hard for us to estimate what -- at this point in the cycle, what programs are really going to benefit. But I'm pretty sure that F-35 and C-130 would be in there. Many of the MFC products, we've already talked about.\n\nBlack Hawk demand, internationally especially, is genning up and, as well as F-16. So I think there's a lot of significant areas where the company can benefit with an additional defense budget increase.\n\nJay Malave -- Chief Financial Officer\n\nYes. And so, Kristine, we fully expect, as Jim mentioned, to participate in this industry upside. You're going to see that in the orders in the backlog. And what we're talking about here is converting that to sales taking a little bit longer than expected.\n\nI think the important thing to remember in terms of 2023 is that in spite of a lower outlook from a sales perspective, even the margin pressure, we're still delivering the same amount of free cash flow that we told you a year ago. And our free cash flow per share outlook has gotten better because of our share repurchase program.\n\nOperator\n\nNext question is from Peter Arment with Baird. Please go ahead.\n\nPeter Arment -- Robert W. Baird and Company -- Analyst\n\nYes. Good morning, everyone. Can you hear me?\n\nJim Taiclet -- Chairman, President, and Chief Executive Officer\n\nYes, we can.\n\nPeter Arment -- Robert W. Baird and Company -- Analyst\n\nCongratulations, Greg. Appreciate all your effort. Jay, just maybe you made -- Jim made a comment about the aeronautics kind of flat to kind of slightly down in '23, but then sustainment becomes a bigger piece of the story as we get into '24. Should we be thinking about aeronautics kind of troughing out in 2023? Is that kind of what you're implying? Or are there other puts and takes that we should be thinking about longer term?\n\nJay Malave -- Chief Financial Officer\n\nNo. Yes, I think so. I think next year, they're dealing with some of the transition related to the changes in delivery profiles on the F-35 -- the production contract. And again, we're just catching up some inventory because some of the delivery profile has moved around.\n\nOnce that abates, that headwind, we're going to see at least a leveling off on the production side, which will lead the growth for sustainment and growth in classified programs and growth on the F-16 program. And so, I would expect them in '24 and beyond to have a nice growth trajectory.\n\nJim Taiclet -- Chairman, President, and Chief Executive Officer\n\nYes. And I'd also add there, Peter, that we're starting to get some real traction on our sort of JADO offering, so to speak. And one of them has been mentioned briefly today called Defense of Guam. And that's the really first, well, highly organized DoD major contract to come out that really drives the capability and not just a product or system.\n\nAnd what it's meant to do is integrate, and this is our whole 5G.MIL approach, actually. That's why we won it, I think. Is that integrating current command and control systems in use by the various services. So the Army's happens to be provided by Northrop Grumman, for example.\n\nWe're going to fully incorporate that into the solution and work with them to do it. And then, we're going to bring the Aegis system from Lockheed Martin into that mix and a number of other programs and products from a range of OEMs. We're going to work together on this for the first time in this way. So I think this is going to be a real pathfinder for the future.\n\nAnd once this demonstrates that it can be a success and the industry has got to coalesce and help make it happen with us, we, as an industry, will see more of these opportunities in the 2024-plus time frame too.\n\nOperator\n\nOur next question is from George Shapiro with Shapiro Research. Please go ahead.\n\nGeorge Shapiro -- Shapiro Research -- Analyst\n\nYes. Good morning. A couple of questions. On the aeronautics area,  LRIP 16, you're not supposed to get in Q4, Jay.\n\nDoes that come with added sales that you may be working on now as well? And then a second question, if you look at the incremental margin on the profit you provided on the F-35 and the $325 million of sales, it's like 21%. Does that imply that you increased the margin on the F-35 program? And will that help the margin next year? Or is it more than offset by the growth in the sustainment?\n\nJay Malave -- Chief Financial Officer\n\nWell, on the second question, George, we did have a profit adjustment on the F-35 program and the production program there. So we will see moving forward a higher recurring margin rate there. As far as Q4 and Lot 16, yes, we do expect that order in the fourth quarter. As Jim mentioned, a little bit over $8 billion.\n\nWe do expect a ramp-up in sales at ARRW, including F-35, and that will include F-16. So to answer your question, yes, that will certainly be part of the sales mix here in the fourth quarter.\n\nOperator\n\nNext, we'll go to Rich Safran with Seaport Research Partners. Please go ahead.\n\nRich Safran -- Seaport Research Partners -- Analyst\n\nJim, Jay, Greg, Maria, good morning. How are you? Jim, I heard your opening remarks about uncertainties on the supply chain and all that. And Jay, I'm going to put you a little bit on the spot here. And hopefully, I'll get you to answer a long-term cash flow outlook question.\n\nBecause I think last year, you gave a long-term cash flow outlook and even added a year. So you've been talking long term this morning and recognizing there's not a lot of high confidence here. Do you have enough visibility to give us a long-term cash flow update? And if possible, could you catch that in terms of buybacks and free cash flow per share?\n\nJay Malave -- Chief Financial Officer\n\nWell, Rich, so if you think about our free cash flow last year, and I'm going off a little bit off recall here, we said $6.1 billion in '23. I believe it was $6.2 billion in 2024. I don't see any reason why we can't deliver that and continue to deliver that level of free cash flow beyond '23 and '24. And our free cash flow, again, with the share repurchase program, will get better than what we were saying a year ago.\n\nAgain, just our management focus on working capital, our management focus, discipline in delivering free cash flow is not going to stop after one year. And so, I'm pretty confident that we can continue to deliver the free cash flow that we committed to a year ago. And again, our free cash flow per share, our growth, you're looking probably in the range of mid-single-digit growth over this period of time.\n\nGreg Gardner -- Vice President, Investor Relations\n\nHey, John. This is Greg. I think we've come up to the top of the hour. So with that, I'll turn the call back over to Jim.\n\nJim Taiclet -- Chairman, President, and Chief Executive Officer\n\nSure, Greg. Thanks. I'd like to conclude today by, again, reinforcing what Jay just talked about: our commitment to delivering long-term, attractive and reliable total returns to shareholders, underpinned by our strong cash generation and our robust balance sheet, as well as delivering on these 21st century solutions to meet the challenges that our customers are facing in global security right now. And some of you might have been around when I was at American Tower, we focused completely on free cash flow per share generation.\n\nAnd that got us through 18 years of up and down cycles, the Great Recession and a few other issues that happened along the way. That's the right metric for this company, too, and that's why Jay and I are so -- is so much emphasizing it today. So we're positioning ourselves for anticipated growth inflection in the next few years, investing in innovative technologies for our customers' missions, as I said, and strong repurchases along the way to amplify the per share value creation as we go. So thanks again for joining us today, and we look forward to speaking with all of you on our next earnings call in January.\n\nJohn, that concludes the call. Thanks, everybody.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGreg Gardner -- Vice President, Investor Relations\n\nJim Taiclet -- Chairman, President, and Chief Executive Officer\n\nJay Malave -- Chief Financial Officer\n\nRob Stallard -- Vertical Research Partners -- Analyst\n\nRon Epstein -- Bank of America Merrill Lynch -- Analyst\n\nMatt Akers -- Wells Fargo Securities -- Analyst\n\nPete Skibitski -- Alembic Global -- Analyst\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nRob Spingarn -- Melius Research -- Analyst\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nPeter Arment -- Robert W. Baird and Company -- Analyst\n\nGeorge Shapiro -- Shapiro Research -- Analyst\n\nRich Safran -- Seaport Research Partners -- Analyst\n\nMore LMT analysis\n\nAll earnings call transcripts"
}