{
  "companyName": "Marathon Petroleum",
  "companyTicker": "MPC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/marathon-petroleum-mpc-q3-2022-earnings-call-trans/",
  "content": "Marathon Petroleum (MPC 0.18%)\nQ3 2022 Earnings Call\nNov 01, 2022, 11:00 a.m. ET\n\nOperator\n\nWelcome to the MPC third quarter 2022 earnings call. My name is KC, and I will be your operator for today's call. [Operator instructions] Please note that this conference is being recorded. I will now turn the call over to Kristina Kazarian.\n\nKristina, you may begin.\n\nKristina Kazarian -- Managing Director\n\nSounds great. Welcome to Marathon Petroleum Corporation's third quarter 2022 earnings conference call. The slides that accompany this call can be found on our website at marathonpetroleum.com under the Investor tab. Joining me on the call today are Mike Hennigan, CEO; Maryann Mannen, CFO; and other members of the executive team.\n\nWe invite you to read the safe harbor statements on Slide 2. We will be making forward-looking statements today. Actual results may differ, and factors that could cause actual results to differ are included there as well as in our filings with the SEC. And with that, I'll turn it over to Mike.\n\nMike Hennigan -- Chief Executive Officer\n\nThanks, Kristina. Good morning, everyone. First, I'd like to introduce Tim Aydt, who will be joining our call as a new executive vice president of refining. Tim has over 37 years of experience in leadership roles across our midstream and refining organizations.\n\nMost recently, he was executive vice president of pipelines, terminals and marine and chief commercial officer, where he oversaw the business development for the MLP. Now, turning to the macro environment. Roughly 4 million barrels per day of refining capacity has come offline globally in the last couple of years. Yet demand for the transportation fuels we manufacture remains robust and continues to grow.\n\nIn the U.S., demand is still below 2019 pre-COVID levels, and we believe there will be a continued recovery. As supply remains constrained and demand continues to rebound, we maintain a bullish outlook toward the refining environment as we look into 2023. Our third quarter results reflect the team's operational and commercial execution as we focused on delivering products for consumers in this very tight market. In our refining segment, we ran near full rates while maintaining our steadfast commitment to safely operating our assets, protect the health and safety of our employees and support the communities in which we operate.\n\nThe commercial team focused on optimizing our scale, footprint and feedstock slate to deliver against strong demand. And despite volatility in the global energy markets, our execution reflects progress toward our goal of improving commercial performance. We normally see seasonal demand decline at this time of the year but to date, we're not seeing those signs. Strong forward crack spreads and wide salary differentials for 2023 indicate the expectation of a strong refining environment going forward.\n\nIn the fourth quarter, we're currently running our system at full utilization, except for the planned maintenance activity we have occurring given our back of the year weighted turnaround schedule. Aside from the refining business, I want to point out that our Midstream segment earnings continue to grow. In the third quarter, our adjusted EBITDA was up nearly 9% year over year in midstream. We've been executing strategic capital investments, fostering a low-cost culture and optimizing the portfolio, including advancing several organic growth projects in the Permian Basin.\n\nThe strength of these cash flows supports MPLX's decision to increase its quarterly distribution by 10%. Based on this level, MPC will receive $2 billion of distribution from MPLX annually. We've received questions regarding the structure of MPLX and whether MPC will acquire the outstanding public unit. So we want to restate what we said in the past.\n\nMPLX is a strategic part of MPC's portfolio, its current pace of cash distributions to MPC is $2 billion per year, and we expect that to continue growing. MPLX has continued to demonstrate resilient through-cycle earnings and growing cash flows. As MPLX pursues its growth opportunities, we expect the value of this strategic partnership will continue to be enhanced, and we do not plan to roll up MPLX. Switching to capital allocation, we believe MPC's current capital allocation priorities are optimal for our shareholders.\n\nIn October, we completed our $15 billion return of capital commitment, repurchasing approximately 30% of MPC's shares outstanding. We're committed to executing our capital allocation framework to deliver peer-leading total return to shareholders. Today, we announced an increase to MPC's quarterly dividend of approximately 30%. In addition, we intend to continue repurchases, which we believe are a more efficient way to return capital and we expect to commence buybacks in November using the remaining $5 billion repurchase authorization.\n\nIn early 2000, we shared our three strategic areas of focus. They have become part of MPC's DNA embedded in our unwavering commitment to increase profitability, have the best through-cycle cash flow generation and drive a long-term value creation. As we focus on strengthening the competitive position of our assets, in September, we closed on our Martinez Renewables joint venture with Neste. Construction is well underway, and we expect Phase 1 mechanical completion by year-end.\n\nWe're excited about the partnership with Neste, a global leader in feedstock procurement and renewable fuels production. This joint venture enhances the value of the project by reducing MPC's capital commitment to $0.55 per gallon as well as improving the overall project feedstock slate. Neste has the obligation to bring 80% advantaged feedstock in Phase 2. Due to these improvements, we expect MPC share in the JV's EBITDA to be only 25% lower than our original stand-alone case.\n\nAdditionally, this strategic partnership with Neste creates a platform for collaboration. We believe there will be opportunities to leverage the differentiated knowledge and capabilities of two industry leaders as we pursue our shared commitment to the energy evolution. We continue to challenge ourselves to lead in sustainable energy and have made progress on the sustainability goals that we have set for ourselves. Focusing specifically on the Martinez Renewables project which converts our petroleum refinery into a renewable fuels facility.\n\nWe anticipate the conversion to result in a 60% reduction of the facility's Scope 1 and Scope 2 GHG emissions, 70% lower total criteria air pollutants and 1 billion gallons of water saved annually. If you haven't had a chance yet, we invite you to go to the Sustainability section of our website and learn more about the ways we are challenging ourselves to lead in sustainable energy. At this point, I'd like to turn the call over to Maryann.\n\nMaryann Mannen -- Chief Financial Officer\n\nThanks, Mike. Moving to third quarter results. Slide 6 provides a summary of our financial results. This morning, we reported adjusted earnings per share of $7.81.\n\nThis quarter's results were adjusted to exclude three items: a $549 million noncash pre-tax gain related to the contribution of our refining assets to the Martinez Renewables JV, a $509 million noncash gain related to an MPLX third-party contract reclassification and a $28 million LIFO inventory charge. Adjusted EBITDA was $6.8 billion for the quarter and cash flow from operations, excluding unfavorable working capital changes was just under $4.5 billion. During the quarter, we returned $285 million to shareholders through dividend payments and repurchased $3.9 billion of our shares. Slide 7 shows the reconciliation between net income and adjusted EBITDA as well as the sequential change in adjusted EBITDA from the second quarter of 2022 to the third quarter of 2022.\n\nAdjusted EBITDA was lower sequentially by approximately $2.3 billion. This decrease was primarily driven by refining and marketing as the blended crack spread was down approximately $10 per barrel, reflecting a 25% quarterly decline. The tax rate for the third quarter was 22%, resulting in a tax provision of $1.4 billion. The tax rate is similar to last quarter due to the refining and marketing representing a larger component of total earnings.\n\nMoving to our segment slide results. Slide 8 provides an overview of our refining and marketing segment. During the quarter, we focused on supplying transportation fuels to meet continued strong market demand. Our refining assets ran at 98% utilization processing over 2.8 million barrels of crude per day at our 13 refineries.\n\nWe saw margins decline sequentially across all three regions. Capture was 97%, reflecting a strong result from our commercial team in a volatile global market. Operating expenses were higher in the third quarter. Energy costs were approximately $0.15 per barrel higher in the third quarter, driven by higher natural gas prices.\n\nAdditionally, we recorded a nonrecurring multiyear property tax assessment of $0.13 per barrel in the third quarter, which we will continue to pursue recovery. We believe the actions we have taken to bring our structural operating cost down to approximately $5 per barrel are sustainable. The cost increases we have seen year-to-date have almost entirely been driven by higher energy costs. Turning to Slide 9, which provides an overview of our refining and marketing margin capture this quarter.\n\nMarket backwardation remained a headwind for the industry but our commercial strategy of selling ahead of product backwardation while keeping inventories optimized, supported our ability to meet demand and capture strong prompt margins. And while not as significant as the previous quarter, secondary product prices were a headwind as they lagged higher light product prices. Our ability to capture 97% of the market indicator across an incredibly volatile three months was in part due to our commercial responses. Slide 10 shows the change in our Midstream EBITDA versus the second quarter of 2022, our Midstream segment demonstrated earnings growth with adjusted EBITDA up approximately 3% sequentially and up 9% year over year.\n\nOverall, we continue to focus on identifying and efficiently executing high-return projects to drive further growth for our midstream business. As Mike mentioned earlier, the growth of MPLX's earnings supported its decision to increase its quarterly distribution by 10% to $0.775 per share and MPC expects to receive $2 billion in cash from MPLX on an annual basis. MPLX remains a source of durable earnings in the MPC portfolio and as MPLX grows its free cash flow we believe it will have the capacity to return capital to its unitholders. Slide 11 presents the elements of change in our consolidated cash position for the third quarter, operating cash flow excluding changes in working capital, was just under $4.5 billion in the quarter.\n\nWorking capital was a $1.9 billion headwind for the quarter. This quarter, we made a payment of $2.3 billion for estimated federal income taxes declining crude prices or also a headwind to working capital. Capital expenditures and investments totaled $756 million this quarter. The increased level of capital spending was related to a ramp in activity related to the Martinez Renewables fuels facility conversion and the Galveston Bay store project.\n\nThe STAR project is expected to be completed early 2023. Other cash flow benefits of $790 million is primarily driven by the distribution MPC receipt from the Martinez Renewables JV upon closing on September 21. At the end of the third quarter, MPC had approximately $11.1 billion in cash and short-term investments. Moving to Slide 12.\n\nWe have completed our $15 billion share repurchase commitment, utilizing the proceeds from the Speedway divestiture at an average price of $78, ahead of our commitment of no later than the end of 2022. As you will see today, when our quarterly financials, the 10-Q was published, we were able to complete that early in the month of October. We intend to begin repurchase against our $5 billion outstanding authorization in November, now that our financials are public. On Slide 13, I'd like to walk you through our financial priorities, sustaining capital.\n\nWe remain steadfast in our commitment to safely operate our assets, protect the health and safety of our employees and support the communities in which we operate. We're committed to a secure, competitive and growing dividend. We believe the quarterly increase to $0.75 per share we announced today is secured through cycles, competitive with peers and the broader market and leaves opportunity to potentially grow our dividend in the future. We anticipate this dividend will be supplemented with repurchases and we are committed to executing our capital allocation framework to deliver peer-leading total returns to shareholders.\n\nWe will evaluate growth opportunities and margin enhancing projects. Share repurchases will be used to return excess capital to shareholders, which we believe are a more efficient way to return capital and will continue to lower our share count. Underpinning these priorities, we believe a strong balance sheet is essential to being successful in a competitive commodity business. It's the foundation, allowing us to execute our strategy.\n\nOn Slide 14, we highlight the strength of MPC's balance sheet. We continue to manage our balance sheet through an investment-grade credit profile. At the end of our third quarter, MPC stand-alone gross debt to capital ratio is 21% which is under our target of a 25% to 30% gross debt-to-capital ratio. MPLX has a leverage ratio of 3.5 times debt to EBITDA under its target of four times.\n\nBoth businesses have strong balance sheet with leverage ratios under their respective targets. Turning to guidance on Slide 15, we provide our fourth quarter outlook. We expect crude throughput volumes of roughly 2.7 million barrels per day, representing 93% utilization. Utilization is forecast to be lower than third quarter due to planned turnaround activity having a higher impact on crude units in the fourth quarter.\n\nPlanned turnaround expense is projected to be approximately $430 million in the fourth quarter with a significant level of activity in the Gulf Coast region. Turnaround activity is reflected in our fourth quarter throughput guidance. We are expecting operating cost per barrel in the fourth quarter to be lower projected to be $5.30 per barrel for the quarter. This is primarily driven by expected lower natural gas and energy costs.\n\nAs a reminder, natural gas has historically represented approximately 15% of operating costs. Our natural gas sensitivity is approximately $330 million of annual EBITDA for every dollar change per MMBtu. This equates to a sensitivity of approximately $0.30 per barrel of cost. Distribution costs are expected to be approximately $1.3 billion for the fourth quarter.\n\nCorporate costs are expected to be $170 million representing the sustained reductions that we have made in this area. In closing, we will continue to execute on our three strategic pillars, strengthening the competitive performance of our assets, fostering a low-cost culture and improving our commercial performance. We are committed to position MPC as a reliable and efficient energy provider with new investments focused on high-return opportunities supporting the company's evolution, which will position it to lead in an energy diverse future. We will stay steadfast in our plan to position MPC as the refiner investment of choice, striving to deliver superior cash returns regardless of market conditions, and while ensuring we safely operate our assets, protect the health and safety of our employees and support the communities in which we operate.\n\nLet me turn the call back to Kristina.\n\nKristina Kazarian -- Managing Director\n\nThanks, Maryann. As we open the call for your questions, as a courtesy to all participants, we ask that you limit yourself to one question and one follow up. If time permits, we will pre-prompt for additional questions, And with that, operator, can you open up for questions today.\n\nOperator\n\nYes. Thank you. [Operator instructions] Our first question today comes from Doug Leggate with Bank of America. Go ahead, please.\n\nYour line is open.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nThank you, guys. Sorry, trouble with the mute button. Good morning, everyone. Thanks for taking my questions.\n\nI guess Mike or Maryann, whichever one wants to take this. Now that you've completed the buyback or at least the first phase of the buyback -- your distributions from MPLX were still more than covering your dividend. So can you kind of walk us through how you think about what the new pace of buybacks could look like? Because obviously, the $5 billion authorization is probably going to be true through fairly quickly. And what we should think of in terms of the balance between future dividend growth and where you want your balance sheet to be? Basically, it's a use of cash question because this is a pretty nice problem to have.\n\nAnd then I've got a follow-up, please.\n\nMaryann Mannen -- Chief Financial Officer\n\nThanks, Doug. So as you know, we made a commitment that we would reassess the dividend immediately completing the $15 billion, and we've done so. We wanted three objectives really around the dividend. One was for it to be secure competitive.\n\nAnd then obviously, with the potential to grow dividends in the future, as you said, we believe our increase to $0.75 in the quarter meets all three of those objectives. As you know, we completed that $15 billion share authorization and have a remaining $5 billion new authorization, which both Mike and I had shared on our prepared remarks that we intend to begin to use that very early in the month of November. We continue to think that our equity is undervalued. And when we look at distribution return on capital between dividend and share repurchase, we believe share repurchase remains a more efficient tool in that portfolio.\n\nSo we'll look at market, we'll look at other growth opportunities, and we'll look at the macro, and we'll continue to use share repurchase absent other growth opportunities as the vehicle to continue to return capital to the shareholders and every decision that we make, obviously, focused on trying to ensure we've got peer-leading returns. I hope that helps, Doug.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nIt does, Maryann. Sadly, it also prompts my follow-up if I may. And it's a little bit of a, I guess, a less easy question to answer. And you just made the point of -- that you believe your equity is undervalued.\n\nNow we obviously agree with that, but your share price is at an all-time high. So when we think about value when the market thinks about value, there have to be some assumptions that go behind how you're defining value. So my question is, what's the mid-cycle to the extent you can define it EBITDA or cash flow that you anticipate from the portfolio that goes behind that statement of we believe our equity is undervalued? And I'll leave it there. Thanks.\n\nMaryann Mannen -- Chief Financial Officer\n\nDoug, I'll start off, and I'm sure Mike will want to add incremental comment as well. I think the mid-cycle is an extremely difficult way for us to put a pin in as we stand right now. Certainly, when we look at the market dynamics, as Mike shared as well, we remain pretty bullish on the outlook, not only for the fourth quarter, but certainly as we head into 2023. So a series of factors that we use and we look at to determine when we say we believe that equity is undervalued, and we'll continue to be as opportunistic as we can as we are using share repurchase in evaluating where both the fourth and the first quarter will go and, frankly, longer term.\n\nSo several factors that we consider, but we certainly look right now at a fairly optimistic outlook for the next several quarters.\n\nMike Hennigan -- Chief Executive Officer\n\nAnd Doug, it's Mike. I'll add to Maryann's comments. So what I said in the prepared remarks is the fundamentals of the business have changed as a result of what's happened over the last couple of years -- roughly 4 million barrels of refining capacity has come out of the market. At a time early on when demand was down, but demand continues to recover.\n\nWe're still not at 2019 levels of demand across all the products, gasoline, diesel, jet fuel. So we're still below, but we are slowly recovering. So you have supply constrained, you got demand recovering. And to your point, the mid-cycle that we see into the future is clearly above the previous mid-cycle because the global fundamentals have changed.\n\nAnd as we look out in time, there are going to be some capacity additions occurring throughout the world, but we also believe that demand is going to continue to pace such that the new mid-cycle for what we're going to see is significantly above where we've been in the past. So that's obviously why we have a bullish overtone here and why we still believe that the assets that we have are still trading under intrinsic value. Now, I know you'd love us to give the exact number what we call internally. So I'm not going to do that, as you know but we stress tested.\n\nWe stress tested in a low case, our view of a mid case and our view of a higher case. And as we look at all those things, we still believe fundamentally that we can purchase our shares at a price that's still adding value to our shareholders. So that's why we've been so aggressive in that area. We had committed to that return.\n\nAs Maryann said in the prepared remarks, we bought back at a pretty good number, and we still see that as an ongoing opportunity. You also asked about the dividend. I mean our dividend being where it was, was mainly because of the equity price coming up. And we did feel it weren't an adjustment.\n\nPeople had asked us for several quarters in a row, whether we're going to do that. And we said we're going to do it after we do the $15 billion of Speedway. So hopefully, we were consistent with what we said there. We've moved it up as Maryann said, it's not a tax-efficient way to return to shareholders.\n\nBut we want to have a competitive number as well. So 30% is a good bump. We'll keep an eye on that. And at the same time, we're going to continue to reduce the share count.\n\nHopefully, that gives you a little more color.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nYou make significantly higher mid-cycle as what I was looking for. Thanks very much indeed.\n\nOperator\n\nOur next question comes from Neil Mehta with Goldman Sachs. Go ahead, please. Your line is open.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nGood morning, team. The first question is really to build on your comments around commercial. The capture rates have continued to come in very well over the last couple of quarters. And Mike, I know when you came into the role, one of the opportunities you identified was really strengthening your commercial effort.\n\nSo can you just talk about what specifically has driven sort of that improvement in capture rates? And how much of that is because of those commercial initiatives?\n\nMike Hennigan -- Chief Executive Officer\n\nYeah. Thanks, Neil, for the question. I'm going to let Rick and Brian comment. But I'll -- before they do, I would say to you, we did say early on that we had three major areas that we're going to put emphasis on and we've made progress in the commercial area.\n\nWe still see a lot more opportunity for us. So we're not done in that area, but we have made some progress. I'll let Rick and Brian give some comments.\n\nRick Hessling -- Senior Vice President, Global Feedstocks\n\nYeah, Neil. It's Rick. Thank you for the question. It's one of these items where we've been looking at the pull through, and we've been seeing it the last several quarters.\n\nSo it's nice that you're noticing it as well. I would start by saying earlier this year, we changed a lot. We changed processes, we change structure and culture around all things commercial that's been a game changer for us. In terms of details and how competitively, I'll be careful in what I share here, Neil.\n\nBut if you look at it over were through a broad lens, we've stood up a dedicated what we call VCO team, value chain optimization team that goes from end-to-end, from feedstocks to products from purchasing or procuring to placement and we're relooking at everything we do, the why, the how, all modeling constraints, assumptions, everything was put on the table and relooked at. And so a lot of change and great positive results have come out of that, especially in the midst of the environment we're in. So every win, when you're in an environment like we're in today is exemplified with the high crack and I think you're seeing that. In addition, you're seeing a lot of the re root of global products and feedstocks happening throughout the world.\n\nAnd through this initiative, we've been able to take advantage of a lot of purchasing of feedstock and the placement of our feed -- clean products in a time that has been highly advantageous. So with that, I'll turn it over to Brian for more color on the clean side.\n\nBrian Partee -- Senior Vice President, Global Clean Products Value Chain\n\nThanks, Rick. Yeah, Neil, just great question. I appreciate the opportunity to kind of weigh in here. And Rick said it, but I'll double down on it.\n\nIt's about one or two things. It's literally everything. We've changed. We've moved mountains and really proud of the work that the team has done.\n\nThere's been a lot of progress, as Mike alluded to in his comments, there's more to get. I think foundationally, as we look going forward, one of the key components is our digital transformation that underpins a lot of the efforts we have on the commercial front. And we think leveraging our scale across our coast-to-coast platform provides us a distinct opportunity set as it relates to that digital evolution in our space. The other thing I'd say just real quick is what underpins all this? Or alignment changed everything.\n\nWe fundamentally changed the organizational structure and realign people, we empowered people and we held them accountable. We have a people-centric business in the commercial space, and we're really leveraging that. And the core tenet of what we're trying to accomplish is to let our great people do great things.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nYeah, that's great color. So it's showing up in the numbers. And as the follow-up is just a specific dynamic gravity stock. We've seen WCS really blow out.\n\nHistorically, you guys have been one of the larger buyers of Western Canadian crude. But do you also see heavy wider in barrels like Maya and high-sulfur fuel oil. So maybe you talk about what's driving the weakness in the heavy crude and product markets and how are you optimizing your refining slate to take advantage of that?\n\nRick Hessling -- Senior Vice President, Global Feedstocks\n\nYeah. Hi Neil, it's Rick again. So great question. These markets are blowing out.\n\nWe're seeing unprecedented levels again. On the heavy side, I think I looked this morning and I saw the forward curve. December was marked at minus 30, Q1, minus 27 and unbelievably stoked. 2023 Cal was 23 under, So what's driving it? Boy, it is a plethora of items.\n\nProduction from the Canadian front, Neil, is pretty solid and we're entering right now blending season, as you know, the diluent blending season is slowing the pool, which is certainly helping as well. We've had some short-term shot in the arms with some maintenance in PADD 2, 3 and 5. When I say maintenance, unplanned maintenance, that's been a plug for us. And then fuel oil is really cheap.\n\nSo you're seeing a lot of people substitute that for heavies in other parts of the world. So all of this is driving -- is really putting pressure on anything that hits the U.S. Gulf Coast. And lastly, I'll say, when you look at the Gulf of Mexico medium sour production, it's been healthy as well.\n\nSo lately here, you're seeing Mars blow out. Certainly, you referenced the Canadians. So all of these items are stacking on top of one another and creating for a very bullish outlook here into 2023. In terms of MPC specifically, I think you are well aware, we have great access and optionality that we've built out our system over the years in PADD 2, PADD 3 and now PADD 5 and so we are going heavy.\n\nWe're heavying up our slate. We're filling up our cokers as you would expect, and we'll continue to do so into Q3 as these indicators tell us to do so.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nMake sense. Thank you, team.\n\nBrian Partee -- Senior Vice President, Global Clean Products Value Chain\n\nYou're welcome, Neil.\n\nOperator\n\nOur next question comes from Roger Read with Wells Fargo. Go ahead, please. Your line is open.\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nYeah, thank you. Good morning.\n\nMike Hennigan -- Chief Executive Officer\n\nGood morning, Roger.\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nLet me take the diesel question that everybody wants to ask on all these calls, kind of what you're seeing across your system? Whether or not the Mississippi River issues had anything to do with what's going on in the Central part of the country and -- and just any thoughts you have on some of the policy issues that are percolating out there in terms of any risk of government intervention on the diesel export front?\n\nBrian Partee -- Senior Vice President, Global Clean Products Value Chain\n\nYeah, Roger. This is Brian Partee. I can take that. There's a couple of different things to unpack there.\n\nFirst on the Mississippi River. We have a really strong and capable Inland River system and team. We've got over 20 tugs and 300 barges. We largely operate on the Ohio River, but also do transit the Mississippi.\n\nAnd the team has been working extremely hard over the last several months making sure the product continues to flow. So I can say there's been no impact, but it's been on the heels of our team working very diligently hard and positioning the right equipment in the lower Mississippi River to make sure that we don't have disruptions. So on that front, things have been going pretty well. As it relates to the ongoing dialog with the administration, we have had frequent engagement and communication, which has been welcomed.\n\nI think it's good to share and understand each other's perspective. And as it relates to the export ban, I think that through the dialog, there's been general consensus and understanding that, that likely would be counterproductive the goals and objectives of building inventory and reducing prices. I mean, fundamentally, if you look at our 2.5 million barrels of exports in the U.S., we just don't have enough demand to back it in. We've got grade mixes.\n\nWe've got logistics disconnect. So I think there's been broad understanding and engagement that, that's not the best course of action. Now all that being said, I just can't speak on behalf of the administration, I think anything is on the table at any time.\n\nMike Hennigan -- Chief Executive Officer\n\nHey, Roger, it's Mike. I'll just add to Brian, I'll give you my thoughts on it. Number one is I do think the administration understands that a ban would not have the effect that they were originally looking for and instead would decrease inventory levels, reduce refining capacity and actually put upward pressure on consumer fuel prices, which is not what they were intending. So I think given these potential outcomes, it's my opinion, that the administration would not pursue that path.\n\nBut that's just -- that's my thought at this point.\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nYes, I follow that, but then see a wish for a windfall profit tax, which would be unlikely to lower prices either based on experience. So you just don't -- never know what they might decide they want to do or feel forced to. I threw a lot into that. So I'll turn it over or turn it back over.\n\nThanks.\n\nOperator\n\nOur next question comes from John Royall with J.P. Morgan. Go ahead, please. Your line is open.\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nHey, guys, good morning. Thanks for taking my question. So on the opex guidance for 4Q, I'm surprised to see it down from 3Q levels given you have more turn relative to 3Q. So anything to point to there either something from 3Q that's non-repeating or anything in 4Q in particular?\n\nMaryann Mannen -- Chief Financial Officer\n\nSure, John. It's Maryann. So in the third quarter, we had really three things that were largely equally weighted, that impacted the actual results in the quarter. The first, as you mentioned, was -- I call it a one-time.\n\nWe had about a $0.13 impact from a four-year adjustment on property tax costs. Unfortunately, the state has the ability to go back and do that. So that is non-repeating. And as I mentioned in my remarks, we'll go after that and continue to pursue it.\n\nBut unfortunately, when it's live, we need to record it. So that was in the quarter. Second, obviously, higher energy costs just in general, quarter over quarter, as I mentioned. And then the last piece, to your point, in the third quarter, given the level of back half-weighted turnaround expenses or other activities associated with that or higher.\n\nWhen we gave guidance for the fourth quarter, we certainly see energy costs somewhat nat gas related decline in Q3 to Q4. And obviously, the tax impact, we do not expect to repeat. I hope that addresses the question.\n\nMike Hennigan -- Chief Executive Officer\n\nJohn, it's Mike. Let me just add to what Maryann just said. So we try our best to give you as good a guidance as we can with the one caveat being where is natural gas price going to be? So we look at the forward curve right before we give the guidance and just reminding you the sensitivity is $0.30 a barrel for every $1 per million BTUs. So where that actually ends up in the quarter is hard to call.\n\nSo we just take a look at the forward curve ahead of time and put our best number on it. So what I feel good about is the areas that we control on cost. I continue to say we have sustainable reductions that we've seen over the last couple of years, and that's good. As Maryann mentioned, we have a tax dispute that we'll follow up on.\n\nAnd we have this unknown as to where natural gas will actually price itself throughout the whole quarter. Hopefully, that helps.\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nIt does. Thank you. And then just a follow-up to Neil's question on capture rates. I think you went into some kind of the broader dynamics.\n\nBut just -- just wanted to be relative to the commentary that it would be down. And I think you touched on it a little bit in the prepared remarks, but just kind of some of the moving pieces there. And then in order in 4Q, it's looking to me like it's a heavy maintenance quarter relative to 3Q and then you have price moving up. It is on October, so should we thinking -- be thinking about that number kind of pointed down in 4Q?\n\nMaryann Mannen -- Chief Financial Officer\n\nHey, John, Maryann. I'll start and then I'll pass it to Rick and Brian to give you any incremental color. But you're right, when I provided guidance on capture for the third quarter, knowing that we had a fairly strong third and fourth quarter, frankly, but third quarter compared to the second quarter turnaround activity, we expected that we would have seen some capture impact as a result. Having said that, there were certainly some offsetting elements in the quarter.\n\nFirst, as you know, we actually saw prices come down a bit and those lower prices actually improved our clean product margins. Pricing actually really did benefit as we looked at the volumetric gains quarter over quarter. And then while secondaries were still a headwind in the quarter, they were better than what we had initially projected. Your question was a little bit tough, you were cutting in and out.\n\nBut as we talk about the fourth quarter, I think, is what you were asking as well. Obviously, it will be, as you've seen from the guidance, our heaviest turnaround month of all -- excuse me, quarter of all four quarters. So we would certainly anticipate that capture in the fourth quarter could be below what we saw in the third quarter for some of those very reasons. But let me pass it to Rick and Brian to give you incremental color.\n\nI think Mike wants it too.\n\nMike Hennigan -- Chief Executive Officer\n\nYes, before we pass to the other guys, John, I just want to remind everybody that when Q2 margins were as high as they were, we made a conscious decision to delay some activity into the back half of the year, specifically into the fourth quarter. At that time, we felt it was a good idea, provided there was no safety issues or anything to make that adjustment. So some of what's happened here is we've traded some Q2 margin for Q4 margin and we still think that was a good call, but it has loaded up a little bit more activity in the fourth quarter as far as our turnaround activity.\n\nRick Hessling -- Senior Vice President, Global Feedstocks\n\nJohn, this is Rick. I'll just add to Maryann's earlier comments and make a comment on secondary product margins. So we're one month into the quarter. We'll see where the next two months go.\n\nBut secondary product margins have been so volatile and trying to predict where WTI is going to go from here is anyone's guess. I would say that's one of the biggest wildcards on where our capture will end up. So -- more to come there. We'll see how the rest of the quarter plays out.\n\nAnd with that, I'll see if Brian has any color to add.\n\nBrian Partee -- Senior Vice President, Global Clean Products Value Chain\n\nYes, thanks, Rick. Just one quick summary wrap-up comment. It's hard to call the ball one month into the quarter, but I will say that October from a clean products perspective, started off strong, as Mike indicated in his opening commentary, we did not see the seasonal turndown in demand. We've had weather working largely in our favor.\n\nWe haven't had a Hurricane event in the country as a whole has been pretty moderate on the weather front. We did see -- we've seen strong demand throughout the month of October. And correspondingly, we've seen strong margins as well. So directionally, I think, favorable but too early to call the ball.\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nVery helpful, thank you.\n\nBrian Partee -- Senior Vice President, Global Clean Products Value Chain\n\nYou're welcome.\n\nOperator\n\nOur next question comes from Sam Margolin with Wolfe Research. Go ahead, please. Your line is open.\n\nSam Margolin -- Wolfe Research -- Analyst\n\nGood morning, everyone. Thanks for taking the question.\n\nMike Hennigan -- Chief Executive Officer\n\nGood morning, Sam.\n\nSam Margolin -- Wolfe Research -- Analyst\n\nWanted to ask on the renewable diesel business. You mentioned Neste brings some benefit on the feedstock procurement side. You also have the JV with Archer-Daniels. So you're covered across categories within the feedstock universe, and there's a lot of disparity between vegetable oils and waste oils right now.\n\nAnd so I'm just curious how you think about the feedstock picture overall, whether it's important to really have security on both sides or if you might be leaning toward one specific category of feed stock over another?\n\nBrian Partee -- Senior Vice President, Global Clean Products Value Chain\n\nYes, Sam, this is Brian. I'll take that question. It's a great question. So, first, let me just back up and talk a little bit about what we have going on out west with Martinez.\n\nSo we're well into our prefill strategy. So we've been prefielding since middle of the summer. We're currently buying from over 50 different suppliers. So we forayed into this business two years ago with Dickinson and the team has come up very, very fast in developing those relationships.\n\nBeyond just the types of feedstocks. It's really a big part of our focus in most areas is around logistics flexibility. So Martinez is greatly positioned on logistics flexibility with -- we've got three facilities in the Bay Area that we're bringing feedstocks into, all of which have rail and access to the marine opportunities as well. So -- in addition, we've got our two pretreat facilities in the Central part of the U.S.\n\nin Cincinnati and Beatrice. So we've quickly gone from not being in the business to being holistically in the business with two different plants here shortly, pretreat capacity. And we're confident, very confident in our ability to source optimal feedstocks. But it's really an optimization much like we undertake on the crude side of our business.\n\nWe run an LP model. We look at unit constraints at the refinery, we look at logistics, we look at pricing and of course, CI value. So it's a broad optimization, very similar to what we do on the crude side of our business.\n\nSam Margolin -- Wolfe Research -- Analyst\n\nOK. Thanks. And then speaking of optimization on the refining side, maybe if we could go back in time to the MarkWest acquisition a number of years ago, a big part of that was NGL integration into the refineries or at least there was a contemplated synergy. And now we've got a pretty noteworthy NGL dislocation and specifically butane.\n\nAnd I wonder if that relationship is, as you imagined it at that time or if in the process of your sort of commercial transformation, if you've fenced them off or organize them differently?\n\nRick Hessling -- Senior Vice President, Global Feedstocks\n\nYeah. Hi, Sam. It's Rick. So the call out is outstanding, especially in these low NGL price environments we're in right now.\n\nSo when you look at the logistics of combining MWE and MPC and our total footprint, it's incredible today, especially as we optimize our octane with NGLs and heading into the butane blending season. Really, to answer your question, it's yes and yes. Yes, we saw this coming to the extent it is here today. I would say it's -- it's certainly a nice shot in the arm for us as we optimize around our system, both from specifically butane and all things NGLs tied to our -- tied to our whole system.\n\nWe're seeing specific benefits certainly on the Gulf Coast with Garyville, but it's throughout our entire system. So a great call out.\n\nSam Margolin -- Wolfe Research -- Analyst\n\nThanks so much. Have a great day.\n\nRick Hessling -- Senior Vice President, Global Feedstocks\n\nYou're welcome.\n\nOperator\n\nUp next, we have Paul Cheng with Scotiabank. Go ahead, please. Your line is open.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nThank you. Hey guys, good morning. Two questions. First, I want to go back into the  oil feedstock fine that -- on the -- recently that we have seen the CI adjusted pretreated soybean oil price is mainly comparable to the UCO, the Used Cooking Oil.\n\nSo want to see that how you guys see that? And why do you think that may -- that has happened? And do you think that this trend is going to sustain and corresponding the impact on your feedstock strategy? So that's the first question. The second question is related to maybe that -- how the IRA and also that the timing LCFS prices that we have seen over the past four months impacting your renewable longer-term outlook and strategy? Thank you.\n\nBrian Partee -- Senior Vice President, Global Clean Products Value Chain\n\nYeah. Paul, thanks. This is Brian. I understand the question.\n\nSo first on CI as it relates to soybean oil, UCO and actually even some of the other feedstocks that we look at. I would say that we're at a point or we've been at a point here in the last several months where we like ourselves and others have been in start-up mode. So there's been a bit of a surge in demand in acquiring feedstocks as it relates to start-up. And the market broadly is not super-efficient yet.\n\nSo it's an emerging market. Relationships matter. A lot of the sellers in this space, so whether it's UCO or rendered fats. It's a new business line for them.\n\nSo there's a lot of exploration ongoing. So I don't think it's a structural change as we've seen here in the last couple of months. But I do think it's just the nature of the market evolving from a CI perspective. But as I said earlier, to Sam's question, I think logistics are going to be key.\n\nThose relationships are going to be key to make sure we get the right feedstocks, the most advantaged feedstocks into our facilities. Your second question related to LCFS. Certainly, we've seen the supply and demand of LCFS credits to gap out here over the last 1.5 years or so. The one point I'd make here is we're seeing that in California, that there's other states, other areas, Canada, Oregon that have emerging programs.\n\nSo that's a new variable that's entering into the equation and calculus for us and others in terms of where you actually place the product. So we reported -- CARB reported a pretty big build for the second quarter. Credit is still a little over 1.3 million credit in the second quarter. So that surplus continues to grow.\n\nWe do expect CARB, they're going through a scoping assessment now on the LCFS program. We do expect them to make adjustments to the plan going forward to really support the investments needed on the low carbon side of things. I think that will be an opportunity in 2023 to engage and discuss and probably something we see manifest in 2024. Ultimately, the economics as it relates to RV are really founded on several interrelated variables.\n\nWe've had the positive side of that on the RIN and the Blenders Tax Credit. Certainly, the product pricing in California has been supportive. So that's all been on the positive side. Feedstock pricing, although stable through the third quarter has been toward the higher side as we think about this year.\n\nAnd then as you mentioned, the LCFS have been the lower side. But all that combined considered, we're seeing stable margin production out of our Dickinson facility, and we'd expect the same out in Martinez, just through a variety of different variables.\n\nMike Hennigan -- Chief Executive Officer\n\nHi, Paul, it's Mike. I just want to add a comment. We've been talking about Martinez for a while now. And early on, we said that in order to have a terrific facility, we wanted to have competitive capex and I think everybody has seen our numbers on that.\n\nWe've disclosed that. opex, we're in a really good position with the former refinery asset. Brian has talked about, we're pretty bullish to the logistics assets that we have set up here and the last piece of the puzzle was feedstocks that which you're asking about, and Brian just gave you some color on our side. Plus, I do want to reiterate, that was part of the driver for our partnership with Neste.\n\nWe know their portfolio and see them as a global leader in this area. So it was one of the key factors that enabled us to say we wanted to JV with them. And as we said in our prepared remarks, we think there's more to come with the relationship with Neste. We're working on different things together as we feel that we've had a win-win for both sides of this but feedstock procurement is actually one of the most important parts of this and kind of the last leg of the stool after we talked about capex, opex and logistics.\n\nSo hopefully, that helps.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nSure. Just curious, do you guys have any plan to add additional development plan or now the plan, sales at a next one or two years? Or that you just have the machines going to bump up and you're going to wait until that's fully ramp up. So what type of strategy that you guys have in mind?\n\nMike Hennigan -- Chief Executive Officer\n\nYeah. So we're not sure what you said. Kristina said, you thought you heard you say, are we adding alke plants, did you say alke or R&D?\n\nPaul Cheng -- Scotiabank -- Analyst\n\nNo, no. I'm saying that -- I hear what you say about these vouchers. Curious that now you have the renewable diesel plant and that's going to come up very soon. And so what is the next step in your strategy? Do you plan to add additional new facility or new development in the area before you fully stand up on the material? Or that you say, OK, we just have some major investment on the space and that's run it for a couple of years before we look for the next addition?\n\nMike Hennigan -- Chief Executive Officer\n\nOK. Understood it was R&D. Yes. I think, Paul, it's more the latter.\n\nWe have some things going. I'll let Dave make a few comments on some of the areas that we're looking at. But -- but we'll have Martinez started up here very shortly within a couple of months. We're going to mechanically complete at the end of the year.\n\nSo it's probably a little more latter to the scenario that you played out but the whole area continues to evolve. So Dave, why don't you give a little color on some of the things that we're looking at.\n\nDave Heppner -- Senior Vice President, Strategy and Business Development\n\nYes, Paul. This is Dave. So I think, as Mike stated, while we have Dickinson up and going, and we're bringing Martinez online, both Phase 1 and Phase 3 even with the Neste JV, part of our strategy, and Brian touched on a lot of it from feedstock all the way to product placement is, I won't say replicating the hydrocarbon value chain, but leveraging our core companies are strengths that we've shown in the commercial value we can extract out of participating up and down that value chain. Probably a little bit of a difference from the hydrocarbon to the renewable is we don't want to get over our skis and maybe outside of our core competencies, and we also want to hedge speed to market.\n\nHence, the reason you're seeing our relationships, our JVs will use them, our partnerships with ADM and Neste, for example. So as Mike stated, we're going to continue to evaluate new opportunities. We look at a lot of stuff, but it needs to be capital efficient. The IRA is -- could be some tailwind as you look at this.\n\nBut I still think it's a little early to see how some of those variables all play out and the actual mechanics of the IRA before we can make long-term investment strategies. Thank you.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nThank you.\n\nDave Heppner -- Senior Vice President, Strategy and Business Development\n\nYou're welcome, Paul.\n\nOperator\n\nOur next question comes from Therese Chessie with Barclays. Go ahead, please. Your line is open.\n\nUnknown speaker\n\nHi, thank you for taking my questions. First, I wanted to touch on your comments about demand across your system. Your earlier comments about being down in 2019. Was that specific to your assets? Or were you talking about the DOE numbers in general? And would love to get some color there.\n\nAnd also on the supply outlook on the product side, just given the multiple variables at play, be it Russian products rerouting ahead of the February 5 new ban or incremental Asian exports in China and ex-China potentially coming to water and hitting PADD 5 and would love to hear your views on how all of that percolates.\n\nMike Hennigan -- Chief Executive Officer\n\nTheresa, I'll start off with mine. My comments were related to the DOE data, but I'll let Brian give a little color on our specific data. But just in general, I think it's consistent that we still see a lot of demand recovery, and that's why we're so bullish at this point, and then we'll take the second part of your question in a second.\n\nBrian Partee -- Senior Vice President, Global Clean Products Value Chain\n\nYes, thanks, Theresa, for the question. So yes, just a bit of color maybe on the system. First, to address Mike's comments around our data. Mike did quote on the DOE data.\n\nOur comps back to 2019 aren't super relevant given that we've shut down a couple of different refineries, we sold off for retail units. So we really look at the year-to-year. And I'll give you just a high-level overview for Q3. So year on year, distillate has been steady and strong, very stable across the platform and really flat year on year.\n\nJet continues to perform well, and we're seeing that recover year on year about 6%, but still below 2019 across the platform. And then gasoline is probably the most interesting. We did -- we were off slightly from 2021 in Q3, about 2% and it really correlates to retail prices. So we'll start in the West and about 4% below Q1 and 2021 out West, so 4% decline that we really correlate directly to retail prices and the elasticity impact of higher retails.\n\nMidwest was about 3% and the Gulf Coast was 1%. So overall, about 2%. But kind of going back to Mike's earlier comments, we do remain optimistic as we think about demand. I mentioned October we came out of the chute really strong here for Q4.\n\nWe're continuing to see COVID demand recovery. Jet travel more broadly, the halo around activity and vacations, not just Jet but marine fuel, diesel, gasoline, etc. And we also have moderated retail prices coming off of the summer highs. We're currently around $375 a gallon, well off of our highs in the summer.\n\nAnd demand continues to also be robust in South America and the Caribbean. The economies there are geared a little bit differently. We've got strong agricultural demand globally as well as mining activity. There's been some price subsidization that's occurred in South of the border here, that's also helped to prop up demand.\n\nSo -- and then we're seeing pulls into Europe as well, for obvious reasons, primarily around energy security and just having access to the fuel going forward as the winter enthuse here. And the last thing I'd mention is on the supply constraint side. We've taken a lot of capacity offline globally, and we do expect a degree of friction around the Russian exports of production, hard to call the ball on how impactful that might be. Everybody is watching very closely, but we don't expect it to be positive for incremental supply.\n\nWe do expect it to drag just a bit.\n\nUnknown speaker\n\nI'm sorry, the Asian export or potential exports?\n\nBrian Partee -- Senior Vice President, Global Clean Products Value Chain\n\nYes, as it relates to a lot of -- and you enter a rumor coming out of Asia in terms of export quotas, COVID policies, really difficult for us to call. The one data point I can give you, though, Theresa, empirically on that, is we have not seen where we compete. We have not seen a step change in terms of competing with refineries coming out of Asia, specifically to China. Just it's been steady as she goes, status quo here for the last several months.\n\nMike Hennigan -- Chief Executive Officer\n\nTheresa, it's Mike. I would just add that the inventories are obviously low. The market needs additional barrels. We're doing our best to put out as much product as we can.\n\nBrian mentioned the point about we see some price elasticity when prices get too high. So I think at the end of the day, we spend as much time on what we control, and that's to run as hard as we can, put as much product into the market as we can. And whether Asia -- exports come or don't come, the market needs to supply. So I think that's why, at the end of the day, we still see this to be a pretty bullish outlook.\n\nIt's just -- it's evolved over a couple of years. We think demand is going to continue to come back. Brian just gave you some specifics on our areas. I had mentioned the DOE stuff.\n\nSo we believe that demand will continue to recover and then whether supply comes from China or from the U.S. market itself is the market just needs it. It's a supply constrained recovering demand outlook that makes us have this bullish look.\n\nOperator\n\nOur last question today will come from Matthew Blair with TPH. Go ahead, please. Your line is open.\n\nMatt Blair\n\nHey, good morning. And Mike, congrats on your good health news from last month, it's great to hear. \n\nMike Hennigan -- Chief Executive Officer\n\nThank you, Matt.\n\nMatt Blair\n\nI had a question on the -- I had a question on the STAR project, which you mentioned will be complete in early 2023. I think at one point, you were hoping for about $525 million of EBITDA from the project. Has that number moved up with your expectations of a higher mid-cycle environment? And if so, could you give us a range on what that might look like? And then in terms of just how it will flow through the financials, I believe it will add 40,000 barrels a day of new refining capacity, so we should expect a volume kick but then also a margin improvement, right, from the ability to handle residuals better. And I think there might be some octane benefits too.\n\nSo if you could walk through that, that would be great.\n\nTim Aydt -- Executive Vice President, Refining\n\nHey, Matt. This is Tim. I'll take the first part of that question. So the remaining scope that we have will indeed increase the heavy crude capacity by about 40,000 barrels a day.\n\nIt will also improve the resid upgrading by about 17,000 a day. We do still feel really good about the economic drivers of the project. I mean, obviously, you've got the current widening heavy crude differentials and you've got strong distillate cracks that have really kind of improved the project value over our original look. We also made some logistics investments that are being heavily utilized and those further improved product margins in some of these niche markets, be it domestic or foreign and then as I said in the prepared remarks, so the remaining work is going to be tied in during the turnaround in the first quarter of next year.\n\nSo that's kind of where we're at on the STAR project. So kind of back over to Mike.\n\nMike Hennigan -- Chief Executive Officer\n\nMatt, you can just -- whatever numbers you want to put on, you had it right from the beginning. It's 40,000 barrels a day of additional crude times whatever number you want to put on that and 17,000 barrels a day of heavy upgrading. So whatever your outlook is, that's the math that will give you the additional EBITDA once we start this up.\n\nMatt Blair\n\nGood stuff. Thanks. I'll leave it there.\n\nMike Hennigan -- Chief Executive Officer\n\nYou're welcome.\n\nKristina Kazarian -- Managing Director\n\nSounds great there. And then on that operator, I think we are done for today. So thank you, everyone, for your interest in Marathon Petroleum. Should you have any additional questions or would like clarification on topics discussed today, please reach out and our IR team will be available to help you with your questions.\n\nThank you, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKristina Kazarian -- Managing Director\n\nMike Hennigan -- Chief Executive Officer\n\nMaryann Mannen -- Chief Financial Officer\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nRick Hessling -- Senior Vice President, Global Feedstocks\n\nBrian Partee -- Senior Vice President, Global Clean Products Value Chain\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nSam Margolin -- Wolfe Research -- Analyst\n\nPaul Cheng -- Scotiabank -- Analyst\n\nDave Heppner -- Senior Vice President, Strategy and Business Development\n\nUnknown speaker\n\nMatt Blair\n\nTim Aydt -- Executive Vice President, Refining\n\nMore MPC analysis\n\nAll earnings call transcripts"
}