{
  "companyName": "KVH Industries",
  "companyTicker": "KVHI",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/kvh-industries-kvhi-q2-2022-earnings-call-transcri/",
  "content": "KVH Industries (KVHI 3.55%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nMy name is Lisa, and I will be your conference operator today. At this time, I would like to welcome everyone to the KVH Industries report second quarter 2022 results conference call. [Operator instructions] I would now like to turn the call over to Mr. Roger Kuebel.\n\nPlease go ahead, sir.\n\nRoger Kuebel -- Chief Financial Officer\n\nThank you, Lisa. Good afternoon, everyone, and thank you for joining us today for KVH Industries' second quarter results, which are included in the earnings release we published within the past hour. Joining me on the call are the company's chief executive officer, Brent Bruun; and chief technology officer, Bob Balog. Before we dive in, a couple of quick announcements.\n\nFirst, if you would like a copy of the earnings release, it is available on our website at www.kvh.com on the Investors page, which can be found by clicking on about KVH, then investors, and then scroll down to the recent news section. This is also available from our Investor Relations team. If you would like to listen to a recording of today's call, it will be available on our website. If you are listening via the web, feel free to submit questions to ir@kvh.com.\n\nFinally, this conference call will contain certain forward-looking statements that are subject to numerous risks, assumptions, and uncertainties that may cause our actual results to differ materially from those expressed in these statements. We encourage you to review the cautionary statements made in our earnings release and in our SEC filings, specifically those under the heading Risk Factors in our 2021 Form 10-K, which was filed with the SEC on March 11. The company's SEC filings are also available on the company's website in the Investors section under Financial Information then under SEC filings. We undertake no obligation to update or revise any forward-looking statements.\n\nWe will also discuss certain non-GAAP financial measures and you'll find definitions of these measures in our earnings release as well as reconciliations of these non-GAAP measures to comparable GAAP measures. Now to walk you through the highlights of our second quarter as well as an important recent development. I'll turn the call over to Brent.\n\nBrent Bruun -- Chief Executive Officer\n\nThank you, Roger, and good evening, everyone. I'm pleased to share positive results regarding our second quarter and plans for the future. Q2 is a transition period for us, the first full quarter since our restructuring in March. We finalized our leadership and operational reorganization, recorded the remaining material expenses from the restructuring, and launched a wide array of new initiatives that reflect our commitment to the future by strengthening our core business through subscriber growth and innovative new products, improving efficiencies for our employees and generating increased value for our shareholders.\n\nWe've made significant progress in many areas. We have a stable and engaged workforce with limited turnover, and we've introduced new connectivity products that offer unique solutions to mariners. Financially, our revenue was $41.8 million, down from $43.4 million in 2Q last year. Supply chain challenges led directly to the year-over-year decline.\n\nWe recorded a loss of $1.4 million for the second quarter. This is a significant improvement over last year when we recorded a loss of $5.7 million. Our adjusted EBITDA was $4.1 million, the highest in five years. Based on these results and progress in our mobile connectivity business, we entered the third quarter with a robust foundation and a sustained and growing company.\n\nEarlier today, we announced the sale of our inertial sensor and tactical navigation business to EMCORE. This is an all-cash deal for $55 million, includes the Tinley Park factory and all inertial navigation intellectual property. In addition, EMCORE has offered employment to all current inertial navigation employees. We are very proud of our innovations and progress after purchasing this business in 1997.\n\nHowever, mobile connectivity has always been our primary business and key driver for revenue and growth. Our commitment and investment in this market is our top priority. Our new technology and expanding demand for mobile connectivity presents the opportunity for growth and scale. We will carefully evaluate the best use of the proceeds from the sale to support that growth.\n\nNow I'd like to share some of the reasons we're so excited about the future of our mobile connectivity business. Core revenue and connectivity was $34.6 million, up from $33.8 million year over year. June was our highest ever month for airtime revenue. And we also continue to benefit from the shutdown of our legacy ArcLight network and the migration of some remaining customers to our HTS network.\n\nNetwork operating expenses were down and our airtime revenue increased to $25.8 million and had an associated outstanding gross margin of 43%. Despite losing some subscribers, our base grew 1% versus 2Q last year. I'd like to offer some additional context regarding our number of subscribers. At the end of Q2 last year, we supported roughly 6,300 airtime subscribers.\n\n1,600 of those subscribers were on our legacy ArcLight network. 4,700 subscribers relied upon our more affordable higher-margin HTS network. While the end of the second quarter this year, we expanded our HTS network subscriber base by roughly 40% due to our successful migration efforts. We ended the second quarter with more than 6,600 HTS network subscribers.\n\nThese numbers are a key metric, and we will continue to report our airtime revenue and subscriber population on a quarterly basis. Elsewhere in our mobile connectivity business, KVH Elite's unlimited streaming service for super yachts remains strong, and we're thriving in the Caribbean, Mediterranean, and Eastern North America. Additionally, AgilePlans continue to be the critical engine for our commercial maritime growth. In early July, we introduced our TracNet family of antennas and the KVH ONE Hybrid Network.\n\nThese remarkable solutions continue our trend of disrupting the maritime market. These new solutions set the standard for integration, convenience, speed, and affordability for commercial and leisure boaters alike. KVH ONE and the TracNet Terminals offer a solution that we believe is unique in the industry. The new hybrid network and product line that offers global VSAT cellular service and shore-based WiFi integrated into a single antenna.\n\nThe hybrid design helps maximize speeds and minimize costs at the dock underway and offshore. Each TracNet Terminal is far more efficient due to our modem and Dome design, consolidating three communication devices into one Dome rather than requiring the purchase, installation, and networking of three separate communication devices is a game changer in the market. TracNet also requires only a single cable for installation and is as much as 50% later than competing terminals. We also rolled out new airtime plans that offer more data per dollar for our customers and higher margins for us.\n\nWe extended the popular high-speed unlimited use airtime model introduced with our TracPhone V30 to all of our new TracNet terminals, including the 37-centimeter, TracNet H30; the 60-centimeter, H60; and one meter, H90. Our new one-meter TracNet H90 offers tremendous efficiency gains reflected in even more affordable airtime plans. First, new TracNet systems shipped in mid-July, and we're about to kick off an aggressive marketing campaign with the start of the commercial and leisure boat trade show season. On the satellite side -- on the satellite TV side of our business, we continue to see strong demand in unit shipments.\n\nHowever, the mix in the second quarter were smaller systems due to supply chain challenges slowing the production for our higher-value TV systems. As a result, we entered the third quarter with a backlog of $3.5 million for our mobile TV products. Our second quarter results demonstrated that we're on the right path. We renewed our strategic focus, taking decisive steps to reset our operations, and are introducing the new innovative communication products that our customers expect from KVH.\n\nWe anticipate that the global supply chain economic environment will continue to be challenging. We continue to address these challenges on a daily basis to minimize impact. We are committed to growth, innovation, and delivering outstanding products and services to our customers and long-term value to our shareholders. With that, I'll turn the call over to Roger for the financial details.\n\nRoger Kuebel -- Chief Financial Officer\n\nThanks, Brent. As Brent mentioned earlier, our second quarter revenue came in at $41.8 million, compared to $43.4 million recorded in the second quarter of 2021. Our consolidated gross profit margin was 37% for the second quarter, as compared with 35% in the second quarter of last year. Revenue from our mobile connectivity segment increased $0.8 million with a gross margin of 41% and up seven percentage points.\n\nRevenue from our inertial navigation segment decreased $2.3 million year over year, with gross margin decreasing 24 percentage points to 16%. Service revenue for the second quarter was $28.3 million, an increase of $2.2 million or 8% from $26.1 million in the second quarter of last year. By segment, service revenue in mobile connectivity increased by $2.2 million or 9%. This increase was primarily due to a $2.7 million increase in mini-VSAT Broadband airtime revenue.\n\nAs Brent noted, airtime revenue grew to approximately $25.8 million or approximately 12% over the second quarter of last year despite a 1% decrease in active subscribers as a result of the shutdown of our legacy network on December 31st, 2021. Total subscribers, which includes those who have temporarily suspended was up 1%. As a reminder, suspended subscribers are typically recreational customers who aren't using their boats during the colder months. While we refer to them as suspended, they all still have access to voice services for which they pay by the minute.\n\nIn addition, Agile customers who suspend also pay a modest monthly fee for the equipment that KVH owns that is on their vessels. Airtime gross margin was 43%, which is up eight percentage points from a year ago. This increase is due to a combination of factors but is primarily driven by the shutdown of the legacy network. Product revenue for the second quarter was $13.6 million, a decrease of $3.7 million or 21% from $17.3 million in the second quarter of the prior year.\n\nBy segment, mobile connectivity decreased by $1.4 million or 18%, primarily due to a decrease in VSAT product sales. This decline was partially due to a large number of units shipped last year to customers migrating from our legacy network to our new HTS network. However, we also saw some softening in demand compared to the very high shipments to new customers that we saw last year. Inertial navigation product revenue decreased approximately $2.3 million or 25%.\n\nThis was driven by $1.1 million drop in FOG sales which was entirely due to supply chain constraints as well as a $1.2 million decline in TACNAV and other products. Operating expenses for the quarter were $17.6 million down $3.5 million from the second quarter of last year. However, both this year and last, we had a significant amount of nonrecurring expenses in the second quarter. Last year, we had a $2.7 million increase in legal costs related to our proxy contest, and this year, a total of $1.1 million related to our reduction in force and the searches for a new CEO and board members.\n\nAs such, even on a recurring basis, this quarter was $1.9 million less than the second quarter of last year. At the operating income level, the changes in revenue, margins, and operating expenses resulted in a loss from operations of $2.3 million which was an improvement of $3.5 million, compared with a $5.8 million loss recorded in the second quarter of 2021. This loss includes the $1.1 million in nonrecurring opex I just mentioned as well as a $1.6 million reserve for inventory. As such, if you adjust for all those recurring items or nonrecurring items, you'll find that we would have had a profitable quarter and that was without any large TACNAV sales.\n\nLooking at our individual segments. Our mobile connectivity segment generated an operating profit of $4.5 million, compared with an operating profit of $0.6 million last year, while our inertial navigation segment had an operating loss of $1.3 million for the quarter, which included the $1.6 million inventory reserve versus an operating profit of $0.6 million last year. Our unallocated loss was $5.6 million, compared to last year's $7.0 million. For the second quarter, our net loss was $1.4 million, compared with a net loss of $5.7 million recorded in the same quarter last year.\n\nOn a non-GAAP basis, which excludes amortization of intangibles, stock-based compensation, another nonrecurring cost, such as unusual nonoperating fees, foreign exchange transaction gains and losses, employee termination costs, the CEO separation-related tax effects, and changes in our valuation allowance and other tax adjustments, after those adjustments, we had net income of $0.8 million, compared with a net loss of $0.8 million last year. EPS for the second quarter with a net loss of $0.08 per share, compared with a net loss of $0.31 per share in the same period last year. Non-GAAP EPS for the second quarter was $0.04 per share, compared to a non-GAAP EPS loss of $0.05 per share last year. Our non-GAAP adjusted EBITDA for the quarter was a positive $4.1 million, compared with a positive $1.5 million in the second quarter of last year.\n\nFor a complete reconciliation of our non-GAAP measures, please refer to the earnings release that was published earlier this morning. Net cash provided by operations was $0.3 million, compared to $0.2 million used in operations in the second quarter of last year. Capital expenditures for the quarter were $3.6 million. Cash proceeds from the sale of the radio business was $2.4 million, and cash provided by financing activities was $84,000, resulting in an ending cash balance of $16 million.\n\nLooking ahead and with our focus on mobile connectivity, we expect mobile connectivity revenue growth between 6% and 9% on a pro forma basis adjusted for the sale of the radio business and adjusted EBITDA for the company to be between $11 million and $15 million, assuming that supply chain issues don't worsen. Even after the sale of the inertial navigation business, we are still expecting a significantly reduced operating loss for the second half of the year and continued progress toward profitability with the upper range of our expectation being a breakeven scenario. This concludes our prepared remarks. I will now turn the call over to the operator to open the line for the Q&A portion of the call.\n\nLisa?\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Ric Prentiss with Raymond James.\n\nRic Prentiss -- Raymond James -- Analyst\n\nGood afternoon, everyone.\n\nRoger Kuebel -- Chief Financial Officer\n\nHi, Ric.\n\nRic Prentiss -- Raymond James -- Analyst\n\nYou guys have been busy.\n\nRoger Kuebel -- Chief Financial Officer\n\nYeah, say that again.\n\nRic Prentiss -- Raymond James -- Analyst\n\nI want to walk through a couple of things. I think I got some at the very end there. If we think about selling the NAV business, it sounds like not much EBITDA effect. If I remember right, previous '22 guidance was for $11 million to $15 million for the total company, and you're still assuming about $11 million to $15 million just the mobile connectivity in corporate.\n\nIs that the right way to think about it?\n\nRoger Kuebel -- Chief Financial Officer\n\nCorrect. Now just recall that for the full year, it does include seven months of inertial navigation in it.\n\nBrent Bruun -- Chief Executive Officer\n\nWe've had some good uptick in the airtime business and this 43% profit margin.\n\nRic Prentiss -- Raymond James -- Analyst\n\nAll right. Is there a way to kind of pull apart and say how much in 2021 actual did the inertial business contribute to adjusted EBITDA? Is there a ballpark frame reference of what that number was?\n\nRoger Kuebel -- Chief Financial Officer\n\nI have to -- yes, if you had another question, let me look for that while if you got something else, and I'll come back to that.\n\nRic Prentiss -- Raymond James -- Analyst\n\nWe've got plenty. The Inertial NAV business is that where the autonomous vehicle segment was as well. So when you say the IP is going over with that, is that whole piece of the business then going over to EMCORE?\n\nBrent Bruun -- Chief Executive Officer\n\nYes. Yes. That's correct.\n\nRic Prentiss -- Raymond James -- Analyst\n\nOK. And what are you expecting the after-tax gain to be on the $55 million sale? Or is there some way to get into what the basis was to understand what your net proceeds would be on the sale.\n\nBrent Bruun -- Chief Executive Officer\n\nI think we need to do a bit of calculation, but we do have a fair amount of credits to roll for it.\n\nRoger Kuebel -- Chief Financial Officer\n\nYes. As far as if you're trying to get at the tax implications, given the net operating loss carryforwards that we have, there's research credits that we have, and there's also foreign tax credits that we have. So we think that at the federal level, we are -- we haven't gone through it. We haven't filed yet, but we think at the federal level, the tax impact is going to be very minimal.\n\nRic Prentiss -- Raymond James -- Analyst\n\nAnd then there will be some state level.\n\nRoger Kuebel -- Chief Financial Officer\n\nIt could be something at the state, but we're not expecting that to be huge either. But to get back to your question, the -- as we look at sort of gross margin for inertial NAV, first half was around $3.7 million. EBITDA if you take out the expenses that other expenses that are directly related, I'm not adding back depreciation, which I don't think was a huge item for inertial NAV, but it's probably in the 3% to 4% range.\n\nRic Prentiss -- Raymond James -- Analyst\n\nOK. That's helpful. The -- when you think about the use of those proceeds, which was until they're pretty significantly, at least closer to 55. You mentioned strategic alternatives as well as possibility of return to shareholders.\n\nWhat are you thinking that might be interesting from a strategic alternative standpoint because you've got, I think, you said $16 million cash on the balance sheet, maybe you're bringing $50 million plus. So you're going to have closer to almost $70 million of cash on the balance sheet, which is maybe $3.50 a share. But how should we think about what you might want to be looking at to use that cash for?\n\nBrent Bruun -- Chief Executive Officer\n\nYes. Right now, we're going through an assessment with our board of directors and advisors and we're determining what we think will be the best path forward, we're not in a position to provide more details at this time.\n\nRic Prentiss -- Raymond James -- Analyst\n\nOK. Understand. Is that something you think that you'll be able to lay out? Is that a one-quarter process? Is that a one-year process? I mean how should we think about timeframe to starts when you guys will figure out what you want to do with it versus when you're able to communicate to the Street, what you'd like to be able to do with it?\n\nBrent Bruun -- Chief Executive Officer\n\nI would think that -- I don't know if it's a one-quarter process, but it will be less than a year. That's for sure. So probably more toward the fourth quarter.\n\nRic Prentiss -- Raymond James -- Analyst\n\nGreat. I'll come back and buy some more questions. I'll give the floor now.\n\nBrent Bruun -- Chief Executive Officer\n\nOK.\n\nOperator\n\nYour next question comes from the line of Ryan Koontz with Needham and Company.\n\nRyan Koontz -- Needham and Company -- Analyst\n\nExtra questions on the navigation business sale, how should we think about the impact on opex there, Roger?\n\nRoger Kuebel -- Chief Financial Officer\n\nI think that inertial navigation from a back office standpoint is sort of not as complicated as the mobile connectivity business. There are a number of people who are transitioning over with the sale. They are primarily on the sales and the R&D side, there is someone from finance and someone in marketing that's going over. But the majority of the folks are here who are staying, who are in the sort of the G&A function for the majority.\n\nAnd so I think that's something that I don't have any guidance that I can sort of provide you specifically on that. But I think Brent's comment -- or my comments around what our EBITDA targets are. We're confident that we're still going to have a good year.\n\nRyan Koontz -- Needham and Company -- Analyst\n\nOK. Great. And on the -- kind of how should we think about the subscriber trends you talked about 6% to 9% growth on airtime revenue. Is that mostly -- are there any geographic kind of areas you're looking at growth there or different kind of strategic initiatives as you double down in this area that you can expand your reach?\n\nBrent Bruun -- Chief Executive Officer\n\nAs far as growth, we're pretty evenly distributed from the commercial maritime perspective between the EMEA, Americas, and Asia Pacific region, probably a little bit more heavily loaded in Asia Pac. And then we also have a pretty robust leisure marine business. We're seeing good uptick in ARPUs with the HTS network. And hence, why we saw the year-over-year revenue growth without the true subscriber growth.\n\nBut now that we're -- we anticipate seeing more of a sync up between subscriber growth and airtime growth now that we're -- we have all of our subscribers on One network.\n\nOperator\n\nYour next question comes from the line of Caleb Henry with Quilty Analytics.\n\nCaleb Henry -- Quilty Analytics -- Analyst\n\nHey, guys. Two questions from me. First, the supply chain has come up on. I think the past few calls.\n\nWondering if there are any steps that are being taken or perhaps could be taken to kind of get a handle on or control those costs? I realize it's probably out of your control, but is there anything that you guys are trying to do to kind of tame those costs or issues?\n\nRoger Kuebel -- Chief Financial Officer\n\nWell, we do a variety of things. I mean, we -- one of the things we do is we obviously -- we look at redesigning around some of these things. So to the extent that products become unavailable. We look at what our alternatives are for -- particularly, and this is kind of chip related.\n\nThere are certain chips that become unavailable. But there are other chips that will work, but we have to sort of redesign -- we build the software to make that work. So we look at those things. We're kind of doing probably a lot of things.\n\nThe same thing a lot of people are doing. We're looking at alternate sources of supply, but it's still -- it's just tough and I think you're probably hearing this from a lot of companies. We're in a similar boat. And also, we're not a huge buyer from a lot of these suppliers.\n\nSo that makes it -- it makes it tough to sort of when things are tight in these kind of situations, getting any kind of preferential treatment is tough when you're not a Fortune 500 or Fortune 50 company.\n\nCaleb Henry -- Quilty Analytics -- Analyst\n\nYes. I understand. And then just a question on the future of your satellite network. You mentioned subscribers moving over to the HTS network.\n\nAre there plans to add additional capacity to that anytime in the near term or any other just additional infrastructure. And then especially given the rollouts of NGSO constellations in LEO and MEO, how are you thinking about having multi-orbit capacity as part of your network?\n\nBrent Bruun -- Chief Executive Officer\n\nWell, first and foremost, we add capacity on a regular basis as it's required. So that's something that we have a very good footprint and robust footprint. And we just go deeper as we need it as far as number of subscribers anticipate in any particular area. As demonstrated through the launch of our HTS network.\n\nWe're somewhat network agnostic to a degree, although it takes some effort to change networks that we've gone from our legacy network ViaSat ArcLight, and now we're operating our HTS network. And we're having good success there. We're keeping our eyes wide open with regard to NGSO. We haven't -- haven't made any definitive plans to what our next move is, but we're assessing what different opportunities are in the market.\n\nAnd as we go forward into the future, we'll be sure to be on the forefront of any changes that -- in the market in order to make -- in order to remain competitive.\n\nCaleb Henry -- Quilty Analytics -- Analyst\n\nOK. And then just one more question actually, if I can add on. There's been a fair deal of consolidation and rumor consolidation among the big satellite operators, there's ViaSat and Inmarsat, Eutelsat, OneWeb, and possibly Intelsat and SES. What, if any, impact does this consolidation have? Or what does it mean for KVH?\n\nBrent Bruun -- Chief Executive Officer\n\nRight now, we're paying attention to everything that's going on in the market, as demonstrated with our most recent results, but we're remaining very competitive. But we need to -- we need to figure out what the best path forward is and how to maximize shareholder value. So right now, we feel that some of the moves we made in particular of divesting the inertial navigation business and looking for strategic alternatives on a go-forward basis, which, as I said to Ric, we can't go into a lot of details on is we're going through an assessment process, I don't know what the future holds.\n\nCaleb Henry -- Quilty Analytics -- Analyst\n\nOK. Those are my questions. Thank you very much.\n\nRoger Kuebel -- Chief Financial Officer\n\nOK.\n\nOperator\n\nYour next question comes from the line of Ric Prentiss with Raymond James.\n\nRic Prentiss -- Raymond James -- Analyst\n\nHey. Fairly come back with a couple of extras. I think, Roger, you mentioned mobile connectivity revenue growth, 6% to 9% pro forma for adjusting for the radio sale. Was that about $0.6 million in revenue a quarter, then we should kind of take out for 1Q? And I think the sale was -- was that the very big --\n\nRoger Kuebel -- Chief Financial Officer\n\nRadio, yes. Radio was about $2.3 million a year in revenue.\n\nBrent Bruun -- Chief Executive Officer\n\nYes. So I didn't hear his number. Yes, but roughly $600,000 a quarter, that's what you said.\n\nRic Prentiss -- Raymond James -- Analyst\n\nYep. OK. Good. And then I appreciate the metrics on subscribers sounds like you're going to continue to report that.\n\nNo good deed goes unpunished. Are you going to be able to help us understand how many of those subscribers are agile customers so we can kind of monitor what's going on in that front?\n\nBrent Bruun -- Chief Executive Officer\n\nI don't have the number readily available but --\n\nRoger Kuebel -- Chief Financial Officer\n\nAs a percentage, I mean agile as a percentage is of total subscribers at the end of Q2 was a bit over 50%.\n\nRic Prentiss -- Raymond James -- Analyst\n\nOK. And last year, that's similar kind of percent number?\n\nRoger Kuebel -- Chief Financial Officer\n\nAs of a year ago, it was less than 50%.\n\nRic Prentiss -- Raymond James -- Analyst\n\nOK. And following on the previous question, how should we think about R&D spending? Because obviously, the inert side had a lot of R&D, but there's some obviously that needs to continue probably on mobile connectivity as you develop the new products and new services. How should we think about that kind of correct run rate that you want to spend, whether it's a dollar value or a revenue or a percent of revenue value in the remaining business.\n\nRoger Kuebel -- Chief Financial Officer\n\nWell, I think we want to look at what are the projects that are going to create value for shareholders. And I think as we look forward, one of the questions that came up was an NGSO strategy, and that's something we've got to think about and what's the right way. So in terms of what we -- how big the R&D is going to be, what we need to do is something we need to sort of understand what the future -- what we think --\n\nBrent Bruun -- Chief Executive Officer\n\nFunded future holds. But as far as a run rate perspective, the R&D that we report and we break that out separately. And that was part of our restructuring that we pulled it down a bit. We wouldn't anticipate pulling it down further.\n\nWe want to anticipate keeping that in place. But with inertial navigation, we do have a bit of our engineering team, which went with that business. And we report mobile connectivity, individually, you'll see an R&D number. I don't know if we have that readily available.\n\nAnd this is all happening so fast, splitting out a certain number of employs.\n\nRic Prentiss -- Raymond James -- Analyst\n\nYeah. That makes sense. And obviously, the deal closed, signed, and closed today. On the question then on MGOs.\n\nWhat services are your customers asking for that you think require low latency, ViaSat call last night, there was a debate on how much low latency services actually needed, do you need a network for it. But what kind of services are you anticipating that needs low latency that your customers might want just so we can kind of keep our ears open?\n\nBrent Bruun -- Chief Executive Officer\n\nYes. I mean really, it's -- you're two-way video chatting, right? And that's really about the biggest thing that I'm hearing, a lot of people are doing teams, for example, or Zoom on board vessels. And the latency does have a bit of an impact on that, but still not that much. What are we talking 700 milliseconds --\n\nBob Balog -- Chief Technology Officer\n\nMuch game changes. So look, the average person would really -- would make that [Inaudible]\n\nBrent Bruun -- Chief Executive Officer\n\nI think a lot of the GSO comes down to cost per bit delivered, right, if we can do it at a cheaper rate and higher speeds, latency aside, it's more of the focus from our perspective.\n\nRic Prentiss -- Raymond James -- Analyst\n\nAnd final one for me. You guys have been in the satellite space a long time. What do you attribute finally the log-jam maybe clearing and getting several mergers, consolidations, combinations together. What do you think is driving that? And how do you see that affecting just the industry at large rather than just KVH?\n\nBrent Bruun -- Chief Executive Officer\n\nThat's a good question. I can almost -- you study the industry pretty closely yourself, Ric. So what do you think the answer is?\n\nRic Prentiss -- Raymond James -- Analyst\n\nWe'll take that one offline. But I think clearly, it depends which transaction you look at. Some people have cash cow. Some people need cash.\n\nSome people are trying to figure out how to pivot the business to get to growth. And some people, like we see with kind of the pay TV business, it's a declining business, how do you manage that? How do you take out costs? And how do you get positioned for growth is probably a lot of what people are trying to figure out.\n\nBrent Bruun -- Chief Executive Officer\n\nYes. I mean if you look at the Pay TV business, you look at the traditional FSS operators and their media businesses has come down quite a bit. SES just reported a 7% decline in your media business and a 2% increase in your network business, which obviously, that means a contraction in revenue. And I think that might be something that's pushing them if they have a decrease in revenue on a year-over-year basis, they might need to create some more synergies, and maybe that's what's stimulating some of the merger talks between that.\n\nRic Prentiss -- Raymond James -- Analyst\n\nGood to see it finally. Good to see the log-jam finally happening where people realize that it's a high-cost business but to make sure how to earn their returns.\n\nBrent Bruun -- Chief Executive Officer\n\nRight.\n\nOperator\n\nAnd at this time, there are no further questions.\n\nBrent Bruun -- Chief Executive Officer\n\nOK. Thank you, operator. Thank you, all. Have a good evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRoger Kuebel -- Chief Financial Officer\n\nBrent Bruun -- Chief Executive Officer\n\nRic Prentiss -- Raymond James -- Analyst\n\nRyan Koontz -- Needham and Company -- Analyst\n\nCaleb Henry -- Quilty Analytics -- Analyst\n\nBob Balog -- Chief Technology Officer\n\nMore KVHI analysis\n\nAll earnings call transcripts"
}