{
  "companyName": "Freshpet",
  "companyTicker": "FRPT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/freshpet-frpt-q3-2022-earnings-call-transcript/",
  "content": "Freshpet (FRPT 1.27%)\nQ3 2022 Earnings Call\nNov 01, 2022, 4:30 p.m. ET\n\nOperator\n\nLadies and gentlemen, greetings, and welcome to the Freshpet Inc. third quarter 2022 earnings call. [Operator instructions] As a reminder, this conference is being recorded. It is now my pleasure to introduce you your host, Jeff Sonnek from ICR.\n\nPlease go ahead.\n\nJeff Sonnek -- Investor Relations\n\nThank you. Good afternoon, and welcome to Freshpet's Cuts third quarter 2022 earnings call and webcast. On today's call are Billy Cyr, chief executive officer, and Dick Kassar, interim chief financial officer. Scott Morris, chief operating officer, will also be available for Q&A.\n\nBefore we begin, please remember that during the course of this call, management may make forward-looking statements within the meaning of the federal securities laws. These statements are based on management's current expectations and beliefs and involve risks and uncertainties that could cause actual results to differ materially from those described in these forward-looking statements. Please refer to the company's annual report on Form 10-K filed with the SEC and the company's press release issued today for a detailed discussion of the risks that could cause actual results to differ materially from those expressed or implied in any forward-looking statements made today. Please note that on today's call, management will refer to non-GAAP financial measures such as EBITDA and adjusted EBITDA, among others.\n\nWhile the company believes these non-GAAP financial measures provide useful information for investors, the presentation of this information is not intended to be considered in isolation or as a substitute for the financial information presented in accordance with GAAP. Please refer to today's press release for how management defines such non-GAAP measures. A reconciliation of non-GAAP financial measures to the most comparable measures prepared in accordance with GAAP and limitations associated with such non-GAAP measures. Finally, as previously disclosed, during the second quarter call, beginning with this third quarter of 2022, the company is no longer adding back net start-up and launch expenses in this definition of adjusted EBITDA.\n\nThe company has provided those costs in the table at the end of its press release to assist in our analysis of the results under both methodologies. Additionally, the company has produced a presentation that contains many of the key metrics that will be discussed on this call. That presentation can be found on the company's investor website. Management's commentary will not specifically walk through the presentation on the call, rather is a summary of the results and guidance they will discuss today.\n\nAdditionally, we'd ask that your questions remain focused on the performance of the business and the results in the quarter. Management will not discuss or speculate on other topics beyond what is being reported here today. With that, I would like to turn the call over to Billy Cyr, chief executive officer. Billy?\n\nBilly Cyr -- Chief Executive Officer\n\nThank you, Jeff, and good afternoon, everyone. The message I would like you to take away from today's call is that we had a solid, on-plan quarter and that we are taking concrete steps to deliver on the enormous potential of Freshpet by addressing the most critical issues we outlined in our September organization change announcements. Those actions include: one, continuing to drive the strong and consistent top line growth that Freshpet has demonstrated for the past six years. We delivered 41% growth in the latest quarter and are on track for our sixth consecutive year of accelerating growth.\n\nWe are also well ahead of the pace needed to achieve our 2025 net sales goal of $1.25 billion. Second, executing on our operational improvement plan to drive margin expansion, in particular, the quality, logistics and commodity cost management issues. I will provide more detail on our actions and progress on those in a few minutes. Third, aligning long-term growth with prudent capital expenditures.\n\nOur goal is to build a very large and comfortable cash buffer in order to optimize our liquidity and financial flexibility. We've made good progress on this so far, and we are fully confident that we have adequate resources to meet our growth goals with the cash we have on hand, available credit and the cash flow from operations. I will touch on that in more detail in a few minutes as well, but the headline is that we are now projecting that our capex spending over the two-year period of 2022, 2023 will be reduced by $100 million versus our last projection with no change to our near-term growth or our 2025 net sales targets. Additionally, I want to highlight that we are rapidly building the organizational capability needed to deliver the results we need.\n\nToday, we announced two important additions to our team. First, Todd Cunfer will be joining Freshpet on December 1 as our new CFO. Todd is a proven public company CFO with experience in a high-growth food business. He has been the CFO of Simply Good Foods for the past five years and delivered exceptional performance there.\n\nPrior to that, he worked in a wide variety of finance roles at Hershey for more than 20 years. We are thrilled to welcome him to our team. We are also welcoming Dirk Martin to our team as VP of customer service and logistics. Dirk is coming to us from Lamb Weston where he managed a large network of third-party distribution centers and a complex supply network of both brokered and direct freight in the U.S.\n\nand abroad. In total, he has spent more than 20 years in supply chain, inventory management and logistics roles in a variety of industries and brings much needed expertise to our team. Dirk will begin a Freshpet this coming Monday. Now, let me turn to the results for the quarter.\n\nI will start with a few key highlights of our strong top line performance. As I said, our net sales growth was 41% in the quarter. This was driven by 37% growth in Nielsen-measured consumption and approximately 4% growth from our efforts to replenish trade inventory. We built market share in all classes of trade and are now the #4 brand of dog food in the Nielsen mega channel and closing in on No.\n\n3 and No. 2. We are also the No. 1 brand of dog food in grocery despite having only 70% ACV distribution in that channel.\n\nFreshpet velocity, i.e., dollars per point of distribution in grocery, is now 50% greater than the second highest velocity dog food brand. That makes Freshpet an incredibly valuable brand to retailers. According to scanner data, unit growth in the quarter was approximately 18%, and with the remaining 19 points of consumption growth coming from price increases. Price sensitivity has stabilized behind the large price increase in February at levels that are considered very attractive in the world of packaged goods.\n\nWe've just begun to see the third much smaller 2.6% September price increase show up at retail, but have not seen any indications of significant price sensitivity behind that increase and don't expect to see much. As anticipated, household penetration continued to grow now that we are back in stock and media is on the air. In the most recent 52-week period of Nielsen household panel data, Freshpet household penetration was up 14% and buying rate was up 19%. It will take some time for the rolling 52-week measure to reflect our improved growth rates, but we are well on our way.\n\nIt is also interesting to note that the rate of growth among heavy and super heavy users is even stronger, suggesting that we are succeeding at converting more households to using Freshpet as the main meal item. Going forward, we will be transitioning our reporting to data provided by numerator as it provides a larger panel with more in-depth demographic information and provides better coverage of all channels. We will reconcile the old reporting and the new reporting when we make that transition. Now, I'd like to turn to the operational plan to drive margin expansion that we've outlined previously, with particular focus on logistics, commodity cost management and quality.\n\nLet me start with our commodity cost management. As a reminder, this issue has been the result of a mismatch between the timing of when we incur increased input costs as compared to when we can pass on those higher costs to our customers. In 2022, we estimate that lag cost us approximately $19 million. Given the magnitude of this headwind, our entire organization is focused on this and it is an area that we have already taken some action on.\n\nIn the near term, we've gotten closer to our suppliers so that we can better understand the variables driving their costs so we can better anticipate cost increases. Additionally, we put in place a more rigorous system of tracking underlying cost drivers, adjusting the frequency and duration of our supply commitments and are working with our suppliers to find ways to create greater cost certainty that works for them and for us. We are already in discussion with some potential partners about hedging a wider range of our commodity costs and have locked 75% of our natural gas exposure for next year and are looking at other items such as diesel. In total, we have contracted for inputs totaling 25% of our costs already and expect to have significantly more committed prior to the beginning of the year.\n\nThe point is that we are seeing headwinds sooner and using that information to take more timely price increases. As a result, we have now taken a hard look at our anticipated cost for 2023, roughly two months sooner than we have in previous years and have concluded that the basket of input costs will go up in the near term. And in response to that work, we've already announced a 5% price increase to go into effect in early February. That increase is designed to protect our margins and to greatly reduce the impact of any timing mismatch.\n\nOn logistics, as I mentioned previously, we've just announced the hiring of a new VP of Logistics, who has extensive experience with the cold supply chain in the U.S. and abroad during his time with Lamb Weston. His focus will be to help us more efficiently grow into our expanded distribution network and drive out the elevated costs we have absorbed over the past year. Additionally, we are making good progress with the start-up of our second DC, but do not expect to see the benefits of that until sometime in late Q1 of 2023 or early Q2.\n\nIn the area of quality, I don't want to go into too much detail because we view the improvements we make in this area to be highly proprietary in a source of long-term competitive advantage. But I can say, we are already rolling out one new technology we developed over the past three years that we believe can make a sizable impact and have two more under development. Improvements in this area will take time but will also provide a meaningful extension of our formidable long-term competitive moat. In addition, we have very strong candidates under consideration for the new leadership roles in this area.\n\nIn Q3, our quality costs, i.e., disposals and secondary processing costs, both declined versus Q2, the disposals cut in half, and we're off to a good start in Q4. We see this as a big opportunity for both cost improvement and proprietary advantage and are resourcing it as such. The accompanying presentation contains details on these efforts and a few additional efforts we are undertaking to enhance margins. In summary, we have a deep appreciation for the importance of rebuilding credibility with you and our team's ability to execute on our operational plan to drive margin expansion will be a primary proof point.\n\nI want to impress upon you the focus and determination we have. We have made good progress on each of these efforts since we identified them early in Q3. We have lots of work left to do. The path is clear, and we are doing that work.\n\nNow, I'd like to discuss how we are aligning our net sales growth goals with prudent capital spending to grow capacity. Let me start by providing some context. Our primary motivation over the past several years was to build as large of a consumer franchise as possible before competition arrived. We described this as a land grab, and we were determined to get as big as we could, as fast as we could.\n\nAnd while this is no easy task in a normal operating environment, it was made doubly difficult by the pandemic and the related supply chain and labor issues for the past three years. Over the past year, however, that situation has begun to change. While we have continued to increase our scale, the latest competitive entry from a leading competitor and with the support of a very large retailer has made a little progress. We're out selling that competitor 7-8:1 in the stores where both our brand and theirs is distributed.\n\nThis provides another proof point for how significant our competitive advantage is and how much of a head start we have. Executing a Freshpet food program is extremely difficult. We've learned that the hard way at times, but our potential competitors also have to contend with a complex moat that we have created over the past 16 years, which covers the formidable combination of manufacturing know-how, fridge placement and management, fresh food distribution and more. In that context and with the successful completion of the Ennis facility, we are well positioned to balance growth and margins with our increased scale and do so within a prudent financial and investment framework.\n\nAs a result, we are revising our expansion plans and can smooth our capex spend to enhance liquidity and financial flexibility, while achieving our robust growth expectations. We have already shifted a few projects that we believe we won't need until further down the road. We aren't ready to provide the full impact of those decisions yet, but we can say that our expected capex spending this year and in 2023 will be approximately $100 million less than we previously anticipated, with a $3 million capex reduction in 2022 and $70 million next year. As noted, importantly, we remain confident in our 2025 net sales target.\n\nWe have the resources and capacity to achieve that target, and we believe we are well on track to deliver it. For perspective, with Ennis up and running, we will have enough installed capacity to support more than $1 billion in net sales before any of the technology previously mentioned were added investments in capacity. Finally, before I turn it over to Dick to provide more detail on the quarter, I want to comment on the start-up of our Ennis Texas kitchen. We are already producing very high-quality roles on our first line.\n\nWe will be able to ship those roles once we have completed our final validation on the building security and process controls. Our priority there is to produce the widest range of SKUs rather than the maximum volume because that enables us to make full utilization of our Dallas DC. To date, we have qualified 12 SKUs, and we will continue our projected ramp-up, which is on track having already shifted to 24/7 production on the roll line. For context, that is about six months faster than we were able to hit that milestone in kitchens too.\n\nThe number of SKUs we have qualified is similarly ahead of the pace we have delivered on previous start-ups. That is largely due to the extensive planning and training we did in advance of this start-up, including the significant investment we made to train our production team in PA for up to a full year. The second line in Ennis, a bag line, will begin test runs in January, about one to two months later than previously indicated, and we expected to begin shipping product about one to two months after that. This added time is designed to ensure that we have completed the optimization of the rolls line start-up, where we have a greater need for the capacity.\n\nWe have adequate bag capacity in our system to meet the current level of demand, so this delay will not impact our growth. However, it will delay the full utilization of the Dallas DC until later in Q1 or early Q2. Once those two lines are operating, we believe that we will have enough capacity to fully support our growth for 2023, enabling us to provide exceptional service to our customers and consumers and support the aggressive growth plans we are aiming for in 2023. We also believe that at scale, Ennis will be our most efficient plant.\n\nThe Ennis facility has the capability to have higher throughputs with less labor and longer run times as a result of greater automation, some technology improvements and through enhanced sanitary design. Additionally, the on-site chicken processing will offer improvements in quality and cost versus what we experienced in Bethlehem. In summary, we are seeing evidence that the foundation we have laid over the past year is paying dividends and will continue to do so in the coming months and years. We have our largest and most efficient capacity project completed and it will begin shipping product in a week or two.\n\nThat gives us a long runway for growth and margin expansion. We have started up our second DC, which will ultimately shorten the distance our product travels to customers and reduce our freight costs. We've restored retail conditions. And the household penetration growth is on track to support our long-term net sales goals.\n\nWe have proven that Freshpet has the pricing power needed to offset rising costs and still deliver strong growth and will ultimately produce attractive margins. We are executing on a multifaceted operational improvement plan to drive margin expansion over time. We are also taking a more prudent approach to capex and and have reduced expected capex spending substantially. We are tracking the caliber of talent we need to address our challenges and support our growth, and we have strong support from our customers and consumers.\n\nWe are improving the quality of our execution and look forward to demonstrating the cash generation that this business is capable of delivering. That is what we are focused on. Now, let me turn it over to Dick for a more detailed review of our financials, including a discussion of the change in the reporting method. Dick?\n\nDick Kassar -- Interim Chief Financial Officer\n\nThank you, Billy, and good afternoon, everyone. Let me start by outlining the change in our reporting method before I share the results. As we indicated last quarter, we will no longer add back plan or launch expenses in determining our adjusted EBITDA. It is important to note, however, that these changes do not reduce the data that we make available.\n\nOur published financial results always quantified all of the elements of the new adjusted EBITDA definition. We are simply changing the definition of adjusted EBITDA to bring greater focus on our cash generation capability. Since it's the first quarter of good new definitions, I'll try to bridge the measures for you as we go along. In that context, quarter three was a solid on-plan quarter.\n\nNet sales grew 41% and we are now 39% of the year ago for the year-to-date. Under the new definition of adjusted EBITDA, our adjusted EBITDA is $3.5 million since we have not added back the $8 million of planned start-up expenses and $1.5 million of launch expense for a total of $9.5 million that we incurred in the quarter. We incurred a total of just $1.2 million of such costs in the year ago period. We added 374 new stores in the quarter and are on track to add 1,400 stores this year.\n\nWhile it does not impact our launch expense, we also added 408 new upgrades and 382 second, third fridges for the year-to-date. Adjusted gross margin for the quarter was 34.5% under the new method, 530 basis points lower than it would have been under the old reporting method. As you know, in quarter 3, we had significant preproduction expenses in Ennis, Texas, and we will have those again in quarter four as we ramp up production on multiple lines and multiple items. We experienced significant inflation in cost in the quarter and have now taken price increase to cover those costs.\n\nHowever, we did not take the pricing soon enough to deliver the gross margins we should expect in a more stable market. That mismatch cost us approximately $5 million or 340 basis points of adjusted gross margin in quarter 3. As Billy indicated, we have already announced another round of pricing to offset the higher cost we anticipate in 2023. While we anticipate that our chicken prices will be flat to slightly lower next year, other costs, including energy, packaging and grain-based inputs, are expected to go up in the near term.\n\nSo we are proactively taking the pricing now to avoid another significant pricing mismatch. That price increase will average about 5% and will go into effect with orders on February 6, 2023. We continue to drive G&A leverage in the third quarter, generating 220 basis points of adjusted SG&A leverage, excluding media and logistics. This is consistent with our long-term trend in our 2025 goals.\n\nOur logistics costs in the quarter continued at an elevated level as we've been both starting up a second warehouse where we incur significant costs to move product between warehouses and have been unwinding some of the warehouse congestion created by the product quality issues we had in quarter two. That situation is now improving quite a bit. Freight rates have dropped and our fill rates are now running in the mid- to high 80s. So we expect to begin seeing improvement in logistics scores going forward, beginning immediately in the fourth quarter.\n\nHowever, until Ennis is producing the full range of both bag and roll SKUs, we will incur above average freight costs until we can fully utilize the new Dallas distribution center, which is like to occur in quarter one or early quarter two of 2023. We invested $73 million in capital in the quarter and expecting to spend a combined total of $520 million over full years 2022 and '23. And year-to-date, we have spent $168 million of that total. The performance of our ERP system continues to improve, and that has resulted in a reduction in working capital.\n\nWhile inventory levels are still higher than we would ultimately like them, our receivables improved by $14 million or approximately 10 days of sale. Operating Cash flow used in the first three quarters was $54 million. We did not draw on our borrowing facility in the quarter. Looking forward, we continue to believe we are on track to meet or exceed our net sales guidance for the year.\n\nOur net sales were up 39% year-to-date through quarter three. We have a much tougher compare in quarter four than we had in quarter three. But overall, we feel very good about where we are in net sales. Similarly, we are reaffirming our previous underlying guidance, but adjusting the guidance to reflect our new accounting method for determining adjusted EBITDA, which now includes the impact of $29 million of start-up planned expenses and $4 million of launch expenses.\n\nSubtracting this $33 million of expense from the $48 million underlying guide, you arrive at our new adjusted EBITDA guidance, which reflects the new reporting method of greater than $15 million. In closing, we remain very optimistic about Freshpet's future. We have strong demand, significant new capacity in state-of-the-art facility focus on improving logistics, quality and commodity cost management and strong retailer support. We appreciate the support we have received from our investors and look forward to creating significant shareholder value in the years ahead.\n\nThat concludes our overview. We will now be glad to take your questions. As a reminder, please focus your questions on the quarter and the company's operation. Operator?\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Bill Chappell from Truist Securities. Please go ahead.\n\nBill Chappell -- Truist Securities\n\nThanks. Good afternoon. Sorry, I'm going to go off obviously what Dick asked, but just a simple one of exciting on the new hires and certainly seems like solid adds. But how do the conversations go when you're attracting management when there is an active shareholder involved and kind of strategic alternatives thrown out there? I mean, how do you give them comfort and attract additional talent from here?\n\nBilly Cyr -- Chief Executive Officer\n\nBill, I provided an overall comment, but I would prefer not to talk about any of the issues related to activist investors. What I would say is that we're very happy with the quality of the talent we're getting, and they would be a very good indicator of our ability to continue to attract very high-quality talent. So I think the proof is in the talent that we've attracted.\n\nBill Chappell -- Truist Securities\n\nOK. I'll leave it at that. The second, just a follow-up. On the price increase next year, I mean, I guess what we've been hearing is retailers have been, I guess, reluctant but OK with most pricing taken in '22, but there's been more and more pushback about pricing in '23.\n\nSo have you seen any of that? Or is there -- has this been harder to get through than prior ones? Any color there would be great.\n\nBilly Cyr -- Chief Executive Officer\n\nScott, you want to take that?\n\nScott Morris -- Chief Operating Officer\n\nYeah. Bill, so I think we've been very open with all the retailers as we've done all the pricing over time. We've explained to them our strategy and how we're trying to make sure that we're making a handful of SKUs is accessible and approachable to as many consumers as possible and that we want to continue to drive the growth that they're looking for. And I think they realize and recognize that we have been very constrained and putting pricing through.\n\nAnd I think when we came in with this one and explained exactly where it is, they were incredibly receptive put honestly. And I think part of it is they've seen consistent improvement in the business and the velocity growth over the year and the fill rate over the year. And I think they're also looking at what we've done in pricing and what the rest of the category has been on pricing. And we have been slightly behind what the majority of the category has done.\n\nSo I think that they feel was justified. We've had conversations with a majority or many of the top retailers and I think they've been, again, very receptive to the conversation. And we don't anticipate it being a challenge.\n\nBill Chappell -- Truist Securities\n\nGreat. Thanks for the color.\n\nBilly Cyr -- Chief Executive Officer\n\nThanks, Bill.\n\nOperator\n\nOur next question comes from the line of Anoori Naughton from J.P. Morgan. Please go ahead.\n\nAnoori Naughton -- J.P. Morgan -- Analyst\n\nHi. Good afternoon. Could you perhaps parse out for us the composition of the $100 million reduction in the capex outlook? And which projects have you delayed? And how much of the $100 million now falls into 2025 versus how much reflects capital projects and savings that you found from things like lower construction cost?\n\nBilly Cyr -- Chief Executive Officer\n\nAnoori, we're going to come out with a more detailed look at this when we -- our current plan is, as soon as we get Todd on board and get his feet on the ground, we'll kind of restate what the long-term targets look like in light of all the inflation and the change or the impact that has had. But what I can tell you is that we took $30 million out of this year. So the $320 million previous outlook would be more like $290 million and we took $70 million out of next year. Some amount of that would push back into the later years.\n\nBut because we're relooking at all the different projects, I wouldn't cast anything in stone in the out years because we're still doing a fair amount of work on what is exactly the right amount of capacity. And we also are working on some new technologies that might have some potential to alter what capacity we actually put in. So I would take the bank to bank the numbers for the next two years, meaning 2022 and 2023, and we'll come back to you probably in early January with the plans for years beyond that.\n\nAnoori Naughton -- J.P. Morgan -- Analyst\n\nOK. Great. And then, for my follow-up, could you update us on what the expected time line is to get to full production at Ennis? And where do you stand today with staffing and equipment for lines two and three?\n\nBilly Cyr -- Chief Executive Officer\n\nYeah. So we're fully -- line one, as we said in the call, is running 24/7 at this point. We have the staffing already for line two for a 24/7 operation that's all been fully qualified and trained. And that line is expected, as we said in the call, to begin running product in January, and we'll be shipping that product within one to two months after that.\n\nAnd all that equipment is installed, plus or minus a little piece here or there. The third line, all the equipment exists, meaning it's all in Texas, but it has not yet been installed. And we have not hired the staffing for that yet because we really need to see how the volume unfolds. But knowing we have the equipment, the installation time is obviously a lot less than construction time is.\n\nAnd because we already have staffing on the ground there for two lines to 24/7 operation, it's relatively easy for us to do the staff up because what you do is you spread some of the talent you already have around and you hire the new people on to put some of them on your existing lines. So we feel very comfortable. We don't have a specific date for that start-up of that line, but I think of it as being sometime toward the middle part of the year.\n\nAnoori Naughton -- J.P. Morgan -- Analyst\n\nVery helpful. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Mark Astrachan from Stifel. Please go ahead.\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nYeah, Thanks and afternoon, everyone. I guess, just a few questions from my standpoint. First, on the pricing. Regardless of -- or not necessarily commenting on '23 outlook.\n\nBut in terms of what you've seen so far, you commented in the presentation about heavy and super heavy buyers continuing to increase. Do you see any impact on the recruitment of new households or consumers from the pricing actions? Do you think that what you've done in terms of limiting the lower-priced items has helped trial or has not hurt trial, maybe is a better way to put it, then I've got a follow-up, please.\n\nBilly Cyr -- Chief Executive Officer\n\nScott, do you want to take that?\n\nScott Morris -- Chief Operating Officer\n\nMark. Yeah, so we track it incredibly closely. Literally, like every couple of weeks, we're really dissecting it. Where we have seen a modest, modest impact is in, I would say, on the lower income groups at this point.\n\nBut on our kind of average and higher income groups, there's literally been no impact that we've been able to see and kind of growing penetration among those groups. And I think the main reason is because the category has risen so significantly. And again, it's kind of some of the comments I was mentioning when I was addressing Bill's question. But we are -- like if you look at the value of where we are versus where the category is, we've actually been almost a slight advantage to some extent.\n\nAnd we want to continue to -- like continue to represent that and show that as we're doing these price increases and keeping things as affordable as we can. So we really have not seen any significant impact or slowdown. And the other thing is, when we're looking at the components of the business and the build that we have over the course of the next 12 to 18 months, and we look at all those different things stacked up, we feel really confident to be able to continue to drive penetration. And I can elaborate on some of that at some point if you're interested.\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nThat's great. I appreciate that. Just a follow-up question would be just on the new lines and the thoughts on the lines kind of going forward, not commenting specifically on the reductions that you outlined in capex. But maybe just taking a step back, how do you think about the ability and opportunity to improve productivity of the lines that you've put in recently and we'll be putting in kind of over the next 12 months from both the ability to produce greater revenues and to do it at a lower cost?\n\nBilly Cyr -- Chief Executive Officer\n\nYeah. Let me take a shot at that, and Scott might want to add something. But each time we put in new lines; we obviously look for what improvements we make versus the previous lines. The facility in Ennis, the lines have more automation than the lines in Bethlem, the way I would describe it is if you think about the move from kitchens one to kitchens two as sort of a quantum leap forward for us.\n\nThe leap from kitchens two to Ennis is the same magnitude, maybe even a slightly bigger magnitude of leap forward in terms of the automation. And so, we're expecting to be able to have higher throughput per line per hour with less labor than what we have in Bethlehem. And we've documented in ethane that kitchens two operates at a significantly higher gross margin than kitchens one does. So we'd expect to see a similar kind of improvement for Ennis.\n\nAt the same time, though, as you know, we've been -- we hired some people starting back in 2019 that we're working on process improvements for us. And we've got a couple of things that are starting to pan out. We're not ready to declare victory nor disclose what they are other than to say that automation isn't the only driver of efficiency gains for us. There are other possible drivers that we can get that will improve efficiency pretty significantly.\n\nAnd those things are in varying stages of testing and scaling up.\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Brian Holland from Cowen & Company. Please go ahead.\n\nBrian Holland -- Cowen and Company -- Analyst\n\nYeah, thanks. Forgive me if you addressed this, but those start-up costs that you're no longer adding back appear to be in aggregate about $10 million above what was in my model and, I guess, $10 million or so above the first half. Can you just explain what's behind maybe that uptick? Perhaps your comfort that you framed it correctly for 4Q and when we can expect that to roll off?\n\nBilly Cyr -- Chief Executive Officer\n\nDick, do you want to take that?\n\nDick Kassar -- Interim Chief Financial Officer\n\nSure. The increase in plant start-up costs, we had a slight delay in getting Ennis up and running. Early on when we put the plan together, we expected a September start-up, and now it's squeezing toward the next couple of weeks. So a lot of people were hired earlier and they trained in Pennsylvania, and they're all part of plant start-up costs.\n\nSo we -- that expense is now behind us for line one and two. In line three, we stop hiring. We haven't hired line three yet. We still have more plant start-up costs in quarter four because line two will be coming up, as Bill indicated, in some time in the first quarter.\n\nSo -- and at that point in time, two lines were running. The plan is eventually to have 10 lines sitting in Ennis and we'll have planned start-up cost behind each line, and now we're budgeting for it as part of our GAAP reporting.\n\nBrian Holland -- Cowen and Company -- Analyst\n\nAppreciate the color, Dick. And then, forgive me for peaking ahead to next year, but my model assumes you're spending less than $2.5 million on media 4Q. I can appreciate why that might not necessarily have sales in 4Q. But presumably, that would weigh on growth at least in 1Q '23.\n\nIs that fair? And just help us understand to what extent there might be some impact as we roll into next year?\n\nBilly Cyr -- Chief Executive Officer\n\nScott, do you want to take that?\n\nScott Morris -- Chief Operating Officer\n\nYeah. So Brian, historically, we have not been spent anything significant in Q4 from a media standpoint. And we've been able to maintain good momentum, not only through Q4 very often, but also right into Q1. Now, I will tell you, we're going to get started in Q1 pretty aggressively right from the beginning.\n\nThe best time for us to spend media dollars is early on in the year. We get the best return on that and it helps us carry throughout the year. We also have -- I mean, there's a lot of benefits and I think kind of wind, I would say, that's carrying us. We're going to have better fill rates.\n\nWe're going to have great product innovation. We're going to have really strong distribution in addition to the media spend and strong creative and in addition to some things that we're doing that Billy was mentioning on quality. I think that with all of those aspects together, I think that's going to put us in a good spot going into next year.\n\nBrian Holland -- Cowen and Company -- Analyst\n\nGreat. I'll leave it there. Thanks.\n\nBilly Cyr -- Chief Executive Officer\n\nThanks, Brian.\n\nOperator\n\nThank you. Our next question comes from the line of Michael Lavery from Piper Sandler. Please go ahead.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nThank you. Good evening over there. Just curious, as you think about Florida and the hurricane impact there, it sounds like it was obviously quite manageable. But is there any -- you showed the inventory build, the trade inventory -- a little bit of a trade inventory build in the quarter.\n\nWas there much impact from the hurricane, obviously, having some homes without electricity and different in that? And if so, how should we think about 4Q and pacing, your guide implies a little bit of a deceleration? Is that reflected? Or is it more just conservatism? Maybe just help -- help us think about the fourth quarter top line.\n\nBilly Cyr -- Chief Executive Officer\n\nYeah. As bad as Hurricane Ian was, it did not seem to have the magnitude of the impact of the hurricanes of 2017. So there was some impact, but it wasn't as significant as the 2017 pieces. As we look and roll to Q4, as we said in the comments, at the beginning, Q4 just has a tougher comp than Q3 does.\n\nAnd so, that's what we're looking at. There's a -- we had a much stronger start of Q4 last year and a little bit of a catch-up versus the Q3, we had a warehouse issue in the beginning of Q3 last year. And so, Q4 had a little bit of benefit from that. So it's just more of a tougher comp that we're looking at as we head into Q4.\n\nAnd we're also, as you remember, we took a price increase in September. So we just want to see how everything settles through. We have another price increase coming in February. We just wanted to get a good handle on it, but as Dick said, we feel very good about where we sit right now for Q4 and frankly, are very bullish on where we're going to start the year next year\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nOK. That's helpful. And just a follow-up on your slide in the presentation about some of the working capital you've got what looks like ERP driven improvement there. It sounds like you've characterized some of it as needing to catch up to kind of get to a normalized level, but is there more upside in terms of that improving even further? Just trying to understand how to model some of the working capital piece as we think about the balance sheet.\n\nBilly Cyr -- Chief Executive Officer\n\nI'm going to have Dick in a second. Let me -- but let me just say that we think there's still more room on the receivables. And certainly, there's a fairly significant amount of room, we believe, on the inventory side as well. But Dick, do you want to give them the details?\n\nDick Kassar -- Interim Chief Financial Officer\n\nYeah, we're running with $40 million finished goods. So we had -- so that's about 1.5 weeks more than you would prefer more or like four weeks of inventory versus six weeks. We've also brought a lot of ingredients upfront and the recent -- our department did a great job trying to get a little bit ahead of rising costs. So when you look at our ingredients level and our finished goods level together with packaging materials is kind of in a $60 million range.\n\nOur finished goods probably should be about 1.5 weeks less. And as we get Ennis up and running and we have two warehouses and we -- our distribution support each warehouse, our inventory will come down to about four and a half weeks of finished goods. The ingredients is really just dependent on how the market looks and what kind of positions we want to take.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nOK. That's helpful. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Robert Moskow from Credit Suisse. Please go ahead.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nHey, thanks. Do you have any color for us on what to expect for plant start-up expenses next year? And is it fair to say that it's going to be pretty constant for a while, while you're continuing to build out? And then, I had a quick follow-up.\n\nDick Kassar -- Interim Chief Financial Officer\n\nI'll take that, Billy. The plant stock expense this year was related to two lines coming on and also the actual plant being built. So early on, we were looking to be finished earlier in the year, and it's now coming in, as Bill indicated, in the next couple of weeks. We already have the two lines staffed.\n\nThe next line that we haven't hired yet. But we do have to hire 90 days in advance, so we can train people and get them in-house. But the building and all the expenses associated with the building prior to those first two lines coming up have been -- it was a charge. So you're going to pay for all the utilities and everything else associated with the building the security and everything.\n\nAnd as new lines come up, that basis -- that base has been covered by the two lines. And as the third line toward the 10th line comes up, each line will have less of a hit as you allocate it across the number of lines in place.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nOK. Well, maybe I'll follow up on that. The second question was, in the past, you've said that it's been very difficult to get your full selection of products into the fridges and stores and have them be filled on a consistent basis. Where do you think you're at in that journey? I haven't heard about it lately and I want to know -- I heard your fill rates, but I'm not sure about your -- getting that full selection in.\n\nBilly Cyr -- Chief Executive Officer\n\nYeah. Let me take a shot. You'll see in the deck that we attach, there's a chart that shows what our TDPs are, which is not a specific measure of in-stocks, but it's the closest measure you can get from the publicly reported data, and it shows we're at an all-time high. If you break decompose that into the ACV and the average SKUs in distribution, it's like 15 SKUs in distribution on a 60.3% ACV or something like that.\n\nSo it's good, but there are still a couple of holes that are sporadically empty that it's just -- we've got to get the right product produced at the right time and in the right warehouse and there's just a logistical challenge for us that we've got to work our way through. But we're getting better every week, and I would hope that once we get these lines and up and running shipping that problem is invisible. But I would point out that our in-stock position today is better than it's been in years, and our fill rates today are on par or better than most of our leading competitors in the pet food space.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Peter Benedict from Baird. Please go ahead.\n\nPeter Benedict -- Robert W. Baird -- Analyst\n\nAll right, guys, thanks for taking the question. First, just on the efforts to enhance margins. You talked about fixing some costs for next year. Can you give us a sense, Billy, for maybe the visibility you have into kind of improved profitability next year, just simply based on stuff that, I guess, falls off from this year that you've already locked in? That's kind of my first question.\n\nBilly Cyr -- Chief Executive Officer\n\nThink of it this way, Peter. We talked about this year having a $19 million gap at the scale that we have in net sales this year, which is sort of the timing mismatch. We expect to have a very minimal timing mismatch in 2023 because of the pricing actions and the commodity purchasing management that we're doing today. So you can take a significant portion of that away.\n\nYou can also take a look at what happened. We described the issues in logistics, it's costing us $20 million at this year's scale. I'm not going to say that it's all going to go away all-in-one fell swoop. But as Dick said in our comments, our fill rates are consistently getting better.\n\nWe're running in the high 80s, and so we're taking away a significant portion of that inefficiency that we had, and we expect that once we get that second DC up and running, in Dallas with a full line of items produced locally, meaning in Texas that we end up cutting the miles pretty significantly. So there's a big opportunity there. The cost on the quality side, we've got some things that we're rolling out now that we're not ready to describe the benefit of them. But the opportunity pool is of the same size as the opportunity pool was on logistics and the commodity mismatch.\n\nAnd we think we can make a meaningful dent in it probably more toward the back half of the year than versus the first half of the year.\n\nPeter Benedict -- Robert W. Baird -- Analyst\n\nOK. That's helpful. And then, I'm just curious, it looks like still 1,400 locations that are coming on this year. Just curious, your conversations with retail partners how those are going right now? What you think the momentum is as you look into next year? Is adding a similar amount of good assumption? Or what's the view there?\n\nBilly Cyr -- Chief Executive Officer\n\nI think we're going to have a strong back of the year here, and I think we're going to have a very good year next year.\n\nPeter Benedict -- Robert W. Baird -- Analyst\n\nAll right. Fair enough. Thanks, guys.\n\nOperator\n\nThank you. Our next question comes from the line of up from Rupesh Parikh from Oppenheimer. Please go ahead.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGood afternoon, and thanks for taking my question. Just one question. Just on your consumption by channel. So big box pet pretty significantly sequentially.\n\nSo just some more color there in terms of what's happening and then how you guys think about the recovery there or the strong potentially stronger growth going forward in that channel?\n\nScott Morris -- Chief Operating Officer\n\nYeah. So we have never quite smoothed out. There's a couple of factors going on. We have never quite gotten the supply chain as smooth as we would like.\n\nWe went a little longer and had some additional product shorts than we have had in a couple of other channels. But I would say the biggest single factor there has been, I'd say, the channel has been slightly slower from a growth standpoint and a traffic standpoint. And I don't know -- I'm not -- I don't know the exact dynamics, but I don't know if it would as gas rose, people were making fewer trips and we've seen some data around that. And I think it maybe had a disproportionate impact on the pet channel.\n\nWe've seen these things cycle through over time. I think that the work that in, and I think the work that the channel is doing overall, we will see this kind of move through and get to a more normal balance and growth in that channel over time. Now, the important thing for you to take into consideration is today, pet specialty is 14% to 15% of our sales. I have not looked at it in the most recent period, but it's definitely a smaller piece of business but obviously a very important one that we want to continue to develop.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nOK. Great. And then, maybe one additional question. Just given some of the, I guess, concerns in Europe, just any update in terms of what you're seeing in the U.K.\n\nmarket as well?\n\nBilly Cyr -- Chief Executive Officer\n\nYeah. Our business in the U.K., as you know, is very small relative to the U.S. business. It's more in the exploratory phase.\n\nWe are obviously very mindful of the very rapid inflation that exists there. And so, we are taking pricing there and have taken pricing there. We'll also see that. While we don't have a huge cost base there because our product is produced in the U.S., we will have wage inflation for the team that we have there as well that's going to have to keep up with the market.\n\nBut in terms of the consumer dynamics there, so far, they've been holding together pretty well. We haven't seen any significant negative impact on our business trends but recognize we're a relatively small scale there and sort of in the ramp-up phase. So I'm not sure we would necessarily see it the way someone who has to give any more scale would see it.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Ben Bienvenu from Stephens. Please go ahead.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nHey, guys. Good afternoon. Jim Salera on for Ben. I wanted to ask a question on the in-stock rates.\n\nAs you guys get the operations side buttoned up, does that have a noticeable impact on the velocity with your retail partners? And then maybe as like a part two to that question. Do your retail partners have a certain velocity threshold that they want to hit before they'll put in a second or a third fridge?\n\nScott Morris -- Chief Operating Officer\n\nSo I'll answer the -- let me answer the velocity one first. So 10 years ago, we were actually below the average for the category and especially on like a sales per linear foot is a very often metric. We actually literally go down to the inches when we look at our fridge, we are actually typically in the top 20% of the category at this point. We're typically the leader in the category from a velocity standpoint.\n\nSo we've well overcome the velocity hurdle that we had years and years ago because we have consistent store sales growth. So I think that has not really been a challenge. So the other part of your question was like we have not had full fridges for a very long period of time for -- it's been almost three years since we've had really full fridges with every product in there. And we're still kind of into the -- we're in the 80s at this point.\n\nWe should typically be -- we used to be years ago, best-in-class in the high 90s, and that's what we would expect to be going back to over the course of Q1. When we see that -- when we're in stock on all of our items every single day, there will be a factor where that being -- having full fridges, there will be a significant kind of benefit to sales in a real kind of multiplier effect on our efforts across the board. So it's probably -- we need to do -- so I would like to do some additional math before putting a pump out there on that, but we have seen it over time that as we have continue to get better fridge fills, it does help velocity by five points.\n\nBilly Cyr -- Chief Executive Officer\n\nI would just add one point to that, which is that we also have this phenomenon where one of the items that has been most frequently shorter is the one where we had the quality issue in the end of Q2 and that has thus been in the shortest of supply as we've kind of worked our way through all the challenges that come in the wake of that. When that is out of stock, consumers trade down to our roasted deals item. When it gets back in stock, they trade back up. So we may see the same unit purchases, but we see higher dollars per pound or higher total dollars as a result of getting us fully in stock.\n\nSo there's a trade-up phenomenon that happens for us when we are fully in stock.\n\nScott Morris -- Chief Operating Officer\n\nAnd that's not our credit or fresh from the kitchen item Bill's referring to.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nGot it. Maybe if I can ask the second part of the question in a different way. Do your real partners have any key metrics that they look at when you're looking to add a second or a third fridge to a kind of clear before you get the green light for that?\n\nScott Morris -- Chief Operating Officer\n\nYou know what the single biggest one has been over the past 24 months or even longer. It has been -- there's no way when I have half empty fridges that you can ask me to add another fridge. And I think now that we -- they start to see really strong, very consistent progression, which is what we've told them time and time again, what we were going to do as we laid out these plans, I think that there's real confidence and comfort in adding additional fridges. That has been -- that has been the single biggest governor on us adding significant numbers of fridges.\n\nAnd we're now at a point where when you start to hit going from the 50s to the 60s to the 70s and now in the 80s, and they literally are seeing these new lines come up and start to operate. It gives them great confidence to be able to add additional fridges.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nGreat. And if I could just ask one housekeeping question, and I apologize if I missed this somewhere in the slide deck. What was advertising spend in the quarter?\n\nDick Kassar -- Interim Chief Financial Officer\n\nYou can see in the deck, it's imputed in there on the SG&A side.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nOK, $14 million.\n\nDick Kassar -- Interim Chief Financial Officer\n\nYes.\n\nJim Salera -- Stephens Inc. -- Analyst\n\n$14 million, is that?\n\nDick Kassar -- Interim Chief Financial Officer\n\nYes. That's right.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question is from the line of Jon Anderson from William Blair. Please go ahead.\n\nJon Andersen -- William Blair and Company -- Analyst\n\nThanks. Good afternoon, everybody. I wanted to ask -- Billy, you referenced competition in the prepared comments. And I was wondering if you could talk a little bit more broadly about competition.\n\nYou mentioned one new entrants, I think, in the refrigerated space in store. What are you seeing on a direct-to-consumer basis? And as you bring up this kind of the new capacity and, I guess, some of the capability challenges, should we expect kind of a renewed effort in direct-to-consumer from Freshpet?\n\nBilly Cyr -- Chief Executive Officer\n\nScott?\n\nScott Morris -- Chief Operating Officer\n\nYeah, so I'll jump in on that. John. So I think here's the best way for -- there are a lot of folks coming into this space and kind of how you want to define it and look at it. There's been a lot of folks that have entered retail that have frozen cooked items and some people that have come into fresh.\n\nSo if I add all of that together, and I think, John, we've shared a slide once before with you, and I just updated it. If you add all of the competition and all the activity together, it looks like a lot. But we're still 96% of the sales in fresh and frozen cooked foods. So we are -- we're by far like the enormous piece.\n\nAnd we've been maintaining share there. So I think we're really proud of the results there. And look, we know over time that there is a real chance that competition continues to make progress. We think the end state of this category, as we've talked before, is in the many billions of dollars in the $4 billion or $5 billion range, and we know we're not going to be alone in that.\n\nBut our goal is to have as much share as we possibly can of that $4 billion to $5 billion. And I love what Gatorade is done after 30 or 40 years. And I think that would be our target too. So I think that's one of them.\n\nOn the DTC piece, we recognize that there is a really interesting market. There are a group of consumers. Now, it's a small group, but it's an important and high-value group of consumers that really appreciate not only customized but also very convenient meals that are coming to their homes for their dogs. And we are -- we continue to evaluate that and look at ways that we can make our product even more customized and more convenient.\n\nAnd I think we'll continue to update people over time. I don't think we're quite ready to share exactly what we're looking at. But I think we have a solution that utilizes our best assets and capabilities to give a consumer a great proposition.\n\nJon Andersen -- William Blair and Company -- Analyst\n\nOK. And just a follow-up. I think in reference to the 2025 plan in the prepared comments, it was mentioned that you have a lot of confidence in the sales target for 2025. I didn't hear -- I don't think -- I may have missed it, any reaffirmation of kind of an EBITDA margin target? Any thoughts or willingness to update that?\n\nBilly Cyr -- Chief Executive Officer\n\nWell, John, what we were trying to say was we freely recognize that because of all the inflation that we've had in the past year and the impact that it's had on buying rate, potential impacts on household penetration or customer acquisition costs and then also on our margin structure. We didn't really want to address the net sales, EBITDA margin in 2025. We'll come back and do that in January and kind of level set from what we see at that point. But we didn't want people to think that the change in the capex spending we were doing was going to, in any way, impact our ability to get to that number.\n\nAnd so, that's what we are trying to say is we're just trying to make sure people understood that capex changes are not going to impact our ability to get to the $1.25 billion.\n\nJon Andersen -- William Blair and Company -- Analyst\n\nOK. That's helpful. Thanks.\n\nOperator\n\nThank you. Our next question comes from the line of Cody Ross from UBS. Please go ahead.\n\nCody Ross -- UBS -- Analyst\n\nGood evening. Thank you for taking our questions. I just want to focus a little bit on gross margin here. You called out inflation and quality issue as two of the leading headwinds to gross margin in the quarter.\n\nCan you quantify the impact on the quarter? And when do you expect the quality issue to no longer be a headwind?\n\nBilly Cyr -- Chief Executive Officer\n\nDick, do you want to take a shot at that?\n\nDick Kassar -- Interim Chief Financial Officer\n\nSure. Yeah, we've never broken out quality before. But we certainly suffered consequences from a margin standpoint, not only for the quarter, but year-to-date, we did disclose, I think, in the last quarter, $3.5 million for one of our role issues. And we're working on improving the quality.\n\nAs Billy described earlier, we have some some strategies going on, and we feel good about how they're going to impact the latter part of 2023. So I'm not so sure I really want to break that at this point in time.\n\nBilly Cyr -- Chief Executive Officer\n\nYeah. I wouldn't break it out and just to add to what Dick said, we're pretty comfortable that the impacts on quality, which is you're growing at our rate, and we are the pioneers in this space. We will find issues before anybody else will because added scale, things that happen at a smaller chance of happening will show up at some point. Our challenge is to minimize the size of the impact whenever something does show up that we had not properly anticipated.\n\nSo that means make it less time, impact less product results in less disposals. Our roles are very robust. We feel very good about that. The focus is on making the bag products as robust as they can be.\n\nCody Ross -- UBS -- Analyst\n\nAnd then just switching gears a little bit to fill rates here. You mentioned fill rates are in the high 80s right now. What are your biggest challenges today? And when do you anticipate bill rates going back to normal levels? I think I might have heard 1Q '23, is that correct?\n\nBilly Cyr -- Chief Executive Officer\n\nYeah. The biggest impact on the fill rates in the like literally in the immediate moment is just getting caught up on our fresh kitchen product, which is where we had the product quality issue earlier this year. It's taken a while to kind of sort our way through that and get caught up. We are starting to make fairly significant progress on that.\n\nSo I see that closing and may even close by the end of this year. But as we've said all along, rolled capacity has gotten tight, and we needed the Ennis line to come on in order to ensure that we could keep up with the demand on our roll side. So as long as Ennis production goes at the rate at which we're hoping it will go, we should be able to fill any of those holes that we'll have on the roles. And as Scott said earlier, I feel pretty good about our total capacity position as we head into Q1.\n\nI mean, it should get progressively better from where we are now in the mid- to upper 80s. But as our standard -- our markets to be well above 95%, we think we'll be there in Q1.\n\nCody Ross -- UBS -- Analyst\n\nGreat. Thank you for that. I'll pass it along.\n\nOperator\n\nThank you. Our next question comes from the line of Peter Galbo from Bank of America. Please go ahead.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Good evening. Thanks for taking the questions. I'll be pretty quick.\n\nI guess, Billy, I just kind of want to clarify the timeline with Todd and Dirk stepping in, later this year, it seems like maybe you're thinking about reassessing and presenting something to us in January. But I just wasn't sure if with them coming on. Is that really enough time to assess or reassess if plans need to be adjusted? Or is there maybe a more extended timeline once they come in to reevaluate?\n\nBilly Cyr -- Chief Executive Officer\n\nYeah. It's a good question. Our current target is to do it sometime in January, would be a logical place for us to do it, but we aren't going to do it if we're not ready. Having said that, the work has already started and it's well along at this point on all the pieces that we need to put together because the rest of the team has been working on this for some time.\n\nBut we do want to make sure that the new talent has a chance to get in, kick the tires and fully bet it. Dirk starts this coming Monday. So he'll get his arms around the work pretty quickly. One of the things I would point out about these two new hires is, in both cases, they're ready to go on day one.\n\nThis is not a new industry. It's not a role that they haven't played before. They know most of the key players involved in the industry. So they're going to hit the ground running from day one, and we feel very good about it.\n\nTodd starts on December 1. That doesn't mean we won't be feeding them lots of information between now and December 1, so that he is fully up to speed and ready to go on December 1. So I feel like we're giving ourselves room, but we will not come out with something unless they've had a chance to wrap their arms around the sections that they have responsibility for and feel good about what they're communicating because we want them to make the same level of commitments that we make.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nOK. No, that's helpful. And then, Dick, if I could just ask two really quick clarifying questions. I think you mentioned in the prepared remarks that gross margins were roughly $5 million under what you would have thought.\n\nI think that was a price cost comment that maybe would catch up in 4Q. I just wanted to clarify that. And the lower capex spend that you guys are talking about for this year and next year, obviously, some of the projects, but is there any impact just on cooler placements as a result of that lower capex? Or is it solely kind of on production side?\n\nDick Kassar -- Interim Chief Financial Officer\n\nYeah, it's production sites, not on coolers. And in the margin, we said we had a 2.6% price increase effective the first week of September, but by the time it ships. So it will impact the 2.6% will pick up for the whole fourth quarter, which adds about 130 basis points against fourth quarter sales, which is part of it. And we do have some commodities that have moved in our direction.\n\nSo we feel that the margin improvement in the fourth quarter should pick up nicely.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nAm I just -- am I correct in thinking that the $5 million -- that you were like $5 million behind price cost, though, in the third quarter, is that what you had said earlier?\n\nDick Kassar -- Interim Chief Financial Officer\n\nYeah. And if you think about it, the 2.6% impacted it along with some onetime issues in disposals and quality.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks very much.\n\nOperator\n\nThank you. Our next question comes from the line of Connor Rattigan from Consumer Edge Research. Please go ahead.\n\nConnor Rattigan -- Consumer Edge Research -- Analyst\n\nThanks for the question. Just one for me. So I was hoping to touch on the trip consolidation and pack mix issue that popped up last quarter. So from the data we've seen, it appears some of that may still be going on despite meaningfully lower gas prices versus last quarter.\n\nHave you seen any improvement or, I suppose, a return to normalcy on that front with the consumer returning to their typical shopping habits and smaller tax sizes?\n\nBilly Cyr -- Chief Executive Officer\n\nScot, do you want to take that?\n\nScott Morris -- Chief Operating Officer\n\nSure. Sorry, I missed a bit of it somewhere in there. It was about focused on pack sizes and return to pack sizes, is it right?\n\nConnor Rattigan -- Consumer Edge Research -- Analyst\n\nYes, that's correct. Foot traffic. Talking about foot traffic and people tax sizes as a result of that.\n\nScott Morris -- Chief Operating Officer\n\nYeah. So there has been a -- it's really been interesting to watch. There's a pretty amazing dynamic going on in the category where people have been -- so here's what we've been seeing. In the category, we're definitely seeing where people are trying to stretch things a little further as much as possible.\n\n. There are -- there have been some pack size changes. There has also been some trade down from one item to another item within a brand. We have really weathered this quite well. I mean, amazingly well.\n\nAnd I think it's given us increased confidence of what the portfolio is capable of. And I think it's given us really strong confidence in doing the pricing again next year. I'm not saying this is a we can be -- we can -- we don't need to be really diligent and thoughtful about it. But we really have not seen the impact in the rest of the category, and we consistently look at growth rates and -- not only in dollars but also on pounds, equivalized units, etc.\n\nAnd it just gives us, I guess, really good confidence going into the changes we're making with the other components we have helping the business continue to progress forward.\n\nOperator\n\nThank you. Our next question comes from the line of John Lawrence from Benchmark. Please go ahead.\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nYeah. Thanks. Hey, guys. Billy, would you comment just a minute on the decision today on the capex? Am I reading it right that as you look at the margin improvement plan as you go toward '25, does this allow pushing out some of those projects a little bit? Will that allow that margin to expand a little bit earlier, maybe in '23, '24 without the dilution from the projects, is that fair?\n\nBilly Cyr -- Chief Executive Officer\n\nWe're going to go into the detail on the projects probably when we roll out the longer-term plan. But part of what we figured out how to do is take some of the innovation projects that we're working on, and we found a more efficient way to produce them that requires us to spend less capex upfront. And to the extent that that has an impact on margin, that would flow through. But I would say that the margin piece in the capex, while they're obviously related when we're not using adjusted gross margin.\n\nBut on an adjusted gross margin basis where we don't include depreciation, I don't think there'll be a whole lot of connection, that would be the expert on that. I think, though, that what you're going to see going forward is the more of our volume that we can have loaded into the Ennis facility, the more margin improvement you see on the total business. And so, as we look at how we lay out the capex plan and the resources, our is to put as much volume in that facility as we possibly can because it is the advantage facility from a margin perspective. And our capital spending plans will mirror that.\n\nDick Kassar -- Interim Chief Financial Officer\n\nOn a GAAP basis, you would suffer depreciation on that $100 million, assuming it was completed by the end of '24, would have hit '25 and now pushing that out does help on a GAAP basis but not on an adjusted gross profit basis.\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nGreat. Thanks, guys. Good luck.\n\nOperator\n\nOur next question comes from the line of Corey Grady from Jefferies. Please go ahead.\n\nCorey Grady -- Jefferies -- Analyst\n\nHey. Thanks for taking my questions. I just want to ask two quick follow-ups. First on pricing, do you expect to be in line with the industry or taking another round of pricing? And then have you seen any change in the industry in terms of promotionality?\n\nScott Morris -- Chief Operating Officer\n\nIt's interesting. I was literally just looking for motion, and I was waiting for promotion to start getting more aggressive. It really hasn't moved at all. I'm back, it actually looks like it might have contracted a tiny bit across the industry.\n\nAnd again, when I'm looking at it, I'm looking at wet and also in dry foods. So it's not a direct competitor, obviously, but they are calories in the category. So we haven't seen that action come out yet. When we do take our next price increase, we will still be below what most of, I would say, the wet part of the category has taken and will be in line or a bit above some of the dry.\n\nAnd there is a pretty big range by manufacturer on what the pricing has been from what we've been able to see. We're just looking at retail prices, but there's been some pretty dramatic moves on a lot of brands here. So I would say we'll still be -- we'll be below wet even when we take this price increase and then in line or slightly above a couple of the dry brands, but in a good spot, really in a good spot overall.\n\nCorey Grady -- Jefferies -- Analyst\n\nGot it. That's helpful. And then, I just wanted to follow up. So the update on your heavy and super heavy users.\n\nYou've talked about 25% of Freshpet customers using fresh kind of the full meal replacement in the past. Can you give us an update on what percent of your customers use Freshpet as a meal replacement?\n\nScott Morris -- Chief Operating Officer\n\nI have not -- -- Billy, it may have been in one of those decks. I do not remember -- I may be able to find it, but I do not have it off the top of my head, quite honestly. It's something that we -- I don't think it's changed. Go ahead.\n\nBilly Cyr -- Chief Executive Officer\n\nWhen you reported on a sales basis, so what percentage of our sales are from people who are doing that, it's north of 50%. But when you look at it as a percentage of the universe, it's a smaller percentage.\n\nCorey Grady -- Jefferies -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nLadies and gentlemen, we have reached the end of the question-and-answer session. And now I would like to turn the conference over to Mr. Billy Cyr, chief executive officer, for closing comments.\n\nBilly Cyr -- Chief Executive Officer\n\nThank you very much for your interest. We feel very good about what we've delivered, and we feel like we have delivered a strong on-plan quarter. We look forward to continuing the strength for the balance of the year. I want to leave you with one thought as I always do.\n\nAccording to Canadian author and history in Charlotte Gray, a dog desires of section more than is thinner, well almost, to which I would add, if you feed them Freshpet, the dinner will win hands down. Thank you very much, and we look forward to following up with you later. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJeff Sonnek -- Investor Relations\n\nBilly Cyr -- Chief Executive Officer\n\nDick Kassar -- Interim Chief Financial Officer\n\nBill Chappell -- Truist Securities\n\nScott Morris -- Chief Operating Officer\n\nAnoori Naughton -- J.P. Morgan -- Analyst\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nBrian Holland -- Cowen and Company -- Analyst\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nPeter Benedict -- Robert W. Baird -- Analyst\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nJim Salera -- Stephens Inc. -- Analyst\n\nJon Andersen -- William Blair and Company -- Analyst\n\nCody Ross -- UBS -- Analyst\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nConnor Rattigan -- Consumer Edge Research -- Analyst\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nCorey Grady -- Jefferies -- Analyst\n\nMore FRPT analysis\n\nAll earnings call transcripts"
}