{
  "companyName": "Flywire Corporation",
  "companyTicker": "FLYW",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/flywire-corporation-flyw-q3-2022-earnings-call-tra/",
  "content": "Flywire Corporation (FLYW 3.12%)\nQ3 2022 Earnings Call\nNov 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Flywire Corporation third quarter 2022 earnings call. [Operator instructions]. It is now my pleasure to introduce your host, Akil Hollis, vice president of investor relations and SP&A. Thank you.\n\nYou may begin.\n\nAkil Hollis -- Vice President, Financial Planning and Analysis\n\nThank you, and good afternoon. With me on today's call are Mike Massaro, chief executive officer; Rob Orgel, president and chief operating officer; and Mike Ellis, chief financial officer. Our third quarter 2022 earnings press release, supplemental presentation and when filed, associated quarterly report on Form 10-Q can be found at ir.flywire.com. During the call, we will be discussing certain forward-looking information.\n\nActual results could differ materially from those contemplated by these forward-looking statements. We will also be discussing certain non-GAAP financial measures. Please refer to our press release and SEC filings for more information on the risks regarding these forward-looking statements that could cause actual results to differ materially. Risk factors associated with our business and required disclosures related to non-GAAP financial measures.\n\nThis call is being webcast live and will be available for replay on our website. I would now like to turn the call over to Mike Massaro.\n\nMike Massaro -- Chief Executive Officer\n\nThank you, Akil, and thank you to everyone that is joining us today. We are pleased to share our Q3 2022 results and strong performance across the business, admits the current macroeconomic environment. In a few minutes, Rob Orgel, our president and COO; as well as Mike Ellis, our CFO, will go into greater detail about our operating and financial performance during the quarter. But first, I will start with a few financial highlights.\n\nDuring the quarter, our revenue less ancillary services was $88.9 million, representing a year-over-year revenue growth of 43%. This was an all-time high for quarterly revenue and was delivered in the face of meaningful foreign exchange rate changes. For context, this year-over-year growth rate would have been over 50%, but for the impact of FX rates. Adjusted gross profit for the quarter was $61.3 million in Q3, an increase of 38% year over year.\n\nAdjusted EBITDA was $18.2 million, and payment volume growth for the quarter was 33% when compared to Q3 2021. These results are a tribute to the growing global distribution of our business with clients in over 30 countries and Flymates around the world, something that will continue to benefit us for years to come. We are pleased with yet another strong quarter of performance. And now let me share some of the trends we are seeing in our industries, starting with education.\n\nAs many of you know, the third quarter has historically been the strongest for our education business. And consistent with this trend, we posted record revenue alongside strong new customer signings, growth within existing customers and expansion of our product capabilities. We benefited from our geographically distributed business as international enrollments continued to normalize post-pandemic. New data from the U.S.\n\nDepartment of State shows that the total number of student fees is awarded from May through August of 2022 was up from the same month last year, fueled by increased demand from India. According to the analysis from Chronicle of Higher Ed, more than 84,000 student visas were issued to Indian students from May to August this year. That represents nearly 45% more visas for Indian students than the same four months last year and 148% more than during that same span of 2019. We have a strong solution for Indian payers and benefited from this trend.\n\nWhile we saw strength in multiple aspects of our education business and delivered strong overall revenue growth, we experienced less revenue growth than expected from students originating from China. The combination of decline in visa issuance and COVID-related travel obstacles, as well as changes in destination may have impacted growth. Even with these trends, we believe there is an opportunity to continue to grow in the China market as we have relatively low market penetration. We have multiple strategies focused on better serving Chinese students and families, including our agent strategy, our pane-school capabilities that were just launched and our expanding roster of schools and universities globally.\n\nBroadly speaking, we remain optimistic about the future of International Education and believe Flywire is well positioned to support our clients as they continue to recruit students from around the world. In a recent Flywire survey of admissions leaders at some U.S. institutions, their overall view on international enrollment was positive, and many are diversifying their recruitment efforts in new regions to grow their international students. In fact, 87% noted increases in applications from India, while over 95% expect total international enrollments at their institutions to increase or stay the same for the next three years.\n\nWhile we continue to monitor the shifting dynamics related to international students in a post-pandemic world, our education clients continue to remain resilient and our land-and-expand strategy positions Flywire to capture more of this market by providing additional solutions for clients and their payers. Shifting to healthcare. We are seeing IT play a greater role in the implementation process of our solutions as we continue to integrate with major healthcare platforms, or EHRs, like Epic and Cerner. In a recent survey we conducted of CIOs and other key decision-makers in the healthcare space.\n\nWe found that almost all healthcare IT leaders, 97% of those surveyed say tight integration with EHRs is one of the most important considerations when choosing an outside technology vendor. And as systems like Cerner and Epic become more tightly integrated with all care-based services, we expect IT leaders will increasingly be measured against patient experience metrics like satisfaction and patient collections, which are all outcomes, our solutions help clients to achieve. In travel, we continue to see strong demand for our solutions all over the world. According to the U.S.\n\nTravel Association, travel spending improved considerably in September and is now at its highest mark since the pandemic started at 6% above 2019 levels. This is consistent with some of the trends we are seeing across our client base. In particular, our clients are reporting an extension of their busy season, driven by pent-up vacation demand, as well as the continued reopening of many top tourist destinations such as Japan. We continue to develop solutions that serve the specific needs of this industry, and those capabilities are helping drive our growing footprint in the travel sector.\n\nTo highlight an example, we have enhanced our invoicing capabilities and payment acceptance to allow for scheduled payments, creating a streamlined and flexible way for clients to set payment terms to capture a deposit today and schedule payments at future dates as part of one seamless payment experience. To speak to the macroeconomic environment for travel, we believe that clients we see are still benefiting from the continued pent-up demand for post-COVID travel, especially for experience-focused trips like luxury travel, bespoke tours, adventure travel, and more. For our clients, spanning across travel operators, destination management companies, and accommodations providers, we continue to share their confidence that the demand for these experiences will be more resilient than the broader travel sector across a range of macroeconomic environments. In B2B, we continue to see demand for our solutions from businesses looking to enhance their incoming payment processes to help free up cash trapped on the balance sheet.\n\nTreasurers and audience we typically sell into are focused on inward-facing tasks during inflationary periods, like managing cash and liquidity. This is according to ASB's strategic role of Treasury 2022 report, and these are challenges that Flywire helped solve. Furthermore, Flywire solutions can help all clients achieve valuable operational efficiencies. We enable clients to streamline what would normally be manual processes with legacy systems and create better payment experiences for their customers.\n\nAnd we expect our solutions to become even more valuable as clients navigate economic uncertainty. Finally, let me talk about investing in our future. We believe our strength comes from our diversified model, diversified verticals across diversified geographies, delivering best-in-class products through a mixture of organic and inorganic investments positions us to continue our growth, navigate through periods of uncertainty, maintain margins, yet maintain focus on our strategic objectives. First, on the organic side.\n\nWe have been squarely focused on solving major pain points for our clients, and we will continue to accelerate our ability to build, sell and deploy solutions. We believe the significant market opportunity will be realized over the next decade, and our product technology road map is critical to our future success. As discussed during our 2022 analyst day, we continue to focus on key investment areas within the business. One of those areas is around enhancing our go-to-market, and we are pleased with the progress we continue to make on our sales ramp time, delivery capacity, and in our powerful digital acquisition strategies.\n\nFor example, in our travel vertical, where we invested significantly in digital marketing and have more than a 60% year-over-year increase in marketing source pipeline and a 70% year-over-year increase in marketing source deals. We are also making good progress on our vision to continue to expand the Flywire advantage to truly power the vertical ecosystems that we support. We are making progress on strategic payables, which is being successfully piloted in the education vertical for both domestic and international payouts. As a reminder, our approach to payables is one of focus and precision.\n\nWe have discovered pain points that we believe Flywire is uniquely positioned to solve. We are applying our existing framework of using software and our global payment network to drive value and payments to solve specific payables use cases for our clients. As for our inorganic investments over the past 12 months, we are very pleased with the muscle that we have developed in identifying, negotiating and successfully integrating acquisitions over the past 12 months, specifically WPM and Cohort Go businesses. WPM, as you know, enabled us to accelerate expansion in the U.K.\n\nmarket. Q3 marked our first major new student enrollment period in the U.K. following the acquisition, and we have over 20 schools live with our initial version of the integrated solution and roughly as many more signed and still to be deployed. Cohort Go had an agent foot principle important markets, including India and China, an agent technology platform, payment capabilities and a payer-oriented solution for marketing student health insurance.\n\nThis acquisition extends our footprint with education agents and accelerates our investment in product and payment innovation for [Inaudible] in multinational students. We now have successfully integrated their full pay a school operational and feature improvements to the solution. In closing, after recently returning from traveling to see capability into the Flywire platform, offering an expanded universe of over 5,000 institutions to our agent partners. We've also begun to migrate these partners onto a single platform, while continuing to work on additional many Flymates clients and partners around the world, I remain more excited than ever about the future of Flywire, Seeing our teams in action is always an incredible experience, and I'm proud of the relationships that our Flymates build with our clients and partners, some spanning over a decade.\n\nGrowing and strengthening our Fly Mate community is critical to Flywire's future success. I'm extremely proud of the culture and team we've built with now more than 950 Flymates around the world who represent more than 40 nationalities and speak over 30 languages. They truly operate as one team and are the cornerstone of how we continue to deliver exceptional value to our clients, partners, and payers. We are committed to providing our Flymates the opportunity to pursue their career for lifetime.\n\nOnce again, Flywire has been recognized as one of the leading workplaces in the United States, according to the employee experience platform, great place to work. With 95% of Flymates recommending Flywire compared to just 57% of employees at a typical U.S.-based company. The opportunity ahead of us is large, and I could not be more excited about the future. I would now like to turn the call over to Rob Orgel, our president and COO, to review some operational highlights from the quarter.\n\nRob?\n\nRob Orgel -- President and Chief Operating Officer\n\nThanks, Mike, and good afternoon, everyone. Our strong results this quarter reflect continued execution of our growth strategies. We saw strength in bringing on new clients with the addition of over 145 new clients in the quarter. This brings our client count to over 3,000 and consistent with our recent quarters, we also had success in getting more payments and payment share by expanding with existing clients.\n\nI'd like to highlight some of our successes across the verticals and in a few minutes, mention some other operational achievements that are important to our overall efficiency and scalability. Starting today with education, we continue to see strength in both our U.S. and internationally based clients for both domestic and cross-border payments. As one indication, the trailing 12-month average net revenue retention in education was over 130%, demonstrating the resilience of the education business and the continued execution of our land and expand and other strategies that support our NRR.\n\nWe signed education clients in all regions. We also saw a more than doubling of our domestic education revenue in Q3 compared to the prior year. In the U.S., we signed San Diego State University, which is part of the California State University system for our cross-border payments offering. San Diego State was founded in 1897 and is the third-largest university in the state of California with over 35,000 undergraduate and graduate students.\n\nThe university welcomes over 2,300 international students each year from a variety of regions, including China, Saudi Arabia and Europe. We are excited to offer best-in-class software and payment solutions to San Diego State. We also continue to make good progress with our domestic education business. In the U.S., our existing client, Columbia University, a globally renowned institution with three undergraduate schools and 13 graduate and professional schools for its 31,000-plus students is currently using our cross-border and past due collections payment solutions.\n\nColumbia is now adding Flywire sole CRS system offering to process all student tuition payments. We're excited to expand our relationship with Columbia. Finally, in partnership with Ascensus, we continue to make progress with our 529 disbursement plan processing solution, which helps universities reduce time and resources spent on paper check processing. With Ascensus, Flywire is able to digitize distributions to more than 500 connected schools with funds originating for more than 40 college saving plans spread across 20-plus states and territories.\n\nPurdue University with a student population of over 49,000 undergraduate and graduate students piloted our solution to electronically process nearly 529 disbursement payments. Once the 529 plan disbursement request is made by the account owner, Flywire facilitates the payment and promptly credits the student account reducing delivery time. That's just one school, and we're deploying this solution broadly. The solution is a win for families, schools and our plan partner, Ascensus.\n\nWe are encouraged by the early results of this innovative solution and remain focused on growing our network of 529 plan and digitally connected schools. Moving on to our healthcare vertical. We continue to help our clients improve payments on their patient receivables. In this period of heightened financial stress for the industry and for families, are solutions that address both affordability and yield on billables are critically important.\n\nTo illustrate, we helped Munson Health care part of Northern Michigan's largest and leading healthcare system achieved the highest percentage of collections in their history. About 53% of payments were generated digitally during the third quarter. Electronic payment collections increased over 80% versus any prior quarter. During the quarter, we saw the go-live Assago Memorial, which is part of the Munson system, and we expect other hospitals within the system to follow over the coming months and quarters.\n\nDuring the quarter, we also expanded our relationship with Common Spirit Health, or CSH, with our first go-live with a Dignity Health facility. CSH is the largest Catholic health system and second largest nonprofit hospital system in the United States, formed through the merger of Dignity Health and Catholic Health Initiatives, CHI. Tom Spirit operates 140 hospitals and more than 1,500 care sites across 21 states. Flywire has worked with CSH since 2018 and provides the hospital system with Flywire's full suite of services across all its CHI hospitals, including digital engagement, billing consolidation and automated payment plans.\n\nWe look forward to continuing our efforts with CSH. We also helped our existing client, Edward Elmer's Health, or EEH, improved collection of its patient receivables. EEH recently merged with NorthShore University Health System to form the third-largest healthcare delivery system in Illinois. With the usage of our full-suite solution for health systems, Edward Elmer was able to convert 91% of patient payments to self-service and reduce its payment plan default rate by over 50%.\n\nYear-to-date, as of September 2022, EEH's collections increased 10% on a year-over-year basis. Our hospital system clients continue to benefit via higher collection rates and lower patient default rates by adopting our self-service payment solutions. Next, we continue to see strength in our travel vertical, following the strength in EMEA, we've mentioned on prior earnings calls, the APAC region has seen a rebound amid losing travel restrictions as more countries in the region are now open for travel. Our sales and client teams continue to work with Japanese prospects in advance of Japan's September announcement allowing the resumption of visa-free tourism effective in early October.\n\nBy being proactive, Japan accounted for 20% of our new travel client signings for the quarter and is also contributing to a return to bookings growth in the region. For example, we signed Niseko, a luxury accommodation provider located at the base of the world-renowned uCaroro Ski Resort in Hokkaido Japan. Flywire is replacing another large payments provider, given our ability to reduce transaction fees for our client, as well as our deepening integration with Boom boss' property management system, which simplifies reconciliation workflows for uCaroro. We continue to see volume from our European DMCs through the shoulder season of August through October.\n\nMany of our European clients are seeing more inquiries about 2023 travel and receiving a higher number of prepayments than expected. Tempo VIP specializes in tailoring unique travel experiences and tours in Portugal and is rolling out a new partnership with one of the largest and leading travel agencies in the United States. Flywire is proud to serve as the exclusive software-enabled payments provider for this partnership. Finally, we completed our integration with SPI Software, the preferred software partner for the timeshare, vacation owner club, and resort industry serving clients across five continents.\n\nA timeshare accommodations provider sought to replace its paper-based billing process with a digital invoicing and international payment solution to quickly and securely invoice members and collect payments for multiple countries while streamlining back-office operations. The client chose to implement SPI Software's integrated Flywire payment experience and global payment processing solution to send invoices and reconcile payments in over 120 currencies via a variety of payment methods that includes local bank transfer and credit card. Flywire software-enabled payment solutions significantly reduced international wire and merchant fees for the client. We look forward to continuing to build on the integration with SPI software and build a presence in this corner of the broader travel sector.\n\nTurning to B2B. We continue to be very optimistic about our potential to grow our emerging B2B verticals business. Two key points are the foundation for our belief. First, we are getting clients live effectively and delivering great results for them.\n\nDuring the quarter, we signed the Best Doctors Insurance or BDI, a leading Miami headquartered health insurance companies serving individuals, agents and groups with operations in Latin America, the Caribbean and Canada. BDI went live earlier this quarter to Flywire commercial product and processed seven figures in cross-border and domestic volume within 24 hours of going live. Flywire has integrated multiple payment methods, including card, bank transfer and alternative payment methods to automatically post back into their finance system of record. So not only are they seeing cost savings, they are also seeing significant operational efficiency gains as well.\n\nSecond, our partnerships are increasingly effective. Our key bank and channel partners are finding working with Flywire to be complementary to their business. We are seeing increasing lead and referral activity from our partners that is helping drive activity for our growing B2B sales and client service teams. We are dedicating more of our own attention to supporting our channel development efforts and are optimistic that we'll continue to pay off for us.\n\nWe also continue to enhance our platform to drive operational efficiency. We launched a client self-service portal that will lead to more efficient access to self-help solutions, as well as faster and more accurate routing to our client services team. We also significantly improved our customer support system for our payer experience team. All of our efforts around Sarbanes-Oxley compliance has also had an ancillary benefit of improving our process focus.\n\nWe also drive efficiency in our network. We continuously negotiate with our banking and card partners around the world so that we can offer reasonable terms to our payers while increasing our gross profit spread on transaction volumes. We get it that in the current economic climate, we have an imperative to deliver on these kinds of efficiency opportunities. Overall, you can see we had another very active quarter with Flywire's global team of Flymates doing great work across our verticals and across the company to get us through our biggest quarter of the year.\n\nI would now like to turn the call over to Mike Ellis, our CFO, to review our results for the third quarter and guidance for the remainder of the year. Mike?\n\nMike Ellis -- Chief Financial Officer\n\nThank you, Rob. Good afternoon, everyone. Today, I will provide an overview of our third-quarter financial results and discuss our outlook for Q4 and full year 2022. As a reminder, today's discussion includes non-GAAP financial measures.\n\nPlease refer to the tables in our earnings press release for a reconciliation from non-GAAP to the most directly comparable GAAP financial measure. Revenue less ancillary services for Q3 2022 was $88.9 million, representing a 43% increase compared to the Q3 2021. Our revenue growth rate was driven by an increase in total payment volume, particularly due to strong growth from our international cross-border payment volumes in our education and travel verticals. We processed $7.0 billion in total payment volume during Q3 2022, which was an increase of 33% from the $5.3 billion we processed during Q3 2021.\n\nQ3 2022 was our largest quarter in the history of Flywire in terms of both revenue and payment volumes. Specifically, transaction revenue increased 46% compared to Q3 2021, driven by a 37% increase in transaction payment volume. Platform and usage-based fee revenue increased 29% compared to Q3 2021, driven by a 23% increase in platform and usage-based payment volume. We achieved these strong revenue results in spite of an unfavorable FX environment as the U.S.\n\ndollar strengthened during the quarter against several currencies, including GBP and euro. When compared to FX rates during Q3 2021, the impact of the strong U.S. dollar on this quarter's reported revenue was over $5.0 million. Meaning that the services we provided and fees generated would have shown $5 million more of additional reported revenue in Q3, but for the increase in foreign exchange impacts from converting those overseas revenues into U.S.\n\ndollars for financial reporting purposes. As Mike mentioned, our revenue growth rate, tax rates in Q3 2022 were consistent with Q3 2021 would have been over 50%. Furthermore, we estimate that the impact on our Q3 2022 reported revenue due to the stronger U.S. dollar was between $1.5 million to $2.0 million compared to what was implied in the revenue guidance we provided for Q3 2022 during our Q2 earnings call, which was based on FX rates at the end of Q2 2022.\n\nOverall, we were pleased with our revenue performance and client growth and the resiliency of our business considering the overall environment. Moving on to adjusted gross profit. We generated $61.3 million in adjusted gross profit, representing a 38% increase compared to the $44.6 million earned during Q3 2021. That resulted in an adjusted gross margin of 69% for Q3 2022, down 2.9% from the 71.9% reported for Q3 2021 due to continued shifts in revenue and payment method mix as discussed during our Q1 and Q2 2022 earnings calls, as well as during our analyst day in May of this year.\n\nMoving on to operating expenses. Technology and development expenses were $13.4 million for Q3 2022, an increase of 73% over the $7.8 million incurred during Q3 2021. The increase was primarily the result of adding 130 Flymates to our engineering and technology teams since Q3 2021, which drove increases in employee-related costs including stock-based compensation, consistent with our plans going into the year that we would be investing in this area. Selling and marketing expenses were $21.7 million for Q3 2022, an increase of 73% over the $12.5 million incurred during Q3 2021.\n\nThis increase was driven by adding 148 Flymates via direct hiring and our two acquisitions since Q3 2021 into our sales and marketing teams, which drove increases in employee-related costs, including stock-based compensation. In addition, we incurred more costs associated with third-party commissions as a result of our revenue growth during Q3 2022 compared to Q3 2021. General and administrative expenses were $24.2 million during Q3 2022, an increase of 55% over the $14.7 million incurred during Q3 2021. This increase was driven by adding 118 Flymates across these functions, resulting in an increase in employee-related costs, including stock-based compensation.\n\nIn addition, we incurred more cost associated with SOX compliance, as well as other costs associated with operating as a public company. Adjusted EBITDA for the quarter was $18.2 million, an increase of 3% over the $17.6 million reported for Q3 2021. Adjusted EBITDA increased due to strong adjusted gross profit growth, offset by increased salaries and other operating expenses, as discussed previously. The revenue impacts from FX were partially offset by FX benefits for our international expenses, resulting in a net headwind to our reported adjusted EBITDA of approximately $2.0 million.\n\nWe wanted to note that our GAAP net loss per share of $0.04 was impacted by the remeasurement of in-company loans related to the acquisitions of WPM and Cohort Go. The loss on remeasurement resulted from the FX impacts noted above with these notes receivable being denominated in GBP and AUD under our U.S. entity, which reports in U.S. dollars.\n\nMoving on to the balance sheet. With respect to capitalization as of September 30th, 2022, we had $349.2 million in cash and cash equivalents and $25.9 million in long-term debt. As of September 30th, 2022, we had 108.9 million shares of common stock outstanding, which is slightly different than the weighted average shares outstanding used to calculate net income and loss per share due to the timing of shares issued during the quarter. Moving on to guidance.\n\nWe have raised and narrowed our guidance for revenue to be in the range of $263.5 million to $266.5 million for full year 2022, which results in an annual revenue-less ancillary services growth rate of approximately 46.5% at the midpoint. Our full-year 2022 expectations reflect an increase in our organic revenue expectations offset by stronger FX headwinds. With respect to adjusted EBITDA, we are maintaining our full-year 2022 guidance to be in the range of $14 million to $16 million, reflecting our current view about continued growth and execution in the business alongside continuation of our previously announced growth in investment plans and taking into account the FX impacts discussed above. With respect to guidance for Q4 2022, revenue less ancillary services is expected to be in the range of $64 million to $67 million, which represents a year-over-year revenue growth rate of 43% at the midpoint.\n\nWe estimate the FX headwind to Q4 revenue to be in the mid-single-digit millions in dollar terms based on FX rates at the beginning of Q4 2022, approximately double what was expected coming out of Q2. In conclusion, we are pleased with our Q3 2022 financial results and the resiliency of our business, and we continue to look forward to the rest of 2022. With that, I'd like to turn the call over to the operator for questions. Operator?\n\nOperator\n\n[Operator instructions]. Our first question comes from the line of Bob Napoli with William Blair. Please proceed with your question.\n\nBob Napoli -- William Blair and Company -- Analyst\n\nThank you. Good afternoon. So Mike, I was wondering if you could maybe give a little bit of color on 2023 on your thoughts as to whether your long-term targets are if you would expect to be as far as revenue growth and EBITDA margin expansion, is that still in a trickier economic environment still valid?\n\nMike Massaro -- Chief Executive Officer\n\nBob, thanks for the question. Great to hear your voice. Obviously, we're not here in FY '23 guidance on this call, but I'd encourage people to remember what we've said that we continue to stand by. I think of Flywire as a 30-plus percent organic compounding grower.\n\nWe believe we've shown the penetration of our total addressable market has that room for that growth, our continued execution, the pipeline building we've spoken about on multiple calls. We obviously haven't finalized 2023 plans yet, but I'd also encourage people to look at just what we've done to show that we can grow and grow profitably. And so, we've got excellent unit economics. We've shown leverage in the business.\n\nYou can look at last year's adjusted EBITDA strength. You can look at this quarter's adjusted EBITDA strength of approximately 20%. And I would say we continue to have a desire to expand EBITDA margins, as mentioned in our analyst day in May. I will note that expansion had a range in it in May, and obviously, it was a very different FX climate at that time than it is today.\n\nAnd so, that's something we'll take into account in planning, but you can expect us to be that 30-plus percent grower, as I mentioned before, you could expect us to continue to show profitable growth with EBITDA margin expansion.\n\nBob Napoli -- William Blair and Company -- Analyst\n\nGreat. Appreciate that. You gave out a statistic. You said net revenue retention on education, 30%.\n\nMaybe if you could just give maybe a little bit color on broadly on net revenue retention. And that 130% on education is pretty impressive. Is that -- what are your thoughts around net revenue retention for the company as a whole and the longer-term outlook?\n\nMike Massaro -- Chief Executive Officer\n\nSure. I'll let Rob cover that one.\n\nRob Orgel -- President and Chief Operating Officer\n\nGood. Bob. Well, you're right calling out the strength in that NRR number for education that was broad-based for us. We saw strength in the domestic that supported that.\n\nWe saw strength in our international, both FX business, as well as our clients located abroad so that education NRR very strong across the board. The other part of your question was just NRR more broadly. We didn't share a specific number, but I will share that the NRR for the company for the trailing 12 months was also above our three-year average. So we are essentially helping support the growth of the business through very strong NRR across the whole business.\n\nBob Napoli -- William Blair and Company -- Analyst\n\nGreat. Thank you. Good to see the strong results. Appreciate it.\n\nRob Orgel -- President and Chief Operating Officer\n\nThanks, Bob.\n\nOperator\n\nOur next question comes from the line of Andrew Bauch with Nikko Securities. Please proceed with your question.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nHey, guys. Thanks for taking the question. Particularly in light of the FX headwinds you had, I just want to talk about the employee ramp that you guys have really invested in over the last year. I mean, 925 flats, if I saw that correctly.\n\n58% growth year over year, pretty impressive investment there. I'm just trying to get a sense of where are those new associates that you brought on in terms of contributing to your overall sales portion go-to-market motion and how that sets up for 2023 as they really start to flex that sales muscle.\n\nMike Massaro -- Chief Executive Officer\n\nYes, I'll start. I'm sure Rob will jump in. So first, obviously, we set out the year really highlighting that we thought it was the right time to have an investment year. Think of those Flywire investments really being around two areas: product and tech innovation, that's scaling our platform teams, our tech teams so that we can deliver great new solutions, new capabilities to clients and then our go-to-market.\n\nAs we've talked at length in the past about the great pipeline generation we have, as well as our ability to get customers signed, to get them live and generating revenue, and we saw opportunities to expand that go-to-market team across industries, across geographies. And so, that's where the vast majority of that climate investment went. Do you want to go into a bit more detail, Rob?\n\nRob Orgel -- President and Chief Operating Officer\n\nWell, I can talk a little bit just about this past year, but I'll also talk just a little bit about the year ahead. In terms of this past year, we're really pleased with the investments we made. We really strengthened that go-to-market team. And if you talk about the sales organization, adding almost 80 people into a sales organization, which allows us really to cover more territory, go after more accounts.\n\nWe added a significant number in relationship management. We added marketing and rev ops, all of which rowing our ability to capitalize on our market opportunity. So it was a year of significant growth in investment as we called out coming into the year. But just to be clear, our view heading into 2023 as we're focused on profitable growth, and we're focused on making sure that we are delivering on that EBITDA margin expansion, you can expect us to see -- sorry, you can expect to see from us real planning and deliberation in terms of how we add those hires, where we add those hires and essentially a more moderate pace in the year ahead.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nAnd once again, committing to the 30% organic growth that you called out and margin expansion in this type of market environment is definitely not lost on investors. And maybe if you could speak to some of the opportunities that you have in education in the year ahead. I mean, another update on WPM is always helpful with the 20 that have gone live. And any sense on how that progresses now that it's been under the hood for, call it, 10 months at this point?\n\nMike Massaro -- Chief Executive Officer\n\nYes. Sure. I'll take that one. I think we see an opportunity to just keep adding new clients in education.\n\nI know we've mentioned different geographies before for expansion, the land and expand strategy in the United States. We've called it out -- Rob talked about Colombia as a major new win as well. So that land and expand strategy is yet further allowing us to maintain a growth rate like that. And then, when you look at not only WPM but the Cohort deals, we think those put us in a really good position.\n\nSince you asked specifically about WPM, we'd mentioned the 20 or so clients live about a similar number yet to go live that have signed. And that, for us, is a really great number. They're well over 100 clients that we mentioned at the time of that deal, and we're marching through that list of clients and communicating the value, I think, appropriately getting the solutions up and live. It's a lot of work.\n\nOur team is working real hard to do that, both on the tech side and on the relationship management and account side. And we're going to continue to do that. We'd always told everybody to think of that as a 23 and a 24 and a 25 growth lever for the business, and we really stand by that.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nThat's great to hear.\n\nOperator\n\nOur next question comes from the line of Will Nance with Goldman Sachs. Please proceed with your question.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nHey, guys. Good evening. I wanted to maybe hit on like the topic Dujour recently, which has been the fewer student -- Chinese student visas. You guys called it out in the prepared remarks.\n\nAnd I guess, on one hand, it sounds like you're saying that fewer Chinese student leases was a headwind to growth this quarter. On the other, you're talking about total Visas being up on the year with particular strength coming out of India. So maybe, I guess, can you talk around just how the geographical exposure is hedging the business internally? And what cushion does your university client base have in terms of wait list to cushion or maintain the amount of international student enrollments if Visas from a single geography takes down? I guess what would need to happen in other words, for the Chinese student Visa issue to actually start impacting total results.\n\nMike Massaro -- Chief Executive Officer\n\nWill, thanks for the question. So as I mentioned in my remarks, we grew in China in Q3 relative to even the prior year. Some countries, we have a globally diverse business. Some countries, you'll see growth.\n\nSome countries, you'll see decreases. Like that's a natural behavior that exists in the cross-border education market. If you go ahead and look, there are markets, I can tell you that we did see growth in Chinese students, notably U.K. and Asia Pacific.\n\nAnd so, again, the overall Flywire market penetration when it comes to Chinese payers is still relatively low. So through our current strategies that we've talked about, we feel really good about being able to grow that China penetration over time. You can look at the agent strategy we talked about, as well as the Cohort Go deal. That's a core component to it.\n\nThe nonclient receivables, which we talked about in the analyst day, which allows us to process payments for nearly 5,000 schools around the world now. And then, also just in general, when you look at you're adding more clients in all these geographies, including places like the U.K. through the WPM deal, that helps us really get our solution in front of more and more Chinese students. Obviously, there are macro conditions happening, whether it's the travel obstacles, whether it's the visa approvals, even just economic-related impacts and students are going to change where they go.\n\nWe called out the growth in India as a big area. That's obviously a net positive. And our belief is over the medium and long term, you're going to see continued growth in international student numbers. If you look over the last two decades, you've seen single-digit growth consistently in the international students overtime on an annualized basis.\n\nAnd so, again, that's our belief. That's where we think it's going to go. You asked how our schools are impacted. Our schools are looking to diversify.\n\nYou talk to any of our clients in education. This is -- if they are heavily concentrated in one market, they're looking for ways to diversify and get -- ensure they're positioned properly for students in many countries around the world. Remember, we touch students coming from over 100 countries and territories every year. And schools need to really continue to monitor where is their student population coming from.\n\nIs it diversified? Many of our clients have multiple campuses in different parts of the world as well, which have different populations of students coming to them. And I think all of that is what you have to look at when you're an educational institution with -- in this macroeconomic environment. For Flywire, we think we're well positioned because of that geographic distribution of our business.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nMakes a ton of sense. I appreciate all the color on that. And then as a follow-up, I was wondering if maybe you can touch on a few of the details on the WPM acquisition. I guess, I know you talked about 20 previously that had already signed up and it sounds like you've got 20 more in the pipeline.\n\nWhat contribution, if any, did that have to the current quarter's results? I know there was some talk of maybe being able to get them to go live in time for tuition season this year.\n\nRob Orgel -- President and Chief Operating Officer\n\nSo Rob here. Obviously, you've seen that there's a contribution from WPM that's based on their steady ongoing business, relatively flat. That gets in the platform and usage fee revenue. You've seen that relatively consistently.\n\nAnd now with the go-live in the first major period of enrollment for the U.K., we're starting to see some of the benefit of that tuition flow transactional-based revenue for this quarter, still low single-digit millions, but very optimistic that will grow into a meaningful part of our business for next year.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nGot it. That's very helpful. Appreciate taking my questions.\n\nRob Orgel -- President and Chief Operating Officer\n\nThanks, Will.\n\nOperator\n\nOur next question comes from Tien-Tsin Huang from J.P. Morgan. Please proceed with your question.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nThanks. Good to speak with you guys. Just wanted to ask just looking at sales activity pipeline, that kind of thing. Any change in some of your client priorities, especially in education.\n\nI'm just curious how the active opportunity in deal size ARR in the pipeline, maybe how that's changed in the last 90 days?\n\nRob Orgel -- President and Chief Operating Officer\n\nSure, Tien-Tsin, I can start with that. Look, it was another great quarter for client acquisition. You heard in my comments, 145 clients look closely hit the data. It's spread across all the verticals.\n\nIt's spread across all the geographies, really strength and great client wins across each of them. If you look at the pipeline values as opposed to the ARR signed and the client side, very nice growth in pipeline as well. We're up over 50% for the quarter. We're up over -- compared to the prior quarter.\n\nPrior year quarter, we're up over 50% year-to-date in pipeline value. So we feel really good that as we have these good quarters and signings, we are also growing the pipeline values very nicely.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nThat's great to hear, Bob. Just -- and I get this question and then I'll jump off. I get this question from investors just with the strong dollar, you're assuming this that persists and not asking about translation or anything, just with the stronger does that have any impact on demand, whether it be for students wanting to come to the U.S. or even schools -- international schools may be doing some decision-making.\n\nIs that something we need to consider that you're watching?\n\nMike Massaro -- Chief Executive Officer\n\nI think that will play into just macro conditions of where students choose to go and maybe if they're coming from a certain type of demographic, they may be looking at more cost-effective channels just as someone would if they were potentially getting scholarship dollars or whatnot. I think there is a bit of potential in that, but I would just caution you to not think it's a huge trend. Most of these families have been saving for many, many years, sometimes decades to send their kids abroad. And if they can get into some of these top universities, they're likely to still figure out ways to make that happen.\n\nThey see this as a very long-term investment. And so, I don't think it's a major thing, but you may see a minor impact based on short-term thing.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nYes. No, I figured that was the case. You want to go to Colombia, you're going to go to Columbia, if you get it. Thanks.\n\nMike Massaro -- Chief Executive Officer\n\nThanks, Tien-Tsin.\n\nOperator\n\nOur next question comes from the line of Darrin Peller with Wolfe Research. Please proceed with your question.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nHey, guys. When we look at the monetization rate you guys put up this quarter, it definitely had an expansion on a year-over-year basis that was more than -- I know we and I think most people anticipated. And even on a year-over-year basis, it was on a percentage terms, I think it was up the most I've seen it up. So was there something going on around mix or maybe the acquired revenues coming in or anything else? Or is that just the new sustainable rate for some areas? Can you just help us give us some insights in there?\n\nMike Ellis -- Chief Financial Officer\n\nDarrin, it's Mike Ellis. Yes. Sure, will. The monetization rate when you look at it in the aggregate, certainly up, as you've indicated, if you look at it on a more granular basis, look at the transactional revenue component and the transaction MR, it's really the result of the card mix, as you can tell, looking at adjusted gross margin, you've also seen that decline.\n\nSo obviously, it's the credit card mix that's basically driving that transaction revenue monetization rate higher for this quarter. In addition to that, on the platform side, you've got the acquisition of Cohort Go and WPM that basically adds revenue but does not add any associated volumes to the platform. So therefore, you're seeing the increase in that quarter as well.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nOK. And so, thinking about the implications of that going forward. Again, there's a mix dynamic, obviously, on there. But from a gross margin standpoint, it offsets.\n\nCorrect me if I'm wrong, the seasonality still from an education vertical standpoint, higher this quarter, which would impact gross margins also.\n\nMike Ellis -- Chief Financial Officer\n\nYes, that is correct.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nOK. Just a quick follow-up is just remind us and revisit for us again, your thought process around the profitability of the business going forward in terms of your emphasis on it. And I know we had -- I think we heard you guys talk about a pathway of -- which led to about 300 bps of margin expansion potential per year, 300 to 400 basis points. Is that still in your mind the right way to think about things for us?\n\nMike Massaro -- Chief Executive Officer\n\nYes. So Darren, I mentioned that a little bit when it came up to 2023 guidance. The thing I think people can expect from us, as I said it before, as we're looking. We're not obviously giving guidance of 23%, but 30-plus percent organic grower.\n\nWe've shown we can grow profitably, strong EBITDA margins last year as a percentage of strong EBITDA margins for this quarter as a percentage. And I would say people should continue to expect us to expand EBITDA margins. The 30% to 60% Shaden analyst day, the only thing I'd just highlight, obviously, didn't see the FX wind coming as much as it's come here. And so, as we go through 2023 planning, we'll take that into account.\n\nBut you can expect us to continue to push for that 30-plus percent growth and do so with expanding EBITDA margins.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nAs real quick, any change versus -- besides the education vertical, we talked about a lot, was there any change versus what you expected in the Oliver in the -- whether it's healthcare, travel or B2B verticals versus expectations?\n\nRob Orgel -- President and Chief Operating Officer\n\nDarrin, we'll just comment that we haven't talked a lot about the strength in travel yet on this call. Travel is continuing to be a very strong vertical for us. We talked about the drivers that came out of Europe in our last call. Those continue to be true.\n\nThis quarter, we are pleased to be able to say that we're seeing positive trends coming out of APAC as well. We're investing and confident in that travel business, believing it can continue to grow for us. And so, that's a highlight. You heard us call out in B2B, the example of BDI, a new client signed from the quarter that's just gone live and moving some significant volume from them right out of the gate.\n\nWe continue to believe that that's a perfect example of what we can do for clients in the B2B side of things, helping drive ROI for them and volume for us. And the healthcare business has also been strong in terms of signings, and we got a cadence of go-lives that are happening now and going forward. So really good things going on across the other verticals as well that we haven't talked about much yet on this call.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nThanks.\n\nOperator\n\nOur next question comes from the line of Ashwin Shirvaikar with Citi. Please proceed with your question.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nHey. Thank you. I just wanted to follow up on the -- one of the announcements you had in the quarter was with University has integrated payment solution for higher education institutions. Seems to me that kind of thing may be an opportunity going region by region across the world, just to pick up groups of higher education institutions and to roll it into your platform.\n\nIs that the right way to read that? Or am I overthinking on that?\n\nMike Massaro -- Chief Executive Officer\n\nI think you're exactly right, Ashwin. So I mentioned in my comments that we were continuing to focus on the channel strategy that we have as you apply it to the education vertical Universitas is a good example, one of many, in fact, -- what we really like about those is that they not only help us do a great job for the clients. They make it way easier to get the introductions and start getting traction with those clients. So these are very mutually beneficial relationships for the software partners that we integrate with.\n\nThey're great for the clients that we can integrate and get live faster. And so, we have a team that is working to build those kinds of relationships really in each of our verticals in each of our main geographies. And so, we've talked a lot in the past, really, we probably focused on direct more than we've talked about channel. I think you should understand that we also are increasingly effective on this channel relationship and integration side and continuing to work well there.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nGood to know. And then, you obviously interspersed a lot of macro commentary through the call. But if I can go back to healthcare, which should be cyclical, should be benefiting from at least for a couple of more quarters, maybe an easier COVID comp. How are you thinking of how decision-making and cost takeout scenario evolve in there for your clients as you look at the next, say, six to nine months?\n\nMike Massaro -- Chief Executive Officer\n\nYes. We just had a client advisory board-type meeting and I got a chance to spend a bunch of time with clients of ours. And it is very clear that what we are doing for these clients is increasingly important to them. If you look at the results that we shared in a couple of the case studies that I called out in my comments just a while ago, you can see we are delivering real bottom-line results for the benefit of these clients.\n\nYou talk about the benefit from more self-service, the benefit from more payment plans, more collections against payment plans. All of that is a real win for our clients.By the way, it's also a win for those patients for whom we're providing an affordability solution. So I think of this as really being a structural imperative in the healthcare business that they have to be good at this patient responsibility portion of collections, and that's really what we do for them. So we're very focused on just delivering great results for the clients, more personalization, more optimization of the delivery of our capabilities.\n\nAnd like I mentioned in my comments a couple of minutes ago, feeling good about the team's signings and go-lives that are happening as we speak.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nOur next question comes from the line of Dan Perlin with RBC Capital. Please proceed with your question.\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nThanks. Good evening, guys. I just had a question around travel for a second. Obviously, incredibly strong, and it sounds like, Mike, you were talking about extensions of seasons and things of that nature.\n\nThe question that I have is travel is probably the most cyclical business that you have to deal with. And I'm wondering, when you look at your pipeline of business and deals that are in that category, do you feel like that's deep enough and strong enough to the extent that if travel were to slow, more in the near term, you have enough incremental net new business that would be like this countercyclical overlay to that segment?\n\nMike Massaro -- Chief Executive Officer\n\nDan, this is Mike. So I'll tell you a couple of things. The pipeline acceleration in travel has been really, really good and strong. Also, remember the three subsectors, whether it's tour operators, destination management companies and accommodations.\n\n-- they all have the similar profile to what we've talked about in our education business with having geographic diversity and subsegment diversity. Meaning you can, for instance, have traction in certain types of tours in Europe and then find those same types of tours happening in other parts around the world as you prove out a subsegment. And then also, we've just proven the ability to expand into geographies. So by hiring fly mates to target certain countries or geographies that are from those areas and have knowledge around the travel industry, we've proven our ability to accelerate pipeline there.\n\nSo we feel really good about not only the monthly and quarterly sign rates, but where we finished the year what that could mean for ARR. And then, I just also highlight COVID is probably certain parts of education, but COVID are still going through that rolling recovery that we've talked about. Geographic travel markets like Japan have just opened. I actually flew through Japan, regret, I didn't get a chance to spend time with our Flymates in Japan because of the travel restrictions hadn't been lifted by a few days from when I went through my way to Singapore.\n\nBut that market is now open, and you've got a big winter season coming and you have the first time them being able to welcome back tours from all over the world. And so, that's happening throughout Asia, similar to how it happened in Europe over last summer. So I think that also provides us great confidence as we go into 2023, not only the signing, the scaling of our go-to-market team I called out some great pipeline work that our marketing team has done to help us target these subsectors in new geographies and get to revenue very, very quickly. So we feel really good about where we're going to finish the year in travel and really great about where we think it's going to go in '23.\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nYes. That's awesome context. Just another quick one. You talked about domestic education payments volumes doubling and you talked about Columbia as a new win.\n\nI guess my question there is really, how did you get them across the goal line? To me, it seems like a pretty obvious sale -- but I'm sure that's a much more challenging proposition than I'm probably giving a credit to. But that's a huge client for you guys to have that win with. So I'm wondering what that process maybe went through how long it was. And then, when we think about penetration rates within your book of business, is there a way for us to start to scale that over time? Or is it still a little too early to give that KPI out?\n\nMike Massaro -- Chief Executive Officer\n\nSo obviously, Colombia is a great win. You've heard us talk about some of the other great ones in education over the course of the past few calls. We've talked about Texas A&M. We've talked about Stanford and others.\n\nAnd really, for each of these, where we tend to be replacing an incumbent provider, certainly in the case of Colombia, there's a long-standing solution there that we're replacing. So what I think is at the root of this is while it's not easy to replace an incumbent provider, the value proposition we have is very compelling, and that's what's allowing us to be successful and move these major clients onto our platform. And as word gets out that the value that we're delivering, including some of the things we talked about in the past like for Texas A&M, that work does get out and it makes it easier to continue to get into these conversations with more and more schools. So we are working to accelerate the pace of that.\n\nWe've got more things coming that we'll be sharing. And it's a great market opportunity. It's a revenue multiplier for every one of these that we win, and we'll be focused on trying to grow that number very much the case for 2023.\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nThank you so much.\n\nMike Massaro -- Chief Executive Officer\n\nThanks, Dan.\n\nOperator\n\nOur next question comes from the line of John Davis with Raymond James. Please proceed with your question.\n\nJohn Davis -- Raymond James -- Analyst\n\nGood evening, guys. Mike, I was just -- I appreciate all the color on FX. But if I look at it, we basically -- I just want to check my math here. We went from 500 basis points for the full year to maybe 700 basis points an incremental $2 million in 3Q and 4Q.\n\nSo versus where we were in August, we have about an incremental $4 million of FX headwind. Is that fair?\n\nMike Massaro -- Chief Executive Officer\n\nJohn, good to hear from you. I would suggest that over the course of the quarter, the aggregate for the three months is $5 million. I don't -- I'm not going to break it down by monthly because I don't have the information in front of me, but that would be the number that I'd be confident this sharing.\n\nJohn Davis -- Raymond James -- Analyst\n\nOK. And then, just on monetization rate to follow up on Darrin's question. Do you guys benefit at all or how material is FX volatility? Do you have ability to increase spreads there? Was that part of the better-than-expected monetization rate this quarter?\n\nRob Orgel -- President and Chief Operating Officer\n\nSo in terms of FX rates, that's not really part of the spread calculus. When we talk about spreads, the key point being that we've maintained steady spreads over the past couple of quarters continue to have good spreads again in the most recent quarter, but FX is not ultimately a pro or con in that evaluation.\n\nMike Massaro -- Chief Executive Officer\n\nYes. And J.D., if you're talking about more pricing leverage, I would just highlight that, obviously, there's -- that opportunity is there, both on the transactional and on the platform side from a pricing lever perspective. It's not something that we pull that lever very often. There's always optimization happening.\n\nBut obviously, it's a future lever we could choose to pull but not something that's our current focus.\n\nJohn Davis -- Raymond James -- Analyst\n\nOK. And one last question for me. Mike, have you guys helped us size China at all as a percentage of revenue? Just obviously, lots of questions and focus on the China these issues and understanding you India and some other regions are helping offset and schools will flex their geographic mix depending on these type of issues. But just a lot of questions we get anything you can help us with as far as like how big China is as a percentage of overall revenue?\n\nMike Massaro -- Chief Executive Officer\n\nYes, sure, J.D. So what I'd tell you is, obviously, India is overtaking China. So obviously, that dynamic has changed and that frankly has that varies even by country of destination. There's different countries that drive based on where the students are going and they have students coming from different populations.\n\nWhat I can tell you about China is, even if you were to make the assumption that China stays flat, we still feel pretty confident about our growth trajectory that we talked about and maintaining that 30-plus percent growth. So again, I can't tell what the future holds, lots of dynamics going on in that macroeconomic environment. But as I said, we continue to grow even in Q3 within that China corridor and feel good and feel like we can navigate it going forward.\n\nJohn Davis -- Raymond James -- Analyst\n\nOK. Appreciate all the color. Thanks, guys.\n\nOperator\n\nOur next question comes from the line of Jason Kupferberg with Bank of America. Please proceed with your question.\n\nTyler DuPont -- Bank of America Merrill Lynch -- Analyst\n\nGood afternoon, everyone. This is Tyler DuPont on for Jason. Just to start, can you maybe spend a minute or two just parsing out the different growth in volume trends across both the verticals and geographies that you've seen during the quarter? I know education is seasonally very strong, but just any additional insights there on where both revenue growth and volumes are coming from, both looking at Q3? And then also, if you have any insight in the next quarter, that would be helpful.\n\nMike Ellis -- Chief Financial Officer\n\nYes. So as we've talked about, we've seen growth both in education and travel, which really drove the great results that we can share for this quarter. We do not disclose growth rates or revenue numbers on a vertical-by-vertical basis. It's not how we run the business.\n\nBut we're happy to take another question as it relates to this.\n\nTyler DuPont -- Bank of America Merrill Lynch -- Analyst\n\nSure. Yes. And I guess, just building off that as well. Regarding just recent M&A, just can you provide an update on the success of integrating Cohort Go into the education business? And just how you think about incremental tuck-in acquisitions more broadly, whether or not there is certain inorganic revenue contribution guidepost you thinking about? Or just how Cohort Go is done? And then, just how you're thinking about acquisitions more broadly?\n\nMike Massaro -- Chief Executive Officer\n\nSure, I'll take that one. Thanks for the question, Tyler. So we continue to have the three pillars that we've talked about before, just broadly in M&A, does it accelerate a geography or an industry that we're in, does it add a new capability that can help drive NRR or additional revenue streams. And then the third, and I've often said potentially less likely is do we expand into a new vertical market or geography through acquisition.\n\nSo those pillars continue to remain strong. Frankly, we think our M&A muscle has -- is quite strong as a company. If you look at not only the two deals we did here but a deal as a private company that was quite sizable as well. We feel like we're good at identifying, we're good at negotiating, we're good at executing on the integration.\n\nAnd so, we look at this market and continue to be active as we have been. The Cohort integration is going quite well, not only from a people team perspective, the decisions being made by the team, the consolidation of both the great work our team has done around agent solution, as well as what the Cohort team brought to us as additional capabilities and really making great decisions on those and executing with urgency and with customers in the forefront. So feel really good about that. Frankly, I sitting here only a few months from having done the deal in saying that I could see us being ready for another deal.\n\nThat's how I feel it's going quite well. I would say the other part of your question was just what are we looking for in a deal. Obviously, we have a pretty solid growth rate and feel really good about our organic growth ability. And so, when we look at something, we got to find something that we think can be accretive to that.\n\nThere's lots of businesses out there that can't be accretive to that. And so, that's something we take into account. And then obviously, as well, we have a good EBITDA -- adjusted EBITDA profitability series of numbers and a lot of companies out there in the market don't have those. And so, we got to look at both growth and we've got to look at profitability and economics.\n\nAnd most importantly, we've got to look for team and culture fit. So we're a bit picky. We're disciplined, but it's something that we're going to continue to do and feel like I said, we've proven we can do it well and execute.\n\nTyler DuPont -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks. That's great to hear. Appreciate the insight.\n\nOperator\n\nOur last question comes from the line of Joel Riechers with Truist. Please proceed with your question.\n\nJoel Riechers -- Truist Securities -- Analyst\n\nHi, guys. You hear me, OK?\n\nMike Massaro -- Chief Executive Officer\n\nYes. Hearing great.\n\nJoel Riechers -- Truist Securities -- Analyst\n\nGreat. This is Joel Riechers on for Andy Jeffrey. And I know last August, I think somebody mentioned that international student rates were something like 15% of the 29 levels, and it sounded like started to recover a bit in 3Q. And going into 2023, and I guess even 4Q, can you guys help us understand how you view the cadence of recovery there and how we should be thinking about a potential revenue lift? I understand you did just say that you don't really feel comfortable giving any vertical-specific growth rates, but just any additional color there for how we should be thinking about recovery would be really, really helpful.\n\nMike Massaro -- Chief Executive Officer\n\nYes, Joel. So what I would tell you is, again, obviously, I didn't know back around the IPO time how true this statement would actually be. But we expected a rolling recovery, and I think you're seeing that to an extreme across all our industries and across geographies, where there are different origination markets, China being a good example. There's different destination markets, Australia being a good example, where things are opening up or getting back to pre-pandemic levels at various rates.\n\nAnd then, I think you have lots of different geopolitical macroeconomic reasons for changes or shifts in movement. And so, again, the best thing I can tell you is if you go back and look over the last 20 years of international student enrollments, they've consistently gone up. You get to neutralize obviously for the pandemic and some of the drop you've seen there. But again, I think it is unlikely you're going to see that number go down over time.\n\nIt's going to likely build back up to a pre-pandemic level. Whether it does that in '23 or whether that's '23 and '24, I think will vary in relation to probably some of the more macroeconomic trends out there. Will it get all the way back there in '23 or will it be over '23 and 24? I think we're not making any huge growth assumption that is baked into our 2023 planning process that we're in now. So we're going to expect a steady return to pre-pandemic levels and then a decade-long increase similar to the past two decades for international student enrollment.\n\nJoel Riechers -- Truist Securities -- Analyst\n\nGreat. Super helpful. And then, I guess just one last final one, and I apologize if I missed this. But if I remember correctly, you guys should be lapsing the loss of one healthcare client and finish onboarding about two additional ones this year, which I think you said would be contributing in the second half of the year.\n\nIs the healthcare pipeline still very robust, still feeling good about that?\n\nRob Orgel -- President and Chief Operating Officer\n\nYes, Rob here. Exactly right. So doing well in healthcare with both signings and go-lives and that one will lap at the end of Q4. And so, you'll start to see more and more growth coming out of the healthcare vertical for us.\n\nJoel Riechers -- Truist Securities -- Analyst\n\nThank you, guys. And again, congrats on the quarter.\n\nRob Orgel -- President and Chief Operating Officer\n\nAppreciate that. Thanks.\n\nOperator\n\nThere are no further questions in the queue. I'd like to hand the call back to management for closing remarks.\n\nMike Massaro -- Chief Executive Officer\n\nI know we've run over. I appreciate everybody staying on. I just really want to thank everybody for the continued support of the business, and I appreciate everybody for their time today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAkil Hollis -- Vice President, Financial Planning and Analysis\n\nMike Massaro -- Chief Executive Officer\n\nRob Orgel -- President and Chief Operating Officer\n\nMike Ellis -- Chief Financial Officer\n\nBob Napoli -- William Blair and Company -- Analyst\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nWill Nance -- Goldman Sachs -- Analyst\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nJohn Davis -- Raymond James -- Analyst\n\nTyler DuPont -- Bank of America Merrill Lynch -- Analyst\n\nJoel Riechers -- Truist Securities -- Analyst\n\nMore FLYW analysis\n\nAll earnings call transcripts"
}