{
  "companyName": "Avid Bioservices, Inc.",
  "companyTicker": "CDMO",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/06/avid-bioservices-inc-cdmo-q1-2023-earnings-call-tr/",
  "content": "Avid Bioservices, Inc. (CDMO -1.15%)\nQ1 2023 Earnings Call\nSep 06, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to the Avid Bioservices first quarter fiscal 2023 financial results conference call. [Operator instructions] As a reminder, this call may be recorded. I would now like to hand the conference over to Tim Brons of Avid investor relations group. Please go ahead.\n\nTim Brons -- Investor Relations\n\nThank you. Good afternoon, and thank you for joining us. On today's call, we have Nick Green, president and CEO; Dan Hart, chief financial officer; and Matt Kwietniak, Avid's chief commercial officer. Today, we will be providing an overview of Avid Bioservices contract development and manufacturing business, including updates on corporate activities and financial results for the quarter ended July 31, 2022.\n\nAfter our prepared remarks, we will welcome your questions. Before we begin, I would like to caution that comments made during this conference call today, September 6, 2022, will contain certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 concerning the current belief of the company, which involves a number of assumptions, risks and uncertainties. Actual results could differ from these statements, and the company undertakes no obligation to revise or update any statement made today. I encourage you to review all of the company's filings with the Securities and Exchange Commission concerning these and other matters.\n\nOur earnings press release in this call will include discussion of certain non-GAAP information. You can find our earnings press release, including relevant non-GAAP reconciliations on our corporate website at avidbio.com. With that, I will turn the call over to Nick Green, Avid's president and CEO.\n\nNick Green -- President and Chief Executive Officer\n\nThank you, Tim, and thank you to everyone who has dialed in and to those who are participating today via webcast. I am pleased to report that the momentum and growth achieved during fiscal '22 continued into the first quarter of fiscal '23. During the period, we achieved the highest quarterly revenue in the company's history. In connection with this achievement, our commercial team had another exceptional quarter, signing multiple new project agreements and as a result, pushed our backlog to a new record level.\n\nWith respect to our facilities, our expansion work continues to progress according to schedule. During the first quarter, we initiated equipment validation in our Myford South facility and continue to advance construction of our cell and gene therapy facility, which included launching our analytical and process development capabilities for this business. During the period, we also announced the expansion of our process development capabilities for the mammalian cell business, which we expect to come online in Quarter 1 of calendar 2023. Matt and I will provide additional details on the business development and operations for the period following an overview of our first quarter fiscal '23 financial results.\n\nAnd for that, I'll turn the call over to Dan.\n\nDan Hart -- Chief Financial Officer\n\nThank you, Nick. Before I begin, in addition to the brief financial overview I'll provide on the call today, additional details on our first quarter fiscal '23 financial results are included in our press release issued prior to this call and in our Form 10-Q, which was filed today with the SEC. I'll now provide an overview of our financial results from operations for the first quarter ended July 31, 2022. Revenues for the first quarter of fiscal '23 were $36.7 million, representing a 19% increase, compared to $30.8 million recorded in the prior-year period.\n\nThe increase in revenues for the quarter can primarily be attributed to an increase in manufacturing revenues as compared to the prior-year period. Gross margin for the first quarter of fiscal '23 was 25%, compared to a gross margin of 37% for the first quarter of fiscal '22, which benefited from the receipt of unutilized capacity fees of $3.3 million. Factors impacting the gross margin for the first quarter of fiscal '23 were primarily from increases in costs associated with the growth of our business and our facility expansions, including compensation and benefit expenses, as well as increases in facility and related expenses, partially offset by higher revenues during the period. Given our ongoing expansions, we believe that margins may continue to be affected in the coming quarters.\n\nExcluding the prior year's margin benefit from unutilized capacity fees and the current quarter's increase in costs associated with the establishment of our cell and gene therapy business and ahead of our mammalian capacity expansion, including the company's increasing headcount and incremental depreciation from recently released facility extensions. Our first quarter gross margin was on par with the same period of the prior year. Total SG&A expenses for the first quarter of fiscal '23 were $6.4 million, an increase of 42%, compared to $4.5 million recorded in the first quarter of fiscal '22. The increase in SG&A for the quarter was primarily due to compensation and benefit expenses, facility-related expenses and legal and accounting fees.\n\nFor the first quarter of fiscal '23, the company recorded net income of $1.6 million or $0.03 per basic and $0.02 per diluted share, which for the first time starting in fiscal '23, includes the provision for income taxes as reported within the company's income statement, as compared to a net income of $6.3 million or $0.10 per basic and diluted share for the first quarter of fiscal '22. For the first quarter, the company achieved an adjusted EBITDA of $6.2 million. The adjusted EBITDA increased 5% sequentially over the fourth quarter of fiscal '22. Our cash and cash equivalents on July 31, 2022 were $115.1 million, compared to $126.2 million on April 30, 2022.\n\nThis concludes my financial overview. I'll now turn the call over to Matt for an update on commercial activities during the quarter.\n\nMatt Kwietniak -- Chief Commercial Officer\n\nThanks, Dan. I am pleased to report that during the first quarter, our commercial team continued to be highly productive. As discussed during the last call, over the last few months, we have made substantial changes to our commercial organization, including the doubling of the size of our sales team, with additions in both our mammalian and our cell and gene therapy businesses. This new team is working exceptionally well together and focusing on ensuring Avid's continued growth and success.\n\nDuring the quarter, our team signed $41 million in new project orders with a significant portion coming from new customers. As a result of this performance, Avid's backlog again reached a new company high, ending the quarter at $157 million. This backlog represents a 43% increase, compared to the backlog of $110 million at the end of the first quarter of fiscal 2022. We expect to recognize most of our current backlog over the next 12 months, and notably, this backlog contains no COVID-related business.\n\nWe believe that our success in bringing multiple new customers to Avid during the quarter validates both the investment in our new team, and the execution of our commercial plan. Our strategy prioritizes the leading biotechnology regions in North America, and we continue to expand our outreach and presence in these key markets. Our team is active at conferences and is working to promote our industry experience with single-use technology, regulatory matters, as well as clinical and commercial manufacturing. In summary, I am very pleased with the commercial results for the quarter.\n\nOur new business wins were strong, further expanding and diversifying our client base, and the company ended the quarter with its highest backlog to date. We believe this showcases the talent of our team and the promise of our strategy, which we expect to continue to drive the company's growth. This concludes my overview of commercial activities for the quarter. I will now turn the call back over to Nick for an update on operations and other achievements during the period.\n\nNick Green -- President and Chief Executive Officer\n\nThanks, Matt. Following a very strong fiscal '22, the first quarter of fiscal '23 established a new high. As outlined by Dan and Matt, during the period, we achieved both the highest quarterly revenue and the highest backlog ever in the company history. This was driven by our commercial team's success in attracting new business, as well as the exceptional performance of our manufacturing and operations teams and consistently delivering high-quality products on time to our customers.\n\nAs most of you are aware, the company is midstream in a broad expansion of our facilities and capabilities. This new capacity is intended to attract new customers, as well as support existing customers as their programs continue to mature. During the period, the expansion work for both our mammalian and our cell and gene therapy businesses advanced according to plan. During the first quarter, the company achieved an important milestone with respect to our cell and gene therapy expansion with the launch of our analytical and process development capabilities for this business.\n\nThis opening marks the first of our cell and gene therapy capabilities to come online, and we believe it positions us well to begin engaging with prospective customers who are now able to see the exciting business coming to life. Construction of our cell and gene therapy GMP suites continues on schedule, and we expect them to be completed in mid-calendar 2023. Given our current discussions with prospective customers, we believe the opening of these suites will be well-timed given the analytical and process development work that we are now anticipating and the potential for these programs to advance the GMP suites shortly after they are completed. Turning now to our mammalian cell business.\n\nWe are very pleased to announce the recent appointment of Prem Patel as vice president, process development. Dr. Patel is an accomplished biopharmaceutical executive with more than 30 years of experience and a track record of success in developing manufacturing proceeds or clinical trial material and commercial supplies. His career is highlighted by extended tenure supporting research, development and manufacturing activities at GSK and Bristol-Myers Squibb.\n\nWe are delighted to have Prem join our team. And in addition to this technical acumen, we are excited to have as a new member of our senior team someone with intimate knowledge of how our customers see Avid's offering. We believe this perspective can only further enhance our customer-centric offering and the behaviors that support that goal. With respect to our mammalian cell business facilities, we have come a long way, and are fast approaching the finishing line with respect to our ongoing expansions.\n\nThe second phase of this project is ongoing, and we remain on track to have Myford South expansion complete by the end of Quarter 1 calendar 2023. The manufacturing suites in Myford South are nearing completion and equipment has already been put in place. In fact, as we speak, much of the downstream equipment has been located in the facility and validation of this equipment is already underway. During Quarter 2, we expect to receive much, if not all, of the upstream equipment, which will in turn be added to the schedule in terms of getting it ready for operational release.\n\nA few weeks ago, we also announced the -- another expansion of our process development capacity to provide additional space to onboard future clients ultimately seeking to utilize the new Myford capacity. This expansion is now underway, and we anticipate both of these expansions to be complete somewhere during the first quarter of calendar 2023. Undertaking this scale of expansion has been no small thing. It has and continues to require close coordination and execution by numerous vendors, partners, local agencies as well as our internal team.\n\nI would again like to mention that despite all of the potential for disruption, our team has continued to perform diligently and are now not only delivering the state-of-the-art facilities on time, but are also maintaining the delivery of product to the highest standards with respect to quality, yield and schedule, which is something Avid clients have come to expect. I continue to be impressed by our incredible employees across all areas of the business, and I am grateful for their dedication and reliably excellent performance. As we continue to expand, so too will our team. We anticipate continuing to increase our headcount in the fiscal year-end to both stand up and appropriately staff our new capabilities and capacities.\n\nAs Dan stated earlier, these expenses, current and future continue to place pressure on our margins. However, we do believe that this downward pressure is temporary. Importantly, we are delighted to be in a position to bring online new capacity to support the continued growth of the business. As we start to fill this capacity, we believe that our margins will be restored and further strengthen as the capacity utilization increases.\n\nIn the near term, it is also important to note that as usual in fiscal Quarter 2, we will undertake the company's annual maintenance shutdowns, which will result in reduced available capacity for the quarter. Once complete, this will, of course, be restored throughout the rest of the year. I am also pleased to report that during this month, we will be vacating the Michelle corporate office and relocating personnel to the new office space in the Myford facility. This space is larger than our current location, and I'm excited at the prospect of being able to bring most of our operations and administrative teams together in a single location.\n\nIn closing, I wish to reiterate how pleased I am with the progress achieved on all fronts during this quarter. Both top-line revenues and backlog hit new company highs, a clear extension of the growth trajectory established in fiscal 2022. Our commercial development team continues to execute, signing new orders for $41 million during the quarter and expanding our organizational outreach and visibility throughout North America. And finally, our facilities and capabilities expansions continue to advance according to the schedule.\n\nAs a result, we feel optimistic about the future and look forward to delivering value to our clients, and in turn, putting the new capacity we will soon have available. This concludes my prepared remarks for today, and we can now open up the call for questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Sean Dodge of RBC Capital Markets. Mr. Dodge, your line is open.\n\nThomas Kelliher -- RBC Capital Markets -- Analyst\n\nHey, good afternoon, this is Thomas Kelliher, on for Sean. Thanks for taking the questions. So starting off on bookings and congrats to the commercial team on another strong quarter. It still doesn't appear that you are being materially impacted by a slowdown in biotech funding.\n\nIs this an accurate assessment? Or have you seen any changes in selling activity or time lines or anything like that since the close of the quarter?\n\nMatt Kwietniak -- Chief Commercial Officer\n\nThis is Matt. I'll take that. We're seeing a little bit of a blip in the summer, but I think the positive around that is it's actually a higher rate of issuance versus prior year. So I guess, to answer the question in a typical summer slowdown, but improved performance over prior years.\n\nI think, we're encouraged really in the last few months, issuance has consistently been strong both in count as well as dollars.\n\nThomas Kelliher -- RBC Capital Markets -- Analyst\n\nOK. That's helpful. And then, can you guys talk a little bit about the visibility you have on the fiscal 2023 guidance? I know you reiterated the revenue. Have there been any changes in terms of quarterly cadence or maybe mix of revenue coming out of backlog versus your initial outlook? Can you hear me, Matt?\n\nMatt Kwietniak -- Chief Commercial Officer\n\nYeah, go ahead.\n\nThomas Kelliher -- RBC Capital Markets -- Analyst\n\nCan you hear me?\n\nMatt Kwietniak -- Chief Commercial Officer\n\nYeah, Nick, we can hear you.\n\nNick Green -- President and Chief Executive Officer\n\nSorry about that. We've had some technical difficulties there. I apologize for that. Can you just reiterate the question again there, sorry?\n\nThomas Kelliher -- RBC Capital Markets -- Analyst\n\nYes, sure. I was just wondering if you could talk a little bit more about some of the visibility you have on the 2023 revenue guidance. And if there are any changes you'd like to note around quarterly cadence or how much of the revenues coming out of the backlog versus the previous outlook?\n\nNick Green -- President and Chief Executive Officer\n\nYeah, I think, backlog, frankly, is the -- sorry, the outlook for the full year remains pretty much where we were last quarter or at the beginning of this financial year. Obviously, we've had a good start to the year, which is not totally uncommon. We've seen, I think, as I just heard Matt a good uptick in comparison with last year in terms of the same period, in terms of the proposals. And obviously, we've seen an increase in backlog over both the last quarter and quite a significant one over the prior year.\n\nSo all of those remain on track for affirming the guidance that we had. I think, as I mentioned at the beginning of the year, obviously, there's a lot of turmoil in the world. And we've, obviously, seen reduced investment into biotech and the like. And that always provides some degree of concern for the whole year.\n\nBut what we -- what we've seen so far is that at least in the case of Avid, the value proposition seems to be maintaining its attraction to the marketplace and continuing the interest. As I mentioned, obviously, during the -- during my prepared remarks, we do have the shutdown coming up this year -- this next quarter, which, obviously, means our capacity is lower for the quarter, which typically, we end up with a lower revenue in the second quarter and then, obviously, pick our way back up to complete the full year in Quarter 3 and 4. But at the moment, no reason to have any concerns of where we feel the year will end up as we were from three months ago.\n\nThomas Kelliher -- RBC Capital Markets -- Analyst\n\nAll right. Great. Thank you very much. That's all for me.\n\nNick Green -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. our next question comes from Jacob Johnson of Stephens. Your line is open.\n\nJacob Johnson -- Stephens Inc. -- Analyst\n\nMaybe a question on the cell and gene therapy side. With the PD lab there now online, when you started thinking about the CGMP manufacturing coming online next year, kind of maybe -- one kind of latest thoughts on business development trends, now that the PD lab is open. And number two, kind of any thoughts around the business model here? Are customers coming to you already looking to book suites? Would you be interested in suite reservation fees or something like that? Just kind of thoughts around the business model for cell and gene therapy and business development trends there.\n\nNick Green -- President and Chief Executive Officer\n\nYeah, Jacob, it's, obviously, a brand-new business for us. And we literally brought on the AD and PD capacity, literally a few weeks ago. And I am delighted to say that we actually have already signed our first client. So that's -- I think, in any new business, finding your first client is always the hardest.\n\nAnd we've already completed that one. So hats off to the team in achieving that. And again, that kind of -- we are in numerous discussions with other parties. I think, as I mentioned again last quarter, it's always good to have the facility there, even if it's not all of it to actually be able to showcase what we've got and obviously, the people that are employed in delivering those services.\n\nSo our reservation fees, I mean, our business always has a form of reservation fees in the structure of our agreement. So yes, we will be looking to design new business and sort of want of a better word reservation fees or deposits against that and start building some analytical and process development capabilities ahead of bringing the GMP suites on at the middle of the next calendar year.\n\nJacob Johnson -- Stephens Inc. -- Analyst\n\nGot it. Thanks, Nick. And then, just to follow up, on the expense side of things, Nick, you mentioned you're continuing to hire and continuing to add to headcount. Yeah, as we think about that, certainly, some of that headcount is going to go to the actual manufacturing facilities, and I think, impact gross margins.\n\nBut maybe kind of comments on increasing head count as it relates to gross margin impact and then also on the SG&A side of things.\n\nNick Green -- President and Chief Executive Officer\n\nYeah, I mean, I'll hand it over to Dan in a second but -- if he wants to add anything. But I mean, very simply, we're bringing on quite a significant amount of capacity, the analytical development and process development we just talked about in gene cell therapy. Obviously, in order to attract the client, having an empty building is not going to cut it. So we, obviously, brought on the staffing that we're able to win that business and obviously, are in discussions and preparing proposals for other business.\n\nSo those are some of the costs that come online. And equally, in the mammalian business, we've got a significant bolus of capacity coming online in January or Quarter 1 rather of calendar '23. And we've got to start staffing up to ensure that we can utilize that capacity. Again, very encouraging signs with quarter-over-quarter backlog, up 40%.\n\nI think, it was with -- that Matt alluded to. And I think, in terms of the -- no surprise to anybody, I don't think that the margins are tighter as a result of bringing that cost of capability online and the people to run it. What was very encouraging was the comment that Dan had made, I think, which is that if you take off the capacity fees from last year and the cost associated with that, then our margins are continuing to remain pretty much on a path. So that as we've always felt, I think, the business model we approved last year and the year before, quite clearly works.\n\nBut you can't build new capacity and not staff it without spending some money. And that's exactly what we've done. We built it because we thought we could find new customers. And again, our backlog is ahead of, but significantly from where it was last year.\n\nSo again, all in line with what we were hoping to see.\n\nOperator\n\nThank you. Our next question comes from Matthew Hewitt of Craig-Hallum. Your line is open.\n\nMatt Hewitt -- Craig-Hallum Capital Group -- Analyst\n\nCongratulations on the strong quarter. Maybe -- and this is, I guess, maybe a little bit more high level, but what do you think is the driving force behind the success that you're having with new customer wins? Is it the excess capacity that you're bringing online? Is it your process and analytical development teams and the ability to kind of work hand in hand with those teams? What is the driving force there? \n\nNick Green -- President and Chief Executive Officer\n\nMatt, I think, it's a number of factors. I think, there's no question about it. I think, investing ahead of time, I've said this all along is that most of our clients, I believe, time line is a critical success factor for them. And so, you can have all the best offerings in the world.\n\nBut if you haven't got a bioreactor available for them, it's not what's used in maintaining time line. So we've proactively gone and invested in that capacity to make sure that our existing clients don't have to -- I don't have to turn around to an existing client and let them know that we're going to delay their next clinical phase because we haven't got a bioreactor available. In fact, quite the opposite, we always have that. So that's one critical one.\n\nI think, another fundamental which for me is paramount in this industry is the quality track record and the GMP manufacturing experience. Avid has got 18 years of manufacturing commercial drug substance. And that's one of the longest out there and the quality team do a super job of ensuring that we do -- we manufacture that commercial product at the highest standards. So I think, that's another significant attribute.\n\nAnd then, this is a really sort of boring, but essential thing, which is delivering product on time, in-full, in-spec, day in, day out. Internally, we have a phrase we're only as good as the last batch. And we continue to focus on making every single batch the best we possibly can. I think, the teams have been doing a super job in execution.\n\nAnd ultimately, clients like their product delivering on time in-full, in-spec. And word gets around that that's what you get when you're going to Avid. So we could do that. So it's a combination of a whole host of factors, and I could probably go on with at least half a dozen other elements that make that -- but the guys are just doing a really good job of delivering on their promise.\n\nMatt Hewitt -- Craig-Hallum Capital Group -- Analyst\n\nThat's really helpful. And then, maybe a follow-up question for Matt. I think, you mentioned in your prepared remarks that you've doubled the size of the sales team. Could you remind us what the size of that team is today and whether or not you plan to add any more headcount to that group, like say, over the remainder of the year?\n\nMatt Kwietniak -- Chief Commercial Officer\n\nYeah, I think, we're rightsized for now. Currently, we have three in the mammalian side and then another one focused on the cell and gene therapy. \n\nMatt Hewitt -- Craig-Hallum Capital Group -- Analyst\n\nGot it. All right. Thank you so much.\n\nOperator\n\nThank you. Our next question comes from Paul Knight of KeyBanc. Your line is open.\n\nPaul Knight -- KeyBanc Capital Markets -- Analyst\n\nThis question has kind of been asked around a bit. But the analytical and process development expansion that you're talking about, is that a necessary to win business? Or does that make the likelihood of winning business higher? \n\nNick Green -- President and Chief Executive Officer\n\nI mean, I think, it's an essential element. Most projects require analytical -- a large component of analytical in that space. And obviously, process development as well, a lot of people are building projects for -- or coming with projects for preclinical, clinical manufacturer. And developing the process and refining the process is a key element of that.\n\nSo that's kind of the onboarding component of the business where things normally start. And then, obviously, as one hones down the process and have something that you can scale up to GMP, it moves into the GMP suite. So it's an essential component of the business that -- where clients come onboard there, Paul.\n\nPaul Knight -- KeyBanc Capital Markets -- Analyst\n\nAnd then, lastly, did the experience that customers went through during COVID create more demand for single-use technology?\n\nNick Green -- President and Chief Executive Officer\n\nIt's a good question. I'm not -- I think, it's a difficult one to -- I mean, there's certainly an increased demand for single-use technology during COVID. I would put that as much based on the fact that finding the disposable components throughout the industry during the last two years has been extremely tight, considering -- and that's just about in every component of disposable at some point during that period. So it had to have an enormous impact.\n\nIn terms of the search for our mammalian cell requirements in the disposable, I don't think it's as big as one might look at. For example, fill finish every vial no matter what the therapy was probably put -- every product no matter what the therapy was put into vial during COVID. But not every therapy required mammalian cell culture to manufacture it, in fact, very few. So relatively speaking, to the amount of vaccine that was actually delivered out there.\n\nSo yes, a large increase in the demand for disposable, but not so much in the same demand for mammalian activities as it was on the equipment. \n\nPaul Knight -- KeyBanc Capital Markets -- Analyst\n\nOK. Thanks.\n\nOperator\n\nThank you. I'm showing no further questions at this time. I would like to turn the call back over to Nick Green, CEO, for any closing remarks.\n\nNick Green -- President and Chief Executive Officer\n\nThank you, operator, and thank you to everybody participating on today's call. In closing, I would like to thank Avid's customers, partners and investors for their ongoing collaboration. As always, I would like once again to acknowledge Avid's extraordinary employees, who together are driving the company's success. Thank you again for participating on the call, and thank you for your continued support of Avid Bioservices.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTim Brons -- Investor Relations\n\nNick Green -- President and Chief Executive Officer\n\nDan Hart -- Chief Financial Officer\n\nMatt Kwietniak -- Chief Commercial Officer\n\nThomas Kelliher -- RBC Capital Markets -- Analyst\n\nJacob Johnson -- Stephens Inc. -- Analyst\n\nMatt Hewitt -- Craig-Hallum Capital Group -- Analyst\n\nPaul Knight -- KeyBanc Capital Markets -- Analyst\n\nMore CDMO analysis\n\nAll earnings call transcripts"
}