{
  "companyName": "Calithera Biosciences",
  "companyTicker": "CALA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/calithera-biosciences-cala-q2-2022-earnings-call-t/",
  "content": "Calithera Biosciences (CALA 4.15%)\nQ2 2022 Earnings Call\nAug 15, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and welcome to the Calithera Biosciences second quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session. As a reminder, this call may be recorded.\n\nI would now like to turn the call over to Stephanie Wong, CFO. You may begin.\n\nStephanie Wong -- Chief Financial Officer\n\nThank you, operator. Good afternoon, everyone, and welcome to our second quarter 2022 conference call. Joining me today are Susan Molineaux, founder, president, and CEO; and Emil Kuriakose, chief medical officer. Earlier this afternoon, we issued a press release, which included an overview of our second quarter 2022 financial and operational results which can be accessed through our website at calithera.com.\n\nBefore we begin, I would like to remind you that today's discussion will include statements about our future expectations, plans, and prospects that constitute forward-looking statements for purposes of the safe harbor provision under the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by these forward-looking statements as a result of various important factors, including those discussed in the risk factors section of our periodic filings with the SEC. In addition, any forward-looking statements represent our views only as of today and should not be relied upon as representing our views as of any subsequent date. While we may elect to update these forward-looking statements at some point in the future, we specifically disclaim any obligation to do so even if our views change.\n\nPlease note that this call is being recorded. And with that, I'll turn the call over to Susan.\n\nSusan Molineaux -- Founder, President, and Chief Executive Officer\n\nThanks, Stephanie. Good afternoon, everyone, and thank you for joining us for today's conference call. When we spoke last quarter, I noted that Calithera was off to an exciting start in 2022, and I'm pleased to say that this momentum has continued in recent months as we work to advance our pipeline of investigational small molecule oncology compounds to address the needs of biomarker-defined patient populations. The most notable developments, of course, were the initiations and enrollment of the first patients in our phase 2 clinical trials of mivavotinib in relapsed/refractory non-GCB diffuse large B-cell lymphoma, or DLBCL, in June; and sapanisertib in relapsed/refractory NRF2-mutated squamous nonsmall cell lung cancer in the first week of July.\n\nWe remain on track to report data from both of these monotherapy studies by the first quarter of 2023 and look forward to sharing additional details along the way. Further updates on both programs were shared at the Pan Pacific Lymphoma Conference and the World Conference for Lung Cancer. At the Pan-Pacific Conference last month, Dr. Reem Karmali of Northwestern University presented a poster detailing the design of the phase 2 mivavotinib study.\n\nAnd just last week at World Lung, Dr. Jonathan Riess of UC Davis Comprehensive Cancer Center presented during a mini oral session the findings from an investigator-initiated multicenter phase 1/2 dose escalation study of sapanisertib in combination with telaglenastat in advanced nonsmall cell lung cancer patients. Preclinical studies have shown that combining telaglenastat and sapanisertib demonstrated synergistic antitumor activity. As you recall, we are not developing telaglenastat at this time.\n\nHowever, we are interested in this combination and look forward to the results of this investigator-initiated study. Emil will provide more details on these presentations in his remarks. We continue to believe that by focusing on well-characterized genetic vulnerabilities with molecules that have already shown single-agent activity, we will be able to generate phase 2 data with targeted efficient study designs such as those we are currently enrolling. We believe that these studies have the potential to lead us to efficient path to approval in biomarker-defined patient populations.\n\nTurning to our preclinical programs. We have continued to advance our pipeline of synthetic lethality targets, most notably VPS4A and VPS4B. And as you heard on last quarter's earnings call, we shared the first data from this program at AACR in April. We are continuing to advance multiple compound series through lead optimization and look forward to updating you on our progress as they advance toward first-in-human clinical studies.\n\nWe expect to provide further updates on our preclinical efforts by year-end. And with that said, I will pass the call over to Emil to provide additional details on our progress.\n\nEmil Kuriakose -- Chief Medical Officer\n\nThank you, Susan. Looking first at our clinical programs. In July, we announced the first patient enrolled to our phase 2 clinical trial of sapanisertib in relapsed/refractory NRF2 or NFE2L2-mutated squamous nonsmall cell lung cancer. As a reminder, the sapanisertib study is an open-label monotherapy study in patients with NRF2 mutated squamous nonsmall cell lung cancer whose disease has progressed on or after platinum doublet chemotherapy and immunotherapy.\n\nThe study is evaluating two doses of sapanisertib, two milligrams twice daily and three milligrams once daily in patients with squamous nonsmall cell lung harboring either wild type or mutated NRF2 as detected by next-generation sequencing. With this study, our goals are to refine dosing and confirm sapanisertib's selective activity in NRF-2-mutated tumors compared to wild type. The primary endpoints are investigator-assessed overall response rate and safety with secondary endpoints, including duration of response, PFS, and OS. We believe that the data from this study could position us to initiate a registrational study.\n\nAs Susan mentioned, earlier this month, dose escalation data from an investigator-led multicenter phase 1/2 trial combining sapanisertib and telaglenastat in biomarker-defined cohorts with patients with advanced nonsmall cell lung cancer represented at the 2022 World Conference on Lung Cancer in Vienna. In preclinical studies, combining sapanisertib and telaglenastat showed synergistic antitumor activity in KEAP or NRF-mutated nonsmall cell lung cancer. In the clinical trial, data on the first 13 patients in dose escalation shows that sapanisertib-telaglenastat combination was well tolerated and also showed encouraging early evidence of clinical benefit, including a partial response in one patient with NRF2 mutant squamous nonsmall cell lung cancer and stable disease with tumor shrinkage in a patient with KEAP1 and KRAS-mutated adenosquamous lung cancer. The investigators are continuing dose escalation with the combination to determine the final recommended expansion dose.\n\nUpon determination of the final recommended expansion dose, the study investigators plan to enroll patients into one of four expansion cohorts evaluating sapanisertib plus telaglenastat in squamous nonsmall cell lung with and without NRF2 or KEAP1 mutations and lung adenocarcinoma with KRAS and KEAP1 or NRF2 mutation. Now turning to mivavotinib. We are conducting an open-label monotherapy study in patients with relapsed or refractory non-GCB DLBCL. We're enrolling approximately 50 non-GCB DLBCL patients with or without MyD88/CD79B mutations, who will be randomized into one of two dosing cohorts: Continuous dosing at 100 milligrams QD; or an induction dosing schedule of 120 milligrams QD for 14 days, followed by 80 milligrams QD starting on day 15.\n\nThe objectives of this study are: To confirm previously observed single-agent activity in non-GCB DLBCL; determine activity in patients with MyD88 or CD79B mutated DLBCL, and further refine dose and schedule. MyD88 or CD79B mutation status will be determined using ctDNA-based liquid next-gen sequencing after randomization. The primary endpoints are safety and overall response rate as determined by independent radiology review, and secondary endpoints include duration of response, PFS, and complete response rate. Similar to sapanisertib, the results of this study could position us to initiate a registrational trial targeting accelerated approval in third-line DLBCL.\n\nAs Susan also noted, in July, we presented a trial and progress poster at the Pan Pacific Lymphoma Conference detailing the rationale and design of this phase 2 study based on a combined analysis of two prior studies of mivavotinib monotherapy in relapsed or refractory DLBCL. In these studies, mivavotinib has the recommended phase 2 dose of 100 milligrams q daily showed a compelling overall response rate of 53% with a median duration of response of 15.7 months in non-GCB patients. In addition to the monotherapy study, we plan to pursue combination strategies aimed at evaluating mivavotinib with novel and standard of care therapies in earlier lines of DLBCL and other lymphomas. We look forward to sharing additional details on these plans as we advance further.\n\nTurning to our preclinical development efforts. As Susan stated, we have continued to advance our pipeline of synthetic lethality targets. As a reminder, the data shared at the AACR annual meeting demonstrated a synthetic lethal interaction between gene paralog VPS4A and VPS4B, validating these as attractive targets in tumors that have lost either paralog. These data were the first preclinical evidence supporting a newly discovered series of compounds designed to target these proteins for cancer treatment.\n\nWe're currently advancing multiple theories to lead optimization and look forward to updating you on the program by the end of this year. With that, I'll pass it over to Stephanie for an update on our financials.\n\nStephanie Wong -- Chief Financial Officer\n\nThank you, Emil. An overview of our financial results were included in today's press release. I will briefly review our results on this call. Our cash and cash equivalents totaled $41.8 million at June 30, 2022, which we expect will be sufficient to meet our operating plans through the second quarter of 2023.\n\nR&D expenses for the second quarter of 2022 were $7.8 million compared to $12.8 million in the same period last year. The decrease was primarily due to decreases in the telaglenastat and CB-280 programs, partially offset by increases in the sapanisertib and mivavotinib programs. G&A expenses for the second quarter of 2022 were $3.6 million compared to $4.5 million in the same period last year. The decrease was primarily due to decreased personnel-related costs.\n\nOther income net for the second quarter of 2022 was $2.3 million, primarily attributable to the decrease in fair value of warrant liabilities. Net loss for the three months ended June 30, 2022, was $9.1 million. And with that, I will now return the call back over to Susan.\n\nSusan Molineaux -- Founder, President, and Chief Executive Officer\n\nThank you, Stephanie. And with that, operator, we're happy to open the line for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Jonathan Chang with SVB Securities. Your line is open.\n\nJonathan Chang -- SVB Securities -- Analyst\n\nHi, guys. Thanks for taking my questions. First question, can you discuss the rationale for the doses being evaluated in the sapanisertib phase 2 study? And how do those compare to what was used in the recently presented World Lung combination study as well as other prior studies?\n\nEmil Kuriakose -- Chief Medical Officer\n\nSure, Jonathan. Great question. So the rationale for the monotherapy dose schedule is primarily the extensive amount of data we had from the monotherapy trials that Takeda had conducted as well as extensive PK/PD modeling. And in brief, that showed that the doses of three milligrams to four milligrams, you avoided the dose-limiting toxicities of GI tox and your primary AE with hypoglycemia, which is very manageable and did not lead to discontinuation.\n\nAnd so we already also saw that aside from the safety profile, that that was an active dose in the study run by Paul Take. We're also evaluating two milligrams BID, again, based on the PK/PD and PK safety modeling, given that if GI tox are not Cmax related, that you can get to a higher cumulative dose of four milligrams with the BID schedule given that the drug has a half-life around six to seven hours. So you could get more exposure with the same safety profile. So that was the rationale for the monotherapy doses we're evaluating.\n\nIn terms of their combination data that's presented, they presented data on their first dose level, which is two milligrams QD combined with 800 milligrams BID of telaglenastat. So the starting doses are similar for sapanisertib. However, given that it's a combination with two drugs, each of which have their own unique safety profile, it's not exactly easy to extrapolate from combination safety data to the monotherapy. So we would consider those separate.\n\nJonathan Chang -- SVB Securities -- Analyst\n\nUnderstood. Makes sense. So maybe zooming out from the specific dosing question, what would you say are the key takeaways from the investigator study presented at World Lung with the sapanisertib plus telaglenastat combination? And what are the implications for your ongoing efforts?\n\nEmil Kuriakose -- Chief Medical Officer\n\nYeah. I think the main key takeaway given that it's still a small data set and dose escalation is that so far, the combination looks very tolerable. And we're especially encouraged by the early clinical activity we're seeing. We think it's at least even in the small numbers and a total proof of concept again that in NRF2-mutant squamous lung cancer patients had a partial response.\n\nSo definitely encouraging on both fronts from safety and efficacy. And from a wider angle, I think that data complements nicely with the monotherapy data as we generate that to provide potential development paths for both mono and combo.\n\nJonathan Chang -- SVB Securities -- Analyst\n\nGot it. And just one last question for me. I know you guys just started the phase 2 studies, but can you provide any color on at least the initial progress of those phase 2 studies for sapanisertib and mivavotinib? And just talk about your level of confidence that you guys will be able to provide meaningful updates by the first quarter of '23.\n\nEmil Kuriakose -- Chief Medical Officer\n\nRight. So we're not providing detailed interim enrollment updates. I mean I can tell you that we have started enrollment on both types are being activated and patients are actively being screened and enrolled. So again, as we said previously, given that we're really looking at populations where these two drugs have already shown single-agent activity, we have a short time to respond for both drugs, and we have a well-characterized safety profile.\n\nAnd these are the reasons we're still guiding to the data in first quarter of '23.\n\nJonathan Chang -- SVB Securities -- Analyst\n\nGot it. Thanks for taking my questions.\n\nEmil Kuriakose -- Chief Medical Officer\n\nSure. Thanks.\n\nOperator\n\n[Operator instructions] Our next question comes from Roger Song with Jefferies. Your line is open.\n\nRoger Song -- Jefferies -- Analyst\n\nGreat. Thank you for taking the question. Maybe just a follow-up on the phase 2 data readouts. Maybe can you just comment on the expectation for the data readouts given you started? And what will be the go-no-go decision criteria for the -- if you will have the first initial data readouts? And what will be considered as the winning scenario for the initial readout? Thank you.\n\nEmil Kuriakose -- Chief Medical Officer\n\nYeah. I mean, again, to reiterate the point on the fact that the data that we're expecting or our response data based on efficacy data that we already have a bar for based on previous data from both drugs in the specific biomarker-defined populations, we think that we are still on track in terms of getting to meaningful data by 1Q '23 based on the timing by which we started the enrollment and the rate at which we're opening sites. So aside from that, we haven't provided detailed guidance on exact numbers/go/no-go decisions. Beyond that, we expect meaningful data by that time point.\n\nRoger Song -- Jefferies -- Analyst\n\nUnderstood. OK. And then with the World Lung Conference, the combo data, I think that Susan mentioned you're not planning to develop the telaglenastat -- telaglenastat stand-alone, but would you -- would you sponsor your own combo study? Or it may depend on the phase 2 sapanisertib data, then you want the study to go with the combo?\n\nEmil Kuriakose -- Chief Medical Officer\n\nYeah. Right. As Susan said and we said, we're not developing telaglenastat at this time with any sort of trial-sponsored trials. But we're interested in the outcome of this ISP.\n\nOur primary focus right now is on these monotherapy development paths for both sapanisertib and mivavotinib. That's where our full focus and efforts are right now. But I think it will be a nice complementary data set that reads out in parallel to both of the monotherapy efforts that could guide us depending on how they look.\n\nRoger Song -- Jefferies -- Analyst\n\nGot it. OK. Maybe last question for us is the financial -- the cash runway. Given you will read out data in 1Q and your current cash runway is to 2Q next year, just curious any flexibility in your cash runway will be? Or any other way to extend the current cash runway to go a little bit further beyond the data catalyst?\n\nStephanie Wong -- Chief Financial Officer\n\nHi, Roger, it's Stephanie. Thanks for the question. We certainly are evaluating that cash run rate continuously. And also, we're mindful of making sure that we can execute these programs.\n\nSo as we make decisions, we will update everyone of any changes to our plan.\n\nRoger Song -- Jefferies -- Analyst\n\nGot it. Thank you. That's all I have. Thank you.\n\nStephanie Wong -- Chief Financial Officer\n\nThanks, Roger.\n\nOperator\n\nThere are no further questions. I'd like to turn the call back over to Susan Molineaux for any closing remarks.\n\nSusan Molineaux -- Founder, President, and Chief Executive Officer\n\nThank you, and thanks for all joining us today. Have a good evening. Goodbye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nStephanie Wong -- Chief Financial Officer\n\nSusan Molineaux -- Founder, President, and Chief Executive Officer\n\nEmil Kuriakose -- Chief Medical Officer\n\nJonathan Chang -- SVB Securities -- Analyst\n\nRoger Song -- Jefferies -- Analyst\n\nMore CALA analysis\n\nAll earnings call transcripts"
}