{
  "companyName": "Sun Country Airlines Holdings, Inc.",
  "companyTicker": "SNCY",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/sun-country-airlines-holdings-inc-sncy-q2-2022-ear/",
  "content": "Sun Country Airlines Holdings, Inc. (SNCY 2.06%)\nQ2 2022 Earnings Call\nAug 09, 2022, 10:00 a.m. ET\n\nOperator\n\nWelcome to the Sun Country Airlines second quarter 2022 earnings call. My name is Kathy Darnell, and I'll be operator for today's call. [Operator instructions] Please be advised that today's conference is being recorded. I'll now turn the call over to Chris Allen, director of investor relations.\n\nMr. Allen, you may begin.\n\nChris Allen -- Director, Investor Relations\n\nThank you. I'm joined today by Jude Bricker, chief executive officer; Dave Davis, President and chief financial officer; and a group of others to help answer questions. Before we begin, I would like to remind everyone that during this call, the company may make certain statements that constitute forward-looking statements. Our remarks today may include forward-looking statements, which are based upon management's current beliefs, expectations, and assumptions, and are subject to risk and uncertainties.\n\nActual results may different materially. We encourage you to review the risk factors and cautionary statements outlined in our earnings release and our most recent SEC filings. We assume no obligation to update any forward-looking statement. You can find our second quarter earnings release -- our second quarter press release on the investor relations portion of the website at ir.suncountry.com.\n\nWith that said, I'd like to turn the call over the Jude.\n\nJude Bricker -- Chief Executive Officer\n\nThanks, Chris. Good morning, everyone. Demand for all segments of our business remains as strong as it's ever been. Our revenue in 2Q grew over 29% versus the same quarter in 2019 on block-hour growth at 23%.\n\nDuring the pandemic, we launched and built out our cargo business and now, and over the next several quarters, our main focus at Sun Country is to staff our airline to get back to 2019 utilization levels on our passenger fleet, as quickly as possible. We want to deliver this growth while also maintaining the operational excellence and service levels that our customers expect of us. I'm especially proud that year to date, Sun Country has led the industry in completion factor with 98.2% in this challenging operational environment. That performance during such rapid growth is a testament to the hard work and talents of all our team members that deliver for our customers each day.\n\nLike all airlines, we're facing the challenges of record-high fuel, tight labor market, and inflationary pressures. We built a model that we believe can deliver profits in any environment. We were profitable through the pandemic, through a war, and now through record fuel. Our flexible network, combined with having a large percentage of our flying committed to long-term pass-through contracts, give us the ability to be successful regardless of what challenges we're facing.\n\nBy design, our response to high fuel is to cut off-peak flying and concentrate our schedule on periods of the calendar when we're able to achieve acceptable returns. As fuel rose rapidly through February and into May, we aggressively cut weaker periods like midweek, May and September and long-haul routes that are more fuel intensive. These capacity cuts, along with all our revenue initiatives, allowed us to deliver over 29% schedule service CASM growth versus 2019 for 2Q. As we've had more lead time going into the third quarter, we expect our scheduled service CASM to approach 40% improvement, and we continue to see strength across our selling schedule currently posted through April of next year.\n\nWe expect not only to be profitable in all environments, but also to deliver industry-leading margins. I want to give some color as to why, for the first time in 10 quarters, that isn't the case. The capacity changes we've implemented in the second and third quarters were all cuts. However, the fare environment and our fleet size justifies significantly more flying during peak periods.\n\nWe weren't able to add this flying due to crew constraints. Since ratifying our pilot agreement at the end of last year, we haven't had any issues with retention or hiring. However, we're attempting to train about four times the amount of crews versus pre-COVID levels. At the end of June, about a third of our FOs were in a training status.\n\nThis resulted in a reduction for June, a peak month, of 30% in passenger fleet utilization versus 2019. With 40% of the fleet committed to contract flying, we were under-allocated to the best margin opportunities during the quarter, namely scheduled service, large volume domestic markets. As hiring retention continues to not be an issue, we expect our crew constraints to be temporary. Again, I'm so proud of all our team members here at Sun Country for going above and beyond every day.\n\nAnd with that, I'll turn it over to Dave.\n\nDave Davis -- President and Chief Financial Officer\n\nThanks Jude. Before I get into a discussion of our results, recall that Q2 is a seasonally weaker quarter for Sun Country than Q1. This is unlike many of our competitors whose business strengthens during Q2. Sun Country posted an adjusted operating profit of $4 million for the quarter and an adjusted EPS loss of negative $0.03 per share.\n\nAdjusted operating margin was 1.8%. Our results were driven by a combination of unprecedented growth in unit revenue, historically high fuel prices and under-capacity driven by staffing issues. I'll delve into each one of these items in my remarks. First, revenue and capacity.\n\nSecond quarter revenue totaled $219.1 million, a 29% increase versus Q2 of 2019. Demand continues to be robust. Scheduled service revenue was $152.6 million, a 22.5% increase over Q2 '19, and scheduled service TRASM grew 29% versus 2019. For the month of June, scheduled service TRASM was 44% higher than 2019 and July finished over 40% higher than July 2019.\n\nSo recent positive revenue trends are continuing and are evident in our forward bookings. Our average fare of $173 was 22% higher than Q2 of '19. System block-hour growth for the quarter was 23% higher than Q2 of '19, driven by the growth of our cargo segment. System ASMs declined by 6% compared to Q2 '19, which was considerably smaller than we would've optimally been, even at $4 plus fuel prices.\n\nAs Jude mentioned, since finalizing our pilot agreement in December of last year, we have been able to attract all of the pilots we need to meet our staffing requirements. In addition, attrition has continued to moderate since Q4 of last year. As we implement the new agreement, we've been increasing the size of our hiring and training pipeline to accommodate our growth plans. This work is underway and we continue to make good progress.\n\nPilot output in June was more than double the output in April and our September new-hire class is over 30% larger than earlier in the year. Charter revenue for the quarter was $42.7 million, a 25% increase over Q2 of '19. Over 90% of the charter flying we did during the quarter was under long-term contracts. While increasing the proportion of business under contract is a favorable trend, there remains ample opportunity to increase the amount of profitable ad hoc flying that we do.\n\nIn 2019, 49% of our charter flying was ad hoc. This gap to today's number represents growth potential for our charter segment as the number of available pilots continues to increase. Cargo revenue for the quarter of $21.2 million was flat with Q1 '22, down by 4% versus Q2 '21. The decrease was driven by more aircraft and heavy check versus last year.\n\nWe did not fly main deck cargo aircraft in 2019. Turning now to costs. Our Q2 non-fuel costs per block hour only increased 3.6% versus Q2 of '19, despite implementation of our new pilot agreement. Adjusted CASM over the same period increased 15% versus '19, and a 6.4% decrease in total ASMs.\n\nThis increase in our non-fuel CASM is largely driven by the fact that, as I mentioned, we were significantly undersized relative to both our initial plans for Q2 and for the profitable flying opportunities that were available to us. The average price that we paid for fuel in the second quarter was $4.39 per gallon, was far higher than the $2.29 per gallon we paid in the second quarter of '19. Relative to the Q2 guidance we gave last quarter of $3.50 per gallon, the higher price drove $15.5 million in added fuel expense. We experienced the $3.50 per gallon as we guided the reduction in fuel expense would've led to an adjusted op margin for the quarter of 9%.\n\nThis would've been despite the capacity challenges I've discussed. Let me talk now briefly about guidance. As we move through Q3, demand environment remains very strong and we expect scheduled service TRASM to be in excess of 40% higher than Q3 of '19. We expect third quarter total revenue to be up 25% to 28% versus '19 and operating margin to be between 3% and 5%.\n\nOur projected Q3 fuel price is $3.84 per gallon. And we expect to fly 31,000 to 32,000 block hours, or approximately 1.5 billion ASMs. We believe the fundamentals of our business plan remain strong and our model is highly resilient to changes in macroeconomic conditions. Our focus remains on profitable growth.\n\nThe fact that we have grown less than anticipated has resulted in a decline in aircraft utilization relative to pre-COVID periods. As our pilot output continues to improve, we anticipate growth will come at higher margin as fixed aircraft costs are already being incurred. Finally, let me focus on our balance sheet where we closed the second quarter with $308 million of liquidity, consisting of $283 million in cash and $25 million of undrawn revolver. Despite extremely high fuel prices, we generated over $15 million of free cash flow during the quarter, excluding aircraft capex, and we continue to expect to be strongly free cash flow positive for the year.\n\nOur strong balance sheet continues to provide capital deployment flexibility in the quarters ahead. With that, I'll open it up for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first call comes from the line of Duane Pfennigwerth with Evercore. Go ahead, your line is open.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nHey, thanks. Good morning. You gave some of the stats on training but maybe you can just kind of resummarize that. Can you speak to how your throughput is changing? How did the number of flight instructors change? I think you were looking for a step-up there in the month of July.\n\nAnd just to maybe bottom line it, when do you think you're going to be fully back or where you want to be on staffing, maybe with an eye toward the fourth quarter?\n\nDave Davis -- President and Chief Financial Officer\n\nYeah, so just a couple more stats. I talked about sort of the pretty dramatic increase in our pilot output. There's been a couple of bottlenecks in the training pipeline. One of the biggest ones, which we've now largely overcome, is on basically check airmen, IOE pilots who can certify our pilots to fly before they get online.\n\nWe had only five IOE instructors in the months, kind of, leading up to July 1st, when we increased that number to 19. We will continue to increase that number in the months ahead, so that bottleneck we think is largely cleared. There's a couple other things we're sort of working through here as we go forward, which I think we're going to have solved, I would say, in the next quarter to two quarters. We'll know a lot more in the next several months, but all of our trends are very favorable.\n\nIf you look at our growth, as we look out later into the year, we'll be accelerating again relative to the fourth quarter. So, we've just been going through implementing the new pilot agreement. The good news is sort of some of the uncontrollable factors, like attrition and new hires, we have a solid handle on, so we can attract all the pilots we need and our classes are as big as we want them to be.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nOK, great. And then just for a follow-up on network, obviously, right here and now you're constrained. But can you give some color on the types of markets that maybe outperformed in 2Q versus the markets that underperformed, with the benefit of hindsight?\n\nJude Bricker -- Chief Executive Officer\n\nSure, Duane. So the most disappointing under-capacity allocations were markets that were in kind of an inelastic state where they were large enough markets to handle a lot more capacity, showed significant revenue improvements. And we believe that adding more capacity wouldn't have changed the revenue environment much. And most of those markets were Minneapolis to large cities like Denver, Dallas, Baltimore, Boston, New York, Portland, Seattle and Houston, Indianapolis.\n\nSo those markets, I think were -- we don't know for sure, but were lifted by a return of business demand, which lifted overall fares. And we think that there was a lot of opportunity to add significant capacity. Instead, we were allocated more into fixed fee, as we talked about, but also a lot of leisure markets that didn't see the kind of revenue year of three improvement that we saw in these larger markets. Grant, anything to add?\n\nGrant Whitney -- Executive Vice President and Chief Revenue Officer\n\nNo, I'll just -- well, I would add one thing. It's just, we've grown Minneapolis nonstop destinations by over 50% through COVID. And as Jude mentioned, some markets performed better than others. But I would say broadly, Minneapolis performed very, very well.\n\nThe new markets did meet expectations and we did see a lot of good growth opportunities that remain in the market. And we will be opportunistic, we will take advantage of it as the capacity becomes available.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nOK, thank you.\n\nJude Bricker -- Chief Executive Officer\n\nThanks, Duane.\n\nOperator\n\nThank you. Our next call comes from the line of Michael Linenberg of Deutsche Bank. Go ahead. Your line is open.\n\nMike Linenberg -- Deutsche Bank -- Analyst\n\nGreat. Hey, good morning guys. Just following up on...\n\nJude Bricker -- Chief Executive Officer\n\nHey, Mike.\n\nMike Linenberg -- Deutsche Bank -- Analyst\n\nHey, guys. Just following up on Duane's question. When I did see you pull down also some of the long, high volume summer markets, say West Coast, Hawaii, I just assumed that that was all because energy prices or fuel prices were above $4 a gallon, but it does sound like that you just -- you didn't have the staffing. What -- was it a combination of both or would those markets have worked -- some of those longer haul markets, would they have worked, given where overall fares are, where pricing is and the higher fuel? And was it mostly a staffing issue that drove that? Also...\n\nJude Bricker -- Chief Executive Officer\n\nIt would have worked, absolutely. Keep in mind, like, if you talk about Hawaii, we're talking about a market that would've started around Memorial Day, a little bit before, and, I mean, everything in June works on the schedule service side. So, we were making decisions, a combination of fuel intensity, so it's about 50 gallons per passenger to fly somebody to Hawaii versus 20 gallons or so on our domestic network. And then also crew efficiency because we're crew constrained, if there's any positioning or penalty, then we can get more flying done in a different way, then that goes into the calculus as well.\n\nHawaii, we expect to be back next summer, it was -- it'd been -- it would have done just fine in this environment, but we're just trying to put the best stuff in.\n\nMike Linenberg -- Deutsche Bank -- Analyst\n\nOK. OK. That's helpful. Then just -- I know this got picked up and maybe it was from an interview and it was just maybe an off-the-cuff conversation about potentially flying wide-body airplanes.\n\nAnd when I sort of think about what you're dealing with right now, it doesn't seem like that that's anytime soon, but maybe it is. And it may be that in conversations that you're having with Amazon, if you were to do wide-body, I'm sure that there'd be a cargo complement as well. Otherwise I don't think it would make sense. Anything that you can sort of just add to that? Maybe again, that was kind of off-the-cuff advance planning? want to put that to rest?\n\nJude Bricker -- Chief Executive Officer\n\nYeah. Sure. So the question from the reporter was, noting that wide-body rates are in our pilot agreement, do we think it would work? And my response was, yeah, it'll work. But we don't have any plans to do it in the near future.\n\nSo multiple years from now, we might consider -- more than three years or so. And I agree with what your sentiment that there would be need to be kind of a cargo complement as well, to get the same synergies out of our multi-segment business in narrow-bodies into the wide-body spaces. So we're not -- our focus right now is putting pilots out onto the line and that'll be the focus for the next two quarters. Yeah.\n\nMike Linenberg -- Deutsche Bank -- Analyst\n\nOK, great. And just squeezing one quick one on the pilot contract. Obviously, you're rolling out various elements. When does the -- the preferential bidding system, is that now up and running or does that take some time? Because I do think that that will also help kind of work through -- help you work things through.\n\nIs that -- are you there yet on that part of the contract?\n\nJude Bricker -- Chief Executive Officer\n\nYeah. So that's a good question, Mike. The answer is no. So we have some of the stuff in place that maybe doesn't help from a productivity perspective.\n\nWhat we don't have in place is prep bid, which will help us. We don't have that in place yet. So that's probably early in the year. We're working through with ALPA right now, very productively.\n\nWe've got our vendor chosen and so forth. We've just got to implement it and it's going to be early next year. But that's going to help, no doubt.\n\nMike Linenberg -- Deutsche Bank -- Analyst\n\nOK, great. Great. Thanks for the time, everyone.\n\nOperator\n\nThank you, Michael. Our next question comes from Barclays, from the line of Brandon Oglenski.\n\nBrandon Oglenski -- Barclays -- Analyst\n\nThanks for taking my questions. Jude or Dave, does this -- the training problems you're having right now or the constriction here, does this change your longer-term capacity plans, especially as we think about 2023 or 2024 relative to where you were, maybe pre-pilot contract.\n\nJude Bricker -- Chief Executive Officer\n\nYeah, I mean, I think in the near term, we're certainly constrained by pilots. We expect, as we move into 2023, to be able -- our goal, and we have line of sight on a plan, to achieve a 20% block-hour growth rate, which I think is achievable over a more sustained period. We're not going to grow for growth purposes. I mean, we need to have high margin opportunities for that incremental flying, which I think exists in today's environment, even with fuel price, but in a recession or higher fuel, that growth rate would change.\n\nBut we're building out training capacity, and also we have a contract and a value proposition to incoming pilots with diversity of our flying and growth rates that I think 20% is attainable.\n\nDave Davis -- President and Chief Financial Officer\n\nYeah. Let me just give you a couple -- this is Dave, hey, Brandon, let me just give you a couple other numbers though. So we originally expected to end the year with 42 passenger aircraft. That's where we'll be.\n\nWe are in advanced discussions, pretty close right now, on three more aircraft that'll deliver to us later in '23, and we are remaining active in the market. The beauty of the fleet plan, as we talked about many times before, is we don't have fixed orders coming in. So we can pivot, go up and down, based on sort of how much we can fly and what the opportunities are. And we're going to continue to do that, just like we've been doing.\n\nBut we're in the market, we're still looking for aircraft. We've got a strong beat on three more. So we're moving forward and planning for sustained growth.\n\nBrandon Oglenski -- Barclays -- Analyst\n\nAnd Dave, I guess, as you look out into '23, if you're able to achieve that 20% growth in block hours, where would you see the CASM benefit come out?\n\nDave Davis -- President and Chief Financial Officer\n\nYou mean, like on what P&L line item or like what time period?\n\nBrandon Oglenski -- Barclays -- Analyst\n\nWell, no, I mean, I think the target was below 6 CASM, but now maybe a little bit around six. Where would you see longer term CASM, I guess shaking out, to be more specific?\n\nDave Davis -- President and Chief Financial Officer\n\nWell, CASM will be heading down as we grow. I mean, I don't have a revised plan right now to give you a number. I think our costs are well in hand. I just don't have enough done on the '23 plan yet to give you a good '23 number.\n\nThe other thing to think about -- this is always tough with us because we've got a big cargo business. So we have costs that derive unassociated with ASMs. So we really look at a lot of stuff on a cost-per-block-hour basis, which we feel is pretty well in hand. But I don't have a precise CASM forecast for you right now.\n\nBrandon Oglenski -- Barclays -- Analyst\n\nOK. Appreciate it, guys. Thank you.\n\nJude Bricker -- Chief Executive Officer\n\nThanks, Brandon.\n\nOperator\n\nThank you. So our next call comes from the line of Scott Group with Wolfe Research. Please go ahead.\n\nScott Group -- Wolfe Research -- Analyst\n\nHey, thanks, morning guys.\n\nJude Bricker -- Chief Executive Officer\n\nHey, Scott.\n\nScott Group -- Wolfe Research -- Analyst\n\nSo I think you talked about 44% unit revenue growth in June, 40% or so in July. Any thoughts on where we go from here and what you're seeing with fares as fuel prices are starting to come down?\n\nJude Bricker -- Chief Executive Officer\n\nSo Scott, just want to make a clarifying point, which is that that's for scheduled service TRASM which is about, I don't know, 60% of our -- 70% of our block hours, 65% of our block hours, something like that. And the rest is in long-term fixed contracts, which adjusts slowly. And so, yeah, TRASM, I think your question is about long-term demand trends. We've seen really consistent year over three unit revenue improvements in sales for the entire selling schedule out through April.\n\nSo we don't see any slowdown associated with -- any pullback in demand from where we were on peak levels in July. Our own capacity can influence that if we're able to add more. We don't want fares to get too high where travel's unattainable for a large portion of our customers. But there's no indication in any of our forward bookings of any weakness or any change from this summer demand profile.\n\nScott Group -- Wolfe Research -- Analyst\n\nAnd so at least for now you feel like you'll be able to sort of keep the drop in fuel and keep the benefit of that.\n\nJude Bricker -- Chief Executive Officer\n\nYes.\n\nScott Group -- Wolfe Research -- Analyst\n\nAnd then you talked about, in the beginning, that you want to have industry-leading margins. Maybe just think about -- that's maybe the goal, double-digit margins. What has to happen -- realistically, when can we get back to a double-digit operating margin?\n\nJude Bricker -- Chief Executive Officer\n\nYeah, I mean, so if you look back in the second quarter, the foregone opportunities of flying, it's hard to tell, but it's probably worth in the -- on the pre-tax basis and operating basis, in the tune around $15 million, which would've put us pretty close to double digits. And I think -- so then the answer to your question becomes how quickly we can put crews out onto the line to get the passenger fleet back to utilization levels that we have had in 2019. Now, the fuel price is higher so the flying opportunities for high utilization are sort of concentrated when fares are naturally higher. So May, there wasn't that much opportunity loss, September, there won't be that many opportunities to add other than ad hoc charter opportunities.\n\nBut for summer months, where this demand environment is so good, we're forgoing significant opportunities with utilization down 30%. And that's the key to delivering back to operating margins that lead the industry, I think.\n\nScott Group -- Wolfe Research -- Analyst\n\nSo, would that be your goal or expectation for '23, to get back to leading the industry?\n\nJude Bricker -- Chief Executive Officer\n\nYes.\n\nScott Group -- Wolfe Research -- Analyst\n\nOK. All right. Thank you, guys.\n\nJude Bricker -- Chief Executive Officer\n\nJust a couple other color, just because I can't help myself. There's some -- as you compare across the industry, so Frontier's taking sale leaseback, they take a gain from that. There are three carriers in the industry with significant hedge portfolios, with significant advantage of those hedge portfolios in a mark-to-market basis, Southwest Alaska and Delta. And then there's a business customer rebound that we're not benefiting from.\n\nSo just keep that in mind, and I think when we think more long term, we're in a really good place.\n\nScott Group -- Wolfe Research -- Analyst\n\nMake sense. Thank you, guys.\n\nJude Bricker -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nThank you. OK. Now, I'd like to turn it back to Jude Bricker for closing remarks.\n\nJude Bricker -- Chief Executive Officer\n\nWell, thanks for joining the call, everybody. We'll talk to you in three months. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChris Allen -- Director, Investor Relations\n\nJude Bricker -- Chief Executive Officer\n\nDave Davis -- President and Chief Financial Officer\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nGrant Whitney -- Executive Vice President and Chief Revenue Officer\n\nMike Linenberg -- Deutsche Bank -- Analyst\n\nBrandon Oglenski -- Barclays -- Analyst\n\nScott Group -- Wolfe Research -- Analyst\n\nMore SNCY analysis\n\nAll earnings call transcripts"
}