{
  "companyName": "AMC Entertainment Holdings",
  "companyTicker": "AMC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/amc-entertainment-holdings-amc-q3-2022-earnings-ca/",
  "content": "AMC Entertainment Holdings (AMC -1.69%)\nQ3 2022 Earnings Call\nNov 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings, and thank you for standing by. Welcome to the AMC Entertainment third quarter 2022 earnings conference call. During presentation, all participants will be in a listen-only mode, and afterwards, we will conduct a question-and-answer session. [Operator instructions] Today's call is being recorded Tuesday, November 8, 2022.\n\nAnd now I'd like to turn the conference over to John Merriwether. Please go ahead. \n\nJohn Merriwether -- Vice President, Investor Relations\n\nThank you, Scott. Good afternoon, everyone. I'd like to welcome everyone to AMC's third quarter 2022 earnings webcast. With me this afternoon is Adam Aron, our chairman and CEO; and Sean Goodman, our chief financial officer.\n\nSo, before I turn the call and the webcast over to Adam, let me remind everyone that some of the comments made by management, during this webcast may contain forward-looking statements that are based on management's current expectations. Numerous risks, uncertainties, and other factors may cause actual results to differ materially from those that might be expressed today. Many of these risks and uncertainties are discussed in our most recent public filings, including our most recently filed 10-K and 10-Q. Several of the factors that will determine the company's future results are beyond the ability of the company to control or predict.\n\nIn light of the uncertainties inherent in any forward-looking statements, listeners are cautioned to not place undue reliance on these statements. The company undertakes no obligation to revise or update any forward-looking statements, whether as a result of new information or future events. On this webcast, we may reference non-GAAP financial measures, such as adjusted EBITDA, constant currency, operating cash burn, among others. For a full reconciliation of our non-GAAP measures to GAAP results, please see our earnings release posted in the Investor Relations section of our website earlier today.\n\nAfter our prepared remarks, there will be a question-and-answer session. This afternoon's webcast is being recorded, and a replay will be available in the investor relations section of our website at amctheatres.com later today. With that, I'll turn the call over to Adam.\n\nAdam Aron -- Chairman and Chief Executive Officer\n\nThank you, John. Good afternoon, everyone, and thank you for joining us today. Even with the third quarter financially being flattish, we join you on this call today brimming with confidence that the recovery of AMC Entertainment is well underway. AMC welcomed more than 53 million guests to our theaters around the world in Q3 of 2022, a 33% increase compared to the third quarter of 2021.\n\nOn our last quarterly webcast, we were encouraged that the July industrywide domestic box office was down only 12% from the pre-pandemic July of 2019, but we also did predict quite correctly that there would be a dearth of big movie titles being released in August and September of this year. Even so, we also were bullish about the movies coming out in the fourth quarter of and in calendar year 2023, and that is precisely our view again today. Despite a lackluster August and September, we're seeing that the industrywide box office is already on a rebound, both domestically and globally, clawing and climbing its way back. And looking at the fourth quarter of 2022, it's worth noting that Warner Bros.' \"Black Adam\" released in mid-October had the highest domestic box office opening weekend gross of all time for any movie featuring Dwayne Johnson as the leading man.\n\nI also can confirm today that our advanced bookings at AMC and Odeon for \"Black Panther: Wakanda Forever\" are frothy and robust. We are about as certain as we can be, that the so-called \"Black Panther 2\" will be one of the biggest movies of the year and that its ticket sales might even cause it to rise as high as the second biggest movie of 2022, behind only \"Top Gun: Maverick.\" And of course, Q4 will continue with Disney's \"Strange World,\" with James Cameron's \"Avatar: The Way of Water\" and with Damien Chazelle's \"Babylon.\" Anchored by a strengthening fourth quarter of 2022, let's get a better sense of this recovery by briefly going back to the beginning. Recall that when the pandemic hit the scene in early 2020, the industrywide domestic box office, which is the basic measurement of the size of our industry, fell by more than four-fifth for the full year of 2020, leading to the lowest box office grosses since 1981. But in comparing to 2020, the domestic box office more than doubled in 2021.\n\nOur expectation for the full year of 2022 when this year is all over is that the domestic box office will have dramatically risen and increased yet again by not quite but almost by 75%. And while no one's crystal ball is perfect as far in advance, based on our analysis of the movie titles currently expected to be released in 2023, we think that next year's box office should grow yet again by between 15% and 25% and possibly by even more. Our confidence in looking ahead stems not only from a growing industrywide box office but also because of the demonstrated agility of the AMC board and management team to skillfully navigate our way through crisis. Since the beginning of the pandemic, we have taken bold and decisive steps to ensure a recovery for AMC Entertainment by taking action after action after action to enhance our marketing appeal and our operating profitability while at the same time brilliantly raising capital.\n\nOver the last two and a half years, AMC took in some $2.2 billion of new equity proceeds and another $2.6 billion of debt financings. In addition, we were able to amicably negotiate almost $1.5 billion of further benefit from asset sales, government support, and concessions from both our lenders and our theater landlords. Accordingly, at the end of the third quarter, AMC had just under $900 million of liquidity. Having ample liquidity is a bedrock of strength.\n\nWe will use ours both to continue to grow but also to continue to delever. Our smart financing activities include the recently announced refinancing just a few weeks ago of our $400 million Odeon term loan in Europe, taking the debt paid off to $144 million so far this year in total. And there is also the introduction of our preferred equity units or APES in August. In launching them, we said that the creation of APES was nothing less than an all defining moment in AMC's future as it gave us a new currency to help AMC to grow, to delever, and to raise capital.\n\nWe also said at the time to those who feared mindless dilutions that we would treat our new A preferred stock that we would treat it as precious, and we will continue to do so. So far, we have raised only $37 million of equity proceeds from the sale of APES into the market. We have indeed been careful. As to APES specifically, each AMC preferred equity unit was designed of essentially similar economic and voting rights as an AMC common share.\n\nBut markets are markets. They act on their own accord, and they are out of our direct day-to-day control. Even so, we continue to be convinced that over time, the availability of APES will serve their purpose for AMC Entertainment well to help AMC to grow, to delever, and to raise capital. Taken together, all of the actions that we've taken have allowed AMC Entertainment to successfully navigate our way through the impact of the COVID pandemic.\n\nAnd by contrast, we did so while several of our competitors, both big and small, were forced into bankruptcy protection or some other form of reorganization or liquidation. In 2021 and 2022, we wisely pruned our circuit by adding theaters where it made sense to do so and by aggressively shedding about 7% of our theaters. Indeed, AMC and Odeon permanently closed older tired buildings with marginal or negative profitability that had reached the end of their productive life cycles. At the same time, though, we also have been able to grow our network by profitably adding attractive theaters, either built from scratch and appealing locations or those picked up from our competitors who may have stumbled.\n\nI should point out that with $900 million of quarter ending liquidity, our eyes are keenly open to new such opportunity as it may arise, tempered only by my previous comment that preserving ample liquidity and delevering are also high priorities for us. We also have a number of bold ideas about how we can broaden our business, which I will talk about specifically later on this call. So that's where we are two and a half years into our COVID-19 journey. We're not out of the woods yet.\n\nWhile the box office is unmistakably on the rise, it's still falling short of pre-pandemic levels. Adding to all that, inflation is ramped up, and interest rates are marching upwards. In summary, though, as I said at the beginning of this webcast, we are brimming with confidence. We know what we're doing, and we will manage AMC with all of our skill and determination as we strive to rise to the challenge.\n\nWith that, I'm going to pass the call to Sean Goodman, our CFO. After that, I'll come back to talk about some key developments and answer your questions.\n\nSean Goodman -- Executive Vice President and Chief Financial Officer\n\nThank you, Adam, and thank you to everyone for joining us this afternoon. While the third quarter started off strong, August and September were as we expected, relatively quiet. Nonetheless, the quarter still saw revenue growth of 27%, and that number is 32% in constant currency when compared to the third quarter of 2021. Comparing Q3 2022 to the prior year's third quarter, the growth in revenue was offset by box office concentration with a result in increase in film exhibition costs, a reduction in government assistance, and inflationary cost pressures.\n\nThe result for the quarter was a small consolidated adjusted EBITDA loss of $12.9 million compared to a $5.3 million loss a year ago. Note that our domestic adjusted EBITDA in Q3 of $1.2 million was an improvement of $31.3 million compared to the prior year. While the international business, which enjoyed meaningful government assistance in 2021, experienced an adjusted EBITDA loss of $14.1 million compared to adjusted EBITDA of $24.7 million a year ago. Now let's just step back and look at our recovery over the last nine months.\n\nYear to date, consolidated adjusted EBITDA is a positive $32 million compared to an adjusted EBITDA loss of $450 million for the same period a year ago. That's approaching $0.5 billion of adjusted EBITDA improvement so far this year. As has consistently been the case in this recovery period, our per guest performance metrics remain markedly better than pre-pandemic 2019. For Q3 2022, on a consolidated basis, total revenue per patron was $18.21, approximately 21% higher than Q3 of 2019.\n\nThis was driven by admissions revenue per patron growth of 12%, food and beverage revenue per patron growth of 30%, and other revenue growth per patron of 48%, all compared to the third quarter of 2019. Taking a closer look at the domestic business. Admissions revenue per patron increased by 15% compared to Q3 2019 to $10.90, and our international business achieved a 2% increase to $8.60. Normalizing for the strength of the U.S.\n\ndollar compared to 2019, international admissions revenue per patron increased by 10% in constant currency. From a food and beverage perspective, we continue to enjoy exceptionally strong food and beverage revenue per patron. In our domestic markets, food and beverage spend per patron in the third quarter was $7.11. That's 33% higher than average spending pre-pandemic Q3 2019.\n\nAnd in the international business, food and beverage spend per patron was $4.10. That's nearly 15% higher than Q3 of 2019, and nearly 24% higher on a constant-currency basis. Finally, domestic other revenue per patron increased by 54%, and international other revenue per patron increased by 37% and 48% in constant currency. Going forward, we are focused on continuing to drive strength in these key performance metrics through: one, ongoing development of our industry-leading AMC app, website and loyalty programs; two, enhancing the guest experience, including our innovative food and beverage offerings; three, providing the very best possible site and sound experiences through premium offerings such as IMAX, Dolby Cinema, and AMC Prime; and four, growing revenue through diversification initiatives, such as renting at our theaters during off-peak times marketing and promotional initiatives, all of the above to be achieved while paying very close attention to our operating efficiency.\n\nNote that premium formats attendance represented 14.9% of domestic attendance in Q3 2022 compared to 12.6% in the third quarter of 2019. And in our international markets, premium format attendance represented 9% compared to 8.4% in the third quarter of 2019. Let's talk about the balance sheet now. We ended the quarter with liquidity of $896 million.\n\nThis is comprised of $685 million of cash and cash equivalents and $211 million of undrawn credit facilities. As anticipated and discussed during last quarter's earnings webcast, cash burn this quarter was adversely impacted by the relatively quiet box office in August and September, together with seasonal working capital requirements. Our working capital will naturally come under pressure when a relatively strong quarter is followed by a weaker quarter, and Q3 was no exception. Operating cash burn for the quarter represented cash burn before debt servicing costs and before deferred rent payback was approximately $179.2 million.\n\nLooking ahead, we expect our cash burn to improve in Q4 with a return to positive operating cash generation. Regarding capital allocation, our priorities remain unchanged: one, maintaining sufficient liquidity to manage through the recovery phase of our business; two, strengthening our balance sheet by extending maturities, reducing debt, and reducing associated interest costs; three, investing in our business to enhance the guest experience; and four, opportunistically pursuing value enhancement initiatives, including those that lead to diversification of our business. During the third quarter of 2022, we strengthened our balance sheet by repaying approximately $23 million of deferred rent, reducing our deferred rent balance to approximately $196 million. Recall that back in March 2021, this balance was more than $470 million.\n\nAnd over the last 18 months, we've lowered our deferred rent liability by nearly $275 million. In 2022 alone, deferred rent has been reduced by approximately $119 million. We expect to further reduce this deferred rent balance during Q4 by another approximately $50 million. In addition to the reduction in deferment, as Adam noted, we have taken further actions during the year to extend debt maturities and reduce our debt balance.\n\nThe net result is at approximately $144 million reduction in the principal amount of interest-bearing debt outstanding and an extension of debt maturities through to 2026. All told, if we include the decrease in deferred rent, we've actually reduced our debt liabilities by a total of approximately $263 million so far this year. Capex, net of landlord contributions, was $44 million in the quarter. And for 2022, we continue to expect Capex to be in the range of $150 million to $200 million.\n\nActively managing our theater portfolio continues to be a priority. During the third quarter, we added 4 new theaters and closed eight. This brings the total number of locations closed since the pandemic began to 106 and the total new locations opened to 49 for a net reduction of 57 locations. The combined 49 new locations continue to substantially outperform 106 closed locations and also outperform our underwriting expectations.\n\nWe continuously seek opportunities to strengthen the balance sheet while simultaneously weighing the liquidity needs of our ongoing recovery, and the steps that we have taken today show we are ready to take action as attractive opportunities arise. And with that, I'll hand the call back over to Adam to review some exciting recent announcements and provide an update on our strategic initiatives. \n\nAdam Aron -- Chairman and Chief Executive Officer\n\nThank you, Sean. Before we head to your questions, I'd like to debunk a few myths but also to address what I think is the single most important topic facing the movie theater industry of today, as well as several operational, environmental, and business development concepts directly on the horizon as we continue to innovate at AMC. Since the pandemic first arrived, the press has been filled with three concerns that conventional wisdom has repeatedly insisted would be existential threats to moviegoing in theaters: fear of infection of the coronavirus disease, the rise of streaming services, and the collapsing of exclusive theatrical windows. On the disease risk, thanks to vaccines, medicines that deal with COVID-like -- medicines to deal with COVID like Paxlovid, and the fact that so many people have antibody protection because they already experienced the COVID infection, dealing with COVID now has transitioned from pandemic to endemic.\n\nIt's now more like the seasonal flu, which has been with us for more than a century since it was a killer pandemic in the early 1900s. People will still come down with COVID-19, but it's no longer the commerce-destroying thing than it was back in 2020 and 2021. Life is returning to normal. Risk one, dealt with.\n\nOn the streaming services risk, we have long said that the consumers' voracious appetite for content is big enough for movie theaters and streaming services to coexist harmoniously together. The results from \"Spider-Man: No Way Home,\" last winter from \"Top Gun: Maverick\" this past summer, and from the expected big grosses this weekend from \"Black Panther: Wakanda Forever\" will again remind us all that movie theaters can thrive even with the consumer having a multitude of streaming services that are choices as well. As opposed to streaming services being a threat, we think they are a potential ally for AMC Entertainment. This month, for example, we're showing our first-ever Netflix movie at AMC, the sequel to \"Knives Out.\" We recently announced that we will be showing Paramount+'s smash hit \"Yellowstone\" in our theaters.\n\nLast December, we played Amazon's \"Being the Ricardos,\" which starred our very own heroine, Nicole Kidman. And of course, MCN also -- and of course, Amazon also now owns MGM, whose movies appear prominently on our AMC big screens. Theaters and streamers can thrive simultaneously and can thrive together. Risk two, dealt with.\n\nAnd as for the risk of collapsing windows. During the height of the pandemic, several studios experimented with going to simultaneous home and theatrical release are found themselves forced to sell out movie titles that originally were bound for theaters but which went elsewhere instead. Fortunately, for us, studios appear to realize how much boundless money they can make by taking their films to movie theaters first. While there may be an occasional exception here or there, our industry has coalesced around an exclusive 45-day window for theatrical release.\n\nHopefully, that will turn out to be acceptable for studios and acceptable for theaters to both do well. Risk three, dealt with. At this point, there is only one topic that should be on the top of all minds and the tip of all tongues. It's not the coronavirus, it's not streaming, it's not windows.\n\nIt is this: movie theater operators need more movies. Because of pandemic-induced production delays, the number of big movie titles being released by the major studios is still down considerably, down 20% to 30% versus pre-pandemic norms. We eagerly await more film product to show, but I also can report to you today that we are seeing considerable progress on this front. Every few months, I have the opportunity to meet in person with the leaders of all the major studios in Hollywood.\n\nOver and over again, I'm hearing from them that they are doing all of their power to pick up the pace of the number of movies that they will be releasing theatrically going forward. That's the major challenge facing the movie industry right now above all else, and there can be optimism that more movie titles rather than fewer movie titles are in our future. Let's turn back to AMC initiatives. There are seven that I'd like to address directly and update you on.\n\nOne, given the financial struggles of many other companies within our industry, our eyes are wide open to opportunity that may arise for AMC. There is nothing further to report to you today on this subject but know for sure that we are paying close attention. Two, at our existing theaters, we're doing an enormous amount of business on our premium large-format screens. So, we are doing all that we can to renovate existing screens and increase the number of IMAX, Dolby Cinema, Prime, and iSense screens at our AMC and Odeon theaters.\n\nThree, we have started the multiyear installation of laser projectors broadly across thousands of auditoriums in the AMC system. They dramatically brighten and sharpen the images on our screens thereby greatly improving the moviegoing experience for our guests. Laser projection is also the biggest single green initiative that AMC has ever launched as they decrease energy consumption and they eliminate the need to dispose of depleted halogen bulbs in landfills. Four, just yesterday, we announced a truly exciting partnership with Zoom, in our view, the world's leading video communications platform, to enter into the multibillion-dollar meetings market for corporate and other meetings.\n\nWith this new partnership, we are able to offer meeting organizers the best of both worlds, the spectacular communications technology of Zoom, combined with the comfort, size, scale, and state-of-the-art site and sound capabilities of AMC's centrally located theaters. These new Zoom Rooms at AMC are an all-new product that will be available in as many as 17 major cities across the United States starting sometime in 2023. Using a Zoom Room at AMC, meeting and event organizers will be able to bring together decentralized workforces or customer bases and significant numbers of people from different markets, but together at the same time for a cohesive, both virtual and in-person meeting experience. It is not a well-known fact, but already right now, AMC does about $20 million a year of meetings business, and that's limited to one movie theater at a time without the cross opportunity to link up through Zoom technology, theaters in multiple markets simultaneously.\n\nWe're optimistic about the growth in revenues that we can generate from the very substantial meetings market. Additionally, we are in the final throes of development of an AMC-branded credit card. So, Item 5 on my list of seven, I am pleased to tell you today that we firmly expect that our new AMC-branded credit card will be launched in the first quarter of 2023, if not sooner. We could not be more excited about the progress we've made in getting to this point.\n\nFull details to come when we launch. Six, much also has been written about AMC's coming entry into the multibillion-dollar popcorn market. Our food and beverage and marketing teams have made great strides in product development in packaging and in our distribution plans. I fully expect that in partnership with a major national retailer, AMC Perfectly Popcorn will be on the shelves at grocery stores around the United States in the first half of 2023.\n\nOur AMC brand is credible residents among consumers of popcorn, and we can't wait to see the smiles on our faces as you get to see AMC Popcorn in a store near you. And lastly, update number seven, let's briefly tell you about developments recently at Hycroft Mining. Just last week, Hycroft reported the second rounded results from its drilling exploration program the biggest such exploration program on the Hycroft Mining site in Northern Nevada in nearly a decade. As was the case when the first round of exploration results were announced, Hycroft uncovered more gold and more silver in them thar hills.\n\nAnd a vital importance, Hycroft has been finding ore deposits that are of significantly higher grade. We made the Hycroft investment, recognizing the vast potential of the Hycroft asset if the company were appropriately capitalized. The results to date are extremely encouraging. I have to admit to being amused how receptive our shareholders were to our investment in Hycroft, and by contrast, how astounded Wall Street professors were to that same announcement.\n\nAccordingly, while there's no certainty in life, nothing would give me more pleasure someday well down the road than to report to you the degree to which we can monetize our Hycroft investment, hopefully, in eye-popping numbers. In closing, we as very much appreciate the support that we continue to get from our passionate shareholder base. And let me say personally that it's been a particular honor for me to meet with many of our shareholders one-on-one at the movie screenings I've personally been hosting around the country. And as of next week, across the globe, as my 11th such screening will be for the movie of the hour, the much-anticipated \"Black Panther: Wakanda Forever\" at the Odeon Luxe Holloway Cinema in London this coming Monday night, November 14.\n\nSean, let's now move to questions, both from our shareholders and from industry analysts. \n\nSean Goodman -- Executive Vice President and Chief Financial Officer\n\nLet's start with questions from our shareholders. Thank you to them for submitting their questions. I've grouped the questions into three categories. So, the first category, Adam, is innovations.\n\nAnd the first question there is, where do you see AMC expanding in the future? And what categories of innovations are in the pipeline to enhance the business? \n\nAdam Aron -- Chairman and Chief Executive Officer\n\nSo, these items were sort of addressed in my earlier prepared remarks. Number one, within our existing theaters, the amount of business that we do in our premium large format screens is significant. Sometimes on our opening weekends, even though our premium format screens represent only 10% of our auditoriums, sometimes they're producing as much as 50% of the gross of our films across the network. So, it makes sense for us to increase the number of premium format -- large format screens in our system.\n\nAnd that, we are doing. We're going to introduce more IMAX screens, more Dolby Cinema screens, more iSense screens and more Prime screens. So that's happening. Second, in terms of innovation, again, I mentioned it in my prepared remarks, but I can't say enough how big it is that we're deploying about $0.25 billion of resource to introduce laser projection in about half of our auditoriums.\n\nThis is a technical term, but the so-called light levels inside a movie theater with laser projection of contrast with a halogen bulb, it goes up by between 50% and 100%. It means the pictures on the screen are sharper, they're brighter, and therefore, the movie-watching experience is that much better. We're always going to want to create an environment in our theaters that makes the consumer want to get off their couch at home and come out to a theater. And brighter, sharper pictures, especially doing so in an environmentally friendly way, is a good way to do that.\n\nAnd then the third major item of innovation for AMC is what we've been doing away from our theaters. Things like the branded credit card; things like Perfectly Popcorn; things like Zoom Rooms, which is in our theaters, but away from movie watching per se, these are all areas where we think AMC will shine going forward. And it's not exactly innovation, but you talked in your remarks about how we closed 100-plus marginal theaters and opened 50 new ones, and the 50 new ones are -- make a lot more money than the 100 that we closed. I do continue to think that as the rest of the industry stumbled financially, we're going to see increased opportunity to grow our network and take advantage of our various strengths. \n\nSean Goodman -- Executive Vice President and Chief Financial Officer\n\nNext question here, Adam, is a request on update on AMC on Demand. \n\nAdam Aron -- Chairman and Chief Executive Officer\n\nAMC on Demand, which we introduced several years ago before the pandemic, has always had kind of low usage. And candidly, while it's a good little product, I think our money is better directed elsewhere. And so, the money that we have been investing to grow AMC Theaters on Demand is money, I think that instead, we ought to be putting in placing a significant number of branded credit cards or taking popcorn to the home popcorn market. So, I think that as we look to 2023, we're going to look to either phase out AMC Theaters on Demand or alternatively joint venture with another party to offer that same capability to our guests, but not only -- but not necessarily to investment spend to build it up ourselves.\n\nSo, I mean it takes me to a point that at a time when dollars are presses because the recovery of the movie industry has taken a considerable time. You and I agree, Sean, that we need to be laser-focused on making sure that every dollar counts. Because every dollar of expenditure increase every possible dollar of revenue back to best ideas, walk away from the ideas that may be intriguing but maybe a lower grade priority.\n\nSean Goodman -- Executive Vice President and Chief Financial Officer\n\nTwo questions -- thanks, Adam. Two questions here that you did mention in your prepared remarks, but people are asking when can they expect to see AMC-branded popcorn on the shelves. And what is the long-term potential of the partnership with Zoom? So maybe you want to add a little bit more color. \n\nAdam Aron -- Chairman and Chief Executive Officer\n\nSure. Sean and I have been at many a taste testing of one recipe after another for our ready-to-eat popcorn and our microwaveable popcorn that's going to hit shelves in the first half of 2023. We've seen the packaging, which I think is beautiful. We've had numerous conversations with major national retailers and are getting really favorable response.\n\nPeople want to carry this product on their shelves. You're going to see it in the first half of 2023. I was supposed to caveat everything because you never know what can go wrong, but my firm expectations is on the shelves first half of the year. As for Zoom, I was in the hotel industry for a good chunk of my career.\n\nThe meetings market is a multibillion-dollar market. And for any of you who've gone to a hotel for a meeting and sat in their ballrooms or in their breakout rooms, their chairs are not comfortable. When you compare the comfort of an AMC signature recliner seat, so what you might get at a hotel? We beat them. Traditionally, we've only been offered to offer meetings at our theater as a stand-alone entity.\n\nNow thanks to our partnership with Zoom, we're going to be able to link up theaters in city after city so that people who want to have a nationwide meeting and setting that to get everyone to fly on a plane and go to a convention city can do so simultaneously at our theaters. And I saw some reaction to the press announcement yesterday at Zoom. Why would people go to a theater? Why don't they just sign in on Zoom? Because like Zoom is an amazing thing. As you know, we -- like we run our whole company on Zoom for like two and a half years now.\n\nBut the answer is when you've got 50 or 100 people in a city and you got those 50 or 100 people in a dozen different cities, it's not the same thing to have 500 or 1,000 little mini pictures on a Zoom screen, where everybody is alone either at their desks in the office or maybe at home or somewhere else signing into Zoom one by one by one by one. This gives us the best of both worlds because people can still gather in a medium-sized group in a city and be hooked up through really sophisticated Zoom technology in another city or in another city, in another city, and another city because we could hook up multiple cities with no problem. And I got to tell you, this idea was the idea of the CEO of Zoom, who literally called us up and wanted to share with us his idea how Zoom could make AMC theaters a compelling entry in the meetings market. And the second we heard the idea, we were all for it, and we think the financial opportunity is big.\n\nRemember, we already do $20 million a year on meetings business, and that's without the ability to link city after city at the same time. So don't give a specific goal, but hopefully, the revenue opportunity is large.\n\nSean Goodman -- Executive Vice President and Chief Financial Officer\n\nThanks, Adam. So, a question about our operations, especially looking into 2023 in the current environment. The question is we're all seeing the impact of inflation on our daily lives. How is this impacting AMC?\n\nAdam Aron -- Chairman and Chief Executive Officer\n\nSo for those of you who are under the age of 35 on this call, you probably don't even remember what inflation is. But for those of us who are old enough to remember Jimmy Carter when he was president of United States, we lived through inflationary periods, and they stress the system because costs rise. And if you want to know how much they raised costs, just look at what the national inflation rate is. That tends to be the cost, and everything goes up in the country.\n\nWhat's -- so in terms of a starting point, when you hear inflation statistics being reported nationally, you should assume that AMC's costs are going to go up by a similar amount. Having said that, what is very unusual in AMC's case is that because the box office is on a path of recovery, the volumes that we're seeing in our theaters, the volumes of customers that we're serving is rising dramatically. And as a result, we pick up operating efficiencies and increased operating productivity because the number of guests coming into our theaters is coming down, essentially because we're spreading our fixed costs over more people. So, we're in the enviable circumstance that we've got a mitigating offset to inflation.\n\nThe increasing productivity that comes from being able to spread our fixed cost over a larger customer base is offsetting a big chunk of the inflationary costs that would otherwise not be mitigated without this increasing volume of customers for productivity gains.\n\nSean Goodman -- Executive Vice President and Chief Financial Officer\n\nAnd then the next section here is a couple of questions about the stock. And the first one here is, please explain why you believe the stock has gone down and why management has been generally silent on this matter. \n\nAdam Aron -- Chairman and Chief Executive Officer\n\nSo, this is the biggest question of the day, isn't it? Let me start by saying I am a major AMC shareholder. It is an enormous part of my net worth, and I venture to guess that I personally own more shares than anyone listening on this call today. So, I assure you that just as you watch the share price, I watch the share price. Having said that, in terms of decline, there are a lot of factors.\n\nThese aren't the only reasons why the share price has fallen. But look around at what's happened in the United States and, for that matter, the planet over the past several months. There's a war going on in Ukraine, which is not good for global stability. It's caused the surge in energy prices.\n\nIt's caused dramatic inflation, which, in turn, has caused the Fed to commit to raising interest rates. These are all factors that have affected the market overall. In the case of the movie theater industry, in early September, Cineworld also declared for Chapter 11 bankruptcy protection, which also created a certain amount of agita around the movie theater industry and our share price. It also does depend on what your time frame is, of course.\n\nBecause while the share price is lower than it was in, let's say, June of 2021, it's still a lot more than it was in January of 2021. But what I just said is about all you'll ever hear me say about our share price because you asked sort of like why is management silent on this subject. There are things called securities laws in the United States. And if you're the CEO of a public company, it is much better for you to be talking about the state of the business than the state of the share price.\n\nAnd I know this is frustrating to some of you who would like me to comment all the time. But prudence says that our focus and our public focus should be what we're doing to bring back the health of the business over the short, medium and long term, and that's what we should be talking about. And so that, in fact, is what we have been talking about. We said earlier in the year that you should never interpret silences in action or indifference.\n\nWe are aware this subject is very important to you and to all of us as significant shareholders of the company. Having said that, our focus and our public commentary is usually constrained to what's in the best interest of the business, what's the future of the business, what are the risks in air of the business, and that's what drives our public commentary.\n\nSean Goodman -- Executive Vice President and Chief Financial Officer\n\nThen there's a follow-up here, which is asking, can we reverse split the APE shares? \n\nAdam Aron -- Chairman and Chief Executive Officer\n\nIt's something that's legal to do. But interestingly, an action like that would require a shareholder vote, which should remind us all since there are many shareholders on this call. This is your company. Day to day, we run it.\n\nWe do our best on your behalf. But on major topics of governance, shareholder vote is required. And that would be one, for example, that we would have to take out to the shareholders for their opinion and their consideration and ultimately their decision. \n\nSean Goodman -- Executive Vice President and Chief Financial Officer\n\nGreat. And then a question on disclosure here. Someone is asking, will you provide information on the number of shareholders and the number of shares that have been directly registered with the transfer agent, Computershare? \n\nAdam Aron -- Chairman and Chief Executive Officer\n\nSo for those of you who don't know what direct registration of shares is, our transfer agent is Computershare. And most of you hold stock through brokerages. Some of you own stock that's directly registered with the company through our transfer agent. A primary benefit, I suppose, for you when you register your shares directly with the transfer agent is that transfer agents do not allow for shorting of shares, whereas most brokerage firms do.\n\nAnd so, what we've heard from some of you is that to make sure that your shares cannot be shorted, you want to register them directly with the company and a transfer agent, which is you're right as an owner of a public security. We haven't given any guidance to any of you to do that or not do that. It's entirely your call. I should point out, it's a small number of people who have done it.\n\nAs best I can tell, it's around 15,000 or so of our millions of shareholders who decided to directly register shares. I think they've registered in the neighborhood of 10 million shares or APES with our registrar. And what -- we've decided that this is a number -- that is one of these numbers that we should publicly release so when we file our 10-Q for the third quarter, we're going to announce in the Q what the number of directly registered shares is. \n\nSean Goodman -- Executive Vice President and Chief Financial Officer\n\nExcellent. And then the last question that I have here, and then we can go into questions from analysts is, do you have any comments regarding the acquisition of Twitter by Elon Musk? \n\nAdam Aron -- Chairman and Chief Executive Officer\n\nThat's quite a question. So, the funniest comment that I heard on Twitter in the past two years was the two great means stocks are AMC and GameStop, and then there's Musk. And the guy who runs AMC is Adam Aron that begins with an A, and Ryan Cohen that begins with the C runs GameStop. And of course, there's Elon Musk.\n\nAnd somebody strung together that AMC was Aaron, Musk, and Cohen. Quite something to hold. But Mr. Musk is just taking control of Twitter, and I have no comment really one way or another whether he will do a fabulous job owning and running Twitter or not.\n\nBut what I can tell you is that the asset that he bought, meaning Twitter, this is the most incredible communications tool that I've ever seen. And if you just look back over the last, what is it now, a year and a half that I've actively been tweeting with our shareholder base, we've been able to convey hundreds and hundreds of important messages to you all about what's going on in our company, and I've been able to read literally hundreds of thousands of inbound comments back to us. I spend about an hour a day on Twitter mostly reading what you have to say, and I learned so much about what's on your mind. And of course, Twitter also gives us the opportunity not only to learn by listening from you but also to share information with you and share news with you.\n\nAnd so, I continue to be astounded by how impactful and powerful Twitter is as a communications vehicle, and I hope that Elon Musk does good things with Twitter because it's a very valuable national asset if it's run well. With that, I guess, Scott, the operator, can you see if there are any questions from our industry analysts who are on the call?\n\nOperator\n\nAbsolutely. Thank you. [Operator instructions] One moment for the first question. And we have a question from the line of Jim Goss with Barrington Research.\n\nPlease go ahead. Your line is open.\n\nJim Goss -- Barrington Research -- Analyst\n\nGood afternoon, Adam.\n\nAdam Aron -- Chairman and Chief Executive Officer\n\nHello, Jim. \n\nJim Goss -- Barrington Research -- Analyst\n\nHow are you doing?\n\nAdam Aron -- Chairman and Chief Executive Officer\n\nWell, good. Go ahead.\n\nJim Goss -- Barrington Research -- Analyst\n\nI thought I'd ask you about the Stubs A-List. It's been sort of not relevant for the past couple of years as the content and everything has been under pressure. But I wonder if you might talk about whether you have a plan to revive it, make it more relevant as the amount and mix of content improves. And where it might stand right now? What is your starting point?\n\nAdam Aron -- Chairman and Chief Executive Officer\n\nSure. The A-List was -- for those of you who aren't totally familiar, A-List is our subscription program, up to three movies a week for a fixed price of between $20 and $25 a month, basically. When we launched the program in June of '18, it instantly took off, and it popped up to as much as 15% of our total moviegoing in the United States. And we have a similar program, by the way, in London called Limitless at our -- and in Germany at our Odeon theaters in the U.K.\n\nand our UCI theaters in Germany. In Europe, the Limitless program has grown considerably. And back in the height of the pandemic when our theaters are all closed, obviously, there was nobody paying us $25 a month to go see three movies a week because all our theaters were shut. So, we put AMC A-List on pause in the United States and cranked it up last year.\n\nThe good news is we're already back to between 600,000 and 700,000 A-Listers, up from zero during the pause. And again, we're seeing, depending on the title, 10% to 15% of our total moviegoing is coming from A-List members. So, the A-List numbers have continued to rise from the second that we unpaused the program. If you look at A-Listers as a percentage of our total moviegoers, it's kind of on par with where it was prior to the shutdown, and we intend to be very aggressive going forward to continue to attract people to the program. \n\nJim Goss -- Barrington Research -- Analyst\n\nOK. The one I might ask --\n\nAdam Aron -- Chairman and Chief Executive Officer\n\nYeah, sure. Go ahead, Jim.\n\nJim Goss -- Barrington Research -- Analyst\n\nNow I was thinking with alternative content. You've tried -- you've had an opportunity to try a number of things for the same reason the areas have been under pressure. I'm wondering if there are any things you've shown on your screens that you think have some promise to be more than just better than nothing else.\n\nAdam Aron -- Chairman and Chief Executive Officer\n\nYes is the answer to your question. So, we had good success with the concerts that we showed, whether they were live or taped. We had good success with WWE and UFC events, and we've experimented with some professional sporting events. For all those things, concerts, the various sporting events, we need to secure what are called rights, broadcast rights, from the leagues or the owner of the IP.\n\nAnd in all cases, we are encouraged by the results, and so we will be on a path to try to negotiate rights with the various IP holders so that we can grow our alternative content going forward.\n\nJim Goss -- Barrington Research -- Analyst\n\nAll right. Thanks a lot.\n\nAdam Aron -- Chairman and Chief Executive Officer\n\nThank you, Jim. Operator, am I correct? Scott, that we are done with questions today? \n\nOperator\n\nThat's correct. There are no further questions at this time.\n\nAdam Aron -- Chairman and Chief Executive Officer\n\nGreat. So, to all of you who joined us today, thank you. I think I'd like to close the call with two thoughts. I said in my opening remarks that we're brimming with confidence as we look at the recovery path that AMC is on.\n\nThat's the first comment. The second comment is to keep us continuing to be encouraged and brimming with confidence. \"Black Panther: Wakanda Forever.\" \"Black Panther: Wakanda Forever.\" \"Black Panther: Wakanda Forever.\" It's going to be a big weekend in the movie theater business, and we're excited to be talking to you today shut the head of this new very big movie being released theatrically. Thank you for joining us.\n\nWe look forward to talking to you again next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJohn Merriwether -- Vice President, Investor Relations\n\nAdam Aron -- Chairman and Chief Executive Officer\n\nSean Goodman -- Executive Vice President and Chief Financial Officer\n\nJim Goss -- Barrington Research -- Analyst\n\nMore AMC analysis\n\nAll earnings call transcripts"
}