{
  "companyName": "XP Inc.",
  "companyTicker": "XP",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/xp-inc-xp-q2-2022-earnings-call-transcript/",
  "content": "XP Inc. (XP 0.59%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nAndre Martins\n\nOK. Hello, good evening, good afternoon, everyone. Thank you for participating on another earnings call of XP Inc. now for the second quarter of 2022.\n\nI am Andre Martins, I am the head of investor relations. And I'm joined here today by our CEO, Thiago Maffra; and our CFO, Bruno Constantino; as well as the investor relations team, Marina and Antonio. I hope everyone is safe and well. The materials from these results are already on the investor relations website.\n\nThere, you can find the SEC filings of XP Inc. and the definitions of forward-looking statements and how forward-looking statements of this call can differ from actual results. It's important to highlight as well that this call is being translated to Portuguese, so you can use your -- you can use the tool in Zoom to change to Portuguese. [Foreign Language] And also important to highlight that for any questions at the end of the session, you can raise your hand, and we will call you on a first-in first-serve basis.\n\nI can see that we have already seven raised hands here. So thank you for participating already. Now I will move to Bruno to kick off our earnings call. Hi, Bruno.\n\nBruno Constantino -- Chief Financial Officer\n\nHi. Thanks, Andre. Hi, Maffra, and hi, everyone. Good evening.\n\nIt's a pleasure to be here with you for, I believe, the 11th time in terms of quarterly results. As usual, I'm going to be brief in the presentation, so we can go to the Q&A as we have already many raised the hands, right? Before I start the presentation, we would like to share a video with you. We are still a little bit hangover here from the Expert that we had last week. So let's go for the video, and then I come back really soon.[Commercial break]\n\nYes. I hope you like the video. We are -- as I said, we are still recovering from Expert. It's three very intense days, and I'd like to take the opportunity and thanks for all the personnel that really made it happen.\n\nIt seems easy, but it's not. People are already working on the 2023 expert event. So it takes a long time to plan everything. And it was really amazing after three years without in-presence event.\n\nWe did in 2020 virtual, only virtual, and also in 2020 year because of the COVID. And finally, this year, we came back. So it was really, really great. And as my affirmation during the Expert, this one was special because as you already know in our numbers and everything that we have disclosed in terms of the growth in our headcount and a lot of new initiatives that we have been investing, we asked at Expert how many people, to raise their hands that was their first contact with the Expert, only internal employees.\n\nAnd more than 60%, their first time in an event like that. So the energy was really good. Just sharing that before we go to the presentation. So Andre, there are no -- let's move quickly here.\n\nSo the first -- the main highlights, I don't know if I have a lagging effect. OK. We have selected five main points here. The first one is the business model resilience, not new here.\n\nWe have been repeating that every quarter. We know we are in a tough macro environment with the bear market, and that has an impact in the investment business, especially. But despite this tough macro environment, we were able to deliver our all-time high and record quarterly revenues, BRL 3.6 billion in the second quarter this year, with also an all-time high retail revenues, a growth of 15% quarter-over-quarter. I'm going to talk more about that in a while.\n\nNumber two, we've been diversifying our revenue stream. Last year, December, we highlighted the new verticals to give more disclosure about those new verticals that are in very early stage, and they do not get the same impact of the macro environment as investments. And by the new verticals, I mean, the credit card, credit, the retirement funds and insurance. And those new verticals added together, they grew 113% year-over-year.\n\nVery strong growth quarter-over-quarter, also a strong growth, 7%. The cost discipline, as entrepreneurs, we are paranoid about keeping our costs under control. We've been investing a lot, as I mentioned. We highlight here the first semester this year, first quarter plus second quarter, we have approximately BRL 500 million invested in what we call early stage initiatives.\n\nAnd by early stage initiatives, we mean banking from scratch the direct international investment platform that also we built from scratch, XTAGE, our digital asset platform that I'm going to talk more about it, also built from scratch. And the internal advisors investments as we believe there is a huge opportunity to together with the IFAs plus internal advisors to keep growing and disrupting the concentration in the investment and financial landscape in Brazil. We've been doing all these investments, and we get hit upfront, and the revenue is not there yet. But even considering that everything is expensed upfront, we kept our margins in a very healthy numbers.\n\nAdjusted EBITDA margin above 35%, and adjusted net margin even above the top range of 24% to 30%, so above 30%. And we expect to keep like that going forward. Number four, the second quarter we have delivered a lot of new products. We are very proud of it.\n\nAnd of course those products we need to keep evolving and getting better, getting the feedback from our clients, but we delivered the debit card, the digital bank accounts, as I mentioned, direct international investment platform and the crypto, the exchange, the digital asset platform. And finally, we got rewarded as the most innovative financial service company by Valor Economico. We are very proud of that. We know we have not conquered anything yet.\n\nWe still have a lot to accomplish, but it's always good to get this type of recognition. Moving to the next slide. I'm going to just, recent developments, I'm going to talk about the direct investment, international investment platform and XTAGE, only those two. Here, we believe this can be the beginning of our internationalization of our business.\n\nWe're going to start, as always, from the low-hanging fruit. So taking our Brazilian clients that want to invest outside Brazil. And the experience is something that we really care about. And here, for those that are XP client, you're going to see that is frictionless.\n\nAnd why is that? Because everything is already embedded in the app that you're using to use and with two clicks you can open your account, you can move your money, do your FX transaction and then you are ready to buy more than 10,000 equities in U.S., ETFs, ADRs, REITs, et cetera. We are still in early stage, so we are going to move forward with mutual funds, bonds, banking service and much more, but the product is ready. So it's something that we are really optimistic about when we look for the following years to come. And XTAGE, it's another venture that we started from scratch.\n\nWe did a lot of survey with our clients. 59% of our clients already invest in crypto assets. 58%, they invest directly. And when we ask those clients that have crypto assets, almost 90% of them told us that they would have the intention to invest through XP.\n\nSo that's the reason we decided to move forward with this venture. But it's important to mention that this is just the beginning. We start with Bitcoin and Ethereum, but when we think about XTAGE, it's much more than that. It's a digital asset platform that starts with a very powerful technology behind.\n\nWe have NASDAQ as the service provider. We did a lot of research. We used our previous experience through XTAGE to choose what we believe to be the best solution in terms of scalability for XTAGE. And as we scale the business, we are ready in terms of latency and in terms of velocity and everything that needs to provide a very good UX to help our clients navigate through this digital asset platform.\n\nNow we can move directly to the KPIs and financial. The KPIs you have seen already. So I'm going to focus on the financials. I mentioned already, BRL 3.6 billion revenue; gross profit BRL 2.5 billion.\n\nWe kept our gross margin at a very high level in the second quarter as we had already in the first quarter. First quarter was 71.5%; second quarter, 72% gross margin. Basically, the main reason, mix of products, more fixed income, less equities. It has an impact in terms of commissions and helps the gross margin.\n\nWhen we look at our adjusted EBITDA, BRL 1.2 billion, a 2% decrease year-over-year and a 1% increase in the adjusted net income, more than BRL 1 billion. And I'm going to talk about the adjusted EBITDA and the adjusted net income. But the main impact there is because of the new -- the early stage initiatives that we have been investing a lot. As I said, we expensed the whole thing and the revenue is not there yet.\n\nSo there is an impact. We are always investing to have the growth in the future with sustainability in our perpetuity, and we expect those business to scale as we move forward. But the highlight here is the margins. They are a very healthy pace despite all those investments, which shows the resilience of the business.\n\nNow we can move to the next slide. Total revenues, 13% growth year-over-year, 17% in the first quarter. When we look at the first half of this year, 15% growth in the first semester of 2022 compared to 2021. Let me pause here just to mention a few highlights that I think is worth sharing.\n\nWhen we think about the product mix and the difference between a bear market to the bull market, and of course there is a difference. We have said that to many investors that you should not expect the growth of XP to be the same in the bear market compared to the bull market.  What happens in terms of product mix? In a bull market, we have equities and futures going up. We have capital market activity going up. We have listed funds, secondary trading and follow-ons of listed funds, REITs going up.\n\nThey are all connected and related. When we have a bear market, all those three together, they get hit. On the other hand, fixed income, floating and the interest on our adjusted gross cash, they benefit from the bear market because of higher interest rates. When I look at the mix, the product mix, just to give you some numbers here, equities capital markets and listed funds altogether as a percentage of our total revenue in the first semester last year was close to 35% of total rent.\n\nSo very important revenue stream. When we move to 2022 in a bear market, all those components of our revenue, they represented less than 22% of our total revenue. So a big hit. When we add all of them together, the decrease year-over-year is close to 30%.\n\nSo it says if the main revenue lines in terms of products get hit by 30% year-over-year because of the macro environment and still we delivered our all-time high gross revenue in this quarter. That's why we have that first highlight as the business model resilience because that's what we believe XP is, considering the ecosystem we have built. On the other hand, when we look at fixed income, floating, and the remuneration over our adjusted gross cash, and we add all of that together, in the first semester last year in a bull market, they represented less than 20% of the total revenue. In the first semester this year, they represented together more than 30%.\n\nSo this is just to give you the magnitude of the shift that we have in terms of the product mix. The top line, the total, is what you see in our numbers. On the right side of the slide, we have the breakdown, and of course retail keeps being the most relevant segment in our business. But I'm going to talk about institutional in a while, is still growing at a very health pace as well.\n\nSo going to the retail revenues. All-time high. We had, in the first quarter this year, we had a lot of questions from investors about the take rate of the first quarter. When you annualize the take rate, it was 1.15 in the first quarter.\n\nAnd we mentioned that we had a very weak start of the year, that March was already a better month in terms of take rate for retail business. And we didn't know what the second quarter would be but we expected to be better than the first quarter in terms of the take rate. And the take rate in the second quarter, 1.3%. So much better than the 1.15%.\n\nThe way I like to look at the take rate is the last 12 months. And why is that? Because the take rate is not only a function of the revenue, the retail revenue. It's always also a function of the denominator, the AUC, the average AUC. And when you look at the last 12 months, you have 5 data points in the denominator that makes softer in terms of changed quarter-over-quarter.\n\nSo here we have the take rate in the last 12 months. You can see that there is volatility, but it's really small volatility over quarters despite the macro environment. So we had 1.30%, 1.32% and 1.27% in this quarter, a little bit better than the first quarter, which was 1.26%. Moving to the adjusted EBITDA.\n\nBefore we go to the adjusted EBITDA, let just mention the institutional. I think it's on the annex of the presentation, but institutional revenue -- there we go, thank you. Institutional revenue, BRL 436 million was really strong, 16% year-over-year growth. And in 2021, the second quarter was the best quarter for institutional revenue, was BRL 375 million.\n\nThat's the highest quarter we had last year for institutional revenue. So a very strong pace of growth, but lower than the first quarter as we have already anticipated because we had the astonishing volume in terms of derivative demand because of the war in February in our institutional desks. Now -- and also issuer services, that is related -- that's not 100% of the investment banking revenue. There is part of it that goes into retail and institutional by distribution channels fees.\n\nBut it's approx. And as you can see, there is a strong recovery compared to the first quarter, as expected. First quarter was really weak in terms of capital market activity, second quarter much better. But when we look at 2021, still a drag in terms of capital market activity.\n\nGoing back to the adjusted EBITDA and adjusted net income. Here, the main, I mean, impact as I mentioned is the early stage initiatives. We have -- we could have done inorganically, for example, the international, direct international investments for retail clients or additional asset platform. We could have done M&As.\n\nWe decided to do organically. We think it's much better. In terms of cost it's much less money, but we need to recognize all the expenses upfront. We expect those businesses to scale over time.\n\nAnd we know this is an issue because of the reduction in the margins, and that's why we decided to highlight here so you can have a sense of how much we have been investing for our growth in perpetuity and the impact that those investments they have in our margins. In the first semester, BRL 500 million, approximately BRL 500 million invested. And the revenue is at very, very early stage, and we expect, as I said, to see the revenue growing from -- in the following years. And I think with that, I stop here and let's go directly to the Q&A so we can answer all doubts and questions you might have.\n\nThank you very much. And before we go to the Q&A, I didn't mention that, but we would love to have our investors and all of you in our Expert next year because it's an event that I believe it's worth, it's the largest investment event in the world. We are very proud of that. When I remember what used to be when I joined XP more than 10 years ago, it's really a huge event and it would be an honor to have all of you visiting us in Brazil next year for the event.\n\nWe are going to send invitations when the time comes. So, Andre, you're going to be the one responsible for the Q&A, right, Andre?\n\nAndre Martins\n\nYes, I will. And for sending the invitations as well next year.\n\nBruno Constantino -- Chief Financial Officer\n\nYes.\n\nAndre Martins\n\nSo thank you, Bruno. So as I said, we'll be answering the questions on a first -- whoever raised their hands first. I know that Rosman fell off, but he was, I guess, No. 5 year.\n\nSo we will start with Andrew from Morgan Stanley. And I kindly ask you to limit to one question so we can be productive and everyone can ask their questions. So again, thank you very much for the interest. And now, Andrew, can you hear us?\n\nJorge Kuri -- Morgan Stanley -- Analyst\n\nIt's Jorge Kuri from Morgan Stanley. Hi, everyone.\n\nBruno Constantino -- Chief Financial Officer\n\nHi, Jorge.\n\nAndre Martins\n\nI'm sorry. There is a different tag here.\n\nJorge Kuri -- Morgan Stanley -- Analyst\n\nThat is fine. Thanks for taking my question. Congrats on the numbers. I guess I wanted to see if you could share with us how the business is tracking in July and so far the first day of August, how much of that normalization in inflows and AUC and take rate that we saw for the full quarter, especially versus what was the beginning of the year, continues so far in August.\n\nAnd if you also can quantify how much back to normal you are? Or is there still sort of like at the beginning of this quarter, the second quarter, a little bit weaker-than-expected trends and if we should see sort of like even further normalization to the upside for the full third quarter?\n\nBruno Constantino -- Chief Financial Officer\n\nOK. Look, if we -- if I had to answer, for example, the first quarter this year, based on January, it would be a disaster. And then we had -- because January was really weak, and we had a better March, much better March. And it was the BRL 10 billion per month net new money.\n\nSecond quarter we saw a very positive trend. We had BRL 14.3 billion net new money per month. Third quarter, I mean, I'd rather wait for the end of the quarter. What I can tell you, we have the soft guidance of BRL 10 billion to BRL 15 billion.\n\nI wouldn't change that high. And the reason is I think this business investment, it's not on a quarterly basis, right? So you need to keep convincing the clients to come and test our platform. And when they do, we hook them and then they become our clients for the long term and they keep bringing more money. That's what our cohorts show.\n\nThose that are our clients already, we have this strategy to go beyond investments, to get the other 50% of the share of wallet that we still don't have, right? And we just launched the digital bank account and all those investments that we've been doing. So this thing, it will pick up in the future, as we believe, but it takes time. So until we get there, the BRL 10 billion to BRL 15 billion per month of net new money seems a reasonable soft guidance considering that we do not have the tailwind that we had in the bull market. For equities and people wanting to trade, new individuals, opening accounts at the stock exchange, that's not happening anymore.\n\nAnd despite all of that, you saw the numbers of the second quarter. So I will not give you the guidance of the third quarter because we do not do that. So I would say between BRL 10 million to BRL 15 billion. I know it's a huge spread like 50%, but it's because we do not know.\n\nWe can have a very strong month, a less strong month. So it's hard to tell.\n\nJorge Kuri -- Morgan Stanley -- Analyst\n\nAll right. Thanks, Bruno. And on take rate, any commentary on take rate on --\n\nBruno Constantino -- Chief Financial Officer\n\nYes, I do. Sorry, I forgot the take rate question. The take rate, the only thing that I would mention is we did have a very good take rate, at least the way I see it, in the second quarter, the 1.3%. And I'm talking about now the way the analysts look at the results, not the way I look at, but I respect that.\n\nIt's the annualized quarterly take rate, right? So the 1.3%, a very strong one. I would expect a little bit lower in the third quarter. And why is that? Because we had performance fees in the second quarter. So performance fees for the funds distributor for retail clients, it goes into retail revenue and has a positive impact on that.\n\nAnd if we take that out, roughly -- I can be wrong in the numbers, roughly speaking here, we are talking about a take rate of 1.24%, around 1.25%. So we are talking about five to seven basis points of take rate in terms of performance fees.\n\nJorge Kuri -- Morgan Stanley -- Analyst\n\nAll very clear. Thanks a lot, and congrats again.\n\nBruno Constantino -- Chief Financial Officer\n\nThank you.\n\nAndre Martins\n\nThank you, Jorge. Nice to hear from you. OK. Geoff from Autonomous is the next in line.\n\nHi, Geoff?\n\nGeoff Elliott -- Autonomous Research -- Analyst\n\nHi. Can you hear me ok?\n\nAndre Martins\n\nYes. We do.\n\nGeoff Elliott -- Autonomous Research -- Analyst\n\nYes. OK. Great. Thank you.\n\nYou've spoken in the past about your desire to speak to identify new investors who potentially could mop up some of this overhang, maybe somebody strategic come in and take a stake. Can you give us any update on that, how much progress you've been able to make there?\n\nBruno Constantino -- Chief Financial Officer\n\nWell, let me answer it this way. I wasn't -- I know Itau, they had their results today as well. I couldn't hear. So I don't know what they specifically said about that because usually investors ask them what you're going to do with their XP shares.\n\nGeoff Elliott -- Autonomous Research -- Analyst\n\nThey said they are not in a rush to sell the shares. They don't have a price target, so.\n\nBruno Constantino -- Chief Financial Officer\n\nYes, that -- yes, I mean, it's their decision. What I can tell you, Geoff, based on the talks that we have with investors, generally speaking, is there is demand. It's not a problem of demand, OK? And I know some investors have already talked directly to Itau. Our position here is to tell it to tell Itau, and we have done that, look, Itau, if you want to sell, we are here to help, to do it in a very organized way.\n\nAnd by the way, we also want to buy, OK? We have done that. As you know, we have a share buyback program in progress for Class A shares, the listed shares. But Itau, they also have Class B shares, not listed shares, that we can buy on top of the share buyback plan. And that's exactly what we did in June this year.\n\nWe bought a little bit more than 1 million Class B shares from Itau when they decided to sell a small part of their stake to go below the 10% total capital in XP, so they didn't get the impact in their Basel ratio. And we are ready to buy more shares if they want to sell. We only can buy Class B shares outside the share buyback program. From other investors, I am pretty confident that it's not a demand problem.\n\nBut we have to rely on Itau, right, so it's their shares, not ours, unfortunately.\n\nGeoff Elliott -- Autonomous Research -- Analyst\n\nThank you.\n\nAndre Martins\n\nThank you, Geoff. OK. Next is Mr. Otavio Tanganelli from Bradesco.\n\nOtavio Tanganelli -- Bradesco BBI -- Analyst\n\nHi, Andre, Maffra, Bruno. Thank you for taking my question. have a real quick one. It was a little puzzling to me to see EBITDA margins compressing in the quarter given that everything that you mentioned about operating leverage and cost discipline.\n\nSo I understand that you're ramping up some of the products that are expected to mature in the coming quarters. But if you could just give us a little background, what's requiring such a high level of investment or what are your plans for this in the coming quarters when we expect this to actually reap the benefits of this operating leverage.\n\nBruno Constantino -- Chief Financial Officer\n\nYes, sure. I will start here and Maffra feel free to join me if you feel like tell you. Otavio, I mentioned about the organic or inorganic decision. For example, Itau, they acquired Avenue, right? It's our direct international investment.\n\nWe built from scratch. Everything that we did to put in the app, the transaction for our clients, from scratch. Everything went through our cost and expenses. Another example XTAGE, same thing.\n\nNo, no, we could have tried to buy Macao bitcoin, for example. We didn't, we built from scratch. It costs and it goes in our P&L. And despite all of that, we kept our margins at a very healthy pace.\n\nAnd we believe those new businesses, early initiatives, they will pay off, more than pay off. And they also give us optionalities for our perpetuity growth. We are always thinking about innovation and perpetuity always. And we need to plant the seeds at some point in time.\n\nAnd that's exactly what we've been doing. In terms of the BRL 500  million in the first semester that I mentioned, we have two main impacts in the short term, OK? Cards, banking in cards, specifically cards in the COGS because they have been [Inaudible]. So as -- and you know you have analyzed new bank and other players in the market, as you keep growing your number of cards and the growth of revenue on cards, you have a lot of expenses from uploaded at front, right, front uploaded that are set. And that's exactly what's happening.\n\nYou saw our TPV in this quarter, BRL 5.5 billion, growing a lot quarter-over-quarter because we have a small market share. We have a lot to cross-sell internally. So this will keep growing. And the cost goes together.\n\nWhen we look at the cohorts, Morgan pays off, but we expect to keep growing. We do not have, for example, the credit card at the Rico brand. We intend to have. It's going to be an investment, and it's going to be in our P&L.\n\nInternal advisors, same thing, we are growing, IFAs, as you saw the number, and internal advisors. And why is that, because there is more than 50,000 bank managers in Brazil. We believe there is a window of opportunity for us to grow in this business, and we believe it's a human business, advisory business in the next three years, three to four years, and we want to accelerate that. When our IFAs hire new IFAs, it does not go into our P&L straightforward, only when the revenue comes through commissions.\n\nBut when we hired our internal advisors, it goes upfront. And then as this advisor has the custody, the portfolio of the clients and start to build that, it more than pays off. It's breakeven in less than 15 months. So it's an investment that goes through the P&L and brings the margin down.\n\nAnd we have been investing a lot in all of that. And we are going to keep investing because we believe it's what we need to do, and there is a huge opportunity, and it pays off. But in the short term, it has this impact. And as I mentioned, the way we look internally, despite all of that, the costs are under control.\n\nLet me give you one data point. So you can follow my rationale here. Year-over-year, we have grown our headcount base by more than 40%, second quarter last year to second quarter this year. When we look at our personnel expenses, people plus bonus, altogether they represented in the second semester last year 24.4% of our net revenues, call to 25% of our net revenues.\n\nIn the first semester this year, you have this statistical effect because we had less than 4,500 people in June 2021, and we ended this quarter with more than 6,300 people in our company. And our personnel plus bonus expense is below 25% of our net revenues. So our cost, we are paranoid about that. But of course, it's going to grow.\n\nWe are hiring a lot of people. We are building new businesses. And the revenue is not there yet. But despite all of that, we believe the profitability of the business is healthy, which gives us the comfort because we are very conservative for certain decisions.\n\nWe are aggressive in some and conservative in others. We do not have the crystal ball here. We do not know what's going to happen, inflation all over the world with global recession. So the macro environment that we do not control, we need to be prepared for the worst, but we are not going to have a short-term view.\n\nIf there is a clear strategy that we believe it makes sense for XP in the long run and the time is now because we see this window of opportunity, we are going to invest and that's exactly what we've been doing.\n\nThiago Maffra -- Chief Executive Officer\n\nThis point is very important, Bruno. We will not like a favor a short-term result instead of like a long-term investment that we believe will return to our shareholders. So credit card, it's a JPY-curve, internal IFAs and other many investments that we have been doing during this year. And we will keep investing because, as Bruno mentioned, the payback is very short.\n\nIn some business they are like 12 months and some other 24 months. So we'll be investing for the whole year here.\n\nBruno Constantino -- Chief Financial Officer\n\nWe are not accelerating more because we need to find, for example, the advisory business. Either IFA or internal. We need to find the right advisor, train, et cetera. If we had the certainty that we have found the right ones and would double, we would do it, we would.\n\nBut it takes time, but we're going to keep invested.\n\nOtavio Tanganelli -- Bradesco BBI -- Analyst\n\nThank, guys. Super clear.\n\nAndre Martins\n\nThank you, Otavio. Moving to Tito Labarta from Goldman Sachs. Hi, Tito.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nHi. Good evening. Thanks, Andre. Hey, Bruno, Maffra.\n\nOne question. Following up a little bit on Otavio question on margins. But digging a little bit more into the expenses which spiked a lot. I know you talked about personnel expenses.\n\nYou have a lot more people than you did last year. Can you give some color in terms of hiring needs going forward? I think you had mentioned you would expect that to slow down a bit. Just we have 8,000 people by the end of the year. Any color you can provide on that.\n\nThe other expense that increased a lot was also data processing, up like 60% compared to last year. Is that related to just the investments in the  apps? Or just some color on that to help us think about how to, I guess, forecast the model some of these expenses from here just given there was a big spike in SG&A in the quarter.\n\nBruno Constantino -- Chief Financial Officer\n\nYes, sure. Just going backwards, Tito, the data processing, there is also related to the growth of headcount, the license, etc. And -- but there is also one component that in terms of accounting measures, there is some parts of it that was depreciation and became SG&A instead of depreciation in the line. So when you look at the EBITDA, that was capitalized and amortized and how it's expensed through the time of the contracts that we have.\n\nBut we can discuss that offline in details with you later. Look, the number of headcounts in the second quarter, it was a little bit more than 6,300 personnel. And in the first quarter was a little bit -- December was a little bit less than 6,200 personnel. So the growth of personnel headcounts in 2022 has not been that significant, right? The growth happened mostly in the second semester last year.\n\nWe started all those new initiatives, the digital -- the direct investment platform in U.S., the XTAGE. October, September last year we hired personnel along. To look forward for the base of what we have, I would not expect the headcount growing a lot. It can grow, but it's going to be single digit, right? What can change that is internal advisors.\n\nAs I mentioned, we are -- we think there is a window of opportunity in the next three to four years, and we believe investment is a business of advisory service. So I have faith in internal advisors. We want to keep growing. And it's much more a matter of finding the right personnel to join us in this journey than anything else.\n\nSo if we do not find, we are going to -- and we are very data-driven, right? So for example, we were hiring and then we follow up the data and then we said, look, the strategy, hiring this type of personnel, it's not the best one. Let's go back there and accelerate other front. We have the XP Future. As you know, it's -- education is in our DNA.\n\nSo we have built a lot of tools to help the advisor, even those that are not from the financial world to be successful in the financial world and those that have a commercial skill. So we've been doing a lot there. The growth of personnel there, it's going to depend on finding the right people. But if you think that there are more than 50,000 bank managers, I mean, we could grow a lot there.\n\nI know I didn't answer your question specifically because I can't. It's data-driven. It's like Central Bank answering questions about inflation that is data-dependent. It's like that, right?\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nNo, understood. But that's some helpful color. Just one quick follow-up. Just on the bonus because you mentioned, I guess you get paid in 2Q and 4Q.\n\nIf I look -- it looks like there was a jump last year in 2Q, but I don't see as big of a jump in 4Q, but is that what we should expect, kind of a similar level in 4Q in terms of bonus?\n\nBruno Constantino -- Chief Financial Officer\n\nYes. Look, the bonus as a percentage of net revenue, look at a semester base, that's my advice. It's better than on a quarterly basis. And when you look at the first semester, this year, it was 13.4% of net revenue.\n\nSecond semester last year was 15%, even higher of net revenue. And first semester last year was 13.7%, a little bit higher compared to -- on a percentage basis compared to the first semester this year. They are part of the bonus that they depend, they are more objective. They depend on performance fees, they depend on institutional desks.\n\nAnd then only in December, we will know, right, because it's the whole year when it ends. But I would expect to keep close to those percentage as percentage of net revenue on a semester base.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nOK. That is clear. Thanks, Bruno.\n\nBruno Constantino -- Chief Financial Officer\n\nSure.\n\nAndre Martins\n\nThank you, Tito. Have a good one. Next is Thiago Batista from UBS. Thiago?\n\nThiago Batista -- UBS -- Analyst\n\nHi, guys. Thanks for the opportunity. Can you hear me?\n\nBruno Constantino -- Chief Financial Officer\n\nYes.\n\nThiago Batista -- UBS -- Analyst\n\nMy question is about excess capital or excess cash of XP. I'm trying to figure out how supplied is XP nowadays? The company is presenting, let's say, an EBITDA or earnings of BRL 1 billion per quarter. But it's tough for us to really see this as excess cash or capital. So in your view, the company has this excess capital or in a different way, is XP still an asset-light company or all this cash consumption that we are seeing in XP is more a temporary event because all the investments that we already mentioned, Bruno.\n\nAnd in the future, we will see the company again being a kind of a asset-light company? Or no, the new business have changed the profile of the company and XP should become more -- require more capital? So how you guys are seeing this -- the capital of XP?\n\nBruno Constantino -- Chief Financial Officer\n\nYes. No, I'll start -- let me start answering you, Thiago, that, yes, we believe that we are in a supply business and we want to keep like that. We do have some capital requirements, especially because of the credit card business. And the credit business, we can mitigate a lot of capital because most of it is collateralized.\n\nBut mainly we use our cash flow, and we do generate a lot of cash every month. We do use our cash flow for our market-making activity. That's where most of the cash goes. So the market-making activity is something that in the future as the Brazilian capital markets keep developing, it should require less capital from our warehouse.\n\nIt works like a warehouse, buying and selling in the secondary markets. There are some products that these works much more like a brokerage fee, but the nature of the product requires a spread, you buy and you sell like fixed income, for example. But that's where most of the capital goes, OK? But when we look at our adjusted gross cash, we have close to BRL 10 billion of adjusted gross cash. But this cash is being used mostly for market-making activities in our books.\n\nIn the past, in the recent past, we have used a lot of cash for two main lines, I would say. Number one, IFAs, as you followed since 2020 when we had a huge attack in our IFA network and we invested to have the long-term contracts with our IFAs. And you can say -- you can look at that in our prepaid expenses, close to BRL 4 billion. And M&As, mostly with minority stakes in assets, asset managers and some funds that we have seen.\n\nAll that together, this is close to BRL 2 billion in total. We are talking about BRL 6 billion, roughly speaking. We do not foresee anything close to this amount in the future, right? And we have done that with our own cash generation. So that's for me a proof of how asset-light we are in that sense.\n\nBut to answer your question about the capital return, yes, the new initiatives when they mature, they will return the capital. Capital markets activity when the Brazilian capital markets develops, it's going to need less capital from us, and we are going to be able to return the capital. And in the credit space, we want to grow in this business but not using our balance sheet. Of course, we're going to have to use something of our balance sheet as a warehouse, then we cycle and securitize and have a good product to distribute for independent asset managers using our ecosystem.\n\nWe want to disrupt the credit business through the asset management business and not through our own balance sheet. And it's something, in our view, similar to what the hedge fund industry has done in the United States to the banks in the United States. We believe there is a win-win situation here for the Brazilian capital markets for democratizing investments for individuals and for our ecosystem to grow and penetrate in the credit world. So yes, we are going to keep being an asset-light business model.\n\nThiago Batista -- UBS -- Analyst\n\nVery clear, Bruno. Thanks for the answer.\n\nAndre Martins\n\nThank you, Thiago. Have a good one. So I'll pass the word here to Eduardo Rosman from BTG Pactual because he was first in line, and then he fell off the call. Rosman, can you hear us?\n\nEduardo Rosman -- BTG Pactual\n\nYes. Can you hear me?\n\nBruno Constantino -- Chief Financial Officer\n\nYes.\n\nEduardo Rosman -- BTG Pactual\n\nHi, Bruno. Hi, Maffra and Andre. My question is a follow-up on Thiago's one. I think it's an important theme because XP, you have been growing earnings quite fast over the last few years.\n\nBut when we look to ROE and ROA, they have been trending down, right? So I know that recently, if I'm not mistaken, you raised also BRL 1.8 billion in debentures to run day-to-day operations. So I'm just trying to understand here, if ROE and ROA, if this is a metric that you follow internally or not because I know you talked about net margin and EBITDA margin. But like I'm just trying to understand here if you have any sort of a long-term ROE? Or is -- just trying to understand here what could be your returns longer term?\n\nBruno Constantino -- Chief Financial Officer\n\nSure. Sure, Rosman. Yes, we do follow all the metrics. That's one of the metrics that we follow.\n\nBut basically, what you mentioned about the ROE or ROA decreasing, it's more, in our view more a consequence of the macro environment than anything else. We do not -- look, our credit portfolio, it's not being. It's BRL 12.9 billion in the second quarter. It was nothing in the past.\n\nWe -- the best way at least for me that I'd like to think about when you -- now we have entered in the banking world with our own bank. But the reason we have a bank is different than our competitors, the income mix, right? We have a bank now because we realized we need to go beyond investments to serve our clients. And by that, digital bank accounts, other products, other services and you need a bank license for that. So we are an investment platform that acquired a bank.\n\nIf you look at our organizational charge, is the only one in Brazil that has a broker dealer with a 100% subsidiary that is a bank as we speak today. All the other players in the market, they are the opposite we are on. So the leverage of the bank is something that we do not use at full speed as we speak right now, OK? Because of this logical sequence that led us to have a bank. The impact in return on equity and etc., has much more to do in my view with the macro environment.\n\nWe lost billions of revenues year-over-year because of the macro environment. If you look  at equities and futures, for example, it used to be our main line. I mentioned the mix of equities and future plus capital markets plus listed funds, it used to be more than one-third of our total revenue. Now it's close to 20%.\n\nThat's a lot going down, and that's not market share being lost on the contrary. We still have 50% of market share in equities and features in the secondary market in Brazil. It's a macro impact. Of course, that hits the operating leverage of the business.\n\nWe more than compensated that with other business, new verticals, etc., fixed income, floating and so on. But for example, credit card has a lower margin because of the investment. So it's a mix, a portfolio mix that has an impact. Plus the BRL 500 million that I mentioned.\n\nSo when the macro environment is different, I expect the metrics that you mentioned to scale back the way you see.\n\nEduardo Rosman -- BTG Pactual\n\nOK. Thanks a lot, Bruno.\n\nBruno Constantino -- Chief Financial Officer\n\nSure.\n\nAndre Martins\n\nThank you, Rosman. Next is Credit Suisse. Hello?\n\nUnknown speaker\n\n[Foreign language]\n\nBruno Constantino -- Chief Financial Officer\n\n[Foreign language]\n\nAndre Martins\n\n[Foreign language]\n\nBruno Constantino -- Chief Financial Officer\n\nOK. Thank you, Talis. Now look, in terms of the cash flow, it's more than the BRL 500 million per quarter, you mentioned. It's close to the adjusted EBITDA.\n\nIf we do not have M&As and incentives or for the IFA, as you mentioned. And we did have a small M&A in the second quarter, probably BRL 100 million, roughly speaking. And the IFA was less than the BRL 300 million that you mentioned, OK, a little bit more than BRL 200 million, BRL 200 million. It's hard to forecast that number going forward.\n\nWe analyze case by case. As we said in the past, we do have the benefit of knowing very well all the IFAs in our network and we decide based on the math that makes sense for ourselves. If it doesn't make sense, we are not going to spend money in a long-term contract with IFAs. If it does make sense, we are ready to do so.\n\nAnd that success is what we've been doing. We have done a lot already. So that's why we do not expect the same pace going forward, nothing close to that. But on a quarterly basis, you can have fluctuations.\n\nLast quarter, for example, it was close to nothing. This quarter was a little bit higher than the BRL 200 million. Look, the cash flow -- and I just -- I remember now that I didn't answer the second question of Rosman about the BRL 1.8 billion debentures. So this is just going back, Rosman.\n\nThis is something -- we want to leave an open relationship with the local bond market. And we -- in May, we repaid the last bond. We have BRL 800 million of bonds issued by our holding company in Brazil. And then BRL 800 million in the past is close to BRL 3 billion to BRL 4 billion nowadays considering the size of XP.\n\nAnd we did BRL 1.8 billion. That's not much considering the size of the relationship. We had a very strong demand for that issuance in the market, close to BRL 3 billion. We were going to do BRL 1.5 billion, and we decided to have more idle cash considering the scenario.\n\nAs I said, we are aggressive for some things, conservative for others. In a bear market, we like to have more cash than many. Now going back to your question. Looking forward, I would expect something close to the adjusted EBITDA.\n\nSo the BRL 1.2 billion per quarter, when we have -- there is a volatility when we pay bonus, we pay on a semester base. So there is a drag in the cash. We are going to have that in August this month. We are going to have in February next year.\n\nBut despite that, it's basically the adjusted EBITDA close to that, our cash conversion. The working capital is really small. In the second quarter we have a small -- more than BRL 100 million of working capital that is impacted by performance fees. So -- but it's really short term.\n\nIt was paid in July, OK? But in June, when you closed the balance sheet, there is a revenue recognized in June from performance fees was close to BRL 150 million, that is paid in less than 30 days, right? So that's basically the main fluctuations that we have. M&As, IFAs outside the P&L performance fees, a payment of bonus on a semester base, the rest is pretty much close to the adjusted EBITDA.\n\nUnknown speaker\n\nThank you. Thanks, Bruno. Thanks, Thiago. Appreciate it.\n\nAndre Martins\n\nThank you, Talis. Bye. Next question comes from Neha from HSBC. Hi, Neha.\n\nNeha Agarwala -- HSBC -- Analyst\n\nHi, Andre, Thiago, Bruno. Congratulations on the results.\n\nBruno Constantino -- Chief Financial Officer\n\nHi, Neha.\n\nNeha Agarwala -- HSBC -- Analyst\n\nI have two questions, quick ones. First one on the credit revenues, which looked a bit softer this quarter. So could you shed some light on that? And the second question is on the tax rate. I mean, the tax rate has been pretty volatile over the past few quarters.\n\nSo how should we think about this in the coming quarters? If you could give us some sense on how to forecast. Thank you.\n\nBruno Constantino -- Chief Financial Officer\n\nSure, Neha. I didn't hear well your first question.\n\nNeha Agarwala -- HSBC -- Analyst\n\nCredit revenues.\n\nBruno Constantino -- Chief Financial Officer\n\nThe what, sorry?\n\nNeha Agarwala -- HSBC -- Analyst\n\nCredit revenues were a bit softer this quarter.\n\nBruno Constantino -- Chief Financial Officer\n\nCredit revenues. Yes, yes, yes. Credit revenues on a quarterly basis is tough. We have sometimes some bigger onetime transactions in terms of credit that you have like a fee upfront that can create a distortion.\n\nIn the first quarter, we had something similar to that, that made the first quarter like a tough comp. The credit part, we are going to keep growing. But again, here, our decision process is about the risk than to hit any target, whatever, right? We are owners of the company, we think for the long term. So if we are risk-averse in terms of the credit, and we do not want to grow the credit business, we are not.\n\nIf we feel comfortable about it, as you can see in our NPL ratios, we are going to keep doing if we are comfortable about it. Regarding the tax rate is -- the way I like to think about the effective tax rate, that's the best way to look at it because remember how the market-making activity that goes from specific fund, it has a 15% to 20% tax bracket that is not recognized in our financials. So the revenue goes net from that tax. But the tax does exist and we paid that tax.\n\nWhen we add that back, we have a tax, effective tax rate normalized of close to 15% in the first semester this year. That's low. We expect in the future to have higher effective tax rate. But that talks to the capital market activity as well, right? When we have, for example, a strong capital market activity, most of the revenue goes into the broker-dealer level with a 40% tax bracket.\n\nAnd then the effective tax rate goes up. When we do not have that, we have more cost than revenue at the broker-dealer level, we have the tax benefits of the credit of the expenses at 40%, and this lowers the effective tax rate. So going forward, I would expect, as the capital market activity specifically keeps rising, the tax rate should increase compared to what we had in the first semester this year.\n\nThiago Maffra -- Chief Executive Officer\n\nYes, the point here, Neha, is if we have a different revenue mix for the future as the capital markets comes back, we will have a higher tax rate, but we will have higher revenues in absolute numbers. So if you see higher tax rate, you see much higher revenues, OK?\n\nBruno Constantino -- Chief Financial Officer\n\nThat's correct. And I'm -- I said at the beginning of the call that I'm still with the hangover of Expert, right? I forgot, Thales. On your previous question I forgot to mention the buyback. We have been buying back shares as well.\n\nSo that's  also part of the cash flow that we have been doing. We've done more than -- we have done approximately one-fourth, a little bit more of one-fourth of the whole buyback program we have announced back in May, right? Sorry, move forward.\n\nAndre Martins\n\nThank you, Neha. Next is Mario Pierry from Bank of America. Mario?\n\nMario Pierry -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Good afternoon. Thank you for taking my question. Just two quick questions.\n\nFirst one is a follow-up on the revenue yield that you talked about on the retail revenue yield, that you had about five to seven basis points benefit from performance fees. Can you just remind me how often are these performance fees recognized and if there were any performance fees one year ago? And then the second question is related to the integration of Modal? If you can provide us an update of the time line? What do you -- when do you expect this transaction to close? I know Modal reported earnings last night. It seems like the earnings are coming below what the market was expecting at the beginning of the year. So I was wondering also, and I don't remember if the price that you're paying from Modal, that was fixed, right? I think you were issuing like 13 million shares.\n\nBut I was just wondering, how are you seeing the performance of Modal, when do you think this transaction is going to close and any potential synergies from the transaction?\n\nBruno Constantino -- Chief Financial Officer\n\nSure, Mario. About the take rates and the impact of -- the positive impact of performance fees on the take rates. Last year, we did have performance fees in the second quarter, but it was much lower than the BRL 150 million rough numbers that we had this year. I believe it was something around BRL 50 million, something like that.\n\nI can follow up with the right number here. I don't have in front of me, but it's close to that. So usually, performance fees, we have strong numbers second quarter, fourth quarter, those two quarters, and it depends on each fund. We have, as you know, a lot of funds in our platform and ecosystem.\n\nWe do have -- for example, we have a small part of performance fees in the first quarter, but really small because of certain funds. So second quarter and fourth quarter, that's what is really relevant. And the five to seven basis points, that's the impact in this quarter of the take rate, OK? So the take rate would be 1.23 to 1.25 without the performance fee, but they do exist, and they could be even higher if the market had a positive equity effect. It's basically huge market funds, macro funds performing well that got the performance piece.\n\nYou're going to say something, Maffra, or no?\n\nThiago Maffra -- Chief Executive Officer\n\nNo.\n\nBruno Constantino -- Chief Financial Officer\n\nOK. About Modal, we expect to have the deal closed by the end of this year, but we do not control the process. We are still waiting on mainly two events. Central Bank approval and SEC approval because there is an equity issuance that we're going to do to merge Modal or have Modal as a 100% subsidiary of XP Inc.\n\nconglomerate. The number of shares, maximum is 19.5 million, and that is done, right? Regarding Modal performance, I mean, again, we have a lot of synergy there. Modal is, they do not have the diversification that we have in XP. So their business get hit is stronger because of the macro environment.\n\nIt's XP like, I don't know, 10 years ago, if we were like 10 years ago, our numbers, we would not have had all-time high retail revenue, a record of our quarterly revenue, we would not have that kind of results. But it doesn't change anything. We believe it's a very accretive acquisition. We know exactly what Modal does.\n\nWe do it internally as well. We are thinking about the synergies, but we need to wait for the authorities approved. KAJI has approved already, but the Central Bank is still planning. As you know, Central Bank, they had a strike this year that delayed a lot of process, but they have resumed already.\n\nSo we'll see.\n\nThiago Maffra -- Chief Executive Officer\n\nAnd we have mentioned in the past. As you know, we have done several acquisitions in the past. And it started historically, what we have is 30% to 50% synergies on SG&A and another 30% to 50% synergies on revenue. So that's the way to think and to model the synergies on Modal.\n\nMario Pierry -- Bank of America Merrill Lynch -- Analyst\n\nThat is very helpful. Thank you.\n\nBruno Constantino -- Chief Financial Officer\n\nThank you, Mario.\n\nAndre Martins\n\nThank you, Mario. So last but not least, Domingos from J.P. Morgan. Good evening, Domingos.\n\nDomingos Falavina -- JPMorgan Chase and Company -- Analyst\n\nGood evening, guys. Thanks also for the questions. And I'm circling back a little bit to the cash flow. Batista started and several other analysts, I guess, are asking similar questions in a different way.\n\nI'll have one more way to ask the same question. So I'll give you some sort of a base case, right? Let's assume your assets under custody or AUC grows mid-teens. And market activity doesn't accelerate a lot. And by that sentence, I am hoping you understand that basically your capital needs or cash needs don't grow a lot.\n\nBy when do you -- can you pay dividends? And what kind of payout do you think you could have? Is that a '23, '24? And I'll add to that, like the beauty of being a technology-enabled platform to a lot of investors is being on a supplied business model and a lot of people compare it to B3 which pays 90-plus percent. So this is sort of the message we're trying to get here when this cash starts flowing back to investors. The second really quick one is, it came out in the newspapers, I guess, Vila Shuspi the campus the guys are building, would it be on hold and you guys would be searching for the floors back in Faria Lima. So my question is, is that a cost savings? Do you guys give up on that or not? And what's the latest?\n\nBruno Constantino -- Chief Financial Officer\n\nYes. So your first question, Domingos, to be honest, we are a growth-driven company, right? So we are always thinking about the next innovation, the next product. And as we have a very low market share, investment is a little bit higher, but still we are not No. 1 yet, despite being recognized as the best investment platform by clients and prospects, getting the awards, but we are not No.\n\n1 in size yet. So our mindset for the short and midterm is driven to conquer all of that, right? And as we have been investing new initiatives, I don't have a number to say to you, neither a time horizon that we are going to have our cash return in and paying dividend because we have so much to do. For example, think about going international. As I mentioned, the direct investment for retail clients in U.S.\n\ncan be small still to really go international because we start with equities. We are going to have banking there as well. We're going to have other products. And then we can think beyond Brazil and even in U.S., just to give you one example.\n\nSo this mindset, it doesn't allow us to think about returning the money because we always want to do more to grow in perpetuity. That's the mindset. So I don't have a number to tell you about dividend payouts, et cetera, right now. I don't know, Maffra, if you have something in your mind to add there.\n\nThiago Maffra -- Chief Executive Officer\n\nYes. So about the second part of the question about Vila and other floors at Faria Lima. The way we -- going backwards, it's not a cost decision, OK? So it's not based on costs. At the beginning of the pandemic we had 3,500 employees, and we used to have 12 floors, if I'm not mistaken, 12, 13 floors between Geo Taca and Faria Lima.\n\nAnd now we have four floors and we have more than doubled during the pandemic. So yes, we are looking for one or two floors at the same building because we have more than doubled, OK, during the pandemic. And it's mostly for commercial people, investment banking, asset management, private, corporate, basically commercial people. And because we need -- these people, they need to be close to where the customers are and they need to be based in Sao Paulo.\n\nSo that's the reason, OK? And about the Vila, we had many problems with the construction company, license, and so many other problems, but that's it.\n\nDomingos Falavina -- JPMorgan Chase and Company -- Analyst\n\nThank you, guys. Congrats on the quarter, and good evening.\n\nBruno Constantino -- Chief Financial Officer\n\nThank you, Domingos.\n\nAndre Martins\n\nThank you, Domingos. He was the last one. So once again, I would like to thank you so much for your interest in our call. We are available for any follow-ups as usual.\n\nBruno, I think you could invite everyone again for next year's event just to finalize. And thank so much.\n\nBruno Constantino -- Chief Financial Officer\n\nWe are going to think about something that especially for our investors outside Brazil that makes your trip to Brazil worthwhile, and we include experts in that agenda. So we would be more than honored and happy to receive all of you in our event next year. But thank you. Thank you a lot for the call, and that's it.\n\nThiago Maffra -- Chief Executive Officer\n\nThank you, guys.\n\nAndre Martins\n\nBye, everyone. Thank you.\n\nThiago Maffra -- Chief Executive Officer\n\nBye.\n\nDuration: 0 minutes\n\nAndre Martins\n\nBruno Constantino -- Chief Financial Officer\n\nJorge Kuri -- Morgan Stanley -- Analyst\n\nGeoff Elliott -- Autonomous Research -- Analyst\n\nOtavio Tanganelli -- Bradesco BBI -- Analyst\n\nThiago Maffra -- Chief Executive Officer\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nThiago Batista -- UBS -- Analyst\n\nEduardo Rosman -- BTG Pactual\n\nUnknown speaker\n\nNeha Agarwala -- HSBC -- Analyst\n\nMario Pierry -- Bank of America Merrill Lynch -- Analyst\n\nDomingos Falavina -- JPMorgan Chase and Company -- Analyst\n\nMore XP analysis\n\nAll earnings call transcripts"
}