{
  "companyName": "Dutch Bros Inc.",
  "companyTicker": "BROS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/dutch-bros-inc-bros-q2-2022-earnings-call-transcri/",
  "content": "Dutch Bros Inc. (BROS 0.36%)\nQ2 2022 Earnings Call\nAug 10, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings and welcome to the Dutch Bros second quarter 2022 conference call. [Operator instructions] As a reminder, this conference is being recorded. It is now my pleasure to introduce your host, Paddy Warren, director of investor relations and corporate development. Please go ahead.\n\nPaddy Warren -- Director of Investor Relations and Corporate Development\n\nGood afternoon and welcome. I'm joined by Joth Ricci, president and CEO; and Charley Jemley, CFO. We issued our earnings press release for the quarter ended June 30, 2022, after the market closed today, and we'll file our 10-Q in the upcoming days. The earnings press release, along with the supplemental information deck, have also now been posted to our investor relations website at investors.dutchbros.com, and we will post our 10-Q there as well when it is available.\n\nPlease be aware that all statements in our prepared remarks and in response to your questions other than those of historical facts, including statements regarding our future results of operations or financial condition, strategies, plans and objectives of management, are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. All such forward-looking statements are inherently subject to risks, uncertainties and assumptions. They are not guarantees of performance and are expressly qualified in their entirety by cautionary statements. These forward-looking statements are made as of today's date.\n\nExcept as otherwise required by law, we are under no obligation to update these forward-looking statements to reflect subsequent events, circumstances, new information, actual results, revised expectations or the occurrence of unanticipated events. We may not actually achieve any plans, intentions or expectations disclosed in our forward-looking statements, and therefore, no one should place undue reliance upon them. For more details, please refer to our earnings press release and to the risk factors in our annual report on Form 10-K for the year ended December 31, 2021, filed with the SEC on March 11, 2022, and in our upcoming quarterly report on Form 10-Q for the period ending June 30, 2022, to be filed with the SEC. Finally, we will also reference non-GAAP financial measures on today's call to enhance investors' overall understanding of our financial performance.\n\nThese non-GAAP financial measures may be different than similarly titled measures used by other companies. As a reminder, non-GAAP financial measures are neither substitutes for, nor superior to, measures that are prepared under GAAP. When evaluating our business, please do not rely on any single measure. You can review the reconciliation of non-GAAP measures to comparable GAAP measures in our earnings press release.\n\nWith that, I would like to call -- turn the call over to Joth.\n\nJoth Ricci -- President and Chief Executive Officer\n\nThank you, Paddy. Good afternoon, everyone, and we appreciate your continued interest and support of Dutch Bros. Our second quarter results reflect the continued strength of our brand across expanding geographic footprint. As we announced earlier this afternoon, we delivered revenue of $186.4 million, representing a 44.2% increase from the second quarter of 2021.\n\nWe opened 31 shops during the quarter and increased our total shop count 28% compared to Q2 last year. Our real estate pipeline is strong, as is our team's ability to open and staff new shops, fueling our growth engine. Our new shops continue to outperform our expectations, and we are confident in our ability to hit our 2022 development target of at least 130 new shops, collectively providing strength and momentum moving into 2023. Same shop sales declined 3.3% in Q2.\n\nIncluded in this number is a positive benefit of pricing of approximately 5.3% and headwinds from sales transfer of approximately 140 bps. We began to see a traffic slowdown in March, but trends stabilized in June and July with monthly same-store sales of negative 2.3% and negative 0.9% in July, respectively. We are encouraged by the fact that although we took additional pricing action in the quarter, our traffic trends improved in July. Geographically, the pressure in Q2 was driven by the headwinds in California, particularly in the afternoon, with the rest of the system slightly negative.\n\nGas prices in California remained elevated relative to the rest of the country, up over 30%. We continue executing a market-entry strategy to build operational scale quickly, establishing and then fortifying our footprint and balancing market demand. Sales transfer helps ease demand-driven challenges at any one shot. These challenges may produce longer lines and potentially impact customer experience.\n\nWe believe our market-entry strategy enables us to more quickly gain position and brand awareness. And we have successfully employed the strategy in Texas with our 61 new shops in the past 18 months. In Q2, reported system comparable sales experienced 140 bps of deliberate sales transfer. That same impact was 260 bps in our company-operated shops.\n\nThese outcomes remain within our expectations. In Q2, we took a second round of pricing of about 3%. In Q2, we have about 5.3% of pricing running through our total system. Typically, we utilize pricing as one of the mechanisms to cover costs that we expect to remain elevated on a go-forward basis while we temporarily absorb more transitory input increases.\n\nHowever, many input costs that have traditionally been more transitory have remained elevated. Therefore, we are considering additional menu pricing actions in Q3. Separately, we have communicated a price increase for Rebel and Coffee being sold to our franchisees effective as of September 1. In Q2, company-operated shop contribution grew 20% year over year to $39.5 million.\n\nImportantly, in Q2, we saw a sequential 630 bps of company-operated shop margin improvement from Q1 2022 as we begin to see the impact of pricing and operational improvements flow through our P&L. For the quarter, our adjusted EBITDA of $23.9 million met our expectations and is in sync with our guidance for the full year. Recall that when we started this public company journey, we shared five key objectives: number one, continue to attract and develop our people through our growth capital; number two, open new shops wherever people want great beverages with an eye on 4,000 shops in the next 10 to 15 years; number three, increase brand awareness and encourage deeper customer engagement; four, invest in and use technology to improve the customer experience; and five, expand margins through operating leverage. And now nearly a year since our IPO, our investment thesis is holding, and we remain focused on these priorities.\n\nDespite the dynamic and the challenging macroeconomic backdrop, we are encouraged by our team's ability to react with agility. Their efforts during Q2 helped us live up to our mission and make a massive difference one cup at a time. Please let me provide a brief update on each of these priorities, starting with people development. In Q2, staffing, retention and applicant flow remained strong.\n\nTrailing 12-month shop-level turnover stabilized, holding at 66% in Q2, far below the industry average. Shop-level manager turnover remained in the low double digits, while operator turnover was once again virtually nonexistent. We attribute our comparatively low turnover metrics to our unique people-first culture, significant career development opportunities and the benefits and incentives we provide to our employees. Applications and new hiring have also been brisk.\n\nWe continue to be able to fully staff our shops while remaining a highly selective employer of choice. These factors have allowed us to continue to drive new shop growth. Over the last 12 months, we promoted 50 new operators, underscoring the meaningful development opportunities for our people. As of June 30, we have 115 operators running our 336 company-operated shops, currently 2.9 shops per operator.\n\nAs our system matures, we expect this spend to grow to between four and seven. In terms of our second objective, our new shop development remains brisk. We opened 31 shops across nine states in Q2, and this compares favorably to our guidance for the quarter of at least 30 new shop openings. In the first half of the year, we have opened 65 new shops.\n\nCollectively, these shops opened in Q2 ended the quarter with an annualized AUV of $2.1 million, exceeding our expectations and validating further development as we move from West to East. As we have stated over the past few quarters, Southern California and Texas are key to our near-term development plans. Year-to-date, we have opened seven shops in Southern California and 29 shops in Texas. In Southern California, there is a clear unmet demand as our new shops consistently open with annualized AUVs well in excess of our company-operated AUVs and are among the best in the system.\n\nWe're working quickly to infill and utilize strategic sales transfer to meet this demand. In Texas, we've opened 61 shops in less than 18 months across a number of key cities. 34 of these shops represent the initial shop for an operator. These investments in people and capacity position us to continue to scale quickly.\n\nOur market-entry strategy enables us to spread out demand while elevating the customer and Broista experiences as well as making sure the Dutch Bros brand is growing awareness in the Lone Star state. Systemwide, our 2020 and 2021 classes produced trailing 12 months average unit volumes of $2.1 million, which is approximately 10% higher than our system average, demonstrating brand strength and health. Our new shops have also exhibited a predictable volume and margin progression, typically reaching margin maturity within the first three to four quarters of an opening. Our Dutch Rewards program has continued to grow along with our shop count, ensuring we meet our third objective of increasing brand awareness and customer engagement.\n\nThe Dutch Bros app surpassed four million users in Q2, with 2.6 million 90-day active users as of June 30. In Q2, we added almost 450,000 new 90-day active members. In total, we now have approximately 4,000 active members per shop. In Q2, approximately 63% of our transactions came from Dutch Rewards members.\n\nWe believe there is a runway to expand this program as digital penetration is about 15 points higher in our legacy markets relative to our newer markets. The benefits of Dutch Rewards continue to evolve. We have begun providing customized offers that personalize our members' experience and drive trial frequency and upsizing. In Q2, we began to activate and target lapsed users, seeing increases in visit frequency and targeted users and an uptick in 90-day active users.\n\nWe are encouraged by the early results of specific campaigns, particularly those featuring our Rebel category, and look forward to expanding on these to unlock value. Cold beverages make up 80% of our menu mix. Driving traffic through cold beverage sales was a focus area in Q2. In that period, we saw same sales growth of both our Freeze and Rebel categories of approximately 10% for Freeze and 1% for Rebel, respectively, demonstrating category strength in spite of the macroeconomic and regional headwinds I referenced earlier.\n\nAnd the relationship between our Broistas and customers is paramount. We continue to invest in systems to improve the customer experience. Notably, our Dutch Pass feature gives customers the ability to preload funds in the Dutch Rewards app. This facilitates faster transaction times, speeds up lines and creates the space for more meaningful lasting connections.\n\nAdditionally, Dutch Pass users' average ticket is about 10% higher than other Dutch Rewards members. Finally, our fifth commitment is to expand margins through operating leverage. Like so many of our peers, the macroeconomic environment has impacted various aspects of our business. On our last quarterly update call, we noted that we have been impacted by higher input costs, particularly for dairy and freight.\n\nIn combination with observed weakening of consumer demand, we elected to moderate our full year profitability last quarter and are reiterating that outlook today. We've remained agile in responding to these headwinds, taking several steps to navigate the uncertainty. On June 1, we completed our second round of pricing actions since 2019 through an increase of 3%. In November of 2021, we also took a 3% price increase.\n\nWe will evaluate taking further menu price increases in the back half of the year, balancing business needs with our customers' ability to absorb further increases.On the cost side, we advanced and accelerated our efforts to achieve productivity gains in the middle of the P&L, focusing both on long-term operating changes, including testing of beverage tap systems and near-term outlier management. At the start of the year, we implemented a repair and maintenance program to reduce shop administrative burden and quickly address necessary maintenance that was challenging to execute during COVID. Towards the end of Q2, we began to bring the spending run rate down to a more normalized pace, helping our margins through the balance of the year. And we refined our labor mix and standards to better align staffing with daypart demand.\n\nWe also took steps to limit the use of overtime to the extent possible. These efforts have led to immediate results. As I mentioned earlier, in Q2, our company-operated shop margins improved considerably, 630 basis points quarter over quarter. We are encouraged by our demonstrated ability in Q2 to navigate these challenges.\n\nWe, at Dutch Bros, are here to make a massive difference. We are here for the long run, and we're just getting started. Contributing to our communities that is an integral part to our brand DNA. In 2009, our Cofounder, Dane Boersma, passed away from ALS.\n\nDutch Bros and the Boersma family started Drink One for Dane to bring awareness to and support for research to find treatments and cures for ALS. On May 20, we celebrated our annual Drink One for Dane fundraiser. By transaction count, it was the second biggest day in our company's history, and we raised over $2.3 million. Since 2018, we have raised more than $8.3 million for the cause.\n\nAdditionally, the Dutch Bros Foundation and affiliated charitable entity made donations to the Asian Pacific Fund and The Trevor Project in honor of Asian/Pacific American Heritage Month and in May -- in May and Pride Month in June. Giving back to our communities through both national and local giveback days is one of our core tenets. These efforts energize our crews and foster meaningful customer connections and brand affinity, enabling us to uphold our mission and make a massive difference one cup at a time. Also in the quarter, we surpassed two major brand milestones.\n\nWe opened our 600th shop and achieved $1 billion in trailing 12-month system-wise sales. To put this into perspective, it took us 27 years to grow to 328 shops and 3.5 years to grow from 328 to 603. We saw that there was a massive unmet demand for Dutch Bros, and we went out and executed. I couldn't be more proud of the team and what we've accomplished together, and I couldn't be more ted for the next phase of our growth and on our path to 4,000 shops in the next 10 to 15 years.\n\nNow I'd like to turn it over to Charley to review our financials.\n\nCharley Jemley -- Chief Financial Officer\n\nThanks, Joth. Before I begin, two reminders. First, as we have done in the past, a presentation containing supplemental information is posted on our Investor Relations website. That may prove helpful as you digest today's discussion or reflect upon it later.\n\nSecond, we are a fast-growing brand, particularly our company-operated shops. We intend to continue executing a company-operated shop growth algorithm guided by operational readiness and people pipeline discipline. Over the last few years, we have accelerated our unit growth and are very pleased with the continued outperformance of our new units relative to our system average. Pace of new shop development has been increasing.\n\nAs you've seen, our accelerated unit growth has driven some uneven flow of earnings, and we are very willing to accept that and continue to work diligently to manage our margins. This has clearly been made even more difficult by dynamic exogenous factors. But fundamentally, we are highly confident in our ability to drive high growth with best-in-class margins over the medium to long term. With that preamble for context, let's go over the results.\n\nCompany-operated shop revenue grew 56% in Q2 to $161 million. And overall consolidated revenue increased 44% to $186 million. Year-to-date consolidated revenue grew 48%. In Q2, we opened 31 new shops, of which 26 were company-operated.\n\nThat brings us to 65 for the first half of the year and 133 in the last 12 months. As of the end of Q2, system shop count grew 28% when compared to 1 year ago. This is well ahead of our stated objective of mid-teens system shop growth. As of the end of Q2, 336 company-operated shops were open, 62% more than one year ago.\n\nGrowth has been unlocked by our capacity to open at least 30 company-operated shops in a given quarter, which we have now demonstrated in three of the last four quarters. Looking ahead, we have a robust shop pipeline despite facing many of the same obstacles the rest of the industry is experiencing. Comparable shop sales decreased 3.3% in Q2. Throughout the quarter, we continued to experience the trend shift we flagged on our Q1 earnings call, which began in mid-March.\n\nA couple of additional points for context. We are lapping positive 9% same-store sales from Q2 of 2021. Q2 same-store sales are 7% higher than 2019's prepandemic levels. Trends stabilized in June, and that stabilization held through July, both in terms of total same-store sales and traffic.\n\nAnd as Joth mentioned, our same-store sales headwinds were driven primarily by our shops in California. The fast pace of new shop growth is driven by entry into new markets and meticulous infill around existing shops, even in relatively new markets, aggressive infill results and purposeful sales transfer from existing shops to new ones as we execute speed, quality and service objectives consistently at each shop. Reported comparable sales growth in Q2 was lower by 140 basis points for the system and 260 basis points for company-operated shops as a result of that sales transfer. This remains very much in line with our expectations.\n\nIn Q2, company-operated shop contribution was $39.5 million or 24.6% of company-operated shop revenue. After removing the 240 basis points benefit from lower preopening expenses in Q2, underlying margins advanced 390 basis points from Q1 to Q2. This improvement was a function of the following factors: a staged menu price increase that we completed June 1, which helped margins in Q2 but importantly has not yet delivered its full impact; improved labor deployment, refined to more closely match current traffic trends; better leverage of fixed costs as per shop volumes build in late spring and early summer. It is notable that after seven straight quarters of escalation in company shop beverage food and packaging percentage, we experienced a decline from Q1 to Q2.\n\nWe saw modest tempering in input cost inflation in Q2. On a weighted basis, our beverage food and packaging basket increased 12% year over year in Q1, declining about 50 basis points to approximately 11.5% in Q2. Turning now to a year-over-year comparison. Company-operated shop contribution decreased 740 basis points to 24.6%.\n\nLast quarter, we noted sharp increases in beverage, food and packaging costs. While I noted that slight moderation from quarter-to-quarter, costs do remain elevated compared to the prior year and have outpaced productivity gains and pricing actions. Slide 11 of the supplemental investor deck contains additional details of margin progression year over year. The takeaways are as follows: beverage food and packaging costs increased 230 basis points to 27.1%, and that increase was measurably slower than Q1, which increased 400 basis points.\n\nWe are starting to lap the inflation that began to show in Q2 of 2021. Labor increased 120 basis points to 29.4% year over year but was below 30% in Q2 after rising above that in the three previous quarters. Occupancy and other costs increased 340 basis points to 16.6%, in part from the aforementioned R&M spending. New shop inefficiency and preopening caused a timing drag in margins of 160 basis points.\n\nOur beverage, food and packaging costs increased primarily from input cost inflation and the reformulation of our Freeze product, which we first mentioned in Q3 2021's release. Dairy, which now represents approximately 20% of our COGS basket, reached historic highs in the spring. And while it has moderated somewhat, our costs were about 30% higher than 12 months ago. Our year-over-year labor cost increase was primarily driven by changes we implemented in 2021 to minimum staffing levels at open and close, as well as legislated minimum wage increases.\n\nAs of Q2, we have not yet been material burdened by wage rate escalation outside of those state-mandated minimum wage increases. As a partial offset in Q2, we began to realize some of the gains that will come from improved labor execution moving forward. The increase in occupancy and other costs was in part driven by front-loaded maintenance spending. Beginning January 1, we executed with some urgency catch-up spending around shop condition and preventative maintenance.\n\nThe pandemic limited our ability to fully execute that in 2021. This resulted in higher-than-anticipated R&M spend in Q1 and part of the second quarter of this year. We have two actions -- action items to address input cost inflation. First, menu pricing.\n\nJoth clearly outlined our view in his comments. Second, it is our responsibility to use our many years of experience, the deep supplier relationships and our emerging scale to reduce cost without harming the customer experience and without having to rely too heavily on menu pricing. In the short term, we sharpened our pencils and delivered margin improvement in Q2 relative to Q1. We expect to identify and achieve productivity through a renewed focus on best-in-class operations, specifically understanding and targeting shops underperforming our sales and margin expectations.\n\nA couple of quick comments on our new shops. In Q2, we experienced 120 basis points of new shop inefficiency in COGS and labor and 40 bps of increased preopening expenses. In Q2, we opened 26 new company shops, twice as many as the 13 new company shops opened in the second quarter of last year, resulting in preopening expenses of 2.2% of company-operated shop revenue compared to 1.8% last year or a 40 basis points increase. We invested $138,000 on a per shop basis in preopening expenses, slightly higher than our norm.\n\nThis is a function of the nine shops that were first shops in their respective markets, which typically have a higher per unit investment. Preopening expense is both an investment in getting a shop ready for customers but also sets the tone for the rest of the market. We have a well-orchestrated process for entering new markets. Our new shops are ramping toward margin efficiency in line with our expectations.\n\nAs a reminder, we are targeting a 30% plus contribution margin in year two for new shops. This margin excludes depreciation and would not include preopening expenses, which are typically borne in the first year.As an example, I direct you to Slide 10 in the supplemental investor deck. Our class of 2020 achieved a gross margin of 24% in the trailing 12 months, which includes depreciation expense. Depreciation for all company shops was about 5% during the same period.\n\nThis gives us confidence as we effectively hit our second year contribution margin targets in this class in spite of the headwinds we've discussed. Refining our look at menu pricing, driving operating efficiencies and the value creation from supply chain initiatives like the tap systems will drive our margins toward our objective. In our franchising and other segment, revenue decreased 1.4% to $26 million, and gross profit decreased 24.6% to $13.8 million. As a business, we sell our franchisees certain products in addition to collecting royalties.\n\nTypically, we have held these costs more or less flat over time, reducing variability and helping franchisees control their margins. However, over the past 12 months, underlying input costs rose considerably, impacting segment profitability. As mentioned, we have communicated a price increase to our franchisees for their purchases of Rebel and Coffee beans related to the products we sell to them. Shifting now to G&A.\n\nWe are beginning to realize G&A leverage. In the second quarter, our total G&A grew 26% relative to total revenue growth of 44%. As a percentage of total revenue, G&A was 22.7% versus 25.9% in the second quarter last year. We expect that our G&A will continue to leverage as we gain scale.\n\nPlease note that our G&A was burdened by 120 basis points of public company costs and 110 basis points of stock-based compensation. Now for a few comments on liquidity. Our balance sheet is strong and well capitalized. As of June 30, we had $21 million in cash and equivalents and $148 million drawn on our revolving credit facility and in term debt or a $126 million net debt position.\n\n$352 million in committed undrawn debt capacity remains with an option to further increase our liquidity if needed. Shifting now to guidance. For the full year 2022, we are affirming our guidance from last quarter. Total system shop openings are expected to remain at least 130, of which at least 110 shops will be company-operated.\n\nTotal revenues are projected to now be at least $715 million. Same-shop sales growth is estimated to remain flat. Adjusted EBITDA is estimated to remain at least $90 million. Capital expenditures are estimated to remain in the range of $175 million to $200 million, which includes approximately $15 million to $20 million for our new roasting facility that we project will open in late 2023, early 2024.With that, I'll now turn it back over to Joth for closing comments.\n\nJoth Ricci -- President and Chief Executive Officer\n\nThank you, Charley. For 30 years, Dutch Bros has been in the business of building and nurturing relationships. And we have all the building blocks to remain a successful and enduring company, including a powerful authentic brand; strong people systems that drive company culture and fuel our shop growth; a highly engaged customer following; customizable and uniquely curated beverages; highly consistent and highly attractive unit-level economics; a portable model that is successful across geographies; a strong and well-capitalized balance sheet that provides ample liquidity; and an engaged co-founder and a very experienced leadership team. We've been there, and we will continue to be there for our people and our customers as we navigate through near-term headwinds while keeping our eyes keenly focused on our long-term opportunity to expand our footprint and create real value for our shareholders.\n\nThank you again for your interest in Dutch Bros. And now we'd be happy to take your questions. Operator, please open the lines.\n\nOperator\n\n[Operator instructions] Your first question comes from Sharon Zackfia with William Blair.\n\nSharon Zackfia -- William Blair -- Analyst\n\nHi. Good afternoon. I guess, Joth, I recall and you mentioned that you were going to do that promotion with Rewards in June around Blue Rebel. It sounds like you had a good response to that and maybe even did something with Freezes as well.\n\nCan you talk about the learnings from that and how you might use that kind of more targeted offer dynamic in the third quarter? And then, Charley, I just wanted to quantify what you're expecting for commodity inflation in the back half of the year versus the 11.5 you saw in the second quarter. And are you including an additional price increase in the guidance?\n\nJoth Ricci -- President and Chief Executive Officer\n\nWhy don't you go first?\n\nCharley Jemley -- Chief Financial Officer\n\nOK.\n\nJoth Ricci -- President and Chief Executive Officer\n\nYou go first. I go second.\n\nCharley Jemley -- Chief Financial Officer\n\nI'm not including an additional price increase in the guidance. I would expect inflation as we start to lap prior year's inflation that 10% to 12% starts to slow down and becomes high single digit, let's call it. And I -- did I catch it? Yes. On to Joth.\n\nJoth Ricci -- President and Chief Executive Officer\n\nYes. I think, Sharon, we did absolutely execute the Rebel plan and really focused in on that in May and June. In June, we started to see a really nice uptick from that. We also executed on Freeze, where we had double-digit growth on a Freeze category as we came out of the end of the quarter.\n\nA lot of the learnings that we're taking from that, we are applying now. As I talked about before, to -- whether it's category-specific or whether it's a customer-specific promotion, the team is diving deeper into specific opportunities really and have that planned for Q3. And I think some of the results we saw in July are basically a result of the team getting even better at executing those types of promotions. So we've got some fun things planned for our customers in the third and the fourth quarter and look forward to more of that.\n\nOperator\n\nNext question, Jeffrey Bernstein with Barclays.\n\nJeff Bernstein -- Barclays -- Analyst\n\nGreat. Thank you very much. Two questions on the top line drivers. The first one, just specific to the comps you disclosed.\n\nI know you said the system was down 3.3 for the quarter. June was only down 2.3, so it seems better, and only down 0.9 in July. I'm just wondering if you had to prioritize the drivers that led to that improvement, whether it's deceiving with easy compares or do you really believe it's improving underlying trends, maybe easing gas prices, which I know you talked about last quarter is potentially a major headwind for you. So I'm just trying to gauge whether you believe that what appears to be the improvement in July is improving underlying fundamentals or something else.\n\nAny way you could prioritize that would be great. And then I had one follow-up.\n\nJoth Ricci -- President and Chief Executive Officer\n\nI think, Jeff, it's a great question and a puzzle that we're actually kind of unpacking a little bit because the 3.3 across the system, the numbers are actually -- California actually drove quite a bit of that decline in Q2, and you've got -- we talked a lot about gas prices in the last earnings call and some of the meetings in the quarter where California still run in 30-plus percent over the national gas average, and we think that definitely has an impact. When you take a look at like California specifically, from Bakersfield to Chico, our business was down about 9.7 in same-store sales, but it also was impacted by a pretty high degree of sales transfer. So there's this -- down 3.3, remember, is impacted by -- that 3.3 is impacted by 1.4% of sales transfer. You have some discount in there.\n\nYou've got a very specific market that's down almost 9.7. If you remove that market, the system actually -- the rest of the company is down one. So we're really trying to isolate down, get smarter about how we promote and attack those comps.\n\nJeff Bernstein -- Barclays -- Analyst\n\nUnderstood. And then the follow-up. You mentioned the California weakness. Fully appreciate that.\n\nI'm just wondering in your research otherwise, is there any learnings in terms of maybe varying by age brackets or lower versus higher household income? It seems like we talk more and more about a slow on consumer more broadly. I'm just wondering what your research showed in terms of where you're most and least vulnerable in terms of your core customer.\n\nJoth Ricci -- President and Chief Executive Officer\n\nYes. Thank you. Definitely, our lower-income, younger customer base is where we're seeing the impact. We've seen if you have a customer base of 40,000 -- household income of $40,000 or lower, we've seen up to 45% declines in California in the visiting rate of those people and actually really in Oregon and California.\n\nAnd customers that are between the $40,000 and $60,000 earning are about 27% less in those markets as well. So it's definitely indexing higher in lower-income consumers.\n\nJeff Bernstein -- Barclays -- Analyst\n\nJust to clarify, you said a 40% decline in the traffic if the household income was sub $40,000?\n\nJoth Ricci -- President and Chief Executive Officer\n\nIn visits. Correct.\n\nJeff Bernstein -- Barclays -- Analyst\n\nGot you. So where is it on the other end of the spectrum? Are you seeing greater -- I mean that seems like a severe decline. I'm wondering at what level you're not seeing any decline at the upper end of the household income?\n\nJoth Ricci -- President and Chief Executive Officer\n\nIt's minor to, I'd say, a little, if any, on the mid- to high-end income. It's really all being affected on the lower income.\n\nCharley Jemley -- Chief Financial Officer\n\nAnd we're not weighted that heavy to the low-end consumer, right? So even -- and that big a drop is not creating that much drag weighted, but...\n\nJeff Bernstein -- Barclays -- Analyst\n\nUnderstood. Do you share what percentage of your customer mix is in each of those buckets?\n\nJoth Ricci -- President and Chief Executive Officer\n\nWe don't. No.\n\nOperator\n\nYour next question comes from David Tarantino with Baird.\n\nDavid Tarantino -- Baird -- Analyst\n\nHi. Good afternoon. My question is on the margins, and I'm specifically interested in some of the productivity gains that you achieved in the second quarter. And Charley, if you could maybe kind of unpack those for us a bit and give us a sense of how much that might have helped the margin in the quarter.\n\nAnd if I heard you correctly, I think you referenced that there was only a partial quarter benefit in the second quarter. So if you could talk about kind of what you think the run rate savings or improvement might be as we think about the second half of the year and into next year.\n\nCharley Jemley -- Chief Financial Officer\n\nSo the pricing that we mentioned was not fully rolled out until June 1. That's not a productivity, but it does help margins. So we expect -- you naturally expect that to fully take place in Q3 as we get a full quarter of pricing.In terms of productivity, as I mentioned in my comments, we removed the benefit of preopening expenses quarter over quarter when we laid that out. So you had about 400 basis points of real margin improvement.\n\nA little less than half of that just comes from seasonality and leverage. And the remaining piece of that is some moderation in our cost of goods and our labor deployment, again, matching traffic levels closely. That was late in the quarter, right, because we hadn't had enough time to course correct our schedules. So we expect that to fully be in the third quarter and late in the quarter, moderating some of our R&M spending.\n\nSo those are the two big drivers.\n\nDavid Tarantino -- Baird -- Analyst\n\nAnd I guess because some of those came in late in the quarter, how would you encourage us to think about the margins for the second half of the year given those savings? And maybe -- I know you haven't put a price increase into your model. So ex that potential price increase, how should we think about the margins developing in the second half of the year?\n\nCharley Jemley -- Chief Financial Officer\n\nThey will float upward in the second half of the year relative to, say, the second quarter because of the full brunt of pricing because of the moderation of our labor scheduling to match the traffic levels we're at. And we are going to bring the R&M spending closer to a normal run rate. So you should expect us to report to you company shop margins that are starting to elevate again.\n\nDavid Tarantino -- Baird -- Analyst\n\nGreat. And then I guess longer term, you mentioned a goal on the shop-level EBITDA margins of getting to 30%. I guess what is a reasonable time frame? Or how are you thinking about that internally in terms of time frame to deliver that type of performance?\n\nCharley Jemley -- Chief Financial Officer\n\nYes. I think we talked about the 24.6 in the quarter. And if you put preopening and new store drag back into that, we're in the upper 20s already. If you really -- if you were to break our store group down into the last three years of age classes, those margins are actually above 30% in year two margin, right? So those more mature new stores are already delivering that number.\n\nSo our total portfolio is actually weighted down by our lower volume legacy stores. So that's why we're very confident that we will deliver 30%. Because we're actually delivering it in our newest age classes already.\n\nDavid Tarantino -- Baird -- Analyst\n\nGreat. Very helpful. Thank you.\n\nOperator\n\nNext question, Nicole Miller with Piper Sandler.\n\nNicole Miller -- Piper Sandler -- Analyst\n\nThank you. Good afternoon. I just want to make sure I got the monthly comps right. I know April was down 3.7.\n\nI missed May. Can you just cover May, June and July again? Because I have a question that relates to that.\n\nCharley Jemley -- Chief Financial Officer\n\nYes. So April was down 3.7. May was down 3.8 for the system. June was down 2.3 for the system.\n\nAnd we mentioned July for the system was down negative 0.9%.\n\nNicole Miller -- Piper Sandler -- Analyst\n\nOK. Noting that's the system. Right. OK.\n\nAnd the reason I'm -- and I was curious about the June to July, so down 2.3 to down 0.9 is a pretty big move. And if it's really gas prices, right, that is causing the comp fluctuation, usually, you give somebody something. In this case, low gas prices are stimulus, and they were happy to spend it right away. You take it away.\n\nAnd even though it's reversing course, it can take -- there can be a lag. I mean usually, gas starts to go down, and the comp improvement for the industry does not happen in 30 days. And so do you think it's just gas prices? Or do you think there's anything else happening?\n\nCharley Jemley -- Chief Financial Officer\n\nWell, recognize -- this is Charley. Recognize that in July, we have the pricing action rolling in fully, right? So it got the pricing fully taking place. Good news is we've not seen traffic fall off as a result of that. And so I would say stability is the key point here on the fuel gas prices.\n\nI think it's always made that as representative of the duress the consumer is under. And similar result, we would say we're seeing in trend that elevated fuel prices are a challenge for some consumers. And we think that's why California is lagging as well. Because it has the highest gas prices in the country.\n\nNicole Miller -- Piper Sandler -- Analyst\n\nAnd then just thinking about where those sales went. Do you have any insights at all? I'd be curious to understand, just no afternoon treat -- no treats in California, no coffee in general? Or did somebody substitute something from home or from another channel, convenience store, ready-to-drink? Just curious where you think you will be getting those sales back from eventually?\n\nJoth Ricci -- President and Chief Executive Officer\n\nYes. Great question. And when you kind of break down where you see the loss, it's definitely afternoon and evening. And really, it's about kind of -- again, when we kind of boil down to where is it, it seems to be afternoon and evening.\n\nCalifornia makes up a heavily weighted amount of that loss. And it is really in like iced classics, smoothies, cold brew, frost, iced tea, which would lead me to believe that ties back to that lower-income customer. So where do we think it's going? Hypothesis would tell me that it's headed to convenience stores. And I have talked about the interaction between convenience and Dutch Bros and how that can interchange.\n\nDo we know exactly where it's going? No. But where are we after now is to start to isolate Dutch Rewards in our programming, our promotion programming, our customer interface back into that afternoon, evening customer and bring that back because we still saw morning dayparts improving and actually saw growth in morning dayparts. So we've really got it isolated down to category, time of day and who we think that customer is.\n\nNicole Miller -- Piper Sandler -- Analyst\n\nAnd last one, do you know how far all guests -- or those guests that are having trouble getting to you, do you know how far they usually travel to see you in distance or time? And are they just driving less? I mean we hear that is a thing. Is that possibly happening as well?\n\nJoth Ricci -- President and Chief Executive Officer\n\nI only have anecdotal evidence, Nicole. I don't have -- we don't know exactly how far they drive. We try to map our stores in, call it, a three- to five-mile radius, if we can, if we have the right volume in those stores. So we could say that think of it as a five-mile radius.\n\nBut in some cases, people are stopping to buy on their way to work. Or if it's within a back-to-school market, then that's a shorter trip. But we don't know directly.\n\nOperator\n\nNext question, Andrew Charles with Cowen.\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nGreat. Thank you. Charley, I wanted to dig into the impact of sales transfer. If I recall correctly, it was running around 230 basis points in 1Q to 140 basis points in 2Q.\n\nCan you talk through what drove the easing of that impact, and within guidance for flat comps, how we should think about sales trends for the back half of the year?\n\nCharley Jemley -- Chief Financial Officer\n\nYes. So the 230 was for company shops as a reference point and the 140 was for the system. We are seeing sales transfer rise slightly in the company network. And so it's up a little bit from last quarter.\n\nAnd in terms of -- the way we look at this is we try to just get comfortable that when we open a shop, what percentage of that sales is incremental. And we are seeing that incrementality across the new shop network to be well within our expectations, and that's the way we measure it. So we report the drag on comp, but we're really looking at when we infill a network, how much of the sales are incremental every time we add a shop.\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nOK. Is it fair to assume kind of this slight growth in sales transfer continues in the back half of the year? Is that something it's embedded in expectations?\n\nCharley Jemley -- Chief Financial Officer\n\nI think similar levels are what we're expecting for the balance of the year because our shop development program is not dramatically different. We're going to open about 30 a quarter. The ratio of company shops will be very similar. So we would expect this to persist.\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nYes. And Joth, a question for you. Notwithstanding the improved sales trajectory exiting the quarter in July, but if your guidance for flat same-store sales in 2022 proves true, are you hoping to slowing development in 2023 to eliminate the distraction and help intensify the focus on growing same-store sales and rebounding those back to that targeted low single-digit range?\n\nJoth Ricci -- President and Chief Executive Officer\n\nNo. In fact, our plan for 2023 growth will stay within that mid-teens plan that we've laid out as far as the year over year new shop expectations. I think that we've talked about kind of the growth story of Dutch, and that is -- one of it is new unit growth, which obviously impacts, and the sales transfer that we see in those markets. The other one, too, is that -- and as I've talked about, I think top line sales are a really important measure of this because we are also working on growing market share.\n\nSo for example, in Q2, 26 of the 31 markets that we are tracking all grew top line sales, and we're growing total market share in a market. And with that kind of that combination of new stores opening at $2.1 million AUV trend lines, we have sales transfer that is within the guidance and the expectations of what we had, and we're seeing total market share grow in almost all of our markets. That's kind of the combination of things that we're looking at to make sure that we're delivering on the long-term expectation.\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nThat's very helpful. And then just one last clarification on that. When you say mid-teens, you're referring to the number of actual store openings. So if you're saying basically 130 for this year, mid-teens being 15%, that was just 150 plus for next year? Just to make sure we're talking apples-to-apples.\n\nJoth Ricci -- President and Chief Executive Officer\n\nThat would be 130 with 15% on top of it. So whatever number that gets you to, that would be the number, yes.\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nExcellent. Thank you so much.\n\nOperator\n\nNext question, Sara Senatore with Bank of America.\n\nSara Senatore -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you so much. I have a couple of questions about unit growth, actually, related. First of all, you made the point that you're well ahead of that mid-teens guidance.\n\nCan you just talk about whether we should think about as sort of a gating factor or a limiting factor, is it growth rate? Or is it the absolute number of new units you can open? Because obviously, the rate is kind of twice as high as what the long-term guide implies. And so as we think through the sort of converging on that long-term rate, how do we think about that? And then I'll have a follow-up, please.\n\nJoth Ricci -- President and Chief Executive Officer\n\nYes. I think -- Sara, I think that -- it's a great question. And I think we've obviously ramped pretty fast to get to the spot, right? So we've gone from the high 90s last year to that 130 number this year. We raised our guidance to the 130 number in the first quarter, but we really want to settle into that mid-teens growth rate.\n\nAnd we'll look at opportunities. We'll look at where we can be opportunistic on new markets, where that might vary that number. And like this year, it's going to be somewhere in the high 20s, low 30% range. But I'd like to see us settle in.\n\nI think we have to manage the pressure that it puts on the system. We have to manage the -- and as I've said before, we will manage the -- how it does for culture and for growth opportunities and how we're developing our people because as we develop people, that has to fit into how we develop our pipeline and how we build that. So the recipe for that success is the people side of it is as important as the construction side of it, and we'll make sure we manage those to hit that long-term expectation.\n\nSara Senatore -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you. And then just a related question. I know you mentioned California as a key growth market for you.\n\nI understand the impact of these high gas prices are transitory. But sales transfer is also relatively high there. Is there, I guess, some kind of argument to be made that perhaps the volumes that you can support there are different or the density is somehow different? I know you always talk about not wanting such long lines of the service degrades. But just as I think about that as both long growth runway but also one where you're seeing probably some of the greatest sales transfer, how do I reconcile those two things?\n\nJoth Ricci -- President and Chief Executive Officer\n\nYes. So when I talk California, I think of California in two ways. I think about it in our developed part of California, which is basically Chico to Fresno, because our long-term history in those markets is very different from when you look at the Southern California basin and the Central Coast, where we've opened up a lot of new business in the last few years. So Sacramento -- and the Sacramento area is one of our largest AUV markets that we have in the system.\n\nSo when we start to do infill in that market, we're going to naturally see some impacts that will improve overall customer experience, but it will knock down volumes. And we're OK with that, as we've said, like that's an important piece of the business. We've got -- we average about 2.7 million in units that have been opened in the last two years in California. And so we're seeing great response to new outlets that come into those markets.\n\nBut I think one of the long-term objectives here will start to kind of -- to stabilize and actually balance out volume in markets that were highly developed. So you see that in California. We see it in Vegas. We see it in markets like Tucson, where we are purposely doing a knockdown of volume and spreading out and growing market share.\n\nAnd we'll continue to do that and probably need to even get better at how we analyze and provide that information to you guys.\n\nSara Senatore -- Bank of America Merrill Lynch -- Analyst\n\nThank you very much. Very helpful.\n\nOperator\n\nNext question, John Ivankoe with JPMorgan.\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nHi. Thank you. So just getting back to the point you just made to Sara's question. Settling in on mid-teens growth -- and again, just to make sure, I mean, I think there might be some apples and oranges.\n\nIn fact, I've made that mistake myself. Settling into mid-teens growth at some point on the ending unit count in a given year? Or you think in perpetuity, you'll open 15% more units a year until we get, I guess, some stratospherically high number?\n\nCharley Jemley -- Chief Financial Officer\n\nJohn, in the offering, we talked about getting 15% plus system shop growth, right? The system growing year over year 15%. As we mentioned in our comments, we actually over the last 12 months have grown 28%. That's very high growth. So ultimately, we're going to slope down from 28% toward 15%.\n\nWe're not going to slam the brakes on. We're going to slow down. Now if we were at 15% now, and we were going to 15%, to remain at 15%, we would, as Joth mentioned, add 15% more openings every year. So right now, we're going to target 15% more openings year over year, which will allow us to slope down from the 28% growth rate down toward the 15% over time.\n\nAs long--\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nI got you. I got you. And maybe it's just coincidental that those numbers are just -- I would need to get up my pencil. Just those numbers have happened to be the same but reflective of just different things.\n\nOK. I got you. And that's loud and clear. Secondly -- and thank you for making the comment that your wages were up because of mandated minimum wage increases and achieving minimum staffing levels at the store level as opposed to just market pressure, which is very interesting because that's -- like literally, you're unique in terms of not talking about market pressure in wages.\n\nSo I just wanted to see, are there any signs or pockets anywhere, new Broistas, mature Broistas, general managers, assistant managers, what have you? Are there any pockets of wage pressure that you're seeing? Do you want to be proactive in terms of keeping some of your good people kind of in the store? And if you can comment, again, just looking across the system in different types of cohorts of employees, if you're seeing any change at all in terms of the turnover or tenure at the store level as it currently stands.\n\nJoth Ricci -- President and Chief Executive Officer\n\nYes. So a couple of things on that, John. I think that I would say that we are watching and learning the federal minimum wage states because the wage market in those states is very different from the West Coast states that we've had where you have high minimum wage. And so we've responded in a couple of micro situations on a very minor wage increase in a couple of places where we were having -- kind of working on some staffing things.\n\nBut it's really interesting. I mean we've had 64,000 applicants in the second quarter. We hired 3,500 of them. And so we're not having any problem getting applicants.\n\nWe're not having any problem hiring good people, and that goes across the system. Turnover moderated. And so we haven't had the -- we haven't really needed to play the market challenge game or the -- or like we need to -- I think a year ago, we were talking about hiring, bonuses and things like that. Well, we never did any of that because we really wanted to focus on working at Dutch Bros and the value of working at Dutch Bros and why that was important and how we have that combination of good wages and tips.\n\nBut we'll remain agile. We'll remain responsive to what the market needs, and we'll continue to evaluate it. But so far, the strategy we put in place about 18 months ago has held.\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nAnd a number of others see your great retention and who you've been able to attract in terms of the tipping from customers to employees and making it easy for the customers to recognize good service. Do you -- have you seen any changes in terms of increased tipping for hourly employees in your marketplace? Is that something that you should be sensitive to? Or is kind of the Bros culture of recognition, I'll call it, between customers and employees is something that is just special that will be very difficult for others to replicate?\n\nJoth Ricci -- President and Chief Executive Officer\n\nI think the culture of recognition is a great way to put it. I think the changes that we've seen in tipping have really kind of flowed through what was the COVID a couple of years and not taking any cash. There was a really high appreciation for being open and being there for the customer. We've seen tipping kind of stabilize here, I would say, over the last six to nine months as kind of markets have opened back up and we've kind of, let's call it, normalized for whatever that is.\n\nBut I think back to the culture and kind of what we do, and again, I think great service and taking care of the customer is what we're about. And we believe that the customer appreciates that versus feeling like they have to do something.\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nAnd finally, if I may, can you comment on the general manager side? I mean just you were at record low turnover before. I mean what's just the overall commentary of that employee base?\n\nJoth Ricci -- President and Chief Executive Officer\n\nThat stage, on our operator side, we've had basically zero turnover on that end. On the manager side, it's still in the low double digits on the system. So I'm really happy with the way that we've stabilized across the entire system on how we've taken it. I think that there's been a lot of pressure on kind of mid-management as managing COVID, managing some of the challenges of coming back to work.\n\nI think there's a lot of challenges for a mid-level manager right now. And I think that our teams have done a good job of kind of keeping those people around, making sure we take care of those people, and we'll continue to do that. So again, our numbers stay low and really have proven that even in many of the new markets that we've opened up.\n\nOperator\n\nNext question, Andy Barish with Jefferies.\n\nAndy Barish -- Jefferies -- Analyst\n\nHi guys. Nice progress here in the quarter. As we think about the back half and the same-store sales progression, can you help kind of how you're thinking about it? Is the negative one that you saw in July kind of what you expect for the rest of the year? I mean 3Q compares get a little bit easier, but then you had some halo from the IPO and a good holiday season in the 4Q last year. Any help on that, I guess, would be appreciated.\n\nCharley Jemley -- Chief Financial Officer\n\nI mean I would say that the -- as pricing that we took extends through traffic a little bit to slightly negative is what we're feeling. And we're really -- we just don't have enough evidence to look and view it any differently, candidly. And so right now, we're kind of remaining with where our prior guidance was and watching it really closely. And as the next coming weeks shape up, we'll get a stronger view.\n\nWe were encouraged with the flooring, we'll call it, or the stability we saw in July. And we hope to see that in August through September, and that'll give us a better outlook for things. I wish I could give you more, but we're just all sitting in an uncharted territory.\n\nAndy Barish -- Jefferies -- Analyst\n\nYes. No, that's totally understandable. And when -- do you have a mindset of when you would look at pricing again? Or are you fairly flexible and it can be implemented fairly quickly if you do decide to go in that direction?\n\nJoth Ricci -- President and Chief Executive Officer\n\nWell, I think as we mentioned, we did the -- we announced the price increase for our franchisee side of the business. And then right now, we're evaluating another increase in Q3. So it's literally on our docket to make a decision on here pretty quickly because we need three or four weeks to get a pricing implemented, and we have not implemented that yet.\n\nAndy Barish -- Jefferies -- Analyst\n\nOK. Thanks. And then just finally, on the new shop inefficiencies at about 120 bps, I mean, as you settle in, in this 30 a quarter now, and you start to kind of lap that here in the 3Q, is that -- on the company-owned site openings, is that a number that should be sort of popping out at this kind of level, just purely looking at that margin headwind?\n\nCharley Jemley -- Chief Financial Officer\n\nYes. Andy, I think you should expect that to continue. Remember, it's an absolute number. So if we had a margin of x, we're saying it's dragged down by 120 bps.\n\nThat's not a year-over-year number, right? It's just an absolute -- where it's important is we take our absolute margins. We add back that inefficiency. We look at preopening. And we say, hey, that's kind of the trajectory of the year two margin for our shops.\n\nBut I would just consider that to continue kind of with what we've articulated in the quarter. And it's very manageable. And interestingly, if you look at our deck, you'll see those stores we just opened this year that are already six months old have already popped up in margin. And we made that distinction this quarter.\n\nWe broke it out into two six-month windows so you could see the strong margin compression in our new -- margin expansion, not compression, in our new stores.\n\nAndy Barish -- Jefferies -- Analyst\n\nReally, really helpful. I actually had noticed a dramatic difference there. OK. Understood.\n\nThank you.\n\nOperator\n\nNext question, Chris O'Cull with Stifel.\n\nChris OCull -- Stifel Financial Corp. -- Analyst\n\nHey, good afternoon, guys. The company expects to be at the high end of its total revenue target now but kept the number of shop openings and comp outlook unchanged. So I may have missed this, but are you expecting more operating weeks this year or just the new -- the AUVs being higher at new shops?\n\nCharley Jemley -- Chief Financial Officer\n\nI think there's just more evidence that the AUVs have held, and therefore, we'll go to the top end of that guidance now. And now we're 6 months in. So it becomes a math. It becomes algebra going forward.\n\nChris OCull -- Stifel Financial Corp. -- Analyst\n\nFair enough. And Charley, are you assuming that they average what they've averaged the first half, like the new stores, that type of higher AUV? Or are you still being a little conservative with that outlook?\n\nCharley Jemley -- Chief Financial Officer\n\nI think we should be conservative because we're aggressively infilling. I mean you look at Texas. We've already got 60 stores open there in just shy of 18 months, and we aggressively infilled there. So we're meticulously knocking those volumes down.\n\nThat's why we're being reticent to overdeclare on new shop AUVs right now.\n\nChris OCull -- Stifel Financial Corp. -- Analyst\n\nOK. That's helpful. And then just could you provide an update on your entry into Tennessee given it's the furthest East -or the farthest East you've come in terms of meaningful market presence? I'm just wondering if you're seeing -- what kind of sales transfer you're seeing in this market and if you're still seeing a strong uptick in terms of customer adoption and loyalty.\n\nCharley Jemley -- Chief Financial Officer\n\nYes. So the Tennessee shops are spaced out enough right now where we wouldn't experience any real sales transfer. We've approved a lot -- a number of stores there recently. So we're going in and will start to knock volumes down.\n\nBut so far, so good. Like we have not -- we're really pleased with how Tennessee is going. And that's why we hustled out to get even more locations in place.\n\nChris OCull -- Stifel Financial Corp. -- Analyst\n\nThe lines have been long. So it looks like it's going well. And then just lastly, and it's a follow-up to -- related to traffic. I know you mentioned that transactions had stabilized in June and July, but can you help us understand what level of traffic performance you're seeing in July?\n\nCharley Jemley -- Chief Financial Officer\n\nIf I just look at the absolute traffic per store in our comp group, it's very similar to June, right? There's just -- and I'm talking to customer counts, right, the actual transactions itself. You would normally expect from June to July to go down seasonally, right, at summertime. And we've seen -- it's been very flattish, I'll call it. So again, the year-over-year number, right, as you report it, is negative.\n\nBut in this environment, you really look in the near term, and you really look week-to-week and month-to-month. And I also encourage us when we compare over prior year, there's a lot of disruption, habits and COVID and openings and closing. And so right now, we're just in a world of looking sequentially at how many people are coming through the shop every day.\n\nOperator\n\nThank you. I would like to turn the floor over to Joth Ricci for closing remarks.\n\nJoth Ricci -- President and Chief Executive Officer\n\nThank you, operator. And again, thank you to everyone for your support, your interest and your commitment to Dutch Bros. We and our team are very committed to what we set out in our plan a year ago. As I said earlier, we are excited about the progress that we've made.\n\nWe're excited about the amount of things that we're learning every day and really excited to take Dutch Bros to many, many more markets in the years ahead. So thank you again for the time. Have a great afternoon, and thank you for the interest.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPaddy Warren -- Director of Investor Relations and Corporate Development\n\nJoth Ricci -- President and Chief Executive Officer\n\nCharley Jemley -- Chief Financial Officer\n\nSharon Zackfia -- William Blair -- Analyst\n\nJeff Bernstein -- Barclays -- Analyst\n\nDavid Tarantino -- Baird -- Analyst\n\nNicole Miller -- Piper Sandler -- Analyst\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nSara Senatore -- Bank of America Merrill Lynch -- Analyst\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nAndy Barish -- Jefferies -- Analyst\n\nChris OCull -- Stifel Financial Corp. -- Analyst\n\nMore BROS analysis\n\nAll earnings call transcripts"
}