{
  "companyName": "Weber Inc.",
  "companyTicker": "WEBR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/weber-inc-webr-q3-2022-earnings-call-transcript/",
  "content": "Weber Inc. (WEBR)\nQ3 2022 Earnings Call\nAug 15, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Weber Inc.'s third quarter earnings call for fiscal 2022. [Operator instructions] At this time, I will turn the call over to Brian Eichenlaub, vice president of investor relations and treasurer for Weber. Mr. Eichenlaub, you may begin.\n\nBrian Eichenlaub -- Vice President, Treasurer and Investor Relations\n\nGood morning, and thank you for joining us today for our third quarter fiscal 2022 earnings call. I'm joined this morning by Alan Matula, our interim chief executive officer; and Bill Horton, our chief financial officer. I'll start with our forward-looking statements disclaimer. As you are aware, certain statements made today, such as projections for Weber's future performance, are forward-looking statements.\n\nActual results could be materially different from those projected. For further information concerning factors that could cause results to differ, please refer to our public 10-Q SEC filing, our earnings release and our SEC filings, all of which are available on the company's website. During the call today, the company may also discuss certain non-GAAP financial measures. For a reconciliation of these measures to GAAP reporting, please refer to the company's earnings announcement, which has been posted on the company's website at investors.weber.com and can be found in the company's SEC filings.\n\nA recording of today's webcast will be archived for at least 90 days on Weber's investor relations website. And now, I'd like to turn the call over to Alan.\n\nAlan Matula -- Interim Chief Executive Officer\n\nThank you, Brian, and good morning, everyone. Welcome to our fiscal third quarter conference call. As you saw in our announcement, from a few weeks ago, I'm Alan Matula, and I've been part of the Weber team for nearly a decade. Most recently, I led the company's R&D organization, IoT and digital initiatives as well as our global IT function.\n\nPrior to Weber, I spent 35 years at Royal Dutch Shell and leadership roles that span from all major business segments, corporate functions and technology organizations. Most notably for today's call, I have almost four decades of experience focusing on global business transformation, cost management and leading the business through unprecedent time of change. Today, I will review the strength of the Weber brand and strategy, present our view of the current market landscape and outline the specific capital management and cost reduction actions we are taking in response to the environment, then Bill will present our fiscal third quarter performance and dive deeper into the financials. I want to begin with the strength of the Weber brand.\n\nWeber is the global category leader in outdoor cooking with a market share over two times our closest competitor in most markets, and our customer satisfaction scores remain best-in-class. Our driving force is to make lasting memories by helping people create delicious food. We are delivering on this promise, and I'll share a few highlights to this end. We have been named No.\n\n1 brand in barbecue by a long list of media and influencers globally. Additionally, all of our 2022 product launches have earned 4.5 stars or greater consumer ratings. We have an immense opportunity to expand our relationship with 50 million dedicated Weber customers and consumers worldwide as well as reach new people in the near and long term. Our brand strength is our foundation and the cornerstone of the company's strategy.\n\nThe core strategic priorities that we have discussed since becoming a public company remain intact. However, the current market conditions challenged us to sharpen our attention even more on the following key areas: customer focus. We remain relentlessly focused on the consumer, driving product innovation, superior quality, unparalleled customer service within each category and price segment. Vertical product categories.\n\nWe will remove management layers and organize into vertical cross-functional orientation in each outdoor cooking category. This shift will accelerate our ability to market, innovate, compete and profitably win in existing and emerging categories. Go-to-market precision, we will refine our specific consumer value propositions by product, price, mix and segment. This enables precision marketing approaches and resource allocation for consumer identification, awareness and conversion.\n\nWe expect this to positively influence our distribution channels over time. Profitable growth. We will be highly disciplined in evaluating and prioritizing resources to countries, looking to grow established markets, scale emerging markets, develop outdoor cooking cultures in promising markets and exit markets where we do not see a path to growth, all while increasing emphasis on supply chain productivity in our key geographies. These priorities are the lens by which we are viewing the current operating environment.\n\nWhile we see short-term macro challenges, we are positioning Weber to emerge with stronger financial fundamentals, a fortified balance sheet, expanded margins and a growth engine that drives the next chapter of our seven-decade long history. Market dynamics and consumer behavior are telling us that the outdoor cooking sector is contracting in the near term. Inflationary pressures are weighing on consumer confidence as well as spending power in every market. Additionally, the war in Europe continues to have a profound impact on spending patterns in the EMEA region, a large and higher-margin segment of our business.\n\nTurning to North America. According to the Cleveland Research Center, foot traffic and U.S. home improvement retailers is down 16% year to date compared to the prior-year period. As a result, sales for the grill category have fallen 26% year to date.\n\nWe attribute this lower traffic to several factors: Increased travel as people vacations for the first time since the pandemic, heightened inflation which impacted purchasing decisions around discretionary goods and major heat waves that affected several key markets. Lower foot traffic in retail stores globally has a cascading impact on our bottom line. We see higher inventory levels on lower sales, which adds cost. That, combined with increased freight costs, fuel surcharges and increased promotional activity, has resulted in material short-term impacts to our profitability.\n\nNow, I want to outline the cost management initiatives we're taking to address these market headwinds. To stabilize our financial position for fiscal 2023 and beyond, we are introducing a comprehensive cost management plan that includes the following initiatives: preserving our overall cash position through the suspension of our dividend and capital spending reductions, targeted interventions to reduce COGS and SG&A expenses; tightening global inventory levels and working capital positions and finally, we are targeting a reduction in force that, at a minimum, accounts for 15% of our non-distribution SG&A expense and 10% of our global headcount focusing on all levels of the organization, including senior management positions. All told, we expect these actions to create at least $110 million of year-over-year cash benefit, net of restructuring costs in fiscal year 2023, and Bill will offer more detail in a moment. We plan to update you on the progress we are making across these efforts on each of our subsequent earnings calls.\n\nI want to take a moment to recognize that these decisions impact our people, our greatest asset and the backbone of our brand. We only look to make such changes when it's important to the long-term success of the business and once we have exhausted all other avenues to reduce cost. We feel the changes we are making are necessary to weather this difficult macro environment and to set us up for long-term value creation. As has been our history, we are committed to treating effective employees with respect and appreciation as we move through this process.\n\nI will now turn it over to Bill, who will review our third quarter performance and run through the specifics of our cost management plan. Bill?\n\nBill Horton -- Chief Financial Officer\n\nThanks, Alan, and thank you, everyone, for joining our call today. As Alan mentioned, given the softened consumer demand trends we are seeing worldwide, our team is taking immediate actions to position the company for long-term profitable growth in a dynamic operating environment. Before I get into the details of our cost reduction plans, I will go through our third quarter results. For the third quarter, net sales were $528 million, down 21% versus the prior-year period and down 16%, excluding the $33 million unfavorable impact of foreign exchange rates.\n\nIt is important to note that this significant third quarter weakening of most major currencies brings our year-to-date foreign exchange impact to $55 million on the top line and $37 million to EBITDA. In addition to significant FX headwinds, the net sales decline was driven by slower retail traffic both in-store and online for discretionary hard goods categories in all major markets. The slower retail traffic patterns are the results of pressured consumer shopping behaviors globally, driven by rising inflation, higher fuel prices and geopolitical uncertainty. The company expects these market headwinds to continue in the near term.\n\nFor the Americas, net sales decreased 19% or $65 million to $274 million from $339 million last year. For EMEA, net sales decreased 24% or $74 million to $233 million from $307 million last year. Excluding the impacts of $30 million of negative foreign exchange headwinds, net sales were down 14% in EMEA. In Asia Pacific, net sales decreased 5% or $1 million to $22 million from $23 million last year.\n\nFor the quarter, foreign exchange negatively impacted sales by $2 million, primarily driven by the Australian dollar weakness against the U.S. dollar. Excluding the impact of foreign exchange, APAC sales were up 3%. Turning now to gross margins.\n\nOur fiscal Q3 gross profit decreased $145 million or 49% to $154 million from $299 million last year, and gross margins decreased 1,560 basis points to 29.1% from 44.7% last year. The gross margin decline versus Q3 2021 was driven by several compounding factors. First, the impact of the decline in sales volume versus Q3 2021 was $75 million of the $145 million margin decline. Additionally, commodity cost increases and the impact of higher purchased finished goods costs resulted in $66 million of negative cost headwinds or 1,250 basis points.\n\nOther contributing factors to the year-over-year margin declines were: first, lower production volume driven by suppressed consumer demand, which drove nearly $13 million of fixed cost inefficiencies versus last year when our plants were operating at near 100% capacity; second, the foreign exchange impact, as previously noted, negatively impacted gross margin by $25 million or 190 basis points; third, continued inbound freight cost increases versus the same period last year, which drove $17 million of margin decline or 320 basis points; and finally, an additional $12 million of negative margin impact resulted from higher promotional activity in the quarter to drive sales and unfavorable region and product mix compared to the prior year. These cost increases were partially offset by $63 million or 660 basis points of pricing action taken earlier in the year to mitigate the effect of significant commodity and freight headwinds that we have discussed previously. Selling, general and administrative costs for the fiscal third quarter decreased by $84 million or 33% to $174 million from $258 million last year and decreased 570 basis points to 32.9% from 38.5% of sales last year. The decrease was primarily driven by lower stock-based compensation expenses as well as specific cost-cutting actions taken across the company that we spelled out on our last call.\n\nExcluding the year-over-year favorable impact of stock-based compensation, other controllable SG&A was down $39 million in the quarter or 740 basis points. This reduction highlights the impact of recent cost-cutting measures we took in response to the macro environment. However, distribution expense as a percent of sales was up 170 basis points driven by recent unprecedented increases in fuel surcharges from our carriers. Given the consumer spending pullback, we have chosen not to pass this burden out to the consumer and are absorbing these operational costs.\n\nWe anticipate similar surcharges in the fourth quarter given the continuation of inflationary pressures. For the quarter, net income decreased $70 million to a net loss of $52 million from net income of $18 million in the prior-year period. The decrease was primarily driven by lower gross profit, which was a result of lower net sales and higher cost of goods sold. These impacts were partially offset by a decrease in SG&A costs, a gain on the tax receivable agreement liability remeasurement and lower income taxes.\n\nWe generated $11 million in adjusted EBITDA in the quarter, down from $134 million in the third quarter of 2021. Adjusted EBITDA margin came in at 2% in the third quarter versus 20% last year. As we stated a few weeks ago, with this level of uncertainty in our global operating environment, we have withdrawn our fiscal year 2022 net sales and adjusted EBITDA guidance. We believe both metrics will be further impacted by the overall environment and planned cash management and cost savings initiatives, as outlined earlier.\n\nAdditionally, the Weber board of directors has suspended the quarterly cash dividend indefinitely. Turning to liquidity. We remain in compliance with our credit agreement. We have sufficient cash and cash equivalents, including net cash provided by operating activities and availability under our credit facility to fund our operations and capital expenditures through fiscal year 2022.\n\nBased on the current operating environment, we are assessing financing options to strengthen our balance sheet and are working proactively with our lending partners to stay in compliance with our credit agreement. We have already executed cost saving steps that positively impacted Q3 and will favorably impact Q4 and fiscal 2023, including reducing media spending, eliminating open positions, canceling nonessential travel and putting tighter spending control limits in place across the organization. The core components of our plan to manage cash flows, preserve liquidity, expand gross margins and drive down SG&A have begun rolling out in earnest. Looking at the plan in total, these measures are targeted to result in at least $110 million in cash benefit for the next fiscal year, net of restructuring costs.\n\nThe measures that contribute to these savings include $38 million from suspending our quarterly cash dividend and over $30 million from capex reductions versus a high capex spending year in 2022 that included the Poland plant, global ERP implementation and Genesis relaunch investments. We also have a robust productivity program that will drive structural cost and quality enhancements that create a minimum of $35 million in year-over-year cost of goods sold improvement. This includes the full year run rate benefit of our new manufacturing plant in Poland as well as a number of other focused projects already in progress. In addition to these initiatives, we will deliver run rate savings of at least $25 million by tightening service partner expenditures, which include third-party consultants, contractors and advisors, evaluating and refootprinting our real estate holdings, reconsidering our go-to-market approach in the certain emerging markets and exiting unprofitable product lines.\n\nAnd finally, we are also making the difficult decision to reassess our most important resource as a company, our people. We are pursuing a reduction in force that will reduce our nonmanufacturing and distribution headcount by at least 10% while reducing our overall SG&A personnel costs by at least 15%. This action represents at least $20 million of EBITDA benefit for fiscal year 2023. As Alan said, reducing headcount is our last resort when we think about cost savings.\n\nBut given the market dynamics I've laid out today, we believe it is the most prudent choice in positioning Weber for fiscal year 2023 and beyond. Organizationally, this action will de-layer the company and streamline decision-making. I will now turn it back to Alan to close out our prepared remarks.\n\nAlan Matula -- Interim Chief Executive Officer\n\nIn closing, I'd like to thank you all for your support as Weber begins this next chapter. I am confident that we have the brand, leadership, global team and operational footprint needed to emerge from this as a stronger company. We are already executing against the strategic and cost initiatives we've outlined on this call and are encouraged by the results we are seeing today. Our priority remains, as it always has been, delivering high-quality outdoor cooking experiences around the world, bringing friends and families together through memories that will last a lifetime.\n\nOperator\n\n[Operator instructions] The first question comes from Robby Ohmes from Bank of America. Robby, your line is now open.\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nThanks, and good morning, Bill and Allan. My first question is just, I know you're not giving guidance, but on gross margin. Can you just help us think about weighing incremental fuel surcharges versus improvement in commodity costs and freight potentially year over year and just maybe some puts and takes to help us try and guess or think about that for the back half? And also, any kind of thoughts on the puts and takes on gross margin for fiscal '24 would be great as well.\n\nBill Horton -- Chief Financial Officer\n\nRobbie, this is Bill. Thanks for the question. Just a note on fuel surcharges, those impacted SG&A because those fuel surges are on outbound freight through our carriers. So that was one impact that you'll see that reflected.\n\nThat's the 173 basis point impact that we realized in outbound distribution freight in SG&A. But on gross margin, in particular, in the third quarter, we -- I'll just run through a couple of highlights. We did realize almost 650 basis points in pricing benefit in the quarter, and that was offset by continued headwinds in commodity costs. That was about 1,250 basis points.\n\nAnd inbound freight, we talked about all year, that was another 320 basis points. And then -- so all in, those were the primary drivers of the impact. And then in addition, foreign exchange. So foreign exchange has been a challenge for us all year as we've talked about.\n\nIt was about 190 basis points in the third quarter. And on the year-to-date basis, almost 120 basis points. So that's what we're seeing. I would say, overall in the supply chain environment, we still believe our unique global manufacturing footprint gives us a significant advantage to navigate the challenges that we're all facing out there.\n\nInflation pressure remains high, but we have seen decreases across some of our key raw materials that really, since June, we've seen a decrease anywhere between 5% and 20%, depending on the raw material. And then inbound freight, we've seen trending down about 10% to 20%. So certainly, that will -- assuming that trend continues, that will be positive news as we head into our -- work through our fourth quarter and into next year. And then from a freight standpoint on the international freight lead times from suppliers, we see those continuing to be extended at about 85 days, although, again, similar to what we're seeing in commodities and inbound freight, we are starting to see that normalize a bit.\n\nSo again, I guess I'll close there and addresses the question.\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nNo, that's really helpful. And just a quick follow-up. How are you thinking about managing the wholesale -- your wholesale partners or your -- the wholesale channel in this environment? You mentioned some unprofitable product lines. Is there any change in your strategy with the wholesale partners in the U.S.\n\nand globally?\n\nBill Horton -- Chief Financial Officer\n\nNo, not really. I think we continue to work through and leverage our S&OP process that we've -- where we look at on a monthly basis, not only our own Weber inventory, but also trade inventory. We monitor our trade inventories with our largest customers and all of our Weber stores globally. So we generally have a really good lens on about 70% of our global trade inventory.\n\nAnd while our data would say that on a dollar basis, inventories are up somewhere in the 20% to 25% range, when you look at it on a unit basis because obviously we've taken the three consecutive price increases throughout the year that we've talked about on a unit basis, inventories in the trade for our data, I would say, it's only up between 5% and 10%. So we're going to continue to work with our trade partners to work through this inventory in Q4. But generally, we feel good about where we are looking as we head into next fiscal year.\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nThat's great. Really helpful. Thanks so much.\n\nBill Horton -- Chief Financial Officer\n\nThanks, Robby.\n\nOperator\n\nThe next question comes from Simeon Siegel from BMO Capital Markets. Simeon, you may begin.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nThanks. Hey, everyone. Good morning. So recognizing the macro is what it is.\n\nI guess just when you're thinking about go-forward demand, how are you thinking internally about what level of revenues over the past couple of years may have been a pull forward? And if that's the case, how are you thinking about stress testing that on so maybe just kind of overlaying the normal replenishment rates that you guys see? Thank you\n\nBill Horton -- Chief Financial Officer\n\nI can take that Simeon, and maybe Alan can jump in. So obviously, overall, foot traffic is down for our data roughly  or the data we have access to, roughly down 16%, this is U.S. data, with the grill category being down about 26%. So this lower foot traffic does have a cascading impact on our bottom line.\n\nBut generally, given all the macro issues we've discussed, I think we're seeing our market shares are holding. So we're not concerned from a share standpoint, and the Weber brand remains extremely strong. So we're seeing it in all of our online influencers and fan bases across the globe. They remain extremely engaged and passionate.\n\nSo as we look forward to next year, we believe that once the consumer works through, we're going to let the consumer work through this high inflationary environment and then let the Weber brand play out, and we feel confident that the Weber consumer will continue to drive the brand growth. So Alan, do you have comments on that?\n\nAlan Matula -- Interim Chief Executive Officer\n\nYes. Thanks, Bill. I think the other thing to think about is that as we go through this, we're in about 50 million households around the world. So what has us taken a reflection is what can we do with that base of loyal consumers? And there are things that we can do with accessories, with fuel, with other things that we're evaluating to basically leverage this period where consumer sentiment that is down and the foot traffic is down and try to work through that.\n\nBut we do believe that a large part of this will come back and the growth story will continue.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nGreat. Thanks. That's really helpful. And then to follow up on both of those and, Bill, your earlier point about dollars versus units for inventory.\n\nSo how are -- as you think about the year, how are you planning on buying or what are you expecting inventory to end over the year? And again, units are probably just as, if not, more helpful than dollars.\n\nBill Horton -- Chief Financial Officer\n\nYeah. Again, Simeon, we're not providing guidance for the year. So I hesitate to really give you a look forward there. I would tell you that, generally, where we see the trade, like I mentioned, with -- on a unit basis, being up about 5% to 10% at the trade.\n\nIt's not anything that is overly concerning to us because -- and one item that I have probably also mentioned is just from a pricing standpoint, we continue to hold pricing, all the pricing actions that we've taken. Competitors have followed our pricing action. We've seen that in almost every market. So we'll let the consumer work through.\n\nObviously, this is our low point of our season where we are today. But as we get into the next season, we have believed that the consumer will come back and choose Weber.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nGreat. Thanks a lot guys. Best of luck for the rest of the year.\n\nBill Horton -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nKate McShane from Goldman Sachs is the next questioner.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nHi. Good morning. Thanks for taking our question. We know that innovation has been a big part of your strategy since this management team came.\n\nI just wondered if there would be any changes that you're making with regards to headcount or spending and how that would impact innovation. And how we should think about new launches in the context of this environment in fiscal year '23?\n\nAlan Matula -- Interim Chief Executive Officer\n\nSo one of the things -- this is Alan. Thank you for the question. One of the things that I talked about in my opening remarks were the vertical product categories. One significant change is that we have historically thought about innovation and R&D and product on a horizontal basis across the entire company.\n\nWhen you look at who we compete with, we have probably the broadest set of product categories of anybody in our industry. So our competition isn't there as much as it is by vertical category. So here I'm talking about pellets and flat tops and gas and charcoal. One of the things we're doing to strengthen our innovation and new product capability is shift the organization to a vertical dimension.\n\nThat means we put marketing, consumer research, product definition and features, all the way through engineering and even industrialization in a vertical dimension so that it's focused, it's clear, we're laser sharp on our competition and it should also do a lot for simplicity and speed of the new product development process. And so I think I would highlight our kind of shift toward the vertical product categories versus the traditional horizontal view. That will come with also an increase in talent in those areas and a focus of talent in those areas. And we'll fund that from other sources of SG&A and other means.\n\nSo there'll be a little bit of a transition of talent from one bucket into another.\n\nBill Horton -- Chief Financial Officer\n\nYeah. If I could just add to that, Kate. And by no means does the cost-cutting measures indicate any pullback on our NPD pipeline. We have several initiatives that we're working on for this coming fiscal year and the year after that.\n\nYou saw -- I'm sure you've noticed that we've got to about 4.5 plus star ratings out there in the market today, which has performed extremely well. So the cost-cutting actions that we're focused on in no way impact our focus on NPD or the product launches that we'll have coming out over the next 18 months.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nThank you.\n\nBill Horton -- Chief Financial Officer\n\nThanks, Kate.\n\nOperator\n\nThe next question comes from Megan Alexander from J.P. Morgan. Megan, your line is now open.\n\nMegan Alexander -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks very much for taking my question. I was just hoping you could talk about, are you seeing anything different by price point, whether that's high end versus low end? And you talked about not passing through some of these fuel surcharges. How are you thinking about maybe rolling back price increases should -- to stimulate consumer demand as we continue to see pressure on the consumer?\n\nBill Horton -- Chief Financial Officer\n\nYeah. I'll hit that first and Alan can jump in if I missed anything. But certainly, there is no -- we have no intentions of rolling back pricing. Generally, all of our price increases have been accepted by our retail partners and, like I mentioned earlier, are being followed by our competitors globally in almost every market.\n\nSo there's not any intention to roll back pricing. As we always do, we look at all of our key price points on a very meticulous basis. We look at up and down the chain. We do have the advantage that Weber is a very strong brand with superior quality continued innovation, which gives us pricing power.\n\nOur approach has been that we maintain the right value equation for consumers in relation to the total portfolio and competitive landscape. So honestly, it's not a one size fits all, but we have unique programs and strategies on a region-by-region, country-by-country basis and by product line. So I think your first -- the first part of your question was, are we seeing any sensitivity along different price spectrums? Generally, I'd say, no, we're seeing the consumer being impacted both at our lower price point grills all the way up to our high price point grills. But our teams are looking at that and evaluating, are there minor tweaks to certain price points along the price tiers that we should make to ensure that the consumer has available to them the product they're looking for at the price.\n\nSo Alan, anything I missed?\n\nAlan Matula -- Interim Chief Executive Officer\n\nThe only thing I would add is that the pricing is maybe three, four months old here as we go into the season and through the season. We'll take a look at that really hard, and we'll more so assess whether we've left any gaps in our pricing by product category. And I think the vertical product categories will help shine the lens on that as well. So if there's a concern that we have, it's not that we would let go at the current pricing levels, it would be that did we create a kind of a hole in our pricing ladders.\n\nAnd we'll look at that very carefully to see if our pricing has impacted consumer demand.\n\nMegan Alexander -- JPMorgan Chase and Company -- Analyst\n\nGot it. That's helpful. And maybe as a follow-up, can you just talk a little bit about the leverage ratio? I understand you're not guiding, but any help on where you think that should end this year. And you did mention you're assessing sources of financing for '23.\n\nIf you need access to incremental liquidity or need to raise capital, how do you think about what would be the best approach right now?\n\nBill Horton -- Chief Financial Officer\n\nLet me speak too. So as it's stated in our filings, as of June 30, our cash and cash equivalents totaled about $41 million and we had $249 million of borrowings available under our $300 million revolving credit facility. Our credit agreement allows for certain add-backs to EBITDA as EBITDA is defined differently than it is in our quarterly disclosures. So with these incremental add-backs that are allowable under the terms of our credit agreement, we are in compliance with our covenants and below the seven times leverage ratio.\n\nSo a few examples of items that our allowable add-backs would be the full year run rate of pricing, the impact of foreign exchange, both translation and transaction and adjustment for other onetime costs. So we're always assessing other financing options to strengthen our balance sheet, working with our lending partners, but we feel confident in our compliance. Does that help answer the question?\n\nMegan Alexander -- JPMorgan Chase and Company -- Analyst\n\nYup, that's helpful. Thank you.\n\nOperator\n\nThe next question comes from Chris Carey from Wells Fargo. Chris, your line is now open.\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nHi. Good morning. I wonder if you can just help maybe frame how you see retailer engagement with the category? Clearly, this year, it's more about unloading excess inventory for your categories and others. Are you starting to have conversations about placement for next year? Really, I'm trying to get a sense of the potential to snap back both from a top line and EBITDA as well, really of the cost savings program here.\n\nAnd there's going to be two factors really with retailer engagement and consumer engagement. So I'm just wondering how you see things currently.\n\nAlan Matula -- Interim Chief Executive Officer\n\nYeah, I could probably take that a little bit, Chris. This is the time of the year where we actually begin some pretty intensive rounds of line reviews around the world where we start talking about the new products that should be delivered in 2024 and 2025. Those are not only normal course, but they're actually getting an increased intensity because of the strategic work we did on the vertical product category. So that will be informed more so this year than they have any other year.\n\nThe second thing that I'm doing in several of the markets is just getting out there with the retailers and listening to them and trying to understand the market from their perspective. I think that's a healthy thing for me to do as the new CEO, but also is quite a learning experience as well. So the level of engagement is going to go up, which should help with understanding and getting confidence on innovation as well as NPD as we move forward. Bill, anything you want to add to that?\n\nBill Horton -- Chief Financial Officer\n\nWell, I think you had it. I think Chris has a follow-on.\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nYeah. I guess, so maybe if I could summarize and apologies. But you feel good about retailer engagement and you think that once consumers work through some of the inventory out there and retailers as well that you should be entering fiscal '23 cleaner. Is that a reasonable summary? I guess, just given where the operating cash flow is sitting today and the debt, and I appreciate you're looking for financing, I'm just trying to get a sense of exactly why this netback should occur next year? And if that's a good summary of things that retailers be engaged, and it's just really about timing going into next year.\n\nYou need to get through this year and then cost savings come through. I just want to make sure I'm really crystal clear on where the recovery is coming into next year because, clearly, that's required excess in addition to the work that you're doing on the financing with your lenders.\n\nAlan Matula -- Interim Chief Executive Officer\n\nI can just maybe hit a couple of points here. I think I would say our retailers are extremely engaged. Obviously, they've been through a difficult season in this category as for a number of the items that we mentioned discussed earlier. But the retailers that we speak to are extremely engaged.\n\nThey obviously have a lot of history with Weber. They want Weber to going forward. And as I mentioned, Chris, with trade inventories on a unit basis, only up generally 5% to 10%. We feel like that's a manageable position so that they can work through in their off-season as we head into the next season, assuming the consumer comes back strong, maybe back to kind of that 2019 levels that you've heard other CPG companies talking about.\n\nWe feel really good. I would say, outside of the U.S. really the same story. We're extremely excited about our engagement with the Weber stores.\n\nAs we've talked about, we have 172 or more Weber stores globally. And what we're hearing from our Weber store owners is continued excitement about the recent NPD launches and the excitement for the category and going forward. And likewise across Europe, even outside of our Weber stores, we're not seeing retailers feeling like this season is going to be necessarily an indicator of the future. Some of the trends that we talked about during the IPO process may have been put on pause, if you will, during this hyperinflation, extremely challenged global market condition.\n\nBut going forward, those consumers are still excited about growing at home with all the IoT technologies we've launched. So generally, they're feeling very bullish on the category.\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nOK. Thanks for continuing that. Two quick follow-ups. Number one, just are you expecting to carry any inventory into your selling season for next year? Is there any problem with obsolescence? I know not of the material itself but of the innovation.\n\nAnd then the second question is a little bit different, but just gross margins. Is there anything that you see as structurally different today that would prevent you from recovering to a gross margin level, say, over the next couple of years or consistent with the gross margins that you had achieved prior to COVID? And that's it for me. Thanks for that.\n\nBill Horton -- Chief Financial Officer\n\nSo on the inventory, I would say, obviously, with every quarter close, we go through a very thorough review of excess and obsolete inventory. And like I mentioned, when we came out of the third quarter with unit inventory only up mid to high single digits, we don't have any concerns about excess obsolete inventory. And like I mentioned earlier, our recent new product launches have performed extremely well in a somewhat depressed environment, if you will, at retail with slow traffic. So we still feel really good about how those products are going to continue to perform into next year.\n\nSo that's the first question. As part of structural dynamics in gross margin, I would say, like I mentioned, we're starting to see some normalization of commodities, inbound freight costs. So that will help our gross margin as we move forward. From a structural dynamics and how we think about -- you've heard me talk about our make resell strategy, we are still 100% committed to that strategy and very excited about the results we're seeing in Poland.\n\nSo as you know, Chris, our Poland plant has been operational since October of 2021 and continues to exceed expectations. So we produced about 500,000 units of kettles and Qs in 2022. We're expected to produce about 560,000 kettles and Qs in 2023. We just completed a 250,000 square foot expansion to serve as a regional distribution center for our very large EMEA business.\n\nSo we have confidence that our make resale strategy is working. So from a fundamental aspects of gross margin, I guess my answer would be no. We don't see any structural changes. And so I'll pause and see if that addresses the question.\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nYeah, that's great and thanks for entertaining all those questions.\n\nOperator\n\nThe next question comes from Arpine Kocharyan from UBS Investment Bank. Please go ahead, Arpine.\n\nArpine Kocharyan -- UBS -- Analyst\n\nHi. Good morning, and thank you for taking my question. Most of my questions have been asked in some shape or form. So let me maybe try to be a bit more direct.\n\nI know there are lots of moving parts, but could you stabilize revenue into 2023 or revenue -- we should be expecting revenue to continue to decline further into next year? And more importantly, it would be great if you could summarize sort of overall puts and takes on EBITDA bridge versus 2019, potentially getting back to that level of profitability. And what investors should be thinking about? I know you mentioned a very helpful $110 million of cash benefit, but I think more than half of that is suspension of dividend and reduced capex. But in terms of sort of EBITDA, and I think you mentioned reduced COGS and some $20 million of reduced SG&A, just kind of thinking about that bridge getting back to 2019 levels of profitability. Could you summarize that for us?\n\nBill Horton -- Chief Financial Officer\n\nYeah. I guess, Arpine, just as a reminder, we don't provide forward-looking guidance. So I'm not going to out looking what we're thinking for next year's revenue. We're focused on what we can control.\n\nSo our goal, as Alan laid out in the script, Alan laid out in the prepared remarks, the goal of our cost management plan is to de-layer the organization and create go-to-market precision in both the organization and product levels. So I'll just kind of remind you that we believe of the $110 million of savings, that's net of restructuring costs. Roughly $75 million of those savings are EBITDA improvement year on year. So those specifically are $35 million of COGS productivity.\n\nThese are targeted interventions that we've already enacted in our in-flight. We've got $25 million of other tightening of spending. We call those bought costs, but we've got a host of products that we're working on today that will drive a minimum of $25 million of outside service spending, etc. And then the 10% risk that Alan went through drives another $20 million of savings.\n\nSo you can think of those as kind of minimum drivers of EBITDA improvement year on year. And then I think your -- the second part of your question was around kind of going back to 2019, the EBITDA drivers. I would just call out one in particular is foreign exchange. Foreign exchange has been a significant headwind for us all year.\n\nOn a year-to-date basis, it's negatively impacted our sales $55 million and EBITDA by $37 million. So you can kind of -- again, we don't provide guidance. So I would just kind of leave it there and see if maybe I'll -- you have a follow-up.\n\nArpine Kocharyan -- UBS -- Analyst\n\nYeah. No, that's actually super helpful so thank you for that. My one quick follow-up is a bit -- and I know this question was asked in some way, I guess, earlier. Could you -- what is the more typical replacement sales annually in your business? I know during COVID, you saw really sort of elevated levels of replacement sales.\n\nHow quickly does the customer replace a grill in general in Americas or outside of U.S. or North America based on kind of your internal stats?\n\nBill Horton -- Chief Financial Officer\n\nIn general, we've -- as we discussed during the IPO process, generally, seven years has been our historical replacement cycle. Although with some of our recent innovations around IoT, smart drills, if you will, we believe -- our data would say that, that causes the consumer to go back to the retail store and explore the innovation sooner. So -- and we believe that's working. We've also launched a series of innovative accessories that -- Weber Crafted being one of them that, let's say you've got a Genesis Grill at home, it's maybe three years old, and we launched Weber Crafted that allows you to turn your Weber gas grill into a flat top, into a pizza oven, into a whole host of other accessories that can turn your Weber Genesis into a multifunctional grill.\n\nWe feel like innovation like that, not only items that we've launched already but we're going to continue to launch, bring that consumer back to the retail store to buy sooner than that seven years. Alan, do you want to jump in?\n\nAlan Matula -- Interim Chief Executive Officer\n\nYeah. I'd add to that to Bill's comments that I obviously agree with the five to seven-year comment. But there's three aspects of this that we're trying to shorten that time frame, right? One of them is, can we can we get a consumer to look at the features and functions of the grill, especially with differentiated technology to get them to turn grills faster? The second one, as Bill mentioned, is can we do something with accessories, especially in this period of low foot traffic? And given our households that have our products and that are loyal to our brand, can we get acceleration there? And lastly, we go back into the vertical product categories, more people are putting multiple grills in their backyard. So as you see different styles of cooking, whether that's flat tops or pellets or electric, we're hoping that there's compression there of that cycle because people are actually using more Weber products and not just one.\n\nArpine Kocharyan -- UBS -- Analyst\n\nThat is really helpful. Thank you.\n\nOperator\n\nThat's all the time we have for today's Q&A session. I'm now going to hand back to the management team for any remarks.\n\nAlan Matula -- Interim Chief Executive Officer\n\nYean, we really appreciate the engagement and all the questions. It's a difficult, but interesting time for us. It's challenging, but we're up to the challenge. And I probably just end by -- and Bill said it earlier, is that the people are the most important asset that we have in this company.\n\nSo that makes this especially challenging because we don't do this very often. And so I just want to note that it's important that we do this and we do this quickly and in the right way and move on to not only getting the savings that Bill highlighted, but also rebuilding the talent in the critical areas that we need it. And I think that will play well as we move into the future. So thank you for all your questions and your time.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrian Eichenlaub -- Vice President, Treasurer and Investor Relations\n\nAlan Matula -- Interim Chief Executive Officer\n\nBill Horton -- Chief Financial Officer\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nKate McShane -- Goldman Sachs -- Analyst\n\nMegan Alexander -- JPMorgan Chase and Company -- Analyst\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nArpine Kocharyan -- UBS -- Analyst\n\nMore WEBR analysis\n\nAll earnings call transcripts"
}