{
  "companyName": "The Children's Place",
  "companyTicker": "PLCE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/17/the-childrens-place-plce-q2-2022-earnings-call-tra/",
  "content": "The Children's Place (PLCE 1.05%)\nQ2 2022 Earnings Call\nAug 17, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to The Children's Place second quarter 2022 earnings conference call. On the call today are Jane Elfers, president and chief executive officer; Rob Helm, chief financial officer; and Josh Truppo, vice president, financial planning and analysis. [Operator instructions] As a reminder, this conference is being recorded. The Children's Place issued its second quarter 2022 earnings press release earlier this morning.\n\nA copy of the release and presentation materials for today's call have been posted to the Investor Relations section of the company's website. Before we begin, I would like to remind participants that any forward-looking statements made today are subject to the safe harbor statements found in this morning's press release as well as in the company's SEC filings, including the Risk Factors section of the company's annual report on Form 10-K for its most recent fiscal year. These forward-looking statements involve risks and uncertainties that could cause actual results to differ materially. The company undertakes no obligation to publicly release any revisions to these forward-looking statement statements to reflect events or circumstances after the date hereof.\n\nIt is now my pleasure to turn the call over to Jane Elfers.\n\nJane Elfers -- President and Chief Executive Officer\n\nThank you, and good morning, everyone. Our Q2 sales and profitability fell well short of our internal expectations due to a significant miss to our retail sales projections in the period from early June through early July. The combination of an unexpected and meaningful increase in promotional activity from our key competitors and the widely reported inflation-driven consumer slowdown put significant downward pressure on our fashion AURs and margins during the quarter. AUR ended the quarter flat versus our projection of up mid-single digits.\n\nOur fashion AUR was down negative mid-single digits, a significant miss from our internal projections, while our basics AUR was a positive low teens as planned. In addition, a $6 million unplanned expense late in the quarter further our margins. This expense was required to address unplanned inbound supply chain disruptions. We had to address a significant imbalance in our channel inventories caused by this disruption.\n\nThe majority of which stemmed from the rapid backup of our East Coast ports as other retailers scrambled to move their shipments from the West Coast. Rob will cover these 2 issues in more detail during his prepared remarks. Moving on to digital. Digital represented 47% of our retail sales in Q2 versus 45% in 2021 and 30% in 2019.\n\nU.S. e-commerce traffic held up well during the quarter, positive 7% versus last year. As planned, Canada e-commerce traffic was down due to the lapping of the temporary store closures last year. We continue to deliver industry-leading digital results, supported by the combination of our structural reset since the pandemic, our increased marketing investments, and our focus on optimizing our channel results.\n\nDigital is our highest operating margin channel and based on the strength of our digital business and our increased investments in this channel, digital is projected to represent 50% of our 2022 retail sales. Looking ahead, we are projecting digital to represent approximately 60% of our total retail sales by the end of the full year '24 versus 33% of retail sales in 2019, almost doubling our digital penetration in only five years. And when you factor in our growth expectations for Amazon, our projected digital penetration grows beyond 60% of total consolidated revenue by the end of full year '24. With back to digital marketing, we are focused on investing in top-of-funnel brand awareness.\n\nWe are realizing positive early results with a 4% increase across the customer base in acquisition, retention, and reactivation for the second quarter. Acquisition was particularly strong with digital acquisition of positive 13% and store acquisition of positive 1% despite the lower store base versus last year. 76% of our transactions occurred on a mobile device during Q2. Our mobile app continues to drive strong customer engagement, especially among our loyalty members, who represent 95% of our mobile app transactions.\n\nOur mobile app customer spend frequency is 10% higher than non-app customers, and basket sizes of customers transacting on our app is 15% higher than our non-app customers Our current back-to-school campaign is focused on fostering children's education and making important resources accessible. We partnered with actor, author, and philanthropist, Kevin Hart for our back-to-school campaign. Since our launch on July 26, we have garnered over 33 billion impressions across almost 500 print, broadcast, and digital outlets. This campaign is packed with rich photo and video content that is being syndicated and amplified across both earned and paid digital media.\n\nIn addition, early results showed robust engagement with over 9.8 million completed video views and strong clicks to site. We continue to see strength in partnering with celebrities and influencers, both micro and macro to drive brand awareness and consideration across key product categories. With respect to Q3, we have already seen positive search trend increases for our holiday and special moments assortments. Results quarter to date show a 90% increase over last year in site searches across our Halloween and Holiday Christmas sleepwear assortments.\n\nOur consistently superior merchandise offerings and our ongoing brand campaigns targeted at these special product assortments have established The Children's Place as a market leader in holiday product offerings, further driving brand loyalty and traffic. We believe that our increased and targeted back-to-school marketing efforts are already having a positive impact on our third quarter sales. Our quarter-to-date sales trend is above our trend for the last two weeks of July. Total retail sales are running down 11% versus 2021 and up 11% versus 2019.\n\nAnd our AUR is currently running up positive high single digits, higher than our back half AUR outlook now assumes based on the uncertain environment. Our basics business continues to be very strong. And with respect to our fashion assortments, our customers responding to the combination of our significantly increased back-to-school marketing efforts and our curated back-to-school fashion assortments. Digital traffic is up over 5% quarter-to-date versus last year, and quarter-to-date digital sales are running down 5% versus last year, higher than we had anticipated, considering our record shattering August last year.\n\nAs we have shared, August historically represented about 35% of our Q3 retail sales. Last year, August represented just over 40% sales, an outsized percentage to the typical third quarter due to the combination of pent-up demand, the return to in-person learning, and the child tax credit stimulus. This year, we're projecting August sales to represent about 38% of the quarter due to the continued growth in our e-commerce business, which generates significantly higher basket sizes. Moving on to Amazon.\n\nOur Amazon business was outstanding in the second quarter. Amazon is delivering very strong results from the inventory and marketing investments we have made and our continues to strengthen. As I mentioned, due to the East Coast port congestion late in the quarter, we had to overspend in our DC to provide Amazon with the necessary inventory to continue to support their outsized trend coming into and out of Prime Day. We had outstanding Prime Day results, and our sales have continued to build every week since Prime Day.\n\nWe believe that the Amazon customer is a higher income customer and advantage as our core customer is feeling significant pressure from the unprecedented inflationary environment. Amazon launched our iconic Gymboree brand on their website in late July. Amazon supported the Gymboree brand launch with several key traffic-driving placements across amazon.com, including the back-to-school, Amazon Fashion, kids fashion and new arrivals landing pages as well as the Amazon homepage gateway. Early results are encouraging, and we look forward to building this exclusive partnership for years to come.\n\nMoving on to Gymboree. In addition to launching Gymboree on Amazon in Q2, we are very pleased with the early reads on our Gymboree back-to-school product launches. For the second quarter, we experienced an $0.18 increase in spend per customer versus last year. We also know that the Gymboree customer is a higher income customer than our core TCP customer, which we believe will be an advantage as we continue to scale this brand.\n\nWe introduced Gymboree Uniform product for the first time in Q2, which drove significant revenue, site search volume, strong social and ad click engagements that continue to grow each week. The Gymboree customer let us know last year that she wanted holiday product earlier in the season, so we launched our first-holiday collection on July 28. Since launch, this holiday collection drove a three times increase in search terms year over year, and it was the top-visited collection on our home page. We are confident that Gymboree will continue to be an increasingly important part of our growth strategy.\n\nIn closing, Rob will walk you through our Q3 and full year '22 outlook during his prepared remarks. From a high-level perspective, when compared to 2019 pre-pandemic levels, although we are now anticipating the consolidated sales will be down approximately 8% versus 2019, we also anticipate that operating income will be up positive mid-teens versus 2019, and EPS will be up approximately 30% versus 2019. With the multiple headwinds we are currently facing, these results would only be possible due to the structural reset to our business model since the start of the pandemic. We have a clear focus on continuing to maintain the significant double-digit AUR increases we have realized since the start of the pandemic, which will benefit our gross margin when cotton costs normalize.\n\nWe will continue to build upon our e-com fleet optimization strategies. We will continue to secure occupancy savings as our leases expire, and our top priority will remain growth in digital, our highest operating margin channel. Now I'll turn it over to Rob.\n\nRob Helm -- Chief Financial Officer\n\nThank you, Jane, and good morning, everyone. After I review our Q2 results, I will provide our Q3 and full year '22 outlook. For the fiscal second quarter, our operating results fell short of our expectations and we delivered an adjusted loss per share of $0.89 versus earnings per share of $1.71 in 2021 and $0.19 in 2019. Net sales decreased by $33 million or 8% to $381 million versus $414 million in Q2 2021 and decreased $39 million or 9% versus $420 million in Q2 2019.\n\nOur U.S. net sales decreased by $48 million or 13% to $313 million versus $361 million last year, and our Canadian net sales decreased by $2 million or 5% to $35 million versus $37 million last year. Comparable retail sales were negative 8.7% versus Q2 2021 and positive 2.2% versus Q2 2019. Our Q2 net sales were negatively impacted by the slowdown in consumer demand driven by the unprecedented levels of inflation, particularly with respect to the significant increases in fuel and food prices, combined with increased promotions across our competitive set.\n\nAs we shared on our last call, our AUR plan for the second quarter was up mid-single digits to offset AUC increases. However, starting in June, the combination of the consumer slowdown and the elevated promotional activity across the sector led to significant unplanned AUR pressure, and our actual AUR for the quarter was flat. The combination of the lost sales resulting from the consumer slowdown and the heightened promotional environment represented a top-line impact of approximately $22 million in our retail sales channels for the quarter versus our internal projections. And as we had planned, sales in the quarter were also negatively impacted by lapping the impact of the child tax credits, which started last July, combined with the pent-up demand from last year's return to in-person learning, and the impact of permanent store closures, representing approximately $14 million for the quarter.\n\nOur net sales were positively impacted by our outsized sales growth in our wholesale channel with Amazon. Looking at sales by month for the quarter. As we discussed on our last call, our sales trend improved in May versus Q1 as we lap the outsized impact of stimulus and unseasonable weather. For June, sales trends further improved but were driven by the heavy promotions necessary to address our competitive set to clear through our summer fashion inventories.\n\nAnd in July, as expected, our sales were meaningfully lower than last year, as we lap the impact of the combination of pent-up demand, the return to in-person learning, and the enhanced child tax credit stimulus. In terms of sales by channel, consolidated digital sales decreased 7% versus Q2 2021, with our digital penetration growing to 47% of our total retail sales versus 45% in 2021 and 30% of retail sales in 2019. Store net sales were down 14% versus Q2 2021. Our comp store traffic was down 4% versus Q2 2021.\n\nHowever, as a point of reference, store traffic remained significantly below pre-pandemic levels, with comp store traffic down 32% for Q2 2022 versus Q2 2019. Adjusted gross margin. Adjusted gross margin decreased 1,046 basis points to 30.2% of net sales, compared to 40.6% in Q2 2021 and 33% in Q2 2019. Approximately 610 basis points of this decrease was unplanned versus our internal projections.\n\nThe 610 basis point unplanned decrease in gross margin rates down as follows: First, the slowdown in consumer demand, combined with the unexpected increase in promotional activity from our key competitors, pressured our top-line sales and fashion AURs, resulting in lower-than-planned merchandise margins in both channels versus our internal projections. The lower merchandise margin, coupled with the deleverage in fixed expenses resulting from the lower net sales, deleverage our gross margin rate by 460 basis points versus our original plans. Second, we experienced significant unplanned inbound supply chain delays, most notably from the rapid buildup in congestion at the East Coast ports as well as the impact of further vendor delays. These supply chain disruptions force us to have to rebalance our basics inventory, primarily uniform across our channels.\n\nWe had to shift large amounts of basics inventory between our channels within our DC and our domestic supply chain to support our strong Amazon and digital businesses and to properly position us to deliver the significant level of basis revenue planned for Q3. These inbound delays resulted in an additional $6 million in incremental and domestic supply chain, which further impacted our gross margin by an additional 150 basis points versus While our second quarter operating results fell well short of our expectations, the combination of selling through our late spring and summer products and getting the cost to balance our channel inventory behind us, enabled us to exit the second quarter in a strong inventory position and better positioned for success in Q3 with respect to our key back-to-school basics in both our digital and wholesale channels. As expected, the following items also impacted our gross margin in the quarter. The sales mix shift to wholesale, which operates at a lower gross margin, we had planned for outsized growth with Amazon in Q2, but we significantly overachieved our internal Amazon sales plans for the quarter, driven by the strong customer response to our back-to-school basic programs.\n\nAnd as a reminder, while our Amazon business operates gross margin, it is accretive to our overall consolidated operating margin, delivering operating margins nearly as high as our owned digital channel. The impact of elevated inbound freight transportation costs driven by significantly higher levels of air freight and higher container rates; and lastly, incremental duty resulting from the loss of the Ethiopian AGOA trade benefits. Adjusted SG&A. Adjusted SG&A was $114 million, flat to last year and versus $115 million in 2019, and deleveraged 223 basis points to 29.8% of net sales, compared to 27.6% of net sales last year.\n\nThe deleverage was primarily the result of the decline in net sales on our fixed expenses. As planned, marketing spend was higher in the quarter, inclusive of investments in brand marketing. Adjusted depreciation and amortization was $13 million in the quarter versus $14 million last year and $18 million in 2019. Adjusted operating loss.\n\nAdjusted operating loss was -- for the quarter was $12 million, a decrease of $52 million versus $40 million of operating income last year, and deleveraged 1,277 basis points to negative 3.1% of net sales, compared to 9.7% of net sales in Q2 2021 and 1.4% of net sales in Q2 2019. Interest expense. Our adjusted interest expense for the quarter was $2.6 million versus $4.7 million last year. The decrease in interest expense was driven by lower interest rates due to our refinancing in Q4 last year and a lower term loan balance outstanding this quarter.\n\nTax rate. Our adjusted tax rate was 18%. Moving on to the balance sheet. Our cash and short-term investments ended the quarter at $28 million.\n\nWe ended the quarter with $284 million revolving credit facility. Inventories ended the quarter up 34% versus last year, and the increase breaks down as follows: 42% of the increase was due to higher AUCs driven by higher input costs. 24% increase was due to higher inbound freight costs. 18% of the increase resulted from the elevated transit times, including the impact of the worsening port disruption on the East Coast.\n\nAnd the remaining 16% of the increase was driven by our investments in inventory to support our strategic growth initiatives with unit growth in place to support Amazon, Gymboree, and Sugar & Jade. Despite the slowdown in consumer demand, we were able to exit the quarter in a strong seasonal inventory position with spring and summer inventory units down 45% versus last year, better positioning us for the back half of the year. Our basic inventory, which includes several key high-volume categories with limited to no markdown risk accounted for over 50% of our on-hand inventory at quarter end, which positions us for what we will believe to be a continuation of the current environment throughout the back half of the year. Moving on to cash flow and liquidity.\n\nWe used $34 million in cash from operations in Q2 versus cash of $30 million last year. Capital expenditures in Q2 were $8 million. During the second quarter, we repurchased 484,000 shares for $23 million, leaving $196 million outstanding on our current authorization. Now I'll provide an update on our store activity in the quarter.\n\nWe closed seven locations in the second quarter, and we plan to close a total of 40 stores for full year 2022. With over 75% of our store fleet coming up for lease action in the next 24 months, we continue to maintain meaningful financial flexibility in our lease portfolio. These short-term leases will continue to provide us with the flexibility to optimize our occupancy costs. We ended the quarter with 658 stores, total square footage of 3.1 million square feet, a decrease of 8% compared to Q2 2021 and 31% versus Q2 2019.\n\nWith respect to our fleet optimization strategy, it's important to continue to highlight that for 2022, we are planning for 50% of our retail sales to come from our stores, with 50% of our store sales coming from traditional malls and 50% coming from off-mall. With our digital business also planned an industry-leading 50% of total retail sales, we are planning for 75% of our retail sales from off-mall, strongly supporting our structural reset to a digital-first retailer. Moving on to our outlook. Based on the current environment, we are now planning for a decline of approximately 10% in net sales versus 2021 for the year.\n\nOur inventories are now better positioned by channel to meet the current demand trends. However, we anticipate that promotions will remain elevated for the back half of the year, and we are continuing to proactively manage our inventory levels. We continue to benefit from our pricing and promotion reset. AURs are planned to remain significantly higher than pre-pandemic levels.\n\nHowever, based on the current environment, our outlook now assumes a positive low single-digit AUR increase for the back half of the year versus our original projection of positive high single-digit AUR increases. Our outlook assumes that our Amazon business continues to outperform supported by our significant investments in both inventory and marketing. Starting with our Q3 outlook. The company expects net sales for the quarter to be approximately $500 million, representing a low double-digit decrease in comparable retail sales versus Q3 2021 and a positive mid-single-digit comp increase versus Q3 2019.\n\nAdjusted operating income is expected to be approximately 14% of net sales, as compared to 20.9% in Q3 2021, primarily driven by the decrease in sales. This compares to 12.1% in Q3 2019. We anticipate third quarter adjusted earnings per diluted share to be approximately $3.95, as compared to adjusted earnings per diluted share of $5.43 in Q3 2021 and $3.03 in 2019. Our total inventories at the end of Q3 2022 are anticipated to remain elevated, primarily driven by higher raw material input costs and higher inbound transportation costs.\n\nMoving on to our full year outlook. For fiscal 2022, the company expects net sales to be approximately $1.725 billion, reflecting a low double-digit decrease in comparable retail sales versus fiscal '21 and a positive mid-single-digit comp increase versus full year 2019. We project that e-commerce penetration will increase to 50% of total retail sales for full year 2022 versus 46% in full year '21 and 33% in full year 2019. Adjusted operating income is expected to be approximately 7.5% of net sales, as compared to 15.1% in '21 and 6% in 2019.\n\nWe anticipate fiscal 2022 adjusted earnings per diluted share to be approximately $7, as compared to adjusted earnings per diluted share of $13.40 in '21 and $5.36 in 2019. Our inventories at the end of Q4 2022 are anticipated to moderate from current levels. We are planning for a full year tax rate in the range of 23% to 24%. Our outlook for the balance of the year assumes lower occupancy cost versus last year due to the impact of our permanent store closures as well as the benefit of favorable lease negotiations and lower variable occupancy expense resulting from the lower planned sales.\n\nAlthough there has been some moderation of inbound container and transportation costs, our full year outlook does not contemplate a significant improvement from current levels. However, we are planning for significantly lower air freight costs in the back half of the year versus the first half of the year. We anticipate that the full year '22 SG&A will be slightly lower than full year 2021 with SG&A planned to be approximately $450 million for the year. Due to the combination of the actions we were taking in response to the current environment, the benefits from our fleet optimization program, and lower incentive compensation expense.\n\nWe are planning significant marketing investments for the back half of the year, which we believe will continue to support TCP sales and acquisition goals as well as support the continued momentum in our Gymboree and Amazon businesses. We're planning for lower interest expense in the back half of the year, resulting from the favorable interest rates we secured as part of the refinancing of revolving credit facility and term loan in the fourth quarter for 2021. In line with historic norms, we expect to generate significant operating cash flow in the back half of the year, providing us with the ability to continue to return capital to our shareholders and reinvest in our business. Lastly, we are planning for capital expenditures of approximately $45 million for fiscal year 2022 with $26 million remaining for the balance of the year, the majority being allocated to support digital and supply chain fulfillment initiatives.\n\nThank you. And now we will open the call to your questions.\n\nOperator\n\n[Operator instructions] We'll take our first question from Jay Sole of UBS.\n\nJay Sole -- UBS -- Analyst\n\nGreat. Thank you so much. Jane, I want to ask you about just AUR in sort of the context of this quarter, second quarter was sort of an unusual quarter. As you think about the AUR gains that you've been able to maintain, how would you think about just at a high level, I know you're not giving guidance for fiscal '23, but how do you think about what the gross margin should look like in a normalized environment once some of the supply chain stuff and maybe some of the unusual promotions from some of these competitors sort of it gets back to regular levels.\n\nJane Elfers -- President and Chief Executive Officer\n\nYeah. Let me take the first part of that, and then I'll turn it over to Rob. Just from the AUR question on Q2, we covered it in the script, but I think it's worth diving a little bit deeper into it. We had the industrywide slowdown in June, particularly in softlines and discretionary product, which we've all read about.\n\nBut what we had and what surprised us was the unexpected and meaningful ramp-up in the promotional activity from our two main competitors, which really started in early June and really ramped up in mid-June through the end of the quarter. I think from our chair, it's frustrating. We all experienced firsthand the benefits of tightly controlled inventories in 2021. And to see a reversion back to bloated and missed inventories in the sector, less than a year later, it's tough to watch.\n\nOn top of that, what I think made it even more frustrating for us in Q2 was that it wasn't kids-specific issues that our competitors had. It appeared to be a hard goods issue with one of them and you had another adult apparel for the other. But in the end, it really didn't matter since they're two very large retailers with a wide reach and our two biggest competitors. And so when they have a sale in one area to this degree, it's going to draw a mom in.\n\nAnd while she's there, she's clearly going to shop for her kids. So when you have promotional events as large as the running, it left us with no choice, but to compete on price. And then when you look at what happens in our Q2 offerings and our product offerings, Q2 has historically been our lowest quarter of EPS and operating margin. And the fact that our summer fashion product is really commodity products, much more so than any other quarter because there's no differentiated or there's really no holiday product in Q2, like there is in Q1, Q3, and Q4.\n\nSo the vast majority of our fashion product in the second quarter is made of commodity categories of short mix and match and graphic tees, which we always say, which is the lion's share of what we carry and what we sell in Q2 up until we get to the second week in July, where we really convert to back-to-school. So when you have competitors offering these commodity categories at sale prices and your AUCs are a decade highs, it really doesn't leave any room. So our total AUR for the quarter, as we had said, was mid-singles. And the breakout was fashion was planned up low singles, the lowest of the year with our fashion plan because it is commodity product and basic AUR was planned up low teens.\n\nAnd we hit our AUR plan in basics and we miss fashion by a wide margin. And when you put the AUR miss against the retail sales, our internal projections, you get almost 500 basis points of margin miss that Rob mentioned for the quarter. As you forward to Q3 and Q4, we feel like we've derisked those two quarters by lowering our AUR projections for the back half. So we've taken our -- what were our previous AUR projections, which were up high singles to up low singles.\n\nAnd what we've done is we've kept our basics AUR plan intact because we're delivering against that and continue to deliver against it and have delivered against it all year. It's kind of markdown immune product, if you will, that has zero liability if you will. And what we've done is we've taken our fashion AURs for Q3 and Q4 down significantly from where they were. And so as I mentioned, as we look forward into the balance of this year from a margin point of view and certainly into '23, we're only three weeks into the quarter, but our AUR is holding up much better at high single digits, both basics and fashion AUR holding up well.\n\nAnd what we attribute that to is certainly the marketing efforts that we spoke about on the call, but also the fashion assortments in Q3 are very different than the fashion assortments in Q2, which are really commodity based. So I think that the customer is clearly responding to some of the differentiated fashion product that we brought in and some of the early holiday product that we brought in with respect to like Halloween and Christmas. And I think that as we look forward, that just further reinforces that we need to continue to strategically diversify our offerings with respect to things like our initiatives around Gymboree, our initiatives around Amazon and our initiatives around Sugar & Jade, which we continue to focus on. So I think when you look into Q3, I mean, into 2023, and I'll turn it over to Rob for some more thoughts on that, cotton is certainly a huge, huge problem for us this year at decade highs.\n\nAnd as those costs start to moderate, particularly in the back half of the year, there is significant gross margin opportunity for us because, as you pointed out, the double-digit AUR and we've never really given the number, but they are significant, significant double-digit AUR, we still hold on to those even through tough Q2, we ended flat. So our intention and our goal is to continue to hold on to those significant AUR increases we got during the pandemic. And when the cotton prices normalize, as I said, that is a huge, huge lift behind gross margin that's coming for us, which we anticipate we'll start to see in the back half of '23.\n\nRob Helm -- Chief Financial Officer\n\nJane is exactly right in the gross margin. There's really four components. First, the cotton costs, those gross our AUCs by high single digits. Right now, we're in the middle of our summer buy.\n\nSo we'd expect some moderation in the back half of the year and benefit as those cotton costs come down. The second component is inbound transportation costs. We don't expect expedited air freight and the cost that weighed on our first half margins this year to the degree next year. And we've seen recent moderation in container costs, so we expect that for that to continue.\n\nThe third component is occupancy costs. We've done really well on that over the last couple of years. And we still maintain a significant amount of financial flexibility with 75% of our leases coming up in the next 24 months. And with soft traffic, we think that that positions us well for future negotiation savings.\n\nAnd the last piece is our focus on continuing to improve our e-commerce fulfillment.\n\nJay Sole -- UBS -- Analyst\n\nGot it. If I can ask one more, Jane, just because you mentioned the importance of continuing to focus on Amazon and the other strategic initiatives. It sounds like that Amazon business continues to evolve and improve. Can you just give us maybe dive in a little bit more and elaborate on what you saw in Amazon in the quarter? And what's giving you confidence about that business as you move into the back half of the year and next year?\n\nJane Elfers -- President and Chief Executive Officer\n\nYeah. I mean we had pretty significant increases in Amazon in 2021, and we came into 2022 with a very aggressive plan, and we're beating it every quarter. So we've increased again our plan in Amazon in the back half. We have really made a lot of strides as far as the partnership is concerned, and they are working very closely together with us to try to sell a lot of the white space voids they have on their site.\n\nThey really have a very fragmented big kids business, and I think they clearly now see the opportunity now that they're in a much different inventory position than they've been in that Children's Place is a key partner in order to help them fill that white space. And so we had a great -- like I said, we had an outstanding Prime Day. We're up about 300% versus last year. But I think more importantly, our business has continued to build every week So we just keep doing more and more and more sales with them and beating our projections for them and beating their own internal projections.\n\nSo we worked really hard in the second quarter. We had to overspend, but we worked hard to mitigate some of the supply chain issues we saw in our East Coast ports to be able to get them the inventory to fill them back into Prime Day, and also to be able to do the significant business we see in basics for August and September. But going forward, they continue to get into new categories all the time. We've really started out with the basics business, we've now gotten into a fashion business.\n\nThey had a really strong business last year in holiday sleepwear in the Christmas and Halloween sleep. They have much, much stronger positions in that this year. They never had outerwear before. They have that coming in this year.\n\nFootwear is another thing that we're just scratching the surface with them on, but what they've been able to have, and it's really basically in uniform has been very, very successful. So we keep strategically adding fashion categories on top of the big base of the basics business we have. So that's -- we anticipate that will continue to build and grow as we get into '23 and beyond. So really exciting partnership.\n\nAnd then as we talked about, we launched on Gymboree just very recently and excited to be partners exclusively with them as well.\n\nOperator\n\nWe'll take our next question from Dana Telsey of Telsey Advisory Group. Your line is open.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGood morning. Good morning, everyone. Jane, as you think about back-to-school -- as you think about back-to-school to holiday, anything -- any learnings from the macro pressures on the consumer from back-to-school of how you're preparing for holiday whether it's timing, whether it's promotions, any of it? And then just on the storefront versus online, what did you see as you went through the quarter in terms of traffic? Did it change at all versus online? And when you talk about other initiatives, how is Sugar & Jade progressing relative to your plan? Thank you.\n\nJane Elfers -- President and Chief Executive Officer\n\nSure. Well, Sugar & Jade is small. And so the plan is very, very, very small. As we have said, we are testing through the four quarters of the year to see what they want.\n\nAnd so we learned what they wanted in holiday, and we then did our holiday '23 buy based on that. We learned a lot in spring and summer about the commodities that they want. It's not really about with Sugar & Jade. It's really about commodity categories and saw some significant learnings from spring and summer that we're able to go back into for next spring and summer.\n\nAnd now for back-to-school, we're kind of seeing the same thing, strengthen backpacks, to strengthen fashion denim, and continued strength in like lounge/sleepwear for them. So we're happy with what we're learning. But like as I said, it was a very small plan to start with. So we feel good about how we planned it and what's happening with it.\n\nAs far as traffic, store traffic was a little bit better than it has been in second quarter when you compare it to 2021. It was down like 4%. But when you compare it to 2019 in pre-pandemic levels, it's still down in the mid-30s. So that's as far as we're concerned, that's not great.\n\nAnd so we'll continue to watch that. We are very pleased in a very tough quarter. We are very disappointed with our results in Q2, but we were pleased with where e-com traffic held up at up 7%. And so we thought that, that was pretty good, particularly with the amount of e-comm penetration in those last two weeks of July.\n\nAnd as we mentioned on the call, e-com traffic in Q3 is up 5%, which surprises me, quite frankly, based on the historically record shattering, if you will, August that we had last year. So digital, digital, digital continues, obviously, is our focus. Your question about the difference between back-to-school and holiday, we are delivering Christmas, I'll just call it Christmas for ease of this conversation earlier than we did last year. We had some supply chain problems in TCP and we didn't launch a lot of our Christmas product until the end of September and the beginning of October, which was late for us.\n\nThis year, we're planning on launching it, build lion's share of it on, I think, 825 or 828. So we're looking to accelerate that business. As I mentioned on the call, we already launched a Gymboree holiday Christmas collection, which was our No. 1 traffic site visited on the site.\n\nI think the work that we've done behind emotional product and what we saw in Q1, our strongest business in Q1 was by far Easter, people were dressing up again. And then even if you take it through Q2, even though it's a tiny part of our business, things like woven tops and like the item dresses and girls continue to be stronger, while the customer was kind of shunting, if you will, the knit categories. I think the consumer had locked up on so many knits over the pandemic, be it sleepwear or T-shirts or mix-and-match knits and things like that, which has necessitated us clearing them in Q2, where you really see her buying again is in those dress-up categories. And so where, I think, are really well-positioned currently right now, which is, I think, why we're seeing the bounce back in AUR and that emotional product, be it pumpkin picking or harvest or apple picking and then all the way through we have, like I said, an earlier launch on holiday, we have more receipts behind dress-up than we did last year because we anticipated when we saw what happened in Easter, the continuation would happen for Christmas.\n\nAnd then we also have, I think, the opportunity in Q4 where we were kind of shut down, if you will, December week 5 through the end of January in stores from Omicron. I think that's probably part of the reason why we are anticipating our Q3 trend will improve -- I'm sorry, our Q4 trend will improve over our Q3 trend. So we're definitely in a woven cycle, we're definitely in a dress-up cycle, and I think our inventories are positioned for that in Q4.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nJane Elfers -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] We'll go next to Susan Anderson of B. Riley.\n\nSusan Anderson -- B. Riley Financial -- Analyst\n\nHi. Good morning. I want to maybe follow up just on the promotions. It sounds like you feel really good about the basics and it's being -- it's pretty rational out there.\n\nYou feel like you don't feel is a need to promote. I guess, what's the risk there if your competitors you get promotional on basic product during back-to-school? Would you have to, I guess, follow And then also, I'm curious, it sounds like you feel like kids inventory at those competitors is still pretty good. It's the other categories that may be driving the traffic to the store and purchasing there. So I guess I'm curious how you feel about just the competitor inventory and if that's a risk to having to promote more in the quarter.\n\nAnd then lastly, just on supply chain. It sounds like the issues -- what's the risk of that coming back in the third quarter? And then if you could talk about freight and shipping costs in third quarter year-over-year expectations. Thanks.\n\nJane Elfers -- President and Chief Executive Officer\n\nSure. As far as the basics and the competitors, I think when you look at us versus our two main competitors, I think we're well in line on our basics. Clearly, a strength of ours has been for years. And when you look at where we're priced versus them, we're very much in the pocket of being competitive, and in some cases, we're lower than them.\n\nSo I feel confident that we're going to continue to be OK in the basics AUR as we kind of have been all year. And if we could stay OK in what was a very irrational environment in Q2, and we've seen what we've been through almost three weeks in August, which is really where the bulk of our back-to-school business happens from 715 to 815. I think we'll continue to be able to keep that AUR where we need it. If you look at Q3, we originally had our AUR planned up about 9%.\n\nBasics continues to be low teens, and fashion was mid-singles. We've kept the Q3 AUR plan in basics in the low teens, and we've taken the fashion AUR down to -- from up mid-single to down mid-singles for a total AUR plan of two. And so we think that we have appropriately derisked the fashion from the over of the competitors. Yes, as I said, that I don't think that the kids inventory and our competitors in the state where it needs to be promoted.\n\nI think that just from what we see, and obviously, we don't have complete visibility into our competitive inventories. But from what we see in stores and what we see online, that doesn't seem to be where their issues are stemming from. And certainly, when you listen to them, speak about the issues they have, they don't talk about kids. They talk about -- one of them talks about hard goods and the other talks about women's apparel.\n\nSo I think that what happened in Q2 is the entire box got competitive for them. And so they overpromoting kids as well to drive -- as you said, to drive that traffic in and bring mom in and have her buy while she was there. So we saw a lot of price like $2 and $3 tanks and things like that on that commodity pricing. And so I think by taking the AUR down in fashion from up mid-singles to down mid-singles is to your question, derisking it from an AUR perspective.\n\nWhat we saw on supply chain issues in Q2, which was specific to us, which was unplanned, is that we have used, I would tell you very strategically the East Coast ports for almost exclusively for the better part of the decade, and it served us very well over the years with all the problems that we've heard, seen and read about in the West Coast, particularly during the pandemic, when they were backed up for literally months on As you may remember, we did had probably less disruption than most in our supply chain in 2021, and our merchandise flowed better as we, as I mentioned, strategically use the East Coast port. Again, unfortunately, for us, we got caught up with the competitors who scrambled to move their receipts from the West Coast ports. And to the less -- the less crowded East Coast ports and then that caused an unprecedented backup. And I'm particularly talking about which is our most important part, and that's stranded a lot of our large July basic delivery.\n\nSo we have those stranded for over four weeks and some of them haven't even arrived yet. So that's what caused us to have to spend a lot more than we had planned to in our DCs to rebalance inventory we did have. So we had to take a lot of inventory and move it around to channels like Amazon and digital to support the trend. And we also had additional DC cost of freight and labor moving shipments at a lower AUR, which put pressure on the basket sizes, which all goes back to the over promoting.\n\nSo I think when you think about why aren't you going to have those supply chain costs reoccur in Q3 or Q4. Clearly, our merchandise is going to come in. We don't know everything about the port, but we certainly, our logistics team talks to them every single day. And as of yesterday, I don't know it might be too much information, but 35 vessels that anchored at Savannah, which is a major improvement from where we've been.\n\nAnd then the Georgia Port Authority says that by the mid to the end of September, they should be back to normal and that we should not see that increase in Q4 again. They have, obviously, great visibility into what's coming in, and we have projections from them through week 39. And they all look manageable. So we don't anticipate having to scramble again in our DC as those East Coast ports kind of go back to normal as the other retailers go back to the West Coast now that things have calmed down.\n\nOperator\n\nOur next question is from Kelly Crago of Citi. Your line is open.\n\nKelly Crago -- Citi -- Analyst\n\nHi. This is Kelly on for Paul. Just curious if we could circle back on the composition of your inventory. I think you said spring/ summer units are down 45% versus last year.\n\nDoes that mean you do not have much carryover excess spring inventory get through at this point? In other words, you're sort of -- you entered the back-to-school season pretty clean from an inventory perspective. And sorry if I missed this, how much are your total units up year over year?\n\nRob Helm -- Chief Financial Officer\n\nYes. That's exactly what it means, Kelly. Our spring/summer is down 45%. The predominant driver in our inventory increases are increased AUCs and higher costs.\n\nThat accounted for nearly just over 60% of the increase. From a unit inventory perspective, we have a small amount of -- tiny amount of growth, and that's really relative to our strategic growth initiatives, Amazon, Gymboree and Sugar & Jade.\n\nOperator\n\nAnd we'll take a question from Marni Shapiro of Retail Tracker. Your line is open.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nHey, guys.\n\nJane Elfers -- President and Chief Executive Officer\n\nGood morning.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nGood morning. I just wanted to clarify, Jane, you've talked a lot about sort of the basics business versus the fashion business versus the dressy, three different things in your store. But it sounds like your customer is responding to those either need pockets so back-to-school uniforms or emotional pockets, so holidays or family event. Can you just talk about her resistance or to come in or be online and buy those items versus the other? And I guess what falls in that other pocket because you then clarify the difference between wovens and knits.\n\nSo it doesn't sound like it's across the board on the fashion. It sounds like she is being very specific and mindful in what she's shopping for, if I could put it that way.\n\nJane Elfers -- President and Chief Executive Officer\n\nYes. 100% agree that she has been very specific and mindful from a basic point of view, a 100% agreement, she's still stocking up on those. She needs them for back-to-school. They've been a very strong part of our business from July 15th onward.\n\nThey always are a much bigger part of our business this time of year. And we're very happy with what we've seen. We mentioned the AUR. We feel very good about where we're planned, where we're actually coming in and the AUR associated with that.\n\nWhen you go uniform, obviously, would be included in that uniform denim, backpacks, those types of things. When you look at the emotional product, and you go online and you see things like apple picking and harvest and the plates that we bring in and the family looks and all those things, she is clearly responding to those as well, which is why I think that the fashion AUR is holding up a lot better in Q3 than it did in Q2. And then you get to the resistance categories. And so what I would call the resistance categories, and this has been year to date.\n\nWe'll have to see what happens in the back half would be the knit categories. And so the T-shirts, the mix and match, those types of things, sleepwear have all been subpar performers in the first half of the year because when you saw how they outperformed in 2021, I think that there would naturally be a pullback. And so you think about as you move into Q3 and Q4, for us, what are those categories and the things that come to mind right away for me is the long sleeve knits and active bottoms, which are two big, big categories for us in Q3 and Q4. And so those are the types of things that we have to watch carefully, and we have to watch to make sure that we're not overpromising ourselves on AUR because those are categories that we have to wait and see if mom is going to start to buy those again or if she's going to still think that she's got enough knits to last her, and she's going to continue to go for woven tops and into woven bottoms.\n\nI think the other thing that is going to have to happen before those specific net categories that I'm talking about, get back on track again is definitely a weather change. I do not anticipate the mom is going to start stocking up on any type of knit category until she needs to. And so I think when we see the weather change, which we'll hopefully see in mid-September -- mid-to-late September, we'll really have a much better idea of how knits in general as a category is going to perform through Q4 in the back half of the year.\n\nOperator\n\nThank you for joining us today. If you have further questions, please call Investor Relations at area code 201-558-2400, extension 14500. You may now disconnect your lines and have a wonderful day.\n\nDuration: 0 minutes\n\nJane Elfers -- President and Chief Executive Officer\n\nRob Helm -- Chief Financial Officer\n\nJay Sole -- UBS -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nSusan Anderson -- B. Riley Financial -- Analyst\n\nKelly Crago -- Citi -- Analyst\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nMore PLCE analysis\n\nAll earnings call transcripts"
}