{
  "companyName": "Enbridge",
  "companyTicker": "ENB",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/enbridge-enb-q3-2022-earnings-call-transcript/",
  "content": "Enbridge (ENB -0.43%)\nQ3 2022 Earnings Call\nNov 04, 2022, 9:00 a.m. ET\n\nOperator\n\nWelcome to the Enbridge Inc. third quarter 2022 financial results conference call. My name is Brent, and I will be your operator for today's call. [Operator instructions] Please note that this conference is being recorded.\n\nI will now call over to Rebecca Morley, director, investor relations. Rebecca, you may begin.\n\nRebecca Morley -- Director, Investor Relations\n\nThank you. Good morning, and welcome to the Enbridge Inc. third quarter 2022 earnings call. My name is Rebecca Morley, and I recently joined Enbridge as a director on the investor relations team.\n\nJoining me this morning are Al Monaco, president and CEO, Vern Yu, chief financial officer, and the heads of each of our business units, Colin Gruending, liquid pipelines, Cynthia Hansen, gas transmission and midstream, Michele Harradence, gas distribution and storage, and Matthew Akman, renewable power and new energy technologies. As per usual, this call is being webcast, and I encourage those listening on the phone to follow along the supporting slides. We'll try to keep the call to roughly one hour. And in order to answer as many questions as possible, we'd appreciate you limiting your questions to one plus a single follow-up as necessary.\n\nWe'll be prioritizing questions from the investment community. So if you are a member of the media, please direct your inquiries to our communications team, who will be happy to respond. As always, our investor relations team will be available following the call for any additional questions. On to slide two.\n\nwhere I will remind you that we'll be referring to forward-looking information in today's presentation and in the Q&A. By its nature, this information contains forecasts, assumptions and expectations about future outcomes, which are subject to the risks and uncertainties outlined here and discussed fully in our public disclosure filings. We'll also be referring to non-GAAP measures as summarized below. With that, I'll turn it over to Al Monaco.\n\nAl Monaco -- President and Chief Executive Officer\n\nOK. Thanks, Rebecca. Good morning, everyone. I'll start with the third quarter highlights and our business update.\n\nVern will then review the results and the outlook, capital allocation and the usual ESG update. Before that, a couple of comments on the current energy and epic landscape. That landscape is characterized by volatility we haven't seen for a long time. High inflation and tightening monetary policy, energy supply shortages and the looming recession.\n\nThose challenges appear set to continue through next year. Energy-wise, the situation in Europe has brought security and reliability back into focus, while ensuring we're on track to reduce emissions. The investment required to meet energy demand for both conventional and low-carbon supply is only half of what we need, which has led to sustained high prices. For our part, we've proved through COVID and many times before, our business model is built to weather storms like this.\n\nOur premium natural gas, liquids and renewables businesses are well diversified, and we deliver energy to the best markets at very low cost. Our commercial underpinnings give us resiliency and predictability of cash flows through all market cycles, and our balance sheet is strong. And you've seen again this quarter, we have an increasing inventory quality organic investments that will drive growth well into the future. So Enbridge is well positioned, not just to withstand volatility, but to grow and thrive in any environment.\n\nAnd Vern is going to expand on this a little bit later. So on to the highlights. In a nutshell, excellent progress on our priorities this quarter. Safety and operations wise, we performed well, and utilization was high across all systems.\n\nThat translated to strong Q3 numbers, and we're on track to achieve our full year guidance. At this point, we expect EBITDA to come in above the midpoint of our guidance range and DCF per share above the middle. On project execution, we have roughly $3.8 billion slated for in-service this year, which drives cash flow in '23 and beyond. More good news this quarter on organic growth, tuck-in M&A and capital recycling.\n\nWe secured another $3.8 billion of projects, the lion's share being our key South expansion in BC. I'll come back to this later. That brings newly secured growth this year to $8 billion, which illustrates the embedded opportunities we've been talking about within our four franchises. We'll do smaller scale M&A where it makes sense.\n\nAnd we executed twp excellent deals this quarter, totaling $0.5 billion. Lastly, we continue to surface value by monetizing assets at good valuations over $1.6 billion this quarter. That adds to our financial flexibility. And in the case of the P66 joint venture, we reduced our G&P exposure, which is now de minimis.\n\nTo put the business update in context, this slide recaps our two-pronged strategy and the optionality we have in our businesses. Prong 1 is to continue to invest in conventional businesses. The fundamentals of our core franchises are stronger than ever, especially in the context of energy security, reliability and affordability concerns. To ensure we're aligned with our emissions reduction goals, we're modernizing our assets, self-powering with renewables and ensuring new investments have a plan to hit our targets.\n\nAt the same time, we're ramping up low-carbon investments. You can see, we're focused on proven low-carbon strategies that leverage our existing assets. Our conventional businesses are each progressing those opportunities on commercial terms that fit our low-risk model. Any way you look at things, low carbon energy will need twp things to happen, transportation and storage.\n\nWe have a lot of that. Having pipe in the ground will be valuable in any transition scenario we can see. A great example is CCS, which is a must in meeting our emissions goals, and that presents an excellent growth opportunity for us, along with hydrogen, RNG and of course, wind and solar. On to the business update.\n\nIn gas transmission, we've got roughly $10 billion of projects in execution, including our annual modernization program and recently secured projects. Gulfstream phase six is now in service. We reached a rate settlement on our BC system and a good TETCO customer settlement. We're seeing strong throughput throughout our systems.\n\nAnd we recently recontracted capacity on the Southeast Supply Header at very good rates. In gas distribution, we've got $3.5 billion underway, and we'll have five of the 27 new community expansions done by year-end. Earlier this week, we filed our utility rebasing application that will establish rates through 2028. You can think of this as carrying on under incentive rates.\n\nAnd we sanctioned twp new RNG projects in Ontario. Renewables is performing well, and we have $2.9 billion in execution, including 10 solar cell power projects. In liquids, mainline volumes recovered nicely in the quarter, and we expect good utilization through year-end and '23. On our Wabamun CCS project, we signed our evaluation agreement with the Alberta government, and we expect to drill twp wells in '23 to prove out the geology there.\n\nAnd on the Corpus Christi carbon hub, we're in discussions with our customers. So let's get into the exciting growth projects in our gas business. First, here's how we see the fundamentals and our opportunity set. Not much doubt that global gas demand will grow given its abundance, security benefits and lower emissions.\n\nWe see gas continue to be a critical part of the energy supply mix well into the future. North America's gas advantage will lead to growth in global market share with LNG exports tripling to over 30 Bcf by 2040. We're really pleased with how we're situated to capitalize on these fundamentals. So here's what that looks like.\n\nNow, there's a lot in this picture here, but it illustrates well the reach of our systems and our growing LNG footprint. Domestically, we see the best markets totaling around 170 million people. We see growing residential, commercial and industrial load and gas will be critical to replacing 84 gigawatts of coal. And we're in discussions now with our customers in the US Northeast to develop solutions that address price and reliability concerns, which are only getting worse.\n\nAnd I think the price pressures and reliability issues are really starting to sink in. Another big prize is LNG. We serve four plants in the Gulf Coast, soon to be 5, and we make up 20% of US LNG exports through our pipes. We've also secured Precedent Agreements with two more LNG facilities that are pending FID.\n\nThat's Rio Grande and Texas LNG, and there could be more after that. If those do go ahead, we could see our LNG export market share rise to 30% or above. Related to that in the Gulf, we're also very focused on upstream expansion opportunities to connect growing Haynesville supply to LNG via Texas Eastern. So think of that as an upstream strategy in our pipes.\n\nAnd of course, we just landed an investment in Woodfiber LNG on the West Coast of Canada. In BC, last quarter, we sanctioned a $1.2 billion expansion of our T-North system at Aspen Point and launched a binding open season on T-South. So let me update you on that. The results of the open season were strong and carry long-term volume commitments.\n\nSo we've now sanctioned and are proceeding with a 300 million cubic feet a day expansion, which is comprised of looping and compression. This effectively replaces capacity currently moving volume to the Pacific Northwest, which will be utilized to feed Woodfiber LNG when it goes in service. Pacific Northwest demand is also expected to grow, so this expansion ensures reliability in the region. Our preliminary capital estimate is up to $3.6 billion.\n\nWe'll finalize the cost once we have completed environmental and revenue work. Importantly, we'll be engaging and listening to stakeholders and communities and seeking their expertise and look to form economic relationships there. The T-South commercial structure is cost of service, and we expect to file a regulatory application in 2024. Continuing with BC, today we also announced a binding open season for a further expansion on T-North.\n\nGiven the outlook for Western Canada supply, we're seeing strong customer interest for more egress for LNG exports and downstream access. So in addition to Aspen Point then, there's now an opportunity to expand T-North by another 500 million cubic feet a day. This also will include looping and compression at a cost of roughly $1.9 billion with an expected 2028 ISD. Again, this is cost of service model which generates stable cash flows and good returns.\n\nThe open season will run to January 10, so we'll see what that reveals and go from there. Now, these BC system expansions that I just went through represent about $7 billion of high-quality organic investment that are right down the middle of the Enbridge fairway. And they really illustrate the power of our strategically positioned system for low-cost egress to growing markets. Moving now to liquids, starting with mainline coal.\n\nWe're continuing shipping discussions on a new commercial agreement that works for our customers and Enbridge. So that's positive. Given the importance of the deal to industry and us, it makes sense to take a little bit more time to make a final call on which path we'll proceed on, a CTS-like incentive tolling deal or cost of service. As a reminder, we've been on incentive tolling now for 25 years, and it's worked out well for industry and ourselves.\n\nNow, if we can't land on a reasonable deal, then, of course, we'll proceed with the cost of service application, which is ready to go and updated for the current inflationary environment. From a financial and commercial perspective, either of the twp options are acceptable to us as we said before. In fact, once we land on a commercial framework, we've got several cost-effective expansions that can give customers added egress. We're also accelerating our US Gulf Coast strategy which builds on last year's anchor investment of the Ingleside export facility in Corpus Christi.\n\nGood news here, we're seeing an uptick in export volumes out of Ingleside now with 10 record loading days in October. We've also now sanctioned a 2-million-barrel storage expansion at Ingleside, which allows us to attract more export barrels to the terminal and its shovel-ready. We've increased our ownership in twp key Permian pipelines serving the region and Ingleside being Gray Oak and Cactus II. The increase in Gray Oak came from our new P66 joint venture which I'll come back to, and we acquired another 10% of Cactus II, so that brings us to 30% with Plains.\n\nBoth deals bolster our US Gulf Coast position and are financially accretive. Now, to renewables. Just like natural gas, it's clear that renewables will be a bigger part of the global energy supply mix. Our European offshore wind business is growing nicely and we've got strong commercial and execution teams in place and great partners.\n\nIn fact, we've got the Saint Nazaire project coming on later this month with first power. But there's another big opportunity to accelerate our North American business, driven by a host of factors, including renewables targets and policy actions we've seen lately. Our North American strategy has evolved quite a bit on a couple of fronts from primarily acquiring late-stage projects in years past to now leveraging our own assets, land positions and load. And second, capitalizing on our development, construction and operating experience built over the last 20 years [Inaudible].\n\nThe acquisition of Tri Global Energy brings our capabilities and strategy to yet another level. The Tri Global team fills in what I call the front end of our renewables value chain and gives us extensive origination capability, being resource assessment, site prospecting, land environment and grid interconnection. TGE brings a great development track record in a variety of markets, having monetized 6 gigawatts for 24 projects. The TGE front end is highly synergistic with our commercial, EPC and operating capability.\n\nWhat we really like is that TGE allows us to quickly exploit our own lands and existing development opportunities. The deal also comes with a contracted revenue stream on monetized projects so good early cash flows. And the big prize is 3 gigawatts in late-stage development projects slated for in-service between 2024 and '28, and many of those overlap with our existing operations. Permitting and environmental reviews on those is advanced and in the interconnection queue, which is a big advantage given the time it takes to get through grid connections in today's market.\n\nThose development projects alone could drive over $3 billion of investment. That triples our North American near-term development portfolio, and there's even a larger early stage backlog. So the Tri Global deal drives outsized value for us. It not only accelerates growth in our renewables business, but it moves the overall Enbridge growth yield.\n\nTo put that in perspective, this slide shows the size and diversity of our renewables business today. We've got 47 facilities in operation or construction across four countries in North America and Europe. We built a solid business here generating close to 6 gigawatts of gross capacity. We have fully resourced development teams in North America and Europe.\n\nWith the TGE acquisition, our global development portfolio has more than doubled now to roughly 7 gigawatts with even more coming behind that. Before I turn it over to Vern, I'll speak to how we're keeping our eye on surfacing value from our assets and increasing financial flexibility. Over the last five years, we've recycled $11 billion of capital at good valuations while further strengthening our low-risk model. Our P66 joint venture is a great example, providing a trifecta of benefits.\n\nOne, we reduced our exposure to DCP, and this is a well-managed G&P business but not fully aligned with our business model; two, we increased our ownership in and became operator of Gray Oak, which is a key element of our Permian egress and US Gulf Coast export strategy; and three, the deal generated $600 million in equity to redeploy within our capital allocation framework. An equally important transaction is our Regional Oil Sands deal with Aii. This is a real gem as it establishes a solid economic partnership with 23 indigenous groups in Alberta. You can see the dots on the map here show the breadth of participation of indigenous communities along the entire rights-of-way.\n\nThis corridor is highly strategic to our customers and Enbridge. So this deal demonstrates the importance we place on alignment with First Nations and Métis. Part of that is gaining partners with in-depth knowledge of the land, water environment, which we place a high value on. The deal also releases over $1 billion in equity at attractive valuation, again, to redeploy to other opportunities.\n\nIn the bigger picture, we think this is an ideal model for how energy infrastructure will be developed and owned in the future, a model that fully aligns safety, environmental and economic interest with indigenous groups and one that we hope will be applied across our asset base on both sides of the quarter. And now over to Vern.\n\nVern Yu -- Executive Vice President, Liquids Pipelines\n\n Thanks, Al. Good morning, everyone. Before we review this quarter's results, I'd like to follow up on Al's comments regarding the uniquely challenging macroeconomic conditions we are facing. The financial markets have been very volatile.\n\nInflation is driving interest rates up and weakening the Canadian dollar. In addition, society's climate change ambitions and the war in Ukraine are driving up energy prices creating challenges for households globally. Enbridge is well positioned to navigate through these risks, and I'll cover that off now. Typically, with the recession, you see demand destruction.\n\nBut we are continuing to see strong energy fundamentals with tight supply and demand dynamics. Supply wise, we expect further tightening given the recent OPEC+ production cuts, the ban on Russian oil and the wind down of SPR releases. Demand-wise, Enbridge has connected the best demand coal markets for both crude oil and natural gas. In addition, we have strong commercial underpinning that drive predictable cash flow and global energy security concerns are leading to more investment opportunities for us.\n\nInflation has resulted in the most significant monetary policy tightening that we've seen in the last 40 years, but we're still in pretty good shape here. We have built in inflation protection for about 80% of our EBITDA, with total escalators or the ability to capture higher costs increases through rate filings. On interest rates, we have about 90% of our debt in fixed rates. Rising rates are a headwind to our floating rate debt program, we're actively managing this risk with our hedging program.\n\nThe energy transition is creating a lot of exciting growth opportunities and the recently announced IRA is providing a real catalyst for low-carbon investments. Finally, we're well positioned to leverage our existing infrastructure to transport more North American energy to global markets. Let's go and review the quarter. Our third quarter results were up notably over 2021, with strong operational performance across all of our businesses.\n\nWe're now seeing the full benefit of the $14 billion of capital that we brought into service last year. In liquids, the mainline moved over 2.9 million barrels today. This is in line with our expectations following the completion of customer maintenance in Q2. Gas transmission utilization was high, and we continue to see growth driven from our 2021 capital investments, such as the $1.4 billion expansion of our BC Pipeline system.\n\nIn addition, we've begun recognizing higher rates on Texas Eastern, where there are unopposed settlement that we reached with our shippers this quarter. The utility continues to perform as expected, with summer gas used lower than normal due to seasonality. Strong wind resources and high energy prices in Europe where we have a small amount of spot exposure have made a positive contribution to our renewables business. Energy Services remains below expectations due to narrow basis differentials and price backwardation.\n\nFinally, financing costs were up as a result of rising interest rates. Benchmark rates have risen almost 4% beginning of this year. Q3 was a very strong quarter, and the business continues to operate well. Let's move to our full year financial outlook.\n\nAs we head into the end of the year, we expect to come in at the top half of our EBITDA guidance range and just above the midpoint of the DCF per share guidance. Our systems have been highly utilized in 2022. And we expect that to continue for the rest of the year. Mainline volumes strengthened in Q3, and we are on track to meet our 2022 volume outlook of 2.95 million barrels per day.\n\nTiming of maintenance capital should provide up to $100 million tailwind this year, and we expect that work to slide into next year. The utility is tracking the guidance and the renewables business is tracking to slightly above guidance on good wind resource and higher European power prices. From a financial perspective, the US dollar strengthening has provided a slight tailwind. In contrast, we expect Energy Services to remain a headwind for the balance of the year.\n\nAdditionally, we're seeing some pressure from higher power costs driven by both higher throughputs and higher power prices. We'll provide our 2023 guidance later this month, but I'll provide a brief overview on how that's shaping up now. We expect the business to remain strong in 2023. And the capital we've deployed this year will drive EBITDA growth.\n\nWe'll benefit from customer growth and higher rates of utility. Our capital program within gas transmission will add EBITDA. We'll have the full year benefit from the recent Texas Eastern rate settlement. Energy Services should improve in 2023 as we'll see a number of our legacy contracts expire.\n\nA stronger US dollar is providing an opportunity for us to layer on additional hedges for 2023 and beyond at very attractive rates. And as we've already mentioned, we'll continue to see higher power prices next year. Interest rate-wise, about 10% of our debt next year is subject to floating rates. Given today's inflationary environment, it makes sense for us to be at the lower end of our 10% to 25% floating rate debt range, and we're actively managing our residual floating rate exposure.\n\nInterest rates have been a headwind this year, and we expect that to continue next year. We're also expecting some pressure in cash taxes from legislative changes in Canada and the US At this point, we're waiting on clarity on certain aspects of the alternative minimum tax in the US, so we don't want to go into a great detail on that now. Our initial estimate is mainly that it's purely a timing issue as we expect to pay less cash taxes in the future as a result of this. And overall, we expect this to be NPV-neutral over the decade.\n\nOverall, we believe we're in a strong position to navigate a challenging macroeconomic environment and deliver continued growth to our shareholders. Let's move over to the secured capital program. Today, our secured capital program sits at just over $17 billion. We have almost $4 billion of capital entering service this year, which will drive cash flow growth in 2023 and beyond.\n\nAs Al mentioned in his remarks, we've grown our backlog by adding a number of exciting new projects to the secured bucket this quarter. These new capital requirements fit well within our self-funded model where we live within our means. Going forward, under our self-funded model, we still have ample investment capacity available for further organic growth, tuck-in M&A, debt repayment or even share buyback. Now, let me remind you how we approach capital allocation.\n\nOur priority share remained unchanged. A strong balance sheet is still job 1. We have continued to recycle capital into new opportunities to the tune of $11 billion since 2018 and $2.8 billion since the middle of last year. We continue to return capital to shareholders in the form of the dividend where we paid $7 billion this year.\n\nAnd we've used $150 million of our approved $1.5 billion in our share buyback program. We have sanctioned $8 billion in new organic growth capital this year, and our secured capital program now sits at $17 billion. All of these opportunities have met our low-risk business model, exceeded our risk-adjusted hurdle rates, have a strong strategic fit and align with our emission reduction goals. As always, we'll continue to evaluate opportunities to selectively recycle capital and further bolster our financial flexibility.\n\nSo I'm now going to finish up with our quarterly ESG update. Our newly created Regional Oil Sands partnership is a win-win transaction for both us and the 23 indigenous communities along that right-of-way. Our relationships with the indigenous communities along all of our right-of-ways is something that I've always been very proud of, and we plan to continue to be a leader in indigenous engagement, indigenous economic participation and reconciliation. We released our Indigenous Reconciliation Action Plan in September, which articulates and tracks our progress against our commitments.\n\nThe plan built on our success we've had working with communities through the construction of Line 3 and the East West Tie Line, which entered into service earlier this year. We're also very excited about the Wagman carbon hub, and we see further opportunities to develop our economic partnership across our entire asset footprint. Our commitment to the community is where we live and where we work will always be a huge part of our success. With that, I'll turn it back to Al.\n\nAl Monaco -- President and Chief Executive Officer\n\n OK. Thanks, Vern. As you know, I'll be retiring as CEO at the end of the year, and Greg Ebel will take over leadership on Jan 1. Just for background, I informed the board at the beginning of this year that I may wish to retire from Enbridge, which kicked off a 9-month long process to identify the next CEO.\n\nSince the announcement, Greg and I, and the management team, have implemented a transition plan to ensure a smooth changeover and maintain momentum and consistency, and that's well underway. As usual, we'll deliver 2023 guidance at the end of November and speak to our dividend, so the timing there is normal. And then, we'll follow that with Enbridge Day on March 1 and March 2, so after the Q4 results, where Greg and the team will lay out management's priorities and outlook. Please save the date and join in either Toronto or New York.\n\nOver my time at Enbridge, the last 11 as CEO, I'm proud of what our team has accomplished, but I believe the best is yet to come. I'd be honored to lead Enbridge, and I'm confident that Greg and the management team will continue to grow the business well into the future. Before we open to questions, let me close, like we always do with a few takeaways. The business is well positioned, and our low-risk model provides resilience in all market cycles.\n\nThis downturn is a great example of that as we continue to deliver strong results and execute our strategies. The last several months have seen significant volatility in global energy markets. I think it's really proven that our 2-pronged strategy to focus on both conventional and low-carbon investments is the right one. As Vern noted, our capital allocation priorities are unchanged and we'll continue to be disciplined, putting capital to work.\n\nWith that, I thank you for continuing support of our management team, Enbridge and especially our highly skilled professional and very dedicated workforce. We'll now open the call to questions, and the team is here with me to respond.\n\nOperator\n\n[Operator instructions] Your first question is from the line of Robert Kwan with RBC Capital Markets. Your line is open.\n\nRobert Kwan -- RBC Capital Markets -- Analyst\n\nHey, good morning. If I can start on the mainline. So at a minimum, we've seen an increase in the cost of capital parameters, which on a flow-through basis is putting upward pressure on tolls. So I'm just wondering, if it's that or just, say, something else, what's transpired since August that's made you more optimistic of the settlement? And have there been any changes in the provision that you've been booking on the mainline?\n\nAl Monaco -- President and Chief Executive Officer\n\nOK. I'll start, and then Colin can add. No changes in the provision, Robert. Of course, we look at that provision continually, and our assessment is that no change is required at this time.\n\nI think maybe rather than phrasing it as what's happened since August, I think we continue to talk, and we've got our pencils up rather than down, which is good. Both sides, I think, are working hard. And I think it's really just a matter of finding a deal that works for both, if that can happen, which, as you heard us say before, we prefer to continue on and try to arrange a deal here rather than file cost of service. But that option is always there.\n\nAnd as you point out, there's been an inflationary environment since around August, I guess. And so, that's going to be incorporated into our filing if we need it. And so, that's sort of where we are. I don't know, Colin, if you want to add anything to that.\n\nColin Gruending -- Executive Vice President and Chief Financial Officer\n\nI think you got -- you mostly got it, Al. I would amplify, Robert, your point about -- the extra time here, and maybe it's not extra relative to historic, negotiation processes often take about a year. But the extra time here, I think, will allow us to capture, if you like, this -- the various rate-making parameters inherent in an inflationary environment, right, interest rates, taxes, indexation mechanisms, etc. So I think -- what I would say is either path will contain an appropriate modern set of rate-making primers that reflect the macro environment.\n\nRobert Kwan -- RBC Capital Markets -- Analyst\n\nOK. That's great. And if I can ask and finish on a capital allocation-related question. You've got your excess cash flow, and it's allowed you to pick up some assets here and there, modest-sized deals to bolt-on that you feel is accretive to the strategy and your growth.\n\nSo just if you think market weakness is to persist and valuations moderate, do you see that being a greater part of the capital allocation strategy? And then how do you frame that against another thing, just if we have market weakness, notwithstanding the market today? If you've got a lower share price, how do you frame that against buyback to be more attractive?\n\nAl Monaco -- President and Chief Executive Officer\n\nDo you want to comment, Vern?\n\nVern Yu -- Executive Vice President, Liquids Pipelines\n\nSure. Thanks, Robert. I think as we've talked about, job one is always the balance sheet. So having the flexibility to use the balance sheet for opportunistic opportunities is always the most important thing for us.\n\nAnd you rightly pointed out that we have been opportunistic in looking at certain assets that where we can acquire them at very attractive valuations. I think what we're seeing though is that there is very strong fundamentals for energy, very strong fundamentals, particularly for exports in North American energy to global markets. So we're weighing some good opportunities and some very strong organic growth opportunities against M&A transactions on smaller scale. And of course, against being able to pay down some debt in the higher interest rate environment.\n\nSo from my perspective, we see some great opportunities across the whole capital allocation spectrum and it's great to have the optionality to pick and choose which one of these levers we pull.\n\nAl Monaco -- President and Chief Executive Officer\n\nRobert, with a strong balance sheet to start with, like Vern said, and you add on the fact that free cash flow is going to be growing. And don't forget, we've obviously demonstrated some opportunities to recycle capital. So you've got a lot of cash to work with there. And then, finding and deciding between those opportunities that Vern is talking about.\n\nI mean, obviously, we've executed on some very large organic opportunities that are right down the middle of the fairway, as I said. The M&A opportunities in the tuck-in variety is certainly an opportunity. And then, as you're pointing out, too, there's other options around share buybacks, particularly at this valuation could make more sense. So I think it's a whole sector of opportunity here, given that we have a very good outlook for free cash and ability to recycle more capital.\n\nRobert Kwan -- RBC Capital Markets -- Analyst\n\nThat's great. Appreciate the answers. And Al, all the best in retirement.\n\nAl Monaco -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question is from the line of Jeremy Tonet with J.P. Morgan. Your line is open.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nHi. Good morning. I just want to start with the CEO transition. Congratulations on retirement there after a successful career at Enbridge here.\n\nAnd -- just wondering how we should think about the process at this point. Should we expect any changes in strategy that you can point to at this point or might be open for revisiting? We're just curious because we didn't see, I guess, some of the forward DCF CAGR language in the slides that we did in the past. And so, just curious if we should be looking for any changes on future strategy.\n\nAl Monaco -- President and Chief Executive Officer\n\nWell. OK. Maybe on the last part first, and then I'll get back to strategy. So first of all, there's no change in our outlook.\n\nWe feel very comfortable with the growth in the business going forward. As we mentioned, and Vern covered as well, '23 guidance is coming end of this month. And then, of course, we'll talk about the medium-term outlook at Enbridge Day when Greg has a chance to lay out the priorities, and the management team will be there as well, of course. But the business is performing very well.\n\nIn fact, as Vern pointed out, next year looks very strong, and we don't expect any real change in our outlook. As to strategy, one thing to keep in mind here is that Greg has been part of the board and chairing for, I guess, five or six years now. And at Enbridge, just to take you back a little bit, we engage heavily with our board on strategy. In fact, we update that every quarter and talk about where the business is going and what we're seeing fundamentally.\n\nSo we're essentially very close with the board in terms of where we're headed as a company and our strategy and our priorities. So I don't expect any changes, and I certainly heard him say that through the transition process several times when engaging with management and our employees here. So that's how we see it, Jeremy.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nGot it. That's great to hear. Just one to talk about, I guess, the crude oil export strategy, if I could, it seems like Gray Oak feeds into that quite nicely and built-in synergies on the platform. And I noticed in the slides, I see spot on the slides as well.\n\nIs that an area where you'd have interest? Or do you see other organic or inorganic opportunities to expand on the crude oil export side of Gulf Coast?\n\nAl Monaco -- President and Chief Executive Officer\n\nOK. Well, maybe Colin can speak to that, he's close to it.\n\nColin Gruending -- Executive Vice President and Chief Financial Officer\n\nJeremy, thanks for the question. Yes, we're pretty excited about this strategy. We've been talking about it for a few years. I think it's really starting to come into focus now.\n\nOur puzzle is -- the pieces are coming together. We've been patient, as you know. And there's twp elements to it. One is on the heavy strategy, which will be probably down Flanagan Seaway into the Gulf region, and that's where spot could come into play.\n\nAnd we're still looking to develop our EHOT Houston terminal there to provide a terminus for heavy Canadian and maybe a liquid pricing point, which would be nice. And then, on the light oil side, which is more so a straight shot south from the Permian, right? And we've got twp interests in twp flagship pipelines in Gray Oak and now with great interest, Cactus II. So that's all integrated. It's all light oil.\n\nWe've got a value chain there. We're going to be operated at Gray Oak in Q2 of next year. We're excited about both strategies. We've been big bulls on export.\n\nAl mentioned some record loadings at Ingleside here lately. So there's a number of ways to win on the export strategy.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nGot it. That's helpful. We'll leave it there. Thanks.\n\nOperator\n\nYour next question is from the line of Rob Hope with Scotiabank. Your line is open.\n\nRob Hope -- Scotiabank -- Analyst\n\nGood morning, everyone. Maybe a follow-up question on the LNG strategy. We've seen you talk about the numerous opportunities to feed the US Gulf Coast. But when you think about getting supplies down into that region, how does your network potentially -- how could your network potentially be expanded for Texas Eastern to further move additional volume out of the Gulf Coast? And what constraints do you see there?\n\nAl Monaco -- President and Chief Executive Officer\n\nOK. Well, I'll start off, Robert. And I think Cynthia, if want to add on. If you just visualize Texas Eastern, which is essentially a massive header system on the Gulf Coast, which is the reason why we've been able to position so well with LNG exports.\n\nI think the reality is, sometimes people forget this gas has got to come from somewhere. And certainly, the Haynesville is increasing, and we're a natural player there, just given our position geographically, but also from a cost perspective. So a very cost-effective way to get those volumes into LNG areas further south into the Gulf. There's opportunities as well to move volumes south from the Marcellus, given our position there.\n\nAnd there's also opportunities, frankly, to move more volumes into Florida. So you've got this ideally positioned header system that's very low in cost that's ideally positioned to get supply. So this is what I was referring to in -- when I mentioned the upstream part of our strategy related to LNG. So I think that's the high tree top level.\n\nI'm sure Cynthia may want to add to something here.\n\nCynthia Hansen -- Executive Vice President and President, Gas Transmission and Midstream\n\nThanks, Rob, and thanks, Al. I would just build on what Al said by reminding everyone that we did go out and have that exploratory open season on the tech system for the Louisiana area. And we are -- we've had some great inbound interest from the customers that we're working through. So we hope to be in a position over the next couple of quarters to really come out with a project that helps support that.\n\nRob Hope -- Scotiabank -- Analyst\n\nAnd then as a follow-up question, more broadly, in the inflationary environment and one where we've seen interest rates move up, has that altered the commercial framework or how you're looking at new capital investments to ensure that risk and return are properly figured out?\n\nAl Monaco -- President and Chief Executive Officer\n\nOK. I don't know, Vern, do you want to speak to that?\n\nVern Yu -- Executive Vice President, Liquids Pipelines\n\nWell, as you see inflation and interest rates go up, obviously, our low-risk commercial model is designed to take that into account. So generally, with new investment opportunities, we look for cost recovery on pretty much everything that we are exposed to. And then, as rates go up, obviously, that impacts the underlying risk-free rate and that causes our hurdle rates to go up. So all in all, I think it just raises the bar on some of these projects we're looking at.\n\nRob Hope -- Scotiabank -- Analyst\n\nAnd I guess, finally, Al, congratulations on all that you've accomplished and all the best in the next endeavor.\n\nAl Monaco -- President and Chief Executive Officer\n\nThanks, Rob.\n\nOperator\n\nYour next question is from the line of Theresa Chen with Barclays. Your line is open.\n\nTheresa Chen -- Barclays -- Analyst\n\nMorning. Congratulations, Al, on your pending retirement and to Greg on the new role. So I wanted to ask about the utilization on mainline per your comments about good utilization through year-end and 2023. And in light of TMX coming online, how much volumes do you think could move off your system following the in-service date of that project? And how long do you think it would take to recover to full utilization as you look at your producer plans, your customers' plans on the base case? And then within this development, I guess, one wrinkle, if that, just given the large naptha cut inherent in WCS and elevated naptha inventories in Asia, which would be the natural destination for many of these barrels off of that pipe, and coupled with ongoing petchem demand weakness and looming global recession per your earlier comments, Al, wouldn't the, at least, near to medium-term natural home for a WCS barrel as TMX comes online, wouldn't that be the US Gulf Coast anyway where we have some of the most complex and flexible refining facilities, which should result in continued front utilization of mainline?\n\nAl Monaco -- President and Chief Executive Officer\n\nYes. I think you got it, Theresa, on that last point. So maybe Colin should address that one.\n\nColin Gruending -- Executive Vice President and Chief Financial Officer\n\nYes. I just want to agree with what you said, basically Theresa. So utilization right now is basically full, especially Q3, Q4 were seasonally more full or full with typically a Q2 -- yes, I think your question was more kind of year by year and further out. So we're full now.\n\nWe should be pretty much full again in '23. And then, depending on when TMX comes into service. And by the way, we are respecting public in-service dates espoused by TMX, and we're building -- we've always built our plans around that. So we're expecting it -- so if we're at 90%, 95% utilization now through '23, we expect to -- and like other -- I think all other egress competing alternatives will see a small drop probably proportionately across the board.\n\nWe'll probably lose circa 10 percentage points for a few years. And though we do see modest growth in the basin over time, and that should refill all the egress options over the ensuing few years. And for the reasons you know, I think the mainline will see a useful future targeted down to our PADD II and PADD III markets, which have that strong pull and these global relevant refineries. So generally agree with what you're saying.\n\nTheresa Chen -- Barclays -- Analyst\n\nThank you.\n\nOperator\n\nYour next question is from the line of Robert Catellier with CIBC Capital Markets. Your line is open.\n\nRobert Catellier -- CIBC World Markets -- Analyst\n\nHey, good morning, and congratulations, Al, on your retirement here and specifically for staying as active as the company has been in the last little while. And in particular, I wanted to follow up on that on the current M&A environment. We've seen a lot of activity here. So I'm curious if this has been a bulge or if you expect opportunities to continue at this rate? And where are you finding the best opportunities to fit your strategy both on the tuck-in acquisition point of view as well from a capital recycling point of view?\n\nAl Monaco -- President and Chief Executive Officer\n\nYes. Well, I think, broadly speaking, Robert, the market looks pretty good. I mean, the transactions that we've done, remind you, we've been pretty, I guess, selective in what we're looking at. We found to be reasonably well priced.\n\nIf you start back from Ingleside, and then we sort of tucked in the TGE and a couple of others here recently, Cactus, they've been done at a reasonable valuation. So I think the market is pretty reasonable at this time, and we'll pick off those opportunities as we see them, where they fit our strategy and specifically where we can build out the business. And again, TGE is a good example of, as I said earlier, an outsized impact. So we're seeing them across the businesses, Gas transmission, liquids and of course, in renewables.\n\nSo I think it's just a positive environment for that, let's call it, singles, doubles, maybe even triples, in the next two, three years. That's how we're looking at it. I don't know, Vern, do you want to add anything to that?\n\nVern Yu -- Executive Vice President, Liquids Pipelines\n\nI think you've covered it off, Al. I think having the balance sheet capacity is giving us more opportunities than we've seen in a long time. We're very happy to be in this free cash flow positive position.\n\nRobert Catellier -- CIBC World Markets -- Analyst\n\nOK. And my follow-up here has to do with the renewables. You've obviously added to the North American onshore with Tri Global. And I just wondered what your current thinking is on the value in expanding to other markets both onshore and offshore.\n\nAl Monaco -- President and Chief Executive Officer\n\nOK. Well, maybe, Matthew, you can chime in on that one, please?\n\nMatthew Akman -- Senior Vice President, Strategy and Power\n\n Sure. Robert, thanks for the question. Right now, we feel we're really well positioned across all our markets, with organic growth opportunities. As you know, you followed us closely, in the offshore in Europe, we have several gigawatts of potential development there, some underway, a bunch under construction.\n\nWe really like those markets, and we'll keep building those out. Western Europe focused long-term contracts with visible PPAs with counterparties. In North America now, we really like our position with TGE. We like the portfolio.\n\nThere's several gigawatts of optionality there that adds to what we already had there, which was over 1 gigawatt. So we'll optimize that in terms of cherry-picking the best project to do and to do in terms of timing. So we'll maximize our risk-adjusted returns there and maintain capital discipline. So we don't -- we've got tons of opportunities when you look at both markets, and we're really well positioned both in offshore Europe and in North America.\n\nSo I think we'll just build those out and maintain our discipline. We don't really see the need to enter any other markets from there right now.\n\nAl Monaco -- President and Chief Executive Officer\n\nRobert, we get invited to a lot of stuff, and we see a lot of opportunities globally. And so, as Matthew said, I think we're pretty happy with where we are in Europe, given all we have going on there. We get a lot of opportunity as well in US Northeast offshore, which as you've heard us say before, has been just too frothy and uncertain with respect to timing the cash flow on those projects. So again, we've got so much going on onshore North America and offshore Europe, but we've got a long runway here of development opportunity to keep us going for quite a while.\n\nMatthew Akman -- Senior Vice President, Strategy and Power\n\nOK. Thanks, everybody.\n\nOperator\n\nYour next question is from the line of Brian Reynolds with UBS. Your line is open.\n\nBrian Reynolds -- UBS -- Analyst\n\nGood morning, everyone. Maybe to talk about the future Liquids' expansion and just the acquisition of Tri Global, can you just talk about how you see this acquisition as complementary and maybe essential to Liquids' expansion. I'm curious if you could provide any commentary on how shippers are looking at potential tolling arrangement and how they received the deal?\n\nAl Monaco -- President and Chief Executive Officer\n\nOK. Sorry, I think you're talking about Tri Global, first part of it.\n\nBrian Reynolds -- UBS -- Analyst\n\nYes.\n\nAl Monaco -- President and Chief Executive Officer\n\nWell, yes, I think I referred to it in my remarks. We have pretty damn good capability, I would say, when it comes to commercial arrangements, construction, operation of renewables, and we built that up over a good 20 years or 20 years plus, actually. I think what we were missing is what I refer to as the front end and origination. So in this business in renewables, a lot of work is required in prospecting, identifying the right wind resources and critically figuring out how to get on the transmission grids and that involves a very significant process.\n\nSo I think that's really the fill-in that this provides for us. And I think now we legitimately have a full value chain of capability. We're excited about it actually. And as I said earlier, having this Tri Global team actually accelerates what we already have in terms of development opportunities.\n\nAs Matthew said, we've got on our own lands, certainly solar self-power. Those are all opportunities where this team now can help move that quicker, and that's the big part of it. If there was another part of your question, maybe if you could just repeat it?\n\nBrian Reynolds -- UBS -- Analyst\n\nI guess just, ultimately, how the shippers are ultimately viewing it in the greater context of potential mainline arrangement.\n\nAl Monaco -- President and Chief Executive Officer\n\nOK. So you're talking about renewables being solar self-power and how it relates to the mainline. I think that's your question.\n\nBrian Reynolds -- UBS -- Analyst\n\nYes. Yes.\n\nColin Gruending -- Executive Vice President and Chief Financial Officer\n\nBrian, it's Colin. Yes, thanks for that question. And we are mindful that we're looking to get our own emissions down, right, as part of our ESG pledges. And I think as Al mentioned, we've got about 10 self-solar projects in flight right now.\n\nMany of them will be on the liquids system. We're a major power draw in jurisdictions we operate. If we can sell power, we can free that power up for other uses, and we can also green it up. So we're prepared pretty closely with Matthew's power business to see if we can accelerate that further.\n\nIt's our intent. And it also manages the economic exposure as well. So it's kind of a twp for that way for us.\n\nAl Monaco -- President and Chief Executive Officer\n\nBrian, these days in this environment, it's not just mainline customers. I think all of our customers, whether it's upstream of us or downstream of us, they're looking for service providers that are very much focused on ESG and emissions being a big part of it. So I think in today's environment, it's almost table stakes that you have to focus on reducing emissions, whether you're in the midstream or upstream or downstream part of the value chain. So they're looking to us to make sure we're well advanced on reducing emissions, and that's going to be critical for all energy providers going forward.\n\nBrian Reynolds -- UBS -- Analyst\n\nGreat. And just as one follow-up, curious if you could just talk about how you view the ultimate ownership of DCP at this time. In your prepared remarks, you talked about the appetite for a little bit less commodity exposure. And just given the evolving NGL strategy out of Corpus, just curious if there are any opportunities within DCP's asset base that could also be exchanged for, that ultimately less commodity exposure.\n\nAl Monaco -- President and Chief Executive Officer\n\nYes. Well, to be honest, before we did the joint venture with P66, it was a pretty small component -- GP component of our business. And with this joint venture, it actually is even lower. So -- and that's why I referred to it being pretty much de minimis in terms of commodity exposure.\n\nSo I don't see the need to make any change here going forward. I think we've got pretty much where we want it. And I don't think it's a good idea to speculate on what assets might be workable into the US Gulf Coast. I think that's a good point that you raised, Brian, but nothing on the horizon immediately on that front.\n\nOperator\n\nYour next question is from the line of Ben Pham with BMO.\n\nBen Pham -- BMO Capital Markets -- Analyst\n\nOn the renewables side, with the Inflation Reduction Act, isn't the outlook in the US renewables better than the development pipeline you have in Europe?\n\nAl Monaco -- President and Chief Executive Officer\n\nWell, I don't know -- Matthew, do you want to chime in on that first?\n\nMatthew Akman -- Senior Vice President, Strategy and Power\n\nSure. No, Ben, really, it's a really good insight. We really -- we feel we've timed this one really well on the TGE with the Inflation Reduction Act coming into play and hopefully just makes those projects even more economic. So we really like the North American outlook right now.\n\nWe really like the optionality, though. And I think that's key is we're going to -- like I said before in response to a prior question, we have so much on the go now both in Western Europe and North America, we can really pick and choose the best projects. As you know, capital discipline and our risk profile are always front-centered at Enbridge. And so, having all these opportunities in this portfolio just gives us great optionality.\n\nBut yes, I think you're right. I mean, we love our developments in Europe, but right now, the US looks very attractive. And so, with this 3 gigawatts that we got with TGE combined with we had over 1 gigawatt plus of meter internally, those projects should get great tailwinds and the customer demand is fabulous right now and very buoyant. So we like North America a lot, and we like the optionality we have.\n\nAl Monaco -- President and Chief Executive Officer\n\nI think then -- maybe to add some balance to it as well. And I think Matthew pointed this out, it gives us a lot of options to choose the best projects. And we shouldn't discount Europe either. I mean, typically, they've had very strong PPA structures.\n\nThey have a very smooth process for connecting to grids, especially from onshore/offshore locations. Regulatory processes are pretty smooth as well. So anyway, it's good to have choice in twp really good markets.\n\nBen Pham -- BMO Capital Markets -- Analyst\n\nOK. Great. And then, my second question, that fall update for the  Canadian government yesterday and maybe some of that's expected, maybe some of it is. And what are your initial thoughts on implications in your Canadian business and outlook?\n\nAl Monaco -- President and Chief Executive Officer\n\nYes. At a high level, it appears that this is intended, and they would do that, close the gap to the US IRA. And I think that's important because I think it's recognized, from what I read last night, that you've got to be competitive. And I think, as I said, this will try to close the gap so that we get our share in Canada of investment dollars.\n\nI think broadly speaking, the tax credits for wind and solar support our business here in Canada. There's some references to financial insurance on carbon pricing, which I think is going to be very helpful to carbon capture proponents in Canada. And as I said earlier in my remarks, that's a big opportunity. You've got investment tax credits for hydrogen.\n\nAnd by the way, it appears that that's for both green and blue. We'll have to get more into the details there. And then, of course, there's indigenous benefits sharing on major projects. So my read of this early on is it will be attractive for business here, both in terms of Canada attracting capital, but also for us specific to our business generally.\n\nBen Pham -- BMO Capital Markets -- Analyst\n\nOK. That's excellent. And all the best through retirement, Al.\n\nAl Monaco -- President and Chief Executive Officer\n\nThanks, Ben.\n\nOperator\n\nYour next question is from the line of Linda Ezergailis with TD Securities. Your line is open.\n\nLinda Ezergailis -- TD Securities -- Analyst\n\nThank you. And I want to add my congratulations, very sincerely, Al, to you.\n\nAl Monaco -- President and Chief Executive Officer\n\nThank you.\n\nLinda Ezergailis -- TD Securities -- Analyst\n\nSo maybe you can help us understand and delineate a little bit more about the mainline process beyond the end of next year. So basically, there's twp paths that I understand will likely be taken. If you were to go down the settlement path, I assume it would be a fairly quick process, but maybe you could update us on when -- how long you think that would firm up beyond the end of this year? And then conversely, if you were to go down a path of cost of service, can you give us an update on how much extended you think that process would be? And then the second part to my question would be around risk sharing. In the past, producers valued toll certainty and Enbridge provided that, and took on that risk.\n\nBut you also earlier in your comments mentioned inflationary indices, etc. So I just wanted to comment on what potential no-fly zones, if you can, are in terms of what risks you might be less inclined to take on in this iteration, including volume risk.\n\nAl Monaco -- President and Chief Executive Officer\n\nDo you want to take that one?\n\nColin Gruending -- Executive Vice President and Chief Financial Officer\n\nSure. Thanks, Linda. So you're right to acknowledge that I think the different paths could have different regulatory follow-on time horizons, right? That's intuitive. A settlement could be shorter, could be much shorter.\n\nA full-on cost of service application would take a year or more. We -- everyone understands that, I think, is blending that into their discernment here on the whole package. I think I'll amplify the word package because I think your next part of the question kind of tried to dive into specific puts and takes. And I think it will be a package if there is a settlement.\n\nIn the past, you're right, shippers have liked toll certainty. We have accepted the risks plural, in exchange for a risk premium in the tool, right? So that's the nexus of the conversation, again, what is the appropriate premium for these risks. And again, we mentioned -- this extra time does allow us to ensure we've captured a good look at what those new macroeconomic parameters are. So I think everyone's got good visibility to make that judgment on appropriate risk premium.\n\nWe would look, again, to a toll indexation. I think Vern referenced that as a hallmark of our commercial model. We would look for that again. And it's probably a question of what that index level is.\n\nSo at the end of the day, I think we're hearing shippers like the service. They like the alignment model that Al characterized over 25 years. It trades hustle and we're aligned. So the question is just really what was the appropriate tool and the recognition of that.\n\nAl Monaco -- President and Chief Executive Officer\n\nI think the only thing I'd add, Colin. I think you mentioned volume risk, Linda. And as Colin said, we've managed that in a whole bunch of other things over the years, and we're comfortable doing that, and -- but it will come down to risk versus reward and getting an appropriate return to manage that volume risk. But embedded in that, as well as -- and I think you're pointing to it, in the past that the shippers have preferred toll certainty.\n\nAnd that's one of the big benefits of what we've provided. We started with the toll and we may escalate it depending on what the arrangement might be there. But certainly, in a cost of service, you don't have that certainty on toll and that's been one of the factors that is in the discussion.\n\nLinda Ezergailis -- TD Securities -- Analyst\n\nOK. And just as a follow-up, maybe continuing on the risk discussion. When you're allocating capital, how do you account for geographic risk, specifically geopolitical risk? I think the perception is it's going up in certain parts of the world and supply chain as well. There would be certain components in some of your energy infrastructure that might become more uncertain in terms of cost, as well as timeline.\n\nHow are you mitigating that? And how are you factoring that into your capital allocation decisions? And how often do you reassess that because it does appear to be quite dynamic?\n\nAl Monaco -- President and Chief Executive Officer\n\nYes, I think you're right. Well, Vern's finance group is pretty pedantic about cost of capital and those types of risks that you pointed out. So maybe I'll turn it over to him for that one.\n\nVern Yu -- Executive Vice President, Liquids Pipelines\n\nSo Linda, when we look at each and every individual project that we invest in, we come up with a hurdle rate for that specific project. So that hurdle rate will take into account scheduled risk and capital cost risk. So scheduled risk really gets into how long does it take you to get permits, how long do you think it's going to take you to build the project, is there going to be off position. So the uncertainty of those things get baked into the hurdle rate.\n\nSimilarly, for supply chain, that generally comes into how much capital cost risk are you going to be exposed to in building out a specific project. So again, we'll look at the very specific aspects of supply chain for an individual project when we come up with a project-specific hurdle rate. Over and above that, if we're entering a new jurisdiction that we haven't done business in before, there can be a country risk premium added on top of all these other premiums we've talked about. So hopefully, that answers your question.\n\nAl Monaco -- President and Chief Executive Officer\n\nProbably goes down to the state level, too, Vern.\n\nVern Yu -- Executive Vice President, Liquids Pipelines\n\nAbsolutely, yes.\n\nAl Monaco -- President and Chief Executive Officer\n\nYou have different regions in the US where, frankly, it's easier in some places, some way more difficult than others. So that's built into a scheduled risk premium comment.\n\nLinda Ezergailis -- TD Securities -- Analyst\n\nAnd just as a housekeeping question, would you be able to provide the actual day you're going to be giving 2023 guidance later this month and the scope of what would be included in that beyond maybe DCF per share guidance and EBITDA guidance, given that your investor day has been pushed to March?\n\nAl Monaco -- President and Chief Executive Officer\n\nVern, do you want to speak to that?\n\nVern Yu -- Executive Vice President, Liquids Pipelines\n\nOur plan right now is to provide that on November 30. We'll provide a full suite of information on 2023 at that time.\n\nAl Monaco -- President and Chief Executive Officer\n\nYes, I think we'll do the usual notice, Linda, maybe a one or twp weeks out just to make sure that we've got that day right. I think Vern's got it. Yes. So that's the process.\n\nLinda Ezergailis -- TD Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nYour final question comes from the line of Praneeth Satish with Wells Fargo. Your line is open.\n\nPraneeth Satish -- Wells Fargo Securities -- Analyst\n\nGood morning. On T-South, I think on the last earnings call, you had pegged the cost of the project or at least the initial cost to be $2.5 billion, but now it looks like it's $3.6 billion. So I guess, what's changed? And maybe can you help us understand the cadence of capex spending. Which years would see the most of the capex to be deployed? And then finally, are there any stretches of the project that could be challenging either from a construction standpoint or permitting? And that's all I have.\n\nAl Monaco -- President and Chief Executive Officer\n\nOK. Thank you. Maybe we'll turn this one over to Cynthia.\n\nCynthia Hansen -- Executive Vice President and President, Gas Transmission and Midstream\n\nThanks, Al, and thanks, Praneeth. So with the T-South project, our original cost estimate -- we've had an opportunity now to build in some of the inflationary pressures that we've seen recently. So that is more of a comprehensive estimate associated with that. And that's still an order of magnitude estimate we're going to be going through and doing the detailed design work and environmental impact to estimate type work in the outreach.\n\nBut that will be done and we'll have a more detailed estimate kind of in Q1 of 2024 to support the 2024 filing. As I look at the other parts of your question, what's going to be critically important for us as we go forward with the permitting and the approval of this process through the regulatory is to make sure we engage with the indigenous communities. So that's a critical part of our ongoing outreach and how we're going to be successful in moving that project forward, as well as looking at our mission impact. So focusing in on electric drive.\n\nWhen it comes to the actual right-of-away, again, this is an area that we're familiar with, it's not a greenfield project -- so that's a good start, but we will do that detailed assessment. From the overall permitting process this fits into kind of the middle category. So we're very familiar with the activities. Having said that, though, as I mentioned, it's going to be critically important that we engage with all our stakeholders to put us in a really good position to move forward through that permitting and approval process.\n\nVern Yu -- Executive Vice President, Liquids Pipelines\n\nMaybe I can just follow on to answer about the capital -- the capital -- the large bulk of the capital does not get spent until you get through the regulatory process. And Cynthia mentioned that the regulatory process is scheduled to start in 2024. So if you envision a 2028 in service date, the bulk of the capital is getting spent in that '27, '28-time frame.\n\nPraneeth Satish -- Wells Fargo Securities -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThis concludes the question-and-answer session. I will now turn the call over to Rebecca Morley for final remarks.\n\nRebecca Morley -- Director, Investor Relations\n\nGreat. Thank you, and we appreciate your ongoing interest in Enbridge. As always, our investor relations team is available following the call for any additional questions you may have. And once again, thank you, and have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRebecca Morley -- Director, Investor Relations\n\nAl Monaco -- President and Chief Executive Officer\n\nVern Yu -- Executive Vice President, Liquids Pipelines\n\nRobert Kwan -- RBC Capital Markets -- Analyst\n\nColin Gruending -- Executive Vice President and Chief Financial Officer\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nRob Hope -- Scotiabank -- Analyst\n\nCynthia Hansen -- Executive Vice President and President, Gas Transmission and Midstream\n\nTheresa Chen -- Barclays -- Analyst\n\nRobert Catellier -- CIBC World Markets -- Analyst\n\nMatthew Akman -- Senior Vice President, Strategy and Power\n\nBrian Reynolds -- UBS -- Analyst\n\nBen Pham -- BMO Capital Markets -- Analyst\n\nLinda Ezergailis -- TD Securities -- Analyst\n\nPraneeth Satish -- Wells Fargo Securities -- Analyst\n\nMore ENB analysis\n\nAll earnings call transcripts"
}