{
  "companyName": "JinkoSolar Holding Company",
  "companyTicker": "JKS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/26/jinkosolar-holding-company-jks-q2-2022-earnings-ca/",
  "content": "JinkoSolar Holding Company (JKS -0.37%)\nQ2 2022 Earnings Call\nAug 26, 2022, 8:00 a.m. ET\n\nOperator\n\nHello, ladies and gentlemen. Thank you for standing by for JinkoSolar Holding Company Limited's second quarter 2022 earnings conference call. [Operator instructions] I would like to now turn the meeting over to your host for today's call, Ms. Stella Wang, JinkoSolar's investor relations.\n\nPlease proceed, Stella. Over to you.\n\nStella Wang -- Investor Relations\n\nThank you, operator, and to everyone for joining us today for JinkoSolar's second quarter 2022 earnings conference call. The company's results were released earlier today and available on the company's IR website at www.jinkosolar.com, as well as on Newswire services. We have also provided a supplemental presentation for today's earnings call, which can also be found on the IR website. On the call today from JinkoSolar are Mr.\n\nLi Xiande, chairman of the board of directors and chief executive officer of JinkoSolar Holding Company Limited; Mr. Gener Miao, chief marketing officer of JinkoSolar Company Limited; Mr. Pan Li, chief financial officer of JinkoSolar Holding Company Limited; and Mr. Charlie Cao, chief financial officer of JinkoSolar Company Limited.\n\nMr. Li will discuss JinkoSolar's business operations and the company highlights, followed by Mr. Miao, who will talk about the sales and marketing, and then Mr. Pan Li, who will go through the financials.\n\nThey will all be available to answer your questions during Q&A session that follows. Please note that today's discussion will contain forward-looking statements made under the Safe Harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements involve inherent risks and uncertainties.\n\nAs such, our future results may be materially different from the views expressed today. Further information regarding this and other risks is included in JinkoSolar's public filings with the Securities and Exchange Commission. JinkoSolar does not assume any obligation to update any forward-looking statements, except as required under the applicable law. It is now my pleasure to introduce Mr.\n\nLi Xiande, chairman and CEO of JinkoSolar Holding. Mr. Li will speak in Mandarin, and I will translate his comments into English. Please go ahead, Mr.\n\nLi.\n\nLi Xiande -- Chief Executive Officer, JinkoSolar Holding Company Limited\n\n[Foreign language]\n\nStella Wang -- Investor Relations\n\nWe had a good quarter and a difficult market condition. Total solar shipments in the second quarter were 10.5 gigawatts. Module shipments in the second quarter were 10.2 gigawatts, up roughly 27% sequentially. And the total revenues were $2.81 billion, up 27.6% sequentially.\n\nThese upstream costs continue to rise. We actively work to control internal costs through technical advancement and process improvement, which partially affects the impact of higher upstream costs on our profitability. Gross margin was 14.7%, relatively flat compared with the first quarter, excluding the impact of the convertible senior notes and the share-based compensation expenses. Adjusted net income in the second quarter was $55 million, improving sequentially.\n\nLi Xiande -- Chief Executive Officer, JinkoSolar Holding Company Limited\n\n[Foreign language]\n\nStella Wang -- Investor Relations\n\nFollowed by accelerated energy condition in several countries in the business, as well as the energy supply crisis caused by the Russia-Ukraine conflict. demand for solar products has exploded in many markets. According to the statistics and analysis of China's customs export data by China's exports of modules in the first half of the year reached 78.7 gigawatts, a year-over-year increase of 2%. Exports to Europe reached a total of 42.4 gigawatts of PV modules, a year-over-year increase of 137%.\n\nDemand in the China market was also strong. During the first half, solar PV installations in China reached 30.9 gigawatts, a year-over-year increase of 136%. Given this better-than-expected growth in demand, released polysilicon production came up short and it was further aggravated by annual maintenance problems and power rationing and anti-pandemic restrictions in certain regions of China. As a result, polysilicon prices rose to continuously and reached a recent high of RMB 310 per kilogram.\n\nPV module price is higher. Regular discussions with other clients indicated that some of them found higher module prices to negatively affect project yields, and, as a result, some demand slowed down. We believe polysilicon prices will continue to increase and reach their peak in the third quarter. Then as polysilicon production ramps up in the fourth quarter, polysilicon price increase is expected to moderate, driving a recovery of downstream demand.\n\nLi Xiande -- Chief Executive Officer, JinkoSolar Holding Company Limited\n\n[Foreign language]\n\nStella Wang -- Investor Relations\n\nRecently, the local government of Sichuan province has imposed a provincewide power rationing measures and the production capacity of our manufacturing facilities in Sichuan province has been temporarily affected. We are currently unable to evaluate the extent to which our business operations. And the financial performance for full year 2022 and will be affected by the power rationing measures in Sichuan province, as it remains uncertain how long the power rationing measures will persist and when our Sichuan manufacturing facilities can resume full production. We are actively monitoring the situation and have implemented various measures to minimize the adverse impact from the power rationing of our business operations and financial performance, including, but not limited to having our other manufacturing facilities assume more production and actively communicating with the local government about the power supply related matters.\n\nWe also flexibly adjusted the module production volumes and assume as planned in order to meet delivery to our clients.\n\nLi Xiande -- Chief Executive Officer, JinkoSolar Holding Company Limited\n\n[Foreign language]\n\nStella Wang -- Investor Relations\n\nIn the second quarter, the proportion of large-size capacity increased sequentially, further improving our integrated structure. The 16 gigawatt of TOPCon cell capacity that started the production at the beginning of the year reached the full production at the end of the second quarter with a mass production efficiency of over 24.8% and yield rate integrated costs in line with our expectation. We recently started the production of an additional 8 gigawatts of N-type cell capacity in Hefei and commenced construction of another production project with 11 gigawatt of N-type cell capacity in Haining. The increase in our in-house high-efficiency capacity ratio will continuously improve our competitiveness.\n\nLi Xiande -- Chief Executive Officer, JinkoSolar Holding Company Limited\n\n[Foreign language]\n\nStella Wang -- Investor Relations\n\nAs an industry pioneer embracing the TOPCon technology, we have recently achieved key technology breakthroughs in the currently selected TOPCon technology roles that we believe we have created an entry barrier related to core process and technology with industry-leading mass production efficiency, yield rate, and cost levels. We believe TOPCon is currently the high-efficiency cell with the greatest value for commercialization, mass production in the post-pandemic era, and has relatively ample development opportunities. We will continue to maintain our leading position through technical iterations.\n\nLi Xiande -- Chief Executive Officer, JinkoSolar Holding Company Limited\n\n[Foreign language]\n\nStella Wang -- Investor Relations\n\nOur N-type modules continue to be well received by global customers. And so far, we have high visibility in our order books. Compared with P-type products, N-type products command a competitive premium as a result of improved technical parameters and additional power generation gain. We are confident that we will complete our four-year N-type shipment goal.\n\nIn addition, considering the release of new capacity in 2023 and the increase in marketing penetration, we expect the proportion of N-type shipments to further increase.\n\nLi Xiande -- Chief Executive Officer, JinkoSolar Holding Company Limited\n\n[Foreign language]\n\nStella Wang -- Investor Relations\n\nIn view of the current and expected supply chain and market conditions, we have adjusted our capacity expansion phase for wafer cell and modules for the rest of this year. And as a result, we are currently expecting the annual production capacity for mono wafer cells and modules to reach 55 and 65 gigawatts, respectively, by the end of 2022.\n\nLi Xiande -- Chief Executive Officer, JinkoSolar Holding Company Limited\n\n[Foreign language]\n\nStella Wang -- Investor Relations\n\nBefore turning over to Gener, I would like to go over our guidance for the first quarter of 2022. We expected that the total shipments to be in the range of 9 to 10 gigawatts for the third quarter this year, and we reiterate our total shipments of 35 to 40 gigawatts for the full year of 2022.\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nThank you, Mr. Li. Total solar shipment in the second quarter was 10.5 gigawatts, of which over 97% were module shipments, up nearly 27% quarter over quarter and double year over year. Since the Russia-Ukraine conflict, global energy transformation accelerated and showed strong growth momentum, especially in Europe.\n\nIn the second quarter, our shipments to European market grew steadily and the proportion of shipments in Europe remains high, reaching 25% to 30% range. In China, the distributed generation business demonstrated strong momentum. Newly added installation in China in the first half grew remarkably by 136% year over year. In second quarter, our shipment to the Chinese market grew exceptionally year over year, more than doubling sequentially.\n\nOur shipments to emerging markets also registered stable sequential growth. While demand was strong, we also noticed some potential challenges. For example, demand in some European countries for the second half is expected to slow down sequentially as a result of the problems affecting the logistics chain. And some of our domestic clients are waiting to fully assess the impact from continuous rise in supply chain costs.\n\nIn addition, the execution of some large-scale utility projects might be delayed to 2023 due to issues with grid connection and power transmission. Taking these challenges into considerations, we have been adjusting our geographic mix, as well as our sales and contract timing strategy while keeping in close communication with our clients. So far, both our contract signing and execution are maintained at satisfactory levels. In U.S.\n\nmarket, tightened supply chain tracking through dampened demand in the short term. In the long run, with the President Biden's executive order to spur clean energy manufacturing and recently passed Inflation Reduction Act of 2022, which includes booked $369 billion in climate and energy-related funding, we expect the demand to remain positive. In order to improve our resilience to risk, we will continue to closely monitor market and the quality developments, adjust the production and the marketing strategies accordingly, and to further strengthen our overseas supply chain and global sales and marketing network. The proportion of large-sized product shipments gradually increased to nearly 90% in the second quarter, further optimizing our product structure.\n\nShipments through distribution channels, where growth in demand is strong, accounted for nearly 50% with shipments through distribution channels in European and some APAC market accounting for more than half. Tiger Neo modules continue to be created by clients all over the world with high order book visibility and pricing premiums in line with our expectations. We estimate that Tiger Neo shipments for the full year of 2022 will reach approximately 10 gigawatts. The transformation to clean energy is now irresistible trend and with the need for energy security.\n\nGlobal PV demand is expected to achieve rapid growth this year. Nevertheless, some markets are experiencing temporary pain this year due to the invisible short-term volatility that comes with rapid growth. As the market continues to adjust, we remain optimistic about global PV development. We do provide a various view of materials and versions based on Tiger Neo to cater to diversified client needs in different countries.\n\nWe expected to achieve shipment growth that exceed market growth, further increasing our competitiveness in global markets. With that, I will turn the call over to Pan.\n\nPan Li -- Chief Financial Officer, JinkoSolar Holding Company Limited\n\nThank you, Gener. For second quarter of 2022, both solar module shipments and total revenue increased significantly year over year. Nevertheless, gross margin relatively flat with first quarter and decreased year over year due primarily to an increase in the material cost of solar modules. Due to significant increase in the company's stock price in the second quarter, we recognized a loss from a change in fair value of the convertible senior notes of $80 million in the second quarter.\n\nExcluding the impact of the convertible senior notes and the share-based compensation expenses, adjusted net income attributable to the JinkoSolar Holding Company Limited ordinary shareholders in the second quarter was $55 million, improving sequentially. Let me go into more details. Total revenue was 2.8 billion, up about 27% sequentially and a significant increase of 137% year over year. Gross margin was 14.7% compared with 15.1% in the first quarter and 17.1% in the second quarter last year.\n\nTotal operating expenses were 457 million, up 40% sequentially. The increases were mainly attribute to an increase in shipping costs for solar modules, an increase in disposal and impairment loss on property, plant and equipment, and an increase in share-based compensation expenses Total operating expenses accounted for about 16% of total revenues in the second quarter, up from about 15% in the first quarter and a 13% in the second quarter last year. EBITDA was 186 million compared with 126 million in the first quarter this year. Excluding the impact from a change in fair value of the notes and the share-based compensation expenses, adjusted net income attributed to the JinkoSolar Holding Company Limited ordinary shareholders was 55 million, improving sequentially.\n\nDue to the continued appreciation of the U.S. dollar against RMB, we realized a net foreign exchange gain, including change in fair value of foreign exchange derivatives of approximately 34 million in the second quarter this year compared with a net gain of 12 million in the first quarter. Moving on to the balance sheet. At the end of the second quarter, the company had cash and cash equivalents of 2.15 billion, slightly down from 2.66 billion at the end of the first quarter and up from 1 billion at the end of the second quarter last year.\n\nAR turnover days were 69 days in the second quarter compared with 66 days in the first quarter. Inventory turnover days were 104 days in the second quarter compared with 117 days in the first quarter. Total debt was 3.8 billion at the end of the second quarter, down sequentially from 4.3 billion. Net debt was 1.7 billion compared with 1.6 billion at the end of the first quarter this year.\n\nThis concludes our prepared remarks. We're now happy to take your questions. Operator, please proceed.\n\nOperator\n\n[Operator instructions] First question of the day, we have from [Inaudible] from ROTH Capital Partners. Your line is unmuted, [Inaudible]. Please go ahead.\n\nUnknown speaker\n\nHi. This is [Inaudible] on behalf of Phil Shen. Thanks for taking the question. I was wondering if we could get some more color on the Sichuan power shutoff.\n\nSpecifically, you know, from what we gathered, JinkoSolar is about 18 gigawatts of new capacity in Sichuan? It's about like half of your total capacity. So, given that you've shut down for about 10 days, would that be an estimated, you know, 5% of Q3 in grid capacity offline so far?\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nYes. So, thinking about the impact from the, you know, China's Sichuan province power cuts, the impact, right, for the full production from our factories in -- for the wafers. And it's a, you know, progressive impact, right, for Sichuan province. And we reach it because of the, I think, the drought induced, you know, power cuts.\n\nAnd it did have, I think the 10 days to 15 days impact for our wafer capacities and which is roughly 25 gigawatts and 25 gigawatts for annual capacities. So, converting into monthly production, it's 2 gigawatts a month. So, we estimate a rough -- its around 700 megawatts impact and -- for the wafer. But we have global -- let's say, we have full factories, you know, for the wafer in different ratings, including three factories in China.\n\nSo, we try to maximize the production from other wafer capacities other -- that ratings. So, from management teams, you know, we try to minimize the impact and they did have some impact from, you know, the production side and our cost side in the third quarter.\n\nUnknown speaker\n\nOK. So, thanks for the detail. So, I believe the impact to cost side, would there be any impact from purchase of external wafers in order to meet your, you know, shipment guidance? If so, what --\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nNo, no, no. Yeah. I think no, because if you look at our guidance, which is 9 gigawatts to 10 gigawatts, we have taken into, you know, this situation [Inaudible] so, it's -- we don't have plan to purchase the wafer from third party.\n\nUnknown speaker\n\nOK. Great. Thanks for the -- so, you know, would it be safe to say the leading indicator for recovery in Sichuan is the recovery of water levels? You guys are mostly driven by hydro power, right?\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nYeah. It's already in recovery stage, you know, standards. And it's getting better, you know, particularly in addition to this. And our capacity are expected to -- basically full capacity in the next -- I think in the next couple of days.\n\nUnknown speaker\n\nOK. That's really great to hear. I had another set of questions on -- you previously said earlier in the call, you touched on it, tightened supply chain tracing. Does that have to do with the U.S.\n\nLPA? And if it is related to the U.S. LPA, could you please help us quantify the number of gigawatts that you've maybe shifted from shipping into the U.S. toward you or other countries?\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nYes, I think we are preparing this traceability topic not only for U.S. market, but also for other markets as well. We have, in recent months or quarters, we have intensively getting inquiry from different countries or different customer about traceability topics, right? That's why we believe in the future, we have to prepare the capability of increasing traceability of the product, including the polysilicon and some other key material as a necessary step for the future, right? I think that includes the U.S. market.\n\nUnknown speaker\n\nAnd so for the --\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nFor U.S. market itself -- yeah. For U.S. market itself, we are still working hard together with the CBP and our consultant to make truce, right? So currently, the customer clearance is not that smooth as usual, especially under U.S.\n\nLPA. So, we have to work on lots of details to make it happen, and we are working hard on it.\n\nUnknown speaker\n\nOK. Thanks for the detail there. Could I just get a little bit more on the -- you know, you said it's not smooth, right? So, for -- what type of modules is it not smooth? Is it German poly, Southeast Asian modules; China poly, Southeast Asian modules; U.S. poly, Southeast Asian modules; or all? Just a little bit more color there.\n\nThank you.\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nWell, let's say, based on what our knowledge, based on our knowledge and awareness, I don't see there's any difference between China polysilicon or European polysilicon or American polysilicon, right? So, we have to provide the right documents to meet the requirement from CBP officials.\n\nUnknown speaker\n\nOK. One last question before I hand it off. What's the utilization rate of your Southeast Asian facilities? Can you keep it at around the same level by shifting module shipments to other countries? And what's the rough, like, mix, please? Thank you.\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nYes. Obviously, so we have to look into the different part across the whole value chain, right? For the upper stream wise like the wafer and cell, I think, is in short term supply tracing a full off demand, not only for U.S. market, but also for the other market, right? And then for the module side, you know, since it's targeting the U.S. market, we have to be very careful to -- about, you know, the traceabilities.\n\nWe won't ship or we won't manufacture the product if we cannot guarantee the traceability is in the right place.\n\nUnknown speaker\n\nOK. Thank you. I'll pass it on.\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nThank you.\n\nOperator\n\n[Operator instructions] Next, we have Alan from Jefferies. Your line is unmuted, Alan. Please go ahead.\n\nUnknown speaker\n\nThanks, operator. And thanks a lot, management, for taking my question. So, my first question is about -- what is the expectation or the current situation of the TOPCon products? And what is the premium out there like? Is it $0.01 or $0.015 compared to PERC?\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nYeah. Firstly, about the product itself, I think the anti-TOPCon product that we call Tiger Neo is highly competitive compared with the standard PERC product, right? I think it's based on the 72 pieces product, Tiger Neo is almost 20-watt peak higher than the standard product, which -- and also together, you know, the features like the degradation and, you know, etc. So, definitely, it's generating extra benefit for the customer end and bring additional value to the project side or to the installations of solar system. That's why we can -- getting the premium from the market.\n\nCurrently, the premium we are expecting or we are looking at is around $0.01 to $0.015 range. Sometimes it's up to $0.02, but let's say, at the broader range, it will be $0.01 to $0.015\n\nUnknown speaker\n\nThank you. And so, it's actually pretty decent. So, when it comes to production cost perspective, so have we already achieved cost parity versus PERC in terms of the production cost of TOPCon? And what is the current yield like right now?\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nYou know, in the second quarter, the TOPCon capacity is in the right-hand stage and our R&D and the operational team is working very hard to improve, you know, the output efficiencies, as well as the cost. And right now, you know, the integrated cost of the TOPCon, the modules, compared to the traditional P-type modules, it's -- you know, the difference is within the range of lower than RMB 0.05. And our plan is we continue to improve the cost structures, and we target by the end of this year, and the TOPCon integrated cost could reach, you know, the same level of the PERC by the end of this year.\n\nUnknown speaker\n\nUnderstood. So, that will -- in fact, it means that you will have same cost and then you will make an extra $0.01 or $0.015 of net profit on top of PERC, right?\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nYes, you're right. We did -- when we see the TOPCon modules, we did have the premium and -- Gener mentioned. And the cost structure, we need to work continuously and to improve, and it's good on the track. And we expect and we -- our target is by the end of this year, it could, you know, reached the same level.\n\nUnknown speaker\n\nUnderstood. Thanks a lot. And just another question is about -- what is your view on one of the major polysilicon player who is entering into the module space? So, this is one of the hottest topics in the market as of recent. So, what is your view on this?\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nAnd -- I think, you know, there is a very big market. Even for the existing market, the market goes straight in, you know, the next decades. And -- if you look at the top five companies, module companies, the market share now is 60%, 65%. There are a lot of Tier 2, 3 companies.\n\nThey are taking 30%, 35% market share. And if you look at the growth rate, we expect, you know, 30% in the next couple of years. So, we believe this is a lot of, you know, potential room for the, let's say, the big players to penetrate the markets. And -- but the module, you know, the business is not purely in production side, and we built this business for over 10 years.\n\nIt is more likely in a global manufacturing and global marketing, sales, bankability and strong sales relationship with customers. So, we -- what we are doing is we continue to solidify our, you know, strong branding, marketing and product, you know, competitiveness.\n\nUnknown speaker\n\nSo -- also would like to know the management has also mentioned the Inflation Reduction Act in the U.S. And one of the key incentives in the act is of course the subsidies of the installation. But also there are product subsidies on building factories in the U.S. So, would like to know, is JinkoSolar considering further expansion into U.S.\n\nin terms of factories?\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nYes. I think it's a very hot topic. And the IRA, you know, the -- to be effective in the U.S. starting from next year, and it did provide a lot of subsidies, you know, from manufacturing in the U.S.\n\nAnd we already had a very small module capacity, it's 400 megawatts, which will be ineligible for the incentive. And for the expansion topic, and we are, you know, in the early stage to further evaluations, but I think it's -- we expect there will be more local U.S.-based, you know, local capacities in the next couple of years, given the, you know, strong support from the IRA policies. But we at the early stage of evaluations.\n\nUnknown speaker\n\nUnderstood. So, I think my last question is, what is the -- your outlook on the solar installation in this year and next year, and probably in 2022 through 2025, the global installation and a brief breakdown, if you may provide. Thanks.\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nYes. We estimate roughly, you know, 250 gigawatts installations this year. And next year, given the bottleneck of the polysilicon will be gone. And we expect a strong growth in China, U.S.\n\nas well as the European market. And we estimate roughly 25% to 30%, you know, the market growth next year.\n\nUnknown speaker\n\nUnderstood. So, that's more than 300 gigawatts? Probably we are talking about like 300 to 320 gigawatts, right?\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nYes. In general, I think we are optimistic now because, you know, the polysilicon is at a very high level. It did delayed particularly the utility scale projects in China and as well as in other regions. So, given the next year, you know, more volume, you know, input, and we expect the installation will be at a very, you know, quick speed.\n\nUnknown speaker\n\nSo, wish the company will benefit from the strong demand and also the upside of the TOPCon product. And I will leave it sort of the other investors. Thank you, management.\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nThank you.\n\nOperator\n\n[Operator instructions] We have question from Rajiv Chaudhri from Sunsara Capital. Your line is unmuted, Rajiv. Please go ahead.\n\nRajiv Chaudhri -- Sunsara Capital -- Analyst\n\nGood morning. Thank you for taking my questions. Actually, I have a few questions. The first one is just on the model.\n\nAs I look at the unit shipments that you had in the second quarter and compare them to the unit shipments in the first quarter, it seems that your average price realized per module went down quarter to quarter and quite significantly by, you know, almost -- by about $0.01 or maybe more than $0.01. Can you explain why that would be happening in an environment where prices in general were stable or up?\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nSorry, are you asking about the Q1, Q2 ASP changes?\n\nRajiv Chaudhri -- Sunsara Capital -- Analyst\n\nYes.\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nI think according to our data, the Q1, Q2 price are pretty close for -- Q2 average prices has a very tiny job compared with Q1 ASPs, mainly it's because in some historical orders, we have to execute it, which is lower than market price. The rest are pretty normal. So, in our view, we believe the quarterly ASP are staying in market condition. There's no big changes on that.\n\nRajiv Chaudhri -- Sunsara Capital -- Analyst\n\nYeah. I mean, just based on the revenues and the unit shipments, it looked like the average selling price in the first quarter was around $0.284 and the second quarter was around $0.272. So, that looks like a pretty decent drop. But you are saying that some of it was because of legacy shipments at a lower price? Are those legacy items behind you or these -- sorry.\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nNo. Let me correct you on that, sorry. The revenues including many factors, right, not only module revenues. Even module revenues are the majority of it, but we're still including other parts included in the revenue.\n\nThat's why you cannot, you know, use the revenue to divide the shipment to have ASPs. That's not accurate enough.\n\nRajiv Chaudhri -- Sunsara Capital -- Analyst\n\nI see. OK --\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nI think an additional factor is maybe the RMB depreciation and you use the U.S. dollar, there's maybe, you know, reflecting. As well as second quarter, China is taking more portion. But again, the ASP is stable and the second quarter is slightly, you know, a little bit down, very small.\n\nRajiv Chaudhri -- Sunsara Capital -- Analyst\n\nYes. OK. So, yeah, I understand. So, along the same lines, can you give us some feeling for what the ASP will be in the third quarter and the fourth quarter for the year?\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nYeah. For the third quarter, the ASP will be as stable as the first quarter and second quarter. So, the fourth quarter, even it has not been fully closed, we are still closely monitoring the market situation, but we are expecting the market's prices as well forward. Hope that answered --\n\nRajiv Chaudhri -- Sunsara Capital -- Analyst\n\nSorry, you're expecting fourth -- you are expecting fourth quarter to be flat also?\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nYeah, more or less flat. But since it's still far away from the fourth quarter, so there are still, you know, unknown factors to fact in, so we don't have any disclosure on the fourth quarter ASPs. But my personal expectation will be the first quarter -- the fourth quarter ASP, the market price will be more or less stable compared with Q3.\n\nRajiv Chaudhri -- Sunsara Capital -- Analyst\n\nAnd another question is on the stock-based compensation. Can you quantify roughly how much it is per quarter, and what it was in the second quarter? And how is it expected to trend in the third and fourth quarters?\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nOK. The stock-based compensation, you know, we -- the company granted in the first quarter, second quarter. It's a one-off item. And given, you know, in the future, we expect the amount will be very small.\n\nAnd for the second quarter, the exact amount, you can calculate because, you know, we have disclosed adjusted net income, which is 55 million. And, you know, including the convertible bonds and stock-based compensation, I think it's roughly, I think, 20 million or 25 million, but you can do the calculations there.\n\nRajiv Chaudhri -- Sunsara Capital -- Analyst\n\nSo, 20 million to 25 million. And you're saying that in the third and fourth quarter, that number is going to go down?\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nYeah, very small. It will be very small, you know, in the future. Yeah.\n\nRajiv Chaudhri -- Sunsara Capital -- Analyst\n\nOK. So, the shipment costs on a per-watt basis, did the shipment costs go up quarter to quarter, on a per-watt basis?\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nYes, shipment cost is at high level. I think it's roughly $0.015 to $0.02 per watt. And quarter-by-quarter, it's relatively stable. And the shipping costs will maintain, I think, we're at a high level.\n\nBut given, you know, more mix to China in the second half of the year, blended will be lower in the second quarter. Next year, we expect given the global economies were weak, and we expect next year, the ships logistics will be -- you know, costs will be, you know, in a downward trend.\n\nRajiv Chaudhri -- Sunsara Capital -- Analyst\n\nOK. And can you also tell us what the depreciation and capex numbers were for the second quarter? And what your expectation is for the full year now?\n\nPan Li -- Chief Financial Officer, JinkoSolar Holding Company Limited\n\nFirst, for capex. In the first half of this year, it's reached $1.4 billion. And -- for the full year, we forecast it still remains on $3 billion.\n\nRajiv Chaudhri -- Sunsara Capital -- Analyst\n\nAnd depreciation?\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nDepreciation, I think its roughly basis -- it's roughly -- I think per-watt basis is RMB 0.05 to RMB 0.06 per watt. So, it's roughly RMB 55 million to RMB 60 million for second quarter.\n\nRajiv Chaudhri -- Sunsara Capital -- Analyst\n\nOK. And the final question is on the polysilicon business. As you know, the polysilicon gross margins are right now in excess of 70%. And even though they will come down as prices come down, the expectation is that the polysilicon business will maintain gross margins that are maybe, you know, 35% or 40%, much higher than the module business.\n\nCanadian Solar has expressed an intention to get into the polysilicon business. Do you have any thoughts about getting into the polysilicon business yourselves?\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nPolysilicon, it's a bottleneck in recent two years. But next year, for sure, you know, the supplies were sufficient, and it's, you know, in a downward trend. So, from the polysilicon side, we don't believe it's a bottleneck for our business in the future. And we are -- you know, our supply chain team is doing a partnership, you know, with a leader of the polysilicon producers and design the long-term polysilicon supply contract.\n\nAnd as well as we, you know, invest as minority investor, we invest to companies as minority interest and to strengthen our relationship for the top polysilicon supplier. So, we don't have a plan, let's say, to do the business of the polysilicon so far.\n\nRajiv Chaudhri -- Sunsara Capital -- Analyst\n\nOK. And my final question is about storage. Can you give us an update on what you are doing in the storage space? What sort of orders and revenues and feedback you are looking from the marketplace?\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nWell, the storage business is still in the early stage. We believe it's not the right time to talk about it. And we will share our strategy and our plan once it is ready, right? Thank you for your attention.\n\nRajiv Chaudhri -- Sunsara Capital -- Analyst\n\nThank you. Thank you very much.\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nThank you.\n\nOperator\n\nNext, we have Gary Zhou from Credit Suisse. Your line is unmuted.\n\nGary Zhou -- Credit Suisse -- Analyst\n\nHello, management. Thanks for taking my questions. So, I have three questions. So, firstly, on the module shipment.\n\nSo, just wondering if the company has a breakdown for our module shipment for this year for the China market and overseas market. And if possible, can we talk a little bit on the unit profit difference between China domestic sales versus overseas module sales? And second question is on the TOPCon. So, I noticed that some of our competitors, they also have some TOPCon capacity coming out in the first quarter this year. So, just wondering, do we believe this $0.01 to $0.015 ASP premium can be maintained going forward? And also comparing our TOPCon product versus peers, do we -- so can management talk about what's the advantage of our product? And lastly, a quick question on the polysilicon side.\n\nSo, basically, the near-term polysilicon price is still high, probably supported by the Sichuan supply disruption. But just wondering if the management has a view at what time or which months can we kind of start to see the polysilicon price to drop? Thank you.\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nThank you. There's a lot of questions. I will try to cover it as much as I can, right? So, firstly, about geographic mix. For the full year, we are expecting the China and the Europe market are the two largest contributors to JinkoSolar's shipment for the full year, and which accounted around 25% to 30%.\n\nAnd followed by the emerging markets, which will be contributing -- we are expecting contributing between 20% to 25%. And the APAC market will be around to 15% to 20% and the rest were followed by other markets, including North America and the Middle East, Africa, etc., right? And the second question about the Tiger Neo N-type product premium. But the way we are pricing the product is to sharing the benefit together with the customer, it's not a competitive -- competition for, let's say, gaining negotiation, it's really a benefit-sharing model, which means that approximately, as I say, around -- by using Tiger Neo N-type products that the customers project can get additional benefit of around $0.025 to $0.03 per watt. So, then we are establishing the business model to share the benefit by approximately half to half with the customer.\n\nThat's why we believe such business model is sustainable and consistent, and it doesn't have to go to the price competitions. Even with more and more peers joining the TopCon group, we believe join today, you know, leading the technology innovation and, you know, create a bigger market for solar industry. We don't have to go to the price competitions. And compared with our followers or our peers talk about technology, we believe at some point near in this area.\n\nOur cost structure and our efficiency, including our product performance will continue to have a competitive advantage or at least a leading position in this market. And we are still confident on that. Lastly, about the polysilicon prices, we believe in the long run, like Charlie is saying in the previous conversations, we believe the polysilicon will become -- will be debottlenecked in the next coming, let's say, quarters, and -- which will create a bigger market for solar installation in the downstream, especially for the utility project, which has been significantly delayed due to the capex problem. We are having a big hope on that.\n\nI hope that answers your question.\n\nGary Zhou -- Credit Suisse -- Analyst\n\nYes. Thank you, management. This is very helpful. And I'll pass it on.\n\nThank you.\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nThank you very much.\n\nOperator\n\nNext question is coming from Brian Lee from Goldman Sachs. Your line is unmuted.\n\nUnknown speaker\n\nHi. Thanks for taking the questions. This is Grace on for Brian. Just a quick question on the margin expectations.\n\nJust given the elevated poly pricing and also the power control in Sichuan, which may impact your utilization rate, how should we think about your gross margin in 3Q and also for the next couple of quarters? Thanks.\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nThe gross margin, we expect expanding a little bit expansion in the next quarters. And we did face the elevated price of the polysilicon, and as well as the power cuts from Sichuan province. But TOPCon module cell capacities is operating in a very good status and will contribute more portions in our revenue and the product mix, which has relatively higher gross margin perfect contribution. So, we have the confidence and the margin will be expanded, you know, in the second half year compared to the first half of the year.\n\nYeah.\n\nUnknown speaker\n\nOK. Understood. And then on your opex, your opex increased pretty significantly in 3Q. I guess that's partially due to TOPCon.\n\nI think you mentioned TOPCon will be very minimal in 3Q. So, can you talk about your opex expectation in the second half? Thanks.\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nSo, we're talking about operating expense, right? You know, operating expenses, I think, you know, given we have more shipments in the second half year and for the -- compared to first half year, we expect the operating expenses against the revenue will be slightly lower, you know, in the second half of the year.\n\nUnknown speaker\n\nOK. Thank you. I'll take the rest offline.\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nStella Wang -- Investor Relations\n\nLi Xiande -- Chief Executive Officer, JinkoSolar Holding Company Limited\n\nGener Miao -- Chief Marketing Officer, JinkoSolar Holding Company Limited\n\nPan Li -- Chief Financial Officer, JinkoSolar Holding Company Limited\n\nUnknown speaker\n\nCharlie Cao -- Chief Financial Officer, JinkoSolar Company Limited\n\nRajiv Chaudhri -- Sunsara Capital -- Analyst\n\nGary Zhou -- Credit Suisse -- Analyst\n\nMore JKS analysis\n\nAll earnings call transcripts"
}