{
  "companyName": "Compass, Inc.",
  "companyTicker": "COMP",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/compass-inc-comp-q3-2022-earnings-call-transcript/",
  "content": "Compass, Inc. (COMP 5.91%)\nQ3 2022 Earnings Call\nNov 10, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. My name is Colby and I will be your conference operator today. At this time, I would like to welcome everyone to the Compass Inc. Q3 2022 earnings conference.\n\n[Operator instructions] I will now turn the call over to Richard Simonelli, vice president of investor relations. You may begin.\n\nRichard Simonelli -- Vice President, Investor Relations\n\nThank you, operator, and good afternoon, and thank you all for joining the Compass third quarter 2022 earnings call. Joining us on today's call will be Robert Reffkin, chief executive officer; Greg Hart, our chief operating officer; and Scott Wahlers, our chief accounting officer. In discussing our company's performance, we will refer to some non-GAAP measures. You can find those reconciliation of these non-GAAP measures to the most directly comparable GAAP measures in our third quarter earnings release and the presentation posted on our investor relations website.\n\nWe will make forward-looking statements that are based on our current expectations, forecasts and assumptions and involve risks and uncertainties. These statements include our guidance for the fourth quarter and full year 2022 and comments related to our operating expenses. Our actual results may differ materially from these statements. You can find more information about risks, uncertainties and other factors that could affect our results in our most recent Annual Report on Form 10-K and Quarterly Report on Form 10-Q filed with the SEC, also available on our investor relations website.\n\nYou should not place undue reliance on any forward-looking statements. All information in this presentation is as of today's date, November 10, 2022. We expressly disclaim any obligation to update this information. With that, I'll now turn it over to Robert.\n\nRobert?\n\nRobert Reffkin -- Chief Executive Officer\n\nThank you, Rich, and thank you to everyone for joining us today for our third quarter results conference call. This has been a generationally bad year in residential real estate, one of the worst years over the past several decades. The incredible speed of the decline has been historic. Transactions have fallen significantly as soaring mortgage rates, high home prices, lack of inventory, stock market declines and high levels of uncertainty are keeping many buyers on the sidelines.\n\nThe past 12 months have been tough and the next 18 months appear that they can be tougher. Compass will be diligent and persistent. We are focused on getting to the other side. Since the second quarter this year, we have been aggressively meeting down our expenses to adapt to this rapidly deteriorating market and already achieved significant cost reductions in our technology, engineering and other operating expenses through a variety of measures, including reductions in tours.\n\nWith our heavy investment period behind us, we are operating the business more efficiently. We have achieved significant market share gains among weakening competitors. We have built an incredibly strong agent network, a highly regarded brand and the most advanced technology platform that help us recruit agents and make them more productive. We believe that the actions we have taken to date and cost reduction initiatives currently in place put us on pace to deliver our targeted non-GAAP operating expense run rate of between 1.05 and $1.15 billion exiting 2022.\n\nHowever, we are not done. We are managing the business to reduce the cost base with a very specific goal to become free cash flow positive for 2023, starting with being free cash flow positive in the second quarter of 2023. Market conditions are continuing to deteriorate. And as a result, we will be implementing additional cost reduction initiatives to get ahead of any future market declines.\n\nWe are seeing industry forecast of plus 1% to negative 23% for the full year 2023. We have been planning for a significant double-digit decline. While we do not believe the market will go down 25% next year, we are not waiting and have already begun to build a plan to account for a decline of this magnitude, and we expect this plan to be implemented in the next three months. I am very fortunate to have a lot of help with a strong management team, including Greg Hart, our chief operating officer; and Scott Wahlers, our chief accounting officer, who are joining me today.\n\nOn the operational side, Greg is leading the charge for continuing to enhance our technology platform and lowering expenses by using our software platform to standardize, automate and eventually further monetize our platform. On the financial side, Scott has been a valuable member of our finance team for four years and has done a great job, particularly as we transition to our new CFO. I am delighted to tell you about Kalani, our new CFO. Kalani brings nearly 20 years of experience, including seven years in executive roles at one of the top commercial real estate companies, Cushman & Wakefield, and 12 years in a large national corporate brand, Walgreens.\n\nIn our search for a CFO, the board and I wanted more than just a strong CFO. We wanted someone with strong business acumen who could become an integral leader on our management team and play a critical role helping set the strategic direction of the company. We wanted someone with a strong track record in business and real estate who have seen various cycles, and we got that with Kalani. He not only brings excellent financial skills to our business, but as a former CFO and COO of Cushman & Wakefield Americas.\n\nHe was instrumental in streamlining the operations of the company in driving efficiencies throughout the organization. Kalani joins us next week, and I can't wait for you to meet him. I am confident that Greg and Kalani, along with the rest of the management team will take Compass to the next level and drive profitable growth. We just reached our 10-year anniversary as a company, and I spent most of the past two months meeting with and talking to our agents all over the United States.\n\nA couple of weeks ago, we had 2,500 of our agents at our annual agent retreat in Atlanta. I am convinced that we have the best agents in the industry and that they believe in Compass as much as I do. While we believe the housing market will remain challenged during 2023, we continue to build a solid foundation so that we can fully capitalize when stability and growth return in the future. The Compass team remains dedicated to providing our agents with the best technology, workflow tools and marketing support to be successful in the market over the medium and long term.\n\nIn the meantime, we continue to be laser-focused on reducing costs so we can reach our goal to become free cash flow positive for 2023, starting with being free cash flow positive in the second quarter of 2023. I'll now turn it over to Greg.\n\nGreg Hart -- Chief Operating Officer\n\nThank you, Robert. We have built the No. 1 brokerage in the United States by sales volume with a fraction of the number of agents compared with the competition, while covering less than half of the U.S. population.\n\nIt's true that quality, not quantity, is the right strategy to building a successful brokerage business. Despite fierce economic headwinds, our core business continues to strengthen based on our ability to continue to add agents, improve our technology advantage and maintain our industry-leading principal agent retention of over 90%. In the third quarter, we continued to successfully roll out our enhanced national end-to-end workflow platform, which we believe allows our agents to be the most productive in the industry and deliver their buyers and sellers a best-in-class experience. Agents come to Compass for our great network, our culture and our technology advantage.\n\nWe believe we are extremely well positioned entering this downturn with the industry's only end-to-end technology solution, which helps attract and retain agents and, more importantly, helps them grow their business. We processed close to 55,000 transactions in the third quarter, a decline of 12% from a year ago, which compares favorably to the 21% decline in transactions for the entire residential real estate market as reported by NAR. We believe the Compass advantage is even more compelling in difficult market conditions. We're also using our technology as a tool to further lower expenses in our business.\n\nIn Q3, we launched Compass Services in our Florida region. Services makes working with Compass simple and easy for our agents with a personalized solution for agents to manage tasks, find help and get support. Supporting suite of internal tools unlock speed to resolution, increases transparency and empowers Compass support teams to provide the industry's best agent experience. We expect services to continue to be launched across regions to serve both agents and our staff, driving enhancements and services based on agents and staff feedback.\n\nAs we strive to be free cash flow positive in 2023, we have to balance the desire for top line growth with the cost associated with achieving that growth. In the near term, that means reducing costs. On the Adjacent Services side of the business, we paused all M&A in order to conserve cash and instead internally on growing the businesses we own and are operating today. From a technology perspective, we're in the process of integrating title and escrow into our technology platform in Southern California, which is one of our largest brokerage markets and one of our most successful title markets.\n\nBy integrating title and escrow directly into the technology platform, we're creating a low friction way for our agents to offer title and escrow services to an existing brokerage transaction, increasing the attach rate of adjacent services. We will update you on our progress in future quarters. To ensure we rationalize our costs in light of market conditions, we reduced the size of our growth team, which recruits new agents to Compass over the summer. These reductions took place in June and September, just as we introduced our zero incentive approach to recruiting in mid-August.\n\nThe benefit of these combined steps means that we reduced our personnel costs for our growth team while simultaneously moving to a much better economic approach to recruiting agents as we no longer use equity or cash incentives to attract agents to Compass. Our ability to do this is a reflection of the value our platform provides, our strong company culture and our industry-leading network of top agents and the recognition of the value those assets provide across the agent community, both inside and outside Compass. In Q3, we added 335 principal agents, down from 405 principal agents added in Q2 but were not concerned. In October, the first month of recruiting was zero incentives after our September reduction in force, our growth came through the more expected profit per recruited principal agent than we've ever had.\n\nIn terms of agent growth, we continue to add principal agents. In Q3, our average number of principal agents increased to 13,314, representing 15% growth year over year. We believe agents are making this decision to join because of the power of our platform, our strong brand and the support that we offer as the deciding factors as opposed to financial incentives. And we are pleased to report that we saw over 90% principal agent retention yet again in Q3 of this year.\n\nAs always, we continue to assess our cost structure to match the market conditions we're facing, and we are keeping all options open. For example, as part of our overall operating expense reduction, we signed a contract with Genpact, a leading BPO provider that will enable us to tap into a global pool of lower-cost talent. We are committed to driving our non-GAAP operating expenses well below the low end of our range of $1.05 billion in 2023. I will now turn it over to Scott Wahlers.\n\nScott Wahlers -- Chief Accounting Officer\n\nThanks, Greg, and hello to everyone joining us on the call today. I'm going to review our third quarter financial results in more detail, and then I'll provide an update on our guidance expectations for the fourth quarter. But before I do that, I wanted to also share my enthusiasm for Kalani joining us as CFO. I've had the opportunity to get to know him during the recruiting process, and I'm confident that he will be a strong addition to our senior management team and a great leader to our talented finance organization when he officially joins us next week.\n\nTurning to our financial results. Third quarter revenue was $1.49 billion, coming in at the high end of our revenue guidance range of $1.4 billion to $1.5 billion. This compares to $1.74 billion of revenue in the prior year period, representing a 14% reduction year over year. Gross transaction value was $57.3 billion in the third quarter, a decline of 17% from a year ago, reflecting the lower transactions that Greg referred to, as well as a decrease in average selling price of about 5%.\n\nOur non-GAAP commissions expense as a percentage of revenue increased by approximately 20 basis points from Q3 of last year to 80.7%. Consistent with what we discussed on our call in August, the year-over-year increase was driven primarily by the reduced participation in the 2022 agent equity program relative to 2021. Excluding the impact of the reduced program participation, we saw a 65 basis point improvement year over year in the core business. Page 17 of the Q3 investor deck includes additional details on the agent equity programs impact on the commission line.\n\nOur adjusted EBITDA for the third quarter was a loss of $42 million, which represented a $30 million improvement versus the midpoint of the guidance range we provided in August. About a third of this improvement was due to the revenue coming in at the high end of our Q3 guidance range and the other two thirds was attributable to a lower level of operating expenses as we reduced expenses more quickly than originally planned. Our total non-GAAP operating expenses, excluding commissions, were $328 million for the third quarter. As we talked about previously, many of our noncommission-based operating expenses are somewhat fixed in nature and have historically increased sequentially from quarter-to-quarter as opposed to varying in line with revenue.\n\nHowever, due to our cost reduction initiatives, including our reductions in force during Q2 and Q3, the $328 million of opex for the third quarter reflects a $38 million reduction from Q2 of this year and was in line with the opex level from Q3 a year ago. Our GAAP net loss for the third quarter was $154 million compared to $100 million in the same period a year ago. Included in the GAAP net loss for the quarter are noncash charges, which included $50 million of stock-based compensation expense and $21 million of depreciation and amortization expense. Also, included in GAAP net loss this quarter was $29 million in restructuring costs related to our cost saving actions, primarily related to the reduction in force we announced in September, as well as a $10.5 million of expense related to the settlement of a litigation matter.\n\nConsistent with prior quarters included in the press release issued today is a schedule that reconciles GAAP net loss to adjusted EBITDA. We have $355 million of cash and cash equivalents on our balance sheet at the end of September. Free cash flow during the quarter was negative $69 million, which was down over the prior year due to the higher adjusted EBITDA loss, as well as approximately $18 million of severance payments related to our reductions in force and the Modus exit that we announced last quarter. Now, turning to our financial guidance.\n\nFor Q4 of this year, we expect revenue of $1.15 billion to $1.3 billion, which is a reduction to the implied Q4 guidance we provided in August. Reflecting the pressure on the real estate market, driven by continued increases in mortgage rates and volatility in the equity markets. In particular, since our August call 90 days ago, mortgage rates have risen an additional 1.5 to 2 percentage points to over 7%. When combined with our actual results through September, this Q4 revenue outlook translates to full year revenue in the $6.05 billion to $6.2 billion range compared to the previously stated guidance range that we gave in August of $6.15 billion to $6.45 billion.\n\nOur adjusted EBITDA expectations for Q4 are a loss of $50 million to $80 million. This translates into an adjusted EBITDA loss for the full year of $185 million to $215 million, which is within the range of the full year adjusted EBITDA loss guidance we provided in August, reflecting the favorable impact that our cost reductions have had to partially offset the continued weakness we're seeing on the revenue line. Despite the market challenges we've seen in the second half of 2022 and the expectation for continued market challenges into 2023, the entire management team remains committed to managing the operating expenses of this business through the current challenging macroeconomic environment and delivering on our commitment to build and manage a profitable business in the future. With that, let me turn the call back to the operator to start the Q&A portion of the call.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Matthew Bouley from Barclays. Your line is open.\n\nMatthew Bouley -- Barclays -- Analyst\n\nHey, good evening, everyone. Thanks for taking the questions. I wanted to touch on the cost reductions. I know you held the guide to exit 2022 at a $1.05 billion to $1.15 billion range in terms of opex.\n\nAnd I think I heard you say -- I think Greg said that your intention was to come in lower than that in 2023, and please correct me if I misheard you. But if you could kind of speak to what you're contemplating there? Is this sort of temporary actions? What's the kind of potential range of outcomes for the additional cost reductions?\n\nGreg Hart -- Chief Operating Officer\n\nYes, the vast majority of actions are permanent nontemporary on that point. What we shared is that we see interesting forecasts between plus 1% to negative 23% for 2023, and that we don't see -- we don't expect the market to be down 25% next year, but we've already begun to build a plan to account for that decline and magnitude at that level. And then, that will be implemented over the course of the next three months. And so, you're looking for more specificity, but we believe that with the numbers that we shared that you can get to what you're looking for.\n\nMatthew Bouley -- Barclays -- Analyst\n\nGot it. OK. No, that's helpful there, Robert. Second one, just zooming into the commission splits, it looks like if I'm doing the math right, that commission splits came down a bit, so in your favor, sequentially.\n\nThere's an argument that in this type of housing market that the sort of share of activity by top producing sort of higher split agents tends to be even more pronounced in the favor of those agents. So, I mean, are you expecting to see something like that in your own business? Or should we expect the commission splits to kind of continue to go in your favor here?\n\nGreg Hart -- Chief Operating Officer\n\nYes. So, there is a sentiment that in down markets, the best agents keep the business and the worst agents leave the business. And I think that showed us up to be true over several cycles. And so, I do expect a lot of lower-producing agents to leave the business.\n\nThat said, at Compass, we focus on top 50% agents, we always have and have continued to. And so, I don't think the mix shift in our agent population won't change as much. I think they'll continue to gain market share across the business from agents that are leaving at other companies.\n\nMatthew Bouley -- Barclays -- Analyst\n\nGot it. All right. Well, thanks, Robert. Good luck, everyone.\n\nRobert Reffkin -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Michael Ng from Goldman Sachs. Your line is open.\n\nMichael Ng -- Goldman Sachs -- Analyst\n\nHey, good afternoon. Thank you very much for the question. I just wanted to follow up on the prior line of questioning, maybe in a slightly different way. It's encouraging to hear about the goal to get to free cash flow positive in 2023.\n\nIt sounds like it might be some mixture of additional cost savings. So, does that also imply positive EBITDA? Or are there some working capital benefits that might be associated with what sounds like a slight deemphasis on some of the adjacent services stuff? Maybe some more color there would be helpful perhaps like a non-GAAP opex number that you might be targeting as a quarterly run rate?\n\nRobert Reffkin -- Chief Executive Officer\n\nLet me start, and then I'll let Scott add to it. Yes, we're not giving formal guidance for next year. But like I mentioned before, I think that we're -- with the numbers that we provide, you're able to run your models and I'm comfortable you'll be able to get to what you need. But we're not providing formal guidance for next year this time.\n\nBut Scott, please add to that, whatever you'd like.\n\nScott Wahlers -- Chief Accounting Officer\n\nYes. I would just add, and again, reiterating, we're not providing guidance for next year, but free cash flow and EBITDA do tend to move in sync with each other to a certain degree. But the primary goal for the business is free cash flow positive, period, and that's what we're focused on over EBITDA.\n\nMichael Ng -- Goldman Sachs -- Analyst\n\nAll right. Thanks, guys.\n\nOperator\n\nYour next question comes from the line of Bernie McTernan from Needham & Co. Your line is open.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nGreat. Thank you for taking the question. Maybe to start, just the 15% growth in agents in the third quarter, is that a good run rate to think about going forward? Or should we expect that deceleration to continue?\n\nRobert Reffkin -- Chief Executive Officer\n\nYes, in terms of the 15% year-over-year growth, a couple of things to keep in mind. If you go back a year ago, there were two aspects of our agent growth that we purposely paused from a cost perspective. One is, we were still expanding into new markets in Q3 a year ago, and we were also doing M&A brokerages where we thought it made sense for us. From a cost perspective, given the environment that we're in now, we paused both of those activities.\n\nAnd so, those are headwinds on a year-over-year basis from an agent perspective. We continue, however, to recruit agents, as we always have with our strategic growth managers, our agent recruiting team. We believe that has moved to zero incentive, recruiting is off to a good start. As I mentioned during the call, we had a very strong October.\n\nWe started that effort in the middle of August. And it's still early days, but we are positive on that.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nGot it. And then, is there any way to break out any color in terms of what you're seeing in the West -- you gave kind of like a really wide range of possible outcomes for the broader real estate market. Just trying to see if there's any geographical diversification within that?\n\nRobert Reffkin -- Chief Executive Officer\n\nYes. What we're seeing is more weakness in California. We're starting to see more weakness in certain parts of Florida. It's not a one-size-fits-all, but I think a general growth on the markets that had the fastest price increases are seeing the most pain at this time.\n\nBut I mean, we all know what happened today. Mortgage rates went down 60 basis points today, one of the most dramatic single-day declines in the history of mortgage rates. And so, that -- I would expect that this will spur a lot of demand. Obviously, it's not baked into the things that we were talking about today.\n\nBut this is basically a free -- a great calling card for every agent to call their buyers that are on the sidelines and say, this is a great time to lock in a great rate. And so, that's what's happening at this moment.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nGot it. And then, just one more, if I may. Just to get some clarity on the new cost-cutting initiatives, is that locked and loaded? Like if you saw interest rates continue to fall, and it looks like the housing market wasn't going to be as bad for '23. Would you still go forward with those cost cut -- those updated cost-cutting plans or would you pivot the business?\n\nRobert Reffkin -- Chief Executive Officer\n\nIf you're referencing my point that we are -- we do not believe the market will go down 25% next year. And that, however, we're beginning to build a plan to account for a decline of that magnitude and it will be implemented over the next three months. That plan will be implemented regardless of what we see over the course of the interim three months, because we believe that's right thing for the business.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nUnderstood. Thank you very much.\n\nOperator\n\nYour next question comes from the line of Justin Ages from Berenberg. Your line is open.\n\nJustin Ages -- Berenberg Capital Markets -- Analyst\n\nHi. Thanks for taking the questions. First, on the agent growth recruitment, as you have made the decision to not expand into new markets, is there any thought given to the fact that if you continue to grow agents that agents might be competing with each other and you're going to see some headwinds to efforts there?\n\nRobert Reffkin -- Chief Executive Officer\n\nNo, that's not something that has created an impact on Compass in the past. We're in a number of markets where we have upwards of 20%, 30% market share. And the reality is, agents compete with their counterpart agents just as much as if they're in the same company or at a different company. And so, it hasn't -- that hasn't been something that has driven the financial impact of the company or that we're concerned to buy if we continue to get more agents within the same market.\n\nJustin Ages -- Berenberg Capital Markets -- Analyst\n\nOK. And then, on the Compass platform itself, has the headwinds at the housing market been facing set there to an increase in agent usage of the Compass platform? Or is it kind of stayed steady there? Just trying to get a sense of whether the tools that you're providing are working or you need more or even less or something along those lines?\n\nRobert Reffkin -- Chief Executive Officer\n\nYes. The platform continues to see very strong usage from our agents. In many ways, the platform in a down market can help an agent in different ways than in an upmarket, help them generate new business, help them reach back out to past clients using our CRM, using our action plans, etc. And so, we believe that the benefit of the platform is the fact that it provides a single end-to-end integrated way for agents to run and grow their business.\n\nAnd with the rollout of the final pieces of that over the course of the end of the summer, we remain very bullish on that and we're seeing really strong usage from our agents even as the market has started to soften.\n\nJustin Ages -- Berenberg Capital Markets -- Analyst\n\nAll right. That's helpful. Thanks for the color.\n\nOperator\n\n[Operator instructions] There are no further questions at this time. I will now turn the call back over to Robert Reffkin, chief executive officer, for closing remarks.\n\nRobert Reffkin -- Chief Executive Officer\n\nYes. I just want to say thank you to all of our investors for being with us on this journey. It's a very choppy time in the real estate market, and we look forward to continuing to work together. Thank you for everything, and we'll see at the next earnings call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRichard Simonelli -- Vice President, Investor Relations\n\nRobert Reffkin -- Chief Executive Officer\n\nGreg Hart -- Chief Operating Officer\n\nScott Wahlers -- Chief Accounting Officer\n\nMatthew Bouley -- Barclays -- Analyst\n\nMichael Ng -- Goldman Sachs -- Analyst\n\nBernie McTernan -- Needham and Company -- Analyst\n\nJustin Ages -- Berenberg Capital Markets -- Analyst\n\nMore COMP analysis\n\nAll earnings call transcripts"
}