{
  "companyName": "Allbirds, Inc.",
  "companyTicker": "BIRD",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/allbirds-inc-bird-q2-2022-earnings-call-transcript/",
  "content": "Allbirds, Inc. (BIRD 2.11%)\nQ2 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to the Allbirds second quarter 2022 conference call. [Operator instructions] Now, I would like to turn the call over to Katina Metzidakis, vice president of investor relations and business development at Allbirds. Please, go ahead.\n\nKatina Metzidakis -- Vice President of Investor Relations and Business Development\n\nGood afternoon, everyone, and thank you for joining us. With me on the call today are Joey Zwillinger and Tim Brown, Allbirds' co-founders and co-CEOs; and Mike Bufano, Allbirds' chief financial officer. Before we start, I'd like to remind you that we will make certain statements today that are forward-looking within the meaning of the federal securities laws, including statements about our financial outlook 2022 and medium-term guidance targets, impact and duration of external headwinds, our simplification initiatives, and other matters referenced in our earnings release issued today. These forward-looking statements involve a number of risks and uncertainties that could cause actual results to differ materially.\n\nPlease also note that these forward-looking statements reflect our opinions only as of the date of this call, and we undertake no obligation to revise any statements to reflect changes that occur after this call. Please refer to our SEC filings, including our quarterly report on Form 10-Q for the quarter ended March 31, 2022, for a more detailed description of the risk factors that may affect our results. Also during this call, we will discuss non-GAAP financial measures that adjust our GAAP results to eliminate the impact of certain items. These non-GAAP items should be used in addition to, and not as a substitute for, any GAAP results.\n\nYou will find additional information regarding these non-GAAP financial measures and a reconciliation of these non-GAAP measures to their most directly comparable GAAP measures to the extent reasonably available in today's earnings release. Now I'll turn the call over to Joey to begin the formal remarks.\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nGood afternoon, everyone. Thanks for joining the call today, and a warm welcome to Katina. We're thrilled that you've joined the flock. I'm pleased that we delivered solid financial results during the second quarter, in line with our top-line guidance and ahead of our EBITDA guidance.\n\nNet revenue grew 15% year over year or 18%, excluding FX headwinds, and was driven by strength of our U.S. business, which grew a solid 21% year over year. Our adjusted EBITDA loss was $9.2 million. Importantly, Allbirds surpassed $1 billion in lifetime net revenue this quarter, which is an incredible achievement for our brand founded in 2015.\n\nIn what continues to be a tough macroeconomic backdrop, we are proud of our growth compared to the category and believe we continue to take share as our products and value proposition continue to resonate. As per product, Q2 also saw the highly successful launch of our first high-performance running shoe, the Flyer. We've made incredible strides in our foray into the performance footwear category, with the Dasher, Trail and Flyer franchises together now comprising 24% of total sales. We believe that now, perhaps more than ever, given the record heat waves occurring around the globe, our relentless focus and authentic leadership in the sustainable footwear category truly sets us apart and will allow us to win with consumers for years to come.\n\nStepping back, I'd like to make a few comments about how we currently see the external environment and how that is informing our view of the second half. Since our May earnings call, persistently high inflation has started to take its toll on consumers. Across our industry, elevated inventory and promotional levels have begun to impact digital and retail traffic trends. Our customer tends to have higher-than-average income and hence there was a lag on the impact of inflation, but this trend became notable in the U.S.\n\nbeginning in the back half of June. One of the greatest advantages of our business model is that our sophisticated data platform and our direct relationship with our customer allows for rapid visibility into changes in demand signals. As a result, we are likely seeing this slowdown before many others in our industry and therefore, have been able to pivot sooner. In our international markets, FX headwinds have intensified since May.\n\nIn China, while COVID restrictions have eased they are persistent and translating to lower consumer spending now. And sentiment in Europe, continues to be negatively impacted by the ripple effects from the Ukraine crisis. As it pertains to our 2022 guidance target, we are taking a conservative view of demand in the second half and proactively managing our business with the assumption, that these headwinds will continue through the remainder of 2022. We anticipate that the most significant impact of this change, since our last call, will come from the U.S.\n\nIn response to this backdrop and current business trends, we have taken a series of actions to set ourselves up, to continue delivering strong top-line growth while keeping us on our path toward our profitability targets. These actions are intended to have positive impacts, across gross and adjusted EBITDA margins and to tighten inventory to more efficiently generate cash. I'll expand on these to give additional color. First, we are investing in various elements of our supply chain to reduce both cost of goods and our carbon footprint.\n\nThis includes forming new relationships in our manufacturing base, upgrading to more automated distribution centers, and moving to a dedicated returns processing provider in the U.S. Second, we are streamlining our organizational structure and reducing SG&A. In addition to slowing the pace of new hires, which we began doing early in Q2, we made the difficult but prudent decision to reduce global corporate headcount, by approximately 8%. These reductions in part free us up to shift resources to continue to invest in areas that are critical for long-term demand growth, including product, sourcing, and brand marketing.\n\nOverall, we believe these simplification initiatives will optimize our cost structure, enabling us to drive substantial adjusted EBITDA improvement next year. In addition, because of the high-quality nature of our inventory, we feel comfortable taking a leaner approach to our inventory management by tightening the open to buy over the next few quarters, increasing turns and focusing on improved free cash flow generation. Now, I'd like to move on to provide update on three growth pillars. These pillars remain unchanged and are where we will focus efforts in this dynamic market.\n\nAs a reminder, these pillars are expanding and energizing our product portfolio, growing our store fleet, and scaling our international business. Within product, we will further enhance our emphasis on footwear products and innovation to expand our offering across lifestyle and performance footwear. The highlight from the second quarter was our successful Tree Flyer launch and its unique midsole technology, SwiftFoam. Tim will talk through what's on deck in the second half of the year, why we're excited about our recent materials innovation, and how these enable a robust, long-term pipeline.\n\nMoving to our second growth pillar, stores. We remain pleased with the performance of our U.S. store fleet. Our stores are not only the best expression of the Allbirds brand, but are a fantastic customer acquisition tool, all while delivering strong four-wall economics.\n\nMoreover, as we grow our store footprint, we continue to expand our base of valuable omnichannel customers who spend around 1.5 times more, than single-channel repeat customers and now comprise approximately 15% of our repeat customer base. During the quarter, our U.S. store sales increased nearly 120% year over year. We opened seven stores in Q2, bringing us to a total of 46 as of June 30.\n\nTo highlight a few. In the U.S., we opened in Fashion Island in Newport Beach in early June, which is our first store in Orange County and seventh in Southern California and it has exceeded our expectations. As we build stores in the region, such as Southern California, we see meaningful gains in awareness, drive strong store economics across the region, while substantially lifting overall commerce across channels. We also launched our first ever store in Canada in Vancouver and opened a second in Toronto just a few days ago.\n\nAnd finally I'd be remiss if I did not mention our Shanghai-based China team for their incredible execution while on lockdown managing to launch our fifth store in the city of Hangzhou, which demonstrated our ability to generate high sales productivity and a low capex build-out format. Moving on to our third growth pillar, scaling our international business. Based on our early investments in Europe and Asia we continue to view the opportunity in our international business as at least as large as the one in the U.S. We remain steadfast in our conviction that our international expansion will prove to be an early mover advantage allowing us to define what a sustainable footwear and apparel brand can be for consumers globally.\n\nGiven the current macro uncertainty and our actions to streamline workflows, we are focusing our resources more heavily in five regions: China, Japan, the U.K., Germany, and Canada. We are proud of the inroads we are making in China and continue to see it as a key engine for future growth with attractive margins. Japan is experiencing significant consumer spending and FX headwinds, yet our underlying growth is strong. This is encouraging as Japan is an important region to generate global style credibility, in addition to its large sales and profit opportunity.\n\nIn the U.K., we continue to gain traction with growing brand awareness, particularly within the 25 to 34 age group. During Q2, we acquired more new e-commerce customers in London than in any other market outside of New York City. In Germany we have had early success with our partnership with Zalando and are seeing traffic recover in our Berlin store. In addition to our three core growth pillars, we are continuing to expand select third-party distribution as a profitable marketing vehicle for our direct channel, with incremental top and bottom-line growth over the medium term, albeit with modest impact in 2022.\n\nWe believe that thoughtful and disciplined expansion into third-party distribution can be a critical lever to help us expand awareness of the Allbirds' brand, while also building greater credibility in the performance category. While it's still early days for our third-party distribution strategy, we have established initial partnerships with marquee retailers, including Nordstrom, Zalando, and Public Lands, and SCHEELS, all of which are off to a strong start. Prospective partners view our brand as an exciting new growth lever for their businesses and also a way to express their own commitment to environmental values helping them meet this growing demand from their shoppers. When we evaluate future partners, we focus most importantly on the consumer that shops there, and look for both credibility with those consumers and reach to a new group who we haven't met through our own direct channels.\n\nThis includes accessing geographies that we don't expect to reach with our brick-and-mortar stores. A good example of that is our partnership with SCHEELS, which is a premium regional chain in locations where we do not expect to build stores for many years, if ever. We then focus on partners that present our brand in a compelling and prominent manner, such as our recent activation in the high-visibility center stage at Nordstrom's flagship store in New York City. And finally, we show preference to retailers who are committed to improving their environmental impact.\n\nLooking ahead in the coming weeks, we will be launching an exciting new partnership with Selfridges in London, a key shopping destination for global trendsetters which should help drive significant brand heat, and we will continue to update you as we get closer to launch stacks with other marquee partners. In closing, I am incredibly proud that we've grown Allbirds into a beloved brand. Consumer-focused innovation is the lifeblood of great consumer companies. And we believe that our innovative, sustainable approach to footwear and apparel is truly what sets us apart.\n\nI believe that one of the most important characteristics of an innovative company is the ability to quickly remind what is working, and what misses the mark, and having the agility and prudence to pivot accordingly. Today's announcement of our simplification initiative shows our team's ability to proactively manage this dynamic demand environment and position us for continued success, even amid a difficult landscape. Importantly, and despite the increasingly challenged consumer backdrop, we have several proof points that I and other members of our executive leadership team track that show that our fundamental model is working. As a consumer-obsessed company, we look to maintain a best-in-class NPS which we have continued to deliver.\n\nWe also focus on repeat purchase rate which is strong at over 40%. That lets us know that our customers love our products. Similarly, we also track customer LTV, which continues to grow, as we provide new products that our customers love and offer them additional occasions to buy in our stores and more recently in our third-party partner stores. These metrics demonstrate a best-in-class customer experience with a modern distribution model, all inside an enormous and growing addressable market, where we still have low double-digit awareness.\n\nCollectively, this gives us great confidence in our future potential. I firmly believe that the strength of our operating model will continue to propel us toward our medium-term financial and sustainability target. And we continue to win with consumers that we believe are increasingly aligned with the core tenets of the Allbirds brand. With that, I'll turn it over to Tim.\n\nTim Brown -- Co-Founder and Co-Chief Executive Officer\n\nThanks, Joey, and good afternoon, everyone. I'm excited to update you today on the steps we are taking to reinforce our brand positioning, of supernatural comfort. We are proud of how quickly we were able to become a leading source for sustainable footwear and establish Allbirds as a standard bureau for the industry. Our relentless focus on innovation has been, key to our success.\n\n2022 was no exception. And as we shared in prior calls, is shaping up to be the strongest year in our history for new product launches. The successful launch of Tree Flyer in Q2 represented our third performance shoe for running. The Flyer is lightweight, bouncy, and super comfortable bringing a powerful combination of performance, style and natural material innovation to our consumers who want an expanded offering to complement our base and trail runner franchises.\n\nWe know that if you're going to make a running shoe it has to be extraordinary. And so we spent more than two-and-a-half years researching, designing, testing, and iterating to create a running shoe at as a key building block of our performance journey. Made with revolutionary SwiftFoam technology, the Flyer represents a big moment for Allbirds and another groundbreaking step forward for our values, our purpose, and our journey to meet consumer demand for natural material innovation in the category. SwiftFoam is a first of its kind bio-based Midsole Technology using plant-based casting resins enabling an estimated 20% reduction in carbon footprint versus petroleum-based synthetic alternatives.\n\nWe believe that Tree Flyer's bouncy, airy SwiftFoam midsoles are among the most responsive, lightest weight, and most energy efficient to produce midsoles on the market. Thank you to our teams for bringing the fly to life on yet another new Allbirds materials platform that delivers both unique consumer benefits alongside significant advancement toward our sustainability objectives. Tracking this code and meeting an expanded running use case opens up a substantial opportunity for us to build an enduring competitive moat in the performance category. And the response from both consumers and media alike has been overwhelmingly positive.\n\nIn fact 43% of Flyer sales in the first 30 days post launch were to new customers, which we believe is a strong proof point that our performance offering is not only resonating with our existing audience, but bringing new customers into the Allbirds' brand. We also delivered some exciting brand heat moments in the quarter with the launch of our Allbirds x Rosie Assoulin Sugar Sliders and limited-edition PINK flyers, which were a top-selling style in the quarter, thanks to a cheeky ad we launched with actress Lindsay Lohan. And just this past month due to overwhelmingly popular demand, we relaunched our children's Smallbirds shoes with updated styles as a permanent collection with an extended offering to cover toddler and youth sizing. Turning now to apparel, we are sharpening our focus and refining our offering going forward.\n\nI think it's important to take a moment to ground everyone in the origins of our apparel strategy. First and foremost we know our Allbirds customers have a desire for apparel, and we also know that having apparel increases average order value and lifetime value. When we decided to connect our successful footwear franchises to apparel offerings, we leverage unique natural materials to deliver next to skin comfort, a consistent hallmark of the Allbirds brand. This is reflected in the success of some of our core apparel offerings including our socks, underwear, our classic T-shirts, and sweats, which continue to perform well as expansions of our material platforms and articulations of supernatural comfort.\n\nAs we look back on our apparel journey, there are a couple of key learnings we're bringing forward to our next generation of product. First, we went too deep on leggings, an incredibly competitive category. Second, we were overly focused on narrow end use cases and have come to understand our customers want items that provide versatility across occasions that our material innovation supports. Finally, given the strong sell-through data we know that our customer values and prefers classic seasonless items such as tees that complement our footwear offering.\n\nGoing forward we will focus on a simplified lineup of apparel that showcases the versatility of our natural materials. Our Gen 1 assortment was less than half evergreen product. With our Gen 2 collections, a vast majority of the assortment will be evergreen product which requires less seasonal merchandising and simplifies our buying process. We'll be leaning into classic everyday styles that emphasize functionality and versatility and we will sunset our leggings offering.\n\nSimilar to our successful footwear strategy, we will continue to focus on the key material platforms that can be leveraged across multiple products. On a separate note I'm excited to share that we are launching a new design and product hub in Portland, Oregon. This office will serve as the creative headquarters for the majority of our design and product development teams enabling us to centralize resources operate with greater agility and access world-class talent in the Greater Portland area. Moving forward we remain committed to investing in our product and innovation teams which play a critical role in the continued success of Allbirds.\n\nLater this year we will be introducing our plant leader platform with the rollout of a new lifestyle franchise, which will represent a new and more contemporary style moment for Allbirds. This is just a teaser of what's to come. We'll have more to discuss on our Q3 earnings call, but needless to say, we're excited to be bringing yet another groundbreaking Allbirds franchise to market. In 2023, we have more on deck in both our lifestyle and performance categories.\n\nAs we matrix our materials across silhouettes, we have a big opportunity to create families of products and associated pricing tiers across different lifestyle and performance occasions. We believe this investment in innovation and materials platforms continues to be our most powerful and durable competitive moat. Now over to Mike to discuss the financials.\n\nMike Bufano -- Chief Financial Officer\n\nThanks, Tim, and hello everyone. We are pleased that we delivered on our net revenue guidance target and beat our adjusted EBITDA guidance target in the quarter. Our ability to deliver these results in this incredibly dynamic operating environment shows us that the underlying competitive moats Tim just mentioned are indeed durable. The simplification initiatives announced today will allow us to continue to invest in the customer, while we navigate the external headwinds and work toward achieving our medium-term targets.\n\nGoing deeper into our Q2 results, net revenue grew by 15% versus last year, 18%, excluding the impact of FX rates. Our two-year growth rate accelerated to 55% versus Q2 2020. The growth in Q2 was equally balanced between orders and AOV with AOVs driven by a combination of price increases and increased units per order due in great part to core apparel offerings. The price increase we implemented in March has broadly played out in line with our expectations with the increase in price more than offsetting any short-term elasticity.\n\nThis speaks to the strength of our brand and the quality of our product offering. Net revenue growth by region was consistent with our expectations with international flat and the U.S. growing 21%. Our international business is again pressured by external headwinds.\n\nIn the U.S., the primary driver of growth was the retail channel, which continues to perform well. Given the U.S. consumer dynamics Joey outlined earlier, I'd like to provide some color on our recent monthly trends. For May to June, we saw a sequential slowdown in total company net revenue growth from the mid-20s to the mid-teens.\n\nThis was driven by our U.S. business, which began to slow starting in the back half of June. As of today, these trends have not yet abated. Our read on the data is that this slowdown corresponds to a broader slowdown in U.S.\n\ndiscretionary goods spending specifically in footwear. In other words, we do not believe we are alone in experiencing these dynamics in our U.S. business. Looking at adjusted gross profit.\n\nQ2 increased by 4% to $40 million with adjusted gross margin at 51%, down 519 basis points to Q2 of last year. The main drivers are an estimated 400 basis points of year-over-year COVID-related cost headwinds, as well as a lower mix of sales in our margin-accretive international business. These factors were partially offset by mix shift to physical retail and higher-margin products, as well as the price increase. Wrapping up Q2, adjusted EBITDA was negative $9.2 million, ahead of our guidance target range, due to tight management of corporate SG&A.\n\nI'd like to now provide more detail about our simplification initiatives starting with why we're proactively taking these actions now. It starts with our belief that we have a beloved brand, great products, durable competitive moats, and a powerful business model. We believe that at the time of our IPO and we believe it with even greater conviction today. In light of how the operating environment has changed over the last quarter and continues to evolve, the reality is that to be good financial stewards, we have to take quick and decisive steps to ensure that we can drive the business toward our medium-term targets.\n\nAs we said last quarter, we remain steadfast in our belief that there are several paths by which Allbirds can achieve those targets. Said simply, the destination has not changed but the route we need to take over the next several quarters to reach that destination has. Joey discussed the strategic rationale for the simplification initiatives. I would like to discuss how they will positively impact our cost structure going forward.\n\nStarting with the supply chain initiatives, the transition to automated DCs and a dedicated returns processor will provide greater cost predictability in the second half of 2022 and should begin to positively impact adjusted gross margin as soon as 2023. The more rapid scaling of our manufacturing network should begin to meaningfully reduce product costs by late 2023. Taken together, we believe these initiatives can keep us on track to achieve our medium-term target of 60% plus gross margin in our direct business and make up some of the ground we lost to the COVID-related headwinds in 2021 and 2022. Moving to the SG&A initiatives.\n\nThe steps we've taken to simplify our operating structure and reduce office space are expected to generate annualized corporate SG&A savings of $13 million to $15 million and will allow us to continue to invest in marketing spend, as well as that talent across product brand and sourcing. The 2022 impact of these actions is approximately $4 million to $5 million and is factored into our updated 2022 guidance. There are non-recurring costs associated with the simplification initiatives. We expect most of these to be incurred in 2022, but we'll keep investors updated on our progress.\n\nLet me walk you through our current estimates of those expenses. One, we are liquidating end-of-life inventory, primarily first-generation apparel. We expect the non-recurring net expense related to this liquidation to be $12 million to $14 million. The bulk of that expense already came through as a non-cash charge of $11.6 million in Q2.\n\nTwo, in Q3 and Q4, there will be $3 million to $5 million of non-recurring SG&A expenses associated with employee-related expenses, reducing office space and other projects. We estimate that there will be another $3 million to $5 million associated with the transition to the automated DCs and the dedicated returns processor. Summing that up, we expect the total non-recurring net costs associated with the simplification initiatives to be $18 million to $24 million. I'd like to close this section by again emphasizing that we are taking these steps to optimize our cost structure and set us up for significant adjusted EBITDA improvement in 2023.\n\nTaking a look at the balance sheet. We ended Q2 with $122 million of inventory, which was up 3% from the end of Q1. While shipping times have improved somewhat in transit continues to account for about one-third of our total inventory. Adding more color here.\n\nIncluded in that $122 million is about $10 million of end-of-life product that we plan to liquidate as part of the simplification initiatives. Looking at the remaining $112 million, this is good inventory, primarily core evergreen footwear. In this dynamic demand environment, we will buy tighter on core footwear for the next few quarters, enabling us to make calculated buys on new footwear styles. This tighter buying approach when coupled with our selected promotional strategy is expected to lead to lower inventory levels and improved turns.\n\nWe ended Q2 with $207 million of cash. To be clear, the majority of the non-recurring expenses outlined earlier are non-cash and will not have a material impact on our cash needs. With mid-teens revenue growth this year, slower SG&A spending, improved inventory turns and tighter buying, we expect free cash flow to improve and do not anticipate having any incremental cash need in the foreseeable future as we have ample cash to fund our growth initiatives. I'd like to now share some thoughts on our guidance targets.\n\nUntil we have more certainty around the length and severity of the external headwinds, which now include the slowdown in U.S. consumer spending, we will continue to take a cautious approach with our 2022 guidance targets. There are three elements driving our outlook. First, we now estimate a $20 million to $25 million full year impact on international net revenue from external headwinds.\n\nWorsening FX rates are driving the entire increase from our prior estimate of $15 million to $20 million. Second, we anticipate that the U.S. consumer discretionary spending trends will worsen in the back half of the year. And third, in a demand environment like this, we know it's critical to stay nimble and meet customers where they are.\n\nWe will continue to be thoughtful about our selective promotional strategy, but we do believe the competitive environment will require an increased level of promotional activity especially in Q4. We know that for Allbirds promotions introduce the brand to new customers, drive demand and efficiently move inventory. We are beginning to implement an expanded promotional calendar to include a more typical customer-centric cadence around holidays, as well as markdowns on end-of-season or last-call products. To be clear, we will still be selective with promotions and for the full year anticipate full price yield in our direct channels of approximately 85% to 90%, which we believe is in line with or higher than other premium brands.\n\nOne housekeeping note. Our guidance targets exclude any non-recurring revenue and costs associated with the simplification initiatives. Our updated 2022 adjusted net revenue guidance target is $305 million to $315 million up 10% to 14% versus 2021, including an estimated year-over-year FX impact of 275 to 350 basis points. We continue to target opening 16 to 17 new stores in 2022.\n\nOur updated 2022 adjusted gross profit guidance target is $150 million to $157.5 million. At the midpoint of our revenue and gross profit targets, this represents an adjusted gross margin target of 49.6%. The changes from our prior target are business segment mix and a modestly increased level of promotional activity. Our updated 2022 adjusted EBITDA guidance target is negative $42.5 million to negative $37.5 million.\n\nThe change from our prior target reflects the flow-through of lower revenue and gross margin, partially offset by corporate SG&A savings from the simplification initiatives. Looking briefly at Q3, our adjusted net revenue guidance target is $65 million to $70 million, up 4% to 12% versus Q3 2021, including an estimated year-over-year FX impact of 225 basis points to 300 basis points. Our Q3 adjusted EBITDA guidance target is negative $17.5 million to negative $15.5 million. Let me add a few more thoughts to help you model out the second half.\n\nFirst in the second half, total adjusted net revenue growth is targeted to be in the mid to high single digits. We expect the U.S. and international to grow at similar rates for the balance of the year. Second, for the full year, we are now targeting international to grow low to mid-single digits and the U.S.\n\nbusiness to grow mid-teens. We expect the second-half slowdown in the U.S. to impact digital and retail equally. Finally on an absolute basis, we expect adjusted gross margin to moderate sequentially in Q3 and then strengthen sequentially in Q4.\n\nLet me close by acknowledging that this is a meaningful change to our 2022 guidance targets compared to what we were expecting at the start of the year. The reality is that the world and the operating environment have also changed meaningfully in the past six months. We believe that the external headwinds our industry is currently facing will pass and do not change our long-term story. We are a sustainability leader in an attractive market with a massive whitespace opportunity to grow brand awareness from low double digits.\n\nDuring this consumer downturn, we are investing and building brand momentum through product innovation, marketing, retail stores and marquee third-party partnerships. We are confident that these investments in the customer coupled with the simplification initiatives will allow us to navigate this environment, position us well when the headwinds pass and help us continue to make progress toward our medium-term targets. Again, the destination has not changed but the route we need to take over the next several quarters to reach that destination has. Thank you for hanging with us for longer-than-usual prepared remarks.\n\nLet's open up the call for questions.\n\nOperator\n\n[Operator instructions] And the first question will be from Alex Straton from Morgan Stanley. Please go ahead.\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nGreat. Thanks for taking my question here. I just wanted to touch on the demand evolution in the quarter. It sounds like you guys saw a slowdown to that mid-teens rate in the back half of June, and that continued through July.\n\nSo I just want to understand, first, is that right you didn't see further deceleration?And then second, could you guys just talk -- you mentioned you had some data points that told you about the slowdown earlier. So maybe tell us what were those data points? And how are you monitoring them now and going forward? Thank you.\n\nMike Bufano -- Chief Financial Officer\n\nYeah. Hi. Alex. Yeah, thanks for the question.\n\nSo that's correct. We saw the slowdown really start to hit back part of June, kind of after Father's Day. It just seemed like people's behavior just started to change, especially on the balance of good spending versus services spending. We primarily started to see that in some of our own direct data, but there's also a few other like data points that we look at.\n\nSo Joey, did you want to jump in and talk a bit more about that?\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nYeah. I mean, Alex thanks for the question. Most of it is just related to our business model and the investment we've made in a really rich data ecosystem. So we see virtually all of our transactions happen between us and the consumer, and we've developed and invested in significant data ecosystem, such that we can compare on a huge number of KPIs what we should expect to see from a trend perspective and what we are seeing.\n\nAnd that gives us a speed and agility to understand what's happening with the consumer. And any deviation, we can usually pivot quite quickly, and that might pertain to marketing spend or a whole bunch of other actions that we're taking. And that one persisted, and we saw it pretty consistent across a number of metrics. And I'll say it was true in our digital trends, and it also happened in physical retail.\n\nSo that's why we wanted to reflect that and make it clear.\n\nMike Bufano -- Chief Financial Officer\n\nAnd then for the first part of your question, Alex, yeah, that same rate continued in July, so we didn't further deteriorate in July. And then it's obviously only a few days into August, but it stays consistent with what we've seen thus far.\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nGreat. That's super helpful. Maybe just one quick follow-up on your answer. When you guys had this agile response to the change in trend, maybe what was like the top one or two things that you immediately did that you saw proved super effective?\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nIt's a whole host of things. I mean, this is the kind of execution that we do every day, Alex. And it's about the messaging to the consumer based on what they're responding to, whether that be a surge in travel spending. And we know people are on the road.\n\nWe know we're great shoes to use on the road, and so we might position some of the product messaging around that to something as simple as just watching our return on ad spend and flexing up in demand the marketing that's a bit more performance oriented in a way that's responsive to the trends that we're seeing.\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nGreat. Thanks so much.\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nThanks, Alex.\n\nOperator\n\nAnd the next question will come from Bob Drbul from Guggenheim. Please go ahead.\n\nBob Drbul -- Guggenheim Securities -- Analyst\n\nHi, good evening. Two questions for you. I think on the first one, when you look at the store base and the new stores you're opening but in aggregate, how many of the stores -- if you could wave a magic wand today, how many stores would you like to exit, if you could? And do you have any flexibility to get out of some of those stores, given the environment, without major cost to you? And the second question, Mike, in terms of the cash burn or the end-of-year cash, your expectations, can you just talk through -- you said you don't really think you'll need any additional cash. But can you just help us understand your expectations on the next few quarters and maybe even in 2023? Thanks.\n\nMike Bufano -- Chief Financial Officer\n\nYeah. Thanks, Bob. So I'll start on the back end of that question, and then I'll answer the first part of your question and turn it over to Joey maybe for some more thoughts on the store side. So in terms of the cash expectations, really not a whole lot more to add beyond what we said earlier in the call.\n\nWe are taking these practice steps, especially around tighter buying, better inventory management. So we feel really comfortable with the cash position we're sitting at. We think that our operating cash flow will continue to improve, and we're not at this point really getting into any kind of detail on 2023. So that's how we hold the cash question.\n\nBut again really just kind of wanted to convey to folks, who feel great about having the cash on hand that we do to, able to continue to grow the business. On your question on stores, I'll answer the specific question, but I love it if Joey could share a little bit kind of more broader details on how we're thinking about the store fleet. I would say, there's no stores we would exit today, right? And even leases we have coming up, there's a reason we reaffirm the 16 to 17. In fact, there might be even a chance to pull a couple into Q4 this year.\n\nWe'll see how Q4 goes. So for us we're not looking at it as any sort of slowdown in what we've already opened or what we have in the media pipeline. Our real estate team's done a great job of picking great sites in our operations and retail teams did a good job getting those stores open. But Joey, why don't you maybe share a little bit more about kind of how we're still holding retail overall?\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nYes. I think, maybe just helpful to recap how we think about retail and how that creates this omnichannel impact for us. So first and foremost, when we see the NPS that we do in stores, we understand the customer experience speaks to a higher repeat rate. And we often see -- as I noted in my prepared remarks, we often see, now it's up to 15% of our repeat customers are coming back and buying digitally, and they're spending over 50% more than single-channel repeat customers.\n\nSo that's a really big impact on the profitability profile of a single customer that we can acquire. And that's really important for us driving the health of the business. And of course, these stores operate as billboards and generate awareness within the region that we're in. So all of that is incredibly important for the business model overall.\n\nBut when we do real estate, we do this very conservatively, and we only underwrite these leases to the four-wall economics. And we built in cushions to make sure that we can hit our four-wall EBITDA profitability target, and we're very payback- and ROIC-centric when we make these decisions. So when we look at this, what we expect is a quick payback, and we expect to be good capital allocators. So even in the demand environment like we're in today, where there's drop-off in store traffic across the industry, we can still feel confident in the long-term performance of each of these stores and the fleet overall and of course how that haloes into the cross-channel commerce dynamic.\n\nBob Drbul -- Guggenheim Securities -- Analyst\n\nGreat. Thank you.\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nThanks, Bob.\n\nMike Bufano -- Chief Financial Officer\n\nThanks, Bob.\n\nOperator\n\nThe next question is from Lorraine Hutchinson from Bank of America. Please go ahead.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThanks. Good afternoon. I wanted to understand how you're thinking about the path to profitability, obviously the cost cuts. But are you also considering levers to pull on the top line to both scale like a quicker wholesale rollout or more new stores?\n\nMike Bufano -- Chief Financial Officer\n\nYes. Hi, Lorraine. Thanks. Yeah.\n\nI think, there's a couple of pieces here. I think the first thing, just keep in mind with some of the stuff we're doing with these simplification initiatives, we're really shifting some dollars and resources around to continue to invest in marketing spend and continue to invest in resources across the product team and the brand teams, so really investing in the customer. We know that investment at the customer we've made historically, that's driven these durable competitive moats that we see today. So please don't take the comments as we're slowing down investing in the customer, and it's all just about kind of getting to the cost side.\n\nThat's not the message certainly at all. Joey, in terms of Lorraine's specific question around would we accelerate store openings. Would we accelerate on the third-party side? Maybe you can share some thoughts to that part of the question.\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nWell, yeah, I think the way we're thinking about this, Lorraine, is, as we've mentioned before, this year is quite slow and methodical and not particularly material on the financials, and then we do expect to continue to roll it out. And the reason we do think that is we know it's going to do well for awareness. And when people -- we get maybe 1,000 eyeballs on a pair of shoes in one of our marquee partners for every one pair that we sell through that channel, and we do expect that halo to really positively impact our direct channel. So we want to do that.\n\nWe also want performance credibility, and we're not going to lose discipline over the approach to make sure that we maintain a really clean marketplace. But as Tim mentioned, we have great performance products that have come out, and you can see how that interacts within our business and drives a lot of new customer acquisition with over 40% of the customers who bought that shoe in the first 30 days being new to our business. So when we augment that and we scale that with third party in a location where it gives us credibility in terms of the performance aspects of the product, that's going to supercharge. So I think that's the approach we want to maintain.\n\nAnd of course, we'll continue to look at data as things go and make sure that we maintain a really thoughtful and healthy set of relationships.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nThe next question will come from Mark Altschwager from Baird. Please go ahead.\n\nMark Altschwager -- Baird -- Analyst\n\nGreat. Thanks for taking my question. I guess first for Mike. Can you provide a bit more detail on the magnitude of the cost of goods savings you're expecting in '23 related to the simplification plan? And then just as we sort of think about that path to profitability, adjusted EBITDA loss guidance this year, about $40 million at the midpoint.\n\nYou have some of these savings on tap for 2023. Obviously, sales right out of the environment. But could you maybe speak to the level of sales or range of sales that would be needed to achieve breakeven adjusted EBITDA with all the changes you're talking about today?\n\nMike Bufano -- Chief Financial Officer\n\nYeah. Thanks for the question, Mark. So when you think about that, the cost savings piece, over the course of the last two years, the COVID-related headwinds on logistics costs and distribution center costs have been about 450 to 500 basis points. So a big part of what we're looking at here is we know we're not going to make all of that up in one year.\n\nBut by accelerating some of these initiatives and taking these steps now, we should be able to put a pretty good dent into that in 2023 -- by the end of 2023. So that kind of helps you about how to size it. We're not going to get into super detailed 2023 guidance like certainly today. And look, in terms of your question about is there like a magic sales number when it gets to adjusted EBITDA breakeven? I think the reality is kind of going back to part of what we shared earlier this idea that the destination has not changed for us.\n\nWe're focused not just on getting to adjusted EBITDA breakeven. We're focused on the medium-term targets and getting to that mid-teens adjusted EBITDA as a percent of sales. And there's lots of levers we can pull to get there. Obviously, continued top-line growth which is why we invest in the brand and invest in the customer, even during this economic downturn, that's a big part of it.\n\nBut a lot of these proactive steps we took today on the cost of goods structure and the $13 million to $15 million of SG&A savings, those things combined really help us along the way in the path, Mark.\n\nMark Altschwager -- Baird -- Analyst\n\nThank you. And maybe for Tim or Joey, just given the learnings in apparel and the adjustments you're making to that strategy, can you give us some broader perspective on how you're thinking about the revenue opportunity there? Where do you think apparel contract as a percentage of your sales in the medium term?\n\nTim Brown -- Co-Founder and Co-Chief Executive Officer\n\nYeah. Thanks. I'll take a first crack at that one. Look, apparel at the moment is about 10% of the business.\n\nWe don't see that materially changing. The innovation and product focus remains vastly on footwear. We've got some really exciting sort of stuff coming with the new material platform in the next short period of time, a new lifestyle franchise that we're really, really excited about. But apparel has got a really important role to play.\n\nWe know that consumers want from us socks, underwear, classic T-shirts, all articulations of our supernatural comfort. And part of the strategy there is to focus on that, shifting from a lineup of Gen 1 apparel that was less than half Evergreen to the vast majority of evergreen, servicing these classic items, leveraging our deep, deep knowledge in this natural material platform. So that's the plan going forward. And again, footwear is where we've started.\n\nIt's central to our product and innovation efforts going forward.\n\nMark Altschwager -- Baird -- Analyst\n\nThank you, Tim.\n\nOperator\n\nAnd the next question will be from Matthew Boss from J.P. Morgan. Please go ahead.\n\nMatthew Boss -- J.P. Morgan -- Analyst\n\nGreat. Thanks. So Mike, in relative to your inventory position today and incorporating actions from the simplification strategy, what are you targeting for inventory to exit this year relative to revenue growth? And then for Joey, larger picture, what are you seeing in the competitive landscape today? Or what do you believe is driving the change in the backdrop relative to three months ago in footwear?\n\nMike Bufano -- Chief Financial Officer\n\nYeah. So on the first one, I really think of inventory as a forward-looking metric, Matt. And I kind of look at where will we be really not just the end of this year and by the end of 2023. I think with the steps we're taking to buy tighter on the core product that we have in stuff now, that we know is evergreen, that we know our customer loves, that's going to do a pretty dramatic improvement when it comes to turns.\n\nSo I'm kind of looking out further to where we want to be by the end of '23, and we think we're going to see the inventory position certainly come down by the end of 2023 and have a big improvement in turns next year. So Joey, I'll turn it to you for the second piece on your thoughts on the competitive dynamic.\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nYeah. I mean, I think I'm sure you're all over at that. But I think the inventory situation in the industry is one that's quite notable, where a lot of companies had difficulty navigating the supply environment for quite a long time during COVID. And those shipments are now just catching up, and that happens to be simultaneous with a slowdown in the overall appetite from consumers.\n\nAnd while maybe some of their spending is staying the same, the shift from goods and particularly discretionary goods over to travel and other things in the economy clearly is making a notable impact, particularly on footwear. And so that's kind of the demand shift that we're seeing. And I think what we're seeing in the environment is already a much more dramatic promotional environment than I think we had anticipated for the industrywide, going on at this part of the year we might have expected it in the holidays having lived through what we've lived through in the past couple of years. But it's happening earlier now in a much more significant fashion than I think we would have predicted earlier.\n\nGood fortunate situation is that, while with any kind of slowdown, we're, of course, going to be a little heavier on the inventory than we might otherwise plan for. It's all really good quality inventory at evergreen. And while we make sure to be competitive in the environment with some smart promotion and smart end-of-season markdowns, we're going to -- we don't need to do anything dramatic and can keep a really good discipline and make sure that we keep tracking against both the top line and margin expectations.\n\nMatthew Boss -- J.P. Morgan -- Analyst\n\nThat's helpful color. Best of luck.\n\nOperator\n\nAnd the next question will be from Dana Telsey from Telsey Advisory Group. Please go ahead.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGood afternoon, everyone. As you think about the new product introductions that are coming up, are you making any adjustments to pricing for these new products than you would have before this downturn? And what does that imply for the margin also? Thank you.\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nThanks, Dana. So on price, I can give back to Tim for a little color on the actual products and the innovation we're focused on. But we talked about this earlier in the year. We really established a pricing architecture that signaled a few different things that we wanted to convey to consumers when we made our pricing adjustment in March.\n\nWhat we did was that we established a framework where we were material-centric of supernatural comfort deriving from materials is what the brand stands for. We really want to make sure that we orient the customer around that key value proposition. So where we might introduce something in Tree that might be a lower price point than Wolf which might be a lower price point than our newest innovation in Plant leather. So that architecture speaks to the quality and the delivery and expectations we would expect from the consumer.\n\nAnd then similarly on a lifestyle performance when you get into the higher technical offering that we have something like a Flyer, we would expect that consumers would be able to understand that the technology that we're investing in something like the midsole with SwiftFoam of the highest quality in the industry. And hence, we'll be willing to pay more. And fortunately, we priced that at the highest price point I think you've ever sold any mainline product that we have at $160 in the U.S. and sold very well and also sold very well while delivering all of that, plus 40% of the mix being from new customers.\n\nSo we're pretty enthusiastic about that and are happy with the architecture that we set up and I think the rest of the year is going to fit right into that model.\n\nTim Brown -- Co-Founder and Co-Chief Executive Officer\n\nYeah. Joey covered that really well. I just -- I think the key point to underline is that natural material innovation is at the core of our growth engine. We've invested in that from the beginning.\n\nWe continue to invest in it recently, opened a Portland design and innovation hub. And that ability to continue to bring new and sustainable materials to market that, meet this consumer demand, we see it in our research every day this increasing consumer demand for natural and sustainable materials, allows us to take price and to enhance the value for our consumers, and we'll keep doing that across performance and lifestyle. And like I sort of said again, in the short term, we have a big, new material platform and a new lifestyle franchise coming that we're excited about which will be a good example of that.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nAnd then just lastly on the --\n\nMike Bufano -- Chief Financial Officer\n\nThanks, Dana.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThen lastly on the -- thank you.\n\nMike Bufano -- Chief Financial Officer\n\nWas there a follow-up question there?\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nYeah, yeah. Just lastly on promotion, what type of promotions are you thinking about as we head into the third and the fourth quarter compared to -- and particularly, you haven't been promotional. How are you thinking about promotions? What should we be watching?\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nSure. I think -- so we have done some, and I don't think it's going to be inconsistent with what you've already seen from us. You can look on our digital platform today, and you can see that we have some end-of-season markdowns. And these are really -- these are styles that were a little bit slower, moving highly seasonal in terms of the color way or the style and may have broken sizes.\n\nSo that we're starting to move to kind of an end-of-season markdown cadence, and that's just really going to be helpful in terms of managing the expanding breadth of our assortment. So that's really aligned with what we've been expecting to do. And then, I think in terms of the holiday cadence that we're doing, that's pretty typical, pretty typical. We did a nice Black Friday event last year, which worked quite well, and we're going to do something similar again here.\n\nAnd these things are all aligned around the idea that we're a premium brand, and we don't want to habituate customers to think that they can get products on discount. If they want the best, if they want the newest, if they want the most core, that's going to be full price from us. And so maintaining discipline around that is really critical to us. And it's helpful to have an inventory base that really is so heavily focused on core and a little bit more evergreen styles.\n\nThat allows us to do what we're just describing remain competitive in the marketplace and still keep full price yield at 85% 90% for the year, even in such a promotional environment. So we're quite pleased with the execution there.\n\nMike Bufano -- Chief Financial Officer\n\nYeah. One last thing I'd add to that to you, Dana, is we know in our experience well limited so far with the promotions. What we see it does is it increases awareness for the brand, and we're still remember in the mid-teens aided brand awareness today, and it definitely drives demand to help us bring in some new customers. So that's part of the reason why we want to meet the customer where they are on some of the stuff right now.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nOperator\n\nAnd the next question will be from Ed Yruma from Piper Sandler. Please go ahead.\n\nEd Yruma -- Piper Sandler -- Analyst\n\nHey. Good afternoon, guys. Thanks for taking the questions. Two for me.\n\nI guess first, you guys told a really good story about performance, so congrats on the early success there. I wanted to click that a little bit on the lifestyle business. What kind of performance trends are you seeing within your legacy platforms particularly well runner know that's not seasonally the hottest during the summertime? And then as a follow-up, I want to confirm that the write-down in apparel was $12 million to $14 million. And I just want to kind of understand a little why should we treat that as a onetime given that companies in your space kind of create new product discontinue all the time? Is that really appropriate as a one-time charge? And kind of how would you like us to treat that? Thanks.\n\nMike Bufano -- Chief Financial Officer\n\nYes, Ed. Happy to follow up in more detail on the second question. We have a callback with you later. But the reason we think of that as a onetime is it's a pretty big move in this generational change on the apparel side of things.\n\nThat's the biggest driver in sync then with some of these changes we're making on the logistics side. So truly is onetime in nature, and that's why we've chosen to liquidate as opposed to trying to move through our own direct channels. We do a pretty good job of that. Joey was just saying with something like end of life and markdowns.\n\nIt's a bit of a different beast but happy to talk to that a little bit more on the follow-up call. In terms of your question on the performance versus lifestyle trends, we continue to be happy with the overall growth across each side of the footwear category. There are certainly times during the year where the focus is a little heavier on performance where it's a little heavier on lifestyle. This time is a little heavier on Tree right now, but then we're getting into Wolf season.\n\nSo we continue to feel pleased with the overall growth we see, I think to the credit of Tim and the product team. The expansion that we've had across the whole product portfolio, especially on the footwear side, gives us the ability to have things that are top of mind for customers at every given time of year. And that's how we see it sort of flow all the way through the year on our end.\n\nEd Yruma -- Piper Sandler -- Analyst\n\nThank you.\n\nMike Bufano -- Chief Financial Officer\n\nThanks, Ed.\n\nOperator\n\nAnd the next question is from Jim Duffy from Stifel. Please go ahead.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nThank you. Good afternoon. So my questions are on the digital business. More challenging environment here, not unique to Allbirds.\n\nTrying to understand how this plays forward. Can you maybe speak to differences in what you're seeing with repeat customer engagement and your yield on new customer acquisition efforts? And then from a tactical standpoint, how that's steering your allocation of performance marketing spend?\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nJim, good question. So I wouldn't say that at this point we're seeing any deviation really in trends between new customer acquisition and repeat. And in fact we're seeing really positive trends in terms of LTV growth and repeat engagement. We track that on a number of different periodic basis, and we're seeing absolutely no falloff in the number of repeat purchases that people are making.\n\nAnd when you couple that with the AOV growth that we're seeing, generally, that's quite a positive sign for us, particularly in an environment like this. And Mike alluded to this, even despite the fact of what we're seeing on the demand side, this isn't going to be a knee-jerk reaction to a downturn. We're going to continue to invest, not just in marketing as a line item, but really specifically around brand and really emphasize to the -- we know we're aligned with what the customer wants, and we're going to double down. And our biggest opportunity is in the fact that we still have low to mid-teens awareness -- aided awareness, people who have heard the name Allbirds before.\n\nWe can increase that number and connect with people around the values orientation that we know they're aligned with, with our brand. That's where we're going to win. And so that's -- it's something we're not really letting off, and we haven't seen any data to suggest that that would be a prudent move at this point.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nOK. Joey, you guys aren't the only ones with a strategy like that. I'm trying to understand in that context what's the margin impact for the business and what's the long-run prospect for the margin of that business? Are we going to look back at 2018 to 2021 as the Halcyon days for digital engagement? Or is there a reason to believe the economics on that business can improve?\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nWell, it doesn't exist in a vacuum, Jim. I would really think about the model that we're building as a little bit more than just a channel-by-channel segmentation. When we invest in our retail footprint, we see the digital business rise, and we know we can attribute that back to awareness being lifted in that geography. When we have fantastic organic brand marketing activations, we see that come through on aided brand awareness, and then we can double-click on that on more performance-oriented ads.\n\nAnd I would say, despite the fact that CPMs have been rising across the industry, I think that's a well-known trend that everyone has faced over the last five years. We've done such a good job of early diversification of the media spend that we have that we come back to a place where our overall business can still have leverage on the marketing line item, while we're investing and doubling down in brand. And that, to us, is the right long-term formula so that we can be adaptive and dynamic to the current situation while not sacrificing any of the long-term possibility that this brand has.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nThank you.\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nThanks, Jim.\n\nTim Brown -- Co-Founder and Co-Chief Executive Officer\n\nThanks, Jim.\n\nOperator\n\nThe next question is from Dylan Carden from William Blair. Please go ahead.\n\nDylan Carden -- William Blair -- Analyst\n\nThank you. I know you guys think about the channels holistically. But in kind of understanding trends through the quarter, any additional color you might provide on was the slowdown more concentrated in U.S. online? Was it pretty even between the two channels and kind of what you're expecting go forward between online and retail? Thanks.\n\nMike Bufano -- Chief Financial Officer\n\nHey, Dylan. We say it's been pretty consistent across the channels. That's why we talk about it as a broad-based slowdown. We don't think it's just us certainly, and it seems to be both brick and mortar and digital.\n\nThanks.\n\nOperator\n\nAnd the next question is from Ashley Helgans from Jefferies.\n\nAshley Helgans -- Jefferies -- Analyst\n\nHi. Thanks for taking our question. Just a quick one, Mike, for you. You mentioned the gross margin is expected to be down in Q3 and a nice rebound in the fourth quarter.\n\nWhat's driving value bound?\n\nMike Bufano -- Chief Financial Officer\n\nYeah. There's a couple of components there, Ashley. Thanks for the question. We're glad to make sure we have time for you on the call.\n\nSo the first thing is it is our highest seasonal quarter of the year sales loss that certainly gives us a little bit of leverage on a few parts of gross margin that are fixed. The second thing is we're starting to lap some of the absolute highest levels of inbound shipping. We're also lapping pretty high fuel surcharges and outbound surcharges last year. So we'll still have some of that stuff built in Q4 this year.\n\nWe're just starting to lap some of the real ugliness of some of the COVID headwinds, and that's going to be the big driver there.\n\nAshley Helgans -- Jefferies -- Analyst\n\nSuper helpful. Thanks, guys.\n\nMike Bufano -- Chief Financial Officer\n\nYes. Thank you.\n\nOperator\n\nThe next question is from Noah Zatzkin from KeyBanc. Please go ahead.\n\nNoah Zatzkin -- KeyBanc Capital Markets -- Analyst\n\nThanks for taking my question. Just on the cadence of gross margin. I know you mentioned that you're through the bulk of inventory write-downs. But just in terms of the mix of inventory on the balance sheet, it's still up quite a bit ending in the second quarter.\n\nCould you just give a little more color on kind of the mix of the inventory balance? And what gives you confidence that you won't be taking further write-downs on what you've guided to in the back half of the year? And then just very quickly on the international business. Guidance implies a slight uptick there versus the second quarter. So just any color there would be helpful.\n\nMike Bufano -- Chief Financial Officer\n\nYeah. On the international piece, I'll answer that first because that's quick. We are saying on the local currency side. Things really are playing out very much in line with what we expected at the end of last quarter.\n\nIt's really just kind of the move in FX. So a pretty volatile environment out there in some of the international geos, but our teams are doing a great job of executing the product, and the brand are resonating well with those customers. So that you are kind of reading the guidance right there now on that part of it. The first part of the question then was about the inventory piece of it.\n\nSo after the part that's anticipated to be liquidated so we have $122 million today $10 million more coming on the liquidation side. So that $112 million that we have left after that, again, we think of that as healthy, evergreen product, largely footwear. This is stuff that we know our customers are going to continue to buy. These are the things that are sort of the timeless, classic Allbirds products that people know and love.\n\nThat's why we're confident we'll be able to continue to move through that inventory. It's also nice for us because the products we can be tighter buying on going forward, especially over the next several quarters, because we know we have the inventory in place to meet demand. And then finally, where we do some of this selective promotion that Joey is talking about around a Cyber Monday or that sort of thing, we know those types of things do help us move through inventory as well. So that's why we're confident that the stuff that's going on, primarily around apparel, is sort of unique one-time thing.\n\nWe're going to move through that. We thought it was important to take the quick and decisive action now that we made some adjustments to the apparel side. And we're being able to do this now. We'll be able to accelerate some of those logistics cost savings as well.\n\nAnd we're happy to talk to that a little bit more on a follow-up call as well.\n\nNoah Zatzkin -- KeyBanc Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nAnd the next question is from John Kernan from Cowen. Please go ahead.\n\nKrista Zuber -- Cowen and Company -- Analyst\n\nGood afternoon. This is Krista Zuber on for John. Most of our questions have been answered. Just one here.\n\nIn relation to the simplification initiatives, how should we think about your capital allocation and capex run rate over the next few years? Thank you.\n\nMike Bufano -- Chief Financial Officer\n\nYeah. Look, again, we really believe the cash flows we have now is in a great spot. We're going to see improvements in our operating cash flow because a lot of the stuff we talked about on the call today. We have more than enough cash to be able to fund our growth and have no cash needs.\n\nIn terms of the exact pace of capex and how that's spread across different projects, we'll get into that detail a little bit more when we start to give 2023 guidance, but no change on anything on the capex side for us tied to what we talked about today.\n\nKrista Zuber -- Cowen and Company -- Analyst\n\nThank you.\n\nMike Bufano -- Chief Financial Officer\n\nAll right. Thank you. And with that, I think, Joey, you're just going to close this out with closing thoughts.\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nYeah. Thanks. Thanks for everyone's time today and all the great questions. I think we've tried to do a good job here.\n\nHopefully, we conveyed it, particularly that the love that we're seeing from our customers and that they're demonstrating through repeat purchase, I think, is a testament to the strong health of the brand. And there's probably no more important indicator than that. And it's underpinned by new footwear products like the Flyer that we talked about and the energy moments within our existing franchises. So we're confident that these proactive steps that we've taken and that we've detailed today will ensure that we can still deliver on the medium-term commitments to the financial and environmental stakeholders.\n\nAnd as Mike said a couple of times, the destination is still the same. The path that we might use to get there may adjust a little bit on the way. So thanks again. We appreciate all your support.\n\nWe look forward to talking next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKatina Metzidakis -- Vice President of Investor Relations and Business Development\n\nJoey Zwillinger -- Co-Founder and Co-Chief Executive Officer\n\nTim Brown -- Co-Founder and Co-Chief Executive Officer\n\nMike Bufano -- Chief Financial Officer\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nBob Drbul -- Guggenheim Securities -- Analyst\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nMark Altschwager -- Baird -- Analyst\n\nMatthew Boss -- J.P. Morgan -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nEd Yruma -- Piper Sandler -- Analyst\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nDylan Carden -- William Blair -- Analyst\n\nAshley Helgans -- Jefferies -- Analyst\n\nNoah Zatzkin -- KeyBanc Capital Markets -- Analyst\n\nKrista Zuber -- Cowen and Company -- Analyst\n\nMore BIRD analysis\n\nAll earnings call transcripts"
}