{
  "companyName": "RLX Technology Inc.",
  "companyTicker": "RLX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/21/rlx-technology-inc-rlx-q2-2022-earnings-call-trans/",
  "content": "RLX Technology Inc. (RLX -2.54%)\nQ2 2022 Earnings Call\nSep 21, 2022, 8:00 a.m. ET\n\nOperator\n\nHello, ladies and gentlemen. Thank you for standing by for RLX Technology Inc. second quarter 2022 earnings conference call. [Operator instructions] I will now turn the call over to your host, Mr.\n\nSam Tsang, head of investor relations for the company. Please go ahead, Sam.\n\nSam Tsang -- Head of Investor Relations\n\nThank you very much. Hello, everyone, and welcome to RLX Technology's second quarter 2022 earnings conference call. The company's financial and operational results were released for PR Newswire services earlier today and have been made available online. You can also view the earnings press release by visiting the IR section of our website at ir.relxtech.com.\n\nParticipants on today's call will include our CEO, Ms. Kate Wang; our CFO, Chao Lu; and myself, Sam Tsang. Before we continue, please note that today's discussion will contain forward-looking statements made under the Safe Harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995.\n\nThis statement typically contain words, such as may, will, expect, target, estimate, intend, believe, potential, continue, or other similar expressions. Forward-looking statements involve inherent risks and uncertainties. The accuracy of these statements may be impacted by a number of business rates, and uncertainties that could cause actual results to differ materially from those projected or anticipated. Many of which factors are beyond our control.\n\nThe company's affiliates, advisors, and representatives do not undertake an application to update this forward-looking information, except as required by applicable law. Please note that RLX Technology's earnings press release and this conference call include discussions of unaudited GAAP financial metrics, as well as unaudited non-GAAP financial measures. RLX press release contains a reconciliation of the unaudited non-GAAP measures to the analytic measures. I will now turn over the call over to Kate.\n\nPlease go ahead.\n\nKate Wang -- Chief Executive Officer\n\nThank you, Sam. And thanks, everyone, for making time to join our earnings conference call today. I'm pleased with the healthy financial performance we delivered in the second quarter as we proactively continued to adapt to the new regulatory framework. We remain focused on enhancing the full range of our capabilities from scientific research, product development, to manufacturing advancement, and operation optimization, all of which empowers us to navigate the highly dynamic market and the evolving regulatory landscape.\n\nAmidst strong macro headwinds and the weak consumer sentiment, our solid second quarter results underscore the resilience of our defensive business models and our commitment to building and strengthening our brand's trustworthiness. Before taking a closer look at business updates, I would like to start with a brief recap of the milestone regulatory developments in our industry. Beginning in the first quarter of 2022, the relevant government authorities in China have issued a series of implementing rules and guiding opinions to strengthen oversight of e-cigarette products and regulate the e-cigarette industry, including the administrative measures for e-cigarettes that's coming to effect in May and the new national standards that will become effective on October 1, 2022. Now let me share our progress on the relevant license applications as required by the administration measures.\n\nTo date, two of our subsidiaries have obtained the license for manufacturing enterprise from the State Tobacco Monopoly Administration, STMA, to conduct manufacturing activities under the regulatory guidance. Specifically, one is approved to manufacture e-liquids and the other is approved to own the RELX brand and manufacture RELX brand e-vapor rechargeable devices, cartridge products, and other relevant products. Obtaining this license marked an important milestone in our strategic road map that will actively embrace the new paradigm that comes from regulatory compliance. We believe our solid fundamentals, industry-leading research and development capabilities, and seasoned teams illustrates furthering our mission to achieve full regulatory compliance to our operation according to standards.\n\nTo build on this progress, we have redoubled our efforts to develop new products that meet the applicable requirements while fulfilling users' demands. Some of our new products were among the first flagship products in the industry to obtain approvals under the new national standards, a powerful validation of our industry-leading R&D capabilities. We look forward to bringing the approved products to market that assume in our confidence that our products' quality, performance, and safety will continue to resonant well with our users. Currently, we have several additional newly developed products in the process of technical reviews and many more in the application pipeline.\n\nIn the future, we will remain committed to fulfilling our users' demand for safe, high-quality products, new strict compliance with regulations, while exploring new growth opportunities in the industry. In particular, we strongly believe that R&D is a key to our success in the sustainable future growth. It is R&D's [Inaudible] to quickly rollout compliant new products and maintain our brand's competitiveness. Here are a set of metrics tracking our R&D spending.\n\nOur non-GAAP R&D expense ratio has increased from 1.5% in 2018 to 3.6% in the first half of 2022 and is expected to further increase in the coming years. Beyond product R&D, we are also dedicated to fundamental scientific research to protect our users' health working relentlessly to better understand and minimize the health risks associated with the products. To that end, in addition to swarming our own scientific labs, we have partnered with various leading research institutions including 10 universities, two hospitals, and several independent academic research houses to conduct related research and development, building a firm foundation for ongoing product development and innovation. Furthermore, in the second quarter, we collaborated with Shenzhen Institutes of Advanced Technology and Chinese Academy of Sciences and e-vapor cooling agent inhalation studies, which concludes that e-vapor products containing WS-23 have lower rewarding effects than pure nicotine products, a breakthrough, we believe, that afford us to deliver better, safer [Inaudible] for adult smokers.\n\nTurning now to our operations, alongside our efforts to comply with applicable regulations, we continue to streamline our business structure and operational workflow during the second quarter to enhance our ability and flexibility. Our approach has yield good initial results with non-GAAP expense we show decreasing quarter over quarter. Chao will elaborate on this further a bit later. We believe the comprehensive operational enhancements will enable us to tackle critical changes and swiftly adapt to the market evolution, boosting both our immediate and long-term efficiencies.\n\nIn conclusion, we remain confident in the inherent potential of China's e-vapor market. We believe that as a latest brand to adult smokers, our leading technologies and scientific advancements, high-quality user base, resilient business model, and agile overall execution, our fundamental essence that will empower us to sustainable, quality growth in the long run and further strengthen our leadership position in the industry. More importantly, we will continue to seek regulatory approval to meet all applicable requirements on schedule while developing qualified products to deliver [Inaudible] performance, further enhancing operational efficiency and capturing the industry's growth opportunities ahead of us. With that, I will now turn the call over to our CFO, Chao Lu, who will elaborate further on some of our last quarter initiatives and go over our operational and financial results in more detail.\n\nChao, please go ahead.\n\nChao Lu -- Chief Financial Officer\n\nThank you, Kate, and hello, everyone. I will now provide a summary overview of our financial results for the second quarter of 2022. In the context of a challenging macro environment and COVID resurgence, consumer sentiment went to a record low in the second quarter. According to the National Bureau of Statistics of China, the overall consumer confidence index fell from 121.5 in January 2022 to 88.9 in June 2022.\n\nAlso, overall retail sales in China decreased by 0.7% year over year in the first half of 2022. Proactively adapting our business to the market and diligently improving our operational efficiencies, we delivered solid and healthy results for the second quarter recording net revenue of RMB 2.2 billion. However, we believe that elevated level of revenue in the second quarter was primarily due to frontloading of sales in the downstream value chain in anticipation of the discontinuation of our older products as the industry transition period neared its end in the third quarter. Revenue decreased year over year, however.\n\nIt was mainly due to the suspension of store expansions and new product launches during the regulatory transition period as work to strictly comply with the relevant requirements. Our gross profit was approximately RMB 1 billion in the second quarter with gross margin growth 43.8% for the second quarter, compared with 45.1% in the same quarter of 2021. The decrease was primarily due to an unfavorable product mix shift, an increase in inventory provision and an impairment loss recognized for PP&E to comply with recent regulatory developments. Due to a significant increase in share-based compensation expenses to RMB 193.2 million from a positive RMB 172.5 million in the same quarter of last year, our operating expenses reached RMB 530.9 million in the second quarter of 2022, compared with RMB 167.2 million in the same period of last year.\n\nSpecifically, our selling expenses decreased by 2.7% to RMB 122.6 million in the second quarter of 2022 from RMB 126 million in the same period of 2021, mainly driven by a decrease in salaries, welfare benefits and branding material expenses, while partially offset by an increase in share-based compensation expenses. General and administrative expenses increased to RMB 290.7 million in the second quarter of 2022 from RMB 46.1 million in the same quarter of 2021 mainly driven by the increases in share-based compensation, salaries, and welfare benefits. As we remain focused on strengthening our R&D capability, our research and development expenses were RMB 117.6 million in the second quarter of 2022, compared with a positive RMB 4.9 million in the same period of 2021. The increase was mainly driven by increases share-based compensation expenses, salaries, and welfare benefits, and consulting expenses.\n\nTo echo what Kate mentioned about our business structure enhancements, our proactive cost optimization initiatives also continued to bear fruits this quarter. If we exclude share-based compensation, our non-GAAP expense ratio decreased to 15.1% in the second quarter from 20.9% in the prior quarter. Notably, non-GAAP selling expense ratio decreased to 4.7% in the second quarter from 6.9% in the preceding quarter. If we exclude the impact of one-off items, such as impairment loss, our adjusted expense ratio was similar to that of -- similar to the level than same period of last year.\n\nWe believe the adjusted metrics may better reflect our efforts and achievements with respect to operational improvements during the quarter. As a result, our non-GAAP net income increased to RMB 634.7 million from RMB 351.8 in the prior quarter. Non-GAAP basic and diluted net income per ADS were RMB 0.494 and RMB 0.492 respectively in the second quarter of 2022. Moving on to our balance sheet, we have a solid balance sheet, in particular our cash position remains strong with cash and cash equivalents, restricted cash, short-term bank deposits, short-term investments, and long-term bank deposits net of RMB 16.8 billion as of the end of June 2022, compared with RMB14.9 billion a year ago.\n\nIn addition, we generated a positive cash -- operating cash flow of RMB 1.4 billion with an increase in the operating cash flow over non-GAAP net income ratio to 228% in the second quarter of 2022 from 100% in the same period of last year. Our strong cash position and sufficient operating cash flow, cash inflow enable us to agilely adjust our business while facing challenges and support our efforts to capture potential growth opportunities in the industry. In light of the regulatory changes, we are off to a slow but steady start of the sales of our new products that are compliant with the national standards through the new transaction system amended by the regulatory. In closing, we believe that e-vapor products will continue playing a vital part in harm reduction for adult smokers in the new industry, new regulatory era.\n\nWith our product's superior quality and safety, our brand will continue to resonate well with adult smokers. Moving forward, we will focus on cost optimization, while continuing to reinforce our product competitiveness to create sustainable long-term growth for our shareholders. This concludes our prepared remarks today. We will now open the call to questions.\n\nOperator, please go ahead.\n\nOperator\n\n[Operator instructions] Our first question comes from Lydia Ling from Citi. Please go ahead.\n\nLydia Ling -- Citi -- Analyst\n\nHi, everyone. Thanks, management. And this is Lydia from Citibank. And it's also for your presentation.\n\nAnd if OK, I have three questions. And the first one is actually some of the new products that you introduced in the lesser regions. So, one, what's the user feedback so far? And also as transition period and upgrade it later, and so what's your thoughts on new flavors impact on the sales volume in the following quarters? So, this is the first question. And the second question is, actually, we saw that the retailers now may have over three brands at the store level.\n\nSo, we want to know your view on the competitive landscape looking forward. And the last question is, actually, now we are in September. So, could you share with us order-to-date performance and also your outlook for the fourth quarter and 2023? Thank you.\n\nChao Lu -- Chief Financial Officer\n\nThank you very much, Lydia. So, the first question is mainly on the sales volume 43% and the second one is mainly on how the competitive landscape goes, and the final one is on the outlook for the fourth quarter and so. So, regarding the first one how would be the impact after we launch products that comply with the national standards. As we just launched these products a few weeks ago, so, to be honest, I think the vast majority of our business happened to have the chance to try our products.\n\nAnd given that we are still in the transition period, which will last until the September 30, it's difficult for us to give a quantitative guidance regarding future quarters, given that there are some products are still being approved at the moment. But when we look back the lessons and data learned from the [Inaudible] in the United States effect in 2020, we put few quarter for users in the U.S. market to adapt to the new flavors, and we covered the industry volume. So, there have been more and more products been approved in the past few weeks which we believe to be launched very soon and to cater more user needs.\n\nSo, we'll have more clearer picture of our user demand changed in the late 4Q after users have adapted their flavor inventories on hand. And regarding the second question that the multiple brands selling in one single store going forward, so the ultimate goal for the retailer is to maximize their store publicity and their own profitability. Instead of selling only one brand in a single store, so retailers have to sell multiple brands under the new regime. We don't expect any material impacts on the competitive landscape as retailers have always have the chance to select their definitive brand to collaborate.\n\nSo, we believe the brand share of the store should be determined by product quality, brand equity, and user base. And based on our observations, our brand share remains solid in the past few months. But in the future, we will continue to invest in strengthening our R&D capabilities and our non-GAAP R&D expense has been steadily increasing in the past quarters. And we expect it to further increase in the coming quarters.\n\nWith our increased efforts in R&D, we will continue to offer a better, safer experience for adult smokers. So, the last question is on the fourth quarter's outlook, as we prepared in our opening remarks, our second quarter revenue benefited from the frontloading of sales in the downstream value chain in anticipation of the discontinuation of our older products as the industry transition period near its end in the third quarter. The resulting prior periods for comparison will impact our sequential third quarter results. And meanwhile, we gradually decreased our shipments of old products throughout the third quarter to better transit into the new regime, which will affect our fourth quarter number.\n\nSo, given that the transition period will end on the September 30, it will take more time for us to further project the future outlook especially for the fourth quarter. Thank you for your questions.\n\nLydia Ling -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Charlie Chen from China Renaissance. Please go ahead.\n\nCharlie Chen -- China Renaissance -- Analyst\n\nThank you management for taking my questions. I've got two questions. The first one is regarding your product pipeline, especially the new products which should be -- abide with the new regulations or new national standard. So, what I want to ask is, what is the status of your new product application? In particular, how many has been approved? How many now still pending? And also, how many has been rejected, if there is any? And what is your product portfolio plan for the coming year, for the next twelve months or so? So, that's my first question.\n\nAnd my second question is about the schedule of your product recycling or any reshuffling, I remember, last time you said, you planned to phase out your older products in the second quarter or third quarter. So, I just want to know when exactly have you phased out or stopped producing older products, which is not abide by the national -- new national standards. And when is the time when you have new products started production or started to sell to the markets? So, that's my two questions. Thank you.\n\nChao Lu -- Chief Financial Officer\n\nThanks, Charlie. So, the first one is mainly on the product approvals, and the second one is on the old product results. So, I mean, for the new regime, every new product must get approval before in launch and the allocation result will be an ongoing process. So, we will continue diversifying our product portfolio under the new regime and other quality products for adult smokers.\n\nAs of today, we have retained product approvals for low teens of devices and low teens of cartridge products. And some of our applications are still under review, and we expect the number of our approved products will keep growing. And regarding the second one is about the old product phase outs. We gradually slower our pace in production throughout the third quarter with the majority of our production occurring in the first half of third quarter.\n\nOur products that comply with national standards, we began and participate the testing of the transition platform this month. We have been receiving more approvals in the past few weeks, and they are probably are still in the early stage of approving of these new products. Our front sales of these new products may not be accurately discussed [Inaudible] demand as our users still have access to our old products. And these new products are just being approved, for instance.\n\nSo, we will be able to provide more updates after the transition period. Thank you.\n\nCharlie Chen -- China Renaissance -- Analyst\n\nThank you.\n\nOperator\n\nThe next question comes from Peihang Lyu from CICC. Please go ahead.\n\nPeihang Lyu -- Citi -- Analyst\n\nHi there management. This is Peihang at CICC, and thank you for the opportunity to take my questions. I have three questions actually. And the first one is, could you please introduce a bit about the current inventory level of your original products? And will there be any further inventory impairment? The second question is, I would love to know what are? your recent adjustments after stores cannot be operated exclusively.\n\nAnd my last one is, since the national e-cigarette online trading platform had been launched, I would like to know what is your latest progress with regard to the cooperation with tobacco administration and other [Inaudible]? Thank you.\n\nChao Lu -- Chief Financial Officer\n\nThank you, Peihang. So, the first one is on the inventory lack and also inventory impairment practice, and the second one is on the exclusivity time that we are pretty happy about store owners, and the final one is latest developments regarding the transition platform. So, regarding the inventory lack for our new products and requirement inventory impairments, there has been a gradual but steady start with our sales of our new product compliant with national standards. And also, our users will need more time to digest the inventories and adjust their user behaviors.\n\nSo, the inventory level for new products is relatively low compared with the lack that we have for obviously we had before the transition period. And regarding the inventory positions, the current inventory positions for our product sets do not comply with new national standards and raw materials that are no longer applicable since the fourth quarter of 2021. We don't expect we can incur more significant inventory provisions regarding products in compliance with national standards in the coming quarters. And the second question is on the exclusivity term that we have for store owners previously.\n\nAfter the STMA announced the rule that the exclusive distribution agreements are not allowed for branded stores in March 2022, we began terminating our agreements with store owners and returning their deposits. So, as of the end of second quarter, most of this work has been completed. In our [Inaudible] non-exclusivity will enable us to [Inaudible] carry out only at a brand. In the future brands with substantial brand equity and user mindshare, I will relax.\n\nThere still be retailer platform owners and such process will help them to include they have [Inaudible]. Based on our own observations, since the termination of their exclusivity, many additional store owners have started selling RELX branded products. And finally, regarding the process that we have for the trends at launch, so in these months beginning, several regions across the country have begun to track the national transition platform. As a leader in China's e-vapor industry, we were pleased to be among the first two brands selected to participate.\n\nThe transition process has been smooth, and we are grateful for the products provided by the STMA. For instance, our stock has been offered trainings from researched industries, quality supervision, test vendors, and the clinical testing cooperation by the STMA on the national standards. Thanks for their help and assistance, our new products were among the first batch of products in the industry to obtain approval under the new regime. Thank you.\n\nPeihang Lyu -- Citi -- Analyst\n\nThat's very clear. Thank you very much.\n\nOperator\n\nDue to time constraints, now, I would like to turn the call back over to the company for closing remarks.\n\nSam Tsang -- Head of Investor Relations\n\nThank you once again for joining us today. If you have further questions, please feel free to contact RLX Technology investor relations team through the contact information provided on our website or TPG investor relations.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSam Tsang -- Head of Investor Relations\n\nKate Wang -- Chief Executive Officer\n\nChao Lu -- Chief Financial Officer\n\nLydia Ling -- Citi -- Analyst\n\nCharlie Chen -- China Renaissance -- Analyst\n\nPeihang Lyu -- Citi -- Analyst\n\nMore RLX analysis\n\nAll earnings call transcripts"
}