{
  "companyName": "Telos Corporation",
  "companyTicker": "TLS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/telos-corporation-tls-q2-2022-earnings-call-transc/",
  "content": "Telos Corporation (TLS 0.99%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Telos Corporation second quarter 2022 earnings conference call. [Operator instructions] I would now like to hand the conference over to your speaker today, Christina Mouzavires. Please go ahead.\n\nChristina Mouzavires -- Investor Relations\n\nGood morning. Thank you for joining us to discuss Telos Corporation's second quarter 2022 financial results. With me today is John Wood, chairman and CEO of Telos; and Mark Bendza, executive vice president and CFO of Telos. Let me quickly review the format of today's presentation.\n\nJohn will begin with brief remarks on our 2022 second quarter results and Telos' strategic priorities, and Mark will cover the financials and guidance for third quarter fiscal year 2022. Then we'll open the line for questions and answers where Mark Griffin, executive vice president of security solutions, will also join us. The earnings press release was issued earlier today and is posted on the Telos investor relations website, where this call is being simultaneously webcast. Additionally, we have provided presentation slides on our investor relations website.\n\nBefore we begin, we want to emphasize that some of our statements on this call are forward-looking statements and are made under the safe harbor provisions of the federal securities laws. These statements are based on current expectations and assumptions that are subject to risks and uncertainties. Actual results could materially differ for various reasons, including the factors described in today's earnings press release and the comments made during this conference call and in our SEC filings. We do not undertake any duty to update any forward-looking statements.\n\nIn addition, during today's call, we will discuss non-GAAP financial measures, which we believe are useful as supplemental and clarifying measures to help investors understand Telos' financial performance. These non-GAAP financial measures should be considered in addition to and not as a substitute for or in isolation from GAAP results. You can find additional disclosures regarding these non-GAAP measures, including reconciliations and comparable GAAP results in our earnings press release and on the investor relations portion of our website. Please also note that financial comparisons are year over year unless otherwise specified.\n\nThe webcast replay of this call will be available for the next year on the company's website under the investor relations link. With that, I'll turn the call over to John.\n\nJohn Wood -- Chief Executive Officer and Chairman\n\nThank you, Christina. And good morning, everyone. Let's begin today on Slide 3. I'm pleased to report that Telos overdelivered again on key financial metrics in the second quarter of 2022.\n\nMark will discuss our financial performance later on this call. But at a high level, we delivered $55.8 million of revenue in the second quarter, above our guidance range of $50 million to $54 million, up 4% year over year and 11% sequentially. Gross margin was 37.5%, above our guidance range of 33% to 35%. Finally, we delivered $4.5 million of adjusted EBITDA, above the high end of our guidance range of negative $2 million to positive $2 million and $0.04 of adjusted EPS.\n\nNow, let's turn to Slide 4 to discuss our recent business highlights and updates. This quarter, we announced a new strategic partnership with IBM. Telos is the launch partner for the new Active Governance Service, or AGS offering, with IBM Security. Telos and IBM are teaming to provide capabilities to address the significant challenges organizations are facing with cybersecurity and risk compliance.\n\nAGS is a unique and comprehensive offering, coupling coupling the exact suite of tools with IBM's services and security expertise to significantly improve the efficacy and efficiency of clients' approach to cybersecurity risk management in today's increasingly challenging cyber environment. Target customers include large enterprise organizations in global markets, such as financial services, healthcare, telecommunications, and energy. We are very excited about this opportunity to partner with IBM, a leading global organization that brings recognized thought leadership and leading capability in the cybersecurity management space. This relationship also enables us to effectively broaden our reach in the global marketplace for sales of our Xacta suite of tools to drive future growth for Telos.\n\nBeyond the IBM partnership, we've continued to maintain momentum in the current environment. Within the security solutions business, Telos received exact renewals with several key customers, including the Central Intelligence Agency, the U.S. Department of the Interior, the U.S. Environmental Protection Agency, a U.S.\n\nFederal Reserve bank, and the U.S. Department of Energy, as well as Salesforce. The company was also awarded new contracts with a foreign government customer, the U.S. Army Space and Missile Command, the U.S.\n\nDepartment of Homeland Security, Palantir Technologies, and OmniHealth. We continue to focus on the government and commercial space, and, in particular, prioritizing regulated industries. The company also received an important ghost renewal with a classified customer to continue providing support. Additionally, we were awarded up to a 10-year contract to continue and expand our aviation security practice with the U.S.\n\nTransportation Security Administration. Our ONYX technology won first place in the Mobile Fingerprint Information Challenge hosted by the National Institute of Standards and Technology. Finally, the secure networks business continued to add to its backlog with new wins, including a new contract to support the U.S. Air Force SIPRNet Enterprise Modernization.\n\nLet me turn now to some comments on the industry landscape and a number of recent initiatives in Washington, D.C. that presents opportunities for Telos. There are indications that Congress plans to boost spending above the level called for by President Biden in his proposed FY 2023 budget. The House and Senate versions of the Annual Defense Authorization Bill provides for increasing topline defense spending, respectively, $37 billion to $45 billion above the level proposed by the president.\n\nWe still have to see how the appropriations process plays out this fall to know how much funding will actually be provided for our military customers. But signs are there that the FY 2023 defense budget will see a meaningful increase. On the nondefense side, as with defense, we will have to wait for Congress to agree on appropriations legislation. But so far, the spending bills under consideration reflect a consensus that more funding is needed for cybersecurity throughout the various departments and agencies.\n\nA great example of this is with CISA, the Department of Homeland Security's cybersecurity agency. CISA works to detect and mitigate the effects of cyberattacks on federal, state, and local governments, and the private sector, and then manage cyber risks to our critical infrastructure. We understand that, recognizing the importance of this mission, the draft Senate Appropriations Bill for DHS seeks to give CISA a 16% increase above last year's funding. Congress clearly recognizes that more resources are needed by federal departments and agencies to combat challenges they face in the cyberspace.\n\nA major factor in that thinking is the Ukraine situation, which has resulted in continued warnings of potential cyberattacks against U.S. interests, including against U.S. critical infrastructure. So far, the United States has done an excellent job in preventing what had been expected to be widespread impacts from cyberattacks in retaliation for our support for Ukraine.\n\nThe policymakers and companies like ours know that the public and private sectors can't let up, and they must continue to follow cybersecurity best practices, including deploying and updating effective cyber defenses. I will now turn the call over to Mark, who will discuss second quarter 2022 financial results and our guidance for the third quarter and full year 2022. Mark?\n\nMark Bendza -- Chief Financial Officer\n\nThank you, John, and thank you, everyone, for joining us today. Let's turn to Slide 5. As John mentioned, we delivered a strong second quarter, with results that exceeded our guidance on key financial metrics. We reported revenue, gross margin, and adjusted EBITDA above the high end of our guidance range.\n\nWe also delivered $5.4 million of free cash flow, representing a nearly four-fold increase in free cash flow year over year. Before I turn the year-over-year comparison, I just wanted to remind everyone again, as I did in our last earnings call, that we had a large delivery on a lower-margin program in our secure networks business last year that's pulled forward from the second quarter of 2021 to the first quarter of 2021 per the request of our customer. The accelerated delivery caused with secure networks contribution to total revenue to shift from 60% in the first quarter of 2021 to 40% in the second quarter of 2021 and gross margin to shift from 25.9% in the first quarter of 2021 to 42% in the second quarter of 2021, thereby skewing some of the second quarter year-over-year comparisons this year. So, I will provide year-over-year comparisons for the second quarter as usual and also for the first half overall to normalize for the accelerated shipment from the second quarter to the first quarter of last year.\n\nOK, with that backdrop, I will go into details. For the second quarter, total sales were $55.8 million, up 11% sequentially and up 4% year over year. Performance of the high end of the guidance range of $50 million to $54 million was driven by favorable timing variances and pre-existing higher-margin programs in security solutions and strong supply chain management in secure networks. Security solutions sales were $30.8 million, up 15% sequentially and down 4% year over year, due to lower revenues on a classified program and the completion of the U.S.\n\nCensus program, partially offset by growth in other pre-existing programs. Secure network sales were $25 million, up 7% sequentially and up 17% year over year, due to continued strong supply chain management, higher revenues on major programs and favorable year-over-year comparison due to the previously mentioned large delivery that pulled forward from the second quarter of 2021 to the first quarter of 2021. Turning to profitability and cash flow, second quarter gross margin was 37.5%, above our guidance range of 33% to 35%, primarily due to the margin outperformance in security solutions. Gross margin contracted 449 basis points year over year, and gross profit declined 7%.\n\nThe gross margin contraction was driven by a less favorable sales mix between security solutions and secure networks compared to last year, as well as gross margin contraction within secure networks, both of which were the result of the previously mentioned early shipments in 2021. Security solutions revenues as a percentage of total company revenues declined from 60% in 2021 to 55% in 2022. And secure networks gross margin contracted nearly 700 basis points to 18%. Security solutions gross margins held constant at 53.3%.\n\nAdjusted EBITDA declined by approximately $700,000 due to lower gross profit, partially offset by lower below-the-line expenses. Free cash flow improved nearly four-fold to $5.4 million. The improvement in free cash flow continued the trends from the first quarter of more favorable working capital dynamics compared to last year and created an opportunity to begin returning capital to shareholders. On May 24th, we announced that our board of directors authorized a share repurchase program for up to $50 million of the company's stock.\n\nDuring the second quarter, we deployed $3 million to repurchase over 360,000 shares at a weighted average price of $8.33, and we have continued repurchasing stock daily during the third quarter. During the third quarter till last Friday, we deployed an additional $1.1 million to repurchase nearly 143,000 shares at a weighted average price of $7.86. Now, let's recap on the first half overall to normalize for the accelerated shipments from the second quarter to the first quarter of 2021. First half revenues declined 3%.\n\nSecure networks revenues declined 11%, as expected due to the headwind associated with the ongoing wind down of two large programs in 2022. Security solutions revenues grew 5%, primarily due to the ramp up of a confidential program. First half gross margin expanded 374 basis points to 37.6% and gross profit increased 8%. The gross margin expansion was driven by a more favorable sales mix within security solutions and secure networks, as well as gross margin expansion within security solutions.\n\nSecurity solutions revenues as a percentage of total company revenues increased from 50% in 2021 to 54% in 2022. And security solutions gross margin expanded 638 basis points to 54.5% due to the ramp of high-margin programs. Secure networks gross margin contracted 206 basis points to 17.2%. Adjusted EBITDA declined $1.3 million due to higher SG&A, offsetting $2.8 million of higher gross profit.\n\nLastly, free cash flow was $10.3 million higher due to favorable working capital dynamics, driving significantly better cash flow from operations in the first and second quarters. Overall, our first half has performed ahead of forecast and guidance, primarily due to favorable timing differences -- variances between the second half and the first half in orders and deliveries on pre-existing programs and diligent supply chain management. Now, let's turn to Slide 6 to discuss our outlook for the third quarter. For the third quarter, we forecast sales in a range of $58 million to $62 million, up 4% to 11% sequentially and down 10% to 15% year over year.\n\nWe forecast security solutions revenues to be down mid- to high-teens year-over-year, primarily due to the completion of the 2020 Census program in 2021, lower orders expected on a single pre-existing program, and lumpiness of perpetual licensing. We continue to make good progress on the TSA PreCheck program, but revenues for this program in 3Q, if any, are expected to be de minimis. We expect secure networks revenues to be down mid-single digits to mid-teens year over year due to the ongoing wind down of two large programs coming to a successful completion. We expect gross margins to be down approximately 350 basis points to 500 basis points year over year, primarily due to a slightly lower weighting of revenues to our higher-margin security solutions segment and revenue within both security solutions and secure networks mixing lower in the quarter.\n\nBelow-the-line expenses, excluding stock compensation expense, are expected to be approximately $1 million higher due to the ramp of R&D and G&A investments during 2021. Adjusted EBITDA is expected to be $3.5 million to $5 million, representing a 6% to 8% mark. Now, let's turn to Slide 7 to discuss our updated outlook for 2022. For the full year, we have narrowed our revenue range from our prior guidance of $226 million to $257 million to our updated range of $226 million to $242 million.\n\nThere is no change to the low end of the revenue range. Reduction at the high end of the range reflects lower assumption on TSA PreCheck revenues and new business in the second half, partially offset by higher revenues on pre-existing programs within security solutions. We have lowered and widely narrowed our adjusted EBITDA range from our prior guidance of $21 million to $28 million to our updated range of $18 million to $24 million. The reduction at the high end of the range reflects our -- reflects lower gross profit associated with the corresponding revenue reduction, partially offset by lower than previously forecasted below the line expenses.\n\nThe reduction at the low end of the range primarily reflects the impact of lower than previously forecasted gross margins on secure networks in the second half, including on new business. Overall, we have performed ahead of forecast in the first half. Our core business is performing well, and we expect that to continue. Pre-existing programs are performing well.\n\nSequential sales growth is expected to continue into the third and fourth quarters as originally planned. And we are taking a slightly more cautious approach to new business in the second half in part as a result of the more complex macro environment, which could create some headwinds for our new business growth initiatives in the short term. With that, I will pass it back to John who will wrap up on Slide 8.\n\nJohn Wood -- Chief Executive Officer and Chairman\n\nThanks, Mark. In summary, we delivered a solid second quarter during which we formed a new strategic partnership with IBM and outpaced guidance on our key financial metrics. We also delivered gross margin expansion and strong free cash flow in the first half of the year and have begun to return free cash flow to shareholders through share repurchases. Our core business and pre-existing programs are performing well, and we expect that to continue for the balance of the year.\n\nWe are taking a slightly more cautious approach to new business in the second half of the year and are managing our forecasting expenses accordingly. With that, we are happy to take questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of that Zach Cummins with D.A. Davidson -- oh, I'm sorry, with B. Riley. Your line is open.\n\nPlease go ahead.\n\nZach Cummins -- B. Riley Financial -- Analyst\n\nYeah. Thanks. Good morning. Hi, John.\n\nHi, Mark. Thanks for taking my questions. Mark, I -- my question is really geared toward the updated guidance for the year. I mean, can you give a little more granularity around the assumptions you are making for TSA PreCheck and maybe why you are taking a slightly more cautious approach to new business wins here in the second half of the year?\n\nMark Bendza -- Chief Financial Officer\n\nYeah. Sure, Zach. Thanks for your question. So, why don't I dissect that a little bit for you? So, at the high end of the guidance range, we are taking sales down by $15 million, $11 million of the $15 million is PreCheck net revenue.\n\nSo, we previously assumed $12 million of net revenues for PreCheck at the high end of the guidance. Now we are assuming $1 million. You know, the PreCheck process is progressing well. Obviously, we don't have the ATO yet, and so we felt it appropriate to take that guide down.\n\nBut certainly, wanted to leave revenue in there as a recognition that we still expect the ATO this year. The balance of the $4 million, the other $4 million, is really net reductions across the rest of the portfolio, primarily driven by lower assumptions on new business in the second half. The thought there is, even though we are not seeing impact from the more complicated macro environment right now in our core business, our core business is performing very well. It's not being impacted by the macro environment and you are seeing that in the second quarter results.\n\nBut we wanted to acknowledge at least as we scrub the forecast for PreCheck, we wanted to take a broader look at some of the higher risk items in the forecast. For example, anywhere where we are selling new solutions for pre-existing solution to new customers in new end markets, we wanted to take a slightly more cautious approach there. So, that's the $4 million of additional net reduction. To put that in perspective, at the midpoint of the range, that would represent about 80 basis points of year-over-year growth.\n\nSo, a very modest reduction as a nod, in part, to the macro environment, but very modest, nonetheless. On adjusted EBITDA at the high end of the guidance, we are taking by $4 million. That is the reduction in the gross profit corresponding to the revenue reduction, partially offset by reduction in below-the-line expense. And then at the low end, no change to sales.\n\nBut what you are seeing in the 3 million of lower adjusted EBITDA is lower gross margin on secure networks, primarily in new business in the second half.\n\nZach Cummins -- B. Riley Financial -- Analyst\n\nUnderstood. That's helpful. Much appreciated and best of luck in the coming quarter.\n\nJohn Wood -- Chief Executive Officer and Chairman\n\nThanks a lot.\n\nMark Bendza -- Chief Financial Officer\n\nThanks, Zach.\n\nOperator\n\nOur next question comes from the line of Rudy Kessinger with D.A. Davidson. Your line is open. Please go ahead.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nHey, guys. So, just following up on that question there, I guess, the $4 million reduction at the top end, I am just more conservative ex-TSA and the rest of the portfolio. I guess, I would just ask, you know, the channel and the direct sales reps, are they meeting your expectations from, say, the start this year on pipeline build in sales production as we get into the second half year? And then, secondly, on IBM, do you have anything incremental baked into the guide this year for IBM? And I guess just bigger picture, how big of a driver or growth -- how much can IBM be, say, in maybe 2023?\n\nJohn Wood -- Chief Executive Officer and Chairman\n\nHey, Rudy. This is John. I will take first -- I will take the second question and I will ask Mark Griffin to answer the first one. As it relates to IBM, we have a couple of hundred thousand dollars in our model for purposes of this year.\n\nAs it relates to the -- how big it can be, we think it could be quite sizable. And that's not a good -- that's not me able to give you -- I am not able to give you a modeling perspective as yet. What I can say, however, is that the their pipeline is filling up quite rapidly with what I would consider to be Tier 1 names, you know, large car manufacturers, large banks, large pharmaceutical companies, countries, etc., places that, I think, would be very difficult for us to get into on our own. And really what's happened is that they have embedded Xacta as their launch partner in their Advanced Governance Solutions.\n\nSo, I think it's got a lot of potential in front of us. As we put out our guide for 2023, I am sure we will give you much greater detail. But I am quite happy with how the -- how that relationship is really coming out in a fully blossoming way, much like I had hoped it was going to be with the cloud service providers, but they have been quite, as you are well aware, slower. So, here, IBM has completely embraced it.\n\nThey are also looking at using it internally. So, I think there is a great opportunity for us with IBM, you know, in over the next five years to 10 years. And, Mark, if you don't mind, can you answer the first question on the salesforce?\n\nMark Griffin -- Executive Vice President of Security Solutions\n\nSure. Hello, Rudy. Mark Griffin. Commercial adoption is happening.\n\nBut obviously, we took a more cautious and slower approach than initially planned. We are ongoing and continuing to fine-tune the staff, not only in the sales area but also increase the capture in business development areas to achieve operational efficiencies and maximize our potential. So, yes, we are seeing progress. The pipeline is increasing.\n\nWe are seeing some opportunities that will close in late Q3 and in Q4. But we continue to fine-tune that staff and look for additional opportunities and growth from additional -- look across operations in the sales and capture BD areas.\n\nJohn Wood -- Chief Executive Officer and Chairman\n\nOK.\n\nOperator\n\nThank you. And our next question comes from the line of Alex Henderson with Needham and Company. Your line is open. Please go ahead.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nThanks. I am going to break little bit, just ask two questions. One, just why you think there's any improvement in TSA. The primary question is on the Xacta.\n\nIt's very difficult looking at the numbers to cut through the noise and understand exactly what's going on with the product. Can you give us some sense of what the growth rate based on your current guide is for Xacta on a full year basis? Is it actually producing, you know, double-digit growth? Is it flat? Is it up 20%? What -- can you just give us some parameters around what the true underlying growth rate is because it's kind of lost in the numbers?\n\nMark Bendza -- Chief Financial Officer\n\nYeah. Hey, Alex. It's Mark. So, on our information assurance business for '22, I mean, as you know, we don't guide at that level.\n\nBut I would say, we are probably going to end somewhere in the -- we are probably going to be somewhere in the, call it, low to mid single digits on the year, say, mid single digit on year, higher at the high end of the range but, call it, midpoint -- kind of mid single digits.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nAnd the reason for the TSA optimism that it actually was going to close, I mean, you thought it was going to close in September, then you thought it was going to close at the end of the year. Now, we are still thinking it's somehow going to close and that it's improved. What makes you think that?\n\nMark Griffin -- Executive Vice President of Security Solutions\n\nSure, Alex. This is Mark Griffin. So, ultimately we follow TSA guidelines and schedule for launch. We are engaged with them extensively on a daily basis going through their launch plan and their security approvals.\n\nWe are getting to the end of that schedule. And we are in this process now deploying to our enrollment sites and gearing up training and operational enrollment capabilities for those site. So, every indication is we are following TSA schedule. They're positive on our results at this point and we fully expect to launch this year.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nSo, just so I understand, when you say gearing up training, they have been instructed you to train your employees and they are -- they understand that that's an expense you are carrying and therefore they wouldn't stretch that --\n\nMark Griffin -- Executive Vice President of Security Solutions\n\nSo, look --\n\nAlex Henderson -- Needham and Company -- Analyst\n\nThey wouldn't ask you do that it would if it wasn't imminent. Is that the right way we should be reading that?\n\nJohn Wood -- Chief Executive Officer and Chairman\n\nYeah. Would you explain a little more about --\n\nMark Griffin -- Executive Vice President of Security Solutions\n\nSure. Alex, yeah, the entire program is under guidance and policy and procedures from TSA. So, every aspect of the program is reviewed and approved by TSA. And so, everything we do from approval of sites, to training of personnel, to our soft launch, to our security process and procedures are all controlled by TSA.\n\nSo, yes, TSA reviews every document. There are contractual delivery -- deliverables that we have to adhere to on every aspect of this launch. So, yes, TSA is the ultimate approver of when we launch, but we are meeting their schedules. And we are doing everything that they are asking in the time frame.\n\nThey are asking for a launch this year.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nThank you. And our next question comes from the line of Nehal Chokshi with Northland Capital Markets. Your line is open. Please go ahead.\n\nNehal Chokshi -- Northland Securities -- Analyst\n\nYeah. Thank you, and congrats on the solid results and commend you, Mark, on especially a clear guidance deck. Thank you very much for that. Where are you guys in terms of percent of software billing sold on a term basis versus perpetual basis now and relative to the one, two, and four quarters ago?\n\nJohn Wood -- Chief Executive Officer and Chairman\n\nThat's a good question. I would say, the majority of what we are selling now, Nehal, is subscription or term versus perpetual. And that's true in our pipeline as well that the vast majority of our pipeline are subscription-oriented. There are a couple of exceptions.\n\nYou know, there are a couple of government examples that are exceptions, but the vast majority of the remaining pipeline, whether you are talking about ACA or Ghost or you are talking about Xacta, there are going to be subscription-based or term-based licenses versus perpetual.\n\nNehal Chokshi -- Northland Securities -- Analyst\n\nOK. Great. And how much of an impact does that transition have on the projection of low-to mid-single-digit growth for Xacta?\n\nJohn Wood -- Chief Executive Officer and Chairman\n\nIt has a -- it definitely has an impact. I don't know the number off the top my head. But in the past, when we would do, say, we did $6.5 million in revenue. That was all perpetual.\n\nMy guess right now is we are at about 60% or 50% perpetual currently. And I think going forward, it's going to be -- the vast majority is going to be term or subscription.\n\nNehal Chokshi -- Northland Securities -- Analyst\n\nAnd then to be clear, what is -- for every dollar of perpetual that's capitalized into term, what is that --\n\nJohn Wood -- Chief Executive Officer and Chairman\n\nBasically -- what that basically means is, if I am delivering on a $6 million number for the year and it's all term, I have got to deliver $12 million of orders by no later than June 30th.\n\nNehal Chokshi -- Northland Securities -- Analyst\n\nGot it. Great. Thank you. And then my last question is that, Mark you alluded to in terms of a more cautious outlook on the macro being part out for the $15 million takedown on the high end of the guidance, but that you are not seeing any impact yet.\n\nWhy do you think you are not seeing any impact yet?\n\nMark Bendza -- Chief Financial Officer\n\nCorrect. So, what I am distinguishing between there is our core business. Our core business has been very strong through the first half of the year and including in the second quarter as the macro became choppier. So, we are not seeing any impact there.\n\nI think it's really just the nature of our portfolio and the customers and markets that we serve. And then, for the second half, again, slightly outside of our core business where we are selling either new solutions or pre-existing to new end markets and customers, we just wanted to take a finer point on that forecast. And again, the net effect is only 80 basis points of year-over-year growth.\n\nNehal Chokshi -- Northland Securities -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And our next question comes from the line of Brad Clark with BMO. Your line is open. Please go ahead.\n\nBrad Clark -- BMO Capital Markets -- Analyst\n\nHi. Thanks for taking my question. I want to ask a question about the sort of new business slowdown included in the guide and sort of more of a clarification. And what I am trying to understand is, the deals out there that are sort of being pushed back, either by the customers or from, you know, Telos' perspective given the sort of proposed margin profile and it's more not so good business? Or is it, yeah, it basically trying to understand between those two, more from the customer side or from Telos' side to sort of push back and delay the new business? That's it from me.\n\nThank you.\n\nJohn Wood -- Chief Executive Officer and Chairman\n\nSo, it depends on the customer's side, Brad. The government's side is always -- it takes longer than people think. And that, we have mainly built into our guide. On the commercial side, I think, we are actually having success.\n\nBut what's happening is they are starting small and building out over time. So, you know, we landed another commercial customer in this quarter. It started out being a, you know, six-digit, if you will, starting place for it, but we expect it to be more like a seven-digit-plus opportunity for us per year as they roll out Xacta throughout their offerings. So, I would say that on the commercial side, there is more of a try it and buy it.\n\nYou know, they are going to buy it small and then build out over time. Whereas in the markets that were more well known as in the federal government, there is some level of doing a, you know, pilot, but it's a much more controlled pilot and it typically has a very, very specific beginning, middle, and an end. And there, the customers will go to an enterprisewide license more quickly just based on the reputation that we have.\n\nOperator\n\nThank you. And we do have a follow-up question from the line of Alex Henderson with Needham and Company. Your line is open. Please go ahead.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nGreat. Thank you very much. So, I was hoping you could talk a little bit about what's going on with the voice-over AWS and as your big chunk of the story when you guys came out was that those guys were going to be reselling it starting kind of in the beginning of this year and that they thought it was a big driver of acceleration of the -- their services business, yet, that doesn't seem to be materializing. Can you talk about what the environment is there and why it's taking so long or not metastasizing?\n\nJohn Wood -- Chief Executive Officer and Chairman\n\nMetastasizing. That's a good word. Thank you, Alex. I think it is taking longer.\n\nIt is frustrating. They continue to use it internally. There are pockets of the organization that still want to build their own capabilities. And it is moving but slowly.\n\nWhereas on the other hand, you know, IBM made the -- made the decision not to build but to buy, you know, using Xacta as their launch partner. And so, there we have a situation that a service provider is using us in the way that I was hoping the cloud providers are going to use us. It doesn't mean the cloud providers aren't going to get there, it's just that they have not got there yet. They do continue to use us.\n\nThey continue to use us more and more. On the recent -- one of the recent awards we had that we haven't announced the name on, it started out in the intelligence community. They see the value of the intelligence community. Now, they are bringing us into their Department of Defense side of the business.\n\nAnd then, ultimately, we want to be in a commercial world. So, each of the cloud providers has looked at it and gone about it in a little bit of a different way. In the case of Azure, there has been quite a bit of turnover on the security and compliance side of their house. So, we have had to sort of start over in the case of Azure.\n\nAnd so, each cloud provider has, you know, a little bit of a story associated with it. But it is frustrating.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nSimilarly, can you talk a bit about the Ghost product and the, you know, progress or what's going on there in terms of commercializing it into a product that's used outside of the government security infrastructure play?\n\nJohn Wood -- Chief Executive Officer and Chairman\n\nSure. And actually, you made a comment that I'd like to extend a little bit. One of the things that we have learned about our Xacta is that, you know, it's in the language of the government. And one of the things that we have to do is we have had to really change verbiage, how we describe things that we do inside of Xacta.\n\nAnd I will give you an example. There is something called a POAM in the government world. POAM doesn't mean anything to the commercial guys. Remediation is the commercial equivalent of a POAM.\n\nSo, we had to make changes in the product itself that more reflected what it is that the commercial world wanted, which was also something that we had to build in. As it relates to the -- as it relates to Ghost, we have continued to -- we have got continued progress with JCI offering Ghost as an embedded option with their cameras. Those cameras will, if you will, be hidden on the internet. And their security product sales continue to be a very healthy growing business.\n\nWe expect a small level of sales out of that to happen late this year with this offering. And again, you have had some -- not turnover but promotions over there. So, getting it off the ground has just taken longer than we would have liked. Having said that, there are other organizations that are looking to do very similar things with JCI, and we are in the midst of negotiating those -- with those other players.\n\nAnd our hope is that we will be able to roll out some other announcements, you know, about how we are building that capability inside of these other players. Now, just to remind you, what we do with advanced cyber analytics is all of that activity is hidden behind Ghost as well. So, there is a -- there are opportunities for us with Ghost, both within our existing customer set, as well as selling through other players.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nSince we are going around into the second round of questions, I am going to ask one more, if it's OK. If not, then just let me know. But I was hoping you could talk a little bit about the security networking business. It sounds like some projects were pulled forward in that business into the first half and, you know, just the favorable timing comment.\n\nDoes that mean that you are expecting little less in the back half of the year from security networks?\n\nMark Griffin -- Executive Vice President of Security Solutions\n\nSo, not in secure networks. The dynamic within secure networks, the team there is doing a really terrific job of managing their supply chain risk. And so, when we set guidance we account for their supply chain risk in guidance and they have been outperforming that risk. So, the program management teams there are doing a terrific job and outperforming guidance.\n\nThe pull-forward, I think, that you are referencing is more or less security solutions side. We did have some higher margin order on one program in particular within that business that came into the second quarter that we were otherwise expecting to more so come in the second half. So, that's the favorable --\n\nAlex Henderson -- Needham and Company -- Analyst\n\nMark, but -- but if you pulled forward the availability of supply then you deployed products sooner than expected. Doesn't that come out of your pipeline?\n\nMark Griffin -- Executive Vice President of Security Solutions\n\nI am not sure I understand the question.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nYou have got an order from a government agency to deploy a, I don't know, choose a location --\n\nMark Griffin -- Executive Vice President of Security Solutions\n\nOh. Are you talking about last --\n\nAlex Henderson -- Needham and Company -- Analyst\n\nAnd you told them you can't deploy because you don't have the product --\n\nMark Griffin -- Executive Vice President of Security Solutions\n\nAlex, I think you're referring to last year.\n\nAlex Henderson -- Needham and Company -- Analyst\n\n[Inaudible]\n\nMark Griffin -- Executive Vice President of Security Solutions\n\nYou are talking about the pull-forward last year in 2021, the pull-forward on the secure networks --\n\nAlex Henderson -- Needham and Company -- Analyst\n\nNo. I am not. Mark, I am talking about the current environment. You used that as an example because they could not know specifically which projects were involved.\n\nBut you have a pipeline of business that you need to deploy gear for in order to get the revenue. If you get the parts sooner than expected then that reduces your pipeline into the forward period, correct?\n\nJohn Wood -- Chief Executive Officer and Chairman\n\nThat assumes that the pipeline is static, Alex. So, the pipeline is not static.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nOK. So, there's no erosion in the outlook for the back half of the year within that because of the pull-forward of parts?\n\nJohn Wood -- Chief Executive Officer and Chairman\n\nNot the revenue line.\n\nMark Griffin -- Executive Vice President of Security Solutions\n\nCorrect.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nThank you. That's what I was looking for.\n\nMark Griffin -- Executive Vice President of Security Solutions\n\nYeah. Thanks, Alex.\n\nOperator\n\nThank you. And I am showing no further questions. And I would like to turn the conference back over to John Wood for any further remarks.\n\nJohn Wood -- Chief Executive Officer and Chairman\n\nOh. Thank you very much, operator. Well, first, I really well thank our shareholders for your ongoing support. And, you know, despite the current environment, I am pleased with our recent performance.\n\nAnd while our year-to-date has progressed as we have expected, we are taking a balanced approach to the second half. And we remain very focused on delivering for our customers and our shareholders. And, again, I just want to say thank you to all of you for listening and to the analysts for asking questions and covering our stock. Thanks a lot, everybody.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChristina Mouzavires -- Investor Relations\n\nJohn Wood -- Chief Executive Officer and Chairman\n\nMark Bendza -- Chief Financial Officer\n\nZach Cummins -- B. Riley Financial -- Analyst\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nMark Griffin -- Executive Vice President of Security Solutions\n\nAlex Henderson -- Needham and Company -- Analyst\n\nNehal Chokshi -- Northland Securities -- Analyst\n\nBrad Clark -- BMO Capital Markets -- Analyst\n\nMore TLS analysis\n\nAll earnings call transcripts"
}