{
  "companyName": "Harley-Davidson",
  "companyTicker": "HOG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/harley-davidson-hog-q3-2022-earnings-call-transcri/",
  "content": "Harley-Davidson (HOG 1.46%)\nQ3 2022 Earnings Call\nOct 26, 2022, 9:00 a.m. ET\n\nOperator\n\nThank you for standing by, and welcome to the Harley-Davidson 2022 third quarter investor and analyst conference call. Please be advised that today's conference is being recorded. Thank you. I would now like to hand the conference over to Shawn Collins.\n\nPlease go ahead.\n\nShawn Collins -- Director of Investor Relations\n\nThank you. Good morning. This is Shawn Collins, the director of investor relations at Harley-Davidson. Welcome to our Q3 2022 earnings call.\n\nYou can access the slides supporting today's call on the Internet at the Harley-Davidson investor relations website. As you may expect, our comments will include forward-looking statements that are subject to business risks that could cause actual results to be materially different. Those risks include, among others, matters we have noted in our latest filings with the SEC. Joining me this morning are chief executive officer, Jochen Zeitz; and chief financial officer, Gina Goetter; in addition, chief commercial officer, Edel O'Sullivan, will join for the Q&A portion of today's call.\n\nWith that, let me turn it over to our CEO, Jochen Zeitz.\n\nJochen Zeitz -- President, Chairman, and Chief Executive Officer\n\nThank you, Sean, and good morning, everyone. Thank you for joining us today. Harley-Davidson delivered a strong third quarter, and we are very pleased with our performance despite the supply chain challenges we experienced especially early in the quarter due to the production suspension. We believe we are well positioned to achieve our guidance for this year and tackle and adjust to changes in the market environment to achieve our Hardwire Stage II plans.\n\nThe strength and desirability of the Harley brand continues to grow, and in uncertain times, we believe it's the strong brands powered by strong communities that are able to deliver better results. Harley-Davidson is the epitome of a powerful brand as the most desirable motorcycle company in the world. In May, we laid out our ambitions for future growth, and we continue to deliver against our 5-year Hardwire strategic plan, focusing on our pillars of profit, selective expansion and redefinition, leading in electric, growth beyond bikes, integrated customer experience and inclusive stakeholder management. As you can see from today's results, HDMC posted revenue growth this quarter with both profitable unit growth and pricing driving a 24% increase.\n\nEqually, we are very pleased with the strong operating income margin growth. We've seen growing 9.5 points to 17.9% versus last year, which we believe is a solid indicator that we have the right strategy in place to deliver long-term profitable growth at Harley-Davidson. Additionally, shipments for the quarter were up 19%, as we largely recovered from the unplanned production suspension experienced earlier in the summer. We believe that the success of our Hardwire strategy with a focus on our core segments is evidenced by the per unit profitability that Gina will talk about later.\n\nTo deliver this, we believe that as the most desirable motorcycle company and brand in the world, we needed to be shifting the traditional sole industry focus away from units to desirable and profitable revenue when compared to the past. We are particularly pleased with the profitability we were able to deliver in the quarter, aligned to the Hardwire strategic focus. It's important to note that when looking at the results of the quarter, we believe that the demand we saw as the quarter unfolded, displayed ongoing strength, and importantly, that our retails were impacted most by supply. As we were able to have inventory flowing more normally through the dealer channel, we saw overall retail beginning to turn positive year on year for North America and other key geographies.\n\nAligned to profit focus on our core segments and expanding from our successful product launch this spring, in August, as the Sturgis Motorcycle Rally, we introduced a new offering of Apex factory custom paint across select '22 Grand American Touring models. Inspired by the century old rating legacy Harley-Davidson and paying tribute to the legendary Harley-Davidson XR750 motorcycle, Apex Paint is applied with exceptional scale by our in-house teams at Juneau and Tomahawk, demonstrating the talent of our specialist here in the U.S. We've seen a strong riding in community response to these bikes and will continue to evolve our paint offerings going forward. With a Hardwire, we made a commitment to introduce a series of motorcycles that align with our strategy to create iconic motorcycles, celebrating the legacy and leadership of Harley-Davidson.\n\nThe Icons Collection presents one or two models annually with a single production run for each model. Production of that motorcycle will never be resumed or repeated. Building on the success of our previous Icon, the Electra Glide Revival, this September, we launched the limited edition Low Rider El Diablo. Inspired by an American West Coast custom styling trend, the Low Rider El Diablo combines lean performance at sport touring versatility with a stunning panel hand-applied paint scheme.\n\nWe've seen a great response to the bike with it becoming our fastest selling motorcycle in the third quarter, and we're excited about the future of the Icons Collection within our product lineup as we enter the 120th anniversary of Harley-Davidson next year. In our May analyst and investor meeting, we set out our ambitions under the growth beyond bikes pillar, with an increased focus on apparel and licensing as a new key driver of our Harley-Davidson lifestyle. Since then, we've been building our core apparel and licensing competency, including creating a best-in-class in-house team to be able to deliver on this ambition long term. We saw a strong growth of the AML function this quarter with 41% growth in apparel and 26% growth in licensing.\n\nAnd we remain confident that in the long term, we can continue to grow this part of our business, further driving the desirability of our brand and motoculture lifestyle for riders and non-riders alike. Over the course of the third quarter, we continue to make rapid progress on the evolution of the customer and dealer experience. In the U.S., we continue to expand our sole bike order process, which has grown 300% versus last year, with 98% of the network now engaged. Alongside this, as we work through supply disruptions to deliveries, we added new functionality to provide better visibility and communication to dealers and customers on the status of their bikes.\n\nAs discussed earlier in the year at our investor day, we started to pilot the modernized distribution system with faster access to product that will support growth with a more restrained inventory model supporting profitability and improving the ability to meet customers' needs for specific bike. As also said in the May investor day, we formally launched our facility upgrade program, Project Fuel globally, with 10% of the North American network signed up to start in the first wave. This is a big investment plan for a global dealer base at a total value of approximately $2 billion in the U.S. alone, but it is a truly critical effort that is long overdue and a testament to our combined belief in the health and profitability potential for our business across both existing and new customer segments and products.\n\nAdditionally, we've launched service business consultants and a new service schedule to lead form to drive growth of in-network service activity. Importantly, our focus was not just in North America. In APAC, we expanded our customization kits program supported by a new digital experience with a 30% growth in the number of kits purchased by dealers. Finally, we continue to be enormously proud of the flexibility, adaptability and partnership with our dealers as we work through a difficult year for supply and as we pilot new approaches.\n\nThe ability to stay engaged with our most loyal and new customers to support demand late in the season their strong service reach and technical expertise and their investment in experience and community demonstrate that we have a strongest and most effective network in all of power sports. As an integral part of our Hardwire strategy, in July, we celebrated the 1-year anniversary of HD-1 marketplace, our preowned platform. Today, the site hosts more than 30,000 motorcycle listings, including over 2,000 Harley-Davidson certified bikes, making it the leading online platform for used Harley-Davidson motorcycles in the U.S. Since launch, we've seen nearly three million visits to the site, increasing the visibility into the pre-owned market for both our customers and our dealers.\n\nTwo recent additions to the platform have been the inclusion of non-Harley-Davidson bikes widening our reach and prequalification, making it easier for our customers to find and finance their purchase. We will continue to invest in the site and enhance the offering, ensuring that with marketplace to position harleydavidson.com, as the ultimate destination for customers and mobile cycle fans across the globe. As I mentioned earlier, next year marks our 120th anniversary. We're going to be celebrating this landmark event like never before, kicking off an annual three-day rally with the intention to develop it over the coming years into one of the largest Harley-Davidson events and rallies in North America and globally for our riding community, families and fans here in our backyard, our hometown of Milwaukee.\n\nWe know that the faster we move forward, transform and innovate the more important it becomes to remember where we came from. We won Milwaukee and our roots in Wisconsin, including Juneau, the product development center, the powertrain operations and Tomahawk to be as relevant to us today and tomorrow as it's been in our past, and for our presence here to not only benefit our employees, but our community and customers alike, so stay tuned for more. We'll be announcing more details in the New Year on our plans, including an investment that the Harley-Davidson Foundation intends to make on the heels of our $10 million investment into our museum campus focusing on our Juneau Home and the near West Side in Milwaukee. A core pillar in our Hardwire strategy is to lead in electric.\n\nIn this past September, we achieved a key milestone in delivering this ambition. On September 27, LiveWire became the first all-electric motorcycle company to list on the New York Stock Exchange. Closing this transaction with the listing represents a proud and exciting milestone toward our ambition for LiveWire to become the most desirable electric motorcycle brand in the world. We believe LiveWire is well positioned to define the two-wheel EV market, and we're excited about the future.\n\nWe'll be telling you more about LiveWire at the fourth quarter with Ryan Morrissey, LiveWire's president, joining us to present. But now I'll hand over to Gina. Gina?\n\nGina Goetter -- Chief Financial Officer\n\nThank you, Jochen, and good morning, everyone. As Jochen highlighted, we delivered a strong quarter, demonstrating focus on the business fundamentals. Third quarter results reflect a significant year-over-year revenue and operating income increase, primarily driven by a strong recovery in global motorcycle production and wholesale shipments after being adversely impacted by the unexpected production suspension back in May. While we continue to operate in a volatile supply chain environment, we started to see cost inflation moderate as we move through the quarter.\n\nSpecifically, we saw logistic rates decline and raw material inflation flow given the moderating metal markets. Looking more closely at our financial results in the quarter, total consolidated revenue of $1.65 billion was 21% higher than last year. HDMC wholesale motorcycle units were up 19% year over year, and revenue was up 24%, with a positive spread driven by profitable unit mix and global pricing. The Financial services segment revenue was up 3%, largely due to higher finance receivables.\n\nTotal operating income of $339 million was up 66% compared to last year. For HDMC, operating income of $258 million was up 164% compared to last year, and margins were at record levels. Performance in the quarter was driven by the recovery on unit production and cost productivity and pricing offsetting inflation. For HDFS, operating income of $81 million declined by $26 million or 24% compared to last year.\n\nThe decline was driven by a higher provision for credit losses and higher interest expense. As we've noted in previous quarters, the credit loss rate continues to normalize in line with expectations, and the loss reserve rate is remaining steady. Third quarter GAAP earnings per share of $1.78 compared to $1.05 last year, with the increase driven by the factors already noted as well as from modest favorability in below-the-line items. Turning to Q3 year-to-date results.\n\nTotal consolidated revenue of $4.6 billion was 7% higher compared to last year, and total operating income of $906 million was 9% higher compared to last year. GAAP Q3 year-to-date earnings per share of $4.68 compared to $4.06 for the same period last year. Global retail sales of new motorcycles were down 2% in the quarter. Overall, retail results were negatively impacted by low dealer inventory heading into Q3 and remaining lean through the first half of the quarter.\n\nAs Jochen pointed out, as the quarter went on, we saw overall retail return to growth year over year, as inventory began to flow more normally into the dealer channel. Retail in the month of September was up 5% in the U.S. and up 7% worldwide. Overall, worldwide retail inventory of new motorcycles remains at historically low levels.\n\nQ3 average inventory was 22% higher than Q3 prior year, and on a sequential basis, average inventory rose 12% compared to last quarter as production and wholesale shipments recovered from the suspension in May. The increase in inventory was welcome news for our dealers who continue to demonstrate solid retail momentum. We continue to see strong pricing dynamics for both new and used motorcycles in Q3 as we have throughout 2022 and 2021. Specifically, within the U.S., Q3 new motorcycle transaction prices finished within the desirability threshold of plus or minus 2 percentage points.\n\nLooking at revenue. Total HDMC revenue was up 24% in Q3 and up 8% on a year-to-date basis. Focusing on the key drivers in the quarter, 17 points of growth came from volume, driven by the growth in recovery in units and growth in the apparel business, eight points of growth from pricing and lower incentives driven by global MSRP price increases, coupled with pricing surcharges in select markets. In addition, we delivered strong price realization across our apparel business.\n\nFour points of growth from favorable mix within motorcycles, as well as SKU mix across the apparel business, and finally, four points of negative impact from foreign exchange as the dollar continued to strengthen throughout the quarter. Drivers of year-to-date revenue are relatively consistent, although volume growth was more muted year-to-date as Q3 growth was offset by the shortfall in Q2 due to the production suspension. Focusing in on margins, Q3 gross margin of 34.1% compared to 26.7% in the prior year. Stronger volume, favorable unit mix and pricing more than offset modestly higher cost inflation.\n\nAdditionally, in Q3, we continued to comp the unfavorable impact from the additional unexpected EU tariffs in 2021, which provided a margin tailwind. In total, supply chain inflation was plus 2% in the quarter, which is down from 4% in Q2 and 10% in the back half of last year. The deceleration in inflation is primarily a result of normalization across logistics, including lower expedited shipping expenses, and to a lesser extent, raw materials and the impact of metal markets beginning the distant from peak levels last year. Q3 operating margin improved from 8.4% in Q3 prior year to 17.9%.\n\nThe improvement was driven by the factors noted and includes an increase in operating expense, partly driven by LiveWire. As Jochen mentioned, since launching the Hardwire, we have shifted from a single focus on unit growth to a more holistic view of profitable revenue growth. The actions that we took during the Rewire to prune the portfolio coupled with the actions on pricing and incentives we've taken the past couple of years to offset inflation, have resulted in our unit profitability improving from the low point in 2019. And as we continue on the Hardwire journey, we will remain focused on overall HDMC revenue, operating income as well as profitability per unit as key measures.\n\nThe Financial services segment operating income in Q3 was $81 million, down $26 million compared to last year. The decline was driven by a higher provision for credit losses and an increase in interest expense. As expected, we continue to see actual losses continue to move toward more normalized levels. In Q3, HDFS' annualized retail credit loss ratio of 1.5% compares to a ratio of 0.84% in Q3 2021 or 66 basis points higher.\n\nIn the quarter, both the actual loss rate as well as the delinquency rate continued to be in line with expectations and historical averages. Total retail loan origination was up 3.3% in Q3 with growth across both new and used bike originations. Total quarter ending financing receivables were $7.3 billion, which was up 7% versus prior year. Total Q3 interest expense is up $60 million or 36% versus prior year.\n\nThe increase was driven by higher average debt outstanding and higher average interest rates. In addition, the retail loans for credit losses at the end of Q3 was 5%, which was flat relative to the first half of the year. Wrapping up with Harley-Davidson, Inc. financial results.\n\nThrough the first three quarters, we delivered $575 million of operating cash flow, which is down from $926 million in the comparable period last year. The decrease in operating cash flow was driven by increases in inventory as well as higher net cash outflows related to wholesale finance receivables. Total cash and cash equivalents ended at $1.7 billion, which is $331 million lower compared to Q3 prior year. During Q3, we continued to repurchase shares, although at a slower pace than in the first half as our cash priorities shifted to fund the LiveWire transaction.\n\nIn Q3, we bought back approximately 400,000 shares. Cumulatively, through the third quarter, we have bought back 8.4 million shares. As we look to the rest of 2022, as Jochen mentioned, we are reaffirming our full year outlook on HDMC revenue, HDMC operating margin and HDFS operating income where we continue to expect HDMC revenue growth of 5% to 10%. This revenue growth forecast incorporates the expectation that we recover and wholesale the units we lost as part of the production suspension.\n\nIt also includes what we know today in terms of the impact of the supplier challenges impacting our business. We expect revenue to continue to be positively impacted by our global pricing actions as we work to offset the cost headwinds across the supply chain. We continue to expect HDMC operating income margin of 11% to 12%. We believe the anticipated positive impact from pricing will more than offset the expected cost inflation across the supply chain.\n\nAlso, the suspension of the additional EU tariffs realized in 2021 contributes over a point of margin growth. We continue to expect HDFS operating income to decline by 20% to 25%. This decline is largely a result of the favorable allowance releases and lower credit losses in 2021. And lastly, we are updating our capital investment guidance from $190 million to $220 million to $170 million to $190 million to reflect updated project implementation timing.\n\nConsistent with our prior-quarter disclosures, embedded in our 2022 guidance of LiveWire. Finally, as we look to capital allocation, our priorities remain to fund growth of the Hardwire initiatives, which include the capital expenditures previously mentioned and funding the LiveWire transaction, paying dividends and executing discretionary share repurchases. This financial guidance includes the best cost forecast on supply chain that we have at this time. It assumes that logistics and materials will continue to improve as we move through the balance of the year.\n\nIn aggregate, we expect costs will continue to be inflationary, but we will move beyond the peak levels realized in 2021. At this point, I'll turn it back to the operator to take your questions.\n\nOperator\n\nThank you. [Operator instructions] Your first question will come from the line of Robbie Ohmes with Bank of America. Please go ahead.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nWell, good morning and thanks for taking my question. I'm going to actually slip in just two real quick. Just the first question was just if, Jochen, you could talk about how demand feels in the fourth quarter here, both in the U.S. and in the rest of world? Any kind of changes you've seen and how the dealers are feeling? And then for Gina, I was hoping you could help us with the gross margin outlook.\n\nGreat gross margin that you guys had. How do we think a little more color on how to think about the fourth quarter? And any kind of thoughts you would give us preliminary thoughts on how we think about it for next year? Thank you.\n\nJochen Zeitz -- President, Chairman, and Chief Executive Officer\n\nYeah. Thanks, Robbie. To your first question, as I mentioned earlier, we saw improvements in retail sales as the quarter went on. And therefore, we believe that the decline in retail sales was primarily due to the lack of availability of inventory at the dealer network.\n\nAnd as we got to mid-August, things started to turn positive and retail sales have been positive ever since. So overall, at this point, with more inventory available at the dealers, we feel pretty good about it. And that is particularly the case for the U.S. and our Asia Pacific markets.\n\nGina Goetter -- Chief Financial Officer\n\nGood morning, Robbie. In terms of your question on margins, yeah, we had a very good margin quarter, really driven by the strong recovery that we had in units and the profitable mix those units, coupled with the pricing actions that we had in market more than offsetting the cost inflation. But the quarter -- to really get an accurate view on our on our margins for the year, you got to look at year-to-date because it combines kind of that shortfall that we had in Q2 combined with Q3. But still, the story remains very positive.\n\nSo we have year to date, two and a half points of margin growth. Remember, a point of that is coming from the tariff comp that we had from last year, those additional EU tariffs sitting in there. As we think forward and think about Q4 and into '23, remember, keep in mind that our FX rates, as we're going through the balance of the year is going to get worse. And as that deterioration has come into the P&L earlier in the year really not having any sort of material impact on margin.\n\nAs we got into Q3 and as we look to Q4 and next year, that is absolutely going to have a bigger impact. And if you think of Q4 as well, remember that we are continuing to do the changeover of our model year production at the end of October here. So from a shipment standpoint, we ship roughly, call it, 60% of an average quarter in Q4. So that weighs on our margins as well.\n\nSo from a year-to-date standpoint, we're sitting in a really good position and feel good about the guidance that we've given, knowing what we know of what's coming at us for Q4. In terms of 2023, looking at the margin progress that we've made over the past couple of years. We're really proud of the progress. We added a chart in these materials this time to look at our profitability per bike.\n\nAnd you can really see all of the work that we're doing on cost and on pricing and on and really focusing on that mix playing through our profitability per bike. And we foresee that really sticking with us as we move into 2023. We're just in the midst of budgeting. So we're not going to comment too terribly much on what the outlook is for next year.\n\nBut keep in mind a couple of things. One, our rule of thumb is that we're going to take enough pricing that's offsetting the cost inflation and then the second piece is this FX headwind that's coming at us. So it will be material for us next year, and we're just kind of shaking and figuring out how much of that pricing is going to be able to offset the FX for next year.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nVery helpful. Thank you so much, Gina.\n\nGina Goetter -- Chief Financial Officer\n\nYou're welcome.\n\nOperator\n\nYour next question comes from the line of Craig Kennison with Baird. Please go ahead.\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nHey. Good morning. Thanks for taking my question as well. Gina, I was just going to follow up on that Slide 9, where you talked about HDMC profitability per bike.\n\nI'm assuming that includes your parts and accessory business as well. First of all, can you confirm that?\n\nGina Goetter -- Chief Financial Officer\n\nYeah. Yeah, you're absolutely right. That includes parts and accessories.\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nOK. So in some ways, like you produced fewer bikes, that's a higher margin business, so maybe you can earn more per bike. I'm just wondering, it's such an impressive reversal in that trend. Where do you think that metric ultimately can go?\n\nGina Goetter -- Chief Financial Officer\n\nWell, when you think about the guide that we have out there for Hardwire to and getting back to that mid-teens margin number, I mean, that mid-teens margin number was anchored around that in 2014, 2015 kind of profitability per unit. So I think there's still upward potential in the long run. Again, I think as we think about 2023 and working through this FX impact, we'll have to keep that in mind for next year. But over the long run, as you look at that 14 anchor, that's a good one to kind of have out there.\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nIs there a way to deconstruct that to say how much money you make on a bike versus how much you money you make on an attachment rate because you sold the bike and then how much is just coming in because you've got this great network of riders that buy PG&A all the time.\n\nGina Goetter -- Chief Financial Officer\n\nWe can break that down. We have broken that down. We're not quite sharing that publicly yet, but we do understand both the profitability per bike is increasing based on the factors that we've noted, and we're having a stronger attach rate and intend to have a stronger attach rate as we move forward. But we can provide some more clarity on that as we move into 2023.\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nYour next question will come from the line of Joseph Altobello with Raymond James. Please go ahead.\n\nJoe Altobello -- Raymond James -- Analyst\n\nHey, guys. Good morning. I guess first question on inventory. So you had 30,000 units and dealer inventory worldwide.\n\nBy my math, it's about nine weeks up year over year, but you're roughly half of where you were, call it, three years ago. And I guess how far below optimal do you think you are right now? However you want to define that, whether it's units or weeks on hand, for example?\n\nEdel O'Sullivan -- Chief Commercial Officer\n\nYes, good morning. This is Edel. You are correct in your assessment of the inventory position. I think the most important thing for us is to be able to start the riding season as we look into 2023 at a much healthier level of inventory.\n\nWe know that over the past few quarters and indeed maybe even over the past couple of years, we have not had the optimal level of inventory in any of our markets to really be able to capture the beginning of the season and the upside demand potential. So we're pleased to see that, that situation is recovering as we get into the back half of 2022. That said, just as you noted, we continue to understand that it is very important for us and our guiding principle of desirability to ensure a restrained and adequate level of inventory. We do not intend to go back to historical levels that created many challenges for profitability, not only for us but also for our dealers.\n\nThat's an important part also of what Gina was just sharing in the previous question. So I certainly think that we are in a much healthier position. We think this will allow us to start the riding season in a much more comfortable place, both domestically and in international markets. Still, overall, understanding the importance of a restrained inventory position that lives under a broader framework of desirability.\n\nJoe Altobello -- Raymond James -- Analyst\n\nYeah. But how many bikes are you for low optimal? I mean, is it 5,000 bikes? Is it 10,000 bikes?\n\nEdel O'Sullivan -- Chief Commercial Officer\n\nYeah, that will certainly be something that will depend. We monitor it very closely as we look at the retail trends in each of the markets. Again, we think that the level that we are at now is healthy. We think that we continue to have at this point, what we need to start the season effectively, and we will continue to monitor that as we go into the new year.\n\nJoe Altobello -- Raymond James -- Analyst\n\nOK. And just maybe a question for Gina. If we assume no changes from today, could supply chain cost be a potential tailwind in 2023?\n\nGina Goetter -- Chief Financial Officer\n\nAbsolutely, yeah. As you see our performance through third quarter here, we started to see the supply chain play out as we had hoped with logistics costs starting to moderate middle markets coming back to us, that will continue -- those tailwinds will continue as we move into 2023. Now labor is still a factor that we're going to have to contend with next year from an inflation standpoint, that is a piece that will continue to hit us. And the overall supply base itself is still not super stable.\n\nSo there's puts and takes, but largely speaking, the huge inflation that we were seeing within logistics and raw materials is starting to mitigate.\n\nEdel O'Sullivan -- Chief Commercial Officer\n\nOK, thank you.\n\nOperator\n\nYour next question will come from the line of James Hardiman with Citi. Please go ahead.\n\nJames Hardiman -- Citi -- Analyst\n\nHey. Good morning. Thanks for taking my call. Just a quick clarification.\n\nJochen, you mentioned that since sort of mid-August, retail had been positive. I'm assuming that includes the month of October, so maybe speak to October. But then maybe a follow-up on -- or maybe a clarification follow-up on Joe's question about inventory. As we exit this year, is the right way to think about next year that wholesale and retail units should generally be aligned? Or do you think there is going to be some incremental catch-up to be done in 2023? Thanks.\n\nJochen Zeitz -- President, Chairman, and Chief Executive Officer\n\nThanks, James. Yes, that it did -- my statement did include October. So we've seen that positive trend to continue into the fourth quarter to date. Look catch-up to Edel's point, depends on retail development, right? So certainly, the big catch-up was in the third quarter now with the production suspension that we had that cost us anywhere between 10,000 to 12,000 units, of which most we've now compensated in the third quarter.\n\nThere's still a bit of catch-up in the fourth quarter to do with a few thousand units, and then it all depends on how retail is going to develop. We certainly will stay very agile to make sure that supply and demand are in good balance and that we are not oversupplying the market. But it's difficult to project retail at this current environment. We're certainly planning for all eventualities.\n\nBut what we're seeing so far, and in particular, in October is a positive trend.\n\nJames Hardiman -- Citi -- Analyst\n\nAnd just maybe one point of clarification. Domestic versus international, the inventories in the field are more balanced, I think, than they've historically been. Can you just speak to sort of your relative comfort with domestic versus international is one -- I don't know, is there more sort of room to go on one versus the other?\n\nJochen Zeitz -- President, Chairman, and Chief Executive Officer\n\nWell, I think overall, we feel good about the inventory on a global level, and in particular, with regards to the U.S. and Asia. EMEA markets, anybody's guess right now how EMEA is going to develop. But overall, we feel good about the inventory level that we have right now.\n\nJames Hardiman -- Citi -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nYour next question will come from the line of Fred Wightman with Wolfe Research. Please go ahead.\n\nFred Wightman -- Wolfe Research -- Analyst\n\nHey, guys. Good morning. I just wanted to take a look at the full year guidance. I know we always sort of run into this for the 3Q print, but there's a pretty wide range implied for 4Q on sales and operating profit just with the current guidance.\n\nSo can you sort of talk about what gets you to the high end of that range versus the low end? Is it really just some of the retail momentum that Jochen just talked about? Is it supply chain? Like what are sort of the positives and negatives there?\n\nGina Goetter -- Chief Financial Officer\n\nSure. Mine. This is Gina. I would say -- and what gets us to the high end of the range -- remember, we -- again, we're cutting off production and shipping -- or kind of shifting over to the next model year at the end of October.\n\nSo really, what gets us to the high end is those bikes get on the water for our international markets, having them be able to hit an invoice in the current year. So that really is what's swinging kind of from the 5% to the 10% now. And we feel confident about the production, we feel confident about what we're going to work to wholesale. We feel confident in the demand that is there.\n\nIt's now just a matter of can we get it shipped and invoiced in those international markets in time. I think from a pricing standpoint, we're continuing to feel good about the pricing that we have in the market as well. On the margin standpoint, what gets us to that higher end of the range is continuing to see the supply chain trends that we saw in Q3 play through in Q4.\n\nFred Wightman -- Wolfe Research -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nYour next question will come from the line of Gerrick Johnson with BMO Capital. Please go ahead.\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nGood morning. Thank you. I have a couple here. First, you mentioned improving availability in U.S.\n\nand APAC, but not EMEA. So what happened there?\n\nJochen Zeitz -- President, Chairman, and Chief Executive Officer\n\nOur availability is fine. I'm just saying I think the economic outlook currently in EMEA is to be seen. Very hard to judge the trends in the fourth quarter anyway. But I'd say the confidence levels are certainly a lot higher in the U.S.\n\nand in Asia Pacific, but inventory availability is fine.\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nOK. Understood. And P&A was down, trailed everything else. So why was that down?\n\nEdel O'Sullivan -- Chief Commercial Officer\n\nP&A, a couple of different dynamics playing out there. The first, I think the supply challenges continue for much longer in this category than in motorcycles and that certainly is continues to be an area where there is high bike orders on some of our categories that are most important to accessorizing a bike, so that's one dynamic. The second dynamic is certainly the attach rate to new motorcycles. And essentially, what I mean by that is the fact that the motorcycles, we didn't have the availability in Q2 as they came in, many of those bikes were spoken for and essentially are turning so quickly on the floor that the potential for pre-accessorization was a little bit muted.\n\nSo that certainly has been the two driving factors behind P&A for the quarter. Now if you look in terms of the overall decline in retail versus the decline in P&A, we still are driving a little bit of improved growth there. Pricing is a factor, of course. But we think that as supply normalizes, not only in motorcycles but also in those P&A categories themselves, we should see improvement in that growth trajectory for the business.\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nOK. Very good, Edel. And Gina, one last one. You reduced your capex by about $25 million for project implementation.\n\nSo what was that, that got pushed out?\n\nGina Goetter -- Chief Financial Officer\n\nI wouldn't say anything necessarily got pushed out. It's just a phasing of when some of the expenditures we're hitting in terms of just the timing of the project. There's nothing that's been delayed or pushed in that way. It's really more of an accounting thing of when costs are going to hit or expenses are going to be paid.\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nOK, great. Thank you.\n\nOperator\n\nYour next question will come from the line of Joseph Spak with RBC Capital Markets. Please go ahead.\n\nJoe Spak -- RBC Capital Markets -- Analyst\n\nThank you. Gina, maybe just on the logistics comments, like if I look back last quarter, I think you indicated that would be flat for the second half. Now it was down this quarter. You're seeing it down again in the fourth quarter.\n\nAnd I know you're doing a lot less expedited and ocean is down. But is this really just a comp issue from a super high level expedite? Because we're hearing a lot of challenges on rail for instance. So I'd just be curious to see to know what you're seeing actually confidence that logistics can be a positive for you guys here.\n\nGina Goetter -- Chief Financial Officer\n\nYeah, Joe, good question. And to your point on comp, that really had much to do with Q3. Q3 in 2021 was really high for us, particularly when everything was inflating, plus we had a lot of expedited shipping. When you think about the timing of our model year production, we typically see expedite started to rise in Q3 of last year as we were getting stuff ready for the changeover.\n\nWe're not seeing as much of that this year in expedited shipping. So that is what brought that Q3 to be deflationary here, down 5%. To your point on lane rates and freight rates, yes, we're seeing the same thing labor within the logistics area is staying high, but just the delta that we're -- and the stability within expedited shipping or the control, I should say, on expedited shipping, that is what brought Q3 down and what we foresee for Q4 as well.\n\nJoe Spak -- RBC Capital Markets -- Analyst\n\nOK, that's helpful. And then second question is, I know in the release, you mentioned on the opex side, I think part of the year-over-year increase was higher LiveWire spend. Is there any way you could give us the total spend or the total loss for LiveWire this quarter? And then thinking about next quarter, and I know as now a stand-alone company, but you're still consolidating it, like, are there higher public company costs that we should also consider on a go-forward basis that starts to impact the opex of the overall consolidated enterprise?\n\nGina Goetter -- Chief Financial Officer\n\nNot different than what we've included in our guidance or our outlook for LiveWire or for Harley. Kind of what we talked about as -- during investor day, all of that cost was included or the infrastructure was included. The biggest thing that happened in LiveWire was people. So as we separated the business out and started to build that talent base kind of year over year, we're spending more on that infrastructure than we would have in the prior year.\n\nStarting next quarter, like when we release our year-end and look at Q4, we'll start to show the three segments, as we've talked about. We'll have the motor company, excluding EV. We'll have HDFS, the financing arm, and then we'll have LiveWire as well. So we'll start to see all three of those pieces.\n\nJoe Spak -- RBC Capital Markets -- Analyst\n\nOK. And can you give us like the total spend on LiveWire this quarter on an absolute basis?\n\nGina Goetter -- Chief Financial Officer\n\nOn an absolute basis, the operating expense for the quarter, we spent roughly, call it, $20 million.\n\nJoe Spak -- RBC Capital Markets -- Analyst\n\nOK, thank you very much.\n\nOperator\n\nYour next question comes from the line of Jamie Katz with Morningstar. Please go ahead.\n\nJamie Katz -- Morningstar -- Analyst\n\nHi. Good morning. I'd be interested to hear how the appetite for financing has changed with significantly higher APRs across HDFS? And I do have a follow-up after that. Thanks.\n\nGina Goetter -- Chief Financial Officer\n\nIn terms of -- Jaime, morning. This is Gina. In terms of the appetite for financing, we're not -- we've got to peel back and look at the different types of customer or consumer. So from a prime applicant, we're still seeing good appetite.\n\nWe're seeing our shift of loans moving more toward prime. We are seeing in the subprime tiers less kind of people raising their hands saying they want loans unless we're becoming more stringent on the loans that we're giving out. So we are seeing kind of that mix shift in two ways: One, less people on the subprime side, raising their hands, and two us funding and choosing to fund more prime.\n\nJamie Katz -- Morningstar -- Analyst\n\nOK. And then I assume that means that you're still financing roughly, I don't know, 60% of the loans or whatever the prior number was, that hasn't changed materially.\n\nGina Goetter -- Chief Financial Officer\n\nYes. Yeah, our penetration has stayed relatively consistent this year. So right around that 65% mark. So all loans were 65% of them, go back to the math of roughly 20% of folks are purchasing outright in cash.\n\nAnd then of that remaining 80%, we are financing 65% of them.\n\nJamie Katz -- Morningstar -- Analyst\n\nPerfect. And I have a quick follow-up on the HD-1 change, bringing in other brands into the fold. Can you talk a little bit about how that helps you control the U.S. pricing market across the board a little bit more broadly?\n\nJochen Zeitz -- President, Chairman, and Chief Executive Officer\n\nWell, we, as I said, we wanted to expand the marketplace so that it becomes the leading marketplace for everything at some point in terms of bikes, which is why we don't want to just offer HD bikes, but give our customers and dealers an opportunity to list their own bikes. And we think this is a natural expansion of HD-1 marketplace to expand on the reach and interest that we are building with our customers.\n\nJamie Katz -- Morningstar -- Analyst\n\nThank you.\n\nOperator\n\nYour next question will come from the line of Ryan Sundby with William Blair. Please go ahead.\n\nRyan Sundby -- William Blair and Company -- Analyst\n\nYeah. Hey, good morning, guys. Really impressive growth for adventure touring this quarter. Can you talk a little bit more about what you're seeing there? Is that all demand -- is there anything onetime in that number around maybe market expansion? And then with units nearly doubling this quarter, is there a way to help us think about maybe where adventure touring ends up as a percentage of total units.\n\nEdel O'Sullivan -- Chief Commercial Officer\n\nGood morning, Ryan. Thank you for your question. Yes, adventure-touring brought us an incredibly strong product we've put out in the market in a category that typically wouldn't be what people would have originally thought about, Harley-Davidson. So again, we're very proud of the development.\n\nIt also suffered in the early parts of the year from availability as many of our other product families did. And the recovery, I think, in Q3 has been significant as those concerns have abated in terms of supply. This is an important segment for us. It is a global -- it is particularly a prominent and important on a global basis, but it is also growing very strongly in North America, where we think we have the right offering, the right dealer network, the right support to be able to have this be another strong contender as that market continues to grow.\n\nSo our intent is to continue to support not only the adventure touring product, Pan America in and of itself, but also the ecosystem of experiences and consumers that go along with it. We see great potential for growth globally where it is an established segment and in North America as it grows.\n\nRyan Sundby -- William Blair and Company -- Analyst\n\nGreat. And then any thoughts there on kind of the percentage of total units that could ultimately represent for you guys over time?\n\nEdel O'Sullivan -- Chief Commercial Officer\n\nI think that evolves as the market growth potential does. We've certainly established a priority around our stronghold categories and that will continue into the future. But adventure touring again, is an incredibly important segment globally, and it is growing in North America. So we think the potential there is significant for it to be an important part of our overall lineup domestically and internationally. \n\nRyan Sundby -- William Blair and Company -- Analyst\n\nGot it. Thank you.\n\nJochen Zeitz -- President, Chairman, and Chief Executive Officer\n\nAnd just to add, the 1,250 in the U.S., Pan America is still the No. 1 selling motorcycle in its segment.\n\nOperator\n\nYour next question will come from the line of Brandon Rolle with D.A. Davidson. Please go ahead.\n\nBrandon Rolle -- D.A. Davidson -- Analyst\n\nGood morning. I was going to ask, could you comment on the current use versus new pricing gap and how that's impacting the affordability of new bikes in the eye of the consumer. And then maybe touch on the success or plans you have to keep new buyers engaged that entered the industry during the pandemic moving forward. Thanks.\n\nEdel O'Sullivan -- Chief Commercial Officer\n\nSorry, Brandon, I was on mute as I started speaking. So let me go back over that. So we're talking, sorry, you probably had a gap there. We were talking about the balance of new versus used.\n\nSo the gap in pricing, I think, continues to be at a lower rate than historically. We have certainly seen the balance of new vs used within our dealer network change throughout the year as availability has modified. So we expect that, that will continue to be the dynamic going forward as availability and new changes and improve. However, it is important to note, as Jochen was referencing in his previous answer around HD1 that both of these consumers, the new and the used buyer, are important for our overall growth and part of the overall ecosystem of riding that we intend to establish and to continue to have be a prominent part of our story -- our growth story, going forward.\n\nIn terms of your question specifically around new riders that have entered the category and the sport over the past couple of years, we have spoken on this call over the past few quarters about the growth in Riding Academy. We continue to see very strong adoption rates and new riders of all kinds entering the sports. And for us, it's really about building that ecosystem of experiences in that community that goes beyond some of our traditional offerings, like, H.O.G., to really ensure that those consumers stay engaged in the way that is most relevant to them. And that is both through digital touch points as well as through the incredible network of dealers and the experiences that they build all the way to the rallies, and certainly in 2023, including our anniversary year events that we are very excited about.\n\nSo lots of opportunities to continue to drive that engagement that keeps those new riders riding.\n\nOperator\n\nOur next question will come from the line of John Healy with Northcoast Research. Please go ahead.\n\nJohn Healy -- Northcoast Research -- Analyst\n\nThank you for taking the question. Big picture question. When I hear your remarks, the biggest thing that jumps out to me is just the commitment to being controlled with your production and being rational with the amount of product that you put into the industry. And if that works out, profitability per unit, if you can execute on some of these operational initiatives should be historically better than what we've seen in recent years.\n\nCould you help us walk through what would prevent you guys from pulling that playbook off? Because when I look at that opportunity, to me, it seems like you control your destiny quite a bit there. So I'm just trying to kind of game theory, what's jumping out at you as being the biggest roadblocks to pulling that off? And then secondly, I think you maintained guidance for the HDFS business despite higher rates. And I was just wondering what kind of the offset was as you look into year-end? Thank you.\n\nJochen Zeitz -- President, Chairman, and Chief Executive Officer\n\nWell, the biggest obstacle is always demand in this regard. If you have a clear positioning as the most desirable lifestyle brand that is rooted in motoculture so demand -- and I'm talking motorcycles for a moment here is what drives our thinking all the time. And we want to make sure that we are planning our manufacturing accordingly in order, of course, to capture demand, which was not always possible in the last couple of years due to the supply chain challenges but also that we are agile to move as demand evolves in the next quarters. It's not just about demand management or supply management.\n\nObviously, there's a lot more happening in HD Marketplace, our digital drive and many other initiatives are in full swing to make sure that we broaden the consumer base, the customer base in the coming years. So there's a lot happening in this space, which is important. We want to make sure that our riders keep riding, that we bring new riders into the sport and that we overall are broadening our reach in the different consumer profiles, which is also why you see an extended effort on our parallel licensing business, which has shown a nice growth, especially this quarter. That's a big initiative for us to broaden the consumer base because not everybody that is a fan of Harley necessarily right yet may be riding in the future, but that might just be a customer that believes in the lifestyle, loves the lifestyle, loves the brands and wants to get engaged.\n\nAnd therefore, there's a big effort there that I believe, long term will help us also to get people more to get into the culture -- into riding cultured eventually become a rider and take them Riding Academy course. They have more opportunities on the writing academy as well, not just for new riders, it could be skilled riding and other things, adventure touring, lots of opportunities there that we are looking at, experiences, loyalty and membership are opportunities that we're exploring. So there's a lot happening. It's not just a question of capturing the demand and making sure that we are always the most desirable and pricing is up and inventory is at a healthy level.\n\nThere's a lot that's happening behind the scene and in front of the scene to really get customers to engage with the brand on a very different level than we've ever seen in the past.\n\nGina Goetter -- Chief Financial Officer\n\nAnd John, you had a question there on HDFS. Could you repeat the question? I didn't quite catch all of it.\n\nJohn Healy -- Northcoast Research -- Analyst\n\nI think you guys maintained guidance for HDFS or operating income for the year. But rates probably, I would think, are a headwind given the original expectations. Just trying to understand the offsets.\n\nGina Goetter -- Chief Financial Officer\n\nYeah. Good question. And yes, interest rates are definitely going against us, and you can see that -- you could really start to see that play through the P&L here in Q3 when you look at that interest expense line up pretty significantly year over year. That, by the way, is going to continue to be a headwind for us as we move into Q4 and into 2023.\n\nThe offset has been in the revenue. So not only we've had overall kind of receivables go up, plus all of the other revenue streams that impact HDFS has also been positive. So think of things like audit insurance added, the credit cards, all of that revenue has been positive and helping to offset.\n\nJohn Healy -- Northcoast Research -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThere are no further questions at this time. This concludes today's call. [Operator signoff]\n\nDuration: 0 minutes\n\nShawn Collins -- Director of Investor Relations\n\nJochen Zeitz -- President, Chairman, and Chief Executive Officer\n\nGina Goetter -- Chief Financial Officer\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nJoe Altobello -- Raymond James -- Analyst\n\nEdel O'Sullivan -- Chief Commercial Officer\n\nJames Hardiman -- Citi -- Analyst\n\nFred Wightman -- Wolfe Research -- Analyst\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nJoe Spak -- RBC Capital Markets -- Analyst\n\nJamie Katz -- Morningstar -- Analyst\n\nRyan Sundby -- William Blair and Company -- Analyst\n\nBrandon Rolle -- D.A. Davidson -- Analyst\n\nJohn Healy -- Northcoast Research -- Analyst\n\nMore HOG analysis\n\nAll earnings call transcripts"
}