{
  "companyName": "Aurora Cannabis Inc.",
  "companyTicker": "ACB",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/21/aurora-cannabis-inc-acb-q4-2022-earnings-call-tran/",
  "content": "Aurora Cannabis Inc. (ACB 2.26%)\nQ4 2022 Earnings Call\nSep 20, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings. Welcome to the Aurora Cannabis Inc. fourth quarter 2022 results conference call. At this time, all participants are in a listen-only mode.\n\nA question-and-answer session will follow the formal presentation. [Operator instructions]. Please note, this conference is being recorded. I will now turn the conference over to your host, Ananth Krishnan.\n\nYou may begin.\n\nAnanth Krishnan -- Vice President, Corporate Development and Investor Relations\n\nThank you, operator, and we appreciate you all joining us this afternoon. Today with me are, Miguel Martin, CEO; and Glen Ibbott, CFO. After the market closed, Aurora issued a news release announcing our fiscal 2022 fourth quarter and full year financial results. This news release, accompanying financial statements and MD&A will be available on our IR website and can also be accessed via SEDAR and EDGAR.\n\nIn addition, you will find a supplemental information deck on our IR website. Listeners are reminded that certain matters discussed on today's conference call could constitute forward-looking statements that are subject to risks and uncertainties related to our future financial or business performance. Actual results could differ materially from those anticipated in these forward-looking statements. The risk factors that may affect actual results are detailed in our annual information form and other periodic filings and registration statements.\n\nThese documents may similarly be accessed via SEDAR and EDGAR. Following the prepared remarks by Miguel and Glen, we will conduct a question-and-answer session for our covering analysts. We ask that you limit yourself to one question and then get back in the queue please. With that, I will turn the call over to Miguel.\n\nMiguel, please go ahead.\n\nMiguel Martin -- Chief Executive Officer\n\nThank you, Ananth. Before discussing the business more broadly, let me begin with a brief discussion of our latest acquisition, a controlling interest in Bevo, one of the largest suppliers of propagated vegetables and ornamental plants in North America. This transaction first and foremost underscores a disciplined approach to capital allocation; and second, is consistent with both our immediate needs and our vision of becoming a leader in global cannabis. Bevo will be managed by its existing management team who have over 85 years of agricultural experience and have consistently demonstrated growth in revenue and earnings over the past decade.\n\nCollectively, they retain a substantial equity ownership position as they embark on a robust growth plan. As part of the transaction, we have identified a profitable opportunity to repurpose the Aurora Sky facility, orchid cultivation, and vegetable propagation with minimal capital investment. This will greatly increase Bevo's production capability and extended shipping range in Canada and the United States. It will also enable us to generate incremental revenue and adjusted EBITDA, while saving on previously announced wind-down and selling costs.\n\nThe transaction is immediately accretive to Aurora, adding approximately $9 million of annual adjusted EBITDA, and importantly is another tangible step toward our goal of adjusted EBITDA profitability on a run rate basis by December the 31, 2022. We are pleased to have Bevo as our partner and expect our investment to drive significant shareholder value over the long run. Beyond the acquisition, we feel very good about our position in the market. Our optimism is based on the inherent strength of our global medical cannabis business where we remain the number one Canadian LP.\n\nMedical cannabis remains the best segment to invest in as is both defensive and stable in turbulent times and commence amiable adjusted gross margins that consistently exceed 60%, two times that of consumer cannabis. And while our Canadian medical cannabis business is steady, our international business saw revenues increased by over 70% this fiscal year with notable progress in Germany, Poland, the UK, and Australia. The second reason for our enthusiasm is we continue to excel our rationalizing the business to the current environment. As you know, our annualized cost savings of $150 million to $170 million will be completed within the next two quarters; and once complete, will materially reduce our cash needs and get us closer to EBITDA breakeven.\n\nOur balance sheet is also a key differentiator and has enabled us to repurchase $155 million in convertible debt during Q4, which will result in considerable savings on cash interest costs. Additionally, we have approximately $370 million in cash as of yesterday, which makes Aurora one of only a handful of companies within the cannabis industry to have a net cash position. Finally, we feel great about our investment in science, which is beginning to pay off. Specifically, our breeding program has delivered nine new proprietary cultivars through our product pipelines since June of 2021, delivered meaningful improvement to yields and is expected to generate incremental high margin revenue through license agreements for these genetic innovations to other licensed producers.\n\nIn fact, I'm excited to announce that we signed our first agreement to license genetics, to a major Canadian LP during Q4, and we expect more to follow. So, let's take a deeper dive into our global medical cannabis business. During Q4, international medical revenue was up 35% compared to last year as our regulatory expertise, compliance protocols, testing and science capabilities supported our leadership position. While revenue contributions for individual countries can certainly ebb and flow as these new markets develop due to various factors, including the timing of government approvals and import permits, we believe our exposure to nearly a dozen countries outside of Canada affords us relative insulation as it relates to the economic climate and conditions in specific countries across Europe, Israel, and Australia.\n\nIn Poland, revenues nearly doubled year-over-year and we maintained our number one market share position. We continue to invest in marketing efforts there to support our planned launch of new flower and extract products. In the UK, our revenues increased by 25% compared to Q4 last year, and we believe we're the market leader in the flower segment. UK witnessed rapid growth in patient population over the last year, and we hope to see this continue as new clinics open up.\n\nTurning to Germany, we received EU GMP certification for our state-of-the-art domestic medical cannabis production facility in May and made our first shipment to German pharmacies that same month. Recall that we hold one of only three licenses in Germany and are number two in medical flower with a 17% volume share. Our market share is also growing steadily in the extract market, thanks to new product innovation. During Q4, we also launched three sizes of dronabinol making our first step into that category.\n\nWhile growth in patients has moderated during the year, Germany remains the largest market in the EU with 83 million citizens with only about a 100,000 to 120,000 medical cannabis patients. We are certainly well aware of some of the economic challenges that Germany is facing at the present time as it grapples with the war in Ukraine and the impact that is having on energy prices and inflation. Still, we are hopeful the growth will pick back up this fiscal year, even against this backdrop, driven by doctor education and a simplified reimbursement process. We expect to begin generating revenues in France in 2023, where we are currently the only supplier of dry flower in the pilot program.\n\nFinally in Australia, our Q4 revenue rose 700% year-over-year, driven by record number of patients. Let me reiterate that we believe that cannabis growth story will center on international medical and recreational over the next several years. Right now, we believe there are about 150,000 patients in Europe alone. And if the countries that have so far legalized medical cannabis were to reach similar adoption levels to Canada, 1% of the adult population, the patient pool could expand to 3.5 million people.\n\nThis fiscal year, we expect a number of new medical markets to come online. And several governments have announced plans for recreational schemes, most notably Germany. So, it's a massive opportunity. We believe our success in medical cannabis provides us with a significant first mover advantage and our leadership will be portable to rec markets as they open up.\n\nTurning to the Canadian medical market. Our leading market share was over 24% while insured patients comprised 81% of our domestic medical sales, up from 79% in Q3. Our net revenue per order and per participating patient have both significantly increased over the past year due to a shift toward higher value insured patients, while our direct-to-consumer approach continues to drive industry leading margins. Overall revenue was flat in Q4 compared to Q3, but we attribute our share gain to the best-in-class service we offer along with new premium products and innovations.\n\nWe note that acquiring, retaining and moving the patients through the process requires significant resources and experience, and much of that same infrastructure and know-how with patients in Canada is directly applicable to our success in Europe. Switching to Canadian adult rec, our Q4 revenue increased by $2.3 million as compared to the prior quarter. The increase was primarily due to our strengthened product offerings in certain categories, along with seven weeks of results from Thrive. Their premium consumer cannabis net revenue added about $1.4 million.\n\nWhile the environment of Canadian rec has seen prolonged macro challenges, we are beginning to see signs of stabilization, and we remain focused on maximizing profitability through low-cost production and by entering higher margin categories. The market also continues to highlight the importance of innovation and the SKU lifecycle, with the typical SKU generating 80% of its lifetime value in the six months following launch. 13 SKUs were launched across our rec and medical channels in June alone, and we have a stack pipeline that should serve us well over the coming quarters. More broadly, we believe that our scientific leadership in cannabis breeding and genetics provides Aurora with a unique advantage that drives value in all tiers of the consumer and medical categories.\n\nOur breeding program has delivered nine new proprietary cultivars to our product pipeline since June of 2021, as well as bringing new products to consumers, they deliver meaningful improvements in yield, which will allow us to boost top quality flower and industry leading margins. For example, our new farm gas cultivar delivers nearly double the yield of our traditional staple cultivars and does so at an average of 26.5% THC. And with that, I would now like to turn the call over to Glen for our financial review. But let me quickly say that we've made incredible strategic progress during the year.\n\nWe are on track with our transformation plan. And we feel very optimistic about the future of the business.\n\nGlen Ibbott -- Chief Financial Officer\n\nThanks, Miguel. Good afternoon, everyone. We're proud to have one of the strongest balance sheets among Canadian LPs, and I'm pleased that we strengthened it even further during Q4. But at the same time that we've been executing our cost reduction plan, we also repurchased $155.3 million in principal on convertible notes, with a total cost of $149.2 in cash and that's including accrued interest.\n\nAs of yesterday, we had approximately CA$370 million of available cash and we have $209 million principal remaining on the convertible notes. We believe that debt reduction, even though maturity is still more than a year out is a smart and defensive capital allocation decision that reduces balance sheet risk, especially important during turbulent markets. The debt reduction executed so far saving us cash interest cost of $9.5 million annually. We continue to have access to a shelf prospectus with $713.7 million still available including $186.2 million remaining under our ATM program, which we may utilize from time-to-time for strategic purposes.\n\nOur cash flow continues to improve with $22.5 million used in operations in working capital in Q4, compared to $39.3 million in the prior quarter. Q4 includes restructuring and severance payments of $6.8 million. We're moving closer to our positive adjusted EBITDA target, as we have reduced our loss by $8.9 million versus Q4 of last year. If we compare to last quarter, Q3, our adjusted EBITDA loss increased by about $1.5 million and that's driven mostly by a change in the company's sales channel mix.\n\nAs Miguel mentioned, we also expect a positive contribution from our controlling stake in Bevo, which delivered EBITDA of $9 million for the year ending June 30, 2022.  I should note that the Bevo business has a strong seasonal cadence with the period from January to June expected to deliver roughly two-thirds of the full annual revenue and EBITDA. So overall, Aurora remains on track to achieve a positive adjusted EBITDA run rate as we execute it. Q4 net cannabis revenue was $50.2 million, and that's compared to $50.4 million last quarter. Q4 revenue included the non-routine $1 million provision for returns from prior period.\n\nSo, excluding that prior period adjustment, revenue was $51.2 million. Medical cannabis fell modestly, while consumer cannabis rose, due mostly to contributions from our Thrive acquisition. So, let me now address each of our core businesses in a bit more detail. Canadian medical revenue was $24.9 million in Q4, up $118,000 from Q3 and reflecting the stability of this business.\n\nOur focus and traction with the insured patient population is certainly beneficial to us as it provides greater consistency to the segment in any economic environment while the higher margin nature of this business compared to the consumer cannabis business contributes substantially more to our bottom line. Our international medical revenue was $11.6 million, and that reflected 35% growth versus the same quarter a year ago, but a 20% decrease sequentially. The increase compared to Q4 last year was due to our strong presence in key international growth markets, including Australia, Poland, and the UK. The decrease relative to last quarter resulted from the temporary situation of limited supply of high demand cultivars in Europe, coupled with a weakened euro.\n\nWe expect these supply issues to continue through Q1, but to improve in the following quarters. Taken together, our leading Canadian and global medical businesses performed well, generating $36.6 million in sales and adjusted gross margins of 62%, down only slightly from 64% in the prior quarter. Medical represents about 73% of our Q4 revenue and about 86% of our adjusted gross profit. This segment best distinguishes us from our competitors and is critical to Aurora's path to deliver a positive adjusted run rate as we exit December 2022.  Our Q4 consumer revenue was $12.6 million, a $2.3 million increase compared to last quarter.\n\nConsumer cannabis represented about 27% of our Q4 revenue and about 14% of our adjusted gross profit. The revenue increase was due mainly to $1.4 million from the addition of Thrive's consumer business, starting May 6th and the relative stabilization of our Canadian consumer business. Now, that being said, we do expect some short-term disruptions to Q1 consumer cannabis revenue due to the cyber-attack on the Ontario cannabis store distribution system and a significant labor strike at BC's liquor and cannabis distribution centers with our revenue exposure from these events being as much as $3 million in Q1. We do not expect this to impact our timelines to profitability.\n\nAs I just mentioned, our medical business is responsible for about 86% of our adjusted gross profit. SG&A, which includes R&D, came in at $49.3 million in Q4. However, this included $6.7 million in restructuring costs and $2.3 million in prior period employee-related accruals. This restructuring related to significant staffing reductions we took in June 2022 as part of our business and cost transformation plan.\n\nSo, excluding these costs, Q4 SG&A was $39.1 million. And this is our lowest level of SG&A in almost four years. Ultimately, we expect to drive SG&A for the existing cannabis business to below $30 million with a meaningful reduction expected in Q1 and the full savings being realized by December 2022. So, pulling all of this together, we generated an adjusted EBITDA loss in Q4 2022 of $12.9 million, compared to $11.4 million in previous quarter.\n\nThis is driven mostly by a change in the company's sales mix to more consumer revenue and sales in Q4, which yielded lower average net selling prices. Looking forward into Q1 fiscal 2023, we do expect to see an improvement to adjusted EBITDA, but that will be driven primarily by a reduction in SG&A to under $35 million in Q1. I would like to reiterate our commitment to annualized cost savings of $150 million to $170 million. These savings are evenly split between cost of goods sold and SG&A, and we are seeing them reflected in our P&L, either as they occur for the SG&A savings or as inventory is drawn down for production-related savings.\n\nWith the decisions we have taken, we are working toward a leaner, more agile operating model, and that is expected to provide strong EBITDA leverage as future revenues increase. During Q4, we also recognized non-cash impairment charges of $505.1 million. This is relating to goodwill, intangible assets, and other tangible assets. The impairment represents the full remaining goodwill balance associated with Aurora's cannabis operations and the impairment was partially due to changes in cannabis market conditions but most importantly, the changes in the current capital market environment, including higher rates of borrowing and lower foreign exchange rates.\n\nNow, finally, just a minor housekeeping item. Our upcoming fiscal year 2023 will only have three quarters as we are changing our fiscal year end to March 31st. And that's in order to achieve certain internal cost and staffing efficiencies. These include -- there are three key points from my financial review that I'd like to reiterate.\n\nFirst, our balance sheet is stronger than ever, supported by a healthy cash balance, reduced convertible debt level, and improving working capital and cash flow. Second, our medical businesses in Canada and globally provide us with a competitive advantage and are critical to us generating sustainable profitability. And finally, we've taken the actions to meet our targeted range for cost savings by December 2022. These will have a materially positive impact on our bottom-line and reflect a leaner operating model that positions us well for future growth.\n\nSo, thanks for your interest in Aurora. And I'll now turn the call back to Miguel.\n\nMiguel Martin -- Chief Executive Officer\n\nThanks Glen.  Here are four brief takeaways before we take your questions. One, we're better positioned than ever to achieve our goal of a positive adjusted EBITDA run rate as we exit the quarter in December of 2022, and we have listed out several data points that support that here today. Two, our medical cannabis business is a formidable force in the industry, both domestically and internationally. It remains the smartest cannabis segment to invest behind today, given the long-term growth opportunities, the high margins and the defensive nature of the segment described earlier.\n\nThree, the Canadian rec market is in the process of correcting. And as the recovery is complete, we will have added opportunity for market share and pricing. Four, our science and innovation program represent another high-margin opportunity that's just started. To conclude, we are making significant strategic progress with each passing quarter, we're nearing the completion of our business transformation plan, and have done so while strengthening our balance sheet.\n\nIn addition, we've made two acquisitions in the past few months, Thrive and then Bevo, which underscores our ability to grow organically and through M&A, and we feel confident that we can create significant long-term shareholder value, particularly from these levels. We appreciate your time and interest in Aurora, and now be happy to take your questions. Operator, please open the lines for questions.\n\nOperator\n\nThank you. [Operator instructions]. And our first question comes from the line of Vivien Azer with Cowen. Please proceed with your question.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nHi. Good evening.\n\nMiguel Martin -- Chief Executive Officer\n\nGood evening, Viv.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nSo, I just wanted to dig on -- dig into some of the revenue versus volume dynamics that you guys experienced in the quarter. Maybe it's as simple as FX headwinds, which we're very familiar with covering large cap staples. But usually your revenues and volumes, at least directionally, move in tandem, and it seems like there was a bit of a divergence there. So, I'm wondering if there is any geographic mix or other price mix considerations to call out, please.\n\nThank you.\n\nMiguel Martin -- Chief Executive Officer\n\nYou got it. Glen?\n\nGlen Ibbott -- Chief Financial Officer\n\nViv, I think what we saw was a bit of a mix change between consumer and medical. Our European medical did take a step down in the quarter, particularly in Germany as there is a cultivar there producing ran into few production problems. They are correctable. They are in process of being corrected.\n\nBut -- so, what we then saw, if you're looking at our average pricing, it's something -- is that consumer particularly with the addition of driving stuff, it's a greater impact from the consumer pricing than we normally see in the mix. So, that might be what you're looking at. But other than that, I think it was just kind of business as usual in terms of volume. So, you get that impact from more volume right through on the consumer business and lower average pricing.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question comes from the line of Michael Lavery with Piper Sandler. Please proceed with your question.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nThank you. Good evening.\n\nMiguel Martin -- Chief Executive Officer\n\nGood evening, Michael.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nI just wanted to understand some of your thinking on the portfolio strategy a little bit more. The greenhouse synergies with Bevo makes sense and take advantage of just your particular situation and obviously add -- help add some EBITDA. But are there any other adjacencies you'd be considering or that are on your radar, I guess just one part of it? And maybe related is just also as you think about the EBITDA target, is any more expected to come from M&A?\n\nMiguel Martin -- Chief Executive Officer\n\nYes. I mean -- so let me try to unpack that a little bit. I think as it pertains to M&A, our center of the play to where we sort of live is medical cannabis, global medical cannabis. And so, for that reason, certain things that have been of interest to others are probably not as much of interest to us.\n\nSecondly, our position on the U.S. I think is one that's been validated. It's going to take longer. I'm of the strong belief that it's going to be a -- if it's federal, it's going to be a medical construct with the FDA involved.\n\nAnd clearly, given our dominance internationally on medical cannabis would have a lot of options there.  So, if you take the U.S. out of the mix and you take maybe some other things out of the mix, you find certain things that maybe are more attracted to us than others. We liked Thrive and we've talked about that because of the management team and the ability to really support what I think important synergies between rec and medical. Bevo, we think is just an absolute diamond in the rough, incredible propagator of science, has a really clever use of tax benefits as it pertains to Sky and has a big upside of growth for what we thought was a fair value, both for us and for their shareholders.  So, I think, Michael, we'll continue to look at things like that.\n\nWe've been terribly patient. As Glen was pretty eloquent about the balance sheet, it's important to me that we have a really strong balance sheet, so we're not going to chase there. But if things come up, we've got the fire power to go after them. The only other place that maybe is of more interest to someone like us than maybe others are those things that connect into medical cannabis.\n\nIt's my opinion, and I think it's been proven out that you can make investments around medical cannabis, and those investments in some cases are portable around the world, infrastructure, systems, understandings around patients, and science, which is something we've made a lot of investments in, and they now are just starting to pay dividends. So, steady as we go. I think, we're pretty good shape. In terms of the EBITDA part, the reality is if we can hold revenues and margins flat from the current level and we can get SG&A under 30, you get there.\n\nAnd so, we expect to reach that type of SG&A by Q2, and we've shown a lot of progress. And I think, while some may have other questions, when we've said we're going to do something around efficiencies, we've done it. And that SG&A would clearly be consistent with that.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nOK. Really helpful. Thank you.\n\nMiguel Martin -- Chief Executive Officer\n\nThank you, Michael.\n\nOperator\n\nOur next question comes from the line of Pablo Zuanic with Cantor Fitzgerald. Please proceed with your question.\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nThank you. Good afternoon. Miguel, I'm looking at a press release Tilray issued on September 6th, and it says \"Tilray initiates roundtable with German regulators to kick-off draft legislation, to legalize adult-use cannabis in Germany.\" And I'm wondering when I saw the press release, I said, well, I mean, I suppose that Aurora will soon issue a similar press release. So, I guess, the question -- the very basic question is, can you tell us, or give some color about your lobbying capabilities, your people on the ground, your potential seat at the table in helping draft the German program.\n\nBecause again, I was surprised, Tilray issued a press release, and we didn't hear from you. And if it may add, a part b to the question, where do you guys stand today in terms of whether Germany will allow imports or it's going to be initially mostly just domestic production? Thank you.\n\nMiguel Martin -- Chief Executive Officer\n\nYou got it. So, the first thing is I'm not here to comment on anybody. I have tremendous respect for my competitors, and what they do is what they do. But -- so I don't really have any comment on that.\n\nIn terms of the German market, we've made a significant investment in Germany. We have what we think might be one of the leading government relations, government affairs executives in Germany. He is having good conversations with the regulators. I've spent my whole career working on things like this in both, tobacco and alcohol, and they're never a straight line.\n\nI think, as it pertains to Germany, there's two things going on as you well know and you've written a lot about, is both enhancements to the medical business, which we're very excited about as one of the leaders in medical cannabis in Germany, and secondly, is the legalization of the rec business. So, my understanding and our understanding is that industries -- what industry needs in order for that to be successful is being considered. The German government is -- almost always are being very thoughtful about the stakeholders and the timing in which this can be done in a compliant way. I would expect their learnings from medical will color how they so go about the implementation of rec business, which is why we think those companies that have facilities with the medical business advantages in rec, and as we said earlier, one of only three companies that have a license to produce in Germany.\n\nNow specific to your question about in-country, I think the going in position I think for most folks should be that because of the UN conventions and just because of the way the regs are going to work for rec is that the most obvious path for rec would be in-country manufacturing. Now, clearly whether the number is 200 tons or 300 tons or 400 tons in order to service that rec market, that is significantly more capacity than three of us have. But clearly, that would be an opportunity there. We also would say that while rec most likely would be an in-country production exercise, medical continues to be allowed with an EU GMP certification to have products brought into Germany.\n\nWe do that successfully today from both, our Nordic facility as well as our Canadian facilities. And we think it's one of our core competencies. So, more to follow in Germany, I understand the interest in it. I think what I would tell people is it's going to move thoughtfully.\n\nIt might not always be a straight line, but we have tremendous respect for the regulators there in what we've seen from the medical business. And I think, my expectation is that it will be a robust rec business. I just can't predict when, but at the time it will be compliant companies, experienced companies and thoughtful companies will have an advantage in Germany. And then clearly Germany implements this, that will be a beacon for other key markets around the world in terms of how you can go from medical cannabis and to recreational cannabis.\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nUnderstood. Thank you.\n\nMiguel Martin -- Chief Executive Officer\n\nYou got it.\n\nOperator\n\nOur next question comes from the line of Andrew Carter from Stifel. Please proceed with your question.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nYes. Thank you. Focusing on the Bevo business, which we certainly have experience with covering site one. Number one, do you see this platform to go deeper in this, given that this is a very fragmented space, and you now have a team to run that? And then, the second you have the decision to repurpose Sky versus selling it, which -- that's an opportunity cost that if you will kind of adds to the cost of acquisition.\n\nWhat kind of timeline are you giving the Bevo team to get this up to speed, achieve a return, versus if it didn't go well, kind of returning to that original selling the facility and also getting rid of all of the costs associated with it? Thanks.\n\nMiguel Martin -- Chief Executive Officer\n\nYou got it, Andrew. So, first on Bevo, Bevo is a tremendous business, and you guys did cover it and so did others. I think it is a fallacy to say that Bevo didn't work in that previous construct when it was connected to another cannabis company. Bevo did work.\n\nIt's just that combination did not work. We are not combining Bevo with Aurora from cannabis assets and non-cannabis assets. So, there's that. Secondly, Bevo is a tremendous business.\n\nThey have significant big box contracts, both in Canada and the U.S. And there is a lot of opportunity right now in North America for them to expand that business, both in Canada and the U.S. because of shipping costs. And many of the items that they produce are produced offshore in Asia and Southeast Asia.\n\nAnd so, they have tremendous opportunities there. And we're excited about that, particularly since it can be done in a very capital-light manner. It's not going to draw down cash resources from Aurora that would expand that.  And the team that has so successfully run it is going to continue to run it. This is not -- Aurora does not pretend to have excellence in orchids or propagation.\n\nSo, it was key for us to have those key folks, Leo and Andrew and those key guys over there to run it, and we are thrilled about that. As it pertains to Sky, listen, I don't want to get too pumped-up about this. But the combination of the tax benefit, the repurposing, the changes in the tax designation and the upside that it presents very quickly for Bevo was a way better deal than being caught up with everybody else trying to sell cannabis assets. And at the end of the day, if they can't get there, we can always sell it in that key Edmonton market.\n\nBut the beauty, if there is such a thing, of all the money that's been spent on Sky, is there is not a lot of capex or opex required by Bevo in order to generate revenue. So, as Glen mentioned, the Bevo business is a bit seasonal and it contributes more in our Q2, Q3 than it does in Q1. But to answer your question, I think we'll know, in say next nine to 12 months exactly what Sky means for Bevo. And if it doesn't work out, we still have that optionality.\n\nBut the offset of all the things I've mentioned make that play significantly a better advantage for Aurora than just selling it for pennies on the dollar.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nThanks. I will pass it on.\n\nMiguel Martin -- Chief Executive Officer\n\nYou are very welcome. Thank you.\n\nOperator\n\nAnd our next question comes from the line of Andrew Bond with Jefferies. Please proceed with your question.\n\nAndrew Bond -- Jefferies -- Analyst\n\nHey. Good evening, Andrew Bond on the line for Owen Bennett. Thank you for taking our question. So, from us, on the international segment, can you give us some more detail on performance between markets? Not looking for an exact breakout, but I think last earnings call, you all discussed plans to launch extracts in the UK in 4Q and also some top market share positions in the other key markets like Australia, Germany, Poland.\n\nSo, any detail on where sales came from in 4Q and where there might have been some weakness relative to 3Q? And if I could just sneak in maybe more broadly, how you would characterize growth ahead in fiscal '23? Thank you.\n\nMiguel Martin -- Chief Executive Officer\n\nSure. Let me take a top-line comment about international and some of those key markets, and I'll Glen get into some of the details about it. So, as we said in our prepared remarks, it is really important to be operating in a lot of countries. You got to operate in the right countries.\n\nAnd so, the reason for that is, these sales are still a bit lumpy. We've all seen that in what's happened with Israel. But whether it's import permits or shipments or the regs sort of evolving, you get these, sort of, months where these sales and you have these months you don't. Secondly, a lot of these investments can play out and really generate incremental margins and revenue, if they are laid over a broader system.\n\nSo, the same production system, the same cultivars, the same genetics, the same a lot of things are similar to what we do in Germany, Czech Republic, Poland, on and on and on.  Now, you have to have different distribution models to take advantage of those different pieces, and we have done that. And so, in most markets, we are just the manufacturer, but in other markets, we have a sales force and a wholesale piece. The Western European or the international market as a whole is absolutely growing and clearly is the fastest growing segment of global cannabis, which is this medical piece. And I will say that the regs are quite similar, whether that's packaging, stability testing, manufacturing, EU GMP, there has been this sort of consistency and evolution that advantages a company like us.  Now, in terms of the actual specifics on the country breakouts, Glen, I'll turn that over to you.\n\nGlen Ibbott -- Chief Financial Officer\n\nYes, thanks. So, I mean, we keep calling out the same countries as kind of the dominant ones for us in our network and that's Germany, Poland, UK, and Australia. But to Miguel's point, they definitely are lumpy, like Australia for instance in Q4 was up 75% from the previous quarter. But then as I look at Q1, it'll come down again and Q2 looks good again.\n\nSo, it's very -- we've called it a lumpy or something, and that's why it's really important to have that portfolio, because for the most part our international business is fairly predictable, but country by country, as they develop and as they find where those barriers are that need to be knocked down, patient access, things like that. And that was definitely the story in Australia a year or two back when they had to improve patient accessibility, and then the market seems to be really kind of taking off.  In terms of our extract in Germany, we did launch in Q4 -- late in Q4. So, we don't see much in terms of revenue in Germany, in Q4, but it is an important part of the competitive landscape there. So, we are in that market now, and we'll report more as we go forward on how that piece of our business is going.\n\nSo again, Germany, Australia, UK, Poland, being the predominant international medical markets for us right now. But I'd say, there's probably at least four or five others that are contributing revenue in Q4.\n\nAndrew Bond -- Jefferies -- Analyst\n\nGot it. Thanks, Glen. Thanks, Miguel. Appreciate it.\n\nI will pass it on.\n\nMiguel Martin -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Matt Bottomley with Canaccord Genuity. Please proceed with your question.\n\nMatt Bottomley -- Canaccord Genuity -- Analyst\n\nGood evening, everyone. Thanks for taking these questions. Just two questions for me on the revenue side of things. First just on the consumer sales in Canada, there's a bit of a divergence I think was noted with respect to Aurora sales relative to the macro level data on some of these point of sales subscription services we all look like.\n\nSo, Glen, you had mentioned some of the headwinds related to maybe the OCS website or some others. So, I'm just wondering if you can give us a little more color on that. And the second question on revenue is just related to your international sales is the current $11 million to $12 million that you did in Q4. If that just stays flat for the sake of argument, is that sufficient to get you to your profitability targets on an adjusted EBITDA considering a lot of your margin does come from those sales.\n\nThanks, guys.\n\nMiguel Martin -- Chief Executive Officer\n\nYes. Let me comment on syndicated data, and then Glen can obviously give you the background. One of the gaps in some of this syndicated data that everybody looks at is Quebec. Quebec is our largest province in terms of sales.\n\nAnd so, it underweights what we're doing. I think, generally the rec business overall for an LP is generally challenging. It was referenced before what happened with the hack, unfortunately in the OCS that caused about two weeks of disruption. They did an unbelievable job to get back up and running.\n\nWe also saw the strike out in BC that had a pretty significant effect for a long period of time. That's been cleaned up as well. I think, the combination of that, and retail stores feeling a lot of pressure plus compressed margins overall means you really have to be sort of focused in where we went and the Thrive team's done a tremendous job. And you can still -- there's still places you can find to make money, premium flower obviously, but vapes, concentrates, and some of the other things that they're particularly good at.\n\nSo, I think, we're going to be in this wash a little bit longer in terms of what the macro sort of issues are with rec. But when it comes out, there is tremendous amount of efficiencies for someone that does as well as we do in medical and rec to have some of those items, particularly as patients are starting to look for more premium items, and clinicians are starting to be more open to variety. So, Glen, you want to pick up the rest of it?\n\nGlen Ibbott -- Chief Financial Officer\n\nYes. Thanks very much, Miguel. Yes. So certainly, consumer revenue at the current levels would be more than adequate to get us to our profitability goal.\n\nIf you -- certainly picking up the message that most of our gross profit is being generated out of our medical businesses. So, 86% in Q4, and that was a quarter where our international medical had a little bit of a pause. So, normal, the quarter before say Q3 was 90% of our gross profits were coming out of our medical system. So, absolutely as we see growth picking up again in Europe and Australia over the next number of quarters, Canadian business, the objective is to stabilize it, getting on good footing and give it a launch pad for growth in the future.\n\nBut the short-term plan is to really get to our profitability goal on the back of our medical businesses.\n\nMatt Bottomley -- Canaccord Genuity -- Analyst\n\nOK. Appreciate all that. Thanks, guys.\n\nOperator\n\nOur next question comes from the line of Frederico Gomes with ATB Capital Markets. Please proceed with your question.\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nHi. Good evening. Thanks for taking my questions. So, just on the international side, we are seeing some increased competition in some markets, namely Israel, several other LPs and international companies exporting to different markets.\n\nSo, can you talk about how you see that competition coming? Are you seeing any margin pressure in international? And what sort of advantages do you have to compete in your main markets, like Germany and Poland? Thank you.\n\nMiguel Martin -- Chief Executive Officer\n\nSure. So, listen, I've spent a lot of time in Israel and Israel is obviously a key market for a lot of folks. The challenges we've talked about in Israel is they have a significant amount of local production. And clearly that has advantages.\n\nSo, the import permits and the process, and the certification of Israel is sort of an evolving one. What we've said about that is that we're not going to give any forward-looking guidance on Israel. But when we have a shipment, we always let people know because of the size of it. I'm not -- we haven't had a shipment in a bit on Israel.\n\nI don't think that's a forever situation. But right now, it's not as big a focus because -- and to your point, there has been a little bit of margin compression and a lot of people are fighting for that, including the local growers that have a lot of advantages. And I've got tremendous respect for that. Overall, internationally, because of the medical setup, we haven't seen the type of margin compression that you've seen in the Canadian rec business or in the U.S.\n\noverall. And these are really hard markets to get into. Germany, which everybody talks about is about a six to 12-month process in order to even qualify a cultivar. The variance on the potency can only be 10% in their lab, which is a very difficult standard to get to.\n\nAnd there's a significant amount of other work that you have to do around stability testing and whatnot.  The other piece of this is the fact that patients are quite sticky. Once they find something they like, whether it's ours or a competitive product, unlike rec where you see massive share movements between top SKUs, you don't see that in the medical business. And there's clearly first mover advantage, there's clearly a consistency advantage to those companies that can keep stuff in stock and are rolled out of the medical market.  So international cannabis, in most markets you're seeing maybe four companies, possibly five companies making up the lion share of sales. As we've all talked about, Canadian rec as an example of top five companies do less than a third of the overall business.\n\nAnd so, I think the international business has proven to be sticky. And as you go forward with the advent of things such as clinical research, partnership with clinicians, these systems getting bigger, I think you're going to still see in most markets, big markets like Germany that three or four companies will do the lion's share of the business for a long time, and we expect Aurora to be one of them.\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nGot it. Thank you, Miguel.\n\nMiguel Martin -- Chief Executive Officer\n\nYou are very welcome.\n\nOperator\n\nOur next question comes from the line of John Zamparo with CIBC. Please proceed with your question.\n\nJohn Zamparo -- CIBC World Markets -- Analyst\n\nThanks. Good evening. I wanted to get back to Bevo. And if we think about the evolution of Aurora over time, it used to be a pretty broad, expansive business as multiple segments, then narrowed down to be purely cannabis.\n\nAnd Bevo is certainly outside the core strategy of what the company was. But what I'm wondering is, should we view this as Bevo was trying to optimize the decision with Sky, or do you want to further diversify the business away from pure cannabis at this point?\n\nMiguel Martin -- Chief Executive Officer\n\nI think, John, and sorry, I know we talked about -- I missed you and your folks this week. Here's how I would think about Bevo. Everything that we do is about being a global leader in medical cannabis. In order to do that, there are two things that we have been innately focused on.\n\nOne is profitability and secondly is strengthening some core underpinnings that we think will be an advantage to that pursuit of global leadership in medical cannabis.  Bevo was really interesting to us for a couple of reasons. One is about Sky. And so, the tax option there, the use of Sky, the ability for it to very quickly, without capex, produce a significant amount of predictable, profitable revenue was important to us. Secondly, there are synergies and efficiencies.\n\nWe haven't gotten into them yet and we are not going to do it in a disruptive way. But propagation has always been this sort of interesting play in cannabis. And while it's done in the U.S., it's not really done in Canada. And so, the excellence of 80 plus years around propagation, science, there will be things that will come out of the Bevo system or the Aurora system that will be additive.\n\nAnd as we look at agriculture, as a general sort of play and things around it, we do see it's additive. Now, I don't -- the concept of adjacency, I do believe in staying close to the core. But, if there are things that are profitable, there is a good value for our shareholders and is additive both financially and thematically, particularly from a science standpoint to our overall mission, I think we're going to be interested in that. And I'm pretty proud of this deal for a lot of different reasons, but proof's in the pudding and I don't want to get over my skis too much on it.\n\nBut this is a really great team, a really good use of assets, capex light, and produces a lot of strength for us. So, we'll see.\n\nJohn Zamparo -- CIBC World Markets -- Analyst\n\nThat is helpful. Thank you.\n\nMiguel Martin -- Chief Executive Officer\n\nYou are welcome.\n\nOperator\n\nAnd our last question comes from the line of Tamy Chen with BMO Capital Markets. Please proceed with your question.\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nHi. Thanks for squeezing me in. My question is on the science side, particularly the licensing of genetics. Miguel, I was just curious, this particular aspect of the science business, how do you see that fit within the overall Aurora business? Like, is this an area that you're very focused on you do want to expand? Like, what's the opportunity size that you see? And I guess, the last part of the question I have is, whatever genetics that do come out of your R&D and innovation that are good, I'm just wondering like why don't you just keep that for yourselves and grow it for your own business, whether it's your own medical or consumer segment? Thank you.\n\nMiguel Martin -- Chief Executive Officer\n\nYou're very welcome. So, it is something we're focused on. Aurora has spent an inordinate amount of time and effort on this. And it may be, I don't want to say it is, but it may be one of the largest genetic facilities connected to cannabis in the world.\n\nAnd so, as it pertains to that, there are significant advantages, not just around variety and uniqueness of the cultivars, say chasing potency, and terp levels. Plant health, I referenced yield, farm gas is twice, 2x, the yield per square meter than some of our historical cultivars that totally changes footprint and all types of different things that are going on. There's incredible work being done on things like powdery mildew. And so, what I've seen is that when you look at other agricultural categories, there are companies that are not branded that are not participating from a manufacturing standpoint of selling their items, but they're genetics, their science, and they are participating in those markets.\n\nAnd we're all familiar with them. No, one's really doing that today on a global scale, and we think there's a space there. I also don't view it as a conflict. We have about a three share in the rec business.\n\nWe have a 24 share in the Canadian medical business. And we have enough assets in order to serve our pipeline, both domestically and internationally as well as sell that. And some of these licensing deals are very innovative and to be honest are not overly creative. And you see them in other categories such as soybean and vegetables and tomatoes and other things that were around because of some of our partnerships.\n\nAnd so, like I said, we're excited about this. The last part of this, while there are some LPs doing this, there is a huge gap from particularly Canadian LPs and accessing world class genetics. They just haven't done the work, and it's not something you can snap your fingers and start up. This is a five or 10-year process in breeding and genetics and in training in order to be there.\n\nAnd so, we're excited about what it means for us. And you see some of those -- some of that stuff in the market. We're also excited about what it means, from -- for being able to sell it and generating revenue streams. Because the reality is we're not going to have a 50 share of the rec business.\n\nAnd unlike some of my past businesses where we've been having these massive market shares, so there's plenty of place to do it. And as this stuff evolves, it's our hope we'll be able to sell genetics internationally as well. So, I think it's a great play. Almost the entirety of that spend is already accounted for.\n\nAnd we think there's huge upside in not only for us, but for others in accessing those genetics and those incredible sort of science innovations.\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nOK. Thank you.\n\nMiguel Martin -- Chief Executive Officer\n\nYou are very welcome. Appreciate the question.\n\nOperator\n\nWe have reached the end of the question-and-answer session. I'll turn the call back over to Miguel Martin for closing remarks.\n\nMiguel Martin -- Chief Executive Officer\n\nListen, I appreciate everybody's interest. Our plan is absolutely on track. And I understand, as I mentioned with the regulations that the progression of a successful cannabis company is not a straight line. But in terms of the cost efficiencies, we've done and will do what we've said.\n\nWe've focused on those areas of the business that is profitable. And we do see an upside. And as these markets continue to come online, it's been medical first and then rec, and we think Aurora is in a great position. So, we appreciate your support.\n\nWe appreciate your interest. And we look forward to sharing our progress as we move forward. Best to all and your families, wish you all the best. And we'll go from there.\n\nThanks, everybody.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAnanth Krishnan -- Vice President, Corporate Development and Investor Relations\n\nMiguel Martin -- Chief Executive Officer\n\nGlen Ibbott -- Chief Financial Officer\n\nVivien Azer -- Cowen and Company -- Analyst\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nAndrew Bond -- Jefferies -- Analyst\n\nMatt Bottomley -- Canaccord Genuity -- Analyst\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nJohn Zamparo -- CIBC World Markets -- Analyst\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nMore ACB analysis\n\nAll earnings call transcripts"
}