{
  "companyName": "Honda Motor",
  "companyTicker": "HMC",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/honda-motor-hmc-q2-2023-earnings-call-transcript/",
  "content": "Honda Motor (HMC -0.17%)\nQ2 2023 Earnings Call\nNov 09, 2022, 2:00 a.m. ET\n\nOperator\n\nThank you very much for attending. This is Honda Motor Company FY '23 second quarter financial results announcement meeting. First, I'd like to introduce the executives represented. Director, executive vice president and representative executive officer, CFO, Kohei Takeuchi.\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\nThis is Takeuchi speaking. Thank you.\n\nOperator\n\nOperating executive and head of accounting finance supervising unit, Eiji Fujimura.\n\nEiji Fujimura -- Head of Accounting and Finance Supervisory Unit\n\nHow do you do? I am Fujimura.\n\nOperator\n\nI would like to ask Takeuchi to first announce the FY '23 second quarter financial results and FY '23 forecast, followed by Fujimura, who will give the details on the above. Mr. Takeuchi, the floor is yours.\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\nFirst of all, I'd like to thank all of you for your support toward Honda products and activities. I'd like to thank our customers and all stakeholders. Thank you. We apologize that the delay in vehicle production is causing inconvenience to our customers who are awaiting Hondas products.\n\nWe are working hard to deliver our products as soon as possible. We hope to gain your understanding. I'll then explain the financial results for the second quarter of FY '23 and give a summary of the focus for the fiscal year. First, FY '23 results.\n\nIn this difficult business environment, including the semiconductor shortage, driving down automotive production and unit sales combined with soaring raw material prices, Honda has been making companywide efforts to improve profitability. In addition, the increase in motorcycle unit sales and the impact of yen depreciation as sales revenue and operating profit for the first six months have increased year on year. In the second quarter, specific semiconductor shortage affected production of main models mainly in North America. But we made worldwide production allocations, utilized substitute parts, and replaced models sold, resulting in a year-on-year increase in group unit sales of automobiles.\n\nIn addition, sales revenue, operating profit, and profit for the period of all -- and all increased year on year due to price increases, commitments commensurate with improved product value, and strong motorcycle business, and impact of the yen's depreciation. In the FY '23 forecast, group unit sales of automobiles is lowered by 100,000 units to 4.1 million units, taking into account the impact of semiconductor supply shortages. In addition to the decline in unit sales, we expect to see continued inflationary pressure on costs. However, we have revised upward a previous forecast for sales revenue, operating profit, and profit for the period, reflecting profitability improvement efforts, motorcycle unit sales increase, and recent weak yen.\n\nDespite the challenging business environment, Honda will continue to accelerate initiatives for electrification and new growth in preparation for the future. Next, the status of our automobile business in major markets. First-half sales decreased from the same period year on year due to semiconductor supply shortages and others despite the positive effect of new model launches. In the second quarter, sales in Japan and China increased year on year.\n\nBut in the US, shortage of certain semiconductors drove down production of mainstay models and inventories at dealers. Although demand is expected to be firm, we have revised downward our previous forecast for FY '23. In the second quarter, Honda announces initiatives for electrification. In the U.S., Honda has agreed with LG Energy Solution to establish a joint venture to produce EV batteries and to manufacture them in the state of Ohio.\n\nHonda has also decided to develop the three existing plants in Ohio as home to EV production in North America. In China, Honda has established a new JV with Dongfeng Motor Group and also Guangzhou Automobile Group to procure EV batteries. In addition, we signed an MOU with CATL to further strengthen a partnership aiming to establish a long-term stable procurement system in China and further its competitiveness that will continue to accelerate its efforts toward electrification. Next to the motorcycle business status.\n\nAlthough there were some effects of semiconductor supply shortages, sales in many countries were higher than in the same period of the previous year due to replacement of models sold and the use of subsidized parts, etc. In Vietnam, we recorded record-high sales for the month of September. Although sales in Pakistan affected by flooding, as well as China and other countries dropped, sales in India, Vietnam, and other countries were strong, leading to an upward revision of the previous forecast for consolidated FY '23 unit sales. In September, Honda announced its launch -- it will launch more than 10 electric motorcycle models globally by 2025 and 3.5 million units by 2030 to achieve carbon neutrality.\n\nHere is an overview of the first half of FY '23. Despite a decrease in automobile production and unit sales due to semiconductor shortages and rising raw material prices, operating profit increased 11.2 billion yen, reaching 453.4 billion yen, due to price increases commensurate with enhanced product value and reduced incentives, as well as increased motorcycle unit sales and currency impact. Earnings per share attributable to owners of the parent was 338.5 billion yen may be attributable to share of profit of investments accounted for using the equity method of Japanese affiliates. The table shows unit sales and profit and loss.\n\nNext, consolidated FY '23 forecast. Although we expect to see continued pressure on costs in addition to the impact of lower automobile unit sales, we revise upward the forecast on operating income by 40 billion yen to 870 billion yen, reflecting further efforts to improve profitability, including higher motorcycle unit sales in India, Vietnam, as well as other countries, us, and currency impact. Earnings per share attributable to owners of the parent is revised upward by 15 billion yen to 725 billion yen. Exchange rate assumptions are 135 yen to the dollar for the second half, 135 yen to the dollar for the full year.\n\nUnit sales and profit loss are shown in the table. As for dividends, interim dividend is 60 yen per share. The annual dividend forecast remains unchanged and is 120 yen per share. Honda will continue to strive for stable and sustainable dividend payments, aiming for a consolidated dividend amount payout ratio of 30%.\n\nRegarding a share buyback announced on August 10, as of October 31st, the total number of shares repurchased was 15.33 million shares at a total cost of 53 billion yen. Fujimura, operating executive and head of accounting finance supervising unit, will give the details.\n\nEiji Fujimura -- Head of Accounting and Finance Supervisory Unit\n\nLet me explain. Honda Group's cumulative unit sales until the second quarter FY 2023 were as follows. Motorcycle business has 9.2 million units sold, mainly with incremental sales in Asian countries year on year. And automobile business has 1.785 million units due to the decline in sales in North America.\n\nAnd power products business has -- it was a 2.935 million units due to decline in North America. Next, let me explain factors behind the ups and downs of our profit before income tax for the first two quarters year on year. The profit before taxes were 515.8 billion yen, a 44.5 billion decline year on year. Operating profit was a 453.4 billion yen, up by 11.2 billion yen year on year.\n\nExcluding factors of foreign currency impact, the profit was practically negative by 141.9 billion yen. The breakdown is as follows. Regarding impact on sales, profit declined by 100.1 billion due to reduction in unit sales, changes in model mix, and this -- profit decline in financial businesses. Regarding impact on retail prices and cost, there were impacts by surging raw materials prices and product pricing, reflecting product value improvements.\n\nHowever, the profit increased by 8.2 billion yen. Regarding our miscellaneous expenses, profit declined by 41.9 billion yen due to quality-related costs. And regarding research and development expenditures, profit declined by 8.2 billion yen. In terms of sales revenues and operating profits in each of the business categories, operating profit in motorcycle business was 224.7 billion.\n\nAnd of the -- automotive businesses' OP was 63.5 billion. And our financial services businesses, it was 153 billion yen. Out of the automobile and financial services businesses combined, the operating profit associated with the automobile sales is estimated to be 211.3 billion yen when aggregated together. Next, operating profit of the power products and other businesses was 12 billion yen, which include operating losses of the aircraft and the aircraft engine businesses being 12 billion yen.\n\nNext, I'll explain about cash flow situations. Free cash flow of the nonfinancial services businesses was 153.3 billion yen. Net cash at the end of the second quarter was 2,560,900,000,000 yen. Let me talk about our forecast of our consolidated business performance for FY 2023.\n\nWith regard to the Honda Group's unit sales in the motorcycle business as compared to the previous forecast, the expected unit sales will be 18.43 million, mainly reflecting the flood in Pakistan and demand decline in China and so on. When consolidated, we expect unit sales to be 12.02 million units, up by 360,000 units, reflecting a good sales performance in countries such as India and Vietnam. Unit sales expected in our automobile business would be 4.1 million, mainly reflecting a decline in North America. For power products businesses, we maintain the previous forecast of 5.665 million units.\n\nNext, I'll explain factors behind our ups and downs of profit before income tax as compared to the results from last year. We expect the profit before tax to be 1,80,000,000,000 yen, up by 9 billion yen year on year, and operating profit to be around the same level from the results of the last fiscal year. Excluding foreign currency impacts, we expect negative profits of 287.2 billion, of which the breakdown was as follows. For the impact of the sales, profit will be increasing by 41.8 billion yen due to unit sales increase of motorcycles and automobiles.\n\nRegarding retail price and cost impact, profit will decline by 110 billion due to soaring raw materials prices and so on. Regarding miscellaneous expenses area, our profit would decline by 152 billion due to incremental sales and quality-related cost. For research and development expenditures category, we expect the profit to drop by 67 billion. Comparing our new expectations to the previous forecast, the difference is as follows.\n\nProfit before income taxes will be up, revised by 40 billion -- operating profit to be revised by 40 billion yen. Excluding foreign currency impact, we expect -- we expect a negative profit of 80 billion yen, for which breakdowns are regarding our sales impact, down by 128 billion yen mainly due to unit sales decline in automobiles. And in the area of the retail price and cost impact, although some cost increases are expected due to inflation impact, we will manage price pressure in good practices to reflect enhanced product values to add profits by 36 billion yen. Regarding research and development expenditures, we expect the profit to go up by 16 billion.\n\nFinally, [Inaudible] depreciation and amortization, as well as R&D spending for FY 2023, we revised the previous expectations to reflect the currency impact. That concludes my explanation. Thank you very much. \n\nOperator\n\nThank you very much. Thank you for the attention. And now, we'll proceed to Q&A. We have informed the media beforehand, we will take questions soon.\n\nAnd in the interest of time, we kindly ask you to limit your questions to two per person. We seek for your cooperation. [Operator instructions] We'd like to go [Inaudible]\n\nUnknown Speaker\n\nMy name is [Inaudible] from [Inaudible] newspaper. Can you hear me?\n\nYes.\n\nI have two questions. First, well, currently, we're seeing a depreciation of the yen. And this has boosted your profit. But can -- in order to maximize your benefit when it comes to production and procurement, what kind of ideas will you come up with? Honda localizes its production, but are you making any changes to your approach? The second question, worldwide, there is a concern of a recession at your major markets, US and China.\n\nHow do you see the prospect of the economy?\n\nAll right, Mr. Mizushima. With -- with regard to your exchange rate question, as you rightly mentioned, we do have the policy of producing where the demand exists. This is a basic policy.\n\nThat is how we have set up our production sites. And so, it's locally produced and locally consumed, meaning that we are -- well, of course, given the major fluctuation in the currency rate, it does have an impact to a certain extent. But compared to other manufacturers exporting from Japan, compared to those major manufacturers, I don't think the impact is that big. Well, having said that, still, I have to explain the currency impact of the US denominated only.\n\nIf there's 1 yen, there is a difference of the current situation, there is a swing of 10 billion. It used to be 12 billion, but it's now 10 billion, which half is the export of components or the royalty we see from overseas. So, it's mainly cash flow. And also, we generate profit overseas and we convert this in Japanese yen.\n\nIn that conversion, we have a half of the difference. So, that is the impact of currency. But as for the yearly forecast, we are estimating that 135 yen against the dollar. And so, this would be an impact of 120 billion yen in profit.\n\nBut still, the supply chain, we have suppliers and others relationship. So, it's not the case that we can immediately shift our production to Japan. Basic philosophy is to produce where the demand exists would remain in place. That's in regard to your currency question.\n\nAnd about the US and China's economy. Well, as -- well, the midterm election is being -- the vote count is underway right now in the United States. Given the 8% inflation, continuing toward the end of the year, as everyone says, there is likely an impact on the economy. So, we also share that concern.\n\nBut if we look at the current situation, our car supply, well, for certain months due to the shortage of semiconductors, we have lost some unit sales, but the customers are waiting for our products. So, looking at the current situation in regards to our customers, we believe that the cars we produce will be purchased by our customers. But economically, as is being said, the interest rate increase and inflation occurring, and therefore, there will be some impact to a certain extent. And keep this in mind, we will continue with our operation.\n\nLikewise, in China, there -- the Chinese GDP compared to a few years ago is declining, but automobiles, annually, the passenger car is about 23 million units per annum. In line with that, especially the market -- electrification, well, last month also -- this month, we see 20% or 19% ratio. And therefore, we have this EV car on the market and the first one. So, we have announced the second.\n\nWe are focused on electrification, and we want to meet our customers' demands also in China. And this is how we want to market our products in China. Thank you.\n\nOperator\n\nThank you very much, Mr. [Inaudible] So, next question [Inaudible] newspaper, Mr. Nakamura, please.\n\nUnknown Speaker\n\nNakamura from [Inaudible] newspaper. Can you hear me? Two questions. First of all, sales, the price increases in oversees and also potential price increases in Japan, please share with me the potential. And Japan and South Asia markets are good, and what is reason behind, and how long do you think it would continue on going forward? The motorcycle business.\n\nSo, thank you for your question. Pricing, retail price situations, and the pricing reflecting the product values, that's how we call it. And in the U.S., including inflation situations, we are -- we're repricing that to reflect our values of the product, of course. Raw materials price is soaring, and those safety equipments are rearranged as well, including all that.\n\nPeople buy the products. And in the U.S., the stock level is quite low, including that situation. We try to price the products in appropriate level for them to buy. And in Japan, when we have such a soaring raw material prices, of course, that has the impact on the revenue.\n\nHowever, we also have a sort of relationship with our, like, competitors. The peer companies in the same industries, we look at how they are reacting, and if necessary, we would do repricing -- increasing the prices. But at this moment in Japan, we do not have a specific information as of today. And as for the motorcycle situations, thankfully, in the second quarter, the motorcycle business performance was very good.\n\nSpecifically, the best area is Asia markets. Specifically, Vietnam, Thailand, number of the units sold was very good, which gave -- gave us additional revenue. And how long would that continue? Well, as of now, without any economic turmoils or declines for this term, Thai and Vietnamese market will continue as it is, perhaps. And also, for the motorcycle businesses, we have EV electrification plans for India and other countries toward.\n\nIn India, there's -- excuse me -- in Indonesia, from 2030 and '35 and including that, we will try to come up with appropriate pricing and so forth for the electrification plans with the motorcycle. Thank you.\n\nOperator\n\nNext question. OK [Inaudible] please.\n\nUnknown Speaker\n\n[Inaudible] Can you hear me?\n\nYes.\n\nWell, about automobile, about the unit sales price forecast in North America, you said that it's been reduced. Well, I think there might be some differences in the semiconductor shortage depending on the region. So, what about Japan and North America and Asia? Can you give some regional differences? And do you think that this is likely to continue? What is likely to happen in the next fiscal year? That's the first question. The second question is about the way of thinking toward the exchange rate.\n\nWell, it's contributed to the profit to quite an extent. But if this continues the longer, I think there might be some challenges ahead. So, can you candidly share with us how you assess the currency forecast?\n\nThank you very much [Inaudible] First, about the units -- the automobile units, due to the shortage of semiconductors, we have downward revised by 100,000 units in U.S. And we are trying to catch up here in Japan and Asia. But it's a 100,000 unit downward revision. As I already explained earlier, it is a specific type of semiconductor that has this issue with -- semiconductor and it has an impact on our CR-V, Civic.\n\nAnd so, for these specific models, we have seen this impact of the shortage in the second quarter, and this was the situation. In North America in the second half of the year, we think that will be difficult to increase the production. So, therefore, it's difficult for us to catch up. And this is a downward revision for U.S.\n\nWhat about China? When it comes to China, naturally, the first half, there was the impact. By the second half, the production system is such that we think that we can catch up. And therefore, we think that we can catch up. Meanwhile, in Asia -- you mentioned about Asia, Indonesia, etc.\n\nThe numbers are growing, and therefore, as I said, it's not -- well, the cars in Asia are relatively small. So, for the smaller cars, there are the semiconductors available, so we can catch up there. But the supply of semiconductors this fiscal year, we have inconvenienced our customers to quite an extent we apologize about. There, well, the old semiconductors sometimes experience a shortage, so we have to try to observe carefully.\n\nAnd we need to monitor carefully the situation because there are some abrupt incidents occurring in the supply. Now, about the currency situation, as I've already explained, we believe that we should be producing where the demand exists. Therefore, the currency impact is limited. But given the fluctuation occurring in such a short period of time, this volatility does have an impact.\n\nWe cannot hedge against this. We need to have a currency where there is long-term stability. That is all. Thank you.\n\nOperator\n\nThank you, Mr. [Inaudible] Next question [Inaudible] Ms. [Inaudible] please. Ms.\n\n[Inaudible] please. \n\nUnknown Speaker\n\nThank you very much. [Inaudible] speaking. Thank you. Two questions.\n\nFirst one, operating profit of automobile businesses as compared to last year is a little bit lower. And as you said before, of course -- do you have any additional explanations at the top of the presentation about this? In what situation can you expect the OP to go up? And the second question is about electrification. The Ohio plant will be the hub for EV production, and there is the IRA, the Inflation Reduction Act, there. But how do you take the benefits of the Ohio electrification production hub?\n\nSo, operating profit, automobile was rather lower as compared to last year. And as you said, one is semiconductor supplies. Because of that, a number of the units have to be constrained. That is the big factor.\n\nAnd also OP automobile have to be improved. And in the last two or three years, we've been making efforts to push it up, which is reducing our fixed cost, closure of the plants in Europe and Japan and so forth. And those are materializing and it's affected. We have our Honda architecture-specific designs and so on or specification to make battery efficiency.\n\nThe numbers are reflecting those efforts. However, in terms of the unit sales, it's not yet there because of the semiconductor constraints. We are still in the process of improvements. The numbers still be restraints, and of course, there are hypothetical situations as well.\n\nAnd we're on track, in fact, toward the unit sales improvements. And the Ohio electrification hub, you mentioned the IRA. And 700 -- 750 -- $7,500, and $3,750, and so on according to IRA. There are still details to be decided, but we will produce batteries with LG.\n\nAnd we have two plants, Marysville and our East Liberty plants in Ohio. And those places will be a hub for EV products. And, of course, the principle is to make production where the demands exist, and this is working well. And also, we have to take the benefits from the IRA incentive plants.\n\nThank you.\n\nAnd next question, please.\n\nNHK, Mr. [Inaudible]\n\n[Inaudible] Can you hear? Excuse me. This is [Inaudible] from NHK. Can you hear me?\n\nYes.\n\nThank you. First, I'm looking at the numbers announced. The sales revenue, I thought it was record high, and there was a record high, if any. Can you elaborate? And which part was the record high in terms of the record -- sales revenue.\n\nAnd about the profit -- operating profit, I don't think it's a record high. But what are the reasons cost-wise, and what cost was increased? Can you explain? That's the first part. And second question about support to suppliers. And can you elaborate on what you're thinking about giving support to the suppliers?\n\nMr. [Inaudible] thank you for the question. First, in regards to the sales revenue, this time, the FY '23 forecast; and the second quarter, three months, and the first half, six months, oh -- recorded a record high, but it was made attributable to the currency. And in terms of unit value, it was not a record high.\n\nSo -- so, we really did not say proudly that this was record high. And so, due to that, the unit sales was not high. It was mainly attributable to the currency, and therefore, the operating profit was not a record high. But the two -- second quarter, three months, the motorcycle profit margin was 70% or more -- our operating margin, 70% or more.\n\nSo, this is a very high number.\n\nHow about the supplier support?\n\nYes. Well, we also in this FY '23 forecast compared to last fiscal year, there is a rise in the raw material price and also the logistics and inflation, etc. So, the inflation part is having an impact significantly on the cost. And supply is likewise experiencing the same pressure.\n\nAnd, well, in line with the situation, the different suppliers, we consult with them and think about what needs to be done. So, it's not the case where all the supplies will be provided the same support, but we have to tailor to the different situations of the suppliers. We consult with them and to provide, if necessary, support or take other measures. So, we have to decide for each case.\n\nThat is all. Thank you.\n\nOperator\n\nThank you very much, Mr. [Inaudible] Next one, Wall Street Journal, Ms. Davis, please.\n\nRiver Davis -- Reporter\n\nHello. Thank you very much for taking my question. I have one follow-up on semiconductors. We're hearing from some other automakers that they feel like they've made it past the worst of the shortages.\n\nIs that similar in Honda's view at the moment? And my second question is on electrification. A few weeks ago, we heard from General Motors that they're pushing back some of their EV timelines because they're having trouble ramping up battery capacity. Is Honda seeing any impact from that issue, especially with regard to jointly developed vehicles and timelines around those? Thank you.\n\nUnknown Speaker\n\nSo, semiconductor question, whether or not the worst time has been over, I think from the [Inaudible] high level, the worst shortest period of the semiconductor at large has been gone -- has gone for general use of semiconductor. However, we have different types of semiconductors and there's different applications in vehicles and so on where the matching are well supported. The worst time has been over, but still, some specific areas, we still have the shortage. I don't think we have passed the worst time for the specific application area of the semiconductors.\n\nSo, we try to address the situation so that we can make a delivery of the products to the customers as soon as we can and, of course, to optimize our production and delivery situations. We are working on that, and also, electrification with GM and EV timeline or delays at this moment. So, we have a program with GM after 2025. We have two vehicle plans with GM with their suppliers.\n\nAnd with that particular run, battery production capacity is not going to affect -- we haven't heard of that yet. And, well, all of the GM vehicles be electrified, I don't know if that is the case. They might need a battery. So, as many as those.\n\nAnd then, we haven't heard, and I don't know how they can say that, but that is our response. Thank you.\n\nOperator\n\nThank you very much, Ms. Davis. And next [Inaudible] please.\n\nUnknown Speaker\n\n[Inaudible] from [Inaudible] Can you hear me?\n\nYes.\n\nThank you. About the raw material cost, that's my first question. The fuel costs and inflation you mentioned. Well, what is the outlook? What do you think the situation will be? Is it going to stop? The rise will stop, or is it likely to continue to rise in the next fiscal year? I think this will have an impact on your profitability for automobiles.\n\nSo, what is your outlook forecast for inflation going forward? And the second about some numbers, a very detailed question. Well, looking at the end of September, I think that you have a positive for the operating profit, but the net profit is a negative. So, where it is -- what is the cause of this negative?\n\nYes. Let me explain about the raw material part and also the logistics cost, inflation, what is the outlook. Well, yes, it depends on the material. But, well, for example, the rare metal, etc., for the past few years, a few months, it is not rising, but it's showing a slight downturn.\n\nSo, I think that this is reflected in, partially, the forecast. But is it going to dramatically decline? Well, it depends on the material, the raw material we're talking about. But those raw materials for batteries, I think the supply is not sufficient, and therefore, I cannot say anything about that. But other raw materials, if the currency situation would continue, I think the rise will be more gradual.\n\nBut still, will we see a dramatic decrease in the near future? Well, depending on the material as electrification progresses, I think of the production balance, etc., the demand and supply balance, and price to do it. So, at this point in time, there might be some changes, but we have to capture those changes early on so that we can provide good products to our customers. And that is how we would address this issue. About the operating profit about the first six months -- I think you're asking about the first six months, about the operating profit.\n\nWell, really, it is a positive. But the reason for the negative is the nonoperating profit, and also, for this year, profit investments are accounted for using equity method. Now, for the first time, I think that the interest rate and exchange rate is volatile. And Honda Finance, so, they are doing the procurement of funding.\n\nAnd so, the derivative -- we have hedged, and the assessment of the hedge, etc. is one of the negative factors. So, this is a nonoperating profit. And as for the share profit investment accounted for using the equity method, well in China, well, the business is -- rather than the business per se, positive or negative recently, the share prices are declining.\n\nAnd therefore, we have the balance sheet based on the equity method. But if we could compare this to the share prices and those what we assess using the equity method, if the share price -- if there is a gap, we have to do the -- write it off. And therefore -- and that is the reason why we have a negative for the net profit.\n\nOperator\n\nThank you very much, Mr. [Inaudible] Next question, Automotive News, Hans-san, please.\n\nHans Greimel -- Editor\n\n[Foreign language]\n\nUnknown Speaker\n\nCan you hear me? Hello?\n\nHans Greimel -- Editor\n\n[Foreign language]\n\nUnknown Speaker\n\nWell, as we're questioning in English, can I, sir?\n\nHans Greimel -- Editor\n\n[Foreign language] My question is about the EV strategy in the United States, specifically with regard to the EV partnership with Sony. Can you give us any new guidance on how Honda plans to approach the retailing of those EVs in the United States? Will Honda use its existing retail network to support the sales of those Sony Honda EVs, or will it be completely -- or I should say, sales and servicing of those EVs? Or will it need some kind of different and -- and independent servicing network? Thank you very much.\n\nUnknown Speaker\n\n[Foreign language] So, Sony and Honda joint venture has kicked off, established in September. And the other -- they -- music company and Takeuchi-san made a joint announcement together and how we can sell the products. Of course, with that framework, we're going to -- we have established a new joint venture company, Mobility, that will be not Honda, not Sony, but it will be a new Mobility. That is why we established a new company.\n\nAnd then, how we are going to sell, it is not defined as of yet. Clearly, so, I can't share with you at the moment. And using the existing grid network may not be the case. However, service network, we have 1,000 Honda and 300 [Inaudible] service network -- 1,000 Honda and 300 [Inaudible] service network across U.S.\n\nWe make use of that. However, the way to sell may be, you know, in line with the new kind of mobility, new world, completely new things. So, personally, I think it is going to be something new. But all those things are still under contemplation, so, I don't think I can refer to that today.\n\nBut it is going to be nonconventional, no Sony, no Honda, something totally new. And that is how we have started up with this joint venture company. So, please expect us for the next move. Thank you, Hans-san.\n\nOperator\n\nNext question [Inaudible] please.\n\nUnknown Speaker\n\nMs. [Inaudible] can you hear -- can you hear me?\n\nYes.\n\nExcuse me. My name's [Inaudible] from [Inaudible] newspaper. Now, looking at the current situation, you said that you would replace the models to be sold. But in what regions? What kind of models did you replace? Can you elaborate on that? And the second, well, you mentioned that -- about the operating margin of automobiles, but -- the unit volume, etc.\n\nBut the motorcycles were not that much impacted. And that is the reason why the operating margin for our motorcycles is good. Can I interpret it that way?\n\nWell, in what regions, what kind of models have been replaced, etc., I cannot make any specific reference. But in the first half of the first six months, two or three months, for Civic CR-V, we had a shortage of semiconductors. And the second half, we think, in the United States, we have -- given the current production situation, will be difficult to catch up. So, instead, the small models in Japan and Asia, we -- these are -- those for which we do not have a shortage of semiconductors, and therefore, we replace them with these models.\n\nSo, on a weekly and on a regional basis, we are doing such things so that we can deliver products to our customers as soon as possible. So, such replacements are taking place. About the automobile, the profit margin, well, yes, I mean, we -- because of the shortage of semiconductors, and we are not achieving the unit sales that we intended to, so we cannot achieve the margin that we wanted to. Motorcycles, likewise, are impacted by semiconductors.\n\nAnd depending on the country, the market, I believe our motorcycles -- which motorcycles sell are different, and therefore, we are able to cover with that difference. Those of which have high margin, those countries that the unit volume has increased as -- and therefore, in Thailand and Vietnam, and that is the reason for the positive. So, it's not the case of that we do not have any problem. But fortunately, in those markets which -- where we have high margin, were the areas in which we saw growth in the unit sales.\n\nThank you.\n\nOperator\n\nThank you, Mr. [Inaudible] Next question [Inaudible] please.\n\nUnknown Speaker\n\n[Inaudible] Hello. Thank you. I have two questions. The first question is confirmation.\n\nIn the PowerPoint, the factors behind the profit before tax, you had previous -- that is 6 billion yen of the retail price factor for the ups and downs. You had the raw materials situation, plus you had managed repricing successfully to make this number. Is that how it went? Please share with us your strategy as well. And also, you talked about the pricing.\n\nAnd also, in mini vehicles class, they're produced in Japan, consumed in Japan. And in fact, their soaring prices directly impacting the mini vehicles. And what is the impact on that because pricing is difficult on that? \n\nSo, let me explain the first part. For the first half, like this time, we say 36 billion-plus yen. Despite raw material prices hike, we managed. That was -- the question about throughout the year, annually speaking, for this fiscal year as compared to last one, raw material prices from the previous forecast because of the inflation situation, the distribution, labor cost, and supplier, of course, suffer the same issues. But their cost up -- pressure is 390 billion yen.\n\nThe cost -- the pressure upward, total up to not much. And our approach is to try to provide -- have a pricing that reflects values. And of course, throughout the year, inflation and supplier situations, specifically the price negotiation, and actually, those events are happening in the second half, rather. So, when we do pricing, we actually take up in first half already, anticipating what's going to happen next.\n\nBut actually, that is a plus-positive impact on the first half. But throughout the year, I don't think we can absorb all of those cost increase factors. And then, we have differences of the impact in second half and first half, and that is how those ups and down factors are allocated over the period. So, pricing in Japan, as [Inaudible] said, speaking of the domestic market, of course, we are looking at other competitors as well.\n\nAnd those mini cars, mini vehicles, we have our -- the OEMs for supply that too. And we, of course, watch out the prices of those products of other companies, and it is kind of difficult to reflect the raw material price hike situations to the price of the products directly. We have to make a decision over the quantities product. And when we have the new model, new specification, we may pass it on the price hike part for the price of the products, but we would try to do that as we go -- going forward.\n\nAnd thank you very much.\n\nOperator\n\nThe next question will be the last question. Nikkei Business [Inaudible] please.\n\nUnknown Speaker\n\n[Inaudible] Can you hear? Yes, can you hear me? Thank you. About motorcycle sales, well, it's a detailed question, but Indonesia, as compared to others, I think the growth is not that fast. Is the reason -- what is the reason? You talked about EV motorcycles. But in Asia, the competitors, do you see that there is pressure coming from your competitors to try to push EV motorcycles -- electrified motorcycles?\n\n[Inaudible] thank you very much. Indonesia is more than 100%, but the growth is slower than other regions.\n\nWhich -- where did this come from?\n\nCan you elaborate on your question?\n\nExcuse me. In the second quarter, the Indonesian sales, it says 101.9%, and in the fourth quarter, it's 90%, I think. So, that ratio I'm talking about.\n\nI'm sorry, I'll look it up. Well, yeah, because in Indonesia, there is an impact of the recession, the slowdown of the economy, especially last year. When it comes to Thailand and Vietnam, there was a lockdown in Asia, as you recall, and because of that impact. At that point in time, Vietnam and Thailand grew.\n\nSo, this is in comparison. I hope that you understand that to be the case. And about the electrification of motorcycles in Asia, well, in India, there is this new manufacturer which has started up. And they have a very forward-looking plan -- sales plan, and it seems to be working.\n\nIn Indonesia, again, competitors are putting pressure on us in terms of electrified motorcycles. But we also, as I explained the other day, and heading toward 2030 and '35, we want to aim for a large unit sales in Asia when it comes to EV motorcycles. It is true that competitors are putting pressure on us because of their growth. But mobile battery pack -- we are using battery.\n\nAnd the rickshaw in India, it's still battery, and they're doing demonstration tests there. So, I think in Asia, mainly in the motorcycle -- motorcycle sector, we will try to electrify, put together a strategy in this market going forward. Thank you. \n\nThank you very much [Inaudible] So, this concludes our presentation session today. Our financial results presentation, of course, those materials and the presentation package, available on our website. And thank you very much, indeed, for your participation.\n\nDuration: 0 minutes\n\nKohei Takeuchi -- Director, Executive Vice President, and Representative Executive Officer\n\nEiji Fujimura -- Head of Accounting and Finance Supervisory Unit\n\nUnknown Speaker\n\nRiver Davis -- Reporter\n\nHans Greimel -- Editor\n\nMore HMC analysis\n\nAll earnings call transcripts"
}