{
  "companyName": "Emergent BioSolutions",
  "companyTicker": "EBS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/emergent-biosolutions-ebs-q3-2022-earnings-call-tr/",
  "content": "Emergent BioSolutions (EBS -0.34%)\nQ3 2022 Earnings Call\nNov 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Emergent BioSolutions third quarter 2022 earnings conference call. At this time, all participants on a listen-only mode. After the speakers' presentation, there will be a question-and-answer session [Operator instructions] Please be advised that today's conference is being recorded.\n\nI would now like to hand the conference over to the company.\n\nBob Burrows -- Vice President of Investor Relations\n\nThank you, Victor, and good afternoon, everyone. My name is Bob Burrows, VP and IRO for the company. Thanks for joining us today as we discuss the operational and financial results for the third quarter of 2022. As is customary, today's call is open to all participants and the call is being recorded and is copyrighted by Emergent BioSolutions.\n\nIn addition to today's press release, there is a series of slides accompanying this webcast available to all webcast participants. Turning to Slides 3 and 4. During today's call, we may make projections and other forward-looking statements related to our business, future events, our prospects, or future performance. These forward-looking statements are based on our current intentions, beliefs, and expectations regarding future events.\n\nAny forward-looking statements speaks only as of the date of this conference call, and except as required by law, we do not under place to update any forward-looking statement to reflect new information, events, or circumstances. Investors should consider this cautionary statement, as well as the risk factors identified in our periodic reports filed with the SEC when evaluating our forward-looking statements. During today's call, we may also refer to certain non-GAAP financial measures that involve adjustments to GAAP figures in order to provide greater transparency regarding Emergent's operating performance. Please refer to the tables found in today's press release regarding our use of adjusted net income, adjusted EBITDA, and adjusted gross margin and the reconciliations between our GAAP financial measures and these non-GAAP financial measures.\n\nTurning to Slide 5. The agenda for today's call will include Bob Kramer, president and chief executive officer, who will comment on the current state of the company; and Rich Lindahl, chief financial officer, who will speak to the financials for 3Q 2022, which will also discuss the updated 2022 guidance. This will be followed by a Q&A session where additional members of the leadership team are present and available as needed. Finally, for the benefit of those who may be listening to a replay of the webcast, this call was held and recorded on November 8, 2022.\n\nSince then, Emergent may have made announcements related to topics discussed during today's call. And with that introduction, I would now like to turn the call over to Bob, whose comments begin with Slide 7. Bob?\n\nBob Kramer -- President and Chief Executive Officer\n\nThank you, Bob, and good afternoon, and thank you all for joining the call. Today, we'll provide an update on our business, including significant recent developments, as well as thoughts on the road ahead for Emergent. Let me first begin with our medical countermeasures business, which, as you all know, is a cornerstone of our strategy. We continue to work closely with the U.S.\n\ngovernment to deliver medical countermeasures focused on dangerous public health threats in line with our country's biodefense priorities. Case in point, last month, we shipped the first doses of Tembexa to the U.S. government under the BARDA procurement contract. Our second delivery is scheduled to occur in the next few weeks.\n\nThis product continues to expand our smallpox franchise and further diversifies our medical countermeasure portfolio. I'm incredibly proud of the team for the seamless integration and management of the Tembexa acquisition. The collaborative work has been accomplished in support of integrating this product into our portfolio, including being able to ship product to our customer in short order following the closing of the acquisition has been remarkable. We also continue to work with the FDA on the BLA filing for AV7909.\n\nWe've responded to additional information requests and as a result, we now anticipate a PDUFA date of July 2023. Meanwhile, we're continuing to deliver AV7909 to the Strategic National Stockpile under the existing 18-month procurement contract, thereby ensuring product availability while the FDA reviews our BLA submission. Next, let me talk about our smallpox vaccine program and the status of the government's contract option for ACAM2000. We're currently in discussions with the Department of Health and Human Services and specifically the administration for strategic preparedness and response regarding the fiscal year 2022 procurement option.\n\nIn prior years, the government has exercised its procurement option in Q2 or Q3, and we expected the same timing for this year. Reflecting the government's failure to exercise the option to date, we're adjusting our 2022 forecast for ACAM, which Rich will discuss in his remarks shortly. The delayed exercise of the 2022 procurement option for ACAM is disappointing, but let's keep the following in mind. Since 2017, Emergent has worked closely with the U.S.\n\ngovernment to help execute its strategy to protect all Americans from smallpox. Today, that would suggest that more than 330 million doses of vaccine would be needed. By the government's own admission, we're not there yet. In support of the government strategy, we entered into a 10-year contract in 2019 to provide the government with a vaccine that will be domestically produced consistent with the hundreds of millions of dollars invested in onshoring the manufacturing process, also a vaccine that was administered in a single dose and has a 16-year shelf life, and importantly, a vaccine that can be cost-effectively stockpiled and employed in the volumes necessary and also addresses the threat posed by an external or intentional smallpox event.\n\nBased on public statements from across the administration, including testimony by the Assistant Secretary of Preparedness and Response before the Senate Health Committee in September, we believe the government remains committed to its preparedness strategy. We also believe it doesn't wish to lose access to domestic manufacturing capability and supply of a key countermeasure in the nation's biodefense strategy. And importantly, we stand ready to deliver doses immediately upon the government's exercising of the option. Next, let me speak about our commercial products business.\n\nThe continued need for greater access to naloxone, including NARCAN Nasal Spray has grown as the opioid epidemic continues to worsen. Our years-long commitment to increasing awareness, improving affordability, and driving access to naloxone continues to benefit millions of patients. We continue to see significant demand for naloxone from the public interest market with the demand for NARCAN Nasal Spray specifically being more durable than we originally expected. Based on the feedback we've received, the infrastructure we've established for NARCAN with state and local governments has been an important element in their efforts to address the opioid crisis more broadly.\n\nConversely, in the retail pharmacy market where most states have automatic generic substitution, unsurprisingly, we're seeing lower demand for branded NARCAN Nasal Spray and expect that to continue in 2023. Given the ongoing devastation caused by the opioid crisis and consistent with our mission to protect and enhance life, our principal aim here is to continue putting resources toward expanding awareness of and access to naloxone consistent with the market demand. Also, within commercial products business, the steady return of global travel has resulted in a stronger-than-anticipated demand for our typhoid vaccine, Vivotif. We're also in the process of ramping up the supply chain for our cholera vaccine, Vaxchora, for the U.S.\n\nmarket and introducing it into select European markets. We're targeting early Q1 of 2023 to make supply available. Let's now turn to our CDMO business. We continue to be focused on stabilizing and enhancing our CDMO capabilities across the entire network of manufacturing sites.\n\nThis includes operationalizing investments made during the last few years. As an example, at our Rockville drug manufacturing -- drug product manufacturing facility, we're preparing to open our newly expanded site later this year with a new state-of-the-art Groninger Integra fill-finish line. These state-of-the-art investments, along with our investments in quality controls, helped strengthen our aseptic manufacturing capabilities, a growing area of focus and demand within the CDMO market. Our efforts to stabilize operations and bring new capacity online will be a multiyear process to be clear, and one that holds meaningful long-term strategic values to our business.\n\nOn the Product development front, in addition to progress to our licensure of AV7909, we're pleased to have fully enrolled our primary phase 3 trial for our Chikungunya vaccine candidate and expect to have top-line data in the first half of next year. Additionally, our team presented data at the American Society of Tropical Medicine and Hygiene Conference last week from a study evaluating the safety of our ACAM2000 smallpox vaccine in previously vaccinated healthy volunteers. With more than 3,000 vaccinations administered, the study demonstrated that serious adverse events were uncommon in no cases of pericarditis or myocarditis were reported. And lastly, we're pleased to have announced the initiation of our phase 1 study for our Lassa fever vaccine candidate, which is co-funded by CEPI, the Coalition for Epidemic Preparedness Innovations.\n\nFinally, I want to update you on our commitment to further strengthen our culture of quality and compliance, improve the effectiveness of our quality management system and further embed controls into our processes. Through our recently realigned quality and compliance organizations, we've moved swiftly to address observations made by the FDA in the warning letter issued in August related to our Camden facility. We've begun regularly updating the FDA on our progress and continue to operate the facility at a reduced capacity as we make necessary improvements. We understand the confidence in our ability to meet our regulatory commitments as we continue to ensure the safety and efficacy of our products is paramount to Emergent's success.\n\nWe're committed to building upon in some cases, rebuilding that confidence one dose at a time. These activities will take time to implement but are critical to the important work we do every day to protect and enhance life. Our employees embrace and take pride in maintaining high standards of product quality and product safety. That's everyone's No.\n\n1 priority at Emergent. In closing, as we look ahead, we remain focused on the following priorities: First, we want to continue to be a dependable partner to our clients, including the U.S. government, and deliver on their strategic objectives and the commitments we've agreed upon. Second, we're investing in our people, our facilities, quality systems, and culture, so we have the necessary skills and tools to compete long term.\n\nThird, we're actively evaluating opportunities for growth through a strategic partnerships and acquisitions as evidenced by our deals on Tembexa and Ebanga and advancing our internal development pipeline to address diseases like Chikungunya and Lassa fever. Fourth, we're sharing our experience for more than 20 years, helping governments prepare for public health threats and advocating for proper funding and improved planning in response. So, the public doesn't end up paying for the cost of complacency down the road. And finally, we continue to be guided by financial discipline as we execute our strategy of building leadership positions in select segments of the growing public health threat market.\n\nThis includes carefully managing our opex and capex investments while we seek to create value for our shareholders. I remain confident in Emergent's ability to deliver results for our patients, customers, and shareholders by focusing on these critical priorities. The important role we play in niche public health markets is more critical than ever, given the ongoing emergencies we face, such as COVID-19, monkeypox, Ebola, and the biologic weapons threat posed by Russia's aggression in Ukraine and the need to be better prepared for future threats. With that, I'll turn it over to Rich to review our financial performance for the quarter, and I look forward to answering your questions.\n\nRich?\n\nRich Lindahl -- Chief Financial Officer\n\nThank you, Bob. Good afternoon, everyone. We appreciate you joining the call. Please turn to Slide 10 as I begin my commentary today.\n\nOverall, our financial performance in the third quarter was mixed. On the positive side, total revenues were in line with our quarterly guidance as our Products segment continued to deliver solid contributions, and the CDMO services business was a modest top-line contributor. Late in the third quarter, we closed on the Tembexa acquisition, and in October, began shipping doses to the U.S. government.\n\nWe also further advanced several programs in our R&D portfolio. At the same time, our profitability measures remain pressured primarily by underutilization of our CDMO capacity as we continue to rebaseline that part of our business and incremental costs we are incurring to address the Camden warning letter and further strengthen our systems, processes, and culture of quality and compliance in our manufacturing plants and across the enterprise. Looking ahead, as Bob mentioned, we are adjusting our forecast to reduce the expected full-year contribution of our ACAM2000 smallpox vaccine. While we remain in active discussion with the U.S.\n\ngovernment, as of today, this year's option exercise under our 10-year procurement contract has not yet occurred. For the reasons Bob shared, we believe the U.S. government remains committed to its prior smallpox preparedness strategy and the maintenance of the domestic production capability that has been established. However, since the timing of the exercise is uncertain, we are adjusting our ACAM guidance to remove the revenues associated with the option exercise.\n\nImportantly, I would note that this change is partially offset by the inclusion of Tembexa revenues in our updated forecast. With that, let's turn to the numbers. As indicated on Slides 11 and 12, highlights in the third quarter include total revenues of $240 million, a decrease over the prior year, driven primarily by lower NARCAN and ACAM sales. As expected, our key profitability measures declined versus the prior year, with adjusted EBITDA of negative $15 million and adjusted net loss of $63 million.\n\nDiving a little deeper into quarterly revenues. Important items include continued steadiness in our anthrax vaccine franchise with sales of $24 million higher than the prior year due to timing of deliveries of AV7909 to the U.S. government Strategic National Stockpile. ACAM2000 smallpox vaccine generated sales of $49 million, driven by non-U.S.\n\ncustomers and reflecting the growing attention to smallpox around the globe. Our nasal naloxone franchise realized sales of $88 million, demonstrating the continuing durability of NARCAN in addressing the ongoing opioid epidemic, especially in the U.S. public interest segment. And combined CDMO service and lease revenues were $36 million, slightly lower than the prior year as we continue to work primarily for existing customers.\n\nTurning to operating expenses. Cost of product sales in the quarter was $86 million, lower than the prior year due to the lower volume of product sales. Cost of CDMO was $63 million, significantly lower than the prior year due to reduced production across the CDMO network, partially offset by higher costs at the Camden site, resulting from additional investments in quality enhancement and improvement initiatives, largely in response to the FDA warning letter issued on August 10. R&D expense of $39 million lower than the prior year, reflecting our move to cease development on COVID-related therapeutics and redirect development resources to other infectious disease-focused programs and SG&A spend of $80 million, in line with the prior year.\n\nWith that, let's move to Slide 13 and review segment performance during the quarter. In the Products segment, revenues were $186 million, which while down significantly from the prior year, also reflect strong ex-U.S. sales of ACAM, solid NARCAN deliveries, and continuing contributions from our anthrax franchise. An adjusted gross margin was $101 million or 54%, both decreases over the prior year, reflecting the impact of reduced sales volume and product mix.\n\nAs for the Services segment, revenues were $36 million, a decrease from the prior year as the rebaselining continues, and adjusted gross margin was negative $27 million, an improvement from the prior year, principally reflecting the reversal of lease revenues in 2021 that did not recur in the current period. Slide 14 presents a review of segment performance for the nine-month period. Revenues and adjusted gross margin both showed solid gains in the product segment, whereas the Services segment saw year-over-year declines in both measures. Moving on to Slide 15.\n\nI'll touch on select balance sheet and cash flow highlights. We ended the third quarter with $241 million in cash and available revolver capacity of $361 million. Our net-debt position was $821 million, and net leverage was 2.4 times. Regarding our credit agreement, as you are aware, this portion of our capital structure matures in October 2023.\n\nWe have initiated discussions with our lenders to refinance the related debt outstanding and extend the maturity of the facility. We plan to complete these actions before the end of this year because the maturity is now less than 12 months away. Under the accounting rules, we will be putting some additional disclosure to this effect in our 10-Q filing. We will provide further updates as appropriate.\n\nDuring the third quarter, our operating cash flow was negative and capital expenditures were $28 million. We did not repurchase any more shares pursuant to the authorization approved by the board of directors last year. Cumulatively, as of September 30, we have spent $188 million to repurchase 4.4 million shares. This authorization terminates later this week.\n\nPlease turn to Slide 16 and 17 for a review of our updated 2022 forecast and associated assumptions. We are updating our guidance for the full year 2022 to reflect revenue reductions related to ACAM, offset by the inclusion of Tembexa and an increased nasal naloxone forecast. We have provided the following updated ranges in today's press release. Total revenues of $1.05 billion to $1.1 billion, anthrax vaccine sales of $260 million to $275 million, ACAM2000 sales of $63 million.\n\nFor the first time, we're including Tembexa sales forecast of $110 million to $115 million. Nasal naloxone product sales of $350 million to $365 million. Other product sales plus C&G revenues of $167 million to $172 million, CDMO revenues of $100 million to $110 million, adjusted net loss of $100 million to $70 million; adjusted EBITDA of $0 to $30 million; gross margin of 33% to 34% and adjusted gross margin of 39% to 41%, which reflects the add-back of the $58 million one-time inventory step-up related to the Tembexa acquisition. This full-year 2022 forecast reflects the following key considerations.\n\nAnthrax vaccines reflect anticipated deliveries of AV7909 and BioThrax and the impact of the FDA warning letter on certain batches fill finished at the Camden site. ACAM2000 reflects the removal of revenues associated with the next option exercise under the existing 10-year BARDA procurement contract as the timing is now uncertain. Tembexa reflects the initial revenues related to deliveries under the existing 10-year BARDA procurement contract and following our September 2022 acquisition from Chimerix of the worldwide race to this product. Nasal naloxone products primarily reflects continued strong demand in the public interest channel in the U.S., as well as continuing demand in Canada.\n\nAnd CDMO reflects the continued rebaselining of the services business overall and specifically the impact of reduced production output from the Camden facility. To conclude, please turn to Slide 18 for some summary comments. Our results in the third quarter reflect a mix of strong performance in certain core areas of our business of our Products business, offset by ongoing challenges in the services business. And despite the near-term uncertainty associated with the ACAM contract option exercise, we remain confident in the impact we are having on patients and customers focused on health security and pandemic preparedness.\n\nThat completes my prepared remarks, and I'll now turn the call over to the operator so that we can start the question-and-answer session. Operator?\n\nOperator\n\n[Operator instructions] Our first question will come from the line of Jessica Fye from JPMorgan. Your line is open.\n\nJessica Fye -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks for taking my question. On ACAM, I know you've removed it from this option from guidance this year. How would you handicap the possibility of an order by year-end? And do you think the government might just be skipping this year's option? Or do you think there's risk they might not exercise future options? And then second, on the anthrax vaccines.\n\nCan you elaborate on the timeline you project to resolving the warning letter? Any reason to think that this could impact the full licensure of AV7909? Thank you.\n\nBob Kramer -- President and Chief Executive Officer\n\nYeah. Thanks, Jess. Appreciate the questions and participating in the call. So, let me address the ACAM question first.\n\nSo, it's really difficult to handicap the likelihood of working through and having conversations with HHS by the end of the year. Obviously, we are -- as both Rich and I have acknowledged, we're in active discussions with them. We hope to have resolution soon, but it's really difficult to predict. I think it's important to remember a couple of things.\n\nFirst of all, the government has reaffirmed the importance of preparing for a smallpox event, both to us, as well as publicly through statements where they've expressed their commitment to the preparedness strategy, including protection against smallpox. I think as I included in my prepared remarks, it's pretty obvious that ACAM2000 provides the government with a vaccine that is easy to administer with a single dose, domestically manufactured cost-effectively stockpiles, and even by the government's recent words, including the Assistant Secretary for Prepared Response, they referred to ACAM as the first line of defense to vaccinate Americans in the event of an accidental or intentional release of smallpox. So, we know it's a priority for them. Just we hope to resolve this soon, but it's really too early to speculate.\n\nI think we'll be updating folks as soon as we make progress. And hopefully, that's in short order. On the AV7909 front, the warning letter implication, just to be clear with Camden. Camden is one of the sites where we use to fill and finish AV7909 in addition to a third-party contract service provider.\n\nSo, we don't see significant risk right now in terms of the supply chain for AV7909. I think the extension of the PDUFA date for AV7909 was primarily driven by some additional analysis on the data that we provided to the FDA. And now that we've provided that to them, they simply like more time to digest and understand the analysis that we performed and gave to them.\n\nOperator\n\nAll right. Thank you. One moment for next question. Our next question comes from the line of Keay Nakae from Chardan.\n\nYour line is open.\n\nKeay Nakae -- Chardan Capital Markets -- Analyst\n\nGreat. Bob, is there any pushback in the negotiations by the government for the ACAM option extension?\n\nBob Kramer -- President and Chief Executive Officer\n\nYeah. Thanks for the question. I wouldn't characterize it as pushback, Keay. And clearly, they have stated the need and reemphasize the priority of protecting American civilians from the potential threat of smallpox.\n\nSo, I think it's now a matter of timing and allocation of funding to support their continued procurement. But well, we are advancing those discussions as quickly as we can, and we'll keep you updated as we make progress, and we have appropriate updates.\n\nKeay Nakae -- Chardan Capital Markets -- Analyst\n\nOK. That said, the U.S. sales for ACAM are encouraging. Should we think of this as one-time in nature or could this lead to recurring sales of this magnitude or greater going forward?\n\nBob Kramer -- President and Chief Executive Officer\n\nYes. So, as you know, we've had over the last several years, our interest from international governments to continue their stockpiling strategies, much like the U.S. government has, but at a smaller scale to protect a segment of their civilian population and military personnel from the threat of smallpox. So, we expect that to continue.\n\nI think the bump in 2022 was primarily the result of foreign governments, acquiring access to ACAM for potential use as it relates to the monkeypox threat. And while ACAM is not indicated or approved for use against monkeypox, that's really a government decision based on their risk-benefit analysis. So, is that something that's sticky going forward? It could be, Keay, but it's really too early to tell based on the state of the monkeypox threat.\n\nKeay Nakae -- Chardan Capital Markets -- Analyst\n\nOK. Great. And then finally, at Camden, you know, you got the warning letter. I'm sure it's spelled out very specific deficiencies in other areas of concern.\n\nHow would you characterize how far along you are toward remediating those defined concerns?\n\nBob Kramer -- President and Chief Executive Officer\n\nYeah. It's a great question, and thanks for asking it. We are doing a lot in Camden across -- well, across the site, as well as other sites to strengthen our profile and culture of quality and compliance. And while there's a lot more work to do that are ongoing, I'm really pleased with the fact that as an example, there are tangible benefits and proof that we're making progress, including things like harmonizing our quality management systems across the enterprise.\n\nWe've implemented to the credit of Coleen Glessner and her team, executive-level governance reviews on a periodic basis across Camden, as well as the other manufacturing sites. We are supplementing our quality and compliance teams with additional resources and expertise. And we have a very disciplined and robust process to measure and monitor progress against all of the work streams that were incorporated into our warning letter response to the FDA. And as I acknowledged in my prepared remarks, we are now in a regular cadence of updating the FDA on progress.\n\nSo, there are some very simple quantitative measures that we're following and tracking. And then there are some more simple qualitative measures, including the fact that this week as an example, we've initiated a Integrity in Action week across our network in the enterprise, which we're really reinforcing the importance of prioritizing behaviors, supportive of a culture of quality and compliance that we aspire to achieve. So, overall, we're making good progress. It's a long road ahead, but I'm pleased and satisfied with what we're doing so far.\n\nKeay Nakae -- Chardan Capital Markets -- Analyst\n\nBob, does the capacity constraint and the lifting of that, is that more dependent on you folks feeling you've got things corrected the way you want? Or is there still some resolution of the warning letter by the FDA that kind of green lights increased capacity utilization?\n\nBob Kramer -- President and Chief Executive Officer\n\nYeah. I think as we talked about on the last call -- Keay, it's a great question, first of all. But as we talked about in the call last time in the last quarter, we're taking a very disciplined measured approach to turning up and growing and looking to our opportunities in the CDMO area in general, but specifically in Camden, which was the subject of the warning letter. So, our growth, if you will, is going to be measured and determined by our internal quality and compliance profile and progress, not based on opportunities that we see because the opportunities are out there today.\n\nWe're not acting upon them because we're, again, focused on making sure that we thoroughly address all of the issues that were identified by the FDA and that we made commitments to in our response to the FDA warning letter. So, it's more of an internal measure metric, Keay, as opposed to the kind of FDA-mandated actions.\n\nKeay Nakae -- Chardan Capital Markets -- Analyst\n\nGot it. Thanks.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Boris Peaker from Cowen. Your line is open.\n\nUnknown speaker -- Cowen and Company -- Analyst\n\nHey, thanks for taking my question. This is Nick on for Boris. I just have a quick question on NARCAN. You mentioned previously today that there are some jurisdictions that have an automatic over to NARCAN, I mean, over to a generic from NARCAN.\n\nIs this a process that occurs over time? Or is this like an automatic process where they quickly like within a couple of months, take over the generic fully, or is this like a one- to two-year thing? And then we'll continue to see this impact over the next couple of years? And then for the jurisdictions that don't have this automatic switch, are you seeing decreased usage of NARCAN? Or is this still like a NARCAN is still kind of taking control over the generic? Thanks.\n\nBob Kramer -- President and Chief Executive Officer\n\nYeah. Thanks, Nick. Appreciate the question. So, what we expected to see and what we, in fact, have seen beginning in December of last year and then certainly in January of this year with the formation of the generic market and the entrant of the generic product is in the retail market.\n\nSo, the retail pharmacies, there is almost an automatic switch in all states and jurisdictions at the pharmacy level to automatic switching to generic product and preference over the branded product. So, that's already happened. My comment was really around in the public interest market. So, in the state and local and even some federal jurisdictions where we have a very active commercial support program on working with states and local governments for procurement of NARCAN.\n\nThat's where we see us holding on to significantly greater market share than in that retail space. And we've said from day 1 that when the generic market was formed, we expected the retail market to switch to generic in a kind of 90% market share, 10% branded ratio right away. However, in the public interest market space, we expected to maintain the majority of the market share, which, in fact, we have. Hopefully, that helps.\n\nUnknown speaker -- Cowen and Company -- Analyst\n\nYeah, definitely. Thank you. And then just a second question on Tembexa. Is the currently delivered product, is that product that was previously stockpiled by Chimerix, or is this additional drug that's been manufactured by Emergent?\n\nBob Kramer -- President and Chief Executive Officer\n\nYep, great question. So, this was a product that was manufactured under Chimerix's ownership that --whose title was transferred as part of our acquisition. And my comment was really in my prepared remarks and acknowledgment, Nick, that both the Emergent team and that Chimerix team did just a remarkable job at number one, getting the product to where it needed to be in order to ship it to BARDA under the procurement contract as quickly as we did. So, it was a lot of work done under behind the scenes to make this integration and work effectively, and kudos to both organizations to work collaboratively to make it happen.\n\nUnknown speaker -- Cowen and Company -- Analyst\n\nGreat. Thanks for taking my questions.\n\nOperator\n\nThank you. One moment for the next question. Our next question will come from the line of Christopher Sakai from Singular Research. Your line is open.\n\nUnknown speaker -- Cowen and Company -- Analyst\n\nHi. This is Aseem for Chris. I was wondering if you can give us some flavor for Tembexa's growth going forward. There was a significant contribution this quarter.\n\nBut long term, how you are expecting growth both in terms of top line and bottom line from the revenue stream?\n\nBob Kramer -- President and Chief Executive Officer\n\nYep, Aseem, thanks for the question. So, under the current contract with BARDA that, by the way, still sits with Chimerix. It's going through a novation process. The base period of performance we expect to deliver on those procurement deliveries in calendar year 2022.\n\nWe'll talk more about future deliveries under the contract as part of our 2023 guidance when we talk about that ahead of the JPMorgan conference in early January.\n\nUnknown speaker -- Cowen and Company -- Analyst\n\nOK. And I think early in the call, probably I missed it, you said that for AV7909, the PDUFA is now July 2023. This is the first time you've gotten this PDUFA date or the PDUFA date has been changed from the previous date?\n\nBob Kramer -- President and Chief Executive Officer\n\nSo, I'm going to call my colleague, Adam, he's closer to whether this was the first PDUFA date given or an amended PDUFA date. Adam, do you want to weigh in?\n\nAdam Havey -- Executive Vice President and Chief Operating Officer\n\nSorry, Bob, I was on mute. Yes, and the tool correct me here, but the original date was earlier. I think this is a recent change. So, when we had submitted it based on some questions in some feedback, this has been modified.\n\nSo, this was not the original.\n\nUnknown speaker -- Cowen and Company -- Analyst\n\nOK. And finally, on the share repurchase program, is there any authorization left, if you can remind us?\n\nBob Kramer -- President and Chief Executive Officer\n\nYeah. Rich, you want to field that one? I think you addressed that in part in your prepared remarks that -- maybe to reiterate the comment.\n\nRich Lindahl -- Chief Financial Officer\n\nYeah. So, the original authorization was for a total of $250 million against which we have purchased $188 million, and that authorization is expiring later this week.\n\nUnknown speaker -- Cowen and Company -- Analyst\n\nOK. Perfect. Thank you so much.\n\nOperator\n\nThank you. [Operator instructions] One moment for our next question. Our next question will come from the line of Brandon Folkes from Cantor. Your line is open.\n\nBrandon Folkes -- Cantor Fitzgerald -- Analyst\n\nHi. Thanks for taking my question. Just one for me. Can you maybe just give us some context about what you're seeing in terms of NARCAN pricing in the public interest channel? And the rating guidance was very good.\n\nBut just how is NARCAN pricing holding up in a public interest channel?\n\nBob Kramer -- President and Chief Executive Officer\n\nYep. Thanks, Brandon. So, as we've discussed and acknowledged the price per carton in the public interest market has been under some pressure given the entrant of the generic product. It's holding its own from a market share perspective on units.\n\nBut on the price freight per carton, it's clearly under pressure. Not so much, Brandon, is what we've experienced in the retail market where it has been under significant pressure. But clearly, there is pressure on the public interest market. We haven't really disclosed what our average selling price is.\n\nBut as you will remember, prior to the formation of the generic market, NARCAN was discounted already 40% discount to the average wholesale selling price of $125 in the retail market, making it $75 per dose. So, it has gone down from that number, but we're not really disclosing what the new price point is.\n\nBrandon Folkes -- Cantor Fitzgerald -- Analyst\n\nThanks, Bob. Actually, one follow-up if I may. The October report from the GAO about HHS leading to address the Strategic National Stockpile requirements at inventory risk. Can you just talk about your take on that? And maybe what climate you're seeing in Washington in terms of committing more spending to address those risks versus maybe cutting back on some legacy holdings initiative, National Stockpile? Thank you.\n\nBob Kramer -- President and Chief Executive Officer\n\nYeah. Great question, Brandon. So, the GAO report, I think, highlighted a couple of inconsistencies in terms of, is the government following through and executing on the commitments required to maintain and replenish stockpiles of critically needed medical kind of measures consistent with their strategies. In some cases, they have, in some cases, they fallen a bit short.\n\nI think they pointed to funding on an annual basis as being a critical element and supporting element of the need to, again, follow through on those strategic initiatives, whether they be anthrax vaccine or smallpox vaccine-related. So, I think the GAO report was a helpful reminder that if the government sets a strategy that it has to have the appropriate congressionally approved funding to support the execution of those strategies. And as we've talked about, when you look at the critical role that these public-private partnerships play in terms of following through and executing strategies related to public health threat preparedness, this is at the center of the priority. Those private-public partnerships work when there is clearly transparent communications.\n\nThere is certainty and there is collaboration and it's worked well for us over the years. The fact that the government has not followed through yet on their exercise of ACAM2000. As I said in my prepared remarks, it's disappointing, but I'm confident that we'll work through in the near term and be able to report good outcomes here going forward.\n\nBrandon Folkes -- Cantor Fitzgerald -- Analyst\n\nGreat. Thank you for taking my questions.\n\nOperator\n\nThank you. And I'm not showing any further questions in the queue. I'd like to turn the call back over to Robert Burrows for any closing remarks.\n\nBob Burrows -- Vice President of Investor Relations\n\nThank you, Victor. And with that, ladies and gentlemen, we now conclude the call. Thank you for your participation. Please note, an archived version of today's webcast, as well as the PDF version of the slides used during today's call, will be available later today and accessible through the Investors landing page on the company website.\n\nThank you once again, and we look forward to speaking with all of you in the future. Have a good night.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBob Burrows -- Vice President of Investor Relations\n\nBob Kramer -- President and Chief Executive Officer\n\nRich Lindahl -- Chief Financial Officer\n\nJessica Fye -- JPMorgan Chase and Company -- Analyst\n\nKeay Nakae -- Chardan Capital Markets -- Analyst\n\nUnknown speaker -- Cowen and Company -- Analyst\n\nAdam Havey -- Executive Vice President and Chief Operating Officer\n\nBrandon Folkes -- Cantor Fitzgerald -- Analyst\n\nMore EBS analysis\n\nAll earnings call transcripts"
}