{
  "companyName": "Latham Group, Inc.",
  "companyTicker": "SWIM",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/latham-group-inc-swim-q2-2022-earnings-call-transc/",
  "content": "Latham Group, Inc. (SWIM -1.23%)\nQ2 2022 Earnings Call\nAug 11, 2022, 9:00 a.m. ET\n\nOperator\n\nGood day and welcome to the Latham Group Inc. second quarter 2022 earnings conference call. [Operator instructions] All participants will be in listen-only mode. Please note, this event is being recorded.\n\nI would now like to turn the conference over to Nicole Edelman, investor relations representative. Please go ahead.\n\nNicole Edelman -- Investor Relations\n\nThank you and welcome to Latham's Q2 fiscal 2022 earnings call. Earlier this morning, we issued our earnings press release, which is available on the Investor Relations portion of our website, where you can also find the slide presentation that accompanies our prepared remarks. On today's call are Latham's president and CEO, Scott Rajeski; and CFO, Robert Masson. Following the remarks, we will open up the call to questions.\n\nDuring this call, the company may make certain statements that constitute forward-looking statements. Such statements reflect the company's views with respect to future events as of today and are based on our management's current expectations, estimates, forecasts, projections, assumptions, beliefs, and information. These statements are subject to a number of risks that could cause actual events and results to differ materially. Such risks and other factors are set forth in the company's earnings release posted to its Investor Relations website, and will be provided in our Form 10-Q for the second quarter of fiscal year 2022.\n\nThe company expressly disclaims any obligation to update or review publicly any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by applicable law. In addition, during today's call, the company will discuss non-GAAP financial measures, which we believe could be useful in evaluating our performance. Reconciliations of adjusted EBITDA to net income calculated under GAAP can be found in our earnings press release and will be included in our Form 10-Q for Q2 2022. I'll now turn the call over to Scott Rajeski.\n\nScott Rajeski -- President and Chief Executive Officer\n\nThanks, Nicole. Good morning. Thank you for joining us for our second quarter 2022 earnings call. Before we get started, I would like to take the opportunity to introduce our new CFO, Rob Masson.\n\nAs we recently announced, Rob officially joined Latham on July 11 and has already hit the ground running. Rob is an accomplished finance and industrial manufacturing leader with nearly 20 years of experience in the aerospace and defense and industrial sectors. Please join me in welcoming Rob to the Latham team. I'd also like to take this opportunity to thank Mark Borseth for his contributions to leading Latham through such a transformative moment in our company's history.\n\nWe are grateful to have benefited from his leadership and for his current work as a strategic advisor to ensure a seamless transition. Additionally, I also want to take this opportunity to thank our employees and dealer partners for their hard work and dedication to Latham. We could not do it without you all. Q2 was another quarter of growth with net sales and adjusted EBITDA, both increasing 14%.\n\nDuring the quarter, we continue to experience strong demand for fiberglass pools as well as our cover and liner products. Our previously announced price increases helped drive sales growth, more than offsetting the softening volume in our packaged pools category during the second quarter, which was primarily a result of inventory destocking in the distribution channels and weather-related delays on installations. We are pleased with our overall performance in the first half in which we posted net sales growth of 21% and adjusted EBITDA growth of 27%. Our year-to-date results reflect the strength of our fiberglass material conversion strategy, unique direct to consumer model, and digital strategies.\n\nIn addition to investing in the long-term growth of the business, we also opportunistically executed a share buyback of $15 million in the second quarter. Let me update you a bit on the operational progress we made in the second quarter. Our North American fiberglass production again increased sequentially and versus prior year with 14% growth quarter over quarter in Q2 and 30% growth in the first half compared to the prior year period. We continue to work through the robust fiberglass order backlog and improve lead times.\n\nWe have taken significant steps to address the temporary flake shortage discussed on our Q1 earnings call, which had minimal impact on Q2 results. We anticipate this will be fully resolved by the end of Q3. In addition, we have continued to streamline the production of our non-fiberglass operations, which combined with increased inventory levels, allowed us to get back to our historic lead times. We also wanted to provide a quick update on the fire at our Odessa, Texas, fiberglass manufacturing facility.\n\nBy mid-May, all production had been successfully shifted to other facilities with a minimal impact on sales. These operational improvements reflect the capabilities of the team and the resilience of our business. We believe we are well-positioned from a manufacturing and supply chain perspective as we move into the back half of the year. While we feel good about the results we delivered in the first half and the overall state of the business, we expect a softening in the volume that we saw in the second quarter in our in-ground pool product category, which was driven primarily by package pools to continue through the balance of this year.\n\nIn response to the recent macro uncertainty, coupled with some delayed installs from unseasonably wet weather in Q2, many of our wholesale distribution channel partners began to destock their elevated inventory levels in recent weeks. We do not expect the missed installs due to the unfavorable weather to be recovered in the back half of 2022, given many of our dealers are completely booked into early 2023. On the positive side, we continue to expect robust growth in our fiberglass business, reflecting our efforts to drive fiberglass adoption and strong performance in our liner and cover products in the back half of the year. That said, we do not believe this performance will be enough to offset the impact of wholesale distributor destocking in our packaged pools and unfavorable first half weather.\n\nAs a result, we are resetting our guidance for full year fiscal 2022, which now indicates net sales growth of between 19% and 22% in adjusted EBITDA growth of between 18% and 25%. Rob will go into detail on this later. Our updated guidance continues to imply impressive year-over-year growth, and we are confident in our ability to continue to execute on our strategy and deliver growth in the near and long term. The work we have done to strengthen our supply chain has been paying off as the breadth of our offerings and strong supplier and dealer relationships enable us to respond quickly to demand increases.\n\nWe are focused on keeping our manufacturing capacity ahead of demand with construction of our Kingston fiberglass manufacturing facility in full swing. We are excited to provide additional updates in the coming quarters. The underlying fundamentals of our growth strategy remain unchanged and position us well for continued success as we look to 2023 and beyond. First, the material conversion to fiberglass.\n\nAs we have discussed before, this is a key part of our growth strategy. We continue to drive awareness and education with homeowners and dealers on the value proposition associated with fiberglass pools, the low level of penetration of fiberglass pools in the North American market, and our ability to drive material conversion provides significant runway for future growth and helps bolster our performance in any economic downturn, given the competitive advantages of the products. Fiberglass pools have significantly lower upfront and lifetime costs compared to concrete pools. Additionally, fiberglass pools can be installed in less than one week and in some cases one day, compared to a three-month install for some concrete pools.\n\nThis allows the homeowner to enjoy their swimming pool much more quickly and allow dealers to grow their business more rapidly by increasing the number of pool installations per year and extending the installation season. Latham's fiberglass pools are the most durable and attractive swimming pools in the market, with premium quality and impressive strength that outperforms concrete pools. We are seeing our efforts play out in Google Trends data with homeowner searches for fiberglass pools far exceeding homeowner searches for concrete or gunite pools, boding well for future demand. Second, we continue to build our exclusive network of dealers and work with our dealers to enhance their productivity and grow industry installation capacity.\n\nWe are receiving positive feedback and results from our dealer bootcamp training sessions, which have all -- which have directly led to an increase in the pools installed by those participants. In 2022 so far, we have trained over 200 dealer installation teams, a seven-fold increase compared to 2021. Our dealers note that they are still booking orders into 2023 and seen strong homeowner interest. On the Latham side, we continue to utilize our online lead generation engine to bolster the 2023 pipeline of qualified leads for our dealer partners.\n\nWe continue to focus on our branding and digital initiatives, which are a key differentiator for us. Our direct engagement with homeowners is transforming the pool buying process and gives us the ability to generate purchase-ready leads for our dealer partners quickly and efficiently. Our lead generation engine continues to empower us to improve the quality and quantity of leads for our dealer partners and is generating both purchase-ready leads as well as those who need further qualification. In response to this opportunity, we have implemented a new lead qualification program leveraging our My Latham platform and leading market automation software to nurture leads as prospects until they are purchased-ready.\n\nNational campaigns drove a majority of the volume of leads through May, and we have recently kicked off new regional campaigns in major markets, where we have onboarded dealers with installation capacity and our manufacturing plants have the production capacity to respond quickly to spikes in demand. As we turn up the lead engine in these geographies, we saw an immediate impact. Leads increased 25% in the first week, which increased to 76% by the second week. In the first eight weeks, we produced approximately the same number of leads focusing on regional markets as we generated for the first 20 weeks of the year when using the broader national campaigns.\n\nNew rounds are planned for the back half of the year, with national campaign's organic content and search engine optimization in sync with these efforts. Before I hand the call over to Rob, I want to highlight that on July 6, 2022, we published our inaugural Environmental, Social, and Governance Report. This is just the first step in our efforts to set clear goals, measure progress, and increase transparency of Latham's environmental impacts, social outcomes, and business practices. We are proud of the initial progress we have made with highlights including reducing wastewater from four plants to zero and recycling all vinyl and steel scrap to significantly reduce waste going to landfills.\n\nTo close, the dynamics of the large outdoor repair remodel market remain attractive and we will continue to work as a team to navigate the current environment. We see continued demand for our products with a generational shift in spending from indoor, outdoor, and continued meaningful migration to suburban areas from urban areas as well as southern states where pool ownership is higher. Our large fiberglass order backlog remains robust, with many of our dealers booked out into 2023 and we continue to generate recurring revenue from our industry-leading covers and liners businesses. As the market leader with significant scale, we are confident that we are uniquely positioned for success as we move into the back half of the year as well as 2023 and beyond.\n\nWith that, I'll turn it over to Rob.\n\nRobert Masson -- Chief Financial Officer\n\nThank you, Scott, and good morning, everyone. Today, I'll review our second quarter and first half fiscal 2022 results and provide an update on our outlook for the full fiscal year. Before we dive in, I want to express how thrilled I am to be part of the Latham team. I believe we're in an excellent position to capitalize on our unique value proposition long term.\n\nTurning now to our results. Net sales for the second quarter were 207 million, up 26 million or 14% year over year. By product line, this increase was primarily attributable to growth in full covers, which increased 46% to 38 million and liners, which increased 21% to 56 million, while in-ground pools expanded 4% to 112 million in the quarter. In the in-ground pool category, we grew sales in fiberglass pools while we experienced a pullback in package pool sales.\n\nThe 26 million increase in second quarter net sales was driven by a 34 million increase in pricing and an 8 million decrease in volume. The volume decrease was primarily attributable to package pools, which were impacted by our wholesale distribution customers, who had begun to destock inventory levels as well as more days of unseasonable weather in certain regions that limited installation dates. Switching now to gross profit, we generated 68 million of gross profit, up 9 million or 16% on the flow through of net sales growth and a decrease in non-cash stock-based compensation expense. Gross margin improved in Q2 to 32.7% and was up 40 basis points, compared to 32.3% last year.\n\nThe year-over-year reduction in non-cash stock-based compensation expense drove the expansion. Excluding stock-based compensation expense, gross margin decreased 180 basis points due to the impact of inflation and negative fixed cost leverage, mostly associated with lower volumes in package pools and in some case, the investment in fiberglass capacity expansion. Selling, general, and administrative expense decreased to 42 million, compared to 95 million in Q2 of 2021. This decrease was primarily driven by a 55 million decrease in non-cash stock-based compensation expense.\n\nExcluding non-cash stock based compensation expense, SG&A increased 2 million or 7%, which is roughly half of our net sales growth rate. The increase was primarily due to investments in additional headcount to support growth. Adjusted EBITDA increased to 49 million, up 6 million or 14%, and adjusted EBITDA margin decreased 20 basis points to 23.5%. Net sales for the first half of fiscal 2022 were 398 million, up 69 million or 21% year over year.\n\nWe have seen net sales growth across our three product lines for the first six months of fiscal 2022. In-ground pools increased 11% to 224 million, covers increased 41%, 71 million, and liners increased 33% to 104 million. Gross profit increased to 138 million, up 25% from 111 million in the prior year. Gross margin for the first six months of 2022 increased to 34.7%, inclusive of non-cash stock-based compensation expense, compared to 33.6% for the prior year period.\n\nThe 27 million increase in gross profit and the 110-basis-point increase in gross margin were driven by the flow through benefit of pricing actions to offset inflation and a 3 million year-over-year reduction in non-cash stock based compensation expense partially offset by negative fixed cost leverage. Excluding non-cash stock-based compensation expense, gross margin expanded 20 basis points in the first half of the year. Adjusted EBITDA was 97 million for the first six months of 2022, up 27% from the prior year period. And adjusted EBITDA margin increased 100 basis points to 24.2% from the prior year period.\n\nNow switching to the balance sheet. As of July 2, 2022, we had cash and cash equivalents of 25 million, total debt of 340 million and our net debt leverage ratio was 1.8 times. Net cash generated by operating activities was 42 million for the second quarter of 2022, compared to 55 million in the prior year period, with the reduction primarily driven by investments in working capital, mainly inventory to return to normalized lead times and the embedded impact of inflation on inventory. For the first half of fiscal 2022, we used 15 million of cash in operating activities, whereas in the first half of fiscal 2021 we generated 14 million.\n\nThe first half year-over-year change was also mostly due to the return to normalized lead times and the embedded impact of inflation on inventory. Capital expenditures totaled 10 million in the second quarter of fiscal 2022, compared to 8 million in Q2 last year, driven by the increased investment in fiberglass capacity, most notably the Kingston manufacturing facility project. Capital expenditures totaled 17 million in the first six months ended July 2, 2022, compared to 13 million in the prior year period. Through our stock repurchase authorization, we used 50 million of cash to buy back a little over 2 million shares at an average price of $7.40.\n\nBefore we switched or updated guidance, let me take a moment to comment on capital allocation. Our capital allocation philosophy centers around maintaining the ability to execute on our strategic objectives through the cycle to maximize value for our shareholders. We do so by actively managing our capital structure through maintaining liquidity, paying down debt, and on returning cash to shareholders. Now switching to our revised 2022 guidance.\n\nBased on the factors Scott outlined previously, we have updated guidance for the full year fiscal 2022. We expect to deliver net sales of 750 million to 770 million, representing 19% to 22% year-over-year growth. Adjusted EBITDA of 165 million to 175 million, representing 18% to 25% year-over-year growth. And now we expect our capital expenditures to be in the range of 40 million to 50 million.\n\nWe remain committed to investing in fiberglass capacity in our digital transformation to drive long-term growth for the business. Our revised capex guidance is based on the prioritization of key initiatives focusing on delivering our strategic objectives. As we look to our three- to five-year targets, it's important to remember that even as our macroeconomic environment shifts, the fundamental success factors of our business remain unchanged. Our outlook reflects our ability to continue to drive material conversion to fiberglass pools, to leverage our unique, direct-to-homeowner digital strategies, to generate qualified leads for our dealer partners, and to capitalize on homeowners continued investment in their backyard.\n\nScott, I'll turn it back to you for closing remarks.\n\nScott Rajeski -- President and Chief Executive Officer\n\nThanks, Rob. I'm very proud of all we have accomplished on an operational level and know we are rising to meet the challenges of this macro environment as a stronger and more efficient business. We are looking forward to closing out the second half of the year and are on track to deliver our 13th year of net sales and adjusted EBITDA growth and adjusted EBITDA margin expansion as we begin to lay the groundwork for our 2023 plans. Thank you for your time today and I hope you all enjoy what's left of summer.\n\nOperator\n\n[Operator instructions] Our first question comes from Rafe Jadrosich with Bank of America. Please go ahead.\n\nRafe Jadrosich -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good morning. It's Rafe. Thanks for taking my question.\n\nScott Rajeski -- President and Chief Executive Officer\n\nGood morning, Rafe. How are you doing?\n\nRafe Jadrosich -- Bank of America Merrill Lynch -- Analyst\n\nJust trying to follow up on the comments on the packaged pools, which I think is the vinyl liner pool. Can you talk about how the distribution varies for package pools compared to the fiberglass pools? And then where are we in that destocking process for the package pools? How much more do we have to go?\n\nScott Rajeski -- President and Chief Executive Officer\n\nYeah. So Rafe, if you guys recall, and I'll start with fiberglass, fiberglass is really a direct model, right, where we're distributing the pool from one of our factories, like to the backyard of the consumer for the dealer, the installer. So that that's more of a direct product and it's similar to the liners and covers for the most part as well. Think of those as more direct.\n\nSome of the liners do go through distribution, but it's more of a quick pass through. The package pools segment of the in-ground category is more of a stocked component product sitting in the wholesale distributor branches where the dealer would then come in and pull that off the shelf. I would say we're probably about halfway through that destocking. I think we'll see that continue through 3Q and then stabilize.\n\nAnd that is what we reflected in our in our current guidance that Rob provided the update on here this morning.\n\nRafe Jadrosich -- Bank of America Merrill Lynch -- Analyst\n\nVery helpful. And then can you just talk about the sell-out trends that your dealers are seeing or the traffic trends there? How over the last few months, as we've seen, the macro environment become more uncertain. How has the traffic evolved? What are you seeing for end market demand and what are you assuming in the second half of the year?\n\nScott Rajeski -- President and Chief Executive Officer\n\nYeah. It's -- I'll kind of highlight in each of the categories. The liner business has continued to be strong and again, that's mostly a replacement business. Some of the miners are going into new pools.\n\nSo that's been a good strength for us through the entire season and continuing here into 3Q. The cover business is the same. We're seeing a really strong cover business, both for the automatic covers and as many of you recall, we're really just starting to enter the winter safety cover season. That will be ramped up here later this month and through early 4Q.\n\nAnd the early read on that is we're expecting a real good season there from all indications of our dealers and the consumer level. And then fiberglass continues to be strong. We expect to see a really strong second half for fiberglass sales. Again, we got a really good backlog.\n\nWe're taking orders into '23. But more importantly, with supply chain challenges behind us, we've got the capacity in the ground, we've got material availability, and our lead times are much improved. So we can quickly turn and get pools out on a frequent basis for dealers. In the package pool category, dealers are still booked through the end of the year and booking into '23.\n\nAnd again, that's the other piece of the in-ground category. What we're not seeing is the pools kind of restocking or the distribution level as they adjust inventory positions where they probably get a little higher than normal know. We'll see that correct through the back half of the year. And then we should be good as we head out for the 2023.\n\nSo some dealers is back on the consumer demand at the dealer level. A lot of dealers are still seeing good demand at the consumer level, but there are pockets of the country and regions, and I'll say dealer eventually down to the dealer region level, where they have seen a slowing of leads. And that's why we've really increased the lead generation efforts for those dealers in many of those markets. Again, I'd say it's still elevated from where we were back in '18, '19 time frame.\n\nThey just got accustomed to a much higher level of backlog and a much heavier flow of demand and lead generation. And we're funneling those leads back to them.\n\nRafe Jadrosich -- Bank of America Merrill Lynch -- Analyst\n\nGot it. That's helpful. Thank you.\n\nScott Rajeski -- President and Chief Executive Officer\n\nWelcome.\n\nOperator\n\nYour next question comes from Matthew Bouley with Barclays. Please go ahead.\n\nMatthew Bouley -- Barclays -- Analyst\n\nHey, good morning, everyone. Thanks for taking the questions. I guess first one, just on the pricing versus cost side. I guess, number one, just what are you seeing on on the cost inflation side? And if some relief does manifest on that side of things, how do you guys think about pricing and promotions in an environment where you may start to see cost relief? Thank you.\n\nScott Rajeski -- President and Chief Executive Officer\n\nYeah. Good morning, Matt. I'll lead and then if there's any other caller Rob wants to provide, he can. Look, we've not really seen a slowdown of the cost inflation on many of the front.\n\nThere has been a few pullbacks in a few of the categories, but it's still very elevated from, let's say, where it was 12, 18, 24 months ago. So we're monitoring that. We'll continue to watch that one. And then at this point, we're not planning or thinking about any price reductions or promotions out there to try to move product on, especially just coming in this cover season, strong fiberglass backlogs.\n\nSo we think we're in a good position on the price cost inflation curve, but like we've done over the last now, probably 24 months, we'll keep discipline clearly in front of us and adjust as we see fit going forward. But no plans to do anything from a pricing standpoint at this point where we sit right now and that's reflected in guidance and then kind of our expectations.\n\nMatthew Bouley -- Barclays -- Analyst\n\nGot it. That's super helpful. Thank you for that, Scott. And then secondly, just on the margin guidance, I think the -- you're implying on an EBITDA basis, maybe margins declining 80 basis points year on year for the second half at the midpoint.\n\nAnd correct me if I'm wrong, but I'm just curious if you kind of outline sort of components, gross margins versus SG&A within that and kind of what you think you could flex more aggressively, if you need to. Thank you.\n\nRobert Masson -- Chief Financial Officer\n\nMatt, I think for the full year we're expecting kind of flat adjusted EBITDA margins to slightly up. Certainly you see in the second half with our guidance that there's a little bit of a headwind there on the margin, but that has to do with the underlying inflationary impacts we've talked about already and the expectation of that going forward. But we don't give specific guidance on either SG&A breakdown or gross margins.\n\nMatthew Bouley -- Barclays -- Analyst\n\nAll right. Thanks, Rob. Thanks, Scott.\n\nScott Rajeski -- President and Chief Executive Officer\n\nThanks, Matt.\n\nOperator\n\nNext question comes from Josh Pokrzywinski with Morgan Stanley. Please go ahead.\n\nGustavo Gonzalez -- Morgan Stanley -- Analyst\n\nHey, good morning, guys. You actually have Gustavo Gonzalez on for Josh. Thanks for taking the questions. Just quickly and I think sort of realized price and second quarter here with some in the high teens range, how does that compare to your second half price outlook? Should we expect moderation to start lapping some second half '21 price? And then sort of talk about your expectation in the third quarter and I guess broadly just like second half, I think that third quarter destocking is like mostly where [Audio gap] but any color would be [Audio gap]\n\nRobert Masson -- Chief Financial Officer\n\nThanks, Gustavo. I think first half versus second half, we expect kind of the same run rate price as we had in the first half.\n\nGustavo Gonzalez -- Morgan Stanley -- Analyst\n\nGot it. That's helpful. Can you hear me?\n\nScott Rajeski -- President and Chief Executive Officer\n\nYeah, go ahead, Gustavo. There was a little bit of a pause there.\n\nGustavo Gonzalez -- Morgan Stanley -- Analyst\n\nYeah. And then I guess just on your sort of your second half volume expectations was the second half of that question.\n\nRobert Masson -- Chief Financial Officer\n\nOh, yeah. Sorry. OK. We expect continued growth in the fiberglass, although we don't break it out, the in-ground pool section.\n\nPackage pools will be similar to the second quarter or the first half in terms of volumes.\n\nGustavo Gonzalez -- Morgan Stanley -- Analyst\n\nGot it. That's helpful. And then I guess just sort of thinking about the current environment and I know you guys have sort of targeted, I think low to mid 20s on the fiberglass [Audio gap] rate. Just sort of has your expectations sort of changed in the near term or -- given what's going on?\n\nScott Rajeski -- President and Chief Executive Officer\n\nYeah. So Gustavo, without quoting what we think the actual number will be because we really can't calculate that until early spring once we see our final pool starts from peak data shake out and run our analytics. Well, what I would say is like we're continuing to drive that material conversion story, driving the acceleration. Great indicator is 200 new dealers trained in fiberglass here over the last or I guess the first six, seven months of the year.\n\nWe're bringing dealers back on, demand is resonating at the consumer level. And I think the economics of the fiberglass wall versus the concrete floor, that lower upfront cost and total cost of ownership probably resonate even now more for a consumer as they're making that pool buying decision and maybe looking to save a save a few dollars and actually wind up with a much better finished product and experience in the backyard. I think what we're focused on is part of our long-term strategy is driving that 40% to 50% penetration number like you see in Europe. And that 70-plus percent penetration that we see in Australia.\n\nSo no change in our focus, our efforts. And that's also why we're continuing to push the capacity expansions in that category with the moving on with the Kingston facility expansion.\n\nGustavo Gonzalez -- Morgan Stanley -- Analyst\n\nGot it. That's helpful. Thank, guys.\n\nScott Rajeski -- President and Chief Executive Officer\n\nYou're welcome, Josh.\n\nOperator\n\nThe next question comes from Tim Wojs with Baird. Please go ahead.\n\nTim Wojs -- Robert W. Baird and Company -- Analyst\n\nHey. Good morning, guys.\n\nScott Rajeski -- President and Chief Executive Officer\n\nMorning.\n\nRobert Masson -- Chief Financial Officer\n\nMorning.\n\nTim Wojs -- Robert W. Baird and Company -- Analyst\n\nMaybe just kind of starting on the digital initiatives, could you just talk to kind of what you're doing on some of these regional campaigns that have kind of picked up and generated new leads? And I guess if you could maybe kind of break down what the cost of that is and how kind of replicable that is across the dealer base and other geographies?\n\nScott Rajeski -- President and Chief Executive Officer\n\nYeah. So there's several pieces within that of how we run these campaigns. And I'll start with, right, the last 12 to 18 months, we've really just had normal organic SEO search really carry us through the last 18 to 24 months, where we've talked about we actually turned off our lead generation engine because dealers were flooded. We started to hear some dealers in pockets of the country say they seen a slowing of leads.\n\nIt's not like the lead have stopped or turned down. It's just slowed from what they've experienced in the last 12 to 18 months. So we started turning off some of the regional programs and offerings. And again, we -- without disclosing exactly how we do it, we've got the ability to go in certain market territories, boost the lead generation engine through many different marketing and digital platforms that we use, funnel those leads to our grand dealers in those markets.\n\nAnd if you go back and look at the metrics I quoted upfront, the success of that is pretty immediate, where after the second week, 76% uptake in legions. And by the eighth week of the campaign we generate as many leads and that week as we did the first 20 of the year. So it's a very select approach. I'm not going to disclose the cost, but I would say it's not that expensive to run programs like this with our engine and it's got a very high ROI on that investment on a dollar per lead basis.\n\nAnd I'll say it's less than $100 per lead without giving the exact number to just kind of give you a feel for the magnitude of what we're doing here. And as we go forward, we'll continue to just press as hard as we can on that front for our dealers and they're seeing it. And that will really help us drive what we see as nice early growth here in the second half and into '23 in the fiberglass category.\n\nTim Wojs -- Robert W. Baird and Company -- Analyst\n\nOK. OK. And I guess like of the regeneration that you've kind of done regionally, I mean, is there a way to think about how much of how many dealers that touches as a percentage of the dealer base. I'm just trying to think about how over the next six to nine months, how much you can really lean into this drive more volume next year.\n\nScott Rajeski -- President and Chief Executive Officer\n\nYeah. So there's a lot more leaning in we can do here on this front and that's kind of what Joel and the marketing team are looking at doing right now. We are running some regional programs and look, we can dial this thing up pretty rapidly here in the second half of the year. And the way to think of it is think of this as kind of zip code by zip code or city by city, right.\n\nWe have a grand dealer or a select dealer in a particular market. The leads will come in. There's a lead prioritization in the disposition funnel that they have to go through. And literally it will go to the first -- the biggest deal on the market first.\n\nThey have a certain amount of time to disposition the lead or call the consumer back and convert it to an order. At that point, it will then go to other latent dealers in the particular city or area. So if you think about market territories, right, we're thinking of I'll pick on the Charlotte area, North Carolina, right? So all those dealers in that Greater Charlotte area. If you think about Northern California, we would target an area.\n\nSo these campaigns go after pretty good territories and areas and just pushing leads with all those dealers with a quick funnel down. So it's like I said, it's doing pretty well. Clearly something we'll be ramping up and it's really the tightness of our sales team with the dealers. When they ask for it, we respond quickly to that.\n\nTim Wojs -- Robert W. Baird and Company -- Analyst\n\nOK. OK. Good. And then just just one more.\n\nCan you give us an expectation for what you're thinking free cash flow should be this year?\n\nRobert Masson -- Chief Financial Officer\n\nYeah, we generally don't forecast free cash flow or give guidance on it. We forecast, of course, when we look at that.\n\nTim Wojs -- Robert W. Baird and Company -- Analyst\n\nOK. Sounds good. Thanks, guys.\n\nScott Rajeski -- President and Chief Executive Officer\n\nThanks, Tim.\n\nOperator\n\nThe next question comes from Ryan Merkel with William Blair. Please go ahead.\n\nRyan Merkel -- William Blair and Company -- Analyst\n\nHey, guys. I wanted to ask on the second half. Good morning. I wanted to ask you about the second half revenue assumptions.\n\nSo it looks like about 120 million is the delta between the old guide and the new guide. Is the majority, the destock that we're going to see in the above ground -- I'm sorry, in the package pools and maybe a bit for weather or did you also include a slowdown -- a bigger slowdown to be conservative?\n\nScott Rajeski -- President and Chief Executive Officer\n\nYeah. So Ryan, I'll kind of pick up the high level view here. The majority is the destock in the package pool in-ground category. We're not going to disclose actual percentages or splits or anything.\n\nSo let's just say that's the headline statement and then it's not all just driven by a destocking, right. The top 2Q weather that the dealers experienced was also part of that equation, where they just weren't able to get pools in the ground, right? And that's kind of pushing some of that demand and install into 3Q. And with many of the dealers I'll say sold out and again, back to the sold out term of how many because of all the put end of the year, there's just not the sprint capacity in the back half of them to make up a lot of what they lost in 2Q. So the combination of those two, and I'll just come back again and restate right, the liner category, the cover category, and even the fiberglass distinct as part of in-ground, are all strong performers across the board for us.\n\nSo we've not really seen a broad based consumer slowdown impacting the dealers yet while there is a higher level slowdown of lead generation in certain pockets of the country that we're addressing through the prior conversation.\n\nRobert Masson -- Chief Financial Officer\n\nYeah. I was just going to add that we're still delivering 19% to 22% growth and the EBITDA growth 18% to 25%. So positive year-over-year performance is our expectation. Just to underline what Scott said.\n\nRyan Merkel -- William Blair and Company -- Analyst\n\nOK. And then following up just to dig in on the packaged pools and why that might be weak while the other categories are holding up well. Is that because the package pools are more to a lower end consumer and the higher end you're just not seeing yet or is there a comp issue? And I'm just trying to figure out like what the underlying driver is. And then should we view the slowdown in package pools as like a leading indicator for maybe your other categories? Or is that not the way to think about it?\n\nScott Rajeski -- President and Chief Executive Officer\n\nNo, I hate to say it, Ryan. It's probably not the way to think about it. I'll answer the back part of the question. I really think it comes down to with all of the supply chain challenges, looking back on the last 18 to 24 months with material labor availability and lead times in these particular categories where we were out in some cases 35, 45 to 60 days, right.\n\nThat required the wholesale distributors and many cases, the bigger dealers to really start to stock up on product, to start working through their backlogs. And I think some of the backlogs are still out there for a lot of these dealers. And as the weather hit and I'll say the WD began looking at inventory levels versus where they historically had been, they were in a position where they were they were probably overstocked in many products. And as they're looking at where they think know the industry was heading, they began to kind of slow down on what I would call the in-season reorders.\n\nAnd that's really what didn't happen. We didn't seek to see the peak in-season reorder points we typically would. They're drawing down stock instead of continuing to build. And like I said, we start to see that kind of late 2Q.\n\nWe expect that to continue in the 3Q and we believe it will normalize in 4Q as they get to the right level that they feel comfortable with. And I think the reason they're doing that is if you look at the capacity we've had and where we see overall our lead times are now back to probably the best they've ever been for the company in the package pool category. We're able to push product now in a three- to five-day timeline on all those custom products, which we haven't been at and probably going back to '19 or early '20. And that's the other thing driving that.\n\nAnd just one more comment right back to the dealers for a second, they still see a healthy backlog of approvals at the consumer level. And you probably find it hard pressed to find a dealer to put a pool in for you right now this fall. They're booking orders out in many cases May or June of '23 right now.\n\nRyan Merkel -- William Blair and Company -- Analyst\n\nOK. Makes sense. Thanks, Scott.\n\nScott Rajeski -- President and Chief Executive Officer\n\nYou're welcome, Ryan.\n\nOperator\n\n[Operator instructions] Our next question comes from Susan Maklari with Goldman Sachs. Please go ahead.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nThank you. Good morning, everyone, and thanks for taking the questions.\n\nScott Rajeski -- President and Chief Executive Officer\n\nMorning, Susan.\n\nRobert Masson -- Chief Financial Officer\n\nMorning.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nMy first question is, can you talk a little bit about capital allocation? You mentioned that you did narrow and reduce that capex guide. You also mentioned the share buyback plan in the quarter. So can you just talk a little bit about what that lower capex is really reflecting? What are some of those things that you're perhaps delaying and then just how you're thinking about allocating the dollars overall?\n\nScott Rajeski -- President and Chief Executive Officer\n\nHey. So, Susan, I'll start maybe just with kind of capex side and sort of backdrop on overall capital allocation. As you recall, right, if you exclude Kingston for a second, which is a big investment for us and a big increase year over year in the capex guide we provided, most of the other projects are smaller one-off capacity just additions, where it's a mold, a truck, a piece of machinery, let's say sub-hundred thousand dollar type investments across the board. As we work through the first half of the year, couple of things we've stayed focused on from a from a capex standpoint is fiberglass expansion.\n\nWe're staying the course there to stay ahead of the demand, which is the story we've been talking about for a while here. Kingston is, what I'll say, full steam ahead. We need that capacity in the Canadian and Northeastern market to help us balance production levels in some of our other facilities. The digital transformation project is ongoing, which is important for long-term success of the company as we look out three to five plus years.\n\nAnd then what I would say is that we did the big investment in steel with the Salvagnini. That project is nearing completion. Everything else at that point are small one-offs. And we've evaluated where we sit on an overall capacity standpoint, utilization, those levels, looking at where we are in terms of current lead times and demand, and we felt that there was some projects that we just can kind of put on pause right now, thus the reduction in the guidance.\n\nBut I think the core thesis of investing in fiberglass to stay ahead of the demand is something we will continue to do, which is a testament of this conversion story, the strength of it, and it's resonating both with dealers and consumers and what we're seeing in the marketplace. And with that, I'll turn it over to Rob to kind of talk to you about overall capital allocation story.\n\nRobert Masson -- Chief Financial Officer\n\nYeah, thanks, Scott. So in capital allocation overall, we see those four levers more as an equation and the top two are really as a growth company, our focus. So both organic growth and then if there is a opportunistic M&A tuck-in, we would do that as well. So that's the primary focus for us.\n\nOn the debt side, our leverage ratio is quite low. We're very healthy. So we're happy with that. I don't see allocating a lot there in the short term.\n\nAnd then on the stock buyback, that's more of an opportunistic. If we see the right opportunity and its against really the top side. So our focus, although we have that authorization, we've only spent 15 of the 85. We have that for the next three years.\n\nWe see that more as just another tool in the toolkit of our capital allocation with the primary focus being on driving growth and long-term value in the company.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nOK. That's helpful color. As a follow up obviously, you're newer to the public markets and we don't have perhaps as much history on the business through cycles. Can you talk to your macro playbook? What are some of the things that you are watching to determine changes that you may need to make to the business? And what are some of those changes that you can do to protect the revenue as well as the margins in a weaker macro?\n\nScott Rajeski -- President and Chief Executive Officer\n\nYeah. So Susan, the high level I'll start off saying public or private, right? We've been around 65-plus years. And I think over the history of the business, it's seen pretty much every cycle. I've been with the company now 10-plus years, and I've probably seen three or four different cycles over that period as well.\n\nSo we've got a really good playbook. The things we're looking at high level, clearly incoming order rate, interactions with our dealers, what they're hearing and seeing, and really staying close to them from a lead generation demand standpoint. We don't disclose or talk about the backlogs, but that's another good indicator of what we see out there on the consumer and dealer front as we work through those. And I think overall, look, we do stay close to what we think is happening with new pool starts.\n\nWe've got some really great wholesale distribution partners that we work with to see what they're seeing from pull through with all their communications with dealers. So we kind of look at all signals there. And what I would say is what separates us from the rest of the pack a little bit is this digital strategy we have where we can dial up the demand kind of on a moment's notice for the dealers. 90 million homes out there that want a swimming pool, and I've used this that several times and I love it, right.\n\nThere's about 1.5 million of potential pool demand out there per year that we can go market to, right. Those are the homeowners who have an interest in a pool, high likelihood of buying one of the next five years. Pool stocks are still well off the peak. So we don't -- first of all, we don't see a big pullback coming overall in pool starts.\n\nWell, let's say, it did pull back some. We've had a history of outperforming the overall market with fiberglass. We've got a strong recurring revenue base with our liner and cover categories. And Rob and the finance team, I'll say the entire business, we have a good recession playbook that we can pull multiple levers of how we could quickly pull back to reduce costs, high variabilization of the cost structure of the business.\n\nSo we look at those things, we have that in in the desk drawer and I'll say there's probably three tiers of how we pull those programs. More importantly, we've brought some new folks into the organization that are kicking off a whole new lean and productivity initiative for us. Not to say we haven't done it, right. So it's a real new focus under our new chief operating officer, Sanjeev, and the team he's standing up.\n\nThey're building a nice pipeline of projects going forward that we'll probably be talking about on future calls. And it's probably all of those. And I think more importantly, if you step back, right, 12 consecutive years of top line, bottom line, and margin expansion, the guidance that that we issued here this morning, the revised guidance would indicate a 13th consecutive year in what's, look, all be true to ourselves, a pretty difficult and challenging environment overall with everything that's happened in 2022 on a global basis. So we're happy with the results.\n\nWe feel we're well positioned to maneuver through second half of the year and into '23. And this team knows how to overcome challenges that we've proven to you guys over the last 24 to 36 months.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nYeah, that's great, Scott. Thanks for the color and good luck with everything.\n\nScott Rajeski -- President and Chief Executive Officer\n\nYou're welcome, Susan. Have a good day.\n\nOperator\n\nOur next question comes from Keith Hughes of Truist. Please go ahead.\n\nKeith Hughes -- Truist Securities -- Analyst\n\nThank you. A question on the -- what you said earlier, about 4% growth in pools in the quarter. Can you talk about fiberglass pools, what the units and what the dollars were just for that just for that category?\n\nScott Rajeski -- President and Chief Executive Officer\n\nYeah, Keith, I'll hand that one off. We don't disclose distinct fiberglass or package pool unit volume numbers in that big run pool category. But what I will say is we are expecting very strong double digit growth in the second half in the fiberglass segment as a result of strong backlogs that we see we're dealers are currently positioned and all the work we're doing to drive that conversion story.\n\nKeith Hughes -- Truist Securities -- Analyst\n\nSo if you hit the double digit, is that going to be all price or will there be some unit growth in there if you're successful?\n\nScott Rajeski -- President and Chief Executive Officer\n\nYeah, both. Both, sorry.\n\nKeith Hughes -- Truist Securities -- Analyst\n\nOK. And then we've talked a lot about the inventory situation on the package pools. Is there going to be a scenario in the future where when the inventory levels adjust to the level that the dealers want, then you'll see a little bit of a bounce back as demand kind of goes back to where sell-out is? Is that something that could happen? Is something foreseeable for this calendar year?\n\nScott Rajeski -- President and Chief Executive Officer\n\nYeah, what I would say is it's a potential creep. I think what we've got to -- what we have to determine is how far does the destocking go through the back half of the year before we would expect to see a rebuilding to a reset level. And I think we've got our guidance set based on the information we have out there from our business partners. If I was to call, I probably wouldn't do that until early next year.\n\nI think everyone's going to take a cautious approach till next six months. But that's something we're really watching closely as well of how much that could potentially rebuild based on that correction that's happening currently.\n\nKeith Hughes -- Truist Securities -- Analyst\n\nOK. Thank you.\n\nScott Rajeski -- President and Chief Executive Officer\n\nYou're welcome, Keith.\n\nOperator\n\nOur next question comes from Ken Zener with KeyBanc. Please go ahead.\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nGood morning, gentlemen.\n\nScott Rajeski -- President and Chief Executive Officer\n\nMorning, Ken.\n\nRobert Masson -- Chief Financial Officer\n\nMorning.\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nSo obviously, we've seen inventory impacts, second half guidance for you. We saw it in tools, we saw it in decking and it's about a 23% revenue in the back half reduction. Obviously, with price, it seems like there's quite a bit more volume. So I -- there's two question, Scott, that I'd like to follow up on.\n\nFirst, you talked about the first half of 20 -- first half of next year, let's say, somewhere in the first half, things normalizing. What gives you that conviction? Is it really I mean, you did talk about your lead times improving. Is that what it is or it was because people are trying to discern, right. The supply level from the demand.\n\nYou had Angie's List talking about contractors going more to pay more for leads and stuff. So people are trying to discern that. Where exactly is your comfort? Then my next question is going to be tied to your gross margin because you had about a 25% incrementals in the back half negative. So is the gross margin story changing from where it was when you guys initially came out in terms of that mix toward.\n\nHigher gross margins on the fiberglass? Or did the cost inflation really eat that story away? Thank you very much.\n\nScott Rajeski -- President and Chief Executive Officer\n\nYeah. So, Ken, I'll hit kind of the high level first question and, look, we're not going to talk first half '23 from a guidance or expectations standpoint. I think it was part of what was -- what went in your question. I think the conviction of why why we feel good about everything is start that the liner and cover categories, right, are a strong recurring revenue business of that replacement product for the consumer, right.\n\nLarge installed base of pools out there. If you own a pool, you're going to replace your liner and more importantly, you have to replace your winter safety cover from the safety aspect of that. So that's a nice growing business for us. We've seen really good strength there and particularly I've got to mention the auto cover category.\n\nThat's similar to the fiberglass story, a product that a lot of folks aren't aware of. We're seeing a bigger and bigger adoption of that product on our pools, as well as all tools that are installed out there, including concrete. And that business has performed exceptionally well. So I think as we continue to drive the story on those categories, that's a big good base of business for us that's ongoing.\n\nThe fiberglass conversion story and everything we're doing there with capacity, the conversion, standing up new dedicated dealers, 200 new fiberglass dealers onboarded so far this year, we haven't lost supply chain at all today, which was actually great, because that all for us at this point in time. And where we sit, no longer being on hard allocations good raw material supply across the board, lead times greatly improved in fiberglass, our ability to start being aggressive in that space, to bring it on board, onboarding new dealers, working that quickly and rapidly grow and double their business, I think it's just more of the same of what we've been doing over the last decade or so in running the business. And packaged pool, right, does have this supply component of the stock product. Everything else is custom, right? We're producing it.\n\nSo in order, they go out the back door of the consumer. That product does have a little bit of inventory stocking, but we don't really see a slowdown of consumer demand for that segment being around pool category. So hopefully I answered your question, Ken. I'll turn it over to Rob on the gross margin on -- question you had.\n\nRobert Masson -- Chief Financial Officer\n\nKen, on gross margin, we don't give guidance on that going forward or the SG&A breakdown. But what I can say is if you look at the second half, we're down a bit on volume. It's very similar to second quarter. We do have inflation built in there.\n\nWe talk about a little bit of that embedded in our inventory. So we feel pretty comfortable with where our prices are today and the value proposition we have. We continue to watch inflation, but  that that profile over the year is what we're looking at. It's the lower volume.\n\nBut again, the --\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nThank you very much.\n\nRobert Masson -- Chief Financial Officer\n\nEBITDA margin overall, what we're forecasting is flat to up. But Scott, that would be the 13th year of consecutive growth. So overall, we feel good about the year and where we're on the level even with those pressures.\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nThank you.\n\nScott Rajeski -- President and Chief Executive Officer\n\nWelcome, Ken.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Scott Rajeski for any closing remarks.\n\nScott Rajeski -- President and Chief Executive Officer\n\nThanks, Sara. Hey, thanks, everyone, for your time on today's call. And we really appreciate all of your continued interest and support of Latham and we look forward to providing further updates and future calls with all of you. Have a great rest of your day.\n\nAgain, thanks, everyone. Cheers.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNicole Edelman -- Investor Relations\n\nScott Rajeski -- President and Chief Executive Officer\n\nRobert Masson -- Chief Financial Officer\n\nRafe Jadrosich -- Bank of America Merrill Lynch -- Analyst\n\nMatthew Bouley -- Barclays -- Analyst\n\nGustavo Gonzalez -- Morgan Stanley -- Analyst\n\nTim Wojs -- Robert W. Baird and Company -- Analyst\n\nRyan Merkel -- William Blair and Company -- Analyst\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nKeith Hughes -- Truist Securities -- Analyst\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nMore SWIM analysis\n\nAll earnings call transcripts"
}