{
  "companyName": "BlackBerry",
  "companyTicker": "BB",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/21/blackberry-bb-q3-2023-earnings-call-transcript/",
  "content": "BlackBerry (BB)\nQ3 2023 Earnings Call\nDec 20, 2022, 5:30 p.m. ET\n\nOperator\n\nGood afternoon and welcome to the BlackBerry third-quarter fiscal year 2023 results conference call. My name is Matt, and I will be your conference moderator for today's call. [Operator instructions] As a reminder, this conference is being recorded for replay purposes. I would now like to turn today's call over to Tim Foote, vice president of BlackBerry investor relations.\n\nPlease go ahead.\n\nTim Foote -- Vice President, Investor Relations\n\nThank you, Matt. Good afternoon and welcome to BlackBerry's third-quarter fiscal 2023 earnings conference call. With me on the call today are Executive Chair and Chief Executive Officer John Chen and Chief Financial Officer Steve Rai. After I read our cautionary note regarding forward-looking statements, John will provide a business update and Steve will review the financial results.\n\nWe will then open the call for a brief Q&A session. This call is available to the general public via call-in numbers and via webcast in the Investor Information section at blackberry.com. A replay will also be available on the blackberry.com website. Some of the statements we'll be making today constitute forward-looking statements and are made pursuant to the Safe Harbor provisions of applicable U.S.\n\nand Canadian securities laws. We'll indicate forward-looking statements by using words such as expect, will, should model, intend, believe, and similar expressions. Forward-looking statements are based on estimates and assumptions made by the company in light of its experience and its perception of historical trends, current conditions, and expected future developments, as well as other factors that the company believes are relevant. Many factors could cause the company's actual results or performance to differ materially from those expressed or implied by the forward-looking statements.\n\nThese factors include the risk factors that are discussed in the company's annual filings and MD&A. You should not place undue reliance on the company's forward-looking statements. Any forward-looking statements are made only as of today, and the company has no intention and undertakes no obligation to update or revise any of them except as required by law. As is customary during the call, John and Steve will reference non-GAAP numbers in our summary of our quarterly results.\n\nFor reconciliation between our GAAP and non-GAAP numbers, please see the earnings press release published earlier today, which is available on the EDGAR, SEDAR, and on the blackberry.com websites. And with that, I'll turn the call over to John.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nThanks, Tim. Good afternoon, everyone, and thanks for joining the call today. This was a quarter where BlackBerry made good progress based on leading indicators for both the IoT and the cyber businesses. BlackBerry beat expectation for both total company revenue and earnings per share.\n\nOn the IoT side, we saw the business performing very strongly, setting yet another record for design-phase revenues. The strategic decision made over five years ago to position QNX as the trusted foundation for high-performance Edge compute, especially in auto, is really bearing fruit. On the cyber side, in light of what we said last quarter, we saw an improvement in the level of churn that we experienced recently. The investment being made in product and go-to-market continue to drive sequential billings growth in our cyber business.\n\nLet me start my review with the IoT business unit. As mentioned, it was another strong quarter. Revenue was 51 million, a 19% year-over-year increase. Gross margin was 80%.\n\nPreproduction revenue, that is revenue from developers' seat -- development seats and professional services set another record. This strength is being driven by significant new design wins. In fact, in the first six months of this fiscal year, BlackBerry added more new royalty backlog than in any prior 12 months period. And then, momentum continued this past quarter with wins in a number of verticals, but particularly in the safety-critical auto ADAS, advanced driver assist, and digital content domain where we are significantly gaining market share.\n\nThe largest win in the quarter includes a win with Aptiv to use the QNX hypervisor and RTOS to power a digital cockpit for European OEM. Other auto wins include a design with Daimler Truck and instrument cluster design win with Tier 1 supplier Marelli for a leading Japanese automaker, and a design with a leading Chinese Tier 1 supplier for an ADAS driver-assist module. In the quarter, we secured a total of 24 new design wins with nine in auto and 15 in the general embedded market, or GEM. In GEM, we secured design wins with medical, industrial, as well as defense and aerospace.\n\nAmong the use cases was an autopilot flight control system, a naval combat system, and a retinal surgery robotics, to name just a few. Looking forward, we continue to see a very strong pipeline of upcoming new designs. We believe that we're strong -- we're in a strong position to convert this opportunity into wins given our recent success rate, our very strong reputation in the market, and of course, the strength of our technology. Though industrywide macro backdrop for auto remains mixed, we see strength in China and India, both significant markets for QNX.\n\nOn the flip side, we see some tightening in North America and Europe, primarily due to ongoing supply chain and some demand challenges. However, it is important to give this some context. While production volume is an important factor in QNX total revenue, the auto industry's significant shift to the software-defined vehicle and the development program that drives this has enabled us to deliver a double-digit revenue growth. This quarter, was made -- we made a major product announcement for QNX in the cloud.\n\nAt the Amazon re:Invent conference, AWS announced that QNX will be made available to system supply developers via their cloud-native virtual engineering workbench. Being able to access QNX in a cloud greatly reduced the time to market for developers and provides significant additional market reach for BlackBerry. QNX will be accessible by AWS' large and growing community of over 1 million developers across multiple verticals, not just auto. We had very positive feedback from both this demonstration and early access product made available to selected OEMs and Tier 1s.\n\nWe expect to provide more details on the general availability at CES. Moving now to a new and exciting use cases for our Certicom technology. In the quarter, we deliver a electric vehicle charging station PKI, public key infrastructure, solution for a leading North America automotive OEM. The solution enables the vehicle and EV charging stations to identify and establish trusted connectivity, as well as allowing OEM to meet the new international standard for secure vehicle-to-grid interfaces.\n\nThese capabilities opens a significant opportunity for BlackBerry to secure critical smart city infrastructure in the future. Given the strength of the IoT business, going into Q4, we expect revenue to come in at the high end of the range we provided previously. We, therefore, now expected our full-year revenue outlook to be in a range of 205 million to 210 million, which translate to 15% to 18% year-on-year growth. Let me now move to IVY.\n\nProof-of-concept trials for customer continue to progress well. Product development also remain on track with the latest version released last week as planned. We have some significant product demonstration of IVy this past quarter. Last month, at the Bosch ConnectedWorld in Berlin, the IVY platform was running in a Peugeot car and enabling predictive maintenance in-car payments and Amazon Alexa virtual assistant applications.\n\nIVY was also shown operating in a cloud at AWS re:Invent conference in Las Vegas, and a developer workshop held there were well attended by OEM and Tier 1s. Feedback from both events was very positive. We also added a new application from Roadside Telematics to the IVY ecosystem this quarter. Roadside Telematics is a California-based start-up aiming to use sensor data from BlackBerry IVY to provide automatic notification to 911 emergency service in the event of a crash.\n\nLet me now turn to our cybersecurity business. Revenue for the quarter was 106 million. On the sequential basis, billing increase for the second consecutive quarter to 103 million. Gross margin was a was 57%.\n\nARR was 313 million. The dollar-based net retention rate was 84%. In line with our comment last quarter, we see signs that the investment in product and people are starting to pay off. The rate of churn seen recently has improved this quarter with an uptick in renewal rates and, with it, an improved quarter-over-quarter change in ARR.\n\nTurning now a bit to the macro environment. We've seen the same, as many other software companies, including those in cybersecurity, in noticing some elongation of sales cycles during the past quarters. Therefore, it is likely that the macro environment will be a headwind for the business in the near term, although we're likely to fare better than most given our heavy skewed toward regulated customers, particularly government. Furthermore, cybersecurity still remains a essential purchase.\n\nTouching briefly on the OEM market specifically. This past quarter, industry analysts noted increase adoption of UEM solution in regulated environment. In the quarter, despite the macro challenges, we secure a great number of multiyear transaction than previously. This includes both renews and account expansions.\n\nThe customer include some of those with the highest security needs anywhere in the world, such as multiple agency in the U.S. Department of Homeland Security, the U.S. Defense Intelligence Agency, and the National Guard. Also, the U.S.\n\nMissile Defense Agency; the pan-European Missile System Company, MBDA; as well as the NATO headquarter, will also improve our BlackBerry secure voice solution for official NATO communications. Also, within government were Shared Services Canada, the U.S. Department of Justice, the FBI, the U.S. Department of Treasury, as well as the U.S.\n\nDepartment of Energy. Outside of the North America, we secure business with the Australian Federal Court, the government of Iceland, the government of Wales, the Scottish Police, and the German Ministry of Home Affairs. In financial services, we did business with Bank of China, Credit Agricole, Blackstone investment management, Singapore DBS Bank, German KfW Bank, as well as the German federal state bank. Finally, I'll mention that we continue to win in other verticals too, with examples including Johnson and Johnson; a leading law firm, Sullivan & Cromwell; as well as Switzerland ABB, a leading electric equipment manufacturer.\n\nSome of you will hopefully have joined us for our security summit at the New York Stock Exchange in October. During the event, we announced the launch of a cyber threat intelligence subscription services that will provide customers with tailored threat briefings. This service will launch in January, and the initial response has been positive, particularly from the government agencies. Turning to outlook.\n\nWe expect to see improvement in both customer churn and new logo acquisition continuing next quarter. We are not changing our outlook for -- by cyber revenue and billings. But as previously mentioned, Q4 outlooks include some large potential government deals that the team is working hard to close. As always, with larger deal of this nature, timing can be predictable.\n\nHowever, regardless of whether we were able to close these deals in time for Q4 or if they slip into Q1, we expect to deliver sequential billings growth in the quarter. This would mean sequential billings growth for the third quarter in a row. Once more, we currently expect to see the value of billings in Q4 exceeding revenue. This is a strong leading indicator, and we expect a return to ARR growth in the second half of next fiscal year.\n\nLet me now move to licensing. Revenue in the quarter came in higher than expected at 12 million. Gross margin was 67%. In the quarter, we recognized revenue related to royalties from past licensing deals, and they came in stronger than expected.\n\nLet me now turn the call over to Steve, who will provide more details on our financial.\n\nSteve Rai -- Chief Financial Officer\n\nThank you, John. As usual, my comments on our financial performance for the third quarter will be in non-GAAP terms unless otherwise noted. Total company revenue for the quarter was 169 million. Total company gross margin was 64%.\n\nOperating expenses for the third quarter were 137 million. These non-GAAP operating expenses exclude 56 million fair value gain on the convertible debentures, 22 million in amortization of acquired intangibles, and 8 million in stock compensation expense. BlackBerry remains in a targeted investment mode, meaning our capital allocation strategy is for aggressive investment in our IoT business to capitalize on the strong opportunities we see in front of us there, and for strategic investments in our cybersecurity business to drive both top-line growth, as well as deliver profitability. These investments are discretionary and can be eased back if required.\n\nThe strategy is starting to pay off with IoT winning record levels of new designs and the trajectory of the cyber business improving. Given these investments, we continue to expect manageable EPS loss and cash usage in the near term. The GAAP operating loss for the third quarter was 2 million, and the non-GAAP operating loss was 28 million. Now, turning to the balance sheet and cash flow.\n\nTotal cash, cash equivalents, and investments were 505 million at November 30th 2022. Free cash usage in the quarter, before accounting for the settlement of a prior legal case, was 22 million. That concludes my comments, and I'll turn the call back to John.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nOK. All right. Thank you, Steve. Before we open up the line for Q&A, let me recap on the key messages.\n\nWe are pleased with the progress made. Sorry, because I think Steve missed a few points in his notes. Anyway, we appreciate the progress made by both our core business unit this quarter. The IoT business unit continues to deliver strong 19% year-over-year revenue growth despite the macro headwind.\n\nThe cybersecurity business unit trajectory is progressing with the improved level of churn and increase in multiyear deals, as well as new logos. And finally, a quick update on the IP patent portfolio sale. As we said before, there are two main interested parties. I'm pleased to say that tremendous progress has been made with both of them.\n\nCatapult, who you know now has -- now has motivated financing partners lined up, and all parties are currently negotiating the final documents. The second party is a large PE firm that doesn't need external financing. They have completed their due diligence, and term sheets discussion are well advanced. We obviously will keep you updated as things progress.\n\nThat concludes my -- that concludes my remarks. Matt, could you please open the line for Q&A?\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] We request that you limit yourself to one question and one follow-up. And our first question will come from Luke Junk with Baird.\n\nPlease go ahead.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nHi.\n\nLuke Junk -- Robert W. Baird and Company -- Analyst\n\nGood afternoon. Thanks for taking the question. A couple of questions related to this IoT business. First, John, if we could get any additional color on the subcomponents of your auto software business in IoT, specifically if there's anything you'd be able to add on the preproduction parts of that business, of course.\n\nBut also be interested in any commentary on royalty trends looking forward and how that might lay out over the next few quarters or into next year in terms of launch activity that you have a line of sight too in the business. Thank you.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nIt didn't come across clearly.\n\nLuke Junk -- Robert W. Baird and Company -- Analyst\n\nSo --\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nLuke --\n\nLuke Junk -- Robert W. Baird and Company -- Analyst\n\nYes, this is Luke from Baird. Breaking down IoT revenue, we've obviously said that the preproduction piece is at record levels. Any other comments, I'm guessing, around royalties?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nOh, I could tell you what typical year -- would a typical year -- typical quarter or year, actually. In our general guidelines, about 40% of our revenue coming from royalty, 40% coming from developer seats as well, professional, so -- and then -- sorry. And then 20% come from -- come from -- will come from services. That's kind of our rule of thumb.\n\nYes, it didn't -- it didn't come across very clear on the microphone. So, Luke, sorry about it. If you could --\n\nTim Foote -- Vice President, Investor Relations\n\nPerhaps the question, Luke, if I could rephrase, is, is there any color on -- on royalties, given the strength that we've seen in design phase [Inaudible]\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nWell, I mean, royalty is pretty much tied to production. The industry, auto production, basically, we're proportionately about the same, meaning that we expect, what, 85 million cars being built this year. So, it's a little probably about 10%, 15% down from previous pre-COVID years. So, that -- that give you some guideline of what the royalty is like. \n\nLuke Junk -- Robert W. Baird and Company -- Analyst\n\nAnd I'll just leave it there given the bad connection and take it offline. Thank you.\n\nOperator\n\nOur next question will come from Mike Walkley with Canaccord Genuity. Please go ahead.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nHi, Mike.\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nHey, John. Just -- just maybe a follow-up on the -- on the IoT question. Just based on, you know, some of the -- the record level you're seeing for the design phase revenue and particularly in ADAS, you know, as these cars go into production in future years, you know, how should investors think about maybe the magnitude of a royalty per car versus, you know, current infotainment system today?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nYeah. So, yeah, that's -- that's a good question. So the ARPU, which is you asking basically the ARPU questions, you know, our targeted ARPU remains to be $25 a car. And -- and of course, we were quite a big business from it.\n\nHowever, if you look at the infotainment world, the infotainment world now down to probably $1 to $2 a car. On the other hand, you know, ADAS is probably pushing high single-digit dollars $8, $9 -- $7, $8, $9. So, that's how -- any newer features, you know, cockpit, clusters, you know, vehicle-to-vehicle communications and stuff, they all have reasonable dollar amount tied to it, certainly a -- you know, a factor about the infotainment.\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nGreat. That's helpful. My follow-up question just -- just on the cybersecurity business and, you know, more maybe the endpoint and competitive landscape. You know, I know there's a share for Cylance to gain from like the [Inaudible] and Trend Micro, but, you know, there's several next-generation competitors that are pretty price aggressive and they're also talking about elongated deal cycles.\n\nSo, could you kind of update us on what you're seeing and what's giving you that confidence to return to ARR growth in the second half of next year?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nYeah, we have a pretty elaborate model and spreadsheets between the cyber business units and the finance organization in the company. And it looks like that, you know, returning to ARR second half of next year is quite real -- I mean, ARR growth -- sorry, year-over-year ARR growth the second half of next year. Probably pretty stable in the first half, and that's obviously based on the pipeline we have today. You know, we factor in a little bit of the pushout and -- and then, of course, the renewal of some of the -- you know, the government contract.\n\nOne -- one of our challenges is we have so many government contracts, and they typically buy on an annual basis because that's all the budgets they have. And they can only they only spend what they have approved budgets on. So -- so -- so, that's one thing that we -- we faces. But on the other hand, the good news in there is that the government -- government customers are quite steady and stable, and their buying patterns are pretty steady also.\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nOK, thanks. Maybe one last question and -- and I'll pass the line. John, just your thoughts on the macro environment heading into next year. You guys have ample cash on the balance sheet.\n\nAnd if you end up selling the licensing business, you should have more cash on the balance sheet. But as you look into a challenging macro, how are you guys thinking about balancing investment for growth versus, you know, preserving free cash flow?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nGood questions. Where we are right now -- and you listened to what Steve outlined -- that we are in a kind of a very careful investment mode. In IoT, we are definitely investing in hiring. We are winning a lot of the deals.\n\nI wouldn't say all the ideas, but a majority of the deals, particularly in the ADAS world and the cockpit world, in the hypervisor world. So, we believe the momentum, you know, the kind of a tailwind is -- it's there for us and we wanted to capture it. So, we will be hiring engineers. We'll be hiring professional services people.\n\nWe are expanding our sales force, pilot programs, and everything else. On the cyber side, John Giamatteo is balancing the growth of the ARR and the billings, balancing that with the profitability so the growth will -- the investment there will still be there, but probably will be a little slower and with an eye to the bottom line given the uncertainty of the macro, as you pointed out. So, it's kind of a little bit of a tale of two cities here. One -- one is just keep growing because we got the momentum, and the other one is we want to do a more balancing, more guarded growth.\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nOK. That makes sense. Thanks for taking my questions and happy holidays to everybody on the call.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\n Yes. Thank you. Same to you.\n\nOperator\n\nOur next question will come from Todd Coupland with CIBC. Please go ahead.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nHi, Todd.\n\nTodd Coupland -- CIBC World Markets -- Analyst\n\nHey there, John. Good evening. Can you hear me OK? \n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nYeah. \n\nTodd Coupland -- CIBC World Markets -- Analyst\n\nAll right. Sounds like the CIBC internet mic is -- is working fine. I wanted to -- to ask you about, first -- first, on the cyber business, so basically saying flat year on year in the first half with some growth in the -- in the -- in the second half. How much -- how much more work is needed to bring the updated sales team and whatever other new product bundles you're contemplating actually get to those -- those ranges that you're talking about?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nI think we are net growing the sales force, meaning that sales force size is increasing modestly. And so, we don't have to have any mysterious program or -- or very aggressive program of some sort in order to achieve what I just said. I think, you know, we -- we all feel pretty comfortable -- in the cyber business unit feel comfortable, they be able -- they be able to be flattish in the first half. Only reason that that is flattish, by the way, as a reminder, we were expecting growth in -- in the past for the first half is because of the so-called elongating sales cycle.\n\nSo, we expect it to be flattish for six months and then pick up again. And that's really a lot more macro driven rather than us having to do some special things. So, by and large, I mean, we have a road map of technology, but none of the stuff that I talked about depending on a particular product. I think the products are in pretty good shape.\n\nWe do need to continue to drive the channel, continue to increase the professional services, particularly the MSP. I think those are the two things that needs to happen, but it's part of our plan to make happen anyway. So, nothing really special.\n\nTodd Coupland -- CIBC World Markets -- Analyst\n\nOK. That's -- that's helpful. And then, I had a question on, I guess, the movements on the balance sheet. So, I think in the past, the price for the patent licensing business is 600 million.\n\nDoes -- does that potentially change if the second party comes in? Like, if they get into the mix here, is the takeaway that you're going to get to 600 million or possibly higher? Or is it just they get there first and they can close the deal? What's -- what's the message on that?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nYeah, I'm sorry, I shouldn't comment on it. I know the questions and I understand. Of course, I have the answer, but it's unfair to both parties while we're negotiating in parallel. So, if you don't mind, just hold off with that until we made the announcement.\n\nI'm expecting the announcement or the conclusion of this relatively soon.\n\nTodd Coupland -- CIBC World Markets -- Analyst\n\nI see. But -- but the takeaway is that the confidence level with the second party has gone up from the last time we talked about this, where financing was in question, to where it's -- the probability of getting that 600 million is -- has gone up materially with -- with that, and then the other the initial party getting financing. [Inaudible]\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nYeah, the -- again, I can't go into the structure, but the initial party, the confidence level had had -- you're right, has dramatically gone up.\n\nTodd Coupland -- CIBC World Markets -- Analyst\n\nOK. Should we -- should we take away, given the delay and the two parties here, that the -- the structure that was announced before is -- is potentially open to some adjustments?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nVery minor.\n\nTodd Coupland -- CIBC World Markets -- Analyst\n\nI see. OK. OK. And then just for one follow-up, balance sheet question, one of the debentures is due in about a year.\n\nAny messaging on paying it down versus refinancing at this point?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nOh, I think we're going to pay it down.\n\nTodd Coupland -- CIBC World Markets -- Analyst\n\nYou know -- the message is pay that down, OK. All right. Great. Thanks very much.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nYeah.\n\nOperator\n\nOur next question will come from Trip Chowdhry with Global Equities Research. Please go ahead.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nHi, Trip.\n\nTrip Chowdhry -- Global Equities Research -- Analyst\n\nHello. This is still a very good quarter, considering the backdrop. Two questions I have. Whenever we are in a recession, the federal government usually opens up their budgets.\n\nThe budgets increase to offset the collapse of the economy. Have you seen any federal government agency or across the globe who may have at least not reduced their budgets and may be thinking of increasing their budget yet? Or you haven't seen anything like that so far?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nWell, it's a mixed bag, Trip. So, as far as cyber investment, I have not seen government back away from it, particularly the government that we deal with, which is probably about G-7, G-25, depending on the level that we're at, Five Eyes country, for example. So, no, we have not seen the budget being cut or reduced in an IT spending and cyber spending. So, that's good news.\n\nThere are some very selective pockets, NATO spending a little bit more, Germany spending a lot more from -- from an IT defense point of view. And -- and Canadian government also spend more and supporting Ukraine, for example. So, U.S., the money are there, a little bit more driven toward the more social program. So -- so, it's kind of a -- I can't give you a yes or no answer.\n\nIt kind of depends on the various government that we're keeping very close tabs with. And -- and -- but on the overall scale, I haven't seen the government reduce their IT budget yet.\n\nTrip Chowdhry -- Global Equities Research -- Analyst\n\nVery good. Second question, as we are seeing a lot of new vehicles coming into the market and each one of them have at least two or three features, one, either the screens are really very big in the vehicles or they have multiple screens, do you think that changes the royalty stream for you? Like, if a vehicle, say, just three or four years back, only had one tiny screen, now, on an average, they are three or four screens front entertainment, rear-seat entertainment, overhead entertainment, you name it, videoconferencing, just that. Do you think there is a potential to increase some royalties because of the multi-screen approach that is new -- at least EV manufacturers are bringing to the market? And that's all for me. Happy holidays to all of you.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nThank. Thank you, Trip. Happy holidays to you, too. I don't believe -- I mean, I don't know multi-screen will bring me more copies.\n\nHowever, there is a trend in software-designed vehicle either for redundancy purposes or multi -- MPU purposes, particularly as the capacity requirement goes up, they are using more copies of QNX, so -- so --\n\nTrip Chowdhry -- Global Equities Research -- Analyst\n\nVery good.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nSo, it is more of an architectural point rather than a display point.\n\nTrip Chowdhry -- Global Equities Research -- Analyst\n\nI got it. I got it. I got it. Very nice.\n\nAnd then, from the same token, I think if we go from 5G to 6G of the royalty stream because of more use cases and more QNX copies and redundancy and resiliency, we may directionally see per vehicle royalties to directionally go up rather than go down.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nOh, yeah. I don't see -- I mean, there are two points to it. Number one, we have not seen the royalty of QNX going to go down any time soon. In fact, more copy is expected for a car, and it should -- the revenue should have gone -- should go up.\n\nIn addition to that, don't forget we have IVY behind it, which are -- when a capacity goes -- goes up, you know, our usage of IVY goes up. So, wait till that get into production. And I'm hopeful that that will bring us also a good revenue stream.\n\nTrip Chowdhry -- Global Equities Research -- Analyst\n\nExcellent. Excellent. Thank you very much. We look forward to seeing you all at the CES conference.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question will come from Paul Treiber with RBC Capital Markets. Please go ahead.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nHi, Paul.\n\nPaul Treiber -- RBC Capital Markets -- Analyst\n\nHi, how's it going? I was just hoping you can speak to on the cyber business, the mechanics around NDR, you know, which declined sequentially versus your comment on improved churn. You know, can you speak to some of the moving parts there? And then, specifically, can you -- can you break out churn -- or the trends there in terms of UEM versus EPP?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nGood -- good -- good questions. So, in general, as -- as we have indicated in the beginning of the year, the churn is coming from the UEM base, small, medium -- small, medium enterprise. We have seen that as a consistent scheme -- consistent theme, but that has slowed down now quite a bit. At least the last quarter we have seen a slowing.\n\nIn fact, we are seeing that big a deal going a little bit more multi-year with us. I think UEM is now definitely stabilized. It is also being viewed more strategic by the market. And Gartner actually recently wrote a note on it.\n\nAnd we we are seeing the same thing. Customers are starting to see -- to treat UEM, rather than a price item, is now starting to look at it a little bit more strategically, particularly on the cybersecurity side, as a factor of their cybersecurity. The last quarter, something have happened that causes the infrastructure and mobile infrastructures management, endpoint management, to be relooked at in importance. You probably know this, obviously.\n\nA number of banks in the United States has been fined for using, you know, a messaging technology that are not the most secure or archivable. I think -- I think that forces all the banks' CIO starting to look at the completeness of their infrastructure. So, obviously, the UEM is a technology that been around for a long time. This is not just BlackBerry UEM, you know, other established player UEM also, obviously.\n\nSo, I'm answering your question a kind of a long roundabout way. The churn slowdown, still kind of contained within the SMB and the UEM space. And -- and we -- as I said, we see a slowdown. We haven't seen it anywhere else.\n\nWe definitely have not seen it on EPP. EPP seems to be holding its own.\n\nPaul Treiber -- RBC Capital Markets -- Analyst\n\nIt's helpful to understand that. Just on -- on your -- your point about the -- the settlement with the banks, I mean, does it seem like -- like when you look at banking or regulated industries, it seems like there's a shift away from bring-your-own-device to corporate-owned devices. Do you see that in -- in other industries other than just -- just banking? And then, you know, how do you see that in, relatively speaking, helping BlackBerry from a -- from a product positioning or from a competitive position?\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nSo -- so, when -- when the banks goes to corporate issued, they are typically looking at a high level of security and archivability, and that's where our strength comes in. So, we're known to be the most secure mobile platform that is -- that exists. So -- and I think there's not a lot of debate over that in the industry. So -- so, that helps us a lot.\n\nAnd as far as I'm seeing in the industry, maybe different government branches and law enforcement, I have not seen other major verticals said go to corporate -- corporate-issued device or -- or at least swing back from a BYOD to corporate-issued devices.\n\nPaul Treiber -- RBC Capital Markets -- Analyst\n\nOK. Thank you for taking the questions and happy holidays.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nSure.\n\nOperator\n\nI would like to turn the call back over to John Chen, executive chair and CEO of BlackBerry, for closing remarks.\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nOK. Well, thank you. Thank you, operator. As we pointed out, BlackBerry will be at CES in Las Vegas, where we'll have a number of exciting announcement and demonstration by our IoT business, including the IVY running on a Jeep Cherokee.\n\nOn the 5th of January, BlackBerry would be co-hosting a software-defined vehicle award with MotorTrend, a leading auto industry analyst. In fact, if you guys want to get in there, I don't know whether we could -- we have tickets, but please contact Tim. There's a big event on the 5th evening in Vegas. The award recognizes those who have made outstanding contributions to the automotive industry through software.\n\nI know there has been a 19 -- 19 award. So, the following day, by the way, which is the 6th, at 1 p.m. Pacific Time, we will be hosting a hybrid investor Q&A session with management at the booth. This event will be streamed, and investors will be able to hear details about the exciting new developments.\n\nPlease make sure you register for the stream on blackberry.com/investor webpage. Thank you all again for joining us today -- today's call, especially those of you on the East Coast where I know it's getting late. I hope all of you and family have a happy and safe holidays and see you next year.\n\nOperator\n\nThis concludes today's call. Thank you for your participation. You may now disconnect.\n\nDuration: 0 minutes\n\nTim Foote -- Vice President, Investor Relations\n\nJohn Chen -- Executive Chairman and Chief Executive Officer\n\nSteve Rai -- Chief Financial Officer\n\nLuke Junk -- Robert W. Baird and Company -- Analyst\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nTodd Coupland -- CIBC World Markets -- Analyst\n\nTrip Chowdhry -- Global Equities Research -- Analyst\n\nPaul Treiber -- RBC Capital Markets -- Analyst\n\nMore BB analysis\n\nAll earnings call transcripts"
}