{
  "companyName": "Dolby Laboratories",
  "companyTicker": "DLB",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/dolby-laboratories-dlb-q3-2022-earnings-call-trans/",
  "content": "Dolby Laboratories (DLB 0.13%)\nQ3 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. Welcome to the Dolby Laboratories conference call discussing fiscal third quarter results. [Operator instructions] As a reminder, this call is being recorded, Tuesday, August 9, 2022. I would now like to turn the call over to Ashley Schwenoha, senior manager, investor relations for Dolby Laboratories.\n\nPlease go ahead, Ashley.\n\nAshley Schwenoha -- Senior Manager, Investor Relations\n\nGood afternoon. Welcome to Dolby Laboratories third quarter 2022 earnings conference call. Joining me today are Kevin Yeaman, Dolby Laboratories CEO; Robert Park, CFO; and Maggie O'Donnell, head of investor relations. As a reminder, today's discussion will include forward-looking statements, including our fiscal 2022 outlook and our assumptions underlying that outlook.\n\nThese statements are subject to risks and uncertainties that may cause actual results to differ materially from the statements made today, including, among other things, the impact of current macroeconomic events, COVID-19, ongoing supply chain issues, inflation, changes in consumer spending and geopolitical instability on our business. A discussion of these and additional risks and uncertainties can be found in the earnings press release that we issued today under the section captioned Forward-Looking Statements as well as in the Risk Factors section of our most recent quarterly report on Form 10-Q. Dolby assumes no obligation and does not intend to update any forward-looking statements made during this call as a result of new information or future events. During today's call, we will discuss non-GAAP financial measures.\n\nA reconciliation between GAAP and non-GAAP financial measures is available in our earnings press release and in the new Interactive Analyst Center on the Investor Relations section of our website. So with that introduction behind us, I will now turn the call over to Maggie.\n\nMaggie O'Donnell -- Head of Investor Relations\n\nThank you, Ashley, and thanks, everybody, for joining us today. For this call, we're going to try something a little bit different, and I'm going to be leading a conversation with Kevin, and then Robert is going to take us through the numbers after that. We welcome feedback on this new format, so please reach out to us at investorrelations@dolby.com, if you want to have a discussion. With that, let's get started.\n\nSo, Kevin, let's start at a really high level. What's top of mind for you coming out of this quarter?\n\nKevin Yeaman -- Chief Executive Officer\n\nSure. Well, what's always top in mind is focusing on our long-term strategy. And our top strategic priorities haven't changed. We're continuing to grow revenue from Dolby Atmos, Dolby Vision and our imaging patents.\n\nOur focus is on continuing to bring Dolby experiences to more types of content and bringing Dolby experiences to more consumers around the world, and we're really excited about our wins this quarter. Our foundational audio technologies are deeply embedded in the ecosystem for entertainment audio delivery across a broad set of consumer devices. And while foundational is more sensitive to the near-term headwinds, it's a great position to be in. And -- so we're focused on strengthening that even further.\n\nAnd we're focusing on establishing Dolby.io as the platform for developers that are looking to build the most immersive online experiences. Now it's hard to talk about what's top of mind without also talking about the uncertainty in the macroeconomic environment, and these are all factors that we talked about last quarter, inflation, COVID restrictions, supply chain issues, ultimately, just uncertainty around the consumer spending environment as that relates to us, how many consumer devices are going to ship in the second half. So it continues to be a really dynamic environment. And at the end of each quarter, we look at all the data points available to us.\n\nWe update our outlook to reflect what we're seeing at this point in time, and we've lowered our outlook to -- for the remainder of the year to reflect those current estimates, but we're focused on the things we can control. Those are our strategic priorities because that's what it determines our success in the long term.\n\nMaggie O'Donnell -- Head of Investor Relations\n\nGot it. Yes. So before we dig into the long term a little bit further, can you just elaborate a little bit more on the outlook?\n\nKevin Yeaman -- Chief Executive Officer\n\nYes. So Robert is going to talk about this in quite a lot of detail in just a moment, but a high level, the revisions to our outlook are primarily in our mobile, broadcast and PC end markets. And there's two things that are driving that. First is the revised estimates for how many consumer devices are going to ship in the second half of the year, and that affected a number of our end markets.\n\nAnd then also as it relates specifically to mobile, we are seeing some longer transaction cycles on some of our deals, particularly in Asia. So coming back to the high-level foundational, which is more sensitive to the macroeconomic headwinds, that's now expected to be down just over 10% for the fiscal year. Dolby Atmos, Dolby Vision, imaging patents, while not immune to the macro environment, are much less sensitive, and we're expecting strong growth through the year, roughly 35%, and we're happy with the progress we're making there. So while the environment is uncertain, we're just going to continue to stay focused on our strategic priorities.\n\nWe have a strong business model, strong cash flow, healthy balance sheet and attractive set of growth opportunities. And I'm confident in our long-term strategy and the opportunities that are in front of us.\n\nMaggie O'Donnell -- Head of Investor Relations\n\nCool. Well, what is it that makes you feel confident in this long-term strategy?\n\nKevin Yeaman -- Chief Executive Officer\n\nWell, when I take a step back, I'm excited as I've ever been about the future of Dolby. Our focus has always been on inventing new ways to create and to deliver spectacular content experiences. And in the process of doing that, we've earned the trust of some of the world's most discerning creative professionals, leading media content companies and top device manufacturers around the world. And so when all of this comes together, when those ecosystems come together, artists are inspired to create their stories in Dolby.\n\nWe partner with the content companies and device manufacturers to raise that quality bar, and the result is a more compelling and engaging experience for consumers. And increasingly, we're seeing that those consumers are more frequently experiencing and importantly, recognizing the difference that Dolby brings. And when I look back over the years, we've often had to spend quite a lot of time and effort showing people, convincing people that good enough isn't good enough. And what I find different about today is that we're seeing everybody -- so many people across the industry that are looking proactively to push the boundaries on what it means to have an immersive experience.\n\nWe're seeing this in consumer devices, music, online experiences, games, sports and the list goes on and on. And so that just makes it a great time to be in the business of providing the highest quality audio and video capabilities.\n\nMaggie O'Donnell -- Head of Investor Relations\n\nYes. We're in a really unique and great position now. I want to ask, how does that exactly turn into growth over the medium or long term?\n\nKevin Yeaman -- Chief Executive Officer\n\nYes. Our goal is to achieve sustainable double-digit growth. And as it relates to Dolby Atmos, Dolby Vision and our imaging patents, we're very confident in the growth outlook. This is incremental to our foundational revenue, and we believe that over the medium term, it has the potential to be at least as large as our foundational revenue is today.\n\nAnd so given that it's already a significant portion of our revenue, and we continue to see strong growth even in this uncertain environment, this is a major contributor to our overall company growth rate for -- over this midterm. With our foundational audio technologies, we're deeply embedded in the ecosystem for entertainment audio delivery across a broad set of consumer devices. And these are technologies that are fundamental to the playback of content. They are now, and they will be for many years to come.\n\nIt's a great position to be in, and we're continuing to strengthen it. So we believe that once we get past the uncertainty in the current environment and things kind of stabilize, then that's when we can return to what we were experiencing before all of this weighed on us, which is to say that, that should be kind of flat to slightly up. On top of all that, we continue to be really excited about Dolby.io and which creates the opportunity to deliver new Dolby experiences to even larger audiences. So while it's a small part of the overall pie today, we see this becoming a significant growth opportunity over the long term.\n\nSo when I step back from all that, there's, of course, more than one way to get to sustainable double-digit growth, but we believe we have the portfolio of growth opportunities that we need to recycle.\n\nMaggie O'Donnell -- Head of Investor Relations\n\nYes. You mentioned that one of these things that we can control is the adoption of Dolby Atmos and Dolby Vision. Can you talk about those two initiatives specifically?\n\nKevin Yeaman -- Chief Executive Officer\n\nSure. So the Dolby Atmos and Dolby Vision ecosystem initially came to life in the form of movie and television content. We start by working with storytellers to expand their audiovisual palette. And we work across content distribution, device manufacturers to bring these ecosystems to life, and we've really become embedded throughout the movie and television ecosystem.\n\nAnd that's what has led to our strong presence in the living room, specifically things like television, set-top boxes, sound bars, all the ways we enjoy movie and TV content and a really good initial presence across high- end devices in mobile, PC and other categories. That ecosystem continues to grow, and we see it as a growth driver in the future as we continue to get further end of the lineups of televisions, sound bars and all of those devices. Over the last couple of years what we've also been really focused on is extending Dolby Atmos and Dolby Vision into other forms of content, new forms of storytelling. We've always believed that Dolby Atmos and Dolby Vision can dramatically enhance content experiences across a wide range of genres and use cases.\n\nAnd so that's why we've been focused on extending our presence into areas like music, mobile media content, gaming, live sports because it's becoming a part of the experiences that creators and consumers care about the most and that they engage with most frequently, that's what increases demand for Dolby experiences. And so that's what drives the opportunity for increased adoption whether it's a living room, on mobile devices, cars, PCs and more. And we saw some good progress this quarter, particularly in Dolby Atmos Music and the ability to -- for consumers to capture Dolby Vision.\n\nMaggie O'Donnell -- Head of Investor Relations\n\nYes. So let's double click on Dolby Vision capture for a second. What is the significance of this recent Xiaomi announcement? And why should investors care about it?\n\nKevin Yeaman -- Chief Executive Officer\n\nWell, this is our first Android win for Dolby Vision capture. Of course, Dolby Vision capture has been a part of the Apple ecosystem for nearly two years now. We're really excited that Xiaomi now enables Dolby Vision capture on its flagship smartphone in China. With Dolby Vision, every piece of content that people capture with their phone can be more lifelike and more realistic.\n\nAnd this works, it provides value in a lot of different contexts. So one of my favorite examples is in South Korea Naver, which is a large online e-commerce platform. They're using it in the context of live shopping. So consumers can see the merchandise in more detail.\n\nThey can see that the colors are right before they make the purchase so that the color of clothes they see on their phone is the color that they're going to see when they open that box. So we're beginning to see this new ecosystem that is coming to life around Dolby Vision use -- we'll call it, broadly user- generated content. And at the same time that Xiaomi launched, in fact, multiple Chinese messaging services began supporting the upload, transfer and the playback of Dolby Vision content. Social media platforms like WeChat, Bilibili, QQ.\n\nSo it always means that anyone with the Xiaomi 12S can now create in Dolby. They can capture, they can edit, they can share, whether it's a professional influencer, whether its people capturing their own home videos. And this, of course, also creates more demand for playback in Dolby Vision across wide range of devices.\n\nMaggie O'Donnell -- Head of Investor Relations\n\nIt sounds like another thing that you're really excited about is music. Can you elaborate on these new announcements around Tencent and Melon, and what this means for Dolby?\n\nKevin Yeaman -- Chief Executive Officer\n\nWell, starting in July, Dolby Atmos Music became available on QQ Music. And that's Tencent's music streaming service in China. That's one of the top five -- one of the five largest music streaming services in the world. And it's also our first domestic Chinese music service to take -- to support Dolby Atmos.\n\nI'd also highlight Melon, that is the largest Korean music streaming service, is also now supporting Dolby Atmos. Of course, it's great to see more streaming services come to life, and it's also created some opportunities to introduce new genres to Dolby Atmos Music. So Melon has started curating playlists from top K-pop artists like BTS and Blackpink. And that's really exciting to see because building this ecosystem starts with that passion from the artists who really want to create in Dolby.\n\nAnd we continue to see increased engagement from artists, from studios, which is resulting in more music. So we have two-thirds of the top 100 Billboard artists that have one or more songs available in Dolby Atmos. Also notable this quarter, we have Dolby Live now at MGM in Las Vegas, which is a live venue where artists can perform live in Dolby Atmos. And so Usher became the first to put on a live Dolby Atmos show at Dolby Live, kicking off a residency, which is going to have, I think, a 24-show run.\n\nSo what this does is it brings in audiences to -- who are -- many of whom will have their first experience with Dolby Atmos. It's a great experience. And then, of course, we hope that they'll then go seek to enjoy their music that way all of the time. It also gives us an opportunity to engage directly with artists who are coming through that venue for their residency, which just also kind of fuels the pipeline for more content, more artists, means more music, means more streaming service, means more people can experience it.\n\nSo that's another ecosystem that we see coming together really nicely, and that's what fuels the opportunity to increase Dolby Atmos adoption across all the ways that consumers enjoy their music, which could be a car or a mobile device or in living room.\n\nMaggie O'Donnell -- Head of Investor Relations\n\nPersonally, I love enjoying some music in my car. It's absolutely my favorite place to enjoy a new album, but it makes sense that auto is going to be a big focus for us. So can you talk about that opportunity?\n\nKevin Yeaman -- Chief Executive Officer\n\nYes. From the very early days of our demonstrating Dolby Atmos Music, it was very clear, whether it was musicians, studios, everybody cares about the car experience as it relates to music. It's just part of the experience. And the music ecosystem is what's fueling that opportunity for us in automotive.\n\nWe mentioned before that Mercedes and Lucid have both embraced the Dolby Atmos experience in high-end vehicles. More recently, Li Auto, which is an electric vehicle start-up in China, has announced that they're going to support Dolby Atmos. NIO, which is another Chinese EV company, has announced a new model in Dolby Atmos after already having launched one. So we're really excited about the reactions that we're getting from across the industry, and it makes for one of our best demo experiences.\n\nOur Dolby Atmos demo cars just blow people away every time. And whether it's an artist, a music executive, a car company executive or a trade show attendee. It's been very handy during the pandemic because you can take that car to wherever you need to take it. And so even as we see traction at the high end, we're confident that this is an experience that people want to have and that just as we were able to do with TVs for Dolby Vision and sound bars for Dolby Atmos.\n\nWe have an opportunity to transform the experience from the high end to mainstream with Dolby Atmos. So today, we are 100% focused on making Dolby Atmos successful in the car. But in the long term, we think there's a lot more opportunity because the future of cars is evolving toward even more immersive experiences, and that's going to create -- we think that creates opportunities for us across audio and video offerings.\n\nMaggie O'Donnell -- Head of Investor Relations\n\nSo lastly, on Dolby.io, what are your goals there over time? And how should investors expect this to evolve?\n\nKevin Yeaman -- Chief Executive Officer\n\nWell, as we talked about earlier, I don't think there's ever been a better time to be in the business appraising the bar on immersive experiences, and this is especially true in the online world. So Dolby.io is a platform for the developers whose job is to build these online experiences and to make them immersive and engaging and bring people to the experience, make them highly interactive, enable social engagement. Live events and webinars is an area where we're seeing strong engagement that's using our ability to deliver live interactive audio/video chat, the ability to live stream those experiences to larger audiences in high-quality with ultra-low latency. These few events like they could be online corporate events, they could be virtual concerts, they could be premium education courses and those goes on.\n\nBut it all starts with having a compelling and differentiated offering that addresses a problem that developers have. And we've learned a lot over -- since we've launched the platform. And we believe that given our technology, our relationships, our know-how that there are some things we can do better than anyone else, especially around media quality. So things like media capture, things like spatial audio, which makes for a much more lifelike experience.\n\nAnd we enable developers to then stream these experiences to large audiences at very high quality. So -- and all of these quality enhancements can be delivered natively in the browser, which is the primary platform that developers are targeting. So that's also really important. So we're confident that we have an offering that provides value and that is addressing a problem or one that developers currently have.\n\nAnd we have a strong road map for differentiation, of course, going forward because we're always thinking about what's next on raising the bar. So then our attention turns to the go-to-market model and how do we scale this? And developer model scale by starting with that differentiated value proposition, then it's about raising awareness with developers, then it's about making it easy for them so that they can engage with the APIs, the technologies, start to build things and try things and then ultimately, of course, going live and becoming paying customers because we're paid on a transactional volume. So we've seen a very significant rise in the number of developers signing up for our platform. Beginning around the first quarter of this fiscal year, we've seen -- we've really been pleased with the amount of people that are now coming to the platform, and we -- that's been followed by a similar rise in the number of developers who are engaging with the technology.\n\nWe can see that they're building things, they're trying it out, they're learning how to use it. So we're seeing this increased engagement. That's what this is. We're getting that engagement that we're looking to have.\n\nWe're seeing that translate into growth and paid accounts and increased revenue. And I'm optimistic that these are the early signs that we're on the right path toward increased revenue growth.\n\nMaggie O'Donnell -- Head of Investor Relations\n\nGreat. So before I turn it over to Robert to walk us through the financials, do you want to share any final thoughts?\n\nKevin Yeaman -- Chief Executive Officer\n\nWell, I'll keep my final thoughts for now brief. I'm sure everyone wants to hear the numbers. The environment is uncertain. I think that's a consistent theme across all companies, but we are focused on the things that we control and that means continuing to grow the Dolby experience to more types of content to more people around the world and staying focused on those top priorities because that's what drives our long-term success.\n\nMaggie O'Donnell -- Head of Investor Relations\n\nGot it. Thank you, Kevin. I'm going to turn it over to the numbers guy. Robert, go ahead.\n\nRobert Park -- Chief Financial Officer\n\nGreat. Thanks, Maggie, of course. Let's start with Q3. Total revenue in our fiscal Q3 was $290 million, which was within the guidance range.\n\nQ3 total revenue was up 1% year over year, driven by increased adoption to Dolby Atmos and Dolby Vision, new licensees and imaging patents and improved results for Dolby Cinema and our Cinema products business. This was offset by lower broadcast and PC unit shipments and lower recoveries, which are collections of royalties from prior periods, primarily in broadcast. We also saw a true-up in Q3 this year, a positive $3 million versus last year of positive $14 million. Licensing revenue was $269 million, down 1% year over year, driven by lower broadcast and PC unit shipments, lower recoveries and a lower true-up, offset by increased adoption of Dolby Atmos and Dolby Vision and new licensees and imaging patents.\n\nLet's get into the year-over-year trends in licensing revenue by end market. All the detailed revenue by end market and the percentage of total licensing can be found in the new Interactive Analyst Center available on the Dolby IR website. Broadcast revenue was down 20% year over year, driven by lower recoveries and lower estimated shipments for TVs and set-top boxes, partially offset by growth of Dolby Atmos, Dolby Vision and imaging patents. Mobile revenue was up 27% year over year, driven in part by timing of revenue associated with minimum volume contracts as well as higher adoption and new licenses for Dolby Atmos, Dolby Vision and imaging patents.\n\nPC revenue was up 8% year over year, driven by higher recoveries and growth at Dolby Atmos, Dolby Vision and imaging patents, partially offset by lower PC unit shipments. We are expecting lower PC unit shipments for the rest of fiscal year '22. Consumer Electronics revenue was up 2% year over year, driven by an increase in adoption of Dolby Atmos, Dolby Vision and imaging patents. Other Markets revenue was up 17% year over year, driven by higher box office sales and growth of Dolby Cinema.\n\nFinally, products and services revenue was $20 million, up 33% year over year, driven by ongoing improvements in the cinema industry globally. Let's move on to the rest of Q3 financials. Non-GAAP -- total non-GAAP gross margin was 88% of revenue, down slightly from 89.7% in the third quarter of last year due to the shift in revenue mix. Non-GAAP operating expenses were $179 million, up 3% year over year, driven by increase in T&E and marketing spend.\n\nOperating expenses were lower than our expectations for the quarter due to lower internal labor expenses and timing of program marketing spend, some of which is pushing into Q4. Non-GAAP operating income was $76 million or 26% of revenue compared to 29% of revenue in Q3 of last year. The non-GAAP income tax rate was 13.9% compared to 13.7% in Q3 of last year. The Q3 tax rate was lower than expectations due to discrete items.\n\nNet income on a non-GAAP basis was $69 million or $0.68 per diluted share compared to $75 million or $0.71 per diluted share in Q3 of last year. Non-GAAP EPS was at the high end of our guidance range, primarily driven by lower-than-expected operating expenses and a more favorable tax rate. During the third quarter, we generated $173 million in cash from operations compared to $172 million generated in last year's fiscal Q3. We ended the third quarter with about $1.1 billion in cash and investments.\n\nDuring the quarter, we bought back about 2.5 million shares of our common stock. We ended the quarter with about $230 million of stock repurchase authorization available. We continue to execute our buybacks through a 10b5-1 trading plan. We recently received Board approval to increase the existing share repurchase authorization by $350 million, bringing our total authorization to about $580 million.\n\nWe also announced today a cash dividend of $0.25 per share. The dividend will be payable on August 31, 2022, to shareholders of record on August 23, 2022. Now let's get into the fiscal '22 outlook. First, we continue to see uncertainty in the marketplace.\n\nThe combination of the macroeconomic climate, inflation, impact of COVID measures, supply chain and unpredictability in consumer spending creates uncertainty for our customers, including estimating what they will ship to their customers. These factors impact our business, and this limited visibility makes it much more difficult to provide guidance, but we are providing an updated estimate based on the best information we have available. With all of that as a backdrop, we are adjusting our full year revenue estimate driven primarily by changes in our mobile, PC and broadcast end markets. We now estimate total revenues to be plus or minus flat to last year's revenue, ranging from $1.27 billion to $1.3 billion.\n\nWithin that, licensing revenues could range from $1.190 billion to $1.215 billion. Broadcast revenue is now expected to decline in the mid- to high single digits. Last quarter, we talked about softness in TVs, and we are still seeing incremental softness in TVs as well as lower unit shipments in set-top boxes. Mobile revenue is now expected to be down low single digits compared to the positive mid-single-digit growth we discussed last quarter.\n\nWe are seeing that for some of the deals we've been working on, transaction cycles are taking a little longer in this environment, particularly in Asia. PC revenue is expected to grow mid-single digits, down from our previous guide of high single digits. We are seeing softness in the PC market and downward adjustments to unit shipments are impacting our second half. Consumer Electronics revenue is still expected to be up low single digits, driven by growth in Dolby Atmos, Dolby Vision and imaging patents.\n\nOther licensing revenue is still expected to grow around 15%, driven by Dolby Cinema. Within this, we are now expecting our foundational audio revenues to decline just over 10% year over year, and Dolby Atmos, Dolby Vision and imaging patents revenue to grow roughly 35%. Products and services revenues could range from $80 million to $85 million, which is within the range previously provided, as we still expect improvements in Cinema products and growth of Dolby.io. Non-GAAP gross margin is estimated to range from 89% to 90%.\n\nNon-GAAP operating expenses are estimated to range from $740 million to $750 million for fiscal year '22, which is lower than the previous guidance due to lower internal labor expenses. Non-GAAP operating margins are now estimated to be 30% to 32%. Our effective tax rate for the year is projected to range from 17% to 18% on a non-GAAP basis. Fully diluted earnings per share on a non-GAAP basis is estimated to range from $3.22 to $3.37.\n\nMaggie O'Donnell -- Head of Investor Relations\n\nGreat. Thanks for the color, Robert. Operator, let's open up the line for analyst questions. But before we do that, Robert, can you just summarize your outlook for Dolby?\n\nRobert Park -- Chief Financial Officer\n\nSure, Maggie, of course. As we're now getting continued uncertainty in this near term, that's for sure. At the same time, we remain excited about the long-term growth opportunities ahead. The fundamentals of Dolby's business remain intact.\n\nDolby is an enduring company that always has been the leader in the advancement of sight and sound. We've gone through several technology shifts and come out stronger each time, making consumer experiences better for device makers, content creators, content distributors and now developers. We have a durable business model with high gross margins, positive cash flows and a strong balance sheet. We are moving into a very exciting phase with robust opportunities for growth ahead of us.\n\nMaggie O'Donnell -- Head of Investor Relations\n\nGreat. Operator, I'm turning it over to you.\n\nOperator\n\n[Operator instructions] Our first question comes from Steven Frankel from Rosenblatt.\n\nSteven Frankel -- Rosenblatt Securities -- Analyst\n\nI just want to dig in on the mobile situation for a minute, Kevin. Earlier in the year, you talked about some confidence in the back half because you had some deals that had minimum upfront guarantee. Are you referring to some of those now stretching out? Or did you get those deals in this quarter and it's things in the pipeline that you thought you would close in Q4 that are stretching out?\n\nKevin Yeaman -- Chief Executive Officer\n\nYes. So, Steve, as a reminder, the types of -- as you know most of our revenue comes from device-based royalty revenues. We essentially have about three types of deals, which could get the revenue on time. One is just pointing out as we have.\n\nThis is what it is. Another is when we [Inaudible], and then also when we sign up the licensee. So at any given time, we have -- and you remember exactly right, we anticipate we are increasing because we brought down the percentage of the deals in the pipeline that we think are going to close. Particularly in Asia, this is -- can't be attributed to any one factor.\n\nBut if you take China as an example, we haven't been able to send anyone from headquarters for three years now. And just what the macro environment, that probably is -- can be a distraction to any of our customers. So the net is, we still see a lot of activity in the pipeline, but we're anticipating a lower close rate in Q4. Now over the long term, we see a lot of potential growth drivers in Mobile, including Dolby Vision capture, which I talked about earlier.\n\nDolby Atmos Music is also a driver for Mobile to name a few.\n\nSteven Frankel -- Rosenblatt Securities -- Analyst\n\nOK. And what about the pipeline in mobile in kind of the next tier down in automobile? What does that pipeline look like? What is your confidence level on being able to get there?\n\nKevin Yeaman -- Chief Executive Officer\n\nYes. Well, we're happy to have brought on NIO partner this quarter and to have NIO extending us to another model. Like I said earlier, it's -- the music proposition with Dolby Atmos is very strong across all of our constituents. So we feel very good about our pipeline of engagements, and we're confident that we'll be able to continue to bring the Dolby experience to more and more cars.\n\nAnd like I said, ultimately, our goal is to have this be a mainstream experience for the car.\n\nSteven Frankel -- Rosenblatt Securities -- Analyst\n\nOK. And then one last quick one. Given the lower outlook in the current environment and that's something that may stick around for a while, have you either pulled back potential investments in areas? Or are you rethinking how you might be spending money as you get into the new fiscal year?\n\nKevin Yeaman -- Chief Executive Officer\n\nI would say, Steve, at the highest level, this thing is really sharpening our thinking on where the highest impact opportunities are to drive that long-term growth and getting even more focused on those things. And this is -- we're approaching the end of our fiscal year. So in any year, this would be about the time where we start to take stock of every season we've learned over the last year. Of course, we strive to do that on a daily basis, but this is a time where we tend to reflect on that, really get even more focused around what's working, what's not working, how do we want to realign our resources around that.\n\nAnd then, of course, in addition to that, you have the backdrop of this very uncertain environment. And so all of that goes into our thinking on how do we make sure that we are focused on the most impactful opportunities that aligned around that. And in the meantime, while we go through that process, we have paused our hiring activities except for some of the most critical roles.\n\nOperator\n\nOur next question comes from Ralph Schackart from William Blair.\n\nRalph Schackart -- William Blair -- Analyst\n\nFirst one, just maybe on the macro. Kevin, as you sort of sit here today versus last quarter, a lot -- obviously, a lot has changed. Maybe if you could kind of walk through from your perspective what's changed most from Dolby from what we're seeing today? And perhaps if you could also maybe reflect on some of the conversations that you're also having with your licensing partners. And then I have a follow-up.\n\nKevin Yeaman -- Chief Executive Officer\n\nYes. It's a great question, Ralph, and the last part of your question takes me to a very different place in the first part of your question. The last part of your question takes me to what I said earlier, which is that I can't remember a time where so many of our partners across so many of our categories are really looking to push the boundaries on what it means to have an immersive experience. So on one hand, when we're demoing and engaging about the potential for the future, whether it's with cars or Dolby Vision capture or live sport, that continues to be full steam ahead on focused on our long- term priorities.\n\nNow obviously, that's in the backdrop of this economic environment, and I think the factors, I don't think I have to list them for you again, but it's -- the net effect of it all is, it is making it difficult to read visibility into the near term. And I think, I guess, if I'm going to characterize what's changed, last quarter, we saw that TV shipments and gaming console shipments were looking to be lower than we thought coming into the year. We've seen a little more of that with TVs, but now this quarter, we also see it for PCs. So we're just -- we're keeping up to date on all the developments as they come in.\n\nBut -- so it really is just these two worlds. On the one hand, it's keeping tabs on kind of what's going on in the macroeconomic environment as it relates to where the near-term activity is going to be on device shipments and so forth. But on the other hand, across our strategic priorities, we feel really good about the engagement we have for more Dolby experiences.\n\nRalph Schackart -- William Blair -- Analyst\n\nGreat. And maybe just one on expenses, Robert. G&A came in quite a bit lower than at least we were forecasting and down sequentially. I know expenses can bounce around quite a bit, but maybe just what were the factors as it relates to G&A? And perhaps how should we think about that spend going forward? I know you talked about pausing hiring, but any color there would be helpful.\n\nRobert Park -- Chief Financial Officer\n\nYes. On G&A, most of the impact is going to be lower personnel cost. The slower hiring -- even before the pausing of hiring, we were behind on the higher end to start with. So lower personnel cost is really driving the majority of that, Ralph.\n\nGood to hear from you.\n\nOperator\n\nOur next question comes from Paul Chung from J.P. Morgan.\n\nPaul Chung -- J.P. Morgan -- Analyst\n\nOn io, can you expand on the integration with Millicast and how that's going? You have a lot of new partners here, more logos on the website. Are you expanding io with those new partners as well? And then how do we size the kind of Millicast opportunity? And also, I saw UnitedMasters looks like a new logo, what's going on there?\n\nKevin Yeaman -- Chief Executive Officer\n\nYes. So -- well, I guess I'll start where you ended. UnitedMasters is using our music mastering to improve the mix, mixing like quality against music recording. So that's a great app for the quarter.\n\nSo Millicast is what brought us the ability to live stream these experiences to large audiences at ultra-low delay, so sub-second delay. And what we're finding already -- the first thing we're finding, which is the thing you want to see from an integration point of view is that we have a lot of customers that are doing both the interactive audio/video chat experiences and then wanting to live stream those to very large audiences. These could be things like we have one developer that is doing EDM music production in a virtual cloud-like environment. And so you could be doing -- you could be in that experience with your headset, or you could be watching it as they stream it to these -- to large audiences.\n\nAnd the examples go on and on. We're also -- the beauty of a developer platform, of course, is that developers from different corners of the world can discover your technologies and you see some really good use cases come to life. And we've seen that in some areas like auctions where it turns out ultra-low delay is very valuable. So Sotheby's has been using it.\n\nWe have some car auction company, not something that I think I foretold when I was talking to you a year ago, but that's been the high quality, low delay is valuable there. Remote production and content production that is something we've talked about. We continue to see demand there. We have customers like NBC, CBS, again, that ability to interact and collaborate with the high quality and the low delay is extremely valuable there.\n\nSo we have now -- so the product is being used together and is further integrated. The website has now gone live as a single website, and we're in the process of bringing the rest of the pieces together. But it really -- from a product market fit, that's kind of the first criteria. It's been a really -- it's already proving to be a really nice fit and that's evidenced by the increasing number of developers we have who are using the core Dolby.io real-time interactive audio/video combined with the Millicast live streaming capability.\n\nPaul Chung -- J.P. Morgan -- Analyst\n\nOK. Great. And then a follow-up on Dolby Vision capture. How do we think about the kind of incremental ASP you get with an adoption of this feature? And given the expansion into Android, how does this kind of accelerate across multiple OEMs kind of running Android? Are those discussions accelerating? And can we see some progress on Dolby Vision, I guess, across the Samsung platform? Are they taking notice here just on the whole Vision opportunity as well?\n\nKevin Yeaman -- Chief Executive Officer\n\nYes, of course. Well, the reason we're excited about the win with Xiaomi and Dolby Vision capture is, we do think it's a very compelling experience on mobile devices, and it's a -- it addresses a use case that is primary to the mobile device, whether it's applying that to social media, to live shopping like Naver is or just to your own video. So we think it's a very compelling experience and drives the adoption of both Dolby Vision capture and playback where they don't yet have it. So we see it as a big opportunity, and we think it's always an important step to get the first, in this case, in the Android ecosystem.\n\nAnd then it's significant that we have these other ecosystem partners coming along with it. Like I said, WeChat, Bilibili, QQ. The fact that they're engaging with -- that strengthens the value proposition for the next OEM to come along and have more reasons to work with us. So I'm not going to go through any specific engagements.\n\nBut yes, we're encouraged by the reaction to the Xiaomi announcement. And we, again, have a good pipeline of engagement.\n\nOperator\n\nOur next question comes from Jim Goss from Barrington Research.\n\nJim Goss -- Barrington Research -- Analyst\n\nRobert, you went through the licensing revenue changes, but didn't give the licensing revenue mix. I wonder if you might give a quick run-through of those percentages just to true up our model. And in that -- I was wondering, too, in the chips bill, I was wondering about the impact and timing and any political risk to the China relationships you have.\n\nRobert Park -- Chief Financial Officer\n\nJim, so a couple of things. One, the percentage of revenue for each of the end markets is in the 10-Q as well as in the Interactive Analyst Center.\n\nJim Goss -- Barrington Research -- Analyst\n\nOK. I'll check it from there.\n\nRobert Park -- Chief Financial Officer\n\nOK. Trying to make it easy for you.\n\nKevin Yeaman -- Chief Executive Officer\n\nAnd second part of your question, Jim, I remember the geopolitical element. What was it -- can you just repeat the that?\n\nJim Goss -- Barrington Research -- Analyst\n\nAnd also how the chips bill that was just passing, I'm wondering what the impact might be and how long before there would be any impact?\n\nKevin Yeaman -- Chief Executive Officer\n\nYes. I think that in the context of what we've been talking about today is, it relates to uncertainty in the environment. That's -- those are pretty long lead times. So I don't think that will play into kind of our near-term view of the environment.\n\nAnd yes, I think I would add geopolitical uncertainty, whether that's war in Ukraine or China relations to the long list of things that create for an uncertain environment. I will say, for now, our engagements in China are really strong as evidenced by some of the things we talked about today. But it's something that we pay very close attention to and stay very closely engaged with both in the U.S. and in China.\n\nJim Goss -- Barrington Research -- Analyst\n\nOK. Then one separate thing. The Atmos Music, a lot of the theaters are talking about alternative music content in the theaters as maybe something that could be another opportunity in the auditorium. I would imagine it would tie you into Atmos.\n\nI'm just wondering if -- how you're looking at it as a possible opportunity for you? Or is there no additional opportunity because you're already embedded in those theaters?\n\nKevin Yeaman -- Chief Executive Officer\n\nWell, I think the opportunity there -- and I think you're right. I mean it's not -- of course, it's not -- there are many discussions over the years about bringing different types of content to the cinema, but I think -- but I see what you're saying, which is that I think there's more energy behind those ideas today than there's ever been before. And what that does for us is 2 things: one, spreading the -- making Dolby Atmos more available, whether it's live at Dolby Live, whether it's -- we've had concerts that have been streamed live in Dolby Atmos, whether it's in the car or in the cinema, that just contributes to the awareness and passion for the ecosystem around Dolby Atmos Music. And then, of course, it drives demand for end experiences.\n\nIn the case of cinema, it increases the values to why you would want to include Dolby Atmos in your theater or whether you would want to have a Dolby Vision experience because, by the way, the only thing better than that concert in the Cinema and Dolby Atmos would be that concert in Dolby Vision and Dolby Atmos.\n\nOperator\n\n[Operator instructions] This concludes our Q&A. I'll now hand back to the management team for any final remarks.\n\nKevin Yeaman -- Chief Executive Officer\n\nWell, I want to thank everybody for joining us today, and we look forward to speaking with you again soon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAshley Schwenoha -- Senior Manager, Investor Relations\n\nMaggie O'Donnell -- Head of Investor Relations\n\nKevin Yeaman -- Chief Executive Officer\n\nRobert Park -- Chief Financial Officer\n\nSteven Frankel -- Rosenblatt Securities -- Analyst\n\nRalph Schackart -- William Blair -- Analyst\n\nPaul Chung -- J.P. Morgan -- Analyst\n\nJim Goss -- Barrington Research -- Analyst\n\nMore DLB analysis\n\nAll earnings call transcripts"
}