{
  "companyName": "Kroger",
  "companyTicker": "KR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/09/kroger-kr-q2-2022-earnings-call-transcript/",
  "content": "Kroger (KR -0.09%)\nQ2 2022 Earnings Call\nSep 09, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to The Kroger Co. second quarter 2022 earnings conference call. My name is Alex, I'll be coordinating the call today. [Operator instructions] I would now like to turn the conference call over to Rob Quast, director, investor relations.\n\nPlease go ahead.\n\nRob Quast -- Director, Investor Relations\n\nGood morning. Thank you for joining us for Kroger's second quarter 2022 earnings call. I am joined today by Kroger's chairman and chief executive officer, Rodney McMullen; and chief financial officer, Gary Millerchip. Before we begin, I want to remind you that today's discussions will include forward-looking statements.\n\nWe want to caution you that such statements are predictions, and actual events or results can differ materially. A detailed discussion of the many factors that we believe may have a material effect on our business on an ongoing basis is contained in our SEC filings. The Kroger Company assumes no obligation to update that information. After our prepared remarks, we look forward to taking your questions.\n\nIn order to cover a broad range of topics from as many of you as we can, we ask that you please limit yourself to one question and one abbreviated follow-up question, if necessary. I will now turn the call over to Rodney.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThank you, Rob. Good morning, everyone, and thank you for joining us today. The Kroger team delivered another strong performance during the quarter, fueled by our strategy, leading with fresh and accelerating with Digital. These consistent results underscore the resiliency and flexibility of our business model, along with our associates' passion to deliver a fresh, convenient customer experience with zero compromise on quality, selection, and affordability.\n\nCustomers continue to adjust their shopping habits in response to ongoing inflation. We are doing everything we can to help our customers stretch their dollars with high-quality fresh products at everyday low prices and industry-leading fuel rewards program, and personalized savings on the items that matter most to them. Our customers are looking for ways to save, and we are there for them. During the quarter, digital coupon engagement hit an all-time high with 750 million digital offers downloaded, totaling almost $1 billion in savings.\n\nOur fuel rewards program continues to resonate with customers as more than 600,000 incremental households engaged with our fuel rewards program this quarter compared to last year. And our fuel reward redemption rates were also up significantly. We continue to see more customers cooking from scratch and eating out less often. Our broad assortment of products is meeting the need for customers to buy what they want on their terms.\n\nFor example, some customers are continuing to buy more of their favorite fresh products like apples, tomatoes, and grapes. While other customers are choosing products like frozen fruit and vegetables, allowing products to last longer in their homes. Overall, customers are looking to save money and make healthier choices by cooking more meals at home rather than eating out. Kroger's strong value proposition drove positive household growth and meaningful loyal household growth both online and in-store.\n\nDigital sales also returned to positive growth, driven by our one-of-a-kind Boost membership program and expansion of our Kroger Delivery network. It's clear our go-to-market strategy is connecting with customers, and we continue to build long-term customer loyalty through fresh, Our Brand, personalization, and our seamless ecosystem. Leading with fresh, we are dedicated to serving our customers the freshest products, so when they think food, they think Kroger. To achieve this goal, we are utilizing technology and deploying fresh innovation to deliver products faster, which stay fresher longer for our customers to enjoy.\n\nAnd it's working. In our 864 fresh certified stores, customers are purchasing more fresh products. and overall store sales are growing faster than the rest of the business. Supply chain remains an important part of our fresh strategy as well.\n\nIn order to maximize freshness, we are utilizing our data science and collaborating with our partners to minimize dwell time in our distribution network and maintain the integrity of the cold chain. We are also improving productivity in our supply chain. During the quarter, we reduced fuel cost headwinds through technology and process efficiencies, such as controlling more product movement across the value chain and maximizing our trucking capacity. While some categories remain challenging, supplier in-stocks are improving, and we are cautiously optimistic this will continue in the back half of the year.\n\nTurning to Our Brands. We saw incredible engagement in Our Brands during the quarter with identical sales growth of 10.2% compared to last year. This increase was led by our Kroger and Home Chef brands. Convenience remains a priority and Home Chef is meeting that need by providing high-quality family meals as a budget-friendly alternative to eating out at restaurants.\n\nFor other customers who are enjoying cooking from scratch, Our Brands are delivering innovative products at a great value. So, Our Brands' product strategy is rooted in quality, providing customers with memorable meal experiences they crave. And these products continue to earn world-class recognition. Most recently, Murray's Cheese varieties won five awards at the highly regarded 2022 American Cheese Society Competition.\n\nWe were also recognized by Store Brands Magazine with 12 Editors' Pick awards for best new products, the most of any retailer. This recognition focused specifically on food that met customer needs for healthier products. As we continue to look for ways to help our customers stretch their budgets, this quarter, we launched a new portfolio strategy for our opening price point brands. We consolidated 17 legacy brands into two: Heritage Farm for our fresh and dairy product lines; and our newest brand, Smart Way, for our nonperishable items.\n\nThese brands are competitively priced and meet the needs of customers on a budget. We launched with 150 SKUs and expect to roll out additional products by the end of the year. Now moving to digital. We achieved positive sales growth, as I mentioned before, led by our strong delivery results.\n\nEarly in the second quarter, we introduced our Boost membership nationwide, and it's already showing promising results including an increase in overall household spend among members. We remain focused on adding new members and are encouraged that enrollment is in line with our internal expectations and projections. During the quarter, we opened a new customer fulfillment center powered by Ocado's automated smart platform in Romulus, Michigan. Additionally, we are excited to expand the Kroger Delivery network to more customers in four new geographies during the quarter through spoke facilities in Austin, Birmingham, Oklahoma City and San Antonio.\n\nThis brings our total CFC and spoke count to 18. We also continue to invest in our pickup business, where demand remains strong. During the quarter, we increased capacity and shortened wait times to improve our customer experience. We also invested in technology and implemented process efficiencies, which helped lower our cost to serve.\n\nOur customers are telling us they love our seamless experience. We continue to see customers effortlessly shift between store, pickup, and delivery, which is building loyalty. We continue to improve the experience, and we'll always encourage our customers to shop with us how they want to and with zero compromises. Our associate dedication and passion continue to fuel Kroger's consistently strong results, and we are proud to invest in our teams and improve the associate experience.\n\nWe saw more people apply to work at Kroger this quarter as we continue to attract talented associates. Our current associates, we are making progress on retention. We've rolled out improved onboarding guidelines and implemented career planning tools. In addition, as part of our commitment to associate wellness, we recently introduced a new financial coaching service tool for hourly associates.\n\nThis unique benefit offers free financial planning assistance to our associates. We are launching the tool in three pilot divisions and look forward to expanding the service across the company by January of 2023. It is always exciting to see our associates' commitment to creating an outstanding work environment recognized. For the third consecutive year, Kroger was named a Best Place to Work for Disability Inclusion, earning a perfect score on the 2022 Disability Equity Index.\n\nAdditionally, the Brandon Hall Group, a leading human capital management firm, honored Kroger for our training programs and the ways in which our teams promote diversity, equity and inclusion. Each team member is involved in creating our culture where associates come for a job and discover a career. Our purpose: to see the human spirit inspires our team every day. One important way we bring our purpose to life is through Kroger's comprehensive ESG strategy.\n\nOur aim is to achieve lasting positive change for people and our planet. Our newly published 2022 ESG report, called Nurturing Shared Values, outlines the entire Kroger family strong progress against dozens of environmental sustainability, social impact, and governance goals and commitments. We continued working to operationalize and integrate ESG within our business. Nowhere is this more evident than through our Zero Hunger Zero Waste social impact plan.\n\nThis month marks the fifth anniversary of the launch of Zero Hunger Zero Waste. And while we still have much -- so much more work to do to achieve our moonshot goal of achieving a world free from hunger and food waste, we also have so much to celebrate. Over the past five years, our team donated 2.3 billion meals to our neighbors in need, which included $1 billion in giving to fight food insecurity, 500 million pounds of surplus food donated to our food bank partners, and nearly $45 million in grants to support food recovery and system change from our Zero Hunger Zero Waste foundation. And I'm very proud to share for the first time ever, our store teams achieved 100% execution of Zero Hunger Zero Waste food rescue, which is the strongest proof point yet of the value of operationalizing ESG.\n\nIt took all of our teams working cross-functionally to achieve this important milestone. A huge congratulations and thank you to all involved. In summary, Kroger delivered another strong second quarter. We continue to delight our customers, strengthen our business model and execute on our strategy of leading with fresh and accelerating with digital.\n\nWe remain focused on delivering for our associates, customers, and communities; and when we do that well, deliver value for our shareholders. With that, I'll turn it over to Gary to take you through our second quarter financials. Gary?\n\nGary Millerchip -- Chief Financial Officer\n\nThank you, Rodney, and good morning, everyone. The Kroger team is laser-focused on executing our go-to-market strategy, which we outlined at our investor day in March. Our balanced business model has proven to be resilient in a variety of operating and economic environments. And our second quarter performance provided another proof point of this as we delivered significant year-over-year growth.\n\nI'll now provide additional color on our second quarter results. We achieved strong identical sales growth without fuel of 5.8% and saw momentum build throughout the quarter. Our Brands led the way with identical sales growing 10.2%. We believe the unmatched combination of innovation, quality, and value provided by Our Brands is a clear competitive advantage as inflation remains front of mind for many of our customers.\n\nAdjusted EPS was $0.90 for the quarter, an increase of 13% compared to the same quarter last year and ahead of our internal expectations. These results were driven by increased sales of our fuel, disciplined margin management and strong fuel profitability. Our seamless digital ecosystem is critical to building deeper customer loyalty and accelerating market share growth. During the quarter, digital sales grew 8%, led by strength in delivery solutions, which grew by 34%.\n\nWe continue to invest in digital growth initiatives, including the expansion of our Kroger delivery network in new and existing geographies, investments in the customer value proposition via Kroger Boost membership, and the expansion of customer trip missions, including Meal Solutions and Kroger Delivery Now. As a result of these initiatives, we expect our positive momentum in digital sales will continue in the second half of the year. Kroger Health also contributed meaningfully to our second quarter results as we grew the profitability of our core pharmacy business. This allowed us to cycle the impact of higher COVID-19 vaccine revenue from a year ago, which is especially impressive given the number of vacations administered last year.\n\nGross margin was 20.9% of sales for the quarter. The FIFO gross margin rate, excluding fuel, increased 2 basis points compared to the same period last year. This result reflected our ability to effectively manage product cost inflation through strong sourcing practices while helping customers manage their budgets and keeping prices competitive. Our team is doing an outstanding job navigating the current inflationary environment.\n\nWe are experiencing the benefits of a multiyear journey in enterprise sourcing that is delivering significant and sustainable savings for Kroger and our customers. Our personalized pricing strategy is enabling us to maximize the reach and effectiveness of our promotional investments to drive loyalty and deliver value for our customers in ways they value most. Together, this has enabled Kroger to improve our price position relative to our key competitors. Due to continued heightened levels of product cost inflation, we recorded a LIFO charge for the quarter of $148 million compared to $47 million in the prior year.\n\nWe expect inflation will remain at heightened levels in the second half of the year but moderate on a year-over-year basis as we start to cycle the higher inflation, which began in the third quarter last year. Kroger's OG&A rate increased 36 basis points, excluding fuel and adjustment items compared to the same period last year. This increase was driven by investments in associates, higher incentive plan costs and strategic investments in various margin expansion initiatives, partly offset by sales leverage and continued execution of cost savings. We continue to identify opportunities to remove costs from our business without affecting the customer experience and are on track to deliver our fifth consecutive year of $1 billion in cost savings.\n\nAs I mentioned a moment ago, the increase in our OG&A rate during the quarter was unusual as it included an accrual catch-up for higher projected incentive costs covering the first half of the year, as well as strategic investments in a number of margin expansion initiatives that will drive future growth. We would expect to achieve year-over-year improvements in our OG&A rate in the second half of the year and for the full year. Turning now to alternative profits. Kroger Precision Marketing continues to increase its relevance with our CPG partners.\n\nDuring the quarter, we saw an increase in brand reinvestment rates as CPGs experienced strong returns on their marketing spend with KPM. Kroger Personal Finance products and services are also connecting well with customers in the current environment, providing even more ways to save. This includes our KPF credit card featuring an introductory $0.55 off per gallon of fuel and our gift card program, which promotionally offers four times fuel rewards. Fuel remains an important part of our business model and delivered exceptional performance in the second quarter.\n\nAs Rodney mentioned earlier, our fuel rewards program is a key differentiator to help customers stretch their dollars, especially when fuel prices are high. Customers engage with our fuel rewards program at the highest rate since the start of the pandemic during the second quarter, and this helped to ensure our gallon sales outpace the market. The average retail fuel price was $4.62 this quarter compared to $3.13 in the same quarter last year. Our cents per gallon fuel margin was $0.62 compared to $0.39 in the same quarter in 2021.\n\nThe strength of our fuel results is a great example of the flexibility that exists within our business model as higher fuel profit fully offset the higher LIFO charge in the quarter and allowed us to reinvest strategically in a number of margin expansion initiatives. Our associates continue to do an outstanding job executing our strategy and serving our customers, and we are investing in hourly wages to ensure Kroger remains an employer of choice. We're also committed to continuing to invest in our associates and sustainably growing hourly wages. These investments are fully contemplated in our long-term financial model.\n\nDuring the second quarter, we ratified new labor agreements with the UFCW for associates in Houston, Memphis, Lake Charles, Shreveport, Las Vegas clerks and meat, Southern California clerks and meat, and Indianapolis, covering more than 40,000 associates. In the second half, we plan to complete contract negotiations for Chicago, Columbus, Fort Wayne, Toledo, South Bend, and Southern California pharmacists. Turning now to our financial strategy and liquidity. Kroger continues to generate strong free cash flow.\n\nAs a result of our operating performance and working capital improvements over recent years, our net total debt to adjusted EBITDA ratio is now 1.63 compared to our target range of 2.3 to 2.5. Underlying initiatives to improve working capital also helped offset higher inventory balances during the quarter, which were a function of higher product cost inflation and in-stocks returning to pre-pandemic levels. We continue to prioritize capital investments that support our go-to-market strategy and see many opportunities to drive future growth. As we updated in our guidance today, we now expect our range for capital investments for 2022 to be between $3.4 billion and $3.6 billion as various initiatives have been delayed due to supply constraints.\n\nEarlier this quarter, we raised our quarterly dividend by 24%, reflecting our confidence in our long-range plans and our ability to continue to generate strong free cash flow. The quarterly dividend has grown at a 14% compounded annual growth rate since being reinstated in 2006. And this marks the 16th consecutive year of dividend increases. During the quarter, we also repurchased $309 million of shares and year to date have repurchased $975 million of shares.\n\nEarlier today, our board of directors authorized a new $1 billion share repurchase program. I'd now like to share additional color on our outlook for the remainder of the year. The Kroger team's consistent execution of our go-to-market strategy is building momentum in our business, which combined with sustained food-at-home trends gives us the confidence to again raise our full year guidance. We now expect full year identical sales without fuel of 4% to 4.5%, adjusted FIFO operating profit of $4.6 billion to $4.7 billion, and adjusted net earnings per diluted share of $3.95 to $4.05, representing growth of 7% to 10% over 2021.\n\nThis outlook includes a year-over-year headwind from LIFO of approximately $100 million in the second half of 2022. In closing, we have the right go-to-market strategy and are operating from a position of strength. Looking forward, we remain confident in our ability to deliver attractive and sustainable total shareholder returns of 8% to 11% over time. And now, I'll turn it back to Rodney.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThanks, Gary. The Kroger team successfully navigated another quarter in a dynamic operating environment with strong results. As our customers continue to deal with high inflation, our value proposition is resonating with them. And this reflects the balance we've built into our model.\n\nWe have demonstrated the ability to offer customers fresh, affordable food, and the value they need to help them manage their budgets, while we continue to invest in our associates, reinvest in our business and consistently generate strong results. Our performance gives us the confidence that we have the right plan in place to build on our momentum and continue delivering value for all stakeholders. So, with that, Alex, we'll turn it over for questions.\n\nOperator\n\n[Operator instructions] Our first question for today comes from John Heinbockel of Guggenheim. Your line is now open.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nHey, guys. One sort of quickly from -- the improvement you saw in IDs, can you break that out into, you know, traffic and ticket? And then maybe within ticket, right, AUR versus items per basket? And is -- I know nonfood had been a big drag. Is that still a drag? Did that it better at all?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nI'll start on that and let Gary add some more of the details. The biggest part of the drive in improving trends is continued improvement in our loyal household growth and total household of people coming to our stores. We continue to see average transaction size smaller as people come into the store more often and more frequent. We would continue with some headwinds from the nonfood products as well.\n\nGary, any additional insights you want to provide?\n\nGary Millerchip -- Chief Financial Officer\n\nI think you covered most of it, Rodney. As Rodney mentioned, John, we're certainly seeing for our most loyal shoppers continuing to win that first basket, and we're definitely seeing, as we look at our trends, that's holding up very well compared to what we're seeing overall within the market. And for our most loyal customers, as Rodney mentioned, we're seeing that number grow overall and trips also growing with our customer and that most loyal shopper starting to increase the number of trips into the store as well. So, I think they are the key points that I would call out.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYeah. The only other thing that might be helpful insight, John, is it's pretty consistent across the country as well.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nReal quick follow-up then. Nonfuel gross is the best we've seen -- or one of the best we've seen in a while despite the inflation. So, maybe is that mix -- role of mix versus I'm curious if there's a lot of forward bought product that you're benefiting from? Or is that still hard to get?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYes. If you look, one of the things that our teams have done a nice job is on procurement. The other piece would be, as you mentioned, mix. The fresh departments continue to help on mix.\n\nAnd we continue to see a lot of customers continue to add value-added products as well. I don't know Gary, any additional comments?\n\nGary Millerchip -- Chief Financial Officer\n\nYeah, I think you picked up the biggest drivers with sourcing and the benefits. It's not so much forward buying but continuing to be really disciplined, John, with how we look at the designer product and how we're managing relationships with our supply partners as well. One of the areas I would say, specifically in that, that was a tailwind this quarter versus last quarter is the sourcing team and supply chains working really well together to offset the pressure on fuel costs and making sure that we're improving efficiency in the supply chain and operating at optimum levels to really offset that naturally, whereas in the last couple of quarters, supply chain would have been a headwind to gross margin, it was essentially flat this quarter. And that wasn't because fuel costs were not a headwind year over year.\n\nIt was really how we applied our approach to the challenge across sourcing the supply chain to make our operation more efficient.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nThank you.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThanks, John.\n\nOperator\n\nThank you. Our next question comes from Kelly Bania from BMO. Kelly, please go ahead.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nHi. Good morning. Thanks for taking our questions.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nGood morning.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nJust wanted to ask the updated guidance -- good morning. If you could help us understand how fuel is impacting that. I think your prior plan was for a $50 million headwind. I think you just talked about LIFO, which sounds like that's going to be about 150 million higher for the year.\n\nJust trying to think about those puts and takes as it relates to kind of the core flow-through of the higher IEs and how that impacts the back half?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nGary, go ahead and --\n\nGary Millerchip -- Chief Financial Officer\n\nSure. Yeah, absolutely. Good morning, Kelly. Thanks for the question.\n\nYeah, I think you've actually picked on many of the key points. We would be expecting many of the levers that we've been pulling in managing to grow sales and grow customer loyalty and manage the margin performance in the business will be consistent in the back half of the year. The key elements that we called out are what would optically make our EPS growth look less meaningful in the second half. First of all, as you mentioned, our total LIFO charge for the year is about a $250 million headwind for the whole year, which translates to about $100 million, so about $0.10 of EPS impact in the back half of the year.\n\nOn fuel, we haven't changed our view. It feels been very difficult to predict, and we don't want to kind of rely on potential upside in fuel when it really isn't something that we -- while the team does a great job of managing the best in the conditions, we don't lead, obviously, on fuel pricing. Our reward program, which really what drives our strategy we feel. So, we're assuming, as we cycle $0.43 to $0.44 of CPG profit from the back half of last year.\n\nBut if fuel rates more sort of return to normalized levels, then that would be a $50 million to $60 million headwind in the back half of the year. So, there's about $0.16 of EPS headwinds that we have built in today for fuel and the LIFO. Were it not for those two, then essentially our EPS would be sort of in the 6% to 8% growth range very much in line with our TSR. So, we do still expect the underlying profitability of our supermarket business to improve in the back half of the year as we exclude LIFO and fuel.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYes. Just a couple of additional things, and Gary mentioned one of these in his prepared remarks. But, you know, the organization still has incredibly strong cost control, and this will be the fifth year in a row that we've been able to get over $1 billion of cost out. Obviously, that's an important part of that.\n\nAnd we do expect alternative profit to continue to be a little strong, a little bit stronger in the second half of the year as the first half of the year as well.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nOK. That's very helpful. And just a follow-up with digital. So, growth of 8%.\n\nI think that brings it about flat in the first half. Just wondering if you could help us understand how that compares to your expectation and how -- really, how Ocado is ramping within that? I see here this 34% growth in delivery sales. But just are you on pace with the ramp of Ocado and just about your goal in terms of doubling digital sales? How do you feel about that today?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYeah. If you look, you know, the thing that I think is always important is Ocado is one part of our overall digital strategy. And the thing that we're wanting to make sure that we have is a seamless ecosystem where customers can easily go between delivery, pickup and shopping in stores. And what we find is, by far, the majority of the people that -- customers that stop engaging with us on pickup come back into store and we capture that in-store versus delivery.\n\nSo, when you look at the overall seamless system, we're really focused on how do we -- and that's one of the reasons we introduced Boost, is how do we have that total loyalty across all the engagements with the customer. If you look at -- the thing that I'm super proud of our teams on the sheds that as we open them in the spoke is our net promoter score from those continue to be world-class and incredibly strong. And that business -- and the customer continues to engage more frequently with us there. And overall, I'm pleased with the results, but we still obviously have plenty of work to do.\n\nI don't know, Gary, anything else you want to add to the question?\n\nGary Millerchip -- Chief Financial Officer\n\nYeah. Thanks, Rodney. Just a couple of things. Overall, I would say, Kelly, we're pleased with the progress that we saw in the quarter.\n\nAs you heard me mention in my prepared comments, we're certainly starting to see some traction on some of the key initiatives that we've been investing in, whether it's the customer fulfillment centers that are powered by Ocado in both new and existing markets, the launch of Boost. And as Boost continues to ramp up, we see about 25% of customers that sign up for Boost are completely new to digital. So, that's a really good driver of the digital business as well. And then we're still in the early infancy stages of some of those convenience trip missions that I mentioned, whether it's Kroger Delivery now with our partnership with Instacart, where products can be delivered smaller baskets within 30 minutes; and also the meal solutions, things like sushi and floral.\n\nSo, a lot of really exciting developments and activities that we're focused on, and we saw some good momentum in those areas coming through, which is why we also shared in my prepared comments that we'd expect the momentum to continue in the back half of the year. I think the only other comment I would make is that we are taking a step back certainly to figure out what is the overall market digital growth is likely to look like this year because Rodney mentioned during his prepared comments that we're building a seamless ecosystem for the customer and what we're seeing in customers are moving between the channels and making the decisions of where they shop. And ultimately, we want to make sure the customer will go to Kroger and they're choosing to shop through the store or pickup or delivery, whatever works for them. And we certainly have certain assumptions around how we thought the digital market will grow this year, and we've sort of taken a step back as we look at the back half of the year and really sort of assess how we think the market overall is growing.\n\nBut our focus is really on making sure that seamless ecosystem is winning the customers' loyalty overall, whichever channel they choose to shop through.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThanks, Kelly.\n\nOperator\n\nThank you. Our next question comes from Spencer Hanus from Wolfe Research. Spencer, your line is open.\n\nSpencer Hanus -- Wolfe Research -- Analyst\n\nGood morning. Thanks for the question. I just wanted to talk about the price gaps for a minute. Could you talk about how comfortable you are with where you're trending today? And have you noticed any change in your ability to pass through price increases as some of your peers have been a bit more rational on that front?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYeah, if you look overall, we continue to be satisfied, you know, with inflation and the pass-through. You know, as Gary and I both mentioned, we're doing everything we can to minimize those increases and do it in a way that helps the customer in any way we can. And when you look at the total value proposition, we feel very good. When you look at fuel rewards, as I mentioned, we had 600,000 incremental households engaging in fuel rewards and record redemption from customers as well.\n\nSo, overall, we're doing -- I feel very good about the ability to balance all the pieces and minimize the impact on the customer as much as we can. We feel very comfortable with our price gaps. And, you know, price gaps is with a multiple of different competitors is something that we track on an ongoing basis. And we feel good about the everyday price gap.\n\nAnd as you know, we get great feedback from customers on our promotional approach and customers really appreciate the promotional values that we offer as well to allow customers to stock up on items they use the most. And we are very focused on using our data to make sure our offers are personalized for each household individually and discounts that just apply to them. And that's probably part of what's driving the fact that we had 750 million coupons downloaded as well.\n\nSpencer Hanus -- Wolfe Research -- Analyst\n\nGot it. That's helpful. And then just to go back to Ocado for a minute. What are you seeing from the facilities that are located in the new geographies versus your existing markets? And as we think about the profitability of these sheds, any updated view on when we'll get to breakeven EBITDA there?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYeah, I'll answer the first part of that and let Gary answer the second part of your question, Spencer. We continue to ramp up. And the ramp in new markets would be among some of the best for sheds across the Ocado network. And as I mentioned before, the NPS scores are outstanding, a world-class or whatever positive you want to assign to them.\n\nAnd as customers engage with us with our Boost membership or our membership programs, that's causing them to even be more loyal as well. In terms of the financial side, Gary, I'll let --\n\nGary Millerchip -- Chief Financial Officer\n\nSure. Yeah. Thanks, Rodney. I wouldn't say, Spencer, if there's anything dramatically changed in our view that we shared previously around how we think about the CFCs powered by Ocado maturing over time.\n\nI think, as Rodney mentioned, we've certainly been pleased with what we're seeing with customer connection and sales trends. And when we think about the net promoter score and the value that we're offering, we're seeing that the gross margin profile, if you like, of that customer and also the growth that we have expected is very much in line with what we have originally envisaged. As you know, I think one of the key things for us with the big facilities is it is a four- to five-year journey as you're building to maturity and building to scale. And so there are some elements of that, that until you kind of understand what the customer density looks like at scale, we're still figuring out some of that operational efficiency in the model.\n\nSo, there's nothing really new I would call out, but we continue to work on building that full picture. And as you know, in the first two facilities, we're only 18 months really in that journey of a four-year journey overall to get to capacity. But generally, I'd say still consistent with what we shared previously.\n\nSpencer Hanus -- Wolfe Research -- Analyst\n\nGot it. Got it. Thank you.\n\nGary Millerchip -- Chief Financial Officer\n\nYeah.\n\nOperator\n\nThank you. Our next question comes from Michael Lasser of UBS. Michael, your line is now open.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning. Thanks a lot for taking my questions.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nGood morning.\n\nMichael Lasser -- UBS -- Analyst\n\nThere was about a 50 basis-point acceleration in your three-year geometric stack. Was that all driven by an acceleration in inflation from the first to the second quarter? And it looks like your guidance implies that you're expecting your IDs to go back to that high 5% run rate in the second half of the year on the same three-year geometric stack basis. So, would that also imply that you're expecting the lower contribution from inflation in the back half of the year?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYeah. Part of it, Michael, is we're starting to cycle higher inflation a year ago. So, it's really -- we do not expect inflation on inflation to be as high. So, it's really driven by the cycling of where we were a year ago.\n\nAnd as you would recall, as we get later in the year, inflation ramped up very aggressively in the back half of last year. We expect the business to continue to stay strong and continue to make strong progress. We just don't expect the inflation to be quite as high as it was. The first part of your question, Gary, you may have been able to just -- yeah, you're kind of working in and out, so --\n\nGary Millerchip -- Chief Financial Officer\n\nYes. Michael, I think we tend not to look at it specifically in the way that you're describing at that three-year view. But I would say that overall, we think about our progress in the second quarter, we believe we were able to accelerate our growth relative to Q1 compared to the market. So, we felt that from everything you could see, we were able to win customers and to change trajectory versus how the market was moving from Q1 to Q2.\n\nSo, we feel very positive about the momentum that we saw in the business in Q2. And as Rodney mentioned, we believe that momentum will continue in the back half of the year, but we are expecting, while inflation will remain at heightened levels, we think it will start to taper out because with the cycling, call it, 4% higher inflation in the back half of last year compared to the first half of last year. So, even if inflation does continue to grow, you're cycling about 4% higher inflation rate from the prior year. And we are starting to see a little bit of data that would say, you know, it's really hard to predict, and none of us had our perfect crystal ball.\n\nBut if you look at the growth in cost inflation from Q1 to Q2, it would be less than the growth that we saw in Q4 last year to Q1 this year. And some of the forward-looking futures data on some of the key commodities are starting to show a little bit of signs that things may be leveling off somewhat. So, obviously, there's been plenty of shocks in the last 12 months that can change that very quickly. But the data points that we can see right now, we think it's appropriate to forecast and provide guidance that it seems slightly tapering to the inflation rate in the back half of the year.\n\nMichael Lasser -- UBS -- Analyst\n\nOK. Thank you very much. My follow-up question is, Kroger's been pretty nimble in managing its FIFO gross margin, as was evidenced by this quarter. Was some of that due to the ability to pass along price increases a little faster than you're getting the price increases passed along from your vendor community? And it does seem like some consumable retailers are announcing that they're going to make sizable price investments in the back half of the year.\n\nSo, how does that influence your view of the ability to sustain this FIFO gross margin performance over the next couple of quarters?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYeah. Well, obviously, all -- everything that you asked would have been reflected in our guidance for the balance of the year. We would -- most CPGs, you know well in advance of cost increases, so you're balancing the actual getting the cost increase along with what you pass through to customers. Obviously, you are -- on a weekly basis, you're looking at what pricing, where you are on spreads, better or worse than your competitors.\n\nAnd the other thing that I think it's always important to remember a customer that shops at Kroger, there's personalized rewards that are individualized for each household that the market would never see. And that's something that's incredibly valuable for our customers in addition to our fuel rewards and other pieces. So, I think you really have to look at the total value proposition.\n\nGary Millerchip -- Chief Financial Officer\n\nYeah. Maybe just to add, Rodney, I think, Michael, from the perspective of how we manage gross margin, I think of it much more of a -- you know, we're not trying to manage to a number every quarter. Obviously, we're managing it more long term and there's lots of moving parts that we manage. The tailwinds would be the work we do in sourcing, the mix improvements through fresh growing and Our Brands growing and new innovation products.\n\nAnd of course, things like alternative profit streams adding to that model as well. So, we're still investing in the customer. But from our perspective, we feel very good about our ability to manage the model through the evolving environment. And overall, again, if you look at our rolling 12 months of gross margin, it's probably in that sort of 10 to 20 basis points of investment.\n\nAnd I think that's what we shared at the beginning of the year where we expect it to be. So, we are delivering, we believe, on the plan that we shared.\n\nMichael Lasser -- UBS -- Analyst\n\nThank you very much and good luck.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThanks, Michael.\n\nOperator\n\nThank you, Michael. Our next question comes from Simeon Gutman from Morgan Stanley. Simeon, your line is now open.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nHi, everyone. Thanks for the question. My question is on the consumer to diagnose some of the changes we're seeing. It looks like there was some trade down brewing across all of consumer.\n\nAnd you mentioned that, you know, your business picked up from June throughout the quarter. So, when we talk about you're seeing a level of either trading down or movement to private brands you heard in the level, is it stabilizing? Did it fall inside with gasoline prices leveling off? And is it somewhere back to getting stronger now? Or would this --\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nIf you look at customer behavior, you know, they're telling us they're modifying behavior more so outside of the grocery store than with us. Now, the movement to Our Brands, what we always find is customers do it initially to save a little bit of money, but they fall in love with the product. So, part of the continued acceleration of growth in Our Brands is driven by the value, but part of it is just the quality of, you know, the product. And that's been something that's been a long-term trend, not just a current trend.\n\nThe customers -- you know, it's one of the reasons why we're so proud of our overall offering is customers can move between different types of product. But we still see customers engaging in things that are fresh, healthy, those aspects as well. So, we're going to be there forever how the customer wants and needs us to be, and we're going to be very agile as well.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nAbbreviated follow-up is inflation. It sounds like we're not quantifying what the absolute level is. You all know we're going to see a moderation in the second half. Let's just say you're running in line with CPI for food and home.\n\nCould that actually get cut in half in the back half of the year? Is it going to be more moderate? And then in terms of elasticity, does it actually behave that quickly where you're seeing units for volume actually respond and go back up, so we're in the same place anyway?\n\nGary Millerchip -- Chief Financial Officer\n\nYes. I mean, I think from what we see, we wouldn't expect it to be that dramatic a change. As I mentioned, I think we would expect there to be some flattening out of inflation in the back half of the year, but there's nothing that we see right now that would cause us to believe there's going to be a dramatic change in the level of inflation in the back half of the year. And from our perspective, I think it probably ties back to Rodney's earlier comment, we feel that we're monitoring and using our data very closely to adapt as to how customers change behavior.\n\nAnd we believe through the combination of fuel rewards, through the Our Brands portfolio of products that we offer and through the pricing and promotional offers that we have, we've got a very strong sort of portfolio of plans to be able to adapt until the customer adapts.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThanks, Simeon.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Kenneth Goldman of J.P. Morgan Chase. Kenneth, your line is now open.\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nHi. Thank you. I was curious, you mentioned Home Chef. Were there any other categories or broader departments where your brands were maybe surprisingly strong this quarter? I would assume the usual suspect, you know, milk and sow were healthy.\n\nBut were there others where the -- I guess the share shift was bigger than you might typically see in this kind of environment?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYes. It's a great question, Ken. And it's really broad-based. And the banner brand, I wouldn't say it's a surprise, but the banner brand continues to gain solid share.\n\nBut even if you look at like private selection, which has a lot of unique and new products, the growth there continued to be strong as well. So, it was very broad-based across really the whole store.\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thank you. And then on the higher OG&A this quarter, you called out a few reasons for, and thank you for that. One of them was a onetime accrual catch-up.\n\nCan you give us a sense -- I don't think I heard how big that catch-up was? And then on the margin expansion initiatives, I recognize it's an ongoing process. But just in light of where the OG&A came in, were there any new initiatives launched? Is there anything that we should think about that may be unique that we haven't necessarily heard about yet, or just is more of the ongoing process that you have?\n\nGary Millerchip -- Chief Financial Officer\n\nYeah. Thanks, Ken. I think what I would say is overall, if you think about there's probably three pieces that impacted OG&A materially during the quarter. The one you mentioned, which was the true-up for the first half of the year on our incentive calculation based on our improved performance, we calculate what the plan would be for the year.\n\nAnd so, we have to catch up for the first two quarters in the year. Secondly, as you mentioned, we invested in some strategic initiatives that we believe will accelerate growth as we look into '23 and beyond in particular, and I'll come back to that in a second. The third would be, we were cycling one or two items that were sort of timing were particularly strong in Q2 last year. So, when you add those three things together and sort of remove them from the number, we would have achieved an improvement in the OG&A rate during the quarter, which is why we kind of guided you to when we take out those three factors, which wouldn't repeat in our view for the rest of the year, but we would expect overall for the rest of the year to see OG&A rate improvement.\n\nIt's probably fairly flat in Q3, but likely to be meaningfully better than that in Q4 is how we would think about it. And I wouldn't want to get into maybe breaking down the digital because we typically don't do that. But I would just say that all three of those together will really what caused the increase in the rates. As regards to the new initiatives, I think it is more of what you've seen before.\n\nIt's more just that as we look at how the customer is changing and our business model continues to evolve. We identified two or three areas where we think there are opportunities to accelerate. And an example would be in shrink and investing in some new capabilities to be able to continue to improve shrink performance as we look out for the forecast for our model on shrink and that, of course, helps gross margin as well. And then I mentioned earlier, but we're really pleased with the progress that we made in health and wellness during the quarter, and we made some strategic investments in the health and wellness space where we believe there's an opportunity for us to continue to drive profitable growth, not only in the second half of this year as we cycle the vaccines for last year but also beyond in 2022 and 2024.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThanks, Ken.\n\nOperator\n\nThank you. Our next question comes from Robert Moskow from Credit Suisse. Robert, your line is now open.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nHi. Thank you for the question. I wonder if you could give a little more color on the Smart brands initiative. Is it providing anything new to the consumer in terms of opening price points, like lower price points than before? Or you're really just consolidating several of your sub-brands to make it a little easier to shop? And then I just had a quick follow-up.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThe majority is consolidating the sub-brands, just making it easier to shop. Those items are always great value for the money. The other thing that there would be incremental items introduced under the Smart Way brand in terms of just the absolute number of SKUs. So, it's really a combination of introducing some new items and consolidating several sub-brands and making it easier for customers to shop.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nOK. And then a follow-up on capex, you're not the first to lower capex guidance among consumer goods companies. And it all -- it usually seems to be because of project delays. But I imagine volume is less than what you had expected this year because the pricing is so high.\n\nSo, is there any correlation here between like a lower volume environment in an inflationary cycle and what your capex plans might be for the next couple of years?\n\nGary Millerchip -- Chief Financial Officer\n\nI wouldn't say, Rob, it really changes our view of the opportunity ahead of us. As you know, we've laid out a clear plan at our investor day in March, and we still feel really confident in both the growth model that we outlined and where we believe the strategic investments will make sense across the supply chain, across our store portfolio and obviously continue to invest in digital. So, I wouldn't read into it that we're any less excited or have less confidence in those plans. It's far more the former point that you made.\n\nBut when we look at some of the short-term supply challenges, when we look at some of the costs in the market in the short term, it just made more sense in our view to balance that plan and to adjust the schedule. So, it would be far more in that camp than the other.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nThanks, Gary.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThanks, Robert.\n\nOperator\n\nThank you. Our next question comes from Paul Lejuez from Citigroup. Paul, your line is now open.\n\nBrandon Cheatham -- Citi -- Analyst\n\nHey, everyone. This is Brandon Cheatham on for Paul. Thanks for taking our question. I was wondering if you could help us a little bit on the fuel margin cents per gallon were very strong in the quarter, but it sounds like you expect fuel to be a headwind in the second half.\n\nSo, can you help us, how much of the fuel margin was driven kind of by internal initiatives or external market forces that I guess you're not expecting to repeat in the second half? Thanks.\n\nGary Millerchip -- Chief Financial Officer\n\nSure. Yeah. Overall, our team did a fantastic job in managing fuel margins. And as I think you probably know, we -- our goal is to make sure we're very competitive on price, and then we give significant value back to our customers via our fuel rewards program that flows through our supermarket gross margin, not through that fuel P&L that we share -- the metrics that we shared on the call.\n\nSo, overall, last quarter would certainly have been some great work by our team in capturing value wherever they go through sourcing of fuel and how we promoted and drove engagement with customers. But a lot of it is also just to do with the volatility in the market and as prices were changing in the fuel market, which I think has been seen across the industry. So, as we look forward, we believe we have a clear strategy around delivering great value for the customer, making sure we're sourcing the product really effectively, optimizing the reward program. Our view at some point is that fuel margins sort of normalize, and we don't think it's prudent for us to predict these extremely high unusual levels of profitability.\n\nSo, I wouldn't say we have perfect insight into what will happen to fuel margins in the back half of the year. We think it's prudent to bring them back to more of what we thought would be a normal rate at the beginning of the year. If it turns out that there is significantly greater margins on fuel then, of course, that would impact our outcome for the rest of the year. But we think it would be not prudent for us to be forecasting that.\n\nThat's really how we think about the rest of the year.\n\nBrandon Cheatham -- Citi -- Analyst\n\nGot it. That's helpful. And a quick follow-up. I was just wondering, you know, if you could break out price inflation, how much that drove ID sales in the quarter? And how much of that was offset by units? I assume, declined, you know, slightly in the quarter.\n\nThank you.\n\nGary Millerchip -- Chief Financial Officer\n\nYeah. I think just a bit of color maybe to the last comment, we mentioned on this one would be that our sales growth was higher than the increase that we saw from Q1 to Q2. It was higher than the increase we saw in cost inflation. So, overall, we're pleased with the trajectory in our growth.\n\nAnd we believe compared to the market, we were able to improve our trajectory Q2 versus Q1 compared to how the market overall performed.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThanks, Brandon, for the question. The other thing I think is important that I mentioned earlier is that we had household growth overall and loyal household growth as well, which is always important for the future.\n\nRob Quast -- Director, Investor Relations\n\nAlex, we have time for one more question.\n\nOperator\n\nThank you. Our final question comes from Rupesh Parikh from Oppenheimer. Rupesh, your line is now open.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGood morning. Thanks for taking my question. So, maybe just a follow-up to the prior question. Just any perspective just on market share? It sounds like your gap versus peers may have narrowed this quarter, but just any thoughts on the performance this quarter and then, you know, how you're looking at that for the balance of the year?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYeah. The gap has continued to narrow, and it's narrowed during the quarter as well. And if you look at it for the balance of the year, our teams would expect to continue to make progress and really proud of where we are. And we think the overall value for the customer and the overall seamless experience and focus on fresh continues to accelerate, and the customer continues to reward us for that as well.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nOK, great. And then one follow-up question, just on capex as well. So, this year, capex, is, you know, pretty significantly below your prior plan. Do you believe we could be in a period of just lower sustained Do spend just given some of the headwinds out there?\n\nGary Millerchip -- Chief Financial Officer\n\nI think, Rupesh, like I mentioned earlier, we feel very good about the plans we have to achieve our long term -- or our overall TSR model around the growth that we've shared around growing earnings at 3% to 5% and our TSR at 8% to 11%. And we've got, I think, some very clear capital expenditure plans that we believe will allow us to drive that sustained growth. So, I think we are being deliberate in the short term about making sure the -- if the pricing of certain supplies and products just would change their return materially, then we're adjusting our timing there. And there are some challenges just around labor and raw materials and getting the plans executed in the time scale that we'd originally envisaged.\n\nBut I don't think for us, we look at the announcements that we made this morning on our latest forecast of capex as being less excited about the prospects of investing in the business for growth. I think it's more of a function of just some of the short-term headwinds for us.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGreat. Thank you.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThanks, Rupesh. Thanks. Thank you, everyone, for joining us today. And as you know, I always like to share a few comments directly with our associates listening as well.\n\nWe are so proud of everything that everyone's achieved in this half of the year. Our outstanding associates continue to provide a world-class customer experience. And thank you directly on behalf of everyone for everything that you do for our community, our customers, and each other every day. I'd also like to take a moment to recognize our Louisville and Delta divisions and our manufacturing and distribution teams who responded immediately to help in the aftermath of a devastating flood in Eastern Kentucky and a water shortage in Jackson, Mississippi.\n\nOur store, manufacturing, and distribution teams went to work to offer company and customer donations of supplies and funds and delivered more than 55,000 gallons of freshwater to both communities when they needed it. A huge thank you for stepping up to support our neighbors when they needed it the most. I also want to congratulate our stores once again on achieving 100% execution of our Zero Hunger Zero Waste food rescue. Your efforts provide healthy food directly to our neighbors who need it the most.\n\nThank you for your commitment to creating and supporting communities free from hunger and waste. Thanks to everyone again for joining us today. That concludes our second quarter earnings call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRob Quast -- Director, Investor Relations\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nGary Millerchip -- Chief Financial Officer\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nSpencer Hanus -- Wolfe Research -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nBrandon Cheatham -- Citi -- Analyst\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nMore KR analysis\n\nAll earnings call transcripts"
}